{"name": "siena-tavern-chicago", "reviews": [{"review": {"des": "I'm happy to say that after my last review of Siena Tavern and concern over food quality, the General Manager reached out and kindly offered to be his guest to 'right the wrong' so to speak. My husband and I went again last Saturday and enjoyed a wonderful meal with again incredible service and this time the food was just wonderful!<br><br>Thank you Siena Tavern for a wonderful dining experience for showing being sure your customers have a great dining  experience every time!", "pics": null}}, {"review": {"des": "I need to start eating more than lunch here because if lunch is this good, dinner must be worth trying! <br>The red sangria has a nice flavor with lots of fruit. The grilled octopus is some of the best in the city. All of it was tender, not just the smaller pieces. The flavor was great and I wish we had some bread for the spicy juice. <br>The farro risotto with rock shrimp was a killer. A must order. <br><br>Finally had dinner and it was a winner. Of course we had to start with the octopus. We need to get bread for the juice!<br>For entrees we had the pappardelle with a meat sauce and the tortellini with butternut squash. <br>The peanut butter gelato was a hit with me and my wife liked the strawberry sorbet. <br>In the evening the room is loud and we had to lean in to talk. <br>Our server, Andrew, was very attentive.", "pics": null}}, {"review": {"des": "The food was amazing as well as the service. Loved it so much we went back for a second round the following day. My wife and I were visiting for the weekend. We got lucky and found a spot at the bar the first night. Chad was our bartender. He was awesome. We sat back at the bar the second time just so we could order from him again. Great service and really nice guy. Highly recommend the burrata, grilled octopus, shaved Parmesan Brussel sprouts, the pear and prosciutto pizza, and the squash soup. Great place and will definitely return on our next trip. <br><br>Highly recommend reservations but try the bar and ask for Chad.", "pics": null}}, {"review": {"des": "In my book, the food was amazing. Our server was just okay, seemingly very busy on a Monday and didn't have time for much small talk.<br><br>The two bottles of wine we ordered ended up being out in the back, so we got recommendations to order others that were slightly nicer. Okay no problem.<br><br>We ordered the burrata and another app they're known for. I thought the burrata was delicious. I then got the oysters and the brussel sprout salad.<br>Another person got the chicken after being really sold to on it by our server. She was not impressed, but, I didn't try it. The squash pasta was also ordered and quite tasty. <br><br>For dessert, we got the caramel cookie dessert and the monkey bread. Both were very good and rich.", "pics": null}}, {"review": {"des": "After talking with a friend about how our reviews were all big paragraphs, she mentioned that the ones that are sectioned off are usually the ones she likes to read, so in her honor, here it goes (but also is there a point if its all almost pretty much 5/5?!)<br><br>Food 5/5<br>All four of us sat down and had a hard time deciding what to order because everything sounded good. We had the waitress tell us about her suggestions and the most popular items, but that just made it even harder to decide!! I ordered the scallops and my friends got the squid ink linguine, spaghetti, and brick chicken diavolo. We also got the cocoli as an appetizer. <br><br>I got a taste of all three my friends got. I'd say my favorite out the three was the chicken. It seems basic, but the chicken was just perfect - so juicy, moist, tender, and flavorful. The linguine came with lobster and the spaghetti with crab - both absolutely delicious. With all that being said, the scallops were perfection. The bottom of the plate was smothered in what I believe to be squash puree, topped with the scallops and cauliflower. The scallops were large and seared just right. To be the cauliflower were a tad bland and could have used a touch more of flavor. <br><br>Service 5/5<br>Our waitress was beyond patient - she checked in on us three times before we were ready to order, she went through the entire menu giving us one or two favorites from each section, and answered our many questions. Our waters were never empty and she was quick without making us feel rushed. <br><br>Ambiance 4.5/5<br>The lights are dim here giving it a romantic vibe, but it's also casual. Even on a week day, it was packed! It's pretty loud here, but if it's warm enough you can always opt for patio seating!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/J8OgRj4MJfeNoYbUwWzqig/348s.jpg", "caption": "Spaghetti"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/o6d2uavNfc47pwU9G2XOcw/168s.jpg", "caption": "Brick Chicken Diavolo"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KccVQ4DO5-rSiKO1elEprw/168s.jpg", "caption": "Squid Ink Linguine"}]}}, {"review": {"des": "Made reservations for this place prior to seeing a show at the House of Blues and so happy we did! Th restaurant is beautiful, service was great and the food! <br><br>We had the prosciutto, sausage, and Brussel sprout pizza that had garlic, charred corn, fingerling potato's, and truffle oil. Just typing this makes me want it all over again! We also had the pan seared scallops which were cooked perfectly and were bursting with flavor! <br><br>I like to try something new since there are so many great restaurants in River North but this one is def going on my list of favs!", "pics": null}}, {"review": {"des": "Trendy, eclectic, and a good excuse to get out for a flavorful meal if you ask me! Plus the wine list is not your average - they seem to carefully select reasonably priced Italian Coastal wines that pair well with their main meals. <br><br>I will say when it comes to Italian food, I am extra fussy because I grew up on the real deal homemade from scratch Italian but Sienna Tavern has this Savory Holy Heaven 12oz (no, that's not a typo) Wagu Meatball ($19) that's worth all the indulgence! It's considered an appetizer but if not shared, it can easily become your only dish! Go ahead, you deserve it!! <br><br>Also while it's not a \"Chicago style pizza\" contender, it's a lovely light doughy crust with pretty much any topping you could desire and not too cheesy. Pretty much can't go wrong and the kitchen serves pizza til midnight y'all! <br><br>The bartenders and waitstaff are the epitome of Midwestern Hospitality and have clearly consumed if not all, definitely most of the menu so you can count on their recommendations if you are unsure.<br><br>Know that no matter when you go, it's likely to be buzzing with River North's young professionals and a smattering of tourists sent over by wise hotel concierges. Good chance you will have to wait a bit to be seated. Having said that, on a nice sunny day, brunch on the patio is super chill vibe but feels disconnected from the energy inside... however a seat at the bar near the pizza oven is actually my preference because it puts you in a great spot for watching all the scrumptious dishes being prepped to tease your tastebuds! <br><br>My reviews are all about the ENTIRE experience. Only downside is sitting at either bar (they have two) equates to thirsty patrons hovering over your food like vultures (I like my personal space bubble when I'm eating lol) and possibly stealing your bread baskets or taking an elbow as they attempt to hail down bar service! No joke! Scram kids. This is the 3rd time this has happened to me here. At least the bread is free right?<br><br>Kinda not what you want when you are spending $50+ to treat yourself and you gotta put up with that ish! Oh one last thing: please install under bar hooks for bags & scarves please & thank you.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/w5ums4NFyk4hhiWTwWg9KA/348s.jpg", "caption": "Malbec & Pizza kinda night..."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1M-aifuOACvmjq9rxJB10A/168s.jpg", "caption": "It's for the crudo... bread baskets come separately:)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jOV-UL7SYGnugHCepWWxLg/168s.jpg", "caption": "Daily specials above the pizza oven..."}]}}, {"review": {"des": "I truly appreciate restaurants like Siena Tavern who takes the term pet friendly to another level. I don't often travel with my dog but when I do I like to take him out and about with me. I called a head to make sure that their patio was open and informed them that I had my pooch with me. When I arrived there was some miscommunication between the hostess and the person who spoke on the phone with me but after waiting a few minutes they were able to set a table for me and asked if I was interested in their doggie menu for my pooch. We opted for the skirt steak for the little one. It was simply grilled with olive oil.<br><br>I opted for their Margherita Pizza which had a great sauce, which had the right balance of sweetness. The crust was flavourful, chewy but crispy on the outside just the way I like it. The cheese wasn't too over powering. It was a great pizza but nothing mind blowing. <br>My husband opted for their lobster roll. This was the cold roll variation with citrus poached lobster lightly tossed with an herb mayo. This was a light dish perfect for a light lunch. The citrus poached lobster gives it a light vibrant feel to its traditional heavily drenched mayo cold lobster roll. The plus was the accompaniment of Parmesan fries, they were delicious. I also had their beet juice to quench my thirst, nothing really special to this just a simple ordinary glass of beer juice. <br><br>I will definitely have to give this restaurant another visit without the pooch and try out everything else on their lunch, dinner and BRUNCH menu! I would love to enjoy the dining experience in their dining room as it had an amazing decor especially when lit up in the evening. <br><br>I would like to thank the servers and staff who made my trip with my pooch so memorable. I can't wait for my next trip!", "pics": null}}, {"review": {"des": "Make a reservation if you want a table because it can get super packed. Otherwise, sit at the bar with Chad for awesome service. We came twice during our stay in Chicago from how good it was. <br>The food here is incredibly delicious and the environment is casual, trendy, and with an awesome vibe. We had the pear & prosciutto pizza, brussel sprouts, butternut squash soup (AMAZING), grilled octopus, burrata with tomato jam, cookie jar, & tiramisu gelato. All of it was delicious. <br>Will definitely come again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0yvKoHR7CJBAPJ2flp5jhw/348s.jpg", "caption": "Tiramisu Gelato"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2tcJEDHwer-nBb8f5tUK_w/168s.jpg", "caption": "Try this Butternut Squash Soup soup!! Its incredible!"}]}}, {"review": {"des": "We were fortunate to attend the priviate VIP Peroni map release party.<br><br>Delicious Italian bites were served along with specialty Peroni cocktails.<br><br> Siena Tavern is open 7 days a week. They offer a full lunch, dinner and brunch menu.  <br><br>Homemade pasta, pizza, cocolli, everything for lunch or dinner.<br><br>The food is delicious!  The problem, it's impossible to eat here without a reservation, prices seem high, its too noisy.  It's also too crowded, almost impossible to get a drink at the bar.<br><br>My suggestion, come early, grab a drink and an early dinner.", "pics": null}}, {"review": {"des": "Very good food! A block up from riverwalk.  Casual vibe. Super attentive service.  Delicious mushroom tagliatelle pasta w/ truffle oil. Rich,  homemade,  decadent,  earthy... super yum! <br><br>Scallops were good.  Not mind blowing though.  The accompanying mushrooms and greens were a little too salty (and I love salt!).<br><br>Hearts of palm salad was fresh, tasty, a bit spicy,  a little too vinegary, but tasty.  <br><br>Great meal. Highly recommend the tagliatelle pasta! Kudos to our bus boy who refilled my water glass about 6 times!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7TiuIJ-5_oJwe7IHx45TAw/348s.jpg", "caption": "Delicious mushroom tagliatelle homemade pasta with truffle oil!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RTs6h5WQ58N-xN0-oL2r4g/168s.jpg", "caption": "Scallops!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RoEUWWmnxxu5_na9g4nTtg/168s.jpg", "caption": "Hearts of palm salad.  Great components-- pistachios, hearts of palm,  avocado,  orange slices... a bit too vinegary though."}]}}, {"review": {"des": "Came here on a Wednesday night for a work-related dinner.  It was packed!  A friend and I arrived early, so we went to grab a drink at the bar, which was also quite crowded.  Luckily, we were able to get the bartender's attention and get some drinks quickly.  Even more luckily, people near us soon left, so we were at least able to have standing space at the bar.  It was loud, but that's expected at a bar.<br><br>Slightly more problematic was how loud it still was when we sat down for dinner.  I could barely hear anyone at the table, even though we were practically shouting.  Everything else about the experience was really good.<br><br>Service was especially good.  The server overheard me mentioning to my colleague that I don't eat dairy (it's not an allergy, so I wasn't going to raise it with him because that makes me crazy when people \"fake\" allergies) and he was great about walking me through his recommendations about which menu items wouldn't suffer by leaving out the cheese (obviously I knew to just avoid cream-based sauces).  And his recommendations did not disappoint!  I sampled the meatballs, octopus and some prosciutto from the table's appetizers and had the chicken diavlo for dinner.  <br><br>The chicken itself was really good - not at all overcooked - very juicy.  It's a whole half of a chicken, so you get your choice of whether to start with dark meat or light.  The true standout, however, were the potatoes.  Wow.  i could have just eaten those.  The perfect amount of crispy on the outside and soft on the inside.  And when drenched in the chicken drippings/sauce... wow.  Mine were without the parmesan and, honestly, I didn't miss it one bit.  <br><br>I skipped dessert, but others at my table really enjoyed the gelato.", "pics": null}}, {"review": {"des": "Customers service  its beyond great !!!<br>Fracking Amazing !!!<br><br>Ohhhhh and the food is just unbelievable  !‍.<br><br> If you live in chicago and didn't  try the food you are missing !!!", "pics": null}}, {"review": {"des": "It is definitely good food, friendly service, pleasant atmosphere, and decor. Enjoyed butternut squash soup, and gnocchi. Generally speaking, good pastas, and pizza is not bad either. Very decent wine list. The prices are slightly too high though to give 5 star rating.", "pics": null}}, {"review": {"des": "Late post! My husband and I dinner at sienna tavern Saturday, September 15th for dinner. We originally had plans to eat @ Rick Bayless restaurant, topolobombo but the restaurant was fully committed for the evening. After walking around the area trying to figure out where to eat we decided to eat @ sienna tavern. Although seating resevations was full,  the hostess offered to seat us @ the bar. <br><br>The are 2 bar areas. We chose to sit at the bar near the wood fire oven. Our lady server/bartender was so nice (wish I could remember her name!!! Blonde hair) <br><br>I ordered squid ink pasta and my husband ordered a short rib entree.  For dessert in ordered their cookies and a brownie.  I asked the server thi swap out the chocolate sauce for caramel sauce. All of our food was delicious & cooked to perfection!!! I wanted to lick my plate that's how good it was <br><br>The vibe of the restaurant is nice.  It wasn't overly loud when you can't hear each other speaking. We sat next to some ladies who were eating @ the bar. We stuck a wonderful conversation! They liked what I order, so one of them ordered the squid ink pasta.  They let us try their mushroom truffle pizza.  O.M.G. it's delicious. You've to come eat @ sienna tavern.<br><br>I can't wait to go back to sienna tavern!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xmRVF26a2MKJDoNDSAXQbQ/168s.jpg", "caption": "Brownie with caramel sauce. I asked the server to swap out the chocolate sauce for caramel..Damn.Delicious!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GuEiQBmg8kOX9CHqXH-GPw/168s.jpg", "caption": "Squid ink pasta!"}]}}, {"review": {"des": "I died and went to heaven after this meal.<br><br>FOOD:<br>-- Truffle Mushroom Pizza: 5/5. The crust. The smell of the truffle. We shared this as an app. If you want a pizza, get this one.<br>-- Tagliatelle: 5/5. BEST PASTA EVER. The fresh pasta was thin and right consistency. Very rich dish. The foraged mushrooms were delectable. Highly recommend this dish.<br>-- Squid Ink Linguine: 5/5. They don't skimp on the lobster yo. Seafoody taste. Not too salty. Pasta was perfect.<br>-- Spinach Cavatelli: 4/5. A little too dente but still tasty pesto.<br>-- Carbanaro in a Jar: 4/5. It comes in a jar and then the waiter does some table side magic, shakes it like a cocktail, and poof it's made. <br><br>SERVICE: Our waitress was awesome. So real and honest about what to order. She recommended amazing cocktails. Go with #4 for something refreshing and sweet. <br><br>Great place for dinner and drinks for out of towners.-", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5lUvwwvuN2wMY-Tc5vxJiA/348s.jpg", "caption": "TAGLIATELLE"}]}}, {"review": {"des": "I came here on a weekday evening with hubby for my birthday around 6PM and maybe about half the restaurant was full. However, by the time we left all the tables were taken and people were waiting for tables to free up.<br><br>I love the ambiance of the restaurant and the lighting. I noticed that many of the tables are high tops (I prefer lower tables so that my feet can touch the ground...short people problems). <br><br>We started off with brussel sprouts which were good but nothing extraordinary. Hubby had the spaghetti (jumbo lump crab, charred grape tomato, red chili & lemon cream sauce) while I had the spinach cavatelli (rock shrimp, fresno chili, braised leek, pistachio pesto, mint). Both were good but I preferred the spaghetti. The lemon cream sauce was AMAZING and I've been itching to find a recipe so I can make it at home.<br><br>Service was good and our waitress was super friendly. We received our dishes in a reasonable amount of time and we were checked on frequently. Our waitress even brought us free birthday cake gelato for my birthday!", "pics": null}}, {"review": {"des": "Absolutely loved my brunch experience here. A little pricier than I would normally pay for brunch but probably par for the course in the area and the quality of the food (I went with the breakfast skillet) absolutely lived up to the premium cost. The best part of the experience may have been just looking over the menu though, as they had one of the biggest, most diverse brunch menus I've ever seen. The ambiance of the restaurant is also nice, though very typical for a modern bar/restaurant these days. Service also was excellent, with frequent attention and accommodation of our large group. Will definitely be back!", "pics": null}}, {"review": {"des": "I've been here twice.  It's a little pricey but the quality of food and service is well worth it.  The meatball appetizer is delicious and the Brussel sprout pizza with corn and potatoes (which sounded pretty weird to me), was actually fantastic.  They also brought me this funfetti ice cream thing (ice cream with cake in it, not ice cream cake) which was also sneaky good.", "pics": null}}, {"review": {"des": "Siena Tavern is a fancy, upscale bar, and if that's what you're into, this is a good one. Their drinks are super good, including their whiskey, and their food is fun to snack on while drinking. If you don't mind paying a lot for good drinks, this is a nice place to go. It's a very River North place, and good for work happy hours. I got the #4 and really enjoyed it, and I prefer my drinks sweet.<br><br>My friend really loved the #1. Their margherita pizza was also good, although small for what you're paying for, and the kind of prices you'd expect in the River North area. I tried the coccoli after seeing people rave about it on Yelp, and while it was good, it wasn't particularly mindblowing.", "pics": null}}, {"review": {"des": "I've heard so many great things about this place and I'm glad I had the chance to go. It's a little pricey but the food is delicious and the service is stellar.<br><br>It's best to make a reservation in advance because it always seems to be crowded no matter what night you go.<br><br>Appetizers - get the Meatballs and coccoli. The Wagyu meatball is the size of a grapefruit and melts in your mouth. Absolutely worth it! I took fellow yelpers recommendation on the coccoli and it was the best decision. The sweetness from the honey, saltiness from the prosciutto, and smooth cheese makes this a unbelievable flavor that is unique and addicting. <br>Entrees- highly recommend the scallops, Tagliatelle with mushrooms and orecchiette. If you like mushrooms the tagliatelle is to die for. Very creamy and rich but so good you'll want to eat the whole bowl. If you want something spicer go with the orecchiette. They tend to smother the pastas with Parmesan which is amazing if you're a cheese lover. The scallops are cooked to perfection and a big portion.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/K026EzUUXuOvcav0cj8ZnA/348s.jpg", "caption": "Pan Seared Scallops - delicious"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wk3yXKT3mSavVKdO-u80sg/168s.jpg", "caption": "Orecchiette- very good"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WSPXmzsaqikeknwgGFC7zQ/168s.jpg", "caption": "Tagliatelle - amazing!!"}]}}, {"review": {"des": "Stopped by Siena Tavern for dinner before a show and really enjoyed it. Service was amazing. Our waitress was helpful and attentive and recommended what became our favorite dish of the night- the crab spaghetti! <br><br>We started off with glasses of cab and a pizza. Ordered the mushroom pizza and topped it with fresh black truffles. Amazing. We also ordered the crab spaghetti and the sauce was absolutely delicious. It's was creamy, had hints of lemon, and had plenty of crab meat. So good! We also ordered the pesto pasta which I don't recommend. The sauce was overpowering and there wasn't anything besides pasta and pesto to break it up. We also ordered the beet salad which we enjoyed. Super fresh and the flavors were perfect. Ended the meal with pistachio gelato and loved every bite. There were actual pistachio pieces! <br><br>So glad we decided visit Siena and would love to come back!", "pics": null}}, {"review": {"des": "Came in for a lady date with my bestie, and had such an amazing time! Our bartender Rebecca was so nice and very knowledgeable about the menu. All of her recommendations were perfect and we loved everything we ordered. The manager Carly popped by to check on us and was very sweet as well. <br>I had the squid ink pasta with lobster and my friend had the carbonara in a jar. Soooo good! The squid ink pasta is seriously to die for. We couldn't decide on one dessert, so we had two. The gelato is made in house and so, so creamy. The squeeze your own filling bombolonis are warm little hugs in your mouth.<br>Can I just say that presentation is such a big part of the meal, and they have absolutely nailed it here. Everything about this place is fun, unique and aesthetically pleasing. <br>I highly recommend it and can't wait to go back to try the rest of the menu!", "pics": null}}, {"review": {"des": "Nailed it! This place is chic, hopping, warm, good food and all the feels! Service is great, attentive. It's busy. GR a reservation. We had one and still had to wait 15 minutes or so. Enjoyed a nice bottle of wine and two great meals. I had the carbonara in a jar - really cool presentation. Hubby had the gnocchi which was good. He would have rather tried a pizza. Fun place - the bar is definitely popular.", "pics": null}}, {"review": {"des": "Great place to grab drinks and bites with a group! They have a wide selection of liquor, beer, wine, and delicious cocktails. The place does get really crowded through so we were pretty much shoulder to shoulder at 4 PM on a Friday. <br><br>I had cocktails #1 and #2, both fruity and Prosecco based, and really delicious and boozy! We also got the margarita pizza and the spring veggie pizza (with a strange looking but really tasty brown garlic sauce), as well as an order of coccoli (fried dough with cheese and prosciutto). Everything was really good, but I wish they had a larger selection of antipasti.<br><br>Service was great! Our server was really attentive despite the place being packed and our food came out quickly as well.<br><br>A solid choice to add to your rotation of happy hour choices in River North!", "pics": null}}, {"review": {"des": "Much better experience than last experience with a pleasant server! <br><br>Had the truffle pizza and truffle gnocchi and were both delicious!<br><br>Is it just me or is it odd that they don't have a bread basket - I'm happy to pay for it! Sometimes I don't want a bruschetta but just some fresh bread and olive oil", "pics": null}}, {"review": {"des": "Had a reservation for brunch right when the place opened. The hostess checked us in, but then spent time trying to seat two other groups. We were confused as to what was going on, since she didn't tell us we had to wait, and it looked like they were seating people that walked in after us. Once we were seated we had a very friendly waiter, Josh, who was informative about the menu. And very cheerful.<br><br>We ordered a coffee and a cappuccino. It seemed to take a while, but we weren't in a hurry. When he brought the drinks, Josh took our order. Then we waited... and waited. It was about 25 minutes before our food came. We had to ask for more coffee. And I flagged someone down to get hot sauce, salt, and pepper. When it came, it was in bowls with no utensils. A manager came over and asked if everything was good. I explained about the condiments... eventually I got a little spoon for the hot sauce. <br><br>The food was good, but I wouldn't rave. I had the egg sandwich. The bread had a burn on one side. I think it may be on purpose for a \"bit of a char taste\" and I actually didn't mind it. Just be aware. Hubby had the biscuits and gravy. The waiter suggested an egg on top. Hubby agreed and thought it was a good suggestion.<br><br>We heard another table ask where their food was, since it was taking so long. <br><br>I give it three stars, which is a-ok. I would go back and see if we just hit an off time. I think they need to work a bit on getting the food out faster, and focus on a few little customer service items (ie filling coffee, providing utensils for condiments, have the hostess say, \"I'll seat you after these other groups\")", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DwFJfldT0eSjsDJVOogaWA/348s.jpg", "caption": "Asked for salt, pepper, and hot sauce. Got this with no utensils to use them."}]}}, {"review": {"des": "The food here was all fine but the service was SO SLOW and everything was overpriced.  It took forever for someone to check on us and when they did they said they had a full coffee bar even though none of it was on the menu. So I asked if they had tea and I could have a London's fog which I explained was an earl grey latte. She went to check if they had earl grey and then came back saying sure. About 20 mins later when we finally got our drinks she just brought me one small cup of black tea. Later on she asked if I wanted more hot water and I said sure but it never came. The price for this one small cup of black tea- $4. I'll definitely stick to tea from the hotel next time for free.<br><br>About 45 mins in we still hadn't ordered our food which was frustrating. When it did come everything was fine - we got monkey bread to share and then I got a pizza, but the long wait and unnecessarily high prices soured the whole experience for me.", "pics": null}}, {"review": {"des": "NomzNomz: 10++++<br>Service: 5/5<br>Libations: 5/5<br>Ambiance: 5/5; nice/casual, trendy, fabulous!<br><br>This place was incredible, and the highlight of my dining experience in Chicago! My who lives in town recommended it, and it definitely didn't disappoint. Whether it's a casual night out with friends, or a hot date, this is your spot!<br><br>First stop -- libations! This was a wine and pizza night for us, but the cocktail scene is on point - as you can tell from just glancing around the room. They have bubbly (glasses ranging from $12-$24), an assortment of house cocktails ($13-$15), beer (draft/bottles $6-$9), and a wide range of varietals that we indulged in ($12-$28). There is some amazing top shelf wines at this place, if you're feeling up for it! If you want to get some great vino, share a bottle to save some cash ($48-$225) and enjoy a great night out with some impeccable varietals from around the world.<br><br>Now for the FOOD! I heard everything on the menu is phenomenal, but we had to narrow down our options. We started with the burrata $19 (must-try) - their tomato jam & basil combination was on point! The portions are large, so definitely enough to split for at least 3 people. For main courses, we split the burnt pepperoni pizza $19 (one of their top ordered items) and the Tagliatelle pasta $21 with foraged mushrooms, parmigiana, & truffle butter. YES.<br><br>Their appetizers range from $12-$24, soups/salads $11-$15 (shaved brussel sprouts, watermelon with mint vinaigrette, chilled corn soup), house made pasta $18-$34, & main entrees ranging from $29-$48 (brick chicken diavolo, pan seared scallops, double-cut pork chop). We wanted to swoop on the Wagyu Beef Meatball ($19) with roasted tomato sauce, & bellwether ricotta, shaved basil. Would have been too much food. My friend has had it a couple times though, and said it's pretty much to die for, so highly recommended if you are a meat lover!<br><br>Overall: PHENOMENAL! Great experience, and amazing food & service. We went around 6pm on a Saturday night, and the place was already full with a pretty long wait. We luckily snagged two spots up at the bar within 5 minutes (keep your eye out for checks closing) and ordered everything there and had a fabulous night out. And lastly, anything with a \"puppy patio\" serving \"woof-cream\" (dairy-free) has my vote! Will definitely be coming here again when I'm back in town!<br><br>Hours for easy reference:<br>Mon-Fri: 11:30am-2am<br>Sat: 10am-3am<br>Sun: 10am-2am<br><br>Weekend Brunch:<br>Sat & Sun 10am-3pm<br><br>Sun-Wed:<br>Kitchen Closes at 11pm<br>Pizza Bar Open til 12am<br><br>Thurs, Fri & Sat:<br>Kitchen Closes at 12am<br>Pizza Bar Open til 1am", "pics": null}}, {"review": {"des": "Service was wonderful. Drinks were amazing. The food was over the top! Definitely coming back!!! Must try the meatball!", "pics": null}}, {"review": {"des": "When in River North, it's tough not to walk into a minefield of bad bars, restaurants with boring concepts or national franchises. Remember when we thought Planet Hollywood was cool? Anyhoo, if you need a place with solid food and an interesting drink menu, head over to Siena Tavern. <br>The crowd is hot, the food is delicious, and the drinks are interesting.<br>Their cocktails are numbered, kinda like a Chinese restaurant menu. I tried making it from 1-10, but was stuck cause 7,8,9... laugh if you get it.", "pics": null}}, {"review": {"des": "We came in without a reservation and were pretty lucky to get a bar table without fighting anyone. This was preferred as my best fighting skills are passive aggressive insults.<br><br>This was on a Monday around 6. Service was prompt and friendly. Our waters never went below half full. We were able to place drink and food orders in the span 5 minutes in two separate interactions with our waitress. <br><br>I saw a couple having a date at the table next to us. I creeped on their pizza and it looked so attractive. I knew then and there, I had to have it. We got two pizzas, the burnt pepperoni and the spring veggie as we had a vegetarian in the group. I sometimes associate with them, and they are, surprisingly tolerable. <br><br>The burnt pepperoni pizza was tasty. Big surprise guys, pepperoni pizza tastes good. The crust  was a little doughy, but who doesn't love bread. The spring veggie was not bad either, others said it was delicious as well. I'm excited to come back for a more formal dinner and order some pastas next time as I suspect it's even better than the pizza.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hvRfxccLP-2JIqvflIzWyw/168s.jpg", "caption": "Burnt pepperoni pizza"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GS4Kr5XMa9OcQVG49rDiVg/168s.jpg", "caption": "Spring veggie pizza"}]}}, {"review": {"des": "1500 reviews--what can I say?  Fabio has come a long way from \"its top chef not top scallop\" to running corporate chow for Marcus Lemonis.<br><br>Maybe a short list of what you will get and what you won't get may be helpful<br><br>YOU WILL GET<br>good wine at insane markup high prices<br>good food at very high prices<br>lots of tourists<br>incredible upsell from the staff<br><br>YOU WILL NOT GET<br>a comfortable experience<br>a welcoming enviroment<br>a quality dining event commensurate with the price <br>service from anyone who gives a sh@t<br><br>VERDICT<br>go somewhere else", "pics": null}}, {"review": {"des": "We just got to Chicago and needed a quick lunch. This was around the corner from our hotel.<br>When you walk in you get a really nice vibe. It's very nicely decorated with a welcoming bar area. The bar has a ton light steaming in from the Windows. Nice view of the harry Caray's building.<br>We only ordered drinks (the 312 green line beer was really nice) and a couple of apps.<br>The bruschetta is not cheap at $18 but it's really a different take on an old standby. It had the usual tomato's on old crusty bread but it had some sort of cream cheese that took it up a notch. The Burrata was our second choice and it also was full of flavor with a very nice fresh burrata, a jam that went perfectly with it and some olive oil. Of course some nice crusty intalian bread can with it", "pics": null}}, {"review": {"des": "I really enjoyed brunch here. The inside is gorgeous with their lighting and even a plant wall at one of their bars. <br>The food was also wonderful. I got the breakfast skillet which was packed with veggies, and topped with an over easy egg and lots of cheese. It was so delicious. <br>We also got to coccoli and steak tartare for appetizers and it was the perfect start to our meal. Can't quite remember what everyone else ordered but we were all very pleased. <br>Another thing I liked was that they offered the brunch and lunch menu during brunch hours. It was nice not to be confined to a smaller menu. <br>After a long St. Patrick's day, this was such a wonderful meal.", "pics": null}}, {"review": {"des": "I was on my way down to Union Station from Michigan Avenue and decided to stop in for a lunch and some drinks as the train schedule on the weekends from Chicago to the suburbs is every other hour, so I had some time to burn before catching the next train back to the suburbs. I have been wanting to try this place for a while, but I feel like I am not in Chicago enough to try all of the restaurants that are downtown.<br><br>I grabbed a bar seat and was immediately assisted with drink menus and their current brunch menu. Pizza sounded good and I ordered the breakfast pizza for myself and it was HUGE, but it was one of the most flavorful pizzas that I have had in a while that was not deep dish. I somehow managed to eat the WHOLE pizza. I must have been hungry from all of the walking or something because I don't think I could've finished the whole pizza normally. I was sure that my body would hate me later, but I digress. I also paired the pizza with one of their cocktails. They had a large variety of options for drinks.<br><br>Service was very attentive and the food was also very good. My only issue is price. It is a little on the pricier side, I had two drinks and the pizza and it was $61 after tip for just myself. If I am in the River North area again in Chicago, I will definitely be back, but the problem is that there are so many restaurants in Chicago to try and never enough time. If you haven't been here, please go and enjoy their food.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IgyXfodYoS-nZBb2PGTIgw/348s.jpg", "caption": "The breakfast pizza from their brunch menu."}]}}, {"review": {"des": "I've been to Siena for dinner a few times but this was my 1st visit for brunch.  I ordered the lobster hash.  It was good but was served lukewarm.  I came with a group of 7 ladies so thinking maybe it sat for awhile.  I probably wouldn't order it again because it's not a very filling dish in my opinion and it should be for $22.  <br><br>I'm giving it 4 stars anyway bc despite this visit, I have always enjoyed my meals here.  The squid ink linguini is simply delicious.  Highly recommend it.  Also, the service is wonderful.  The staff is very warm, professional and friendly.  Great date place or enjoying the company of good friends over dinner.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dkMUcyRcrpcuQwkXl6dk-Q/348s.jpg", "caption": "Lobster Hash... meh."}]}}, {"review": {"des": "Double date night. Comfortable round booths, great ambiance and didn't have to yell to be heard. Ordered burrata and October with veuve both appetizers were so good, octopus was the perfect balance of seasoning and acidity. <br>Then Michael picked two bottles fir our dinners. You can tell he's good at this because he wanted to hear what we were all having for dinner. We were all over the place but he did good. <br>-scallops- wow giant pieces seared perfectly<br>-squid ink pasta w lobster- the winner. Still mooning over this dish<br>-gnocchi-soft pillows over that sauce! Must try this! <br>-lasagne- what can I say, OMG <br>dessert was donuts! Deep fried and tossed in sugar. Filling came in tubes. Tasty! <br>Great experience, loved Michael, so smiley and helpful. <br>I can't wait to go back and have that squid ink again. Great date night place!", "pics": null}}, {"review": {"des": "Excellent service. A really well-staffed restaurant with attentive personnel. Food mixed, atmosphere LOUD. Considering the location, it's a better choice than many in the area.", "pics": null}}, {"review": {"des": "My fiance chose this place for his birthday dinner, so I had to give this place another shot. This place is still pretty busy and despite having reservations, it took about 15 minutes to get seated. It's quite loud inside and I'm not too fond of the music selection, either.<br><br>We ordered the grilled octopus, spaghetti with jumbo lump crab and the squid ink linguine with lobster tail. The grilled octopus was tender and very good. Both pastas were fine, nothing too exciting. I liked how the lemon helped lighten up the spaghetti dish. The plating and presentation is not very appealing. Pasta portions are large and very saucy. It did make for good leftovers, though. We got the caramel cookie jar for dessert which was super sweet, but oddly addicting. This portion was also huge and we had to take most of it home. They also brought out birthday cake gelato with a candle, which was a nice touch.<br><br>Dinner was fine and food was alright, but the ambiance and environment is not my style. I'll stick to my usual spots for pasta.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DynSm9tY2DaGmjKEFVOYDg/348s.jpg", "caption": "Caramel cookie jar and birthday cake gelato"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-jtX7IzVmw-CQWgcY-84Lg/168s.jpg", "caption": "Grilled Octopus"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zPT-cUNeabyQ8KOK2fkPKA/168s.jpg", "caption": "Spaghetti with jumbo lump crap"}]}}, {"review": {"des": "Steak & eggs on the brunch menu was great. Came here on a Saturday noon -- seems like a popular spot. Dessert options are extensive but on the pricer end", "pics": null}}, {"review": {"des": "Individuals from my company have business lunches here on occasion. I received a gift certificate over a year ago and finally used it for a to-go order. Since the certificate was enough for more than one meal, I got lunch for two days.<br><br>Short rib ravioli - excellent, fresh sauce made the dish<br>Papardelle Bolognese - wayyy too much parsley on the dish and the meat sauce was underwhelming (try the same dish at Noninna!)<br><br>You pick up your order from the bar where it appears there is confusion over who checks out to-gos.  I went a bit over my certificate, so paid balance in cash and did not get any coin returned to me, it wasn't much, but still. <br>I think it wouldn't have bothered me had my to-go order contained bread (again, check out Noninna).<br><br>Had I paid outright for these meals, I'd be much more disappointed.  I wouldn't return.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lstlu2xp5MBDQmqEpLPPLw/168s.jpg", "caption": "Short rib ravioli"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1kMFmxffBl5BpiueAukKxA/168s.jpg", "caption": "Papardell bolognese"}]}}, {"review": {"des": "I have never experienced such terrible service! We made reservations weeks ago for a party of 10 only to be told upon arrival that we would not be seated until 8:45 (reservations were made for 7) which was frustrating for the parents who had babysitters and also for those of us who had plans after dinner. While we waited at the bar, I overheard the front staff telling the hostess to not seat us if we were at the bar. You would think they would be a bit more accommodating for overbooking, but the rude service didn't end there. Once seated, staff was not helpful or accommodating whatsoever. We had 5 vegetarians at the table who specifically sat together to share veggie friendly food. We were served meat in BOTH our specifically vegetarian menu-items, the pasta and pizza, and when we let the staff know, they were condescending instead of remorseful. Staff cleared the tables of half-eaten plates without asking guests if they were finished. The entire experience felt rushed. The ambiance was loud and unwelcoming, making it difficult for staff to hear our orders or for guests to interact with each other. While the food was ok, I was incredibly disappointed with the service and do not recommend this for any private events or special occasions.", "pics": null}}, {"review": {"des": "I have heard good things about this place and finally made my visit on Saturday for brunch. There was no wait when we arrived around noon. <br><br>The menu was overwhelming as there were so many things to choose from! With some help from our waitress, we ordered the Watermelon salad, breakfast pizza, and tiramisu french toast. Everything we ordered was fantastic. We especially loved their unique watermelon salad- the pistachio sauce was tasty! The tiramisu french toast was not too dense/heavy and was rather fluffy. Also the whipped cream had a little bit of coffee flavor which was very delicious. The berries on top of the toasts were fresh as well. Lastly, the breakfast pizza was great which had a baked egg in the middle! <br><br>The presentation of each dish was great and tasted even better!! I cannot wait to come back to try other things on the menu.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cBC6CH-2YIOgl-gcfgM0SA/348s.jpg", "caption": "Tiramisu French Toast with delicious whipped cream on the side"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8bqg4B26Ju-kCKulgXfHpQ/168s.jpg", "caption": "Watermelon salad"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ESzvU8FojpK8W_unJ3lBUA/168s.jpg", "caption": "Breakfast Pizza (egg in the middle)"}]}}, {"review": {"des": "This place has been eyeing me from across my work for the past couple of weeks and I'm glad I got the chance to go! Great burger place to stop by for a meal, or even enjoy some beers outside in their patio! I went for lunch so we settled for indoor seating where I ordered their Chicken Sandwich. HUGE Chicken Sandwich with a ton of flavor and very enjoyable, after a meal like that it was definitely hard to get back to work. For vegetarians, my coworker had the Truffle Mushroom Pizza which looked pretty good in my opinion, but as an avid meat eater I couldn't let myself go for it. Can't wait to come back here again, hopefully enjoy some patio seating this time around!", "pics": null}}, {"review": {"des": "The food here was really good! The bar was crowded and tables were full (we went at 7pm on a Thursday), but they happened to have a cancellation and were able to immediately seat us on the patio. Inside seemed a bit loud to me, but I can't really comment on it since I didn't eat my meal there - however, there seem to be a lot of tourists and people coming from work, so it can get pretty crowded. We got the coccholi, which are fried pastry puffs with honey and prosciutto and cheese - it was very good and I would highly recommend. We also got the gnocci, which comes in a cream sauce with fried sage and bacon, and it was very tasty. The pasta carbonara was also pretty good. Service was excellent - everything came out in a timely manner and our waitress was very attentive.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/euRyES7SiE3gk90QuwTfaQ/348s.jpg", "caption": "Gnocchi with fried sage and pancetta"}]}}, {"review": {"des": "Service was top notch. Awesome job. Quick, professional and efficient. <br>Wine list was exciting (top notch) but nothing at a low cost by the bottle in case that's what you are looking for. <br>Food was hit and miss. Highlights were the donuts and coccoli appetizer. Both great value and good presentation. <br>Misses- the pasta course. We just got back from a six week trip in Italy so maybe we are spoiled but pappardelle and orecchiette pasta were lacking freshness. <br>Brussels sprouts were good but it sounded better then it was. Pizza was good but not best in city by any stretch. <br>Ambiance is top notch. <br>Will go again if in area but not a destination for us.", "pics": null}}, {"review": {"des": "I've been here for brunch 3 times now and have loved it each time. The service is good, decor and ambiance are nice, and the food is really great. <br><br>Drinks: I had the Siena Spritz, No. 29, and Bloody Mary. I liked the Spritz the best. It was fruity without being too sweet for me. The Bloody Mary is good but nothing special. I ordered the carafe to share with friends and they fill both the carafe and your glass with ice which felt like kind of a ripoff. There's no need to put ice in the carafe when I already have some in my glass. It also made it very cumbersome for our waiter to pour. <br><br>Food: I've had the Breakfast Sandwich, Eggs Benedict, Lobster Hash, Bomboloni (to share) and Tiramisu French Toast (to share). I enjoyed all of it. The Lobster Hash was probably my favorite. They weren't too skimpy with the lobster as some places are and it was just delicious. I also really loved the Benedict. I love when restaurants do unique takes on them, and I loved the use of mortadella. The Bomboloni are great to share among a table. The French Toast is really good but I thought the tiramisu aspect of it was too subtle and didn't live up to expectations. <br><br>All in all, not perfect but a definite standout and I'll definitely be back after I give a few more brunch places a try.", "pics": null}}, {"review": {"des": "Had the turkey panchetta club. It was above average. Wish the toasted bread was a bit more crunchy toast like. Fries were great. Nice looking place on the inside with seating outside. My colleague had the \"Carbonara in a Jar\". See my photos. Wow, that looked good. He said it is delicious although the peas were a little tough. Good lunch place.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lEwF8ZGdHQCZkWrbtdc7_g/168s.jpg", "caption": "Before"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yYIUTbgHoakdg5BP_681Dg/168s.jpg", "caption": "After"}]}}, {"review": {"des": "Nicolette was awesome! She SOLD me the short ribs. Amazing. Would recommend Siena to everyone.", "pics": null}}, {"review": {"des": "I LOVE their food. I will tell anyone to go to Siena Tavern. It's a must! They tend to be booked a lot so I always make reservations a week or so in advance. <br><br>I went with 2 friends who had never been. I was not going to pass up that invite. In previous visits I have tried: the Tuscan kale Cesar salad, the burrata, the lamb chops, the squid ink linguine, and the prosciutto pear pizza. Everything has always been amazing. The food is flavorful and always well cooked. The presentation is always on point as well. If you want to split dishes with a friend, they will split it for you! Their cocktails are pretty good too. The hostesses are really something sometimes but I pay them no mind. The waitstaff is awesome. Our waiter was so helpful and fun. <br><br>We started with the bruschetta and the meatball. The bruschetta isn't the typical bruschetta. It has brussel sprouts, butternut squash, cheese. The flavors were a good mix, but it reminded me of fall. So don't expect a cool kind of refreshing bruschetta. The meatball was loved by my friends who ate it. The tomato sauce was fresh and cooked perfectly. <br><br>I got the spaghetti. It had crab, cherry tomatoes, in a lemon cream sauce. Oh my, it was sooo good. They do not skimp on the amount of crab they give you. I had crab in every bite. The handmade pasta is so good and tender. The sauce was great with the crab and tomatoes and had a hint of spice. I couldn't finish it so I took the rest home and ate it for lunch the next day. So good still. My friend got the scallops (which I was torn between that and the spaghetti). It had a butternut squash, mushroom, chard mixture. You know I had to sample this! That paired with the scallops were so good. The flavors went well and the scallops were huge! My other friend got the burnt pepperoni pizza. I didn't try it but he was very pleased and said it was so good. <br><br>Overall, DEFINITELY go to Sienna Tavern. Take out of town visitors. It's so good. The food has a lot of flavor and the portions are great. The drinks are awesome. I can't wait to try their brunch.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QcdTie8R6FjnWFgu3MI6SQ/348s.jpg", "caption": "The scallops. YUM! They're huge!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qpJ1MR6jTGtS4KDX1URrQQ/168s.jpg", "caption": "The spaghetti!!!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/r5w11E6lHdQDXByW8Zs2cw/168s.jpg", "caption": "Look at this pizza!!!!"}]}}, {"review": {"des": "Definitely wanted to try this place after checking it out on yelp and of course knowing that it was started by Top Chef Fabio. Everything from the ambience to the food was so delicious. Our table got the Coccoli for a starter and i think that everyone should get it!! You def should put the procchuitto and the cheese inside the bread and eat it like a sandwich. Thats the best way to eat it. The truffle honey was the perfect touch to the entire order. I got the brick chicken and OH BOY was it delicious. The chicken was so juicy and cooked just perfectly with the skin crispy and flavorful. The potatoes that it came with were a perfect side to the chicken and the arugula salad was a fresh mix to the meal. I loved our waitress for giving us a little explanation of every favorite from each menu section. My friends and i were able to order confidently even though everything on the menu sounded delish. My friend ordered the squid ink pasta and it was pretty light but the flavors were perfect and well balanced for the lobster. My other friend ordered the scallops which were one of my faves. They were pan seared to perfection and the squash puree just highlighted the scallops. My other friend ordered the the spaghetti and i really loved the creaminess and the pasta was perfectly al dente. We were so satisfied and full that we werent able to get dessert but we all left with smiles in our tummies from the delicious food.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EC4gqnVBADE4AxXCMrcS1A/348s.jpg", "caption": "Pan Seared Scallops"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Tz8RTALvmkDlK_LzmuCrJg/168s.jpg", "caption": "Brick Chicken Diavolo- Juicy and the potatoes are magic"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dydIr2NUbdSuFvFu9QDxOg/168s.jpg", "caption": "Spaghetti"}]}}, {"review": {"des": "This has to receive at least a 4 because the salmon's presentation and taste was stunning (see picture). It was also a fairly healthy dish, which made the dish even more impressive. I got an old-fashioned which was done right. Prices were a little \"out of this world.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2hSpV8Wg3WIijgCAFRCLuQ/168s.jpg", "caption": "Salmon"}]}}, {"review": {"des": "River north restaurant that has an Italian background, great atmosphere, fun vibe, a little too pricey for the food. <br><br>The server was nice but she was a bit slower than what I'm used to. Had a beet salad, not too large and was great to supplement my pear Gorgonzola pizza. Pizza size was extremely generous. They have lots of pasta on the list, and great meats like osso buco. I was hoping for more red meat (beef) options. They had osso buco, lamb chops, pork chops, and the tasting menu had a filet, but i like meat and was hoping for another steak option. <br><br>In terms of cocktails ($14) they're great and a good portion, but expensive. I also had the tiramisu which came with espresso meringue cookies and they tasted like cotton candy! It was delicious. The cake was great. Friends stated the elation was fantastic, too. <br><br>I'll come back for the pizza and dessert. The entries seemed a little too pricey. Maybe I'll try the pasta.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DpYpp1O9poP8CJCCgeuAIw/348s.jpg", "caption": "Fantastic tiramisu"}]}}, {"review": {"des": "Beautiful space, a bit expensive for batched cocktails (just not my preference) but a good date spot with nice options. Great after work spot to grab a drink and appetizers with coworkers, very spacious and accommodating.", "pics": null}}, {"review": {"des": "I want to love this place more and giving it 3.5 stars. <br><br>Service was fantastic and our server was a great salesperson - it's just too bad the food didn't really live up to the hype. <br><br>Fantastic location, great ambiance and set up inside - loved all of it whether you were there to hang out with friends or have a business casual dinner (which is why I was there). <br><br>The apps were awesome and wish we just gotten those - The Octopus melted in your mouth, The Coccoli was like heaven - holy soft bread with cheese spread, and no one can really say no to Burrata made right. If this review was just based on the above, then this would be 5 stars.<br><br>There were 4 of us and we got to 2 Lamb Chops, 1 Lasagna, and 1 Osso Bucco. The server painted such a pretty picture of the entrees and the presentation was beautiful. Too bad the lamb wasn't tender - cooked medium rare, but taste was so disappointing. Lasagna was over-cooked - ick and Osso was just OK. <br><br>I'll come back again, but just for the apps.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yiv-iksAKzxGLFkC34J8Hw/348s.jpg", "caption": "Lamb chops"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uXdjQAc50lZqr2ySeh8Wsw/168s.jpg", "caption": "Octopus was so good"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kU5HUg_Vpud97c6f60ny_w/168s.jpg", "caption": "Signature bread dish"}]}}, {"review": {"des": "Great sangria, nice casual atmosphere, and good food. Though I still like bar sienna better than sienna tavern, we had a nice Sunday night dinner here. Service was fairly quick, as we got our sangrias and appetizers right away.<br><br>For appetizers, our table of seven shared the brussel sprout salad, meatball, and octopus. All were delicious, though I'm sure the carmelized brussel sprouts would have been better than the salad.<br><br>I got the scallops, which was also a delicious entree. However, the portion was fairly small. We also got a dessert for the table, pistachio semifreddo, which was interesting. Still nice and sugary and sweet, but wouldn't have been my dessert choice.", "pics": null}}, {"review": {"des": "Came here for dinner with a friend craving Italian like food and I was not at all disappointed! The service was excellent, my waitress told me all the good things to eat and was very accommodating in her suggestions of my friends allergy to fish and shellfish. We started off with the cocktails, and let me tell you, they're pretty amazing. Definitely somewhere I'd come to the bar just for drinks. <br>Between my friend and I, we shared an appetizer, salad, and pasta which was plenty for both of us. The Coccoli was way better than we were expecting and the brussel sprout salad was delightful. Now for the gnocchi; all the pastas here are handmade at 5 in the morning! How crazy is that? The gnocchi had a bit of bacon in it which gave it a smoky kick that will make your taste buds craving this combination when all your food is gone. We finished off with the Bomboloni for dessert with three sauces. The Bomboloni had a little too much sugar on each piece. I found myself scraping off a lot of the sugar. All in all, amazing dinner that left me very satisfied.", "pics": null}}, {"review": {"des": "The menu was a little terrifying at first, but the homemade pasta and unique flavors truly make this one of the best restaurants I've ever been to. <br>P.S. I highly recommend the spaghetti, caramelized brussel sprouts, and sweet potaqto gratin.", "pics": null}}, {"review": {"des": "Our party of 5 came here around lunchtime on a Sunday. Plenty of tables available surprisingly so there was no wait. Loved the decor and setup of the place walking in--a good balance of natural and indoor lighting. <br><br>This place is kind of pricey for brunch, with nothing really under $15. They had a seasonal menu for truffle items where the chef would come over and personally shave truffles over your plate of food. I ordered the Eggs Benedict because I was attracted to the pesto hollandaise sauce--it was good, but wished there was a little more pesto flavor to it and that the ham was less salty. The eggs were perfectly poached and the brioche well toasted though! <br><br>Highlight of the place: There were 2. The Monkey Bread we shared as a table was absolutely delicious. And 2, our waiter was excellent! He gave very short but concise recommendations, was very approachable and friendly, and attended to us just the right amount.", "pics": null}}, {"review": {"des": "We were staying downtown on a cold night.  The Siena Tavern was near the hotel and we were very glad we had dinner here.  <br><br>The interior is very inviting and we sat in a comfortable booth.  They have a nice wine and drink list.  I had a glass of really nice cab.<br><br>For the main course I ordered the squid ink linguine.  This was out of the world delicious.  The pasta was fresh and perfect.  The creamy sauce was rich and delicious.  And then the lobster was just incredible.  This is just a wonderful dish overall.  <br><br>I also tried the gnocchi and the lasagna.  Both were also excellent, although I think I liked the gnocchi a little bit more.  The lasagna was think with great layers.  The gnocchi was sublime--just a notch below the linguine.<br><br>Although the main courses were filling, we decided to order the monkeybread.  This was also super tasty.  There were three of us splitting it and it is a great dish to share.  There is a lot of it and even though you may be full, you will be tempted to eat most of this.<br><br>The Siena Tavern is definitely worth a visit.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/H4IH8iHTwbyCgIUd6sCBWg/168s.jpg", "caption": "Caramelized Brussels Sprouts"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3B9kReFrf76ND0PYgh6NBA/168s.jpg", "caption": "Lobster Squid Ink Linguine"}]}}, {"review": {"des": "This review is for Saturday, 12/2. A series of unfortunate events led to this 2 star rating. However, Siena Tavern has the ability to fix these issues for future customers. First of all, our party of 6 was squeezed into a booth that could have seated 4 people comfortably. Hubby said he felt like he was sitting in the middle seat on a plane. We asked if we could be seated at a table, but, the table we pointed to was reserved for another group. <br><br>In addition to the cramped seating conditions, we were subjected to blinding lights from the garage across the street. Although this is not Siena's fault, Siena should install shades for the comfort of their customers. <br><br>Despite the tight seating arrangements and the inconvenience of getting up every time someone had to use the bathroom, the food was pretty good. Some of the  dishes that stood out: burrata, pizza, orecchiette pasta, squid ink linguine. <br><br>Although the food was pretty good, the uncomfortable seating and blinding lights took away from fully enjoying this dining experience.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/T4KyqB8odilGXwHDcC0BZQ/348s.jpg", "caption": "Gnocchi"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Kt6LzVsBg_vSifEhzfrB7A/168s.jpg", "caption": "Lamb chops"}]}}, {"review": {"des": "I was looking for brunch places to take my sister this weekend and I found Siena Tavern's brunch menu to be quite different with some of their unique offerings like the breakfast pizza, truffled eggs etc. <br><br>My sister and I ended up ordering a tiramisu French toast and an artichoke omelet to share. One sweet and one savoury dish. Our server, Elsa, was great. She was extremely sweet and very accommodating with her recommendations when we told her we were vegetarians. 5/5 service.<br><br>The artichoke omelet was delicious. The freshness of the cherry tomatoes and artichokes in the omelet blew us away, and the potatoes it came with were to die for. The potatoes were garnished with lots of fresh Parmesan. Our only complaint was the bread.. why ruin such a good dish with sub-par bread? Bad maybe add a bit more of it? 4/5<br><br>We felt similar sentiments about the tiramisu French toast. It was divine, but only when shmeared with a ton of the cream that came on the side with it. The French toast itself didn't taste like it had been soaked in espresso, as they claimed. It was a very good French toast over all.. but we're not sure if it was a very good tiramisu French toast. <br><br>Will definitely be back to try their other dishes.", "pics": null}}, {"review": {"des": "Great brunch spot. Very night seating outside. We ended up getting some of their other specialty cocktails bc their mimosa was smaller but they were still refreshing and suitable for breakfast. The smashed potatoes were awesome. I got the goat cheese omelet. I wish it had had a little more goat cheese but overall fun experience. Unfortunately no brunch specials tho", "pics": null}}, {"review": {"des": "Birthday desserts definitely get the monkey bread and the chocolate cake.  It's amazing!! Don't try the Italian margarita but definitely get the No. 1<br><br>I've been here for dinner many times and almost everything is amazing!  We didn't stay long as we were just bar hopping; but I'd highly recommended Siena if your pallets desire fine Italian which is made exceptionally well! <br><br>I deducted one star as getting reservations on busy nights are total pain.  I've stop coming for dinner or around dinner time.   And staff is hit or miss we had friendly staff this visit but I've had few complaints in past.", "pics": null}}, {"review": {"des": "We've been here multiple times, and have had nothing but good service and great food. Today (3:50pm), they had a man at the front desk that was ... so ridiculously short and unhelpful that it made our entire group feel uncomfortable. We were planning on eating and ordering drinks, but he made our group (2 of which were from out of town) feel like our business wasn't wanted.<br><br>For what it's worth, this is totally unlike any of the past experiences we've had here - so it's clearly just a terrible employee. We still felt dumb for walking toward this place speaking so highly of it and then being treated like total crap.", "pics": null}}, {"review": {"des": "I am definitely a fan. Went on a Wednesday night expecting it to be somewhat busy but it was POPPIN! Honestly, my friend and I looked at each other kind of shocked that the place was so busy on a Wednesday night. But after the meal we both realized why it was. The food was excellent, fun vibe, and the drinks were flowin. The Sangria was really tasty, not too sweet but sweet enough. <br><br>Favorite dishes: The Coccoli appetizer - recommended by our server and so thankful she did. The dough was crisp yet had some nice chew, the cheese was stretchy, prosciutto salty good, and the truffle honey added just a hint of sweetness to the party in my mouth. Highly recommend. <br><br>Bombolini Dessert - I'm not a big dessert guy but these Bombolinis are f&ckin awesome. It's basically a light and fluffy donut. The interesting thing is that it's potato based. You have your choice of filling as well which you inject yourself via squeeze bottles into the bombolini or on top or on the side or directly into your mouth or wherever the heck you want.<br> <br>Meh dishes: We got the Squid Ink Linguine and Spaghetti. Both pastas were good. Nothing amazing for the price point though. Wagyu Beef Meatball was good but once again for the price point nothing amazing.<br> <br>I would certainly go back if entertaining a group of friends. I could see Happy Hours being fun here. <br><br>#RefereEats<br>\"I call it like I eat it.\"", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7hkcF0C3LmP-dncg3--B1g/168s.jpg", "caption": "Squid ink linguine"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/y5lhn-dr4ykR6ZtduGazVg/168s.jpg", "caption": "Waygu meatball"}]}}, {"review": {"des": "Siena Tavern is the sort of place that can't quite decide if it wants to be a fine restaurant or a loud club.  Based on the crowds, apparently many don't mind, but on two separate occasions the annoyingly loud music and ear-splitting din made talking across the table difficult and left me with a headache. Clearly, I am not hip enough to appreciate the Siena's ambiance, but if you're like me and tired of contemporary restaurants trying to out-decibel each other, then you might be better dining elsewhere. <br><br>The food is good but not exceptional.  The server raved about the Ossobuco as their specialty, but my friend thought it was merely average. I enjoyed my Brick Chicken Diavolo better, but I would consider it more above average than great. Our friend who had the Orecchiette seemed the happiest of the bunch, so I might gravitate the pasta should I visit again. <br><br>Be sure to check out the drinks, which we thought was the most consistently interesting thing about Siena.  The drink menu is interesting and the cocktails were mixed well. <br><br>I would've given the place 4 stars, but it'd need to be 20 decibels quieter to earn that rating from me. It is not quite the loudest restaurant I've been in (that'd The Smith in NYC), but I'd guess it's pretty darn close.", "pics": null}}, {"review": {"des": "The only reason this isn't a five star review is because Sienna Tavern is sort of a one trick pony. The \"lobster hash\" is hands down one of if not my favorite brunch dishes in the entire city. I've dined here before & each & every time the dish has  been consistent. The other components of the meal however are not up to par. The  \"Margherita pizza\" was akin to a frozen one from the grocery store & not worth the $20 I paid for it. The attempt at a Bellini was honestly laughable. The \"Parmesan sticky fries\" were so \"meh\" that they're not worth a review as well. It really is a case of this placing being known for doing one thing but doing it well. The bill came out to around $90 which would've been fine had all the dishes been as good as the lobster but it makes it a place that one should really dine alone at unless everyone at the table orders the one dish I recommend.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/n-e7X4DFvpRCrcNFO9AZmQ/348s.jpg", "caption": "Lovely Lobster Hash"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WeNeibi0YU0_e0JHvr4m1w/168s.jpg", "caption": "Margarita pizza was bland"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zjwYg1686fosK2SGN3EzLw/168s.jpg", "caption": "Sticky Parmesan potatoes"}]}}, {"review": {"des": "Came here for an anniversary dinner with my wife and the food was incredible. We had previously eaten at their sister restaurant (Bar Siena) and loved it so we decided to check out this place. I had the squid ink linguine topped with grilled lobster tail and it was amazing and the portion was huge. My wife got some sort of pizza that she loved and I enjoyed a few pieces of too. Service was great and the ambiance was too. It's definitely a great spot for a date.", "pics": null}}, {"review": {"des": "The food: 5/5. Siena Tavern has been on my list for a long time but they never seem to have reservations available. Turns out they have a large area by the bar that's reserved for walk-ins. We tried burrata with some kind of tomato jam, I could eat that tomato  jam every day.  Seafood pasta was also great with a generous serving of lobster. The negroni I tried was good.<br><br>The service: 4/5. The hostess wasn't very friendly but the bartenders made up for it. <br><br>Overall: 4.5/5. An excellent option in River North.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JGehjzbRg4M320cuAsRS_g/168s.jpg", "caption": "Burrata"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uAbZ4mp1EOUR83wR3bKRLw/168s.jpg", "caption": "Lobster pasta"}]}}, {"review": {"des": "We went here for dinner with friends. The interior and ambiance are modern, clean, and upscale. Our server was very good, although he spoke a bit fast. I ordered the \"burnt' pepperoni pizza, which is thin crust and charred, not burned ($19). Really good. The sauce has a nice kick from the peppers. The wife ordered the Stracci pasta ($21). She loved it. Fresh made pasta with mushrooms and a flavorful sauce. <br><br>For appetizers I ordered the tuna, thinking I was going to get what was pictured in a previous Yelp review. Only after it was served did I find out the picture was 4 years old and the tuna dish had completely changed ($15). It was still good, but the original looked better. The wife tried the Coccoli ($17) and loved it. Basically it's fried dough or like a popover, but empty inside. You put the cheese and proscutto inside, really delicious. Light, not greasy, very tasty.<br><br>I was going to give the restaurant 5 stars because everything was top notch, until dessert, which I seldom eat. But I wanted something to cool me down after the spicy pizza, so I ordered \"gelato.\" What I got was ice cream. I have had gelato in UK and France and know what it is. This is not gelato. They charge $6 for a scope of ice cream. Very disappointing and that cost the restaurant one star.<br><br>I would happily return but would not order gelato again.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pONj2WEOuZP_WxMjr14n0g/348s.jpg", "caption": "Mint chocolate chip gelato"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/b5OIJKkgRH3bJi1nnt-d_g/168s.jpg", "caption": "Lemon cheesecake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/p2c4MK5I5Xrwy3mZ1SdY0w/168s.jpg", "caption": "Burnt pepperoni pizza. 10/1/17."}]}}, {"review": {"des": "Food was rich and delicious in a variety of ways - coccoli were airy and served with high-quality ingredients. Our group devoured them and regretted not having more even though we were saving ourselves for the large-portioned entrees. Friend and I shared a bowl of wonderful corn soup. Staff/kitchen was kind enough to split the single order into two smaller bowls. The corn flavor was very bright and the soup was very smooth. Crab spaghetti was very rich and creamy, a comforting and luxurious plate of pasta although I think I could have used a few more grape tomatoes to keep my palate awake. For dessert, I had the chocolate molten cake, which was quite good, but I think the caramel cookie jar was better - the mousse was like whipped butter and the cookies were chewy and not too sweet. <br><br>Chef Fabio was apparently on the patio greeting some customers, according to my friends who watch Top Chef and all of his staff, from front reception to bus people to servers worked as a highly professional and hospitable team. Great place to take visitors.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xsldsiKyho3copuGKOaCtg/348s.jpg", "caption": "Corn soup"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RLJdPpwkq_SnwjHS8SaE-A/168s.jpg", "caption": "Spaghetti with crab"}]}}, {"review": {"des": "Pizza was excellent. 1/2 truffle mushroom + 1/2 margarita. <br><br>Enjoyed hearts of palm salad. Very creative.<br><br>Dessert was pistachio ice cream.<br><br>Loved ambience, service and the fact that everything is made in-house.", "pics": null}}, {"review": {"des": "Don't let the name \"tavern\" fool you - this place is as good as it gets!! The ambiance is very upscale/swanky and the wait staff is incredibly knowledgable. Friends took us here to celebrate our recent marriage. We were seated in a booth to the right of the door which was great. The restaurant was full of people, but it was large enough to not feel crowded. The noise level was high, but the booth insulated us and our conversation so we could hear one another.<br><br>We started off with the grilled octopus and the burrata. Both were good - the octopus was my favorite. There were so many dishes that sounded fabulous it was hard to choose. Hubby had the Halibut and said it was delicious. The portion seemed small, but it was filling. I followed the server's recommendations and had the Squid Ink Linguini - FABULOUS!! There was so much lobster throughout the dish, which was wonderful. The dish was large so I had leftovers. We finished off the meal by sharing the molten chocolate cake which was good but a bit bitter for my liking. There was also a scoop of gelato on the side which was an inserting flavor. Not my favorite, but not bad by any means.<br><br>The drinks were very good (I had a Moscow Mule). I cannot compliment the chef and our server enough. Our server's knowledge was incredible and his recommendations were wonderful. A fabulous experience! We cannot wait to come back to check out the two massive bars and get some more delicious food.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nClddcL1hq027xIJXJtYgg/168s.jpg", "caption": "Squid Ink Linguini...to die for!!!"}]}}, {"review": {"des": "Overall a good experience .. <br><br>service was great, dog friendly patio even better. Stopped in with my pup and boo on Friday for lunch. Minimal wait, and cute patio with fireplace, perfect for puppy dining. We started with the meatball which was DELISH! Huge, saucy and came with large buttered crustinis. I moved on the the Brussels sprout salad with steak, not the best. The salad was literally all shaved Brussels sprouts, very dry and flavorless and the steak was over cooked. MEH. I was hoping for a large green salad with Brussels sprouts. <br><br>Boyfriend ordered the brick chicken, very good. Large bone in chicken wth roasted potatoes and a small arugula salad. Soooo GOOD.  <br><br>Will be returning to try some other delicious food in the future.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/18sOYhXv-HgLxzjeQ3m6Fw/348s.jpg", "caption": "Brick Chicken Diavolo - DELISH. Must try!"}]}}, {"review": {"des": "I had so been looking forward to dining here. The restaurant is cute inside but the food is so sub par for Chicago restaurants, YUCK! Quite possibly the worst Margherita pizza I've ever had. Virtually no \"mozzarella\" cheese unless you count the cheese that tasted like it was burnt into the crust after sitting under a heating lamp for 20 minutes before it's served to you. No thanks, next time I'll find a much better restaurant in the area.", "pics": null}}, {"review": {"des": "Delicious meals and a great vibe.<br>The service is prompt and friendly. If recommend any of the pizzas!", "pics": null}}, {"review": {"des": "Dinner for 10 in Sienna Tavern's private room. Needless to say, amongst ten people we tried a large variety of apps, entrees and desserts. Every dish was thoroughly enjoyed. Being a fan of Top Chef Fabio Viviani, I had to try the Brick Chicken Diavolo. Absolutely divine. I had such high expectations for this particular dish and it surpassed those... and some. The wine list is extensive. Do your homework or ask for suggestions. Service was top notch every minute of our four hour dinner. 100% satisfied x 10!", "pics": null}}, {"review": {"des": "Super cute place! Service was 10/10. The waiter split everything for us in half so I didn't have to fight with my other half. My favorite was probably the octopus off the anti pasta section. So good I could eat more than one portion. The crispy garlic chip on top was a plus! We had the lobster roll and the squid ink pasta.They didn't skimp on the lobster on either dishes even when we share it. The lobster roll had some sort of slaw on it that I didnt care for much but other than that...no complaints! My money was worth it. Definitely will return because there so many pasta dishes I want to try!", "pics": null}}, {"review": {"des": "Came in on Sunday and sat at the bar. Chad was our bartender and he was awesome! Great attitude and amazing suggestions! Started with the octopus app and ordered the spaghetti. Extremely happy with both. Great ambiance and service all around. Can't wait to come back.", "pics": null}}, {"review": {"des": "Top Chef lovers, this one is for you. The famous Fabio opened this restaurant and we can vouch that the food blew us away. <br><br>All seven of us claimed it was the best pasta of our lives, and well worth the $50 we each spent for two bottles, appetizers, and our individual meals. We each got different pasta because we had heard such good things and we were in love. None of us got the truffle on top because expensive, but we still thought the food was flawless without it. <br><br>You absolutely MUST get some appetizers too. I can't remember the name but ask what they recommend and get whatever it is. <br><br>Reservations do need to be made in advance, but I can't praise this restaurant enough!", "pics": null}}, {"review": {"des": "For sure a solid choice. There's just a ton of other restaurants in the area that compete in the same arena, if you will, so not sure how much it stands out. That said, everything I had here was good. Service was good. Drinks were good. Atmosphere was good. Nothing was life changing, but I wouldn't not go back or suggest it to anyone in the area. <br><br>It's also a happening place so it can be loud and there might be a lot of commotion. So it's great for a lively time, not necessarily great for intimate conversation.", "pics": null}}, {"review": {"des": "The gnocchi..... dayamnnnnnnnnn.  Also incredible- the Wagyu Meatball appetizer. I will come back here every time I come back to Chicago.", "pics": null}}, {"review": {"des": "Must visit if you're in Chicago! I was able to somehow schedule a same day dinner reservation for a party of two. From the service, to food, to drinks, to ambiance, everything was just perfect. This is the perfect spot for a date, business meal, or family meal. It's not too loud and you can actually hear the company you're with, which is always nice. I will absolutely return the next time I am in town!", "pics": null}}, {"review": {"des": "**Pro-tip:<br>(1) Go to Coco Pazzo or Coco Pazzo Cafe instead, for better and more authentic Italian food. As good as the Carbonara at Siena's is, it's even better at Coco Pazzo Cafe. <br>(2) If you want a drink, go anywhere else. All their mixed drinks are premade and cannot be modified with alternate brands or types of liquor. Wth? That's not a bar<br><br>Pros:<br>- Carbonara in a jar is very good. Everything else was so underwhelming, including the service <br><br>Cons:<br>- Good luck getting your water filled. I've never had an attentive waiter here <br>- Food is really underwhelming, except for the carbonara<br>- Drinks are even MORE underwhelming. THEIR MIXED DRINKS ARE PRE-MADE. You CANNOT modify type or brand of alcohol, because they're premade. That's not really a bar.<br>- They up-charge for EVERYTHING possible. Want more parmesan? $2 upcharge. Does any other place of similar quality do this? No. Does it matter 2 people came and ordered $200 worth of food and drinks... and that the waiter never filled our water? To them? No. This place just doesn't get service.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/a5fyhRbRKX2nY41vpQNSLQ/348s.jpg", "caption": "Wagyu Beef Meatball. ok"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YlRX9cEvTaKmMhMEdl2nmQ/168s.jpg", "caption": "carbonara was better"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DVsEXmM9GpKgTZLCkPLxmQ/168s.jpg", "caption": "Carbonara in a Jar. the best entree we had there"}]}}, {"review": {"des": "A friend who had eaten here during her last Chicago visit recommended Siena Tavern so I did my online research, made a reservation and looked forward to what I hoped would be a memorable meal and dining experience.<br><br>Siena does not disappoint. It was quite lively and fairly full when we dropped by about half an hour earlier than our reserved time.  We could have easily been told to head for the bar and wait until our appointed time but the hostess took only a minute to make the adjustment and lead us to a table overlooking the outdoor dining area.  It was a perfect place to watch what others were ordering and then quickly try to identify each dish on the menu.<br><br>Our server was a delight. He took time to answer our questions, made sure our drinks never ran dry and generally talked about the food with a great deal of knowledge that helped us to narrow down our choices.<br><br>There was never the push to go for the pricer items on the menu. Sometimes it isn't even about running up a bill but encouraging customers to order more than they can comfortably eat.  That was not the case. For me, the pasta entree I selected was a perfect portion and quite frankly I would not have wanted to waste a single bite of it so I was glad I passed on any appetizers or salad.<br><br>The decor throughout this spacious dining spot is tasteful and comfortable. There was a private dining room we took a look at on our way out that was quite elegant but the rest of the restaurant is classy and somewhat casual.<br><br>Everything we enjoyed was just delicious. It was the sort of meal that I never wanted to finish and quite likely will not forget.<br><br>A lot of thought, a good deal of planning and a whole bunch of pride has gone into making Siena Tavern a top notch place to know and to recommend.", "pics": null}}, {"review": {"des": "Casual dining in river north, trendy and casual.Food was amazing. Their squid ink pasta with lobster was ridiculously delicious. They also have a great bar sit section where you can sample some good wines with your appetizer. The service was great, the staff very attentive and friendly.", "pics": null}}, {"review": {"des": "We visited Siena Tavern for lunch today.<br><br>Service - fantastic! Our server was super friendly and informative, helping us understand the history of the restaurant and made several suggestions.<br><br>Ambiance - also fantastic. The restaurant definitely has a sexy style and hosted a wide spectrum of patrons. It does a great job of feeling exclusive yet welcoming.<br><br>Food - unfortunately this is where the restaurant failed us. I had the Shaved Brussels Sprouts salad and added chicken. The vinaigrette on the sprouts was lackluster and nothing exciting was going on with this dish. The chicken was dry and didn't help. My SO opted for the chicken sandwich, which he agreed was lacking seasoning and his chicken was also dry. However, we were both drooling any time we watched a pizza pass our table and I think we ordered the wrong lunch! All of the pizzas looked incredible. I had a cappuccino at the end of our meal and it was lovely!<br><br>Great service, great energy, just make sure you order the pizza!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZUDNeUUNmeqB-njUb_nFOQ/348s.jpg", "caption": "Shaved Brussels Sprouts salad - add chicken -$17"}]}}, {"review": {"des": "I enjoyed my meal and drinks- got the avocado toast and thought it was really good. People I was with got the Cesar salad, but weren't huge fans of the kale in it. Overall I liked the food, but am giving 3 stars due to service. We came for a lunch last Friday and sat outside around 130/2, and the service was insanely slow. We had someone join us late, and it took them roughly 10 mins to come by  to ask for a menu", "pics": null}}, {"review": {"des": "I love Siena Tavern. Our favorites to order are the coccoli, brussel sprouts salad, and the meatball. Service is always fast, efficient and nice.  They are also incredibly kid friendly.", "pics": null}}, {"review": {"des": "Wow! A restaurant I definitely recommend you go to if you're looking for American/Italian cuisine. Siena Tavern has a young, upbeat vibe to it. But it is also definitely a good date spot as well because of its dark ambience.<br><br>We sat at the bar and had Adrian serve us. He is the nicest bartender I've ever met! He thoroughly went through the menu with us, and recommended many great dishes to us with detail of how the dishes are cooked. He also gave us recommendations for bars to go to afterwards.<br><br>We ended up ordering the carne pizza which is a typical marinara pizza topped with all different kinds of meat. The dough is made from scratch, along with all the sauces and creation the dish. If you're a meat lover, then I would recommend this tasty dish! <br><br>The Squid Ink Lobster Pasta fish was to die for!! It was already split into two different plates when we received it which was very nice because they saved us the hassle of splitting the dish. LOVE LOVE LOVED this dish, so it is a MUST if you come here!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HD3sAfpGSEeWWST9naV9_g/168s.jpg", "caption": "Squid Ink Lobster Pasta"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/T5_KXspkQ6KP1rk29OACtg/168s.jpg", "caption": "Carne Pizza"}]}}, {"review": {"des": "A rather subpar and disappointing experience overall. I think this Italian establishment is a bit overrated. <br><br>Upon entering, we were not greeted warmly. The hosts stared at their phones for 2 minutes before assigning us two seats. <br><br>Our server was friendly and the service was quick. We ordered the bruschetta, the spaghetti, and the gnocchi.  <br><br>Overall, the sauce on all of the pasta was too thick and too heavy. I could feel the butter slowly draining in my throat. The flavors were nice, but everything became hard to eat after a while. <br><br>The bruschetta was by far the worst dish of the three. The toppings didn't go well with the bread whatsoever. There was hardly any cheese, which should be an important element in a bruschetta dish. Gordon Ramsay would have an agonized outcry if he saw the bruschetta that was presented to us. Not Master Chef worthy. <br><br>The gnocchi was alright. It indeed melted in your mouth, but the sauce was still too heavy. Everything was just too rich in the pasta dishes. <br><br>Overall, this place was a bit overrated for my girlfriend and me, and I think there's far better Italian restaurants elsewhere in Chicago for the price. I walked away feeling somewhat disgusted and stomached with too much sauce.", "pics": null}}, {"review": {"des": "Our server Kara was wonderful. She was so nice and funny. She also made sure the kitchen accommodated my sister's nut allergy. Kara was humorous and good-natured. We had a great meal because of Kara's great service!<br><br>The food came out extremely fast which is also a plus!", "pics": null}}, {"review": {"des": "I can't say enough good things about Siena Tavern. I have tried multiple things on the menu and I am amazed at how delicious the food is every time. I have never had a bad experience here, reservation or not.<br><br>Starting with the tasty appetizers, I literally dream about their burrata it has this unique tomato jam that I can't get enough of. Their bruschetta was very good as welI. I usually start off with their meat and cheese platters. It seems a little pricey but it is so worth it, especially the chef's selection of meats and cheeses. I haven't had a chance to try their salads yet but from the looks of it, they seem great too. <br><br>Next is Pizzas: Never would I ever expect to love pears on a pizza, and I am usually pretty adventurous but this prosciutto pear roasted garlic cream pizza was phenomenal! The cinque formaggi pizza and the margarita are also good but the prosciutto pear really wins when it comes to pizza here!<br><br>Pastas: Hands down my all time favorite pasta in the city has to be their perfectly executed pappardelle pasta! I never imagined something so simple could taste so amazing. The best gnocchi I've ever had is also at this restaurant and I can't get enough of the addition of the pancetta. Their orecchiette pasta was also good but I'd rather order something from the items above over this. <br><br>Dessert: The famous bomboloni! It comes in a group of four bombos with three different sauce/custard flavors. I really enjoyed these more than the ones at Bombobar/Bar Siena as they are smaller and came nice and hot. Their gelatos are also good, with a large selection of flavors. I love monkey bread and was happy to see that they have a delicious one here. I liked their caramel cookie jar was tasty but i'm not a huge caramel fan so it is just based on preference.<br><br>Drinks: I have loved every single drink I have ever ordered here but my absolute favorite is their No. 29  (belvedere, prosecco, grapefruit, lemon, mint, strawberry). They have a cool selection of craft beers as well.", "pics": null}}, {"review": {"des": "Thanks to Yelp, another solid pick for great Italian food in a modern groovy setting!  The space is half bar to the left, half restaurant to the right.  The bar area has a dance floor so it is not a place for a quiet cocktail.....it's a place to elbow your way to the bar, get your drink on, and people watch.<br><br>The restaurant is an upscale dining experience, the food is solid (I had the brick chicken).  The meatball appetizer was great - the sauce delicious.  There is a solid wine list.  The tables are cozy...the noise level is a bit high but it will keep your energy up as you head out to your post dinner partying!", "pics": null}}, {"review": {"des": "Amazing meal - fun atmosphere - great service! Loved everything we ordered from octopus to lasagna. Unique flavors, generous portion sizes. Can't wait to go back", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2J9RFNEIhI3-wYeRUsFoQg/348s.jpg", "caption": "Menu"}]}}, {"review": {"des": "Love this place!! Came here on a Saturday night for some drinks with a friend. The whole place was super crowded but we luckily grabbed two bar stools at the mini bar by the pizza oven.  Our bartender was amazing! Very attentive and nice even though he was swamped. We each got three drinks. Two from the menu of cocktails and then our bartender was kind enough to make us custom pomegranate martinis for our last round! We weren't very hungry but we kept seeing the amazing pizzas being made right in front of us so we had to try one. We ordered the margarita pizza which was amazing! <br><br>Overall it's a great environment with great gooand yummy drinks! I will definitely come back!", "pics": null}}, {"review": {"des": "I can't begin to say enough good things about this place.  This place is great for date nights, girls nights or after work happy hour.  I have been here multiple times and am never disappointed with the service or the meals. <br><br>Starting with the appetizers, the meat and cheese platters are a bit pricey for my liking.  The bruschetta is my favorite. Light and easy. <br><br>Pizzas: The cinque formaggi pizza and the margarita are great.  Can be enough for one person, or split. <br><br>Pastas: Hands down the pappardelle pasta is the best. The gnocchi with added pancetta, so great. I would choose one of these two over the orecchiette pasta. <br><br>Dessert: The MONKEY BREAD!<br><br>Drinks: I have loved every single drink I have ever ordered here but my absolute favorite is their No. 29  (belvedere, prosecco, grapefruit, lemon, mint, strawberry). They have a very unique selection of drinks and craft beers!", "pics": null}}, {"review": {"des": "Visited last night with a girlfriend and scored a pair of bar seats around 7:30 which I must applaud myself for as the place was packed on a Friday night. My friend and I had a great time and split the meatball, which was huge, a side of brussel sprouts, and a kale salad. They split the salad for us in the back, which was nice. This was the perfect amount of food for us.  The meatball was seriously amazing and comes with a side of toasted bread for dipping in the marinara sauce which was tart and sweet at the same time. I had the No. 2 cocktail which was good and my friend had the No. 12 which she loved. The service was fast and attentive and they have TVs. Only downside is it is a bit loud.", "pics": null}}]}