{"name": "simply-it-chicago", "reviews": [{"review": {"des": "After an hour boat ride at night, my friends wanted some hot noodle soup. We found this place to be closet to where we were at and still opened till 10pm.  <br><br>After 3 miles Uber ride, we walked into the store. They told us that they were closing early and we could take it to go. We were disappointed because it's inconvenient to take pho back to hotel. Also, it's a bit farther, the food might get cold. As we were discussing if we should go to another place, the owner saw us, and then he told his worker to open the dining room for us. We truly appreciated he stayed and served us as we had some hungry peeps in the group :p<br><br>We got beef pho, beef ball pho, and shrimp hot and sour soup. We enjoyed the pho soup base. Will come back if we are in town again.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4GGRgRDuAJLgCTUwl42EYQ/168s.jpg", "caption": "Hot and sour soup with shrimp (3/5)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WusHennYy51izbQWHHjd-g/168s.jpg", "caption": "Beef ball pho (5/5)"}]}}, {"review": {"des": "Simply It, if it was for food alone, I'd give you 5 stars.  I had the crispy chicken egg rolls which came out cooked perfectly.  Nice and crispy, temp right between warm and hot, and the dipping sauce was the perfect combination of sweet and spicy.  I had the stir-fried pineapple calamari which was delicious.  The pineapple flavor did not overwhelm and the cauliflower was a nice surprise among the broccoli and carrots.  My partner had the spring rolls which he said were the best he'd had in a long time and, for his main dish, had the spicy basil and jalapeno beef which he loved and which I tried and thought was superb.<br><br>So why only 3 stars?  Because we had, what might be, one of the worst servers I've ever had in a restaurant in my life.  She knew not a single item on the menu.  My partner ordered the spring roll and she seemed unsure so he pointed to it on the menu.  We proceeded to have to do this with every single item.  You have only ONE calamari dish but, when I ordered it, she had no idea what I was talking about.  When we finished our meal, we moved the dishes to the side and we were clearly done.  She walked past us at least 4 times without acknowledging or asking us if we were done, wanted dessert, etc.  Finally, while she was standing beside our table with her back to us, my partner said to her, \"Could we get the check and could we have the rest of the beef wrapped up to go?\".  She looked at us and then walked away.  After 5 minutes, she returned with boxes where we had to put the food in ourselves (I hate that at ANY restaurant) and stood by the table waiting for us to pay.  He looked at the bill, I looked at the bill, we got out money and she stood there the entire time (meanwhile ignoring the other 8 tables with customers) and waited till we got our money together.  It was tacky, it was rude, and incredibly uncomfortable.  I was tempted to leave no tip but I could not do that because I am an ex-server and can't bring myself to do that.  I don't know if she's a relative of someone who owns the place or works there but, she made what would have been a terrific meal into an unsatisfying experience.  We talked about it after she left the table and even in the cab ride home because we had never had a server do that before.  Please, please, please train her or find another position for her before she drives customers away!", "pics": null}}, {"review": {"des": "Ordered the Fisherman's soup, and it is just PLAIN. The broth has no flavor in it, I would guess a soup with seafood would taste rich and umami, but it is just boiled water with couple pieces of fishcake, two mussel meat and one half cut shrimp. <br><br>There's just NO FLAVOR!!! And we waited more than 30 minutes for the Pho and noodle to be served, when there isn't much crowd in the restaurant. Very disappointed, this place really is slipping down the hill...", "pics": null}}, {"review": {"des": "This spot is one of my favorites in the area. The service is always wonderful. The owner is incredibly friendly, always there and even offers free tea or lemonade on occasion. I have always felt warmly welcomed when I'm there.<br><br>While I can't say the food is hands-down the best Vietnamese food I've had, it's always good and it's always satisfying. I've been here several times now and have never had a bad meal or experience. I typically go for the beef flank pho but would also recommend trying the grilled lemongrass beef appetizer (anything lemongrass here has been delicious). <br><br>Their milk tea is pretty good considering this area of the city is lacking in many options. The boba itself has sometimes been a little over or under cooked. If you're picky about your boba, I'd recommend just going with the tea or smoothie sans boba.<br><br>Overall, it's a great spot with the kindest staff and owner!", "pics": null}}, {"review": {"des": "Yummy yummy yummy! I had the chicken Pho it was so good. The broth was the best part. It tasted amazing. The noodles were second best thing in the bowl! I believe they making in store. Also the spring roll were very fresh. We will be back!", "pics": null}}, {"review": {"des": "I met up with a friend here and had been craving pho all day. It was national noodle day, and i was on the hunt for some good noodles so i could do my part and participate in this national holiday. It had just started getting chilly in chi-town and nothing warms me up like a big bowl of soup....noodles are just a plus! I ordered beef pho, and it comes dressed with all the toppings a girl could desire. The broth was delicious and enough to feed two people easily...but i was HUNGRY. I pretty much finished the entire bowl to the point where i was drinking the broth like It was the last of the cereal milk. I'm basically the president of the clean plate club. Very pleased with my first pho experience in my new city!", "pics": null}}, {"review": {"des": "I haven't been here in years! Recently, we decided to go again since we were in the neighborhood. The food is still delicious!<br><br>Each time we've been here recently, I've gotten an order of dumplings for an appetizer and the large pho (you get to choose 2 meat additions).<br><br>The owner has been so kind and generous! One of our orders didn't have any \"grilled shrimp\" and he was able to substitute it with another side for us and gave us extra meat in the entree. :) Very kind of him and definitely not expected of him to do so! <br><br>Will definitely stop by again for more when we are in the area!", "pics": null}}, {"review": {"des": "Overall the menu is reasonably priced. I ordered the Pho: it was delicious! Fresh, savory accompanied by fresh garnishes.  Staff was very friendly.  Tidy place.  Definitely will be coming back here.", "pics": null}}, {"review": {"des": "Solid food at decent prices.  We only did the soups this time but they were all good and we will order again and try more.", "pics": null}}, {"review": {"des": "This place used to be my favorite Vietnamese restaurant!  I hadn't been here in maybe a year or two but still crave their sandwiches!  I was a little disappointed with this visit.  It feels like they've started to skimp on things...<br><br>Likes:<br>-They have the best lunch specials which comes with lemonade or tea, salad, soup, mini egg roll, entree, and fruit for less than $10.  <br>-Their lemonade seems fresh squeezed and isn't too sweet.  <br>-Their sandwiches are still as delicious as I remembered<br><br>Dislikes<br>-They changed up their salad dressing, which now seems like it was a reddish vinegar. <br>-Service was not as good as I had remembered.  I think the owners waited on us and forgot to give us the menu after everyone eventually arrived.  <br>-Then we didn't get our lemonades even after entrees were served.  I had to remind them. <br>-We also were never given any fruit.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/N38xGS1PxfS2g1s23LlFYg/168s.jpg", "caption": "Beef banhmi sandwich with mini spring rolls"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qOb8ZnNCakGJSgSc84aq1A/168s.jpg", "caption": "Grilled beef banhmi"}]}}, {"review": {"des": "Uncle and his food is the best! One of my friends discovered this place a few years ago and it's become my go to for good Vietnamese food(and I live blocks from Little Vietnam). I've had everything vegetarian from there since my friends are vegetarians. My favorite non-veg dish is the Beef Mango.  My favorite bahn mi from there is the roasted duck.  This place has great atmosphere and great food thanks to the great chef.", "pics": null}}, {"review": {"des": "I've come here several times, and each time I have enjoyed my visit. Obviously, the place is known for its fuh, which is very tasty and award winning. Last time I came though, I decided to get something different and ordered a noodle dish that was supposed to have shrimp, beef, and calamari in it. When it came out, I wasn't able to find any shrimp. I let my waiter know and he went and talked to the chef and owner. The owner then came to my table and let me know they didn't have the shrimp for that dish, so he brought me a complimentary plate of coconut shrimp and shrimp tempura instead. The man was very apologetic and super nice, and I really appreciated his gesture. I will definitely be back.", "pics": null}}, {"review": {"des": "Really nice Vietnamese food there! I love rolls&pho there. They're almost tasked like what I had in Vietnam. Bring so much good memory back to me.The environment there is clean and quiet. It's a good place for hanging out with friends and families. The most important thing is the price is really affordable for their quality. I'll go there next time for sure.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hoqsxGzFzUOwN5aohI206w/348s.jpg", "caption": "Spring roll"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aAmEL93TVgTdXgnKXoUPEg/168s.jpg", "caption": "Egg rolls"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/H2dYwixhLsx8T2C-RdmlkA/168s.jpg", "caption": "Environment"}]}}, {"review": {"des": "5 Stars every time. I have been ordering take-out and eating here for many years and it still remains one of my favorite restaurants. Simply It is a staple in the Lincoln Park area and the owner, Tuan, is always there to welcome you and make sure you're taken care of. <br><br>The food is wonderful and feels like you're eating a home-cooked meal every time. <br><br>If you enjoy light but satisfying cuisine - this is the perfect spot for you. The ingredients are always fresh, the atmosphere is warm and welcoming and the dishes never disappoint. I recommend it to anyone that is looking for authentic feel good food - the beef noodle soup, dumplings or banh mi can't be beat. No gimmicks here - just 100% great Vietnamese food.", "pics": null}}, {"review": {"des": "Best pho in the city of Chicago. The service is friendly, food is quick, and atmosphere is casual. It's BYOB which is a huge plus as well. <br><br>The delivery is amazing. When you order the pho they separate it all into containers so the meat comes raw for you to cook in the broth. I'd give it a 6th star if I could!", "pics": null}}, {"review": {"des": "First         SIMPLY IT<br><br>1. Order \"Jumbo\" Grilled Shrimp. Shrimp were 50-60ct <br>      (smaller than my curled pinky and only 5 in order.<br><br>2. Pho was cold and blah. Tank Noodle has best Pho in town if you want <br>      great Pho.<br><br>3. Shrimp salad had 3 of the \"jumbo\" shrimp split in half.<br><br>Small cheap portions - POOR VALUE = NO VALUE!!!<br><br>Restaurant rules - if you cant sell it high enough to make money and satisfy the customer - DO NOT offer it because these items make  everything else on the menu not worth coming back to try.   <br><br>2nd time we have tried SI - Last time we will try SI<br><br>We ordered over $100.00 of food first time and most was inedible but we thought we would give them a second chance because of the reviews and we love vietnamese food. <br><br>SECONDLY - <a href=\"/redir?url=http%3A%2F%2FDELIVERY.COM&s=fddc6ff06b33f2d60d4bb162681143ece74a3e46b6a15880021d32600b5b1b73\" target=\"_blank\" rel=\"nofollow\">DELIVERY.COM</a> is the WORST DELIVERY SERVICE EVER and will cost SIMPLY IT their business because their DELIVERY is soooooooooooo bad you don't want to ever order again from the location and it is truly such a bad experience It makes any issues with the food impossible to overcome. AND WE TRIED SI twice !!!!!!! <br><br><a href=\"/redir?url=http%3A%2F%2FDelivery.com&s=bb92e95e0800aa71b476a53653ae5b293cc8cbd35ff0f32e359bb2225369522e\" target=\"_blank\" rel=\"nofollow\">Delivery.com</a> - WORST DELIVERY SERVICE EVER!!! STAY AWAY!!!!! HORRIBLE !!!! Phillipines Call Center - We have tried <a href=\"/redir?url=http%3A%2F%2Fdelivery.com&s=609b2d31420216f9eba23465871ae01c6c8912717f0ab28d274af73b53d57cc8\" target=\"_blank\" rel=\"nofollow\">delivery.com</a> 3x's. <br><br>Lower prices than GrubHub and NON-EXISTENT Service from Phillipines Call Center. <br><br>We have ZERO respect for any US Company too cheap and that cares so little about their paying customers to not use USA operators. Everyone knows foreign call centers DO NOT WORK. THEY COST business. Save your pennies <a href=\"/redir?url=http%3A%2F%2FD.com&s=c44f66759db70f172ccef6af412fafcacdc738245260c0d95a9861ec140ca55c\" target=\"_blank\" rel=\"nofollow\">D.com</a>. You wont be in business long relying on foreign call centers!!!!!!  <br><br>Someone in the Phillipines or Asia that hates Americans will never provide good service. <br><br>LOW LIGHTS: <br>1. Over an hour past the delivery time and no call. <br>2. When food arrived driver said not paid for. PrePaid in advance with tip which we requested credit. Added three calls and 20 minutes to food already cold. <br>3. Driver spoke zero English.<br>4. WORST PART- <a href=\"/redir?url=http%3A%2F%2FDelivery.com&s=bb92e95e0800aa71b476a53653ae5b293cc8cbd35ff0f32e359bb2225369522e\" target=\"_blank\" rel=\"nofollow\">Delivery.com</a> <br>a. Poorly trained operator hung up onus after waiting 10 minutes for understaffed Phillipines operator to answer.<br>b. Waited on hold ten more minutes before hanging up to call again. <br>c. When finally got thru the barely speaking english operator actually told us they were too busy to help and call the restaurant!!!!!!!!!!!!!!!!!<br><br>STAY AWAY FOREVER <a href=\"/redir?url=http%3A%2F%2FD.Com&s=4baf029e0f52c8e480a933fed492e399b787b18f52cbb159259fb5cd84ec85af\" target=\"_blank\" rel=\"nofollow\">D.Com</a> !!!!!!!!! YOU and your foreign operators SUCK!!!!!!!! <br><br>D stands for DUMP <a href=\"/redir?url=http%3A%2F%2FDELIVERY.Com&s=08f6bed5248aebcdbc2e2d628646013a104706b5e7f0867c8feceb6eda6cae79\" target=\"_blank\" rel=\"nofollow\">DELIVERY.Com</a> as fast as you can and never consider to order with!!!!!!!<br><br> SIMPLY IT needs to stop using <a href=\"/redir?url=http%3A%2F%2FD.com&s=c44f66759db70f172ccef6af412fafcacdc738245260c0d95a9861ec140ca55c\" target=\"_blank\" rel=\"nofollow\">D.com</a> or no one will order online........ after awhile........", "pics": null}}, {"review": {"des": "On Sunday, September 16th: I ordered the Lemongrass Chicken dinner with the standard white rice.  When I picked up the order, the separate white jasmine rice had a funky smell to it, as if it had gone bad.  The rice looked okay and not old.  I took it back to the restaurant and asked their staff to smell it, to ensure my sense of smell was not faulty.  The man, who (I think) is the owner of the place, was extremely apologetic about this.  I was treated to a brown rice upgrade and a free smoothie for the trouble.  This is terrific customer service, and it speaks loudly about the passion for running a great restaurant.<br><br>Once that was settled, the mix of sweet bell peppers, jalapenos, lemongrass and fresh herbs with the stir-fry chicken was cooked to perfection.  My threshold for jalapeno peppers is lower than I'd like to admit, but it provides a nice \"kick\" to the dish.<br><br>I look forward to dining here again in the future!", "pics": null}}, {"review": {"des": "I was really excited to see a Vietnamese restaurant in this area.. but have to say I was so disappointed. I really wanted to like this place but I feel that I wasted my money. <br><br>I will give 4 stars for the service as they were very kind, but 1 star for the food. <br><br>This is the worst pho I have ever had in my life.. no flavor in the broth with very little protein (we even ordered the combo and it was pitiful).  No matter how I tried to flavor it with the seasonings, it did not work. <br><br>We ordered the papaya salad .. that was disappointing too.. the papaya was cut too thick  (not shredded) and difficult to chew and it also lacked seasoning. <br><br>We thought the lemon grass beef spring rolls were average and it was a nice touch to have an option rolling it yourself or have them roll it for you. <br><br>They seem to be busy so I'm assuming people must like it.  I hope the proprietors take this as constructive criticism and make improvements because the neighborhood could use a great Vietnamese restaurant.", "pics": null}}, {"review": {"des": "Wow! Really good food here. Staff and especially the owner is super friendly. You get so much for your money and the prices are very reasonable. <br>I highly recommend Simply It!", "pics": null}}, {"review": {"des": "After finding out that a popular Indonesian place down the street had a 45 minute wait, my husband and I starting looking for a good place to eat in the Lincoln Park area. We stumbled upon Simply It and saw that it had awesome reviews. We called to see how long the wait was and the owner told us a couple had just left and they could get the table ready in 15-20 minutes. Perfect! <br><br>Upon arriving (about 2 minutes later), we were quickly seated and noticed there were plenty of open tables including a huge table which was \"reserved\". We ordered the avocado wontons for appetizer, lemongrass chicken and the chicken curry. About 30 minutes later, the server brought out the wontons and 2 lemongrass chickens. We told him that we ordered only one lemongrass and a chicken curry. He seemed confused and took it back. Another 15 minutes later (and after I had eaten about half my food), I asked the server how long the curry would take. He replied, \"About 5 minutes\". So we decided to wait thinking they're probably making it fresh and it takes time. But another 20 minutes passed and the server came back saying the chicken curry was never prepared!! We cancelled the order, paid for what we ate and left. <br><br>I have never experienced worse customer service in my entire life. The server had no idea what was going on and honestly didn't really seem to care. As far as the food goes, the lemongrass chicken was okay but the wontons were horrible. There was basically a big chunk of avocado and a big piece of cream cheese inside a fried wonton. This place really needs to work on its service and hire better servers.", "pics": null}}, {"review": {"des": "Decent Asian place. Liked the pineapple fried rice with calamari, lots of veggies. The fried rice is pretty good too, huge portion.<br><br>The papaya salad is ok.", "pics": null}}, {"review": {"des": "Placed an order online on grub hub. The pickup time for the meal was right when the restaurant opened. I figured they must open the kitchen earlier. Nope. When I showed up for pick up, they were very flustered and told us it would take 15 min to make the sandwiches. Ok.<br>They threw together some sandwiches, lots of mayo, not enough meat or veggies for the banhmi. The chicken wasn't well seasoned and was a bit watery. Overall just a miss.", "pics": null}}, {"review": {"des": "I'm not a pho expert but I will say I've never had bad pho. This place did NOT live up to expectations. <br><br>First we sat down and ordered food. There were no utensils at the table set. Then the food slowly came out.  We ordered spring rolls, pho, and fried rice and all of it was just off by either being dry or no deep flavor.  Fried rice was likely forgotten and I assume they wok'd in a hurry because it was dry with no flavor.<br><br>My wife asked for some of the sauces and I dont even think she got it and they never came by to refill our waters or ask if we needed anything. Only plus side is that the elderly gentleman came to ask what we were missing because the fried rice dish didn't show up and one of us didn't have our food. <br><br>Anyone who says the pho is good here must seriously not know pho.", "pics": null}}, {"review": {"des": "Food: The food was alright. It doesn't taste super authentic but I wasn't expecting it to, so it met expectations. The vegetable pho broth tastes really bland, so I'd probably get a dish instead of pho next time. We also had a beef pho and the broth tasted better for that one. We got the spring rolls and, while small, they are good appetizers to share! And the lemonade you get for free for checking in to Yelp is extremely watered down.<br><br>Service: Despite it not being too full, the service was slow. We didn't get menus until a couple minutes in, and we ordered two phos and the spring roll appetizer.<br><br>The pho bowls came first, after a bit, and then the spring rolls and then finally the vegetables and sauce for the pho. Seemed to be in the reverse order of what you'd expect. It was frustrating since we were hungry and that bowl of pho was sitting there in front of you but we had to wait to get the vegetables and appetizer for several minutes and the pho had gotten cold.<br><br>Atmosphere: Quiet enough to talk, and probably a nice date spot if you don't mind the slow service and average food.<br><br>Overall I'd recommend other places over this, but if you're looking for a broth-based dinner I'd say come here with all of the above in mind!", "pics": null}}, {"review": {"des": "Simply it is great.  I've been coming here since it opened. The owner is really friendly and I love the Pho", "pics": null}}, {"review": {"des": "It's great! Very flavorful. We had the beef soup and the duck sandwich. They were really good. Perfect  spice, great bread, quality meat. Very fresh.<br><br>The owners are super nice. Nice, bright space.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OWu7g_ejU4tTibSmRsQjwA/168s.jpg", "caption": "Duck"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/52W9hjwvcrMkycduuwml9Q/168s.jpg", "caption": "Beef. Delicious!"}]}}, {"review": {"des": "If you like good service and good pho do NOT come to this place. Pho is terrible and the steak with asparagus is mediocre. The egg rolls were good though. But if you're just coming for pho, don't. The service was also terrible. Took 30 minutes for my pho to come out, and that was only after I asked the server where my food was. My boyfriends food came out 15 minutes before mine. And mind you, this place was not even packed. The owner was sweet. I would really recommend them to get some new staff and to improve on their pho recipe. So sad to spend money on food I did not enjoy.", "pics": null}}, {"review": {"des": "Potstickers were decent. Sauces were good. Pho, both chicken and beef, were terrible. The broth was so sweet that you could tell there was a lot of MSG. Do not recommend!", "pics": null}}, {"review": {"des": "I gave them another shot and ordered lunch through Fooda. Packaging was sloppy, bahn mi filling was minimal, bread was dry and the eggroll was a soggy mess. The container was held together by a measely piece of tape, leaving the rest open and my food exposed. They could have put more tape on to actually seal it shut, or put the container in a bag. It looked tampered with but could have been beat up from the delivery service. <br><br>This place has gone downhill and is more like Simply NOPE!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VOdi7tvCAmtDCwKTnj73mw/348s.jpg", "caption": "Food was delivered like this, no bag or extra tape to keep it shut."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VTo-RLaA5uuxyiWqun3NZg/168s.jpg", "caption": "Soggy eggroll"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZFSU_TJvmW7eXVdy3wSphA/168s.jpg", "caption": "Gave them another shot....still disappointing."}]}}, {"review": {"des": "Simply It has become one of my favorite restaurants! The food is fantastic, and definitely worth the price because they give you enough to feed a small army and the flavors are amazing. It's a beautiful place and the staff is friendly and welcoming. I would say that you probably shouldn't be in a hurry when you go because they don't hover over you and they don't rush you into ordering. But the food comes out in a timely manner after you do order, and it's worth it! Highly recommend it.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oDw2IXjCfCF_AkfEBfuQCw/168s.jpg", "caption": "Noodle Curry (veggie) and Avocado Wantons"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qA32JSfTJ-L4-taFkcnxxw/168s.jpg", "caption": "It's a gorgeously decorated place :)"}]}}, {"review": {"des": "Had the pho bo- delicious!! I've never had it served with plum sauce and Chile sauce before. Very good! Quiet, intimate tables - would be a good date location.", "pics": null}}, {"review": {"des": "Most homey place to visit! I walk in and feel welcomed right away. The owner, Uncle, is a true gem; sweetest man on the planet and worth visiting alone! My go-to's are always the fried veggie dumplings, veggie pho and the lemongrass tofu banh mi, oh my god soooo delicious  don't snooze on the smoothies either. that's what I love about Simply It's menu, the diversity! There's something for everyone.. vegetarians, meat-lovers, vegans, pescatarians... the list goes on! This restaurant is as authentically Vietnamese as it gets in the heart of Lincoln Park. Worth every bite  I'm a customer for life!", "pics": null}}, {"review": {"des": "My favorite place to grab a lunch or dinner with friends and family, always good service!", "pics": null}}, {"review": {"des": "I'm a big fan of this place, the food and overall how dedicated the owner, Uncle Tuan is to his business. He single-highhandedly runs his business and do everything for his employees and his customers. He never takes a day off and yet, when you see him, he will always greet you with a smile and open arms.<br><br>Since my last review in 2013, I've since ordered delivery a couple of times (great way to surprise the hubby at work) and catering for my mother's 60th surprise birthday party which had about 30 people. I was able to talk to Uncle Tuan on the phone, we texted and customized the menu which had over 6 choices and he arranged for delivery pick-up to meet me half way since I lived outside of his delivery zone. He was always willing to work with me and kept me up to-do-date on all the details so I knew when the food was being made, being delivered and prep instructions. The food came freshly made, flavored right and the portions were more than enough. His catering food was the star of my Mother's party and many people asked where did I catered from. I had gotten the Banh Cuon (Vietnamese rice crepes), Lemon Grass Chicken, Grilled Beef Short Ribs, Simply It Special Noodles and Fried Rice, and Beef Skewers to just name a few and everyone really enjoyed it. <br><br>I really wish that this restaurant was in my local neighborhood because it would be a place that I frequent often. Sadly, I write this review to ask for your support from fellow Yelp community and friends who shares my love for food and ethnic cuisines. While business has been good on the delivery side, I've learned that dine-in rate has slowed down due to the location and competition. The restaurant could be facing some tough decisions in the near future so I wanted to be transparent and urge you to come and check it out. Please tell your friends to check out the food and see the unbelievable level of customer service for yourself. There is always a Yelp check-in deal and a promotion for the visit. <br><br>This is truly a one-of-a-kind family owned business and Uncle Tuan is really an uncle to all visitors. Please come and help support his business and check out his food and flavors. He is always opened arms and all ears for feedback and suggestions on how to make the food and service better. He truly cares about his customers, his food, his brand and his work. <br><br>I'm not related to him at all and this review is from my perspective as a long-time patron who really values his business in the Chicago community. At the heart of Chicago, we are all about small business and diversity, keeping this restaurant in business would be the one good thing you can do to make an impact on the community. Highly recommend that you check out this place!", "pics": null}}, {"review": {"des": "I absolutely love this place! The beef pho is delicious and the portion size is generous for the price. I also really like their spring rolls, the sauce that comes with them is great. Simply It is one of my favorite places to get pho in Chicago, I highly recommend checking it out", "pics": null}}, {"review": {"des": "If you are looking for good service and food Simply It is not the place to be. We were seated at our table and waited about 15mins for one of the staff members to greet us. There were 5 staff members on duty and somehow the service was still slow and disorganized. While seated we waited another 10mins for water, after they had taken our order. While the food came out quick the taste was bland and left us dissapointed. The decor was stylish with exposed brick and Vietnamese paintings.The best part about this place is the fact that it was BYOB so I could wash away the taste of my food with wine to at least give it some flavor.", "pics": null}}, {"review": {"des": "Four tables in the whole place and service was slooow (maybe a lot of take out orders). Cream cheese/avocado wontons we're the best part. Pho was okay, duck curry wasn't bad but just weird: seemed like someone took a bag frozen veggies and a cooked duck breast and threw it in a curry. Also curry came out at least 10-15 mins after everything else. DO NOT GET THE FREE LEMONADE THAT YELP OFFERS... it's gross", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8P3FWMoYKNDjJnMWAk6qYA/348s.jpg", "caption": "Getting ready for some good phooood!"}]}}, {"review": {"des": "The first thing I must say is the owner here was an incredible guy. Amicable, sweet, and helpful person. When we came here at 11 a.m. on a Sunday morning, we were the very first customers that day. He came out, sat next to us, and told us his endless stories. We ordered Spring Rolls, Chicken with Sticky Rice, and Beef Pho. The Spring Rolls were really fresh and delicious. The Chicken with Sticky Rice was close to its original version in Vietnam. The Pho that I had was a little strange, though. The broth was flavorful, the onion was cooked just right, and the beef was luscious. However, there was no green onion, an irreplaceable ingredient in any bowl of Pho, at all. Quite strange. The side dish vegetable also came in a generous amount. Overall, the Pho here was as good as it gets.", "pics": null}}, {"review": {"des": "I've come back to this place after four months,and it's still exceptional.ive never had such great pho, usually I try these places and none of them taste as great as simply it,and  uncle tuan was so nice and wonderful felt like I was family here.the waiters were such nice people,and even though there was 7 of my buddies,we still got all of our food on <a href=\"/redir?url=http%3A%2F%2Ftime.place&s=11a7b8c6eae43d4cbc20a7493a9f801c0a9a5118fda312e6e501aeea20f2e87c\" target=\"_blank\" rel=\"nofollow\">time.place</a> just keeps  getting <a href=\"/redir?url=http%3A%2F%2Fbetter.im&s=1d84d73980c2effa02283018bc45ec4e2f30768e4d5051e6efd00ebd531ee0a9\" target=\"_blank\" rel=\"nofollow\">better.im</a> very satisfied and will continue coming here.", "pics": null}}, {"review": {"des": "This is my favorite Pho place in Chicago. It's run by a family and the owner is always working hard every time we come. They have really good food here and are never too busy -- you'll most likely get seated right away! Friendly service and get atmosphere.  They also serve complimentary tea, perfect for winter, and orange slices at the end of your meal. <br><br>-good for large groups<br>-good for families with babies<br>-great food<br>-have lunch specials<br>-pho and banh mi are amazing <br>-great prices <br>-wide variety of dishes<br>-vegetarian options <br>-friendly service", "pics": null}}, {"review": {"des": "I really don't have much to say about this place except that it totally hit the spot when I was out looking for something good to nosh on over lunch a few weeks ago. Everything was tasty, the portions were generous, the dining area was roomy and bright, and the bill was \"why-would-anyone-go-to-McDonald's-when-Simply-It-is-an-option\" level of next to nothing! <br><br>One note: if you're as easily confused as I can be, just know that the dining room is in a separate space next to the counter area. You need to go through the room that looks like it has no seating in order to get to where the seating is located. Pretty sure I looked like an idiot going back and forth trying to figure that out!", "pics": null}}, {"review": {"des": "My family has known Great Uncle Tuan for over 30 years and every time we come to visit he always treats us so well. Parking is fairly easy. We are always greeted with a warm and personal from him and everyone. The decor is a cute fusion of American and Vietnamese. The food is authentic and always very flavorful. Great Uncle Tuan is always going around every table offering suggestions to Vietnamese food that people wouldn't have noticed before.<br><br>The vegetables are fresh and meat is flavorful. I recommend the pho, papaya salad, spring rolls and their delicious banh mi and smoothies. <br><br>Highly recommend to any and all my friends. <br><br>Looking forward to the next time I visit and eat delicious food and have great conversation with the owner.", "pics": null}}, {"review": {"des": "Love the bahn mi, this place is pretty far from us so the delivery times are a bit longer then normal.  This last order quoted 100 minutes but was delivered in about an hour which was great!  Also enjoyed the vegetarian steamed dumplings.", "pics": null}}, {"review": {"des": "I live in the neighborhood and this is my favorite spot to get carry out or grab dinner with friends. Not only it is BYOB, but the owner is so friendly. They always have my order prepared and include veggies, fruits, sauces, and lots of fortune cookies. <br><br>I recommend the regular brisket noodle soup, and the avocado wontons!", "pics": null}}, {"review": {"des": "I always wanted to try a rice cake, wrapped in banana leaves.  The aroma from this simple dish is enticing at other restaurants.  Though I had to get used to the texture, the dish was pretty good.  Additional seasonings in on either the chicken or the rice bean paste would really kick this up. <br><br>The spring rolls were as expected, fresh and simple.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XjJl6pwxnPsJyiRkjEDImw/168s.jpg", "caption": "Chicken sticky rice wrapped in banana leaves."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2ilNDTg3YbzDPmkMzwSt_A/168s.jpg", "caption": "Shrimp spring rolls"}]}}, {"review": {"des": "Great food, good service, and the ambiance adds to the experience. I would highly recommend.", "pics": null}}, {"review": {"des": "This place is the epitome of hospitality. The owner, \"Uncle\", makes us feel like we're at home anytime we are there. <br><br>The food is also amazing. The crispy noodles are my favorite, but the avocado wontons appetizer is hard to beat! I also love the chicken pho.<br><br>Very chill BYOB atmosphere.", "pics": null}}, {"review": {"des": "This needs to be your go-to place for Vietnamese food. The owner (I call him Uncle) is the nicest guy ever, and he will treat you like his own family. I'm always greeted with a smile and feel so welcomed. <br><br>As for the food, I've tried a variety of dishes here, and I haven't gotten anything I didn't like. My go-to appetizer are the avocado rangoons - you need to try them. The prices are extremely reasonable, and it's also BYOB!!! Thank you Simply IT for being amazing!!", "pics": null}}, {"review": {"des": "Food was extremely bland and my soup came about a half hour before my husband's sandwich- by the time it arrived I had already finished eating.", "pics": null}}, {"review": {"des": "Best Pho in the city and I love the chicken rice cake which is wrapped in a banana leaf.  Dining in is my favorite because their staff is so friendly but the take out is just as good and they are quick to deliver. Today they also gave us an extra app \"on the house\" which was a nice surprise.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aI6SoMIQ8s3YieC20zPYWA/348s.jpg", "caption": "Beef pho"}]}}, {"review": {"des": "Owner is really friendly! Great customer service and excellent food! I ordered the chicken egg rolls and they were light and crispy. I also got the beef noodles and oh my god were they amazing love the veggies and salad that it came with. This place is an absolute must will be back for sure!<br><br>Went back again and food is still amazing if you're in the area and looking for a great bite to eat this place is a must!!<br><br>Thank you Uncle xoxo", "pics": null}}, {"review": {"des": "One of me and my girlfriend's favorite fine dining pho place. The owner always says \"welcome back!\" Like today. Love this place. It's has a little less options than most restaurants but the taste of the pho is so good. Tops all the other pho places except for my other favorite - King's Pho. But the best pho in Lincoln Park for sure!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wJbCTTUnzq2o_onWPlfoiw/168s.jpg", "caption": "Catfish lunch special"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Vh1taNTNGC_lXZ9LhQCrSw/168s.jpg", "caption": "Pho with meatballs and brisket"}]}}, {"review": {"des": "I've dined in here and had delivery. Menu is pretty standard and really is very similar to Thai and Chinese places alike. Food has always been good but nothing memorable. I also don't think their vegetables are very fresh so I probably wouldn't be in a rush to order from here again.", "pics": null}}, {"review": {"des": "I have dined in twice and ordered the pho both times. The pho does not disappoint! Broth is tasty and is fantastic for chilly days. The regular portion size is perfect for me, and is only about $8. The also have an XL size for pho which is a great deal if you're splitting. <br><br>They have a wide variety of delicious looking options on their menu. I'd love to go back and try their other stuff out (if I can resist the pho!) This place is BYOB, which is definitely a plus. And the staff here is also very friendly, especially the guy who always greets you at the door with a smile.<br><br>Be sure to check in on Yelp to get a free lemonade!", "pics": null}}, {"review": {"des": "The ultimate litmus test for pho is the depth and richness of flavor in the broth. Good pho should also served piping hot. I respect that it's a family-owned business, but the broth was light, watery, and some of the blandest I've ever had. I'm continuing on my quest to find a solid bowl here in Chicago.", "pics": null}}, {"review": {"des": "This place is nothing short of fresh, fabulous, fantastic, and frivolous. One wanders in to the dusty enclaves of Simply It to be greeted by what can only be described as a wholesome, friendly, and eager staff. <br><br>But that aside - the spread is to die for. My girlfriend came here requesting pho (which was delicious btw), but me, being my unconventional and donkeybrained self, went for the lunch special. <br><br>A note about the lunch special. For the meager price of 8-10 dollars, one receives the following items: a salad, a bowl of soup, egg rolls, tea, and a main entree. <br><br>The day was cold, windy, and contained some precipitation that day, my friends. And yours truly selected the beef basil as his entree. And Holy cow. Did I hit the jackpot. My entree was coated in a caramelized glaze of pure goodness and ecstasy, complete with fried onions, carrots, and even a simple fortune cookie for dessert.<br><br>Ladies and gentlemen, when selecting your next food venue in Lincoln Park, the name says it all: this place is SIMPLY IT.", "pics": null}}, {"review": {"des": "The goi muc - calamari salad - one of the best things I have ever eaten!", "pics": null}}, {"review": {"des": "Super great spot! Had dinner here before seeing a Greenhouse Theatre show and had some amazing chicken dumplings and for dinner had the pork lemongrass - not to be missed! Friendly service and good, filling food.", "pics": null}}, {"review": {"des": "We wanted to try Vietnamese cuisine, one of my friends suggested this place. The place is really nice and cozy. Waitresses were warm and welcoming. We ordered a number of appetizers: spring rolls, egg rolls, dumplings and avocado wontons. I liked the dumplings the most. These are called momo in south eastern Asia. In the entrée I ordered Caramelized pork and egg with rice. It was very sweet, I wouldn't have that one probably again. My friends ordered beef noodles soup. It was delicious they said. However the quantity is very filling. I couldn't finish the pork pieces. The whole experience was nice.<br>One last thing, if its possible check in on yelp right while you are there, you will receive a free lemonade. I checked in on yelp and got one. The waitress so friendly, as a token she gave all of us free lemonades. Now as a token I am giving them a 5 star.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QzKsmRyXrgD4pkdYiXee7A/348s.jpg", "caption": "Check in on yelp to get a free lemonade."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uUnSPf1UYyTljCeVQJ23YA/168s.jpg", "caption": "Beef soup and noodles."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YFVPh4Eul-2-aDLR1HlHyQ/168s.jpg", "caption": "Caramelized pork and egg with rice. Very sweet"}]}}, {"review": {"des": "Found this place after googling pho places near me and I am so glad I strolled in. Walked over on a cold night and ordered some beef brisket pho. I didn't realize it was byob so i dropped the ball there. The pho was awesome and some of the best i've ever had. The family that runs the joint is so kind and make you feel at home. The crowds started rolling in so it is clearly is a must hit spot. Cant wait to go back. <br>Dinner for two was under $20!  You cant beat that", "pics": null}}, {"review": {"des": "Ordered two times during my stay in Chicago. Good service, good food, happy stomach!", "pics": null}}, {"review": {"des": "Great Avacado-banana-coconut with bubble smoothie! So creamy! Would 100% recommend! The veggie rolls were very fresh. Small place, with calm atmosphere. Not the best air conditioner, only complaint.", "pics": null}}, {"review": {"des": "Simply Terrible! Vegetables with bok choy came with no bok choy. The vegetables were just like the bagged frozen vegetables in grocery stores. The clay-pot chicken so dry it was inedible. Nonexistent service to top off our $40 experience. #RunAway", "pics": null}}, {"review": {"des": "The restaurant was warm (literally and figuratively) and welcoming right when we really needed some nourishing soup. But the food was actually pretty mediocre -- a vegetable roll that was more strange than good, a lackluster beef pho broth, and our vegetarian dining companion reported that her broth was even more lacking. Still, there's a limit to how bad even mediocre pho can be...", "pics": null}}, {"review": {"des": "If you want to look for the most reasonable price with good service and good food, Simply it is the one.<br><br>I would recommend 3 of my favorite: <br>Fish in claypot<br>Chicken Pho<br>Beef soft rib<br><br>They always have welcome drink, which is great. Plus, Rachel makes great Avocado Smoothies.", "pics": null}}, {"review": {"des": "Ordered their Simply Its Beef Noodle Soup (pho Bo) to go and it was perfect. The way they separated their ingredients kept everything fresh. The chili plum sauce was surprisingly really tasty and had just the right amount of heat. Glad I have a healthy restraunt so close to me. Can't wait to try other items on their menu!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gYaIQOecKV-ur0-KNXi9JA/348s.jpg", "caption": "Simply Its Beef Noodle Soup (pho Bo)"}]}}, {"review": {"des": "My experience here was marred by poor service. I was not expecting this after the restaurant was recommended by a few friends who I are with and were similarly disappointed. Perhaps they were training new employees? In any case, the restaurant was operating at approximately 50% capacity at dinner time on Sunday and service was still very slow and frustrating. Our party of 9 ordered dishes that usually come out fairly fast at other Vietnamese restaurants (pho, bahn mi, vermicelli). Somehow our order got mixed up as 8 people received their entrees at varying intervals -- e.g. 3 dishes would come out, then another two would come out 5 minutes later, then slowly one, one, one. We all finished at different times. And even one patron in our party did not receive her entree until we asked where it was -- the staff had mistakenly marked it as a to-go order.<br><br>Even as the dishes were being served, the server did not know who ordered what dish, and we couldn't really point the server in the right direction because he didn't know what dish he was bringing out. <br><br>\"Who ordered this dish?\"<br>\"We aren't sure, can you tell us what it is?\"<br>\"No, I don't know, they told me to bring it to your table\"<br><br>Service aside, the pho carried great flavor and I will return again to have it again at a later date. The bahn mi was average. The vermicelli was not the typical vermicelli dish served at Vietnamese restaurants -- this one was served as a chicken stir-fry plate with a side bowl of noodles.", "pics": null}}, {"review": {"des": "I had not had Vietnamese food in years, and planning a theater outing, we decided to include dinner and my friend, said the location and food were right. And, despite a delay for her order, we both were more than satisfied. I had the pork lemongrass! Yummy!", "pics": null}}, {"review": {"des": "Uncle Tuan is such a friendly guy. I'm glad to have discovered this restaurant several years ago through a catered lunch at work in the loop. As work lunches for a large crowd usually goes, there were plenty of leftovers, and I was glad to help reduce waste, even though I wasn't taking part in the meeting :P I remember there was a tray of Pan-Fried Chicken Dumplings and a tray of Shrimp and Green Papaya Salad that day, because I LOVED them so much they became my go-to items when ordering catering for my personal events. <br><br>Tonight was the first time I've actually visited the restaurant (after having ordered catering at least twice and regular delivery several times). It was so great to finally meet Uncle Tuan after seeing so many people rave about him here on Yelp.  He's such a sweet man.  Made us feel so welcome.  BTW, the lemonade (limeade) is nice and refreshing :)", "pics": null}}, {"review": {"des": "Best customer service I've had at any culinary establishment. We rolled in 20 minutes before closing on a Saturday night. They first brought us complimentary fresh delicious iced tea without us even asking/ordering. We ordered an x-large pho and the lemongrass chicken banh mi, both of which came in wonderfully filling portions and were delicious. We wanted some extra noodles after finishing the pho just because the noodles were so fresh and good. Even though the kitchen had already closed and we were the only customers left in the establishment, they re-opened the kitchen and boiled extra noodles and brought it to us in fresh pho broth with extra onions and cilantro without us even asking just because they didn't want us to eat the noodles with the old lukewarm broth we already had. It was past closing at that point and our waiter came by multiple times to tell us not to worry and to eat slowly. At the end of the meal our waiter brought out fresh melon for us without prompting. Honestly some of the best viet food we've ever had and the best service we've ever had at any restaurant. I can definitely see why they were voted the best pho in Chicago! Will definitely be back every time I'm in the city.", "pics": null}}, {"review": {"des": "Oh boy, the beef mango dish here is delicious. Very filling. Absolutely juicy. Vietnamese food is extremely underrated, thankfully Chicago is chock full of diverse restaurants such as Simply It.<br><br>Just tried the basil beef yesterday. Amazing spices all over the beef and mushrooms, with some peppers to give it an extra kick. The roasted duck Bahn Mi is Godly, although it's a bit too much bread for me.", "pics": null}}, {"review": {"des": "I came here on the saturday and it was full of customers but I always feel welcome when the old guy always welcomed us with the smile and made us strawberry smoothie . Their avocado wonton is a must - DEFINITELY have to try it . I was craving for Pho and they didn't let me down , i would rather coming here than going to Argyle Vietnamese town , the combo without tripe added tofu is my favorite and I love they actually use lime instead of lemon like others. Even tho it was full the 2 girls really tried to work out and helped each other , they have really good eye contact with the customer and they gave me a big bowl of rice when I just asked for a small one . This is a must place to go if you are craving for Vietnamese food and this is where I feel Home after 3 years being in Chicago !", "pics": null}}, {"review": {"des": "Awesome lunch special. Comes with so much food, super fresh and tasty. The service was slow for how few people were in there during lunch time. Looking forward to coming back though to try it again.<br><br>Got the lunch special with ginger chicken, super good. Came with soup, salad, egg rolls and rice in addition to the entree.", "pics": null}}, {"review": {"des": "Welcoming doesn't begin to describe this place. <br>The only thing better than the food is the service.  The extensive menu has something for every palette, and the prices are far too low for the portions and amazing ingredients!  i have my favorites but am always excited to try something new too!  <br>I really think this is a hidden gem.  Recently gone through a refresh, both the menu and the restaurant itself have a great new look.  <br>Even though they have been here for years, there are many in this city that have yet to try it!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4pJssQ36tF1IAH-sXEma1w/348s.jpg", "caption": "Fresh Fresh Fresh Rolls!"}]}}, {"review": {"des": "When not in the mood for cooking, I do not know how many times I've ventured out on Lincoln Avenue, glanced up and down the advertisements all preening for a swipe of my card or a exchange of a bill, and then, either after flipping coins, Google searching local restaurants, or finally giving up the whole thing and rummaging through the fridge to see what could be scrapped together, still found the best route to be a phone call to Simply It. <br><br>Greeted with a smile and the exchange of some pleasantries each time I've walked in to pick up an order, Tuan and his staff work extremely hard to leave indelible impressions of warmth and kindness, and when recalling each conversation prior to paying for a meal, I can, indeed recount nothing but fond words exchanged. <br><br>And this feeling of talking genially with a neighbor leaves no small trace of happiness when it finally comes time to unbox the food at home. Pouring the pho, which I always get with meatball, into my stainless steel bowl, I eat with a special kind of joy that you only seem to get when you've established a relationship with one who prepares your food, especially when that food is downright fantastic. The bahn mi is splendid, and I urge you to try to duck. I've dipped that particular sandwich into a bowl meatball pho at least six times in the past month. I mean, that's how great this place is. Each portion is rather generous and prepared with ingredients that are undoubtedly fresh.<br><br>Last night, I had had the spaghetti with beef and egg rolls. Again! It is just wonderful. Mixing up the greens with the noodles, paring each bite of tender beef with a portion of sweet sauce , it was hard for me to read while enjoying this damned good supper.<br><br>If you didn't read this, that's ok. You just need to know this, I suppose:<br><br>1) Order the duck sandwich <br>2) Dip that sucker into your meatball pho<br>3) And be sure to save your side of fruit for last.<br><br>Be well,<br><br>C", "pics": null}}, {"review": {"des": "We ordered avocado wantons, banhmi veggie sandwich,and veggie pho. All of them were flavorless. Forgettable experience. We asked our server to do something about it but she had no idea what to do. Not going back again. Very DISAPPOINTED. I have had pho at many places, this one one of the worst.", "pics": null}}, {"review": {"des": "We got delivery from Simply It. <br><br>-I thought their smoothies were really good and it really satisfied my sweets cravings.<br>-The eggplant with garlic dish was pretty bland, and most of it is still sitting in my refrigerator and it's been a struggle getting myself to finish it. <br>-The chicken pho wasn't the best I've ever had, but it was good. The vegetables that came with the pho were not fresh though. A lot of the bean sprouts were brown, the basil leaves had spots on them and the cilantro was very limp. <br>-Shrimp and mango salad was alright.", "pics": null}}, {"review": {"des": "At least they are consistent! Ordered from here again and after 2+hours, received unimpressive good. Ordered some sort of Vietnamese ravioli appetizer which came as basically a pile of mushy noodles with some cucumbers and basil on top. No idea what that was, but it was inedible. The Pho broth itself was flavorful- but the meatballs were tough. Final conclusion... drive up north when j want palatable Vietnamese food.<br><br>As a side note- the owner was very apologetic about the long delivery time and seemed genuinely concerned. Of course this doesn't make up for subpar food and crap delivery. But I appreciate good customer service.", "pics": null}}, {"review": {"des": "The wifey and I were a little under the weather and were craving some pho. Simply It is really the only reasonably close VN food purveyor close by without having to go all the way up to uptown. <br><br>This place is a bit different than normal pho establishments in that you order based on sizes, so we ordered and XL and were given smaller bowls to refill. I liked it that way. I also ordered spring rolls which were really good and my daughter also liked. I give it 3* because the pho was not overly flavorful and there was not a ton of beef in it. That said, it is incredibly convenient so I will definitely be back.", "pics": null}}, {"review": {"des": "Ordered beef soup carry out. Packaged separately with fresh rice noodles, sprouts all very tasty. Would recommend ordering take out.", "pics": null}}, {"review": {"des": "I went to simply it because it was recommended by a friend. I'm now reconsidering this friends taste's buds after the experience at simply it. The first problem was that the service was simply atrocious. We waited so long to order our food. We waited so long to get food and they forgot to put in our order of dumplings so we had to wait even longer for that. Nothing we ordered was stellar and a few were even subpar. In a city with so many good Vietnamese options, simply it is a hard pass", "pics": null}}, {"review": {"des": "Simply It gets an A for effort - the bahn mi is what keeps me coming back, but there is room for improvement in other areas.  Bread for bahn mi sandwiches appear to be made in house - very fresh, soft inside with a crispy crust though not exactly traditional French bread.  Roasted duck bahn mi and lemongrass chicken bahn mi were very savory and tasty.  I've tried complimentary fruit with your food is also a very thoughtful touch!  I wasn't expecting mayo in the sandwiches, and there was too much of it, which adds creaminess, but I recommend asking for no mayo to get the best flavor from the pickled carrots and pickles.  <br><br>My next favorite thing from the menu are the lemongrass pork spring rolls (street food section).  They are excellent as an appetizer and filling enough for lunch.  Pho was decent for the area/convenience though not as good as Argyle.  I also tried the mixed berry smoothie, which was delicious.  Real fruit was used, but frozen rather than fresh like other places.<br><br>Edit: Figure in extra wait time - my last take-out order took 45 min.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/L1G-ooCG77_poM29lLC_AA/348s.jpg", "caption": "Grilled lemongrass pork spring rolls"}]}}, {"review": {"des": "Absolutely love this place. Delicious food and affordable. <br>My friends and I walked in on an extremely cold day and we were served some hot tea to warm us up, as soon as we sat down. Hospitality was great and the food was phenomenal. We shared dumplings and veggie rolls to start. The sauce that came with the rolls was so delicious that we asked them to keep it on the table. <br>As an entree, we all ordered the beef soup also known as pho. Hands down, some of the best vietnamese I've had.", "pics": null}}, {"review": {"des": "This is my favorite Vietnamese restaurant and I recommend it to everyone. It has a cozy ambiance and the staff does an amazing job of making you feel welcome and apart of the neighborhood. Defiantly a neighborhood restaurant that remembers you when you walk in. The food is amazing and the menu has lots of options to choose from that you can't go wrong on. My favorite is their \"Simply It's Beef and their smoothies\".", "pics": null}}, {"review": {"des": "Tried the papaya salad, shrimp spring rolls (rice paper ones, not fried), vegetarian dumplings and shrimp pho (just asked them to add shrimp in the vegetarian pho). Food was very average, not tasty at all. The only good thing we're the dumplings which were steamed and fresh. Papaya salad was bland, had to ask them for extra fish sauce to add more flavor. Pho needed lots of sauces to make it spicy. Would not recommend and likely will not go again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/j4E9pYfiTtuKQpGnhBSUWg/348s.jpg", "caption": "Veggie dumplings"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gHnd0l6-ErDEOJXR-xl4EQ/168s.jpg", "caption": "Spring rolls with shrimp"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MbqV2BzaTr6iGwJ1YaNv0A/168s.jpg", "caption": "Papaya salad - bland!"}]}}, {"review": {"des": "We really enjoyed the food at this restaurant. But given that we have certain dietary restrictions the inability of anybody in the building to speak fluent English is very troubling. It would serve them well you have at least one person on staff who speaks English.", "pics": null}}, {"review": {"des": "This restaurant is delicious and offers plenty of options for vegetarians. I have loved every meal I've had there!", "pics": null}}, {"review": {"des": "I love the chicken pho soup but have found other menu items to be different than described. Tonight's delivery was a perfect example: eggplant dish lacked ingredients listed and was way too garlicky. Disappointed.", "pics": null}}, {"review": {"des": "Awesome! The ingredients were fresh and delicious. I enjoyed the spring rolls. . The iced coffee was perfect to end the meal with. This was my first pho experience--- the amount of liquid can be a little intimidating. Delicious nonetheless", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XQPw5X7pXwBPw6w49pRHlQ/348s.jpg", "caption": "Tamarind shrimp with veggie broth substitute"}]}}, {"review": {"des": "The nicest employees around. Delicious rolls and soup that can cure any illness. Great time at Simply It.", "pics": null}}, {"review": {"des": "Love this gem of a restaurant! Cozy, comfortable atmosphere with soft music that allows one to actually converse! Fantastic food (loved the sticky rice, clear glass noodles, and pho!) with well-balanced flavors. Very reasonably priced. Good turnover, did not have to have a reservation to be seated right away on a Saturday night.<br><br>Great place for anyone who is interested in healthy meals and good conversation.", "pics": null}}, {"review": {"des": "This place was my first Vietnamese restaurant but I liked the food and decorations. Appetizers was good and the main dish was also delicious. The waiter didn't know much about the menu and couldn't help us.", "pics": null}}, {"review": {"des": "Review is only for delivery, but this place is about as good as it gets for Asian food delivery. The sandwiches are very affordable, and the pho portions are enormous (the XL is two meals). Also, the care they put into the delivery experience (the packaging of the liquids is impeccable, there is usually a complimentary fruit surprise) is awesome.<br><br>All of this is only worth talking about, of course, because the food is delicious. The sandwiches are rich in flavor, and the pho has that deep cleansing broth. There is a delivery fee, but every restaurant in the area has one.", "pics": null}}, {"review": {"des": "Sick<br><br>This place is gross. Makes me sick just thinking about the food. Everything was bad -- especially the beef pho.", "pics": null}}, {"review": {"des": "Love this place- the owner is so nice. Love the food as well. Clean and good food! Can't beat that", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7XLb2B5yBMgipeAp08WnZQ/348s.jpg", "caption": "Strawberry & blueberry smoothie"}]}}, {"review": {"des": "I was disappointed when the pho place closed down in Logan Square. Finding Simply It has me forgetting all about that place! The Pho is delicious, hot and hits the spot. The egg rolls are very well done as is everything I have tried in this diner. Very friendly staff and the man who does the cooking is a wonderful human being. I am in a wheelchair and originally went to the diner down the street. Glad that it was not accessible or I would not have discovered Simply It. Stop in and give this place a try. Located close to the Depaul campus, excellent food, great company.", "pics": null}}, {"review": {"des": "The food is good, but the service is great. I came here a few times, and sometimes with a groupon but other times without. <br><br>The manager, an older man, would always greet us with a happy face. Once we sat down, the servers promptly brought us water/tea. Sometimes, they would bring us lemonade on the house. Our go-to is always the pho. We've also had the fried avocado wontons, summer rolls, and the lemongrass beef that we can wrap ourselves. All were very good.The bahn mi sandwiches are also a good supplement to any meal for only $5. <br><br>After our meal was wrapped up, the servers would always provide us with whatever fruit was in season- grapes, blueberries, oranges, watermelons.<br><br>I've also ordered take-out from here once or twice, and the food always arrived fresh and hot. They even provide fruit with the takeout orders. <br><br>I'm so impressed by the management of this place and how friendly the staff are and will definitely be back.", "pics": null}}, {"review": {"des": "sandwiches was dry and had a little amount of meat. Sandwich was 90% veggies. Sad will not order again. <br>The 2 was for the pineapple lemonade and smoothie both were great", "pics": null}}, {"review": {"des": "We came here for lunch while in the area. Simply pretty good.  To start, we had the shrimp spring rolls. Yummy.  We split the beef pho and the pork banh mi. The beef pho was good although I've had better.  The meat was a little tough and I was expecting a bit more flavor in the broth.  The star was definitely the pork banh mi. It was delicious. It is the perfect combination of french bread, pickled veggies, flavorful meet and some jalapenos (although I skipped them since they were very spicy that day).  I think next time we will get two sandwiches instead. The lemonade was also very fresh and perfect for the hot day.  Service was also pretty good.<br><br>It also doesn't break the bank - $25 for the two of us.", "pics": null}}, {"review": {"des": "Really wanted some late night pho and simply it came though!!  I will definitely be ordering from here again!", "pics": null}}]}