{"name": "sip-coffee-house-and-garden-chicago", "reviews": [{"review": {"des": "I just moved to Chicago from San Francisco, aka the land of hip coffee shops, so entering Sip Coffee made me feel right at home. <br><br>Can't speak for the coffee because I didn't order any this time around, but their chamomile lavender latte was absolutely delicious! Ordered with 1/2 sugar and soy milk instead of half and half. <br><br>This coffee shop is a great place to get work done because it has plenty of tables and outlets. It's also relatively quiet and has great, ambient music that'll really help you focus. <br><br>I will definitely be back soon! Shoutout to Sip Coffee for a great first experience.", "pics": null}}, {"review": {"des": "This place has everything a good coffee shop needs. <br><br>- Amazing coffee that isn't ridiculously overpriced for no reason<br>- Yummy baked goods (croissant sandwich warmed up is my fav)<br>- Friendly staff that makes you feel welcome<br>- Back patio for summer<br>- comfy couch for winter<br>- free wifi (duh!)<br>- And my fav part-- you choose your mug if you're having your coffee there.<br><br>Def worth a visit if you need some coffee!!!", "pics": null}}, {"review": {"des": "Nice, not too loud, and cozy place to catch up with friends for a coffee date or getting work done alone. Place is generally packed even on a weekday, but definitely worth to come for their drinks + ambience.<br><br>Things I consider when checking out coffee shops/café:<br><br>Parking: 3 (there are free street parking couple blocks away)<br>Food/Drink selection: 5<br>Ambience: 4 <br>WiFi:  5", "pics": null}}, {"review": {"des": "An amazing place to do work. The ambience is incredible. The staff is incredibly friendly. There are two outdoor seating parts that you can escape to when it's sunny out. Love this place and have been there multiple times studying for the LSAT", "pics": null}}, {"review": {"des": "Currently sitting in this 5-star worthy coffee shop working remotely for the day and feel like I should keep this adorable space a secret because its THAT good. Unassuming from the outside, the inside is quite large with two outside patio spaces. Free Wi-fi, delicious coffee, smoothies, sammies, and sweets I mean CMON Y'ALL its like a remote workers paradise! I am in and out of Chicago quite a bit these days with work and dont get to explore much but luckily had most of the afternoon to settle in and I'm so glad I found this spot! With its gorgeous open air feel, natural light shines in from all sides and on a warm day like today, the windows are open so theres a perfect slight breeze. You wish you were here right?! I will definitely be stopping back in whenever I am in the windy city because I love love love it!", "pics": null}}, {"review": {"des": "Great place to get some work done! Sometimes it's completely packed on a Saturday afternoon I have to leave. Drinks are great, and the staff will always answer questions or go over any drinks. <br><br>1 star down because I heard a staff member snap at a customer for eating their own snack. Totally get their policy, but could have definitely said it differently to that customer. I felt bad for that customer as I was sitting there, and it just felt super uncomfortable. I could feel my own face getting red", "pics": null}}, {"review": {"des": "Great place to spend the afternoon \"working.\" You order right when you get in and then go down a hallway, where it opens up to a room with couches and tables. We went upstairs to the little lofted area and the ambiance was really nice - kinda made me forget how much time passed by! <br><br>Drinks were good - I got the sip-cago and then later we got the London Fog. I really liked the sip-cago - would def get again. Wifi was a bit slow but not so bad that it hindered getting stuff done!", "pics": null}}, {"review": {"des": "I. Adore. This. Place. The environment is welcoming from the minute you step through the door, its as if youre entering a friends house!  There is tons of seating in the form of tables and chairs, comfy couches, outdoor patio seats, and raised balcony seats.  Not to mention the plentiful power outlets, great spot to get some work done!  <br><br>The staff were so sweet and patient with me taking so long to peruse their extensive menu, and I finally decided on a small sipcago(one of their specialty drinks) and a blueberry scone.  The scone couldve been a little sweeter and more moist, but the coffee was on point!  It had a great balance of the bitter and strong flavors and the foamed milk.  The prices for these were also not bad at all.  <br><br>I would 100% come here again, its really a hidden gem", "pics": null}}, {"review": {"des": "Great coffee house! Wonderful atmosphere to enjoy an afternoon coffee and read or be with friends! Very nice atmosphere inside and great drinks! I really enjoyed the \"Sipcago\"- coffee with espresso and steamed half and half. Delicious!", "pics": null}}, {"review": {"des": "One of my favorite coffee spot especially for the winter. The indoor is actually very warm that you don't have to worry about periodic wind like other coffee shops. The space is very open. They gave free coffee for the people with the same name as the one they put on the chalkboard each day.", "pics": null}}, {"review": {"des": "Number 5 on my list of best coffee shops in chicago! This one has good coffee and really comfortable seating and the friendliest staff. No complaints at all!", "pics": null}}, {"review": {"des": "Thought this place was solid and loved that it's in my neighborhood. It's quaint with some good places to sit. That said, apparently they have a zero tolerance policy for outside food. Like. ZERO. Overheard a fellow patron get scolded. And we had brought in some sandwiches to eat while we worked. So we went to ask if there was any way that we'd be okay eating our food since we had purchased other things from them. NOPE. <br><br>Overall seems like people here are nice and policies are policies... got it. Just won't be going here anymore and they've lost a customer for putting policy before situation/people. <br><br>All good though... just thought I'd share if you're thinking of coming here w some \"outside food\".", "pics": null}}, {"review": {"des": "Sweet staff smile as you enter, the place is spotless, the energy great!!!<br><br>Take that silly sign down...though please about no outside food.<br><br>the drinks are terrific, the space is perfect for even a little meeting. A fab place for coffee in the city.", "pics": null}}, {"review": {"des": "Made the HORRIBLE mistake of bringing a sandwich to this spot. Thought it looked like a nice quiet coffee shop but then I was spoken to very rudely by some ass-hat who supposedly works there (some white guy in glasses) whining about how \"there are signs everywhere\" -- dude, I get it but chill the heck out. Your business was empty and I was sitting alone AFTER I had already bought a coffee. Truly made the experience not pleasurable and I will not be coming back. Do NOT support a company that is rude to its customers.", "pics": null}}, {"review": {"des": "I actually really like it here- the ambiance is great, lots of nooks and crannies to work, good wifi, not too loud or crowded. HOWEVER, i had to take off some points for the food selection - there really arent many options for eating things other than pastries and the vegetarian lunch option is especially sad (saran wrapped croissant with cheese). If they don't allow outside food, at least offer some better options for the customers?", "pics": null}}, {"review": {"des": "Came here for a matcha latte and pastries. During a weekday it wasn't very crowded and my order was made promptly. Price is comparable to other cafes. The banana chip bar was quite tasty - kind of like a dense banana bread crossed with a cookie. <br><br>Ambiance is organic and quirky yet welcoming - there are plenty of tables to sit and get some work done. I would come back again.", "pics": null}}, {"review": {"des": "My new favorite spot! My friend introduced me to this place! Combines my affinity for coffee, matcha tea and plants! The lady who took our service was very friendly and warm.", "pics": null}}, {"review": {"des": "Sip is a great place to sit down just get work done. The room where the tables are is nicely lit. The music isn't too loud or bothersome, and can easily be drowned it out with headphones if need be. The drinks are delicious, and the food is quite good. You can't go wrong with the hummus with pita bread - they even warm it up for you! I haven't had any issues with wifi. The outlets are fairly accessible, too. I think most tables have at least 1 plug in the vicinity. The parking situation is pretty okay, too. There are patches of free street parking nearby, it's just a matter of finding an open spot. After jumping that hurdle, I appreciate that I can sit here all day and just work without worrying about parking. The only annoying thing about Sip is how the manager passive-aggressively starts cleaning up the place 30min before closing time. He moves trash cans and chairs and makes a whole lot of ruckus. <br><br>The things I look for in a study spot and how Sip delivers:<br>Parking: 4<br>Food/Drink Selection: 5<br>Ambiance/Quietness: 4<br>WiFi: 5<br>Outlet Accessibility: 4", "pics": null}}, {"review": {"des": "Love love love this place !! Friendly staff. Very hipster. Affordable. There's so many places to sit to study, even an upstairs! Great for business meetings too. <br>Definitely recommend it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/e66jrxkNocWjvSLyyWau6A/348s.jpg", "caption": "Hazelnut"}]}}, {"review": {"des": "Really cute, reasonably priced, sell coffee and food and have games & magazines. It's quiet so it's good for working and focusing", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/234f4V4LgwUYpPrRzkGcig/348s.jpg", "caption": "lots of seating"}]}}, {"review": {"des": "I'm not normally one to leave a review, but I felt that I just HAD to drop in and say how cool Sip was! I'd been passing this place for over a year and finally stopped in today and was pleasantly surprised by the welcoming vibe and huge array of baked goods available! I got what appeared to be a veggie bagel with cream cheese and it was absolutely delightful. I took a peek at the outdoor patio too and told the baristas I'd definitely be back! Friendly staff, great food, excellent ambiance :) I'd share a picture of my bagel, but it's far gone already!", "pics": null}}, {"review": {"des": "As much as I love my free Starbucks drinks (the rewards program is somehow addicting? everyone loves stars...) I felt obliged to support my local coffee shop, so I finally came here after living two blocks away for three months.  And obviously regretted not coming here sooner.  It's basically catty-corner from a Starbucks but both places seem to get plenty of business, so there are obviously a good number of caffeine hounds in the area.<br><br>Plenty of coffee options, and I appreciate the almond milk option as a lactose-intolerant person (who usually pops Lactaid like it's candy and can't handle too much soy milk--I know, I know, I'm the worst).  I occasionally get the cinnamon walnut coffee cake when I'm feeling like a sugar rush.  The Greek frappe thing actually tastes a LOT like iced coffee I had in Greece, which was amazing.<br><br>A few tips: if you're getting (hot) coffee and plan to stick around, you can pick a mug from the shelves on the wall past the register.  If you want iced coffee, they only have one size cup so no need to try to remember if the small size is tall or grande, neither of which make sense.  There's seating out back, upstairs, and when it's warm, in a courtyard that is pupper-friendly.  The credit card min is $5, but if you plan on coming back regularly, you can load up a gift card with your credit card and not worry about digging cash out of the black hole of your bag when just buying a cup of coffee on return trips.<br><br>I still love mobile order at Starbucks and still go there every now and then when I'm feeling extra lazy, but if I want to spend time at a coffee shop I definitely go to Sip!", "pics": null}}, {"review": {"des": "I won't be back here! Came to meet a client for a coffee (I'm in sales). Got here early with a Starbucks in hand from my last meeting. Was asked what I wanted, and said I was waiting for someone. The owner assumed that meant I wasn't buying from them (false), and kicked me out (no joke) unless I wanted to throw out my drink. She said \"our customers don't like it, and trust me, they will come tell us if they see that you have that\". I don't trust you, and no they won't, because nobody does that, and nobody even notices Starbucks cups anymore...they're everywhere. If you want to be pretentious and rude, don't blame your customers, take responsibility for yourself.<br><br>Ignoring that I was about to order a latte for my client and myself anyway, or that I had a scheduled meeting there, or that I don't want to throw out my brand new $5 iced coffee...This is a coffee house, not a Michelin rated restaurant. People meet for coffee. They use your wifi. They bring their own snacks. Would you have kicked me out for pulling out a snickers bar? You do sell snacks after all...<br><br>If you want to be a social location in 2017, you don't kick out paying customers who have a Starbucks in their hand. And don't shrug like it's not your call when you're CLEARLY the owner from your cocky demeanor. I get better service at Starbucks, and that's saying something.", "pics": null}}, {"review": {"des": "It is a house turned into a coffee place. Loved everything about this place. Cozy and warm. Lovely place to hang out with friends and great for study groups  oh! Plus they serve great coffee! I'd love to go back.", "pics": null}}, {"review": {"des": "i came to sip because i was looking for a study spot with a patio to pump out a midterm essay. although it was a little too cold for the patio on the day that i went, my experience at sip was extremely enjoyable! i got a matcha latte with soy milk, and it wasn't too sweet and really nicely frothy. i also really like the seating at sip as there were a lot of smaller tables where people could get work done without feeling like they took up too much space. the baked goods also looked delicious, and i'll make an effort to try some next time i pop in! overall, i think sip is a great study or catch up spot with delicious drinks!", "pics": null}}, {"review": {"des": "I've never before felt compelled to write a review while still at the reviewed location -- this place is WAY TOO CUTE to resist though!<br><br>Free wifi, ample indoor and (multiple) outdoor seating (chairs + tables, armchairs and sofas too!). Love the look of the upstairs balcony area. I ordered the London Fog, which is a Earl Gray Tea latte. I'm sipping it as I write... it's really good. If I still lived in Chicago, this would be my favorite cafe to read and do work. <br><br>$5 minimum for credit card FYI. But that's not hard at all if you look at all the sandwiches and baked goods they have. :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/T-vXHqNFcqB4hEV2MRul8A/168s.jpg", "caption": "So cute"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2v0-sXFDBkK0tVA1OLXakw/168s.jpg", "caption": "Theres even printing"}]}}, {"review": {"des": "This place is huge! Excellent service, amazing drinks and there's always a place to sit. You won't regret coming here, it's a great spot to pick up a cup, hangout, or study.", "pics": null}}, {"review": {"des": "Looking at the place from outside it looks like a normal house that was turned into a coffeeshop but it's very spacious and has many tables for people to sit around and chill. I went there to meet a friend and just got a Cinnamon Latte from their \"seasonal menu\" which was very tasty! It was exactly what I was expecting from my latte. The shop has many pastries as well as other food options to choose from so I would like to come back and try other items from their menu. <br><br>Also this place is conveniently located close to the highway (I90) so it's an easy spot to meet with someone. Give this place a try and hopefully you will not be disappointed!", "pics": null}}, {"review": {"des": "Very cozy and lovely place to hang our or study or work. And staffs are very kind.<br><br>I love it!", "pics": null}}, {"review": {"des": "The customer service here is amazing! They were really helpful and chill. The drink menu has everything you would want. Literally there are so many options that you couldn't go wrong with. The food options like looked amazing. I got a praline soy extra foam latte and it was delicious to the last sip. It had a nice praline light sweet flavor, smooth, and the espresso did its job. The atmosphere here is that of a true coffee house: not too strong of a coffee smell, really laid back and chill feel to it, cozy, and a nice amount of room.", "pics": null}}, {"review": {"des": "I tried out Sip today and thought it was excellent! I had a mocha with almond milk. The coffee wasn't too rich, but still held the mocha flavor well. Love that they have the option of adding in almond milk. Saw a large seating area in the back of the coffee shop - will be back in the summer with a book! Overall, great coffee, great location, and great set up!", "pics": null}}, {"review": {"des": "Love this coffee house, worth staying arou d to get some work done. They have some food and pastries as well as good coffee and tea. Cool outdoor and outdoor seating with WiFi and power outlets. My favorite in the West Loop for sure.", "pics": null}}, {"review": {"des": "Beautiful interior, relaxed environment. Did several hours of studying here and was very productive. <br><br>Love the mismatched furniture (lots of it), the brick accent wall, and the option of sitting outside. I only wished my cappuccino was served in a mug (like my coffee shop in NC does). Other than that, not bad.", "pics": null}}, {"review": {"des": "We drove over an hour to grab coffee from here.  Best latte choices and creations, awesome service and a buzz that lasts all day long.  5 stars and 2 thumbs up", "pics": null}}, {"review": {"des": "Very nice welcoming coffee shop! Was going to go across the street to Starbucks where I know the coffee but glad I changed my mind! Starbucks is predictable, pricey, also noisy cold and dependent on the barista attitude of the day , they can be rude! This place is just very nice, nice pleasant people, warm atmosphere and the coffee is(Intelligentsia) delicious! Will come again!", "pics": null}}, {"review": {"des": "Very cute place, feels like a cottage. Yummy hummus and pita. Great for studying. I'm excited to see the outdoor seating in the summer time. Upstairs is a little chilly. They've got a printer too! I'll be back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JTu-g2qf3BPFVVnjf6pOnQ/348s.jpg", "caption": "Upstairs seating !"}]}}, {"review": {"des": "I am always on the hunt for coffee houses and places to study all around Chicago, and I am so happy to have found Sip! <br><br>When I first walked in, I thought Sip was the first room with just the sofas for seating! Luckily, if you push past the hallway, you'll find a large room with tons of seating and tables. I came here Sunday afternoon and while all the tables were taken, there was plenty of space on the comfy sofas. I also love that there are outlets everywhere along the walls and that you can use the wifi for however long you need it! <br><br>I didn't care particularly for some of the music playing in the background (personal preference!), but it's never loud, so putting on my headphones does the trick just fine. <br><br>Could not have found a more chill coffee house! Great coffee for good prices and the pastries looked delicious. Will definitely be doing a lot more studying here!", "pics": null}}, {"review": {"des": "Normally I don't review a coffee shop until I've had their coffee, but I'm breaking from the trend.  I went in on this frigid day and had the hot Chocolate.  I just happened to be walking by and what a pleasant surprise.  If I was basing it on the hot Chocolate alone, I might give three stars, but everything else pushed it over the top (I'll be back for the coffee).  The staff was super friendly, it had a very  cute interior and was pleasantly quiet.  Everyone there seemed to be working and even those who were chatting were doing so at a reasonable volume.  No loud music blaring.   Imagine that, a coffee shop where you can enjoy your coffee, study, and here yourself think.", "pics": null}}, {"review": {"des": "Iced vanilla latte with whole milk and ham and cheese croissant are yummy! There is a $5 credit card minimum. Not sure if they have cup discounts for using your own cup because I didn't take the offer for having my own receipt. It would be nice to have that discount and encourage people to be more eco-friendly. <br><br>So much cool art on the walls. I like the chill/electro(?)/upbeat variety of music that's played here. I really like how the register/ordering station is right in front of the door so I knew where to go as soon as I walked in. I like how they have wifi (along with signs that tell you the wifi name and password sitting on tables readily visible) and even a printer! Plenty of outlets around in certain areas.<br><br>Plenty of small tables with 2 chairs, a variety of hard chairs, some couches, and even an upstairs area. I like how there's a lot of natural lighting available and even an outdoor patio with a tree. It's a 1-minute walk from the 65 Grand/Ogden bus stop and a nice walk from the Grand-Milwaukee blue line subway station. <br><br>The restroom is unisex and right next to the register area. There are multiple air fresheners of different scents available, a mirror in front of the toilet for you to look at yourself maybe while you're doing your business or just sittin' on da toilet, and even 3 different hand lotions for moisturizing hands after washing. There's a window and vent in there for good air circulation and it's stocked with extra toilet paper rolls. <br><br>I like this place so far! Thanks for being open!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sJ7iAkG6fsorDVtFrkO4_g/348s.jpg", "caption": "Small iced vanilla latte in my own cup"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7tt3ad1RMvPk7x5dS25JVg/168s.jpg", "caption": "Roasted turkey with sharp cheddar on pretzel roll, toasted. And banana."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZUPvY_2L2PaLysjspGV-zg/168s.jpg", "caption": "Ham and cheese croissant, toasted. It's so fluffy and buttery."}]}}, {"review": {"des": "The perfect study spot. Baristas are genuinely nice, and the fun quirks (Name of day = free coffee, silly mugs...) really add to this place. Everything is fairly priced as far as coffee shops go, and the amount of food options make it easy to hole up for the day here - go through breakfast, lunch, and maybe even dinner if you have to. <br><br>Pros:<br>-Outlets galore<br>-Strong, reliable wifi<br>-Street parking isn't too bad about a block away<br>-Great alternatives to coffee if you're not feeling it (Chai, tea, cider, hot chocolate)<br>-Intelligentsia coffee!<br>-Baked goods! That banana bread. mmmmm<br>-This is a minor one, but lotion available in the bathroom! Incredibly thoughtful for those of us who always lose our gloves in the winter<br><br>Cons:<br>None. Literally, none.", "pics": null}}, {"review": {"des": "Love this place! Very cool layout including an awesome back patio and a small upstairs loft area. It was very quiet and easy to get work done. Excited to come back here soon!", "pics": null}}, {"review": {"des": "Sip Coffee House has got to be one of my favorite go-to cafes in Chicago. Not only is the overall ambiance of the place satisfyingly relaxing and peaceful, but the service of their staff is great. The taste, appearance, and delivery of the coffee are all incredibly superb. This cafe has my patronage even for the years to come.", "pics": null}}, {"review": {"des": "Notes: <br>- $5 minimum credit card purchase<br>- Scattered plugs both upstairs and down<br>- Free wifi and water!<br>- Free street parking if you don't mind walking a block or two.<br><br>One-liner: Perfect study spot. <br><br>Coffee: I got the cinnamon swirl latte ($4 for medium) which was overall delicious - a tad too sweet for my taste but otherwise well made.<br><br>There's a nice selection of lattes and mochas, teas and drip coffee.<br><br>Food: Blueberry scone - Purchased to make the $5 minimum credit card fee but left much to be desired.. The dough was very flat and heavy, no fluff at all. The flavor was fine, but the texture just made it simply edible, and not enjoyable. Hopefully this was just a poor batch and the rest of the pastries usually turn out better! <br><br>Service: Friendly, approachable.<br><br>Ambiance: Great background music, ample seating, conversations can be loud occasionally but nothing a pair of headphones won't fix. <br><br>I look forward to coming back when in the neighborhood.", "pics": null}}, {"review": {"des": "Great spot to work, not so great place for coffee.<br><br>It's a double decker spot with wifi and just a homey environment. Quiet place to sit down w/ your laptop. Charming high vaulted ceilings w/ exposed rafters and a garden. Ample space/chairs. <br><br>Unfortunately I've just never had a drink here that I've enjoyed. Everything always tastes so watered down and the snacks never look that appealing. I guess you can't have it all?", "pics": null}}, {"review": {"des": "This place is so awesome! Huge inside! Came here for a morning coffee and was not let down! My daughter and I shared a nice morning on the patio! <br>She got the zucchini bread and loved every bite of it! This place is so refreshing, we will be back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aiIs2Mp0P1yK4ptVCyKzPg/348s.jpg", "caption": "Morning breakfast!"}]}}, {"review": {"des": "$5 minimum on credit cards! I didn't have enough cash to cover my coffee so rather than making me buy something else, they gave me a first-timer pass. :)<br><br>Awesome spot... lots of space to work, great natural lighting, a little upstairs loft with a couple of tables and the courtyard! I guess it's not courtyard season yet but I can just imagine when they have the tables set up outside. I'll definitely be returning for that.", "pics": null}}, {"review": {"des": "I love that they provide a workable environment that is quiet and calm. I worked on an essay here once for two hours and was not bothered by anyone or even internet accessibility. They have so many different coffee flavors and great food too. They even have vegan suncakes which I cant seem to find anywhere!", "pics": null}}, {"review": {"des": "What an awesome study space! <br>From the front, this place looks pretty tiny. But they have a nice central room, loft, and backyard terrace, so there are plenty of places to sit! Printing and free wifi are a definite plus, as well as the great chill music they had playing. <br>The coffee was good and decently priced, and I'll have to try the pastries the next time I'm here!", "pics": null}}, {"review": {"des": "After cocktails it seemed logical to get coffee before venturing out for cocktails again.<br><br>Sip is so much more impressive once you walk all the way to the back.  There is plenty of seating inside (and upstairs) and a lovely patio/garden area.  Everyone here had their face buried in a laptop though, so I felt a little awkward chattering on with my friend.  We tried to keep quiet, but I suppose this isn't a library, and conversations are not exactly banned here.  They better not be, considering the couple who sat at a table studying and regularly stopped to slobber all over each other's faces.  I was surprised the two dirty hippies didn't throw each other down on the table and rip each other's clothes off.  So much saliva was swapped, I thought I might slip in a puddle of their free-love juice on the floor.<br><br>The guy working behind the counter was the friendliest little adorable hipster boy ever.  I mean, was he even old enough to legally have a job?  He was super nice to us and didn't make fun of my friend when she asked for \"regular\" milk, whatever that is.<br><br>I ordered the \"Suntan,\" a coconut vanilla iced latte.  This hit the spot on the hot and humid day, and the caffeine finally gave me a long sought-after buzz.<br><br>The menu hosts a variety of teas, lattes, mochas, and more.  Unless you have a go-to drink, you'll need a minute to take it all in.", "pics": null}}, {"review": {"des": "Awesome staff and environment. Minimum card charge of five dollars and a cash only tip. It's very easy to hit that minimum though with all the great pastries to share with your Joe. <br><br>The sitting area is dual leveled and there's a private outdoor area in the back away from the busy streets, great jams and super chill. And for those who work from home or at coffee shops regularly they have a printer!", "pics": null}}, {"review": {"des": "Don't let the exterior deceive you. It looks so small from the outside but it really opens up on the inside. There's an upstairs, downstairs, and two outdoor areas so there are plenty of seating.<br><br>The drinks are great and reasonably priced. I ordered the London Fog and it's this creamy but light earl grey tea latte. Not too sweet either! The baristas are also super friendly so TIP GENEROUSLY! <br><br>They also carry Terry's Toffee!!!", "pics": null}}, {"review": {"des": "This is such a great little coffee spot. Beautiful place. Unique set up. The coffee was well made. Great selection of specialty drinks. Very friendly staff. I'll definitely be back soon!", "pics": null}}, {"review": {"des": "This place is the best. I get so excited when I am close by and can stop in. They have a great dirty chai with the right amount of spice, size and the best price (most places  are so expensive for like 8oz) . Everyone who works there is so welcoming as well !", "pics": null}}, {"review": {"des": "This place is very charming, perfect for working or studying even. Quite comfortable and minimal noise. I enjoyed a turkey and sharp cheddar sandwich on a pretzel bun, w/pesto mayo on the side and it did not disappoint. Vanilla Latte was exceptional as well! I can't wait to return! Very helpful and friendly staff!", "pics": null}}, {"review": {"des": "My soy latte was smooth and had a naturally sweet flavor with silky texture! The place itself is neat with multiple rooms and various chair types. They also let you pick your mug (so you can choose a really big one if you want)!! Unfortunately the rock music was too loud for me to study well...", "pics": null}}, {"review": {"des": "I ABSOLUTELY love Sip Coffee House. I came here on a Sunday afternoon to get some work done. It is quiet inviting and has a calm sense about it. I ordered a medium hot chocolate and banana bread. The hot chocolate drink was regular but good and the banana bread was DELISH! I don't drink coffee so I can't comment on their coffee. <br><br>I arrived around 2pm and the place was full, as expected on a Sunday afternoon. There was just one to two seats left on a couch but within 10 mins I was able to snag a table. I suggest coming here early because like most coffee shops, finding a good table and chair seat may be hard. <br><br>I was able to get my work done and the FREE WIFI helped. I believe you get the wifi password once you purchase something. The noise level inside is average but quieter than most coffee shops. Awesome service here too. <br><br>Overall, a great coffee house. Come here to sip on some coffee or tea, chat with a friend on their comfy couches, or bring your laptop and get some studying or work done!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/i4JWMUA1XpIAP3Foel_DTQ/168s.jpg", "caption": "01/19/2014 - At Sip Coffee House"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oS6gJvYLYmyU9XK2Tm452g/168s.jpg", "caption": "Yummy Banana bread at Sip Coffee House"}]}}, {"review": {"des": "As I'm sitting here tucked inside what feels like an A frame house with a lift and a back patio, I feel like I'm back in college in a group study environment.  The front cafe area is in the front and separated from the artsy lounge.  90% of the patrons are busy in their laptops either online dating and smirking or internet browsing, looking for employment, writing a novel, or finding out how to be one with their gadget.  I'm sitting here, in peace, with light feel good music and people watching.  I ordered a small (decent size for me) breve which I'm told means cafe latte made with half and half.  About $4.  I ask for a shot of macadamia, cuz I'm feeling nutty and am doing the hula dance in my head amongst the serenity now environment.  I actually see patrons smiling at other patrons.  This is NOT Starbucks.  Plenty of seats and space and chill music.  Interesting works of art on every wall.  Barista is in a good mood too.  I feel like I stepped into Sedona, AZ.  All that's missing is the crystals.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uA2-wcu9izu0BThxmjNTew/348s.jpg", "caption": "The Island Escape made with almond milk.  Coconut and Mac nut."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZkBfcv-eN8p1iB7WRrOcGw/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/H7rvAiB7E3ws1sYGGHJxYg/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "Such an unassuming coffeehouse.  The front section looks like a small independent coffee shop.  Then whoaa. ..2 outdoor seating areas and an indoor seating area in the back.  Free wi-fi.<br><br>The coffee had a kick, yet smooth taste. The Nut Job Frapachinno is my favorite. The staff is always friendly and welcoming. I am happy to support this local independent coffee shop.", "pics": null}}, {"review": {"des": "I'm still sitting in Sip and am so impressed with every detail of this coffee shop I cannot wait to come back!<br><br>This place has everything...tons of seating space (outdoor and indoor), free wifi, printing capabilities (wow!!), friendly service and to top it off they have really flavorful coffee! <br><br>Sip also has a nice neighborhood vibe. Seems like this spot attracts a lot of locals and one of them even bought me a banana.<br><br>It was a tad difficult to find a parking spot but I will definitely be back, and soon!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ILEGIYKfGmLy7BM6WKsGbw/348s.jpg", "caption": "Printer on site!"}]}}, {"review": {"des": "Awesome coffee house with a plenty of space and couches. Plus they have 2 areas for outdoor space. My new favorite coffee house in Chi", "pics": null}}, {"review": {"des": "Love this place, it's just so cute I can't stand it...<br>Everyone is nice, drinks are great, and the outdoor gardens are little secret treasure in the city! Cheers, Sip!", "pics": null}}, {"review": {"des": "Love this neighborhood cafe! I've traveled the world and no regular latte will do. THIS PLACE MAKES THEIR COFFEE RIGHT!! My co-workers and I now live and breath by Sip Coffee. It doesn't just end at coffee, they also have great baked goods like banana bread, huge assorted muffins and croissant sandwiches! The indoor atmosphere is amazing and huge as well as the outdoor seating. I'm turning into a regular", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/StBq2Aa4we_vwYfubtWn5w/168s.jpg", "caption": "Latte ft. Eyelove sleeve"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nK8o7y4lb80VTHauIT3FDA/168s.jpg", "caption": "Latte+fall"}]}}, {"review": {"des": "There are so many great things about Sip, it should be considered a Chitown landmark (that one is on the house Sip)! I come here often (hence the check ins) because they are one of a kind, and because they're a small business, and small businesses is who I support.<br><br>Let's start with the ambience. Chill place. Very friendly clientele, and even more friendlier staff! Always give awesome customer service, and with a genuine smile! The music they play sets the relaxed mood. Definitely is a helper when you're trying to destress and unwind. They have a beautiful patio and a backroom. Perfect for down time and a java drinking sesh.<br><br>They are also a pretty fun bunch. They have everything from books and mags, to many board games. They also have a thing where they pick 2 names at random (man name and woman name), and if your name is the name that they choose, you get a free cup of Joe! So far they haven't picked my name yet, but hopefully they will soon!<br><br>Their drinks so far are great. I've tried their Green Tea Latte and their Masala Chai Latte (my go to drink!). It's sweet, a bit nutty, and a bit spicy from the spices (subtle hints of ginger). I haven't tried their other drinks yet, but I will soon. Pretty sure they are off the charts good! They also have many snacks such as chocolate chip cookies, vanilla almond biscottis, bagels. You name the coffee shop food, and they got it.<br><br>Give them a try. You will NOT be dissapointed.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ih5zU0H7--7Ch_sc1TlkSQ/168s.jpg", "caption": "Sip Medium Masala Chai Latte"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/g-zPw5mGfSSQy9xbUh3deQ/168s.jpg", "caption": "Sip Medium Masala Chai Latte"}]}}, {"review": {"des": "This is a really cute coffee shop with a nice decor and plenty of seating with tables of 2 or 3 and a couch and chair. It's a nice place to study or get work done or chat with some friends. Prices are reasonable and barista was very nice. It takes a little while to get your drink made which was fine with me because I wasn't in a hurry. But just a note if you are thinking of grabbing something on your way to work/appointment.<br><br>They have an extensive selection of drinks as well as flavored shots to add to your drinks. I ordered the hot chocolate with coconut. I was disappointed because there was no chocolate in my drink at all but the coconut flavor definitely came through which was great. I felt like I was just drinking hot whole milk with coconut. My friend had a latte and said it had a good coffee flavor. I think I would try that next time I come in instead of going for a hot chocolate.", "pics": null}}, {"review": {"des": "- the coffee was very well-made. <br>- nice ambiance for studying, <br>- great staff, <br>- super selection of seating. <br><br>If it weren't too far from where I live, I would be a regular customer.", "pics": null}}, {"review": {"des": "Nice coffee place, and very spacious inside. This place gets pretty crowded in the day, but it is such a nice hangout place, and great for study since it is pretty quite. The price for the foods and beverages are reasonable, and the service are great. Highly recommend this place!", "pics": null}}, {"review": {"des": "I love this coffee house. The decor is everything I expect from an Independant coffee shop and the employees are the best. They remember my order and my name. The baristas always provide quality suggestions about beverages and, similar to a bartender, are considerate and thoughtful when listening to the chatter from the different patrons throughout the day. Highly recommended.", "pics": null}}, {"review": {"des": "I have been to many coffee shops in Chicago, and I do not think I would recommend Sip.<br><br>I ended up going there on a  whim after stopping at Twisted Spoke across the street. I wanted to grab a drink and a dessert to unwind from a busy week. I ended up buying a mocha and a banana chocolate chip bread, and the barista in the front was super nice and friendly. <br><br>I sat down at my table in the back, placed my leftovers from Twisted Spoke on the table, and began eating my dessert and drinking my mocha. Both were delicious.<br><br>A few minutes later, a man approached me and the first thing he said was, \"We don't allow outside food in here.\" I replied saying that I was sorry and that the food was leftovers and I was not eating them in Sip. He repeated that they sell food there and they don't allow outside food. I told him that next time I just won't come in then. He walked away.<br><br>The reason I would not recommend this place is because he did not take the time to notice or ask about the food that was clearly in a to-go container on the table. Instead, he just repeatedly reminded me that food was not allowed in the building. <br><br>I did not appreciate his coldness. He could have greeted me, asked me if I had been there before, and then gently let me know that food was not welcome. He also could have listened when I stated that I did not know that. Instead, he just made me feel incredibly unwelcome.<br><br>I grabbed my stuff, chugged my drink, and took off. I won't be returning to Sip.", "pics": null}}, {"review": {"des": "This little gem is located half-way between the CTA Chicago and CTA Grand blue line stations.  It would take some meandering from CTA Chicago blue line station, but Rosa J.'s legs were made out of irons; they are the most reliable vehicle for me to get anywhere in the city.  <br><br>However, this coffee house is really a gem that you can't pass on when you're in the Near West Side neighborhood.  The price points for the coffee are appropriate for the city of Chicago standard: under $4, you can get a medium-sized gourmet coffee.  From my perspective, if a coffee shop charges more than this price for the same size, I will consider it as \"high\" and will recommend it with reservation, unless there's something else extraordinary, making the price-point criterion no longer as a top priority in my rating.  <br><br>We ordered a medium matcha green tea latte, a medium latte, a red velvet donut, and a yogurt cup.  I don't think the pastries were made in the house, but they were decent.  I'm critical on green tea latte, so what I'm about to say doesn't necessarily reflect negatively on the review.  They made the green tea latte slightly \"creamier\" to my liking, yet I think by asking for skim milk from now on will reduce the creaminess and make it less heavy in terms of the taste.  <br><br>However, the entire venue is very spacious and has some nice comfy sofa seats available.  They even have some seating available on the second floor since the ceiling is high.  My guess is that this place might originally be a condo and was converted to a business.  There's also a backyard, assuming more sitting area during summer time.  <br><br>They also have some newspapers and magazines on the hallway for patrons to peruse at their own leisure.  I did like this place and felt comfortable staying for an extended period of time.", "pics": null}}, {"review": {"des": "Natural light and lots of seating!!! It's a larger space though it looks small from the entrance. <br>The upstairs is my favorite with outlets everywhere and comfortable tables to get work done. Their coffee and hibiscus tea is amazing.", "pics": null}}, {"review": {"des": "They make a mean matcha green tea latte and their customer base on the morning I stopped in consisted of me, a Scottie dog wearing a Cosby sweater, and a really, really old guy drinking out of a brass knuckles coffee mug that I think he brought from home because my coffee sure as came in a regular old paper cup. <br><br>They had me at the matcha green tea latte but they sealed the deal with that tough-ass old guy. I freakin' love this place. <br><br>Not only was my latte delicious, perfect, and affordable (even with the 50-cent almond milk upgrade), but the ladies behind the counter here were speedy as heck and redic nice. I felt like I was visiting a friend more than I was ordering a beverage. Bonus points for being possibly the least pretentious haute beverage shop I've ever been in. <br><br>Inside was adorable and spacious as f*ck. There's an open lower level with tons of natural light from the skylight and there's even a second elevated level for a bit more privacy and an outdoor patio. I loved all the nooks and crannies and super comfortable mix of chairs, tables, and sofas. <br><br>If had to choose anywhere to live in the city, my decision would be based on proximity to this coffee shop. A gal could get used to these kinds of things.", "pics": null}}, {"review": {"des": "Quick service, good coffeehouse music, lots of cool places to sit inside and outside.  A very cute, comfy, and hip little coffee shop.  They also have these cute little cat sushi figurines on their till, maybe that's what makes me love it so much, I dunno but the second I saw them I was in love with this place! :). Very unique little spot, love it!  Latte was very yummy!", "pics": null}}, {"review": {"des": "My absolute favorite coffee shop!! A little tricky to get there (a 10-15 min walk from the Blue line, otherwise car necessary), but totally worth it. Multiple patios, great food and coffee, multiple seating levels... it's incredible.", "pics": null}}, {"review": {"des": "Visiting Chicago and saw this little coffee house in the neighborhood where our AirBnB was located. The place is modern and the staff greeted us with smiles at the door. My wife and I ordered two double macchiatos, you hurt cup and a savory bagel. The coffee was robust and smooth and the perfect temperature, you could tell the barista knew what she was doing. The back patio was inviting and a perfect setting to enjoy breakfast. The prices were reasonable. Will be back for breakfast during my time in Chicago.", "pics": null}}, {"review": {"des": "In love with this coffee shop. It has everything I'm looking for with a quaint feel but actually quite spacious. Decorated with an assortment of chairs, cute pick your own mug, and lots of drink options, I found my new neighborhood coffee shop for west town!", "pics": null}}, {"review": {"des": "I recently started going to Sip as i just moved into the neighborhood. I love the cozy interior, and is a go-to spot for a Saturday morning coffee date. I've only had their latte and drip coffee, but both solid cups. <br><br>They serve intelligentsia coffee, which sometimes for me is a turnoff, only because most shops that wholesale with them tend do to their beans injustice--they just don't know how to make a good cup, and the coffee ends up way too acidic. This is not the case at Sip! They make consistent, good coffee. I'll be back for sure.", "pics": null}}, {"review": {"des": "I've been sippin' espresso here for so many years that even the caffeine isn't able to jog my memory. (Maybe my memory has just become too sedentary in these times to jog.) I don't come here too often, because I had to put down my car, RIP, and I can't bear getting another. It's not too convenient to me by public transport, though it's worth the walk or Divvy on nice days.<br><br>Sip truly continues to set the bar high for cafes in Chicago. If you're looking for a place that weighs their grounds to the gram, that uses a 1990s-style Melitta cone and a Japanese pot with a funky spout and brands it a \"pour over,\" or charges $12 for a single-origin shot of espresso (I'm looking at you, Blue Bottle, in San Francisco!), this isn't the place for you. The drinks are good, but no one is bowing down to a high priest or priestess of baristas here. Just a friendly face to pull (I'm showing my age--make that push a button for) an honest shot of espresso.<br><br>But the converted house is a fantastic place to get things done. A smallish room in the middle with comfy chairs leading to a large, high-ceilinged room in the back that is drenched in light from large windows and a couple skylights, and filled with easy chairs, couches and tables. A little nook upstairs, not far from the skylights. And a peaceful garden in the back, far away from the noise of Grand & Ogden. It's like sitting in someone's backyard because, well, it once was someone's backyard. Every time I've been in any chair here, it's been nice and quiet. I can hear myself think and write, even if I'm using a cheap, scratchy fountain pen nib.<br><br>You could stop by the Twisted Spoke after, but why bang your head to the music after it's been soothed? Save that for another day.", "pics": null}}, {"review": {"des": "What a breath of fresh air from Starbucks! It's very chill here and not loud at all! They have an awesome variety of drinks and baked goods. I recommend the Nutcracker which is an almond and chocolate mocha. Great place to study and do school work :)", "pics": null}}, {"review": {"des": "Ahhhhhh I wish I lived near this cafe. I love everything about this place - the ambiance, the music, the barista, the coffee, the cookie, EVERYTHING!<br>I live in Evanston, but had dinner plans in the West Loop area so I figured I should come early and study while \"sip\"ping on a coffee (notice the pun? I'm hilarious, thanks). This place BY FAR had the most and highest reviews.<br><br>Coffee: Sip-Cago (1/2 coffee, 1/2 steamed creme, shot of espresso)<br><br>I asked for a recommendation because I usually get cafe au lait, but I wanted to try something new. The barista, she immediately recommended me the Sip-cago, and wow, it tastes amazingg. It's much \"lighter\" than a cafe au lait, and allows you to taste the actual beans because of the mix of coffee and espresso. I'm sipping it right now, and it tastes GREAT.<br><br>Ambiance: there's two floors! and the interior is decorated so nicely! The awesome paintings, the comfy sofa's, the variety and diverse chairs, plenty of outlets, etc. Great. It's a perfect place to study. And there's no one here that's talking loudly and obnoxiously...I think everyone is here to get shit done, and that is GREAT MOTIVATION.<br><br>It took me an hour to get here, and I might consider commuting here JUST to get some good coffee and get some studying done. It's that cute and good.", "pics": null}}, {"review": {"des": "I'm giving it four stars based on the good quality ingredients and what I expect the coffee tastes like, as well as the two garden spaces and the big indoor seating area. People are right that you totally don't expect it to be as extensive as it is fro m the outside or even when you first walk in. I didn't want to have more coffee when I went, so I ordered a London fog, which was basically sweet cream. It didn't have much tea flavor, and they tend to be sweet, so I was expecting that, but the lack of flavor was less expected. Everyone in the back had papers or computers out, or one group of people seemed to be scrapbooking or something, and they had stuff covering a big table. It seems like the place you could go for the day and not worry about being bothered to leave. There is one person working, so if there's any line it'll be slow. They have a bike rack right out front.", "pics": null}}, {"review": {"des": "This is a cute place, off the beaten path.<br><br>I really enjoyed my London Fog (earl grey tea latte that I had with almond milk instead of cream). It was sweet, 16 ounces, and well steeped :) <br><br>My friend liked her pumpkin coffee too. <br><br>The service is a bit slow, you order your drink and the same person taking the order makes it right then and there, so it's a one man show. But you feel the love a bit more that way. <br><br>My friend and I also split a chocolate chipotle cookie (get it, CHIPotle!), and while at first bite, we thought it was dry and nothing to write home about....it grew on us with deep chocolate flavor and that kick of spice. Our drinks also helped wash it down.<br><br>I'd go back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RLqbubEF05lwKd-Spiqekg/168s.jpg", "caption": "The chocolate CHIPotle cookie!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qmKBKL4Ijt3K9l6hICFiLg/168s.jpg", "caption": "London Fog, Pumpkin Spice latte and a chocolate chipotle cookie"}]}}, {"review": {"des": "They have two awesome outdoor spaces. I sat in the far back and it's a beautiful shaded oasis with a big tree in the middle and ivy on the fences and brick walls. Half a dozen tables and additional bench seating with quiet music playing and  best of all, a strong wifi connection outside!<br><br>I didn't get any food but looked like they had some local choices. And I actually didn't get coffee shockingly enough but I got a spritzer of hibiscus tea and orange spritz. Pretty tasty! <br><br>Great, calm location with tons of seating and solid coffee shop menu. Absolutely recommend! I'll be a regular now.", "pics": null}}, {"review": {"des": "One of the best places to study in Chicago! Lots of open studying space, outdoor seating, two floors. <br><br>My favorite part about Sip is that you can open a tab (for all your caffeinated drinks / pastries / etc. )  if you're going to be there for a while! <br><br>65 bus stop right outside!", "pics": null}}, {"review": {"des": "A cozy and inviting place. <br><br>Their multilevel work space in the back of the cafe is great for both group meetings and solitary work. They have a great selection of seasonal lattes, loose leaf teas, and cafe snacks. I was delighted to notice that they carry matcha, too! <br><br>CTA: Grand-65 bus", "pics": null}}, {"review": {"des": "This place used to be a house and appears as such on the outside and is rather unimpressive and easy to pass by in that sense. The inside is great though. Has a nice variety of seating (sofa chairs, sofas, chairs and tables), lots of outlets, natural light, a couple of patios and an upstairs loft type space. In addition to the obvious coffee they also have some baked goods and a few sandwich options - nothing terribly special. Staff was very friendly and the place is clean and has a nice feel. Much better than the coffee shop near me that also tries to be an art gallery or vice versa? It's worth the walk.", "pics": null}}, {"review": {"des": "Love their signature drink- London Fog- tea latte.<br>great scone and alot of options for caffeinated drinks.<br>Only prob is they need more seats. cuz people stay for a long time.", "pics": null}}, {"review": {"des": "Great coffee and chill place to get some work done. Love the interior design.", "pics": null}}, {"review": {"des": "Loved this little coffee shop! Went here this week and it was a great time. The workers were nice and the seating area is awesome. It was very easy to find parking outside and prices are reasonable. I tried the hot chocolate which was good, although I wouldn't say amazing.<br><br>I LOVE the outdoor garden you can sit outside in. We sat in a small outdoor area to the side because we didn't realize there was a huge outdoor space in the back. It's really so nice and chill. I would love if I lived a bit closer so I could frequent this spot for my coffee and chilling needs.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yrNhHsmiNGUCSnQvg2NTGw/168s.jpg", "caption": "Outside garden"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pnaAZpAHn2m2W75zAcK07Q/168s.jpg", "caption": "Outside garden"}]}}, {"review": {"des": "Great, comfy coffee house that's perfect for either studying of hanging out with friends. I loved their decor, and how although it was cozy I never felt confined to a small space. <br><br>They also offer yummy treats! I got the warm pita bread and hummus (excellent!) and a small toffee with white chocolate, lemon and macadamia nut (amazing!!!). I will definitely be coming here more often!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5f3mVKvKMVkYUJUBvuvSEQ/348s.jpg", "caption": "Blended drink called The Schmoozer"}]}}, {"review": {"des": "Reasonable prices on a wide range of cafe style food. Spacious , with high ceilings, but cozy with relaxing music. Great for studying. Long list of drinks, from teas to tea lattes to coffee drinks. I think they serve Intelligentsia.", "pics": null}}, {"review": {"des": "Outdoor seating, many coffee choices, delicious scones, free overall reliable wifi, plus printing options.<br><br>I just moved into the area and have enjoyed frequenting this coffee shop to use Internet while my apartment's gets set up. <br><br>Sip has a relaxing, chill atmosphere and exceeds my basic expectations for a coffeeshop.", "pics": null}}, {"review": {"des": "Absolutely loved this place. When you first see it from the outside you think it's gonna be this small coffee shop. But then you walk in and it is huge! As you walk to the back there is open bright space and even very cute outdoor seating in the back. I tried the peach smooth. It was good but a little too sweet for my liking! Next time I plan on trying one of their coffee drinks! This is a great atmosphere to study bc it's quiet, noise level is not loud, unlike other coffee shops that play music too loud this place is not! There are lots of wall outlets to charge your laptop and wifi connection is great. They even have a printer?! How convenient is that! I wish they had a few more tables or at least bigger tables but all in all I think this is a awesome coffee shop and I will most likely be coming again!", "pics": null}}, {"review": {"des": "My daughter and I were on a quest to find a great coffee shop that didn't have the words Star or Bucks in the name. We saw the reviews here and the photos looked great. <br><br>Sip was better than we expected and we sat out in the back garden area which was divine. <br><br>The coffee was great and we shared a baked apple crisp muffin which was delicious. <br><br>This is our new favorite spot.", "pics": null}}, {"review": {"des": "My rating would be a 4.5/5 if I had the option.<br><br>When I slipped into SIP to do some work and have lunch before my hair appointment down the road, I wasn't sure what to expect! However, after my first experience there, I feel confident enough to declare that it is a DISGUISED UNICORN. <br><br>When I went it just so happened to be the most gorgeous sunny fall day and I got to sit outside in one of the two courtyards. Wow was I impressed with the courtyard: there were outlets everywhere, it was private, birds were chirping, flowers were blooming, and I felt as though I was in my own little secret garden. <br><br>The staff were so beyond nice. I had asked about parking and they gave me all the tips on where to park free near by. They also brought my warm, delicious, pretzel roll sandwich out to me in the courtyard. This sandwich was reasonably priced, came with a side, and OMGGG pesto mayo (def try that out)! Oh and SIP also has a self-serve water station with large glasses; coffee shops that do this always get bonus points from me.<br><br>The ONLY reasons I would dock off 1/2 a star from my rating are minor: they don't have designated gluten free options, and parking in this area is borderline obnoxious. <br><br>Even though SIP is far out of my neighborhood, it is right by my hair salon and now officially part of my pre-hair salon routine. Make time for SIP, especially if it's a gorgeous day, they won't disappoint!", "pics": null}}, {"review": {"des": "Ambience: quirky, homey but chic. I appreciate the fact that people who go there are either working or studying or reading. Those who come here to talk and chill actually respect this and enjoy each other's company without sharing their conversation with the whole coffee house. <br><br>Space: BIG! The inner seating area has many tables for 2, 3 couch areas, one solo comfy chair and there's a loft area with about 4 more tables for 2! There are also 2 patios. One in the middle that has one round table and a few chairs, and a big patio in the back with several tables and benches.<br><br>Food: Coffee is Intelligentsia (yum!) Free refills on drip coffee with a reusable mug. (Who does that anymore?! Love this place.) Hubby got a peach smoothie and it was good (i tried it) I've only tried their pastries and I love the apple maple muffin. Moist and yummy! I was let down a bit by a chocolate chip scone but I'm willing to give the other flavors a chance. ;) I saw gluten-free pastries on the counter too, for those who are interested.<br><br>Service: Always good. People behind the counter are positive and happy and smile at you even if it takes you a while to figure out what you want (coz everything looks good!) :)<br><br>Free wifi is reliable. There is a printer on site. Outlets to plug in are all around. $5 minimum for credit cards. Bus stop on Grand is right by their entrance for those who hate paying for parking (me).", "pics": null}}, {"review": {"des": "Amazing staff here -great customer service with a friendly smile.  Huge space in back. Love the magazine rack for when I need a break from working.  You can also print here which is awesome.  There is a loading zone right in front to run in and grab coffee!<br><br>Love this place and the folks that work there are awesome.", "pics": null}}, {"review": {"des": "Love the inside - lots of space to sit and do work if needed or just relax and read a newspaper...nice outdoor garden, good coffee and a very clean bathroom to take a dump when the coffee kicks in.", "pics": null}}, {"review": {"des": "I felt bad because I walked in here right before they closed. The Barista was still very happy to serve me. Not only this but he suggested a drink! And it was delicious. I will come here next time I'm in Chicago! They have all kinds of milk and tons of mixed coffee drink options.", "pics": null}}, {"review": {"des": "Sip has it all! Great coffee, pastries, seating, free wifi and you can even print here if you need to. The furniture is cozy and the art is quite interesting. I coukd spend an afternoon just examining all the posters and art works.<br><br>My only complaint is I wish I could tip with my credit card. I rarely have cash on me and they do not give you a receipt where you can add a tip.", "pics": null}}, {"review": {"des": "Great study place.  Coffee is made in the front with lots of study room in the back making it a more quiet place to get some work done.  Free wifi with no wifi limits or issues<br>Also has sandwiches and snacks if you get hungry.<br><br>Have yet to try their coffee but their chai tea latte is spicy sweet and to die for!", "pics": null}}]}