{"name": "slurping-turtle-chicago", "reviews": [{"review": {"des": "The restaurant has a very cute and simple aesthetic. I got the shrimp ramen along with an appetizer of grilled chicken bao which my friends and I shared. Personally, the bao was so good that if I hadn't already ordered a main course I would've just gotten more of it. <br><br>Unfortunately, they were out of green tea ice cream (my favorite!) the day we were there but if they had it the meal would have been close to perfect.<br><br>TLDR: <br>Pros: cute, yummy, grilled chicken bao to die for <br>Cons: service a tiny bit slow, out of one or two types of ice cream", "pics": null}}, {"review": {"des": "Pickup order, I had no idea that me ordering out ramen would have grossed me in the way it did.<br>The soup temp was less than warm & bland, as what reduced my appetite was the noodles in a container that congealed stiff in the shape of the container cold.<br>Not doing that again (pickup order) and not really interested in eating in there..", "pics": null}}, {"review": {"des": "Love the name!<br>First let me start of the with interior and decorations. I thought that the place was really chic and open. I love how there is a waiting area in a separate room. I came on a cold raining night so I appreciated not having to wait near the door while they were getting our table ready. Our table was upstair and our table had a nice view of the street and the lighting fixture on the ceiling. <br>For the ramen I ordered Tan Tan ramen. I thought the ramen was very good. It was not too overwhelmingly spicy where I couldn't enjoy the flavor. One of the problems I have with a lot of ramen places is that they always put too much noodle in the soup. I did not have that problem here. There were plenty of toppings in the ramen. Our waiter was very attentive, friendly, and caring. <br>For appetizer, I ordered the duck fat fried chicken and it was delicious! <br>Overall, I enjoyed my experience at Slurping Turtles.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7geD8E-5yh4HPvqX3J_3wA/168s.jpg", "caption": "Fried chicken"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zaqttWWSgrUkuj7VaOw14g/168s.jpg", "caption": "Interior"}]}}, {"review": {"des": "We love ramen.  That being said, it can sometimes be difficult to find good ramen, especially with so many new places popping up.  We were extremely happy with our experience at Slurping Turtle and would definitely return. <br><br>The ambiance was nice, the service was great, and the food was delicious.  We unknowingly arrived during happy hour which was a nice surprise, although the food was well-priced in general, especially for the size of the portions.  The extensive menu had plenty of options to choose from.<br><br>We started with a couple of beers and snacks from the happy hour menu - you really can't go wrong with $4 for a delicious craft beer, especially in downtown Chicago.  The $5 gyoza and spicy tuna roll from the happy hour menu really hit the spot.  I selected the Hakata Tonkotsu Ramen, and my significant other chose the Tan Tan Men ramen.  We were extremely impressed, especially with the broth.  Each bowl was packed full of flavor and there was plenty to eat without any extra add-ons.  We did add some of the chili oil and spices provided as we prefer the ramen a little spicier.  As another Yelper mentioned, the meatballs in the Tan Tan Men ramen are excellent.  I preferred the broth in the Tan Tan Men slightly more than my Hakata Tonkotsu, but again, both were good choices.  <br><br>I would highly recommend Slurping Turtle as a great option for well-priced ramen.  We will be back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uZQGuKxBvv9Z4AiN5OS4FA/348s.jpg", "caption": "Delicious Hakata Tonkotsu ramen"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9ACQ8T-4qWlQuHRnOWQVTQ/168s.jpg", "caption": "Spicy tuna from the happy hour menu."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xR_HuP2upwvofwo2BkYNlQ/168s.jpg", "caption": "Gyoza from the happy hour menu was delicious!"}]}}, {"review": {"des": "The ramen doesn't measure up to LA, but it's really good for Chicago ramen as well as for the price. I've tried almost every ramen on the menu, and the chicken ones are actually my favorite. Probably because I don't love fatty meat, and their porkbelly is quite fatty. The broth is pretty flavorful, especially on the spicy options, and I enjoy the texture of the noodles; They're quite firm. Service is always on point as well. <br><br>Appetizer wise I really like the duck fat fried chicken and bao. The fried brussel sprouts tend to get a little too salty towards the bottom of the bowl, I liked them more when they were on a plate but they're still quite good. Overall a good place if you want a big portion, as they offer extra noodles for a good price.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/K9512B39nH7aaaAVEfbG7w/168s.jpg", "caption": "Spicy Tonkotau (Chicken) with molten egg and extra noodle"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mtVRaKvhFa0eOtSK7kCPTw/168s.jpg", "caption": "Tonkotsu with molten egg and extra noodle"}]}}, {"review": {"des": "When in the mood for good, healthy and comfort food, come to slurping turtle for their chicken ramen.<br>The hearty portion with their good collection of wine will hit the spot just right!<br><br>The service is excellent. I liked their assorted seating choices with booths and communal seating downstairs and more intimate booths upstairs. Grab a table overlooking hubbard st.", "pics": null}}, {"review": {"des": "I took my mom to Slurping Turtle for lunch because it was close to my work. We both liked it, but the food didn't blow us away. We got the shrimp shio ramen and the hakata tonkotsu ramen. I liked the creaminess of the tonkotsu better, and didn't find anything particularly noteworthy about the shio. It might be unfair since I've had amazing ramen in Tokyo, but other friends who have been to Slurping Turtle still think even Ramensan a couple blocks away is much better ramen. Nevertheless, I think Slurping Turtle is a solid place - ok prices, ok ramen, and super nice staff. I also think the logo/name \"Slurping Turtle\" is very cute.<br><br>I probably wouldn't go out of my way to get ramen here, but it's decent ramen for ok prices, and the people who work here seem lovely.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tO7CAf4VcyDi4UhWw-yfHg/348s.jpg", "caption": "Top: Hakata Tonkotsu ramen, bottom: shrimp shio ramen"}]}}, {"review": {"des": "We are from out of town and visited this place on a busy Saturday night for the first time so this review is based on a first impression.  <br><br>Service: was excellent. Our waiter, Gary, was attentive, friendly, funny, and knew the menu inside and out. He took care of us celebrating one of our friends' birthdays and snapped a great group photo of us as well.  I'd give him 5 stars!<br><br>Food: Ok, maybe one might call me a bit of a Ramen snob, having a deep love for ramen and always on the lookout for new places. We've traveled all over Asia looking for great ramen (myself, several trips and several cities in Japan, having lived there before) and we're from Southern CA where we've had a good bit of the 'ol ramen from SD up to LA and also NorCal too.  I'd say the Classic Toyko Shoyu Ramen here was \"OK to good,\" but not \"excellent.\" (think B minus to B plus range). The noodles weren't as al dente as I'd normally like and were a bit overcooked actually. The broth was slightly over-salted (but not so much that you're downing your ice water with every bite).  The egg was perfectly cooked. The pork was juicy and sliced to the right thinness and size for a perfect bite.  Improvements I'd suggest would be getting the noodles a bit chewier (if you know what I mean) and slightly less salt in the broth.  We ordered the \"extra noodles\" since I was sharing my bowl with my kid, and ended up leaving nearly a full bowl of noodles there (yes, the Asian in me had a serious dilemma there).<br><br>We really enjoyed the starters--the Hamachi tacos and the Fried Brussel sprouts.  The tacos were fresh, flavorful, and combined the perfect crunch with the sashimi inside.  The Brussel sprouts were excellent--I could have eaten the entire bowl but was saving space for the ramen.<br><br>For dessert, we shared a cream puff--if you've had these before (i.e. at Beard Papa), you'll know sometimes places get them soggy or with too little filling, but Slurping Turtle got the recipe done just right!<br><br>Ambience: it's kind of loud in there with music and conversation at all sides. Just so you know if you have plans for a \"quiet\" dinner, it wouldn't be here.<br><br>Overall it was a Good Experience and I'd like to try it again to see if the ramen prep was a consistent theme or a one time/busy night thing.   <br><br>----------TL;DR----------<br><br>PROS: excellent service with Gary, the appetizers we had were great. the Cream puff was prepared well. <br><br>CONS: ramen was ok (B minus or so), but the components were better (egg, pork, bamboo shoots).  it's a bit loud in there.<br><br>BOTTOM LINE: if you're craving some ramen, it's a good place to check out. I'd like to try it again when we visit Chicago again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8OaBRZbi7gVsWWeD05fzQQ/168s.jpg", "caption": "Classic Tokyo Shoyu Ramen"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jDXPU6dVy05AG4EjX13O_g/168s.jpg", "caption": "Cream Puff"}]}}, {"review": {"des": "If you love Noodles, go to Slurping Turtle. While in the city two weeks ago, we had to make a stop.<br><br>They had an appetizer special that evening, chicken and leek dumplings.  They were delicious, with or without the dipping sauce.  We also ordered the pink lady sushi roll--so fresh and beautifully plated.<br><br>My husband and I both ordered their classic slurp-roasted pork belly, bok choy, molten egg, bamboo shoots, scallions, garlic.  So amazing.<br><br>My sister got the shrimp ramen, very similar but with a more citrus flavor.  <br><br>Affordable, trendy, and the cutest little logo.  If we lived in the city we would be regulars.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ebm8cfVeBs2Rq5vACBzymA/348s.jpg", "caption": "Shrimp Shio Ramen"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5fDjeYA2xY3twJ-RBAjwkg/168s.jpg", "caption": "Pink Lady Roll"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EUge9JHr87DhEQ-wJNC1Fg/168s.jpg", "caption": "Chicken and Leek"}]}}, {"review": {"des": "Good ramen spot in the city, but not the best. Solid ramen options for a good price. I've always enjoyed my food, but I've never been blown away by it. <br><br>Inside is quiet- much quieter than the ramen spot down the block. Good spot for families and those trying to hold a conversation. <br><br>Best part- Instagram worthy logo!", "pics": null}}, {"review": {"des": "I had the shrimp ramen which was delicious! The service was super quick and they didn't mind that I had to work and eat. Would definitely come back for a quick bite. It has a cozy atmosphere.", "pics": null}}, {"review": {"des": "Upscale place that has a hipster kind of vibe. I like the two-level seating in the restaurant. The premises are very clean.<br><br>I got the regular tonkotsu ramen, which was pretty good. Considering the price ($14 at the very least), though, the value is just not here. The pork slices are really tasty and flavorful and the egg tastes great. The noodles and broth are nothing special. I did appreciate that it was not too salty, though. I would definitely come here if the ramen were cheaper (around $10?). All said, it is worth a visit if you're nearby.", "pics": null}}, {"review": {"des": "Do not let my unappetizing takeout photos speak for the taste of the food - it's great! I tried the red curry as I don't consume pork hence wanted to make sure I didn't accidentally order a pork broth (now I know what tonkatsu means, lol!). It's so flavourful and delicious - more much of a punch than the ramen I've had in the past, which has been comparatively much more bland. Being South Asian, I'm a sucker for spice and the red curry delivered a great amount. It was nice for me to be able to assemble my meal and pick and choose portions of the various components. The only part of the dish I didn't love was the eggplant - think squishy vegetables aren't always the best fit for a soupy dish. <br><br>The best part of the dish by far was a spicy volcano paste I ordered on the side. I have an appetite for spice so it was not painfully spicy for me but would easily be classified as such by others who aren't accustomed to a spicy meal. It was so flavourful and punchy - I had all of it! It also made a nice dipping sauce for leftover taro chips, hehe. <br><br>This place is fantastic - eager to come back someday. Hurray for volcano paste :)", "pics": null}}, {"review": {"des": "The broth left something to be desired. Next to the others I've tried in Chicago, I would say this is a place worth trying but not returning to. It's trendy, clubby music playing (granted we came in on a Friday night around 8 PM). We did enjoy the duck friend chicken as an app tho- but two of the five pieces were more bone than chicken. Great slaw on the side w a nice, creamy dipping sauce. Service was kind and courteous.", "pics": null}}, {"review": {"des": "Wanted to compare this staple to the Ann Arbor location.<br><br>Inside was interesting and stylish - lots of spots that seemed to be nice for conversation or couples without feeling like you are sitting in a traditional ramen joint.<br><br>Tried the Spicy Miso Tonkotsu with a side of kimchi.  Food was offered quickly and was tasty. The broth was excellent and the chicken breast was moist and tender.  Sapporo was on tap, which was awesome.<br><br>Great place for a quick bite of ramen on a cold November day.", "pics": null}}, {"review": {"des": "As an Asian from NY.. Why does this place have a lower rating than Ramen-San? Because it's not as WANNABE trendy.. the food is SO much better here. Service wasn't bad at all at Ramen-San but service at Slurping Turtle was better. Please go for the food and not the hype.. MAKE THE RIGHT CHOICE.. Slurping Turtle", "pics": null}}, {"review": {"des": "I'm not gonna front, when I first stumbled upon this place online I was skeptical but all of that went awareness away as soon as we went inside and ordered our food. We came during Happy hour, so appetizers and drinks were at half price. First up in our order lineup was the duck fat fried chicken(whoa)! Can't describe it in one word but it was incredible, super crispy, tender as hell and it came with spicy mayo. Seriously one of the best appetizers I've had in a long time. The spicy tuna roll was great as well, incredibly fresh and flavorful. Our ramen orders were: the Tokyo Shoyu and Tan Tan Men. When it came to our table, I was taken back by how big the bowls were but I had no issue breaking that bowl down, enjoying the simple but unique flavors brought together in this dish. <br><br>Only one issue we had was that my partner in crime, her order was mixed up with another table's but as soon as we brought it to the waitress attention, it was rectified with a redo of the order plus we were allowed to take the other one home, which we ended up doing and munching on later that night. <br><br>That example of customer service along with attention to detail in which they cook and prepare the food and provide the customer with a unique dining experience is why I feel they earned their 5 stars. It was a wonderful place and as a New Yorker it definitely convinced me that not all of the best Ramen spots are in NYC.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1CAH5jhTaVXtQpORxK0gvw/168s.jpg", "caption": "Tokyo Classic Tokyo Shoyu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AV4LM70H3irIcAJsbKLfTg/168s.jpg", "caption": "Duck Fat Fried Chicken and Spicy Tuna Roll"}]}}, {"review": {"des": "Came here for lunch one day and I ordered the spicy miso ramen! The ramen took a little bit of time, but definitely worth the wait since there aren't many spots in Rivwr North. The ramen was a little too oily, but satisfying none the less. Definitely a place worth going to when you're craving ramen though. My coworkers also told me the Bao and sushi is pretty good so maybe next time I'll try that out!", "pics": null}}, {"review": {"des": "First, they take reservations! Not online on OpenTable, but if you call they will make them for you. We actually made our reservation less than 24 hours prior, and the restaurant was able to accommodate our party of 8. <br><br>The vegetarian options are limited: 1 appetizer + 2 entrees. Plus 2 more that can be made vegetarian, but the waiter also didn't seem confident about this option. <br><br>I had the Vegetable Bao (appetizer), Red Curry Ramen, and Kinoko Mochi. The Bao was delicious with lots of great sweet plus savory flavors. I learned I'm not a \"ramen\" person, so I didn't particularly enjoy the Red Curry Ramen. (Literally tasted like spaghetti noodles in broth to me.) However, I absolutely enjoyed the Kinoko Mochi because the sauce was just so delicious. The \"noodle\" in this dish is such a unique texture/flavor that it completed the flavors. <br><br>Would I go back? Probably not, only because of the lack of vegetarian options. But if I had to, I could make do.", "pics": null}}, {"review": {"des": "How can you not like a place called the Slurping Turtle?  My daughter needed a ramen fix while we were in town and this place was not far from our hotel, so we set off on a frigid January night in search of noodle-y goodness.  <br><br>We were seated promptly, but in a funny location up on a mezzanine level next to a big window.  On a bitterly cold night, it was very chilly there.  The server was happy to re-seat us on the main floor where we were much more comfortable.<br><br>My daughter is the ramen expert, so I defer to her judgement that the noodles were a solid four stars.  We started off with some bao, one each of chicken, shrimp and veggie.  All good.  My daughter had the classic Tokyo shoyu and I had the seafood shoyu ramen.  Portions were pretty generous and the broth was very flavourful.  Dessert menu didn't really excite us so we headed back out into the cold in search of a sugar fix elsewhere.", "pics": null}}, {"review": {"des": "Rating Ramen is tough.  Great (4 to 5 star) Ramen is tough to find, but even 3-star Ramen is incredibly satisfying.  Slurping turtle fell into the \"incredibly satisfying, but not great\" category for me.  The flavor was of the tonkotsu ramen and spicy miso ramen were solid, but noting to write home about.  <br><br>I did appreciate that the broth was oily enough to cling to the noodles well.  Each slurp was a ton of flavor.  The pork belly in the ramen was just average.  It was a bit tough and seemed to have been cooked a bit too long.  <br><br>The slurping turtle decor was cute and it seems like a fun place to grab a meal with friends (extensive drink selection for a ramen place).  <br><br>If the prices were about 40% cheaper, I'd say this is easy 4 stars, but 15 dollars for just average ramen was a bit steep.  <br><br>In short, walked away satisfied, but would not go out of my way for it.", "pics": null}}, {"review": {"des": "Couple friends and I stopped in on a Thursday evening. We called in beforehand to check if they had a wait time and thankfully, they didn't as opposed to other places. Their menu here had a good number of vegetarian options available. I got a Shoyu Tofu Mushroom ramen with a side of Spicy Volcano Paste. <br><br>I like spicy food and this paste really did it for me -- plus, it cleared my sinuses so an extra bonus there! The noodles were pretty good but the broth  (with the spice) was even better. Opted to not get dessert but now that I think about it, that was a mistake!!<br><br>Atmosphere is modern and overall casual.", "pics": null}}, {"review": {"des": "Lunch bento box is the way to go but gets crowded around lunch time so try to make it an early or late lunch stop. Not a huge fan of their ramen. Fun interior!", "pics": null}}, {"review": {"des": "We ordered the duck fat fried chicken and the hamachi/yellowtail tacos for appetizers, and they were our favorite things from the menu! The ramen was pretty good, we were a bit full from appetizers but plowed through the flavorful, heavy, and rich Spicy Miso Tonkotsu, and the Hakata Tonkotsu broths- good noodles too. I ordered shrimp in place of the pork, the shrimp were amazingly huge, and tasty- it came with about 7 pieces, it was great!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BADmH7Bb4DjqdbGpXMFxRg/348s.jpg", "caption": "Spicy Miso Tonkotsu ramen"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wsalukPBCs0JTjKf1nt4lQ/168s.jpg", "caption": "Hakata Tonkotsu ramen with shortib"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JKR-0Ya3xMoLwcqzi8gfpQ/168s.jpg", "caption": "Duck fat fried chicken!"}]}}, {"review": {"des": "After a ramen joint down the street told us our wait would be over an hour, my friends and I turned to Yelp and found Slurping Turtle was within 3 minute walking distance! It was a cold, November evening so we definitely wanted something hot to soothe our bellies! The place was also packed but with way more seating that the previous restaurant, we were seated promptly. My friends and I ordered the tonkotsu ramen and it was Mm, mm, good! I like my broths rich and hearty, which this definitely was. The noodles were fresh and had just the right amount of bite to it. I was a little surprised that the ramen didn't come with a soft-boiled egg; it was an additional $2 for the egg (but totally worth it!). Was it the best ramen of my life? No, but it satisfied my cravings and was filling and delicious! <br><br>P.S. maybe it was the cold temperature that made our brains freeze but we had the HARDEST time finding the entrance to the restaurant. It's the door right next to the Slurping Turtle, looks like an entrance to an apartment (has the call box out front). Just PULL the door....it opens! hahaha!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qLZeNK9GQ_uoWxYeWQnJwg/348s.jpg", "caption": "Tonkotsu ramen + soft boiled egg"}]}}, {"review": {"des": "One of the best ramen noodles that I ever enjoyed in Chicago. Great customer service and delicious food. Well recommended.", "pics": null}}, {"review": {"des": "We had passed Slurping Turtle on the way to dinner the night before, so when we were looking around on the map for some place to eat nearby, the name stuck out to me.  It had good reviews on Yelp, and ramen sounded good, so it was a go!<br><br>Fried Brussel Sprouts $6 with crispy shallots, unami soy<br>Duck Fat Fried Chicken $9 soy-sesame marinated chicken fried in duck fat (6 pieces)<br>Beef Short Ribs $11 grilled soy-ginger, garlic marinated short ribs, kimchi<br>Classic Tokyo Shoyu Ramen $14 pork belly, molten egg, bamboo shoots, bok choy, scallions, nori<br>Dragon Roll $15 shrimp tempura topped with BBQ eel, avocado & unagi sauce<br><br>All in all a satisfactory dinner, with the exception of the chewiness of the beef short ribs.<br><br>Their dessert menu is simple, consisting of several flavors of ice cream $3, a sorbet du jour $3, Mochi ice cream $3 each or 3 for $8, and a variety of cream puffs $4.  Everything is made in house with the exception of the mochi.  We were tempted by the most interesting of the ice cream flavors - soba with buckwheat honey, so we ordered one to share.  It arrived as two small yummy scoops - a perfect sweet end to our meal.<br><br>Happy Hour Weekdays 3pm - 6pm at the Bar, Communal Table, and Patio - $4 select draft beer, 1/2 off sake flights, bottles of wine, and select snacks (5 choices).", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6ToSRZsYx-TphoQl4sZ3GA/348s.jpg", "caption": "soba with buckwheat honey ice cream $3 Slurping Turtle 9/2017"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FACm8cMbPX_JqpS5I8tgSA/168s.jpg", "caption": "Dragon Roll $15Slurping Turtle 9/2017"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DW7A6NBQYa69J_GOhLuaKg/168s.jpg", "caption": "Classic Tokyo Shoyu Ramen $14 Slurping Turtle 9/2017"}]}}, {"review": {"des": "Nice ramen joint with some other options that won't break your budget. <br><br>Visited with my son;  he got the ramen, I got a sushi roll, and we shared some edamame as we waited for our entrees. Clean inside with helpful staff along with delicious food will bring me back. <br><br>While not being a \"city dweller\" I did find it a bit off putting that the sub-par restrooms were on a different floor which seemed to be in an abandoned part of the building.", "pics": null}}, {"review": {"des": "I am truly on the fence about this restaurant. I really want to like it for the following reasons:<br>(1) location;<br>(2) cleanliness; <br>(3) employees are friendly; and<br>(4) it's a ramen joint.<br><br>What puts me on the fence about this place:<br>(1) the variety of foods available.  <br><br>Let me explain.  I am able to order sushi, donburi, miso soup and ramen.  Although the broth of my hot ramen was not bad, the menu seemed a little all over the place instead of a \"specialized\" food source in a sense; if you have 'slurpin' in the title of your restaurant, which is commonly attached to noodles (albeit something to slurp, I expecting different versions or variety of slurping food).<br><br>Yelp Challenge: #53-100.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nmISiQb9m0wXwxoS0Y715w/348s.jpg", "caption": "Hiyashi Chuka - Vegetarian"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/H1YEZdXqzxExPCP9T6nMvQ/168s.jpg", "caption": "Classic Tokyo Shoyu Ramen"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OWdiD0vVSiEECW1e-DYERg/168s.jpg", "caption": "Summer specials menu"}]}}, {"review": {"des": "I went here for the first time with a couple of friends for lunch today. It was a few minutes before noon, and it was busy, but we were able to get immediately seated at the bar. Service was slow, but in all fairness, the bartender was slammed busy, so it we were okay with it. Although I didn't have one, the cocktails being made looked good. I ordered the Chahan Japanese fried rice with beef short ribs. It looked delicious, but it was a complete disappointment, especially for the $16 price. The short rib meat was so tough it was almost inedible...I was yanking on it with my teeth to get the meat to pull off the bone. The fried rice was flavorful, but greasy. Both of my friends ordered the Shrimp Shio Ramen. They said it was okay but rather flavorless. Slurping Turtle needs to seriously up their game with the food.", "pics": null}}, {"review": {"des": "Ate here while visiting Chicago, and after I walked up an appetite exploring and taking pictures on the river walk. It was empty, besides maybe 3 tables of customers, so no wait at all :) . I ordered the Shrimp Shio Ramen, with an extra topping of beef short ribs and grated garlic on the side. Im a lover of garlic so the fresh grated garlic was yummy. The beef short ribs were seasoned well and tender . My friend ordered a rice bowl and raved about it. For my drink I ordered lemonade and they literally made it to order. I looked over and seen the bartender cutting the lemons, and making a jug of it. It was sooo good. Our waitress was friendly  and the restaurant and bathrooms was clean. I definitely recommend this place.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8DK6KJ7SR0p8L92lHWar2g/348s.jpg", "caption": "Shrimp Shio Ramen"}]}}, {"review": {"des": "Slurping Turtle was recommended to me by a coworker when I told her my love for ramen. So we ventured into the city and tried it out!<br><br>We shared the Duck Fat Fried Chicken. It was really good my only complaint was that two of the chicken pieces had bone in it which we didnt really expect. We thought itd be more like kaarage, which is boneless.<br><br>My boyfriend got the Classic Tokyo Shoyu. I had a bit of it myself. The broth was perfectly light, just as expected from shoyu and noodles were firm but not too much. And I finally got a runny yolk. I've been to a few ramen places where the egg was too overcooked. <br><br>I got the Katsudon since it was something I was craving a long time for. I love how thinly cut the katsu. I'd recommend it to everyone if you're not interested in getting ramen.<br><br>I really like the ambiance of the restaurant. Decor was very modern and music wasn't too loud. Service was really good. Our waitress offered to help with the menu and we didnt have to wait long for any refills. <br><br>Overall, I really enjoyed my first experience here and will definitely return!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7tqcBtVd0wtKj8EGvYtaNg/348s.jpg", "caption": "Katsudon"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RE783newQCR29mjbj3HCag/168s.jpg", "caption": "Classic shoyu ramen (egg on the side)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uVy2SCfno_DV5CmS9DKdBw/168s.jpg", "caption": "Duck fried chicken"}]}}, {"review": {"des": "Was hoping to find some good soup noodles near my hotel. Unfortunately i cant recommend this joint. I had the tonkotsu ramen. Looked like traditional creamy pork broth that had been boiled for hours but tasted like chicken bouillon. Noodles were flat medium sized noodles sadly over cooked. The high notes were the molten egg an egg soft boiled in shoyu and the saporro draft.", "pics": null}}, {"review": {"des": "I had the chicken ramen. The portion size was generous and the soup was very flavorful. I felt the ingredients were good quality. <br><br>For dessert I had the mochi. I'd suggest getting 3 for $8 since they are small. I've never had this dessert before so I liked that it was something new to try. It's like cold sticky ice cream. We had chocolate, raspberry, and green tea for our flavors. <br><br>To drink I had a strawberry tequila happy hour cocktail, it was just ok, nothing special.<br><br>Our server was friendly and accommodating.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/L05mm4e6OM75fEHXBl-2BA/348s.jpg", "caption": "Dessert"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_ju3UMmSYnYLLxPAZh-2tQ/168s.jpg", "caption": "Chicken ramen - very good"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IblXMXgSyfUUvK9wDpL2HQ/168s.jpg", "caption": "Happy hour drink - strawberry and tequila $6 - ok"}]}}, {"review": {"des": "I'm in love with this space, especially after trying their cold noodles for the summer months! So much flavor in all of their dishes and they are very generous with ramen toppings. 10/10 will be back!!", "pics": null}}, {"review": {"des": "I was looking to see if chicago could offer me anything like what I had in Japan. I was looking to be reminded my nights out in Tokyo, which often ended with a huge bowl of Tantanmen to soak up all the heavy drinking. <br><br>Goodness me, this Tantanmen not only took me back to my favorite Tokyo ramen bars, but it went above and beyond my wildest imagination. All of the elements were perfect, each bamboo shoot had that perfect texture and subtle crunch, the egg had some type of amazing sesame sweetness on the yolk that I had never seen before in my 10 plus years of ramen hunting. The broth warmed my soul like an inward hug and the pork belly had such a clean umami flavor with absolutely none of that gelatinous gook in the middle of the meat, so much attention to small details was put into this dish. The ground pork was so flavorful and satisfying as I dug them out from the bottom of the bowl like finding treasures under this sea of soothing pork flavor. The cherry on top was the beef meatball swimming happily around...cooked to an absolutely perfect medium rare with a seasoning that made me instantly believe that the Italian meatball has been perfected by the Slurping Turtle. I mean, not only did I have the best ramen of my life, but I had the best meatball of my life...and I've been to Japan and Italy.<br><br>Eat this now.", "pics": null}}, {"review": {"des": "UPDATE: we are coming here every week, but today they just asked us to move from our seats to another seats saying they need our spots for someone else. How rude is that?! Especially considering it was a community table and another 2/3 of it was empty! Bye bye slurping turtle, I'm not coming here again, ugh. <br><br>Was walking by this place like a hundred times before finally decided to check it out. <br>Frankly speaking it looks like a cheap fast food place from the outside, turns out it's not (luckily). <br>We came there for a happy hour and were very pleased with everything we experienced. <br>Drinks were only $6 and I totally fell in love with the drink called \"sweater weather\". I usually don't even like alcohol cause it's too bitter for me,  but this one is quite sweet and delicious. <br>We also got 3 of $5 rolls that were very good! 8 pieces/a roll. <br>My husband later ordered a spicy soup that was soooo huge it could have filled 3 people, I tried it and it was very tasty! <br>Oh yeah, and we had a very nice server, who was funny and attentive<br>Will definitely come back :) <br><br>PS. Happy hour is available only at the community table or the bar", "pics": null}}, {"review": {"des": "In my opinion, it is difficult to find good ramen in Chicago. I've been here several times with my Japanese friends out of convenient but this place is very average. I have gotten their tonkotsu ramen and tan tan men. The tonkotsu broth which is made out of bone marrow was a bit too thick and greasy for my preference. I liked the tan tan men better because the broth was lighter and spicy (could have been spicier though). The noodles were pretty thin and cooked well. The amount of toppings on the ramen were very generous. I especially like how much bok choy and sprouts the tan tan men comes with. <br><br>The atmosphere of the place is also very average. The decor of the place is modern and spacious but nothing special. I like going with a group of 4  people because then we get to sit in the booth and those are way more comfortable than the shared counter table that runs through the middle of the restaurant. If you end up getting seated there, you will be stuck with waiters and customers constantly brushing by you throughout your meal. <br><br>Finally, I think that the dishes are over priced for the quality. I don't want to pay more than 10 dollars for a bowl of ramen unless it's very good.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/C47qwHx-P-Qs_fYFY-Icdw/348s.jpg", "caption": "tan tan men"}]}}, {"review": {"des": "We ordered the Tan Tan and Tokyo Shoyu ramens with a portion of extra noodles. <br><br>The Tan Tan was tasty but not that spicy if you're looking for heat. It also was a little oily and had meatballs which felt out of place. We also didn't realize there was no egg included which is one of my favorite parts of ordering ramen!<br><br>The Tokyo Shoyu had a decent broth, but I wish pork was a little more tender and served with more veggies. The noodles also didn't have a fresh, chewy taste and the egg was overly salty. <br><br>Overall, it had a good atmosphere and filled up quickly during a weekday lunch. There's A quieter area upstairs with seating in private booths (5 available). Standard ramen if you're craving it for a decent price, but not my favorite ramen place.", "pics": null}}, {"review": {"des": "This restaurant has a limited gluten free menu. I ordered the only ramen they offered as gluten free (served with rice noodles) and had them add shrimp (about 5 pieces) the ramen was good, but could have been better, shrimp were great. The total price came out to about $22.<br><br>I don't normally care about price so long as the food is good. But the quality needs to justify the price and it just didn't.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4D_0lohMFBUMJLB8mQrmsA/348s.jpg", "caption": "Red curry ramen with shrimp added. Gluten free modifications so they used rice noodles and left out a few fried ingredients."}]}}, {"review": {"des": "It was another typical freezing day in Chicago,  so Ramen only seemed fitting.  I ordered the Classic Tokyu Shoyu.  It was a nice clean, light broth.  I normally order the tonkotsu, so it was a nice refreshing change.  The noodles are made in-house which is a plus as well.  <br><br>For dessert, we ordered the lemon poppyseed mochi and green tea cream puff.  The mochi tasted amazing.  It was a tad zesty and the poppyseeds were a nice touch.  Definitely not your typical flavor, but I highly suggest getting it if they have it that day.  The green tea matcha cream puff was great as well.  It was the right amount of sweet and cream consistency was similar to a light, fluffy, creamy, ice cream.  <br><br>Overall, solid place to grab ramen.  I can't say it's my favorite, but if you're in the area, give it a shot!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sqc5UJyHPr2QUxZUFmPmEA/348s.jpg", "caption": "Classic Tokyo Shoyu"}]}}, {"review": {"des": "~Vegetarian friendly~ (kind of)<br><br>I've walked by this place at least a 100 times and had no idea what it was, I finally found out last night. I came here with 7 other people, someone from our party made a reservation and we were seated right away. <br><br>The interior is trendy, but nothing special.<br><br>There are only a handful of vegetarian items on the menu, this is what we ordered:<br>-Vegetable Bao<br>-Red Curry Ramen: mushroom medley, eggplant, sugar snap peas, fried kabocha, fried potato, carrots, bok choy, scallions, coconut-lemongrass cream, chili oil<br>-Kinoko Mochi (stir-fry): fat rice cake stir-fried w/ red peppers, asparagus, mushroom medley, eggplant, kabocha squash, parmesan, scallions, sweet chili-soy sauce, sesame seeds<br><br>The Vegetable Bao was good too, I had never had Bao and it was a great first time try! <br><br>The Kinoko Mochi was my favorite! The stir fry sauce was very good and all the flavors meshed really well. Next time I come, I will order this with a side of rice. <br><br>The Ramen was tasty, but the red curry broth wasn't my favorite.<br><br>The portion of each of the entree dishes is large enough to share between two.", "pics": null}}, {"review": {"des": "When I first tried this place, they only had three ramen options. Now, they have many.<br><br>I love the environment- it's modern and has plenty of space. I also love their warm Saki. <br><br>I usually order the tan tan ramen. My favorite part about this ramen bowl is the broth- it's flavorful, has delicious spice and really warms up the belly on a cold day. The bokchoy is out of this world and really soaks up the flavor in the broth. <br><br>Two things that I would love to see change (and would instantly make this place my favorite ramen joint):<br><br>One, the noodles. While yes, they are fresh- they are much too soft. I would love the option of either their regular, fresh noodles or a curly, thick noodle. That is what is truly missing for me with this place: a good, thick, al dente noodle. Not an overdone spaghetti noodle.  <br><br>Two, ramen bowls should already include an egg. The bowl itself, without the noodle, is already $15. Why not throw an egg in there and not charge extra for it? Just a little silly- ramen requires an egg.<br><br>I often return hoping that their noodles change or maybe they add a curly noodle but alas, they have not. In the meantime, I'll be hanging out at other ramen joints- daydreaming of a curly noodle at Slurping Turtle.", "pics": null}}, {"review": {"des": "Not as good as I anticipated. After reading tons and tons of reviews, I finally decided to stop by for lunch. <br><br>Great service, not too busy during 12:30pm lunch peak. My girlfriend and I had the spicy ramen, again.... good, but not amazing . I prefer ramen-sen which is right up the street, bigger and better portion and overall amazing taste.<br><br>Sorry guys.", "pics": null}}, {"review": {"des": "My husband and I always come here. It's the best Ramen place in Chicago that we have found so far. Food comes fast and it's delicious!", "pics": null}}, {"review": {"des": "Ramen San has a tremendous wait and Slurping turtle is next door with no wait.  <br><br>If you're in it for the hip of the wait then wait but if you want fire Ramen go to The Slurp Daddy", "pics": null}}, {"review": {"des": "Slurping delicious! This place is perrrrrrfect for a warm food stop while hanging out on a cold day in the city.", "pics": null}}, {"review": {"des": "This place has really good ramen and this brussel sprouts salad is like the bomb here never really ate anything like it before. Also the duck fat fried chicken is delicious really good and not greasy but the flavor is Soo good . Service is very good helpful and kind. The first time I came here the waiter spent like 15 min answering all my friends and I questions.  Patiently and kindly with very great detail really helped us order.", "pics": null}}, {"review": {"des": "I was a bit disappointed by Slurping Turtle, especially for it to be located in such a hotspot area. <br>My friends and I came here on a Saturday night around 7 and were comfortably seated even without a reservation.<br><br>-The cocktail drinks were mediocre. <br>-The Brussel sprouts appetizer was surprisingly very flavorful, and normally I am not a big fan of Brussel sprouts<br>-The wait for the entrees was a bit long<br><br>I had the spicy miso tonkatsu.<br>-The temperature was mild, I wish it had been hotter<br>-I enjoyed the flavor of the broth, but the seasoning was much more mild and less spicy than expected<br>-Noodles were a bit on the soft side<br><br>I had a filling meal, but it was average, overall.", "pics": null}}, {"review": {"des": "People were really nice & they thanked us as we left. The ramen tasted great, and they had a good street view. I really like the overall design and atmosphere as well!", "pics": null}}, {"review": {"des": "My husband dragged me to Slurping Turtle, as I was not enthused by the name of the restaurant. I'm glad to say that I was wrong! Surprisingly, I didn't even Yelp the place before we arrived. <br><br>I had the duck fat fried chicken and spicy tuna rolls as my entree, I was completely stuffed and didn't even finish. Slurping Turtle's menu has plenty of shareable items and if you have questions, just ask your waitress on portion sizes.  My husband had pork belly ramen, which he enjoyed but his only complaint was that he wished the pork belly was fried.  I would definitely return!", "pics": null}}, {"review": {"des": "I went out of my way to go to the Slurping Turtle. I've never had Ramen before so I wanted to experience it at a place that had good reviews. There were definitely mixed reviews and I ended up really enjoying it! <br><br>I got the hangover ramen. It had pretty much everything and when it came out it was a beautiful bowl! Hey aesthetically pleasing. I gave it 4 stars bc it wasn't as spicy as I would have liked and the broth just needed a little more oomph. But for my first time ramen, it was great! The presentation was beautiful and the location is great. Right off of the CTA merchandise mart stop and surrounded by many great stores and other restaurants. <br><br>The service was great, very attentive and quick. I went during a slow hour (around 1500) so that probably contributed. Sasha served me and she was very sweet! They have a great drink menu, sake and Japanese whiskey for days! Anyways, I will be returning!", "pics": null}}, {"review": {"des": "Yesterday, it was  super cold in Chicago and we decided to come to Slurping Turtle for yummy ramen and warm up our tummies.  We order the Seafood Shoyu and Spicy Tonkotsu  ramens.  We enjoy the latter way much more, but haven sampled both -- you can't go wrong with either.  staff were super nice and accommodating.  Decor is contemporary and location is great if you find yourself around River North.", "pics": null}}, {"review": {"des": "We stopped for a quick dinner. We ordered a takoyaki, three baos(shrimp tempera, pork belly and roast chicken), and two ramens(tonkotsu and spicy tonkotsu). The takoyaki is okay, but the problem with the bao is they are very small, and when I have to share each one with another person, I felt like I eat nothing. The bao is not very expensive, only $4 each. But I still feel it should be bigger.<br>The ramen is very good, especially the broth. It is a little bit weird that the spicy tonkotsu comes with chicken. I felt like you can probably ask the server to substitute for pork, but I wanted to try something new, which did not work out well for me. The other problem is the portion of noodle and vegetable is off. By that I mean you get maybe more veggie than noodle. But because they make the noodle themselves, it might be too expensive to give you more noodles.<br>Overall, this place is not very expensive, and the ramen is great. You just have to order the right one. The other foods are fine, but definitely not as good as the ramen.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yiH88ZpBu-maht4KfJNh8Q/348s.jpg", "caption": "Spicy Miso Tonkotsu Ramen"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dymw7lPwkgQXpOUj4s1kWg/168s.jpg", "caption": "Takoyaki"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kwEfnWqM-J24vsYSsXpMwg/168s.jpg", "caption": "Hakata Tonkotsu Ramen"}]}}, {"review": {"des": "I'm a huge fan of celebrity chefs so I had to come here. Chef Takashi Yagihashi does not disappoint. The Ramen is the best I've had ANYWHERE! If you can make it on Sunday I suggest the Hangover Ramen only available till 3.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OXRpmD82pWKbvQ6X0Vn6gA/348s.jpg", "caption": "Fried Brussel Sprouts"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1s8idEqCz7tzBkGX-xCoHQ/168s.jpg", "caption": "Gyoza (4 pieces missing) oops"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dxjcIvmZNvuTtD6W6wYY7g/168s.jpg", "caption": "Hangover Ramen was scrumptious! Only available for Sunday Brunch."}]}}, {"review": {"des": "I'm a regular here and usually get the salmon donburi bowl.  I like tuna more than salmon so when I heard they had a tuna bowl I had to try it.  But boy was I disappointed.  The tuna quality was subpar.  Also it was quite bland despite being dressed in a mayo sauce.  I actually like the side of sauce that comes with the salmon donburi.  $20 bowl for a bowl that you can get better at Firefin for $14. No thank you...I'll just stick to my salmon donburi bowl.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/d8kajJyYEhZ5ZnoCYxiiyw/348s.jpg", "caption": "Ahi tuna bowl"}]}}, {"review": {"des": "I'm surprised the reviews aren't better this place is freaking outstanding and I have never had a bad experience and I've been here a ton of times. The service is always fast, friendly, even when they're crowded. The ramen and sushi is AMAZING and the atmosphere is so neat and modern and fun. I'd come here every day if it wasn't so pricey but still, outstanding.", "pics": null}}, {"review": {"des": "ummm...yummy!!!! It was cold outside and that warm blow of ramen really hit the spot. The broth was tasty and the ramen was good. I would try a different kind of meat next time though. I had shrimps and I didn't really care for it.", "pics": null}}, {"review": {"des": "This place has a very chill vibe to it. I loved how it was very modern, busy, and just beautiful. <br><br>Starting off with appetizers, they were very flavorful. I had the edamame, yummy chicken bao, and the miso soup. YUM YUM and YUM<br><br>I have heard many raving reviews about the ramen, which was the main reason for my visit. I might have came with such high expectations, but ended up feeling that the ramen here was mediocre. Anytime I eat at a ramen place, I get excited, because each individual place does it a little differently which makes each place special, but other than a beautiful presentation and standard taste, I can't say I was amazed with the Chicken Ramen that I ordered. <br><br>Overall, the food here was good, but I wouldn't recommend this place if you are specifically coming for the ramen.", "pics": null}}, {"review": {"des": "I have been coming to this ramen joint on and off for a while, and the place never disappoints. There usually is never a wait for a table, and the place is clean and well kept. Servers have always been friendly and accommodating.<br><br>Recenty I had the Tokyo Shoyu ramen, and found it to be absolutely satisfying. My friend had the spicy miso, and she loved it too. Usually I struggle to finish my ramen, and sometimes it can be a bit too much for me too eat, but boy did we devour these!! <br><br>This place also serves sushi, which I have found to be decent, as well as a list of appetizers and a whole drink menu. A great place to grab lunch or for a night out.", "pics": null}}, {"review": {"des": "My favorite Ramen place - always order Dan Dan men.  It's a bit meat-heavy for my taste, so I ask for no meatballs but still plenty of chashu pork and ground beef bits.  It comes out piping hot and spicy.  Don't forget to complete you meal with their home-made creampuffs.  My favorite fillings are green tea and red beans - yum!", "pics": null}}, {"review": {"des": "My favorite thing here was actually the duck fat fried chicken we ordered as an appetizer. It was crispy and came with an spicy mayo and a side salad. I regret not ordering more of it!<br><br>As for the ramen, I was disappointed with the quality of it. The best thing about the bowl was the noodles. I believe they make it fresh here, which is a plus. However everything else was lacking. The broth was just missing something I couldn't put my finger on. The meatballs was flavored weird, and the pork wasn't as soft as I wanted it to be. <br><br>Service was great, inferior has a nice design. You have to walk downstairs to go to the restroom though. I found that a little odd.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/z2YUO4_C3AyPYHwaSbMs6A/168s.jpg", "caption": "Duck fat fried chicken. Amazing!"}]}}, {"review": {"des": "Honestly one of my favorite ramen spots. I've been here quite often & it never gets old. Food here is delicious & well done. What more do you need to hear?", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FA052gro9q8Bw28XeUh7_Q/348s.jpg", "caption": "Tonkotsu ramen."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Hk9fkbvqNk4PzL3NQinjxw/168s.jpg", "caption": "Duck fat fried chicken - Good, but nothing special. Pork belly bao - I'm a sucker for pork belly so I looooooved this."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CZHCeCDi0W-0yGNowPWjmQ/168s.jpg", "caption": "Sake flight."}]}}, {"review": {"des": "The location of slurping turtle is in a perfect location. So, if you're in river north I would definitely recommend checking it. I thought the ramen was okay. I got the vegetarian option and added the volcano sauce to my order. The staff was super nice! I also think it's a cute date night spot, but the food was just okay.", "pics": null}}, {"review": {"des": "Excellent food and service! Very reasonable prices, especially for Chicago. We had the sushi and a ramen bowl after a fried duck appetizer. Delicious and unique. Extensive beer, saki, wine, spirits menu.  Yummy and a must visit!", "pics": null}}, {"review": {"des": "Unequivocally a two star place. Ramen noodles are over cooked. Baos were lifeless. Bao dough itself was like a flat pillow and the fillings were meager. Sushi was TERRIBLE. Rice was mushy yet somehow had undercooked bits in there. The fish was old and flavorless. Slightly overpriced. Altogether not an experience that you should avoid at all costs, but this will disappoint most Asians. Service was good.", "pics": null}}, {"review": {"des": "Best ramen in Chicago or suburbs. Hands down. No question. The pork is marinated in 5 spice, mirin, and magic. Noodles are firm and pick up and carry the thick, delicious broth. The tan tan men is perfectly spicy. The molten eggs are ridiculous. Don\"t forget to get 1 or 2 or 10 in your ramen. <br><br>Here's my current list:<br><br>1. Slurping Turtle - River North<br>2. Strings - Chinatown<br>3. Ramen Misoya - Mt. Prospect<br>4. Furious Spoon - Wicker Park", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/X1FTzg7JlaQow2iO5YXaaQ/348s.jpg", "caption": "Tan Tan Men ramen with a poached egg."}]}}, {"review": {"des": "Food was great! Ordered the Tan Tan Ramen on a chilly fall day. Right amount of spice. Got kimchi on the side for a little more spice. I wish the meatballs were a little smaller, but were very tasty.  Serving size was hefty, but great for the price. <br><br>Also ordered the fried chicken in duck fat. DELICIOUS! Definitely a must. <br><br>Had to subtract a star for the following:<br>- Entrance is pretty hidden and not so intuitive<br>- Restroom was a labyrinth to get to, not enough signs to figure out how to get there<br>- Restroom wasn't also the best maintained. It wasn't dirty by any means. But there were a few paper towels on the ground, and I'm not a big fan of soap dispensers that are obviously from a Target or some other store. I recommend that they transfer to something more customized for the store<br><br>Otherwise, great service and great food! Definitely check it out.", "pics": null}}, {"review": {"des": "Although overpriced, ramen is good here, at least the 2 that I tried. There's a good variety of other things on the menu ...my husband ordered the poke bowl and he loved it. My 8 year old wanted sushi, and she was liked her roll, even asked for seconds.", "pics": null}}, {"review": {"des": "Great Ramen spot in River North! Their noodles are made in-house and velvety and rich.  I like the Tan Tan Men, which is their classic spicy ramen with ground pork, meatballs and pork shoulder.  A nice level of spice, and the meatballs are delicious.  My co-worker said it was the best ramen he's ever had!  I'm making it a goal to try all the ramen spots in the city and this one so far actually ranks pretty high.<br><br>The vibe is kinda bar/lounge-y but they have a fair amount of booths as well as a communal table in the middle.  Unfortunately when we went, the service was a little slow - I swear it took almost half an hour to get our noodles.  But overall, still a tasty ramen spot.<br><br>Oh, and the duck fat fried chicken is AWESOME.", "pics": null}}, {"review": {"des": "Updating my review just to add that the Sunday brunch here is really good as well! I had the Hangover Ramen, which was amaaziinggg! Not sure if that's on their regular menu, so definitely be sure to check out their brunch options as well.", "pics": null}}, {"review": {"des": "The waiter started off strong: giving helpful recommendations (he was right that the duck-fried chicken is not to be missed), refilling our water, taking our orders. But after he finished bringing us the food, he disappeared completely, never to be seen again. We waited 45 minutes, puzzled. I thought perhaps he had decided to leave the city forever, and start a new life in the woods where nobody knew his name and nobody would ask him for their check. But instead, I looked over at the counter and there he was, still in the restaurant. With a distinct sense that maybe I myself had ceased to exist, at least for this waiter, I had to flag down a different waiter to bring over the check. I think I know what Bruce Willis felt like in Sixth Sense.<br><br>The ramen noodles here aren't as good as Yusho's. The broth is much better. The sushi is passable and as I mentioned above, the duck-fried chicken is the number one reason to come here. The chairs are comfortable and the temperature is solidly mid-70's. The bathroom is a separate adventure that must be sought out, and I recommend it.", "pics": null}}, {"review": {"des": "Amazing ramen! <br><br>If you don't eat red meat but want something spicy, ask for their volcano sauce as a side for the seafood ramen. It has the kick I needed.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2eRgLZ63UYs47bT_jeFd4g/348s.jpg", "caption": "Seafood ramen special"}]}}, {"review": {"des": "Great ramen spot in River North! Really cool decor. There are some lofted booths that I've ended up in every time I've gone here. Good for dates! Expensive but worth it. Great service.", "pics": null}}, {"review": {"des": "Meh... I wasn't impressed. It was a cold day and we were in the neighborhood so we decided to stop by as hot delicious ramen sounded like exactly what we needed. Our server was very nice and explained the menu thoroughly which was much appreciated because I had no idea what to order. We got a window table which was a plus as we could people watch during our meal. The food itself was good but nothing memorable. All the wait staff seemed to be very friendly and accommodating. I will probably not be back as I can have much better ramen at many other places.", "pics": null}}, {"review": {"des": "Overall: 3.8/5<br>Food Taste: 4/5 . Pretty decent ramen! The hakata tonkotsu was not too rich or salty and the broth tasted good. The ramen noodles themselves weren't as chewy as I usually like but fine. The seafood ramen had fried calamari in the soup which was (in my opinion) not a good move since the fried outside came off and became more mushy. It would be good if the fried seafood were given more as a side that people could choose to put in or not. The donburi was very poke-like.<br>Value: 2.5/5. Honestly everything is overpriced. Each bowl of ramen is like $15-17. You could get a really fancy dinner for that price. This was the biggest disappointing part of the meal. If they dialed the price down like $4 per item I would consider coming back.<br>Service: 4.5/5 Very attentive waiters who came back to check on us <br>Ambience: 4/5 Cool bar-like space yet fun and friendly and casual. If you can get one of the tables on the second floor you should go for it!<br><br>Probably won't be coming back anytime in the near future  just because the price is a little too much for me but the food was good and I had a good experience.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1mVH3dly9mWxczYriTbiqg/168s.jpg", "caption": "Tonkotsu"}]}}, {"review": {"des": "This is my second time here. Came with two friends this time. We all ordered different things. I ordered their classic ramen which is the only one that had an egg in it. My other friend ordered the duck fat chicken. My second friend ordered the tacos. They shared a salmon avocado maki. The ramen was pretty good. It seemed like it had more to eat than some other ramen places. The maki was pretty tasty according to my friend. They were surprised about how good the maki was. My friend who ordered the tacos was told that it would small. In the yelp pictures, it did make it appear bigger than what we got. I would not get the tacos unless you are not very hungry. However, there was surprising a lot of meat in the tacos.<br><br>The decor here is very modern. The restaurant has a bar section for people who just want alcohol. The entrance to thus place can look hidden as the door is a large wooden one. The restaurant has two floors. <br><br>I would come back here but it is pretty far and a little pricy", "pics": null}}, {"review": {"des": "Duck fat fried chicken: 5 star!!<br>Tan Tan Men: 4 star for the first sip, then 3 star after few bite(because some flavor is missing and yet so salty, my mouth/lips felt dry while eating soupe noodle), i even had to eat some ice cream to cover that terrible fat-salty flavor after diner, 2 stars!!<br>We live 5 minutes from the place, but for how bad they are we'd rather diver 20 minutes to milwaukee for some real ramen.", "pics": null}}, {"review": {"des": "The meal selection was limited but it was tasty. I recommend the short ribs. I had the shrimp ramen which was filling. My kids had the spicy ramen and the Japanese fried rice which was decent. I do recommend the ramen soup as it was filling.<br><br>The place was nice and comfortable as well as quiet. It a nice place for lunch", "pics": null}}, {"review": {"des": "Duck fat fried chicken so tasty, pork belly steamed bun beyond good and the Ramen noodles were so awesome. The menu said spicy for my noodle bowl but if only say it's a 4 out 10 on the spice scale.  Taste was amazing!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nMKVZ-9gKrHLorgtmMJjcw/168s.jpg", "caption": "The duck fat fried chicken was awesome but the pork belly steamed bun was my fave! If the menu says spicy ask them to turn it up!!"}]}}, {"review": {"des": "The hangover ramen was good (noodles tased home made and very good) and the atmosphere was clean and fresh. Service was good and friendly; so why the 3 stars? Price. There are other ramen places in the city just as good (arguably better) but not as costly. 4 people $100 with only 1 drink. Ramen is a soul food for the people like pizza is; doesn't need to be gourmet just make it YUMMY.", "pics": null}}, {"review": {"des": "I was craving ramen and we had been walking around all day and needed something warm.  There  were two ramen places nearby, slurping turtle or ramen san. We chose slurping turtle since it had more reviews. <br><br>We went during happy hour and ordered 3 apps from the happy hour menu and a bowl of tan tan ramen. My favorite of the apps was the duck fat fried chicken. It was super crispy and hot. The chicken was also very flavorful.  <br>The pickled vegetables was a pretty small portion, i would not have paid regular price for it. The tuna roll was pretty basic. <br><br>The tan tan ramen itself was so plain and boring. The only thing i enjoyed in the ramen was the meatballs. The soup was bland and watery. It didnt have any sustenance compared to other tan tan ramens ive had. <br><br>Come here for the duck fat chicken. Not sure how their rice bowls will taste if the ramen was so bland.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/97m-VlY9RN7D2cqjYlDK3Q/348s.jpg", "caption": "Tan tan ramen"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JZnWXARMHPxwdyzpyV655Q/168s.jpg", "caption": "Duck fat fried chicken"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9RtAa_fHxugczFXMhWaqcQ/168s.jpg", "caption": "Duck fat fried chicken"}]}}, {"review": {"des": "Great casual place to get good Asian food in the city. They cater to American taste buds. Highly recommend their fried chicken and ramen. Sashimi is fresh and reasonably priced. Definitely will go back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LJOzHbMpTnoLywKljjYQUg/348s.jpg", "caption": "Ramen"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GAttV0AX3h3VpUzuL56BHA/168s.jpg", "caption": "Sashimi"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/k7pgZdjoRcxJryWdItN47g/168s.jpg", "caption": "Duck Fat Fried Chicken"}]}}, {"review": {"des": "The ramen here was absolutely delicious and so was the service! I think what stood out to me the most was how quickly the ramen was made and also how seamless and caring the people there were. I am a ramen enthusiast and this is one of the best places I have been to in the city in terms of serving yummy ones. Will definitely be back!", "pics": null}}, {"review": {"des": "The ramen is 10x better than Ramen-San, down the street. That's all you need to know. It's more authentic; the noodles are house-made and a great consistency, and the broth is great. I slurped the broth until I could see the bottom of my bowl.<br><br>The space is modern and airy. The tunes are top 40s (though not the super obnoxious tracks). Beer selection is good; I went for some local pale ale. <br><br>The people working here were very nice. The person whom I'd have to imagine is the owner or a manager was also circulating and helping out customers, which I thought was a nice, personal touch.<br><br>I wish a place like Slurping Turtle was near my hometown.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qqxgSKf3GwiEB43lAlIEXw/348s.jpg", "caption": "delicious Miso Tonkatsu"}]}}, {"review": {"des": "Japanese comfort food spot located on the Hubbard which offers grilled dishes and drinks too.Me and another yelper visited this place for lunch . The ambience was really good except that we could not get the place on upstairs. Waiters were good and service was fast and attentive. when we my friend who ordered ramen got meatballs in her ramen in spite of telling them to avoid it,however they rectified it by serving another choice of ramen and even they had the bill on them for both which is a very good gesture. However the food was ok not that great.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/D37tNrGD6vuvWobtQQMVlw/348s.jpg", "caption": "Miso ramen with volcanic spice ( just reminded me of Indian chutney but its too much tangy not spicy)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YI9-ugE4dQ5GEUlToCtxBw/168s.jpg", "caption": "Tan Tan ramen( the famous one they mentioned)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ej3ynTj9R76nLhCAoTNakg/168s.jpg", "caption": "Sea Food Ramen( Not great)"}]}}, {"review": {"des": "Yesterday was a rough day. Come lunchtime, I was already thinking a bowl of ramen would feel like a much needed warm hug. And boy, was I right. I ordered the miso tonkotsu and the broth was out of this world. The pork was also delicious, but I just wish there had been one more slice instead of more noodles. And maybe an egg on top :) but for a hefty $16, the bowl was a good size and definitely filled me right up!<br><br>I sat up at the communal table, alone at first since I got there so early. But eventually more people showed up around noon - groups of friends, solo diners, business people. With top forty playing, it quickly became a lively atmosphere. Everyone just there to enjoy some delicious food, brought by the great Chef Yagihashi. I left that day not only with a warm and happy belly, but a little reminder too. A bright spot on a very bleak day.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/H0JSvFdwuCAF_7QFQ8FZJA/348s.jpg", "caption": "Miso Tonkotsu Ramen"}]}}, {"review": {"des": "Horrifically mediocre. I guess this is where I should have trusted Yelp instead of the online food blogs. I came here because most of the online food blogs I read about food in Chicago said that this was the best ramen in Chicago, and that the noodles are housemade, which are usually promising. <br><br>I got the shoyu ramen but was largely disappointed. While the broth tasted pretty okay, the noodles were meh. If the noodles are not that chewy and kind of bland, it's hard to love the ramen dish as a whole. I will say that the cha siu was promising though, and I enjoyed that a lot. But overall, nothing to write home about.", "pics": null}}, {"review": {"des": "Favorite ramen spot in Chicago! They make their noodles in house, so it's much better than other ramen I've tried. <br><br>I originally came for the ramen but became a regular because of the sake selection.", "pics": null}}, {"review": {"des": "Love the ambience and good service. My bf and I ordered ramen and both enjoyed our noodles!", "pics": null}}, {"review": {"des": "I truly enjoy their Shrimp Shio Ramen! I've have not tried any other dish so my rating in based on this one dish I've had in the restaurant as well as take out. Great customer service and the staff are truly kind. I say give it a try... solid ramen", "pics": null}}, {"review": {"des": "I had read reviews from other yelpers describing how delicious their food is along with knowing they are Michelin recommended so I had to give it a try myself. Slurping Turtle exceeded all my expectations from their friendly staff to their amazing food. My girlfriend and I started with the duck fat fried chicken, absolutely aaaamazing a must try. I ordered the tonkotsu ramen for my slurp which is one of my favorite styles of ramen and the flavors of the broth were bursting with so much umami they danced in my mouth. And of course I had some mochi for desert. Get the mango thai basil it will not disappoint.", "pics": null}}, {"review": {"des": "The ramen is higher stars  But overall I had some issues. I was traveling with a friend who has a food allergy, I ordered the duck fat fried chicken. Discuss my friends allergy with the lovely waitress who says the kitchen only uses one fryer. Ladies and gentlemen that means it's not fried in duck fat :( <br>And honestly that's my only reason for docking stars. <br> Now the ramen was amazing they make there own noodles so your options are limited but they are delicious. Had the tan tan men on that cold day it was sublime! The flavors were on point I just wish the hotel had a fridge, I couldn't finish my bowl. <br> All of the staff that worked our table- front waiter, back waiter, hostess, were amazing and kind. <br> Also the logo! So cute, they do sell their T- shirts just wish they had other merchandise like magnets.", "pics": null}}, {"review": {"des": "This is located very close to our hotel so we came here for dinner after a day of touring. It was a Monday night we were seated right away. They don't have a kids menu but offered to make a broth and noodle for $8 which was perfect for my little one who didn't care for everything else in the bowl. I had the traditional Tokyo shoyu. I particularly liked the molten egg in my bowl. The tan tan men bowl was spicy but good if you can withstand it.", "pics": null}}, {"review": {"des": "Finally found a place with softer noodles!!! As an avid ramen fan, I have been on the hunt for a place with noodles like this. Many ramen places typically have those firmer curlier noodles which I'm not as big of a fan as. I got the Tan Tan Men which was awesome - a good amount of spicy and not too salty. But the noodles are what really did it for me! Side perk: you can purchase their noodles for $3 to take home and cook yourself. <br><br>The place is decently sized and is definitely more of a trendy environment. Note: you enter through a building to the side which then takes you to the main entrance. <br><br>Was it a little on the pricey side? Yes ($19 after tax and tip) But did I leave feeling satisfied? Bigger yes! Not somewhere I'd come on a weekly basis because of the price but I can guarantee you I'll be back soon enough (post finals lol).", "pics": null}}, {"review": {"des": "Got the duck fat fried chicken as an appetizer after reading so many good reviews. The chicken was very tender and crispy but it was lacking flavor in my opinion. The order came with 5 pieces of varying sizes and a bit of greens on the side. Not a bad starter just wished it had more flavor. <br><br>For my ramen I got the tonkatsu ramen and it was pretty solid. They make their own noodles so they were straight and chewy. Pork belly was a little on the tough side but still good. The broth was good but not super flavorful. Since mine wasn't spicy I had the option of adding the volcano sauce (super spicy so they give you a side to add yourself). I would suggest adding a little of the sauce in order to give it a little more flavor. Friend got the poached egg added which was disappointing. The egg was super runny and the yolk basically cooked in her soup. <br><br>Other than that, staff was friendly and accommodating. A friend ordered the wrong drink and even though the cocktail was already brought out the waitress kindly offered to take it back and replace it. If I lived in the Chicago area I would probably return.", "pics": null}}, {"review": {"des": "A good place for Ramens. The Tan Tan Ramen was good but a bit salty. We ordered snacks of fried chicken and ribs. Chickens were just fine.. Recommend Ramens.", "pics": null}}, {"review": {"des": "Whoa, how have I never reviewed this place before? This place is slurptastic! I love a good bowl of ramen--something about rich broth and homemade noodles that makes it so incredibly comforting.  Now that ramen's reputation has moved away from Maruchan's instant noodles to something much more exciting, ramen places have been popping up all over the place which makes it really hard to determine which ones are worth your time.  Slurping Turtle is consistently awesome, and for some odd reason it has never been that hard for me to get a seat without reservation either which is a major bonus because let's face it: no one ever really plans ahead for ramen.  People normally go when the craving strikes, so there better be seat for when that happens.  My favorite is the Tan Tan Men (if you life pork and spice), and the non-ramen dish that I dream of is the Duck Fat Fried Chicken--incredibly flavorful and crispy...that side spicy mayo sauce complements it so nicely too.", "pics": null}}, {"review": {"des": "The food is pretty good, albeit a bit over priced.  I have been here about 3 times and the first two were great. The service was friendly and quick. However, today the bartender/ server dude was not on his game.  He was a bit rude, and never once did anything without me having to ask first.  Plus they forgot the spicy miso, in the spicy miso that I ordered!!", "pics": null}}, {"review": {"des": "Chicago. Day 2. Ramen.<br><br>Tantan broth - 2/5<br>Noodles - 1/5<br>Char siu - 2/5<br>Pork belly - 3/5<br>Pork meatball - 2/5<br><br>Overall, \"I've experienced better.\"", "pics": null}}]}