{"name": "small-cheval-chicago-2", "reviews": [{"review": {"des": "Wanted: a tasty burger, salty fries, ice cold beverage.<br><br>Got: all of the above and beyond friendly staff!<br><br>Amazing patio space and amazing food!!", "pics": null}}, {"review": {"des": "4/5 star burger<br><br>Very tasty meat<br>Close to perfect fries<br>Decent shakes<br><br>I know some people prefer this to Au Cheval- best way I can describe it is a less greasy version of the Au burger....but I say give me the grease!", "pics": null}}, {"review": {"des": "Are you kidding me! I'm away from Chicago for less than 2 years and they made a mini version of Au Cheval!?!?!<br><br>Listen, there's less on the menu and it's definitely not as good as the original in the West Loop. It's pretty darn close though. If you add in the fact that you can order it as pickup or even have a delivery service bring it directly to your door, than we're definitely talking about a 5 star experience. <br><br>What's next? A little Alinea on Uber Eats.", "pics": null}}, {"review": {"des": "Love this place.    It's down the street from my house and think it's the best grill top burger out there.   Cheese burger and fries is a great hangover cure.", "pics": null}}, {"review": {"des": "best burger. best fries. best shake.<br>10/10 recommend. The line may look long, but it moves quickly and its worth it! Outdoor seating in the summer, cozy inside in the winter.", "pics": null}}, {"review": {"des": "Ignored this place for the longest because I knew I'd become obsessed. I had decided on ordering a cheeseburger and a strawberry milkshake prior getting there but that quickly changed when I caught a whiff of the fries. Ended up ordering a cheeseburger and fries, to go. By the time i got back to my place (4mins later) my food was still hot. Fries were crispy and the cheeseburger was both different and delicious. It was coated with some kind of oil. This made holding it a little messy. Especially when I was trying to work/eat. (Grab lots of napkins). Overall great experience. Service was fast and food was tasty. <br><br>Don't forget to get some ketchup and garlic aioli sauces!", "pics": null}}, {"review": {"des": "Was good, think a bit overpriced for a burger. Came with reo patties , picked.and cheese. I think I prefer Kumasi corners. Menu is limited. Tin ceilings had lint dripping off of it. Atmosphere is cute but needs a deep sanitizing.<br>About he burger two patties with pickes and a slice cue if cheese. Garlic Aoli was yummy. I would like to visit aucheval try a more extensive menu. The beef was good but the balance of flavors was basically a salt lick.", "pics": null}}, {"review": {"des": "Been here a few times and yes, their burger is awesome. Is it worth the long wait at prime times? I'm not a fan of crowds so my answer is no  but you be your own judge. It's the little sister of Au Cheval and while the burgers aren't as spectacular as big sister's, they still rock. Two juicy patties of prime ground beef on a buttery bun are how any quality burger should start. Add bacon and cheese to complete the package and you're all set for a much deserved indulgence. Of course you gotta get those fries. So crispy!! Haven't tried their shakes which is the third and final thing on their menu. But I see that people swear by them. <br><br>Sure it's small, has long lines, and doesn't have much indoor seating. But they turn orders pretty quickly and there is a good sized outdoor patio. And the burgers are worth the raves they get. While not on my top 5 burger list in Chicago these rank pretty high on my scale. Definitely worthy of the 5 stars. You gotta go and see what all the fuss is about!!", "pics": null}}, {"review": {"des": "Overpriced burgers that are done better somewhere else...like at home..<br><br>I don't think we'll go back due to so many other options but convenient location off the 606 makes it attractive but we never go back.<br><br>I think we might probably go back..it's just not appetizing enough to justify the price. It makes me wish for an In N Out.", "pics": null}}, {"review": {"des": "Just bit into my burger and found a HUGE piece of plastic. Worst part is there is NO contact person what-so-ever listed on their site or phone number. I have always loved this place. Completely uncalled for and disgusted.", "pics": null}}, {"review": {"des": "Best burger ever. Never thought I would find a burger I enjoy more than in n out but this place is the one. The patties were juicy and flavorful and they were generous with the toppings and cheese. The fries were good as well and the several sauces they have are all good. Just an amazing burger that I can't do justice by describing with words.<br><br>Au Cheval gets really packed so if you can't grab a meal there then make your way to small Cheval because this is a Chicago essential imo.", "pics": null}}, {"review": {"des": "How good can a burger be, right? Try this place and get back to me. The burger is cooked perfectly. The bun is a tasty brioche bun. Even the ketchup is great- how can ketchup taste good?!? No idea but here everything is good. Plus you have several options for beers.", "pics": null}}, {"review": {"des": "Yeah it's not quite the same as Au Cheval, but for what it is intended to be (a quicker, more accessible version), Small Cheval really nails it. Delicious burgers, cold drinks, the garlic aioli + those incredible fries, and even a patio to boot!<br><br>I try and make it down to AC at least once a year, and now that I've confirmed I can get a very similar, high-quality burger & fries at SC, will probably make that trip much more frequently. Great location (easily accessible to the blue line & 606, and friendly staff. Nice job!", "pics": null}}, {"review": {"des": "So. Delicious. There isn't much to say that hasn't already been said but it's not often I find a burger I like as much if not more than In n Out or Umami. I love that the cheese is perfectly creamy and melted and the pickles are some sort of yogurt sauce almost? I honestly don't know and don't care. The fries are perfectly crispy and the self serve garlic aioli is out of this world. This is going to become a very bad habit.... <br><br>Plenty of outdoor seating, order at the counter, never a wait!", "pics": null}}, {"review": {"des": "Came here on a date on a rainy day. I had no idea what to expect but I was really impressed. Because of the rain we obviously had to sit inside, we didn't think there were enough seats but someone was leaving and we grabbed them. Ordered a cheeseburger. Let me tell you, it's as good as the hype!!<br>The burger was great! The fries were also amazing! I got it house style and they have a condiment bar where you can put what you want on the burger or fries.  There is a big table in the center where you can sit around it, cafeteria style and some table around the edge of the place with stools. They do serve alcohol but didn't partake in drinking, just water.<br>I cant stress how great the burger was... Go just go!", "pics": null}}, {"review": {"des": "I have been driving past this place for years, and how could that sign not provoke curiosity?  We finally investigated the other night when hunger forced our hand.  I had the two kids on my own, as my wife was at book club, we had no groceries to make a meal.  We were hungry now.  Let's try that little place that sells burgers and fries.  The kids were all about it.  <br><br>Street parking was a cinch, a look through the window on the way in told us the place was jam packed at 7pm on a Sunday night.  As we walked up to the order taker, I told her it was our first visit, and without a hint of irony she pointed to the three items on the menu board, hamburger, cheeseburger & golden fries, and told us \"This is the full menu.\"  She went on to tell us we could add bacon, lettuce and tomato, but suggested we have our first as they present it, which is what I did.  The kids made minor adjustments to their orders.  <br><br>We were served quickly, found a spot to sit on the corner of the big community table, and dug in.  Yep, the fries with the garlic aioli is the bomb.  My son also put some garlic aioli on his burger (he ordered it without Dijon), and thought it was most tasty.  All three of us had great enthusiasm for our burgers, fries and shakes, and all three of us would like to go back and try it again.  We all want to try the burgers with bacon.    <br><br>Best burger ever?  <br><br>No.  <br><br>Those who write that in these reviews clearly show what rookies they are, or how little experience they have in dining out in Chicago.  Just in the last month I have had better burgers at Reclaimed and Forbidden Root, though neither was $10.  Even the burger at Toons is competitive with this.  And don't even try to tell me Small Cheval's burger is better than almost all the burgers at Kuma's.  Still, it is a great fast food option a heck of a lot better than any franchise place, and did I mention you can get a beer and a shot?  It is an excellent option when bar food or dining out isn't what you want, but you still want a good burger with a beer, and you want it FAST, before getting back to the rest of your life.     <br><br>It really is a tasty burger, one worth trying, one worth sampling again and again with regularity when you just need a bite to eat with a beer (or shake).  And how can you not love the space, the vibe?  It was too cold for us out in back by the picnic tables, but I bet that is a great scene in the summer and early fall.  The truth is, they have staked their reputation on making three things, and making them well.  They better deliver a quality burger and fries, and it shows you just how you can make a business work by doing just a few things exceptionally well, as they do with their FULL MENU.  Bravo Small Cheval.<br><br>As for burger itself, they serve double thin patties done medium rare along with perfectly melted cheese, Dijon, onion, pickles and puffy bun make this a delectable treat.  A bit overpriced, if you ask me.  Two cheeseburgers, a burger, two fries and three shakes, $54.  So as much as I think we will go back, and can't wait, it isn't a place this family can run too with regularity for a quick meal.  What a good treat though.  <br><br>I understand Small Cheval isn't catering to us.  Guessing from the clientele at this packed joint Sunday night, most of them have the plenty of disposable income and a no kids lifestyle, such that a much better than average $10 burger and a beer is well within their budgets.  It would have fit mine too at that point in my life, and I wish I had known about Small Cheval then.<br><br>We had a very fun meal.  And had a great conversation about doing just a few things (burgers, fries and shakes) really well, can make you very successful in life or business.  I know we will go back and eat here again, and the enthusiasm we had for our burgers is enthusiasm I think others will have once they visit here.  Its a fun, lively, tasty, quick burger and beer or shake, in a space that entertains.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5udq63go3u3vDloWzlSYcA/348s.jpg", "caption": "Proudly served"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OyukP0Wd0W3hSz377VCcRw/168s.jpg", "caption": "In case you haven't figured it out, this is the FULL menu."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/z_yAVTLFd3IkZ9jmOp8cwg/168s.jpg", "caption": "Order here."}]}}, {"review": {"des": "I LOVE the simplicity of Small Cheval. Such a perfect burger joint.<br>I came here on a Sunday afternoon, and there was a line out the door.. pretty intimidating, but we only waited about 10-15 minutes to order. <br>I had the plain burger, with bacon (of course), a side of fries, and a chocolate milk shake to complete my meal. <br><br>Good thing it was a beautiful sunny day out, so we were able to sit in their patio. Otherwise, it is pretty small inside. The only downside was we waited a little long for our order (we noticed that the people who ordered after us got their food first), and the burger was a little dry.<br><br>Other than that, definitely a great burger spot in the neighborhood!", "pics": null}}, {"review": {"des": "As the name implies, this an offshoot of Au Cheval, and the menu is inspired by the restaurant's most famous item--the cheeseburger. This isn't the exact same burger, but enumerating the differences feels like splitting hairs. It's a little smaller and $1 cheaper. You can add bacon (it's thinner than at Au Cheval), and lettuce and tomato, though the burger doesn't need them. The super-thin patties themselves don't add much flavor, but the perfectly melted cheese, Dijon, onion, pickles and puffy bun add up to a delicious combination.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/39lieBJeBG9bE6NMS6KAbw/348s.jpg", "caption": "Such a great burger!"}]}}, {"review": {"des": "Cheeseburger with bacon, fries, and a shake. The classic American trio. Small Cheval does it so right.<br><br>Forget Au Cheval and come here if you're just looking for a solid burger that doesn't require you to wait in line for 4 hours.<br><br>One of my most favorite things here is the condiment station, which includes the classics like ketchup and mayo but also GARLIC AIOLI. <br><br>Everything is great and delicious and wonderful and you should come here.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/O6k2j0VJv1khXGeYsuhrLA/348s.jpg", "caption": "Bacon Cheeseburger, fries, vanilla milkshake"}]}}, {"review": {"des": "Small Cheval's burgers are so good that I had dinner the night before & woke up the next morning craving the burger. It's no-frills, simplicity that kind of reminds me of Culver's ButterBurger but it's pricier ($8.95 for a hamburger & $9.95 for the cheeseburger) of course. <br><br>I went for a regular hamburger housestyle (Dijonaise, pickles & diced red onion). You have to ask for lettuce & tomato if you want it, but it tastes perfectly fine without it! Also, the regular hamburger comes standard wtih 2 patties already! This creates a better beef to brioche bun ratio. <br><br>The golden fries were also fantastic. Nicely salted and didn't taste like it was frozen. <br><br>Appreciate that Small Cheval is no frills - just a damn good burger. <br><br>144/365", "pics": null}}, {"review": {"des": "I've heard nothing but rave reviews about all of ~the Chevals~ from Au to Small, and when I spotted this quaint spot while walking through Bucktown, there was absolutely no question where I was going to get dinner from. It was about to be a Small Cheval night, baby!<br><br>Even before you walk in, you're all pumped up because you KNOW their food has to be good -- their menu is painted on the side of the building, and they make three things: hamburgers, cheeseburgers, and fries. THREE THINGS! Only restaurants that know they're amazing at what they create can get away with that (I know they have other, larger locations, but still!). <br><br>The inside's small (duh, it's in the name!) but it's set up cafeteria-style, with a giant community wooden table in the middle and bar seating along the walls. I also visited on a very warm day, so there's lots of outdoor seating as well, which I happily chose after the long, dreadful winter we just had!<br><br>The line wasn't painfully long around 6:15pm, but I'd imagine it gets busier. The cashier greeted everyone with a \"howdy,\" which I really loved for some reason, and the kitchen staff, who were easy to see from the main dining area, were laughing and joking loudly. You can tell they really enjoyed being there. Knowing the people who work at a restaurant enjoy the atmosphere always makes a visit even more fun.<br><br>OKAY, NOW ABOUT THE FOOD. As I said, you can order a hamburger, cheeseburger, and/or fries. You have the option of adding bacon, lettuce, and tomato, so that's what I got: a burger with b+l+t. There's also a little condiments bar inside, where I grabbed some garlic aioli to add to my burger. And let me say, folks, when my burger was brought to me I was ECSTATIC. I'm not gonna lie, I'd had a few drinks next door so I was hungry anyway, but after just one look at this burger I knew it was going to satisfy my nourishment needs. I was actually pretty tired after inhaling it, but that's a good thing! Usually after a few drinks, *nothing* I eat satisfies me and I eat a bunch of little meals and snacks. Not on Small Cheval night, friends.<br><br>I am so glad I finally got to try Small Cheval, but apparently I was supposed to try Au Cheval first. OOPS. That's next on my list!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/whh6uYBhm4jTXwzy9yP4Dg/168s.jpg", "caption": "Unique!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Fr4y-7NDaYGp62v7o8-2Bg/168s.jpg", "caption": "Hamburger with bacon, lettuce, and tomato! AMAZING"}]}}, {"review": {"des": "Best burgers in Chicago!!! The dijonaise & pickles are the stars, on the perfectly cooked cheeseburger! I add bacon, because everything is better with bacon!", "pics": null}}, {"review": {"des": "I loved Au Chavel when I visited Chicago last time. My brother suggested Small Chavel since the wait would be much shorter and we were coming to Wicker Park. We got here around 12 pm on Sunday. The wait wasn't long and it moved fast. <br><br>- The menu is simple with only 3 items on there: Hamburger, Cheese burger, and golden fries. <br>- They have indoor and outdoor seatings <br>- 2 types of ketchup, garlic aioli, mustard, ranch sauce as condiment selections<br><br>Great burgers and good portion. I was definitely full. I would come back here when I am visiting Chicago next time!", "pics": null}}, {"review": {"des": "My cousin bought me here during my trip and I became a little \"obsessed\". We took the L in, it is not that far of a walk which was convenient. Oh yea, it was raining when we went so you knew it was worth it. <br><br>Walked in and the establishment was nice and small. The vibes were very nice and pleasant. It was inviting and warm. I was a little confused about what to order but my cousin did it for me. I just knew I wanted a cheese burger lol. I feel like the best part about the burger was the bun. It was fresh and . .  buttered up. <br><br>As I read reviews, a lot of people said that the fries came out \"warm\" or not \"cooked all the way\", but I remember my fries being really hot that I had to wait to eat them. So I guess I got lucky? <br><br>Anyway, I will be back when in town.", "pics": null}}, {"review": {"des": "Wowza. This place went above and beyond my expectations. The service was friendly, fast, and efficient! The inside was cute, a tad dark, but very hip. The outside portion had long picnic tables and felt very cozy under the stringed lights overhead. I loved the little trees that were around the outside portion of the restraunt to create a sense of privacy. The food came out fresh and hot. The cheese oozed down from the top burger Patty onto the second burger patty. I know, second burger patty?! I didn't know I was ordering a double either but I'm not complaining. The meat was juicy and paired with the garlic aioli, it just felt like pure burger gold. This burger is a burger that was design to feed the Gods in ancient Greece. This burger was designed to make every meat eater smile and thank God for creating cows. This burger makes a new born baby wish they had their adult teeth. <br>Just be prepared to shed a tear of utter happiness after your first glorious bite. <br>Dip your fries in the garlic aioli. And enjoy your night as your taste buds are on a ride of their little lifetime.<br>Only suggestion is to have days where we can have half off burgers or half off shake days! The place will leave a 38 dollar dent in your pocket, and it would be nice to have days that honor your costumers!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Dbr3RUpc7FqUS5QC4IMoSA/348s.jpg", "caption": "Loved celebrating my special day with him"}]}}, {"review": {"des": "Big taste in a small place. Indecisive people rejoice, as this menu only has three choices: hamburger, cheeseburger, and fries. Enclosed patio with picnic table style seating. <br><br>If you ever see this place without a line, jump right in because it doesn't happen often. We ordered a cheeseburger, fries, and a vanilla shake. Order your burger housestyle, and it will come with dijonaise, onions, and pickles. Add bacon for $2. Food was above average. The burger bun held its own and was not soggy. The double patty was juicy cooked medium well. <br><br>As I waited for our order on a Tuesday at 8:45pm, I noticed the expo did a tremendous job of trafficking the food orders from the cooks, and it wasn't even that busy. Twelve orders at once and no one bat an eye. I've seen this place 10x busier, so something tells me you have to do more than juggle to work here. Around five line cooks were working. <br><br>The menu isn't the only thing that is stripped down to a few words. A lot of labels in this joint. The condiments. Grab your soda here. Order here. Pick up here. Shakes. Shots. Beers... This place screams minimalist. <br><br>Next stop, Au Cheval.", "pics": null}}, {"review": {"des": "Quick, solid burger! <br>However, burger patty could've been juicier; maybe over-cooked. Fries were fresh and crisp.<br>Community tables, very casual setting.<br><br>Will visit again if in the area", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/54eK26VivSs4OeE_otjF0Q/348s.jpg", "caption": "Bacon cheeseburger"}]}}, {"review": {"des": "Au Cheval's smaller sibling was better than the original restaurant (IMO).<br><br>Au Cheval: I remember getting so excited about the \"best burger\" in Chicago and seeing all the delicious pictures of thick cut bacon and eggs on burgers. I HAD to go and dragged the boyfriend downtown where we waited 3 hours on a week night (no joke) for a table which felt stuffy and dark. The parking situation downtown sucks as well and although the burger was delicious and memorable, I felt that my In-N-out experience trumped the one I had at Au Cheval. <br><br>I'm glad Small Cheval exists because I can get a fantastic burger and yummy shake and not have to deal with parking or waiting issues. I'm impatient! <br><br>Food: We both ordered the cheeseburger which I am drooling about. The burger was pink (normally that scares me) but I had to try it the \"authentic way\" and was glad I did. We also go fries and they have the yummiest alioli garlic dip! I ordered a vanilla shake and the girl at the front was saying that they use actual vanilla in their shakes. There wasn't a wait and there was also PLENTY of street parking outside the restaurant in Wicker Park! <br><br>I would say the only negative is the seating situation. I know in the summer there is plenty of outdoor patio seating which I'm excited about! The inside has a communal \"square\" and small tables along the wall with chairs that don't move. I understand the \"eat with your neighbor\" logic of the tables but to be honest it felt super cramped.", "pics": null}}, {"review": {"des": "When the urge hits, and I want to skip the wait at Au Cheval, I head to its sibling for an equivalently-bold burger. The flawlessly griddled patties are topped with American cheese, pickles, dijonnaise mustard, and optional bacon. Simply orgasmic!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/h2TEL2W1x0L237lfDHF03g/348s.jpg", "caption": "Flawlessly griddled patties are topped with American cheese, pickles, dijonnaise mustard, and optional bacon."}]}}, {"review": {"des": "Hey, we know why you're here and I can't blame you... You're a rational person who values 6 hours of your free time over eating a hamburger, which has since been OUTVOTED by The Loyalist (lounge of Smythe- two stars, 2018).<br><br>While this place isn't the 100% \"authentic\" experience (no bacon burger), it's still pretty darn good! Don't be intimidated by the line- it moves pretty quick! <br><br>Burger was solid (for those from the Midwest, it's everything you'd hope Culver's will be each time you eat it), and they had a nice assortment of condiments, including a garlic aoli that's todie for, if that's your sort of thing. Fries were up to par as well. While I didn't drink, my friends all got the alcoholic milkshakes and said they were excellent.<br><br>Be mindful that the place isn't very big, and you seat yourself. Much of the seating is at bar stools around the inner perimiter of the restaurant, though they have some outdoor seating ad well. They are open late, and probably not a great spot if you have kids, logistically speaking. Can expect this place to set you back about $20 depending on what you order, which isn't bad at all!", "pics": null}}, {"review": {"des": "When u don't have the time for the real deal, Small Cheval does it every time. Smiling faces all around on the staff. Management is top notch too, I appreciate that they carry Crystal Hot Sauce too! Definitely a Louisiana thing that should be everywhere. Thanks!!<br>Augie", "pics": null}}, {"review": {"des": "HECK YES. I want to go here every time I come to Chicago now!! This burger was so delicious. I love me a plain burger just done right. I love that the menu is small. I also love the condiments! Garlic aioli in a tub? 2 types of ketchup, mustard, and hidden valley ranch are also provided. This girl likes dipping options. <br><br>The outdoor patio seating was surprisingly large. The lack of wait was also a wonderful surprise. We walked right up to the register. Placed orders. Shots of mallort were sitting right next to the register. We decided to pass. Our vibrating hand held device was handed to us. We got ALL the condiments and beer and headed to the courtyard/patio to pick out seats. The vibrating indicator went off within 10 minutes and we were in burger and fry heaven. The burgers are double patties so we split a fry. It was the best move. <br><br>Looking forward to my next trip to Chicago!!", "pics": null}}, {"review": {"des": "The fries & aioli from Small Cheval make me really happy!<br><br>Lately, this place has become my go-to for a quick, no-frills meal. Their menu is simple: just a hamburger, cheeseburger, fries, and shakes. Ketchup, mustard, mayo, and their famous garlic aioli are serve-yourself from dispensers. And pop is sold by the can from ice-filled chests.<br><br>Seating is simple too: a wooden wrap-around counter with picnic tables in the middle and outside. My fiancé describes the inside as \"overwhelming and crowded,\" and a friend described it as \"smoky\" (since it's all open to where they cook the food). But either way, I think it works, and honestly, I'm just here for the fries! They are super crispy and somehow unlike any fries I've had elsewhere. <br><br>Also to note: While Au Cheval does a hash brown bun, Small Cheval wraps burgers in lettuce to make them gluten free. Mine was super salty (maybe because of the cheese?) so I wasn't the world's biggest fan. But they're celiac-safe!", "pics": null}}, {"review": {"des": "Okay so I wanted to love this burger because everyone loves this burger! Let's start with all the positives because there are a few. The aesthetic is charming and laid back. The staff is warm and inviting and couldn't have been nicer. You can choose from a variety of sodas (pop), chocolate or vanilla milkshake, several beers, and a few cocktails as well. <br><br>The fries were delicious and while the burger was good is just wasn't amazing. I've been dreaming about this burger and it simply didn't live up to the hype for me.  <br><br>The wait was about twenty minutes which beats the hour plus wait at Au Cheval.  <br><br>While not a five star food experience I would stop in again if I was in the area. Good meal and great ambience and employees!", "pics": null}}, {"review": {"des": "One of the best burgers out there. The fries shakes and condiments are a step above average too. All that needs to be said.<br><br>If you want a good burger, quickly, come here. Patio area is nice too.", "pics": null}}, {"review": {"des": "A small joint, a short menu, and the little brother of Au Cheval- if you are craving simply a burger, this is your spot. A hamburger, cheeseburger, and fries are the only food options. Each burger is a double patty with the option of their house style combination, which includes dijonnaise, pickles, and onions. With a small menu, you know each burger is crafted very precisely and accurately. The golden fries perfectly compliment a juicy burger. Moreover, I personally believe these are one of better fries I have tasted with their crunchiness and softness. <br>Just as important, the condiments offered are Sir Kensington's organic ketchup and mustard (along with Heinz) and Garlic Aioli sauce (mmmmmmm so good on both burgers and fries).<br>I didn't get this, but they offer chocolate and vanilla shakes with the option to put a shot of whiskey, Baileys, and more for an extra cost. <br>Again, it is a very popular spot with not alot of seats, so there can be a  long line with not enough seats at peak times!<br><br>9/10", "pics": null}}, {"review": {"des": "Why anyone would rate Small Cheval below 5 stars is beyond me. Love the small/local feel. Food is always INCREDIBLE. Menu is small, simple, yet amazing. We ordered 2 cheese burgers (extra pickles), 2 fries, and a chocolate shake. Eating the fries with garlic aioli is part of the experience (and it's really really tasty!!).", "pics": null}}, {"review": {"des": "We've wanted to try Au Cheval and Small Cheval for a while now. Since they have consistently been rated as having the best burgers in Chicago, and we were nearby looking for somewhere to eat, this was a perfect time.<br><br>I have to say that Small Cheval is a dive. That's the only strike though. It is small, there is one large group table in the center and areas for seating along the windows. <br><br>You order at the counter. The menu is very limited. They have a not so fully stocked bar and offer some unusual mixed drinks. The burgers and fries did not take too long to prepare. The reputation of their burgers is well deserved. The meat was excellent and it was cooked perfectly. And so were the fries. While we only drank water, I'm sure their cocktails also would have met my expectations.<br><br>The cost was a little higher than I would have expected for counter service and I'm sure that when you go, you pay for their reputation. So, I can't say I will frequent Small Cheval but I will most certainly return.", "pics": null}}, {"review": {"des": "If you're going to try, go ALL IN! <br>A double or triple is necessary with cheese and bacon. <br>(A triple! I know.. you're like whaaat? <br>Just.<br>Trust.<br>With thin patties and immersed with cheese, it is a beautiful thing. Beeeaaaauuuuttttiiiiiffffffffffuuuuuul. Thang. <br>If it is bothering you that much, get some lettuce and tomato then. I always do.) <br><br>Get a burger with all the trimmings and a side of fries. If you're with your S.O or a friend, buy two fries. Sharing IS caring but in this case, enjoy yourselves. <br><br>Burgers are made as is. Condiments are found next to the counter where food is delivered. <br><br>Do you like your sauces hot? I do. Try this sauce combo. Wait.... a minute. While checking Instagram to remember the condiments offered I realized my go-to condiment recipe is already mentioned on the wall. My measuring differs however. It's Garlic aioli + Heinz ketchup + dashes of Crystal's hot sauce on top. I pump a lot of sauce because I shmear it on my burger and dip my fries into it too. <br><br>Sooooooooo gooooooooood.<br><br>Damn it.. now I want a burger..<br><br>The wait can be as obnoxious as the main location. And when it's warm & tourist season is underway, the normal slow times are now busy. If you like burgers.. just do it.", "pics": null}}, {"review": {"des": "The restaurant was very busy but the employees were friendly and service was quick. Burgers were great. Had Good side dishes and a full bar. More of a fast food restaurant, but did have a bar. I feel like overpriced . ( Cheeseburger, fries, beer and coke = $27)", "pics": null}}, {"review": {"des": "This was my first time trying Small Cheval, the spin-off, little sibling version of the Au Cheval burger (rated best burger in America). Even though the bun, patty, and bacon size are smaller than the original Au Cheval burger, this version is still big on taste. I will say it is the best fast casual burger you can get in Chicago hands down!<br><br>I love that the menu is literally three items (hamburger, cheeseburger, golden fries) so you know they craft each burger with TLC. Also the fries (not pictured) are ridiculously good. Do yourself a favor and dip them in the house made garlic aioli. You will thank me later.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XroZiQoNtivCSmTgbPKPww/348s.jpg", "caption": "Cheeseburger // Served house style : dijonnaise, pickles, and onions with added bacon."}]}}, {"review": {"des": "My friends and I came here hungry after hanging out at Royal Palms. Plus I've always wanted to come here. <br><br>The place is small with bar style seats inside. Outside, there are picnic tables, with bushes, lights, and umbrellas. You order at the counter and are given a pager. <br><br>I got a cheeseburger and fries. The cheeseburger has two seasoned, juicy patties with cheese and house sauce on a brioche bun. The fries were nice and crispy. Both were delicious. <br><br>Overall, my friends and I seemed to enjoy eating here and we liked the food.<br><br>Next time, I'll have to try their shakes!", "pics": null}}, {"review": {"des": "This restaurant has the absolute BEST burger I've ever had in my life. Looking forward to visiting their sister restaurant Au Cheval in the near future.", "pics": null}}, {"review": {"des": "I ate at Small Cheval with a friend of mine this weekend and it was a great casual spot. You order at a counter and receive a buzzer to then pick up your food. <br><br>I read you had to get the garlic aioli sauce with the fries, and it did not disappoint! The burger was very good as well. I normally eat my burgers plain but I loved the house sauce and pickles (I opted for no onions). I got a hard cider with my meal as well. Prices were very good for the city for a beverage, burger, and fries. <br><br>I'm not sure if the place is worth the hype but it was still very good! We sat outside, which was toasty as the weather was in the 90s but on a normal day it would have been lovely!", "pics": null}}, {"review": {"des": "I was helping a friend move from Chicago to North Carolina, and we stopped in here after doing some serious packing and preparing. I had been Au Cheval and enjoyed the crazy gourmet burgers there. Thus, I had high hopes for Small Cheval.<br><br>The experience didn't disappoint. The burger was juicy and delicious, and the fries cooked just the way I like them. I had a shake to complete my meal, and that was likewise perfectly mixed.<br><br>The only drawback to the location is that seating can be limited if it is busy. It was not terribly busy when we went, so we were able to find a spot to sit down. Otherwise, just get your food to go!", "pics": null}}, {"review": {"des": "The burgers are good here and the friends are delicious. They only offer 2 options on the menu or including fries (hamburger and cheese burger) which run around $8.95 and $9.95, respectively. You get double patties on your burger order and it is decently sized.<br><br>There are alcoholic beverages and spiked milk shakes available as well.", "pics": null}}, {"review": {"des": "Where do you go when the wait for Au Cheval is over 2-3 hours and you're still craving their juicy burger? Luckily, there's a smaller version. <br><br>I've tried getting into Au Cheval three times now and couldn't bare the wait. (4 hour wait during lunch time? Not today.) I've only heard amazing things about Au Cheval's egg bacon burger... as well as the wings, and the bacon. So you could believe I was relieved to discover there was a sister restaurant to this famed establishment. <br><br>Small Cheval is more of a grab and go service than sit down and be served. It's cute, definitely more spacious, and has an adorable urban outdoor seating area. We got there around 2pm on a Saturday and took about 15 minutes to order and get our food. The menu was super simple, which included a burger, cheese burger, fries, beer/liquor and shake, and additional add-ons. Above average price for a burger (I'm use to it though, living in New York), about $8-$12 for a burger especially with the add-ons. <br><br>I decided to order a standard Cheval Burger (pickles and special sauce) and a small order of fries. Let me tell ya, even though I've never had Au Cheval's actual burger, it was actually amazing. I loved how flavorful and charred the burger was. And the fries with garlic aioli...ugh. Stupid good. For a burger stand, it totally beat out my New York Shake Shack Burger.", "pics": null}}, {"review": {"des": "I recently checked out this sister restaurant of Au Cheval for the first time. I haven't been to Au Cheval yet as I just couldn't wait for 1.5 hours the two times I tried going there. I liked the location of the restaurant. It's away from the crowded wicker park area so that's good. The simplistic minimal outside decor looked nice at night in the dimly lit area. The restaurant's main menu is painted outside the restaurant on one of the walls. <br><br>When I went inside, it was packed and busy but not overwhelming that you couldn't find a seat unless you want with a group of three or more. It is a small dining room. The interior was dimly lit similar to mood lighting. You walk up to the counter where it says 'Order Here' to place your order. The menu is on a chalkboard next to the order taking counter person/ cashier. They have hamburger, cheeseburger, fries and couple of milkshakes (chocolate and vanilla). You can pick up a soft drink can from a fridge right before the cashier table. They also serve variety of beers and cocktails. <br><br>Everything is ala carte. No combos or pre-set pairings of food. I ordered a cheeseburger made house style (tomatoes, onions and dijonnaise), fries and a chocolate milkshake.. Other condiments like ketchup, mustard, ranch sauce, garlic aioli and hot sauce, if desired, are to be picked up at a different counter. They have an option of adding bacon for additional $2 as well. The burger is cooked one way (medium?) as they did not ask how I would like it done. That was fine by me. I received a buzzer device to alert me for when my food was ready. <br><br>My food came out shortly. The wait wasn't long. I grabbed a seat at the main shared dining table. I grabbed (non heinz) ketchup, mustard and the recommended garlic aioli. I skipped having Crystal hot sauce. With the first bite of the burger and I was in heaven. It was super delicious, tasty and flavor. The meat and cheese were the stars as they should be. Although, I did feel that the dijonnaise kinda overpowered the burger's actual taste and should be applied sparingly or skipped. But otherwise, the burger had a perfect taste. It hit the spot immediately. I wasn't even halfway done eating it and I was contemplating a second one. <br><br>The fries were lightly crispy on the outside and soft on the inside. I liked them. They tasted really good with the garlic aioli. The garlic aioli also even tasted good on the burger. The chocolate milkshake, although nothing special, was still nice. Just the right taste for my liking. Overall, I was quite satisfied. It's relative an expensive place but not as expensive as other popular/ well known burger joints. I like my gourmet burgers but this burger, although different in style and taste than those usual gourmet burgers, is in a class of its own. <br><br>It is good to have a place doing right the one thing they offer on their menu. I would go back here every chance I'd get. I'll eventually make it to Au Cheval someday and check out their real deal burger. If you haven't been here before than definitely check them out. It's worth it.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2xbl11GQxnDT6wZPrZMlEQ/168s.jpg", "caption": "My cheeseburger made house style with fries and chocolate milkshake and a side of garlic aioli. Pretty darn good taste of the burger."}]}}, {"review": {"des": "Great flavor but don't expect to get the same burger you get at Au Cheval. If the cost of the burger ($12 with bacon) were $8-$9 then I would definitely give Small Cheval 5 stars. It's a little pricey for what you get", "pics": null}}, {"review": {"des": "A burger to die for. Their garlic aoli is fantastic and their mix drink are deadly delicious", "pics": null}}, {"review": {"des": "Pretty cool little space. Very loud- looks like there is a quieter outdoor space but I'm guessing you can't  use it year round. Basically three items on the menu- hamburger, cheeseburger and French fries. They have alcohol. Was this the best burger I've ever had- no. Each burger has two patties so each one isn't very thick and I think they lack juiciness. But it will satisfy a burger craving. Part of their condiment line up includes garlic aioli and ranch dressing- both were good for dipping fries in.", "pics": null}}, {"review": {"des": "For my first time in Chicago, I had so many bookmarks!! But this is what I'll crave the most from my trip to the \"big bean\" ;p<br><br>Small Cheval is the sister restaurant to the original, Au Cheval, serving JUST burgers! Well, fries, tots, soda, and alki as well, but you're here for the burgers!! <br><br>Get in line to order, you'll get your drink (if you ordered one) and a buzzer to alert you when your order is ready. Find a seat and get ready to have your mouth wish it could taste such satisfaction all day errday! ;)<br><br>You only have two choices for burgers: hamburger or cheeseburger to which you may also add bacon! If they had an egg option, I would've added an over easy egg, but given my only option was bacon, I went with the fattiest route of a bacon cheeseburger. OHMAGERD~ Best \"simple\" burger I've ever had!! Darn thing had me foodgasm'ing like I hadn't eaten in days... Such hunger is usually reserved for other \"things\" so THIS is a special burger! Mmmmm. Hope y'all enjoy as much as I did!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wQO-UoOjmvNbRls0QMdtgg/348s.jpg", "caption": "Just do it. It's amaze!"}]}}, {"review": {"des": "Do you want a burger or cheeseburger? Bacon? Alright. <br><br>Beer, Malört, Aperol, Tequila, Whiskey, root beer, Dr. Pepper, Ginger Beer, Coca Cola? Okay. <br><br>Hover and grab a seat the moment one is vacated. Get some garlic aioli and ketchup. <br><br>Sit and enjoy. Perfection.", "pics": null}}, {"review": {"des": "A friend highly recommend we stop by while in Chicago. My husband & i were not disappointed and will definitely come back. We both had bacon cheese burgers with everything & we split a delicious Amaretto Chocolate Shake. <br>Fun atmosphere for all ages.", "pics": null}}, {"review": {"des": "The hype for Small Cheval is unreal but not warranted. <br><br>As someone who has been to the original numerous times, I was underwhelmed with the food here. I'd been meaning to go since it opened but I always refrained because I know I would be disappointed. <br><br>The burger wasn't as tasty and appetizing as the original. It was a decent burger, but nowhere near as good as the original. The fries were way too salty and the garlic aioli was equally disappointing. I actually just ate the fries plain because I grew tired of the aioli fast. <br><br>I suppose if you had never been to Au Cheval you would probably enjoy Small Cheval immensely. Unfortunately, I know what the original burger tastes like.<br><br>Additionally, the location is just too small for what they're trying to do. The line backs up out the building and blocks the trash. It's communal seating but there's no where enough seating for the amount of volume they do.", "pics": null}}, {"review": {"des": "Best burgers and only burgers. Of course fries and shakes and drinks!  Fun vibe and great burgers.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NzKdltH_56TSbPzynb9-Ew/348s.jpg", "caption": "This is the place to be !"}]}}, {"review": {"des": "Small Cheval often gets overshadowed by its big brother down on Randolph with the annoying wait lines and amazing fries. However, it still puts up a good fight and can really be a great alternative resulting in one delicious burger.<br><br>You've got a lot less of a line and more of a cafeteria type environment at Small Cheval. Wooden tables are lined up inside next to sauce dispensers for your fries. The menu here is drastically smaller than Au Cheval and for good reason- your focus is on the burger and fries, and nothing else.<br><br>I ordered a Cheeseburger with bacon tucked inside to get me some added juicy flavor. The burger came out just as good as the one I had in Au Cheval, albeit a bit saltier. Burger was simple but you'd be silly to not recognize the quality it has over other burgers around town. It was so hearty that I ended up saving half for dinner later.<br><br>With your fries, make sure you dip it in aioli because that made them absolutely delicious.<br><br>So Small Cheval- you've done good. I can recommend coming here to avoid the line if you're looking for a quick version of the Au Cheval classic.", "pics": null}}, {"review": {"des": "Ehh, Small Cheval for a non-Au-Cheval occasion. It's good enough. It's fine. No wait, no line. The food is quite good. Cheap? Nah. Over-priced? Nah. Exceptional? I couldn't say that in good faith.<br><br>In the end: wait for the real deal. Come here for impulsive repeat visits. No more, no less.", "pics": null}}, {"review": {"des": "Look no forward for a fast food burger. Located in the heart of Wicker Park, beautiful design and a burger to savor. To add to that they serve cocktails and beers! Get the fries on the side and pump that Garlic Aioli! <br><br>They can make you burger a double or triple for extra charge.", "pics": null}}, {"review": {"des": "Yes. Small Cheval is simplicity at its finest. The food menu consists of hamburger, cheeseburger, additional bacon, and fries. A menu like that means execution is key, and the team at Small Cheval is working perfectly.<br><br>Unlike the main Au Cheval, the bacon isn't the same thick cut, almost pork belly bacon. It's the crispy bacon that reminds you of breakfast. Aside from the bacon, the major difference is the restaurant itself. Small Cheval has a great outdoor patio and some communal seating inside the place. The long lines out the door don't mean that you'll be waiting 3 hours for a burger though! Because the menu is so simple, the line moves fast and the wait time between ordering and actual eating is short. <br><br>Definitely try out Small Cheval if you want a delicious burger. There is a bar available for beers and cocktails. They have some signature drinks like the Small Cheval Punch, which is nice and boozy (their employee's description, not mine but I agree). The shakes are wonderful too if you want to add something sweet to your already great meal.", "pics": null}}, {"review": {"des": "The burgers are on point! It reminds me of shake shack. I can understand why the menu is small. There's only three items. (Hamburger, cheeseburger and Golden fries). You don't need a big menu when you make something so good. <br><br>I like everything about this burger. The garlic aoili sauce is a plus for the fries. It's a pretty big burger so make sure you're hungry. There are two patties in the bother. This place can get packed.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MIRbMiwuAsR836VKBNEvBw/348s.jpg", "caption": "Exterior"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Wk3z9vA2Gzuxri4hEwephQ/168s.jpg", "caption": "Exterior"}]}}, {"review": {"des": "Best  Ever. <br><br>I'm surprised I haven't already written a review, as we have been here dozens of times. Small Cheval is one of two places I always recommend when someone asks me about a good burger. They have a straight forward, no frills, menu. Hamburger or Cheeseburger, Bacon or no, fries, soda can or shake. No stuffiness at all. <br><br>We've gone on days where the line was out the door, and days where there was no wait. So it's hit and miss, but either way it's worth going to regardless of the wait. It usually doesn't take very long to get our food either. Condiments include an amazing garlic aioli, two kinds of ketchup, and now they also have ranch (but I think it's just hidden valley). Indoor seating includes hall-style tables and counter seats, and outdoor seating has picnic tables with umbrellas.", "pics": null}}, {"review": {"des": "Let's squash this notion that Small Cheval is exactly Au Cheval. It's not. It's different, but that doesn't make it bad. The only thing is you can't compare the 2 or you'll just be disappointed.  <br><br>With all that being said, I really enjoyed Small Cheval.  Though the thin patties stacked together aren't really my forte (I prefer the large thick patties). Small Cheval did a good job of creating a unctuousness you their burger.  The flavors of the burger were clean and just beefy. The small parties retained the juices of the meat and provided a nice little crust.  I especially like the fact the burger held itself together. I find in many places that use small patties stacked up, the patties fall apart, and the burger just falls apart.  It just messy and and unappetizing.  Small Cheval though created a great burger that tasted fantastic and didn't fall apart. <br><br>I also wanted to mention the atmosphere at Small Cheval.  I loved it it was very mellow and laid back. There's a lot of room and the patio in the back created a warm relaxed atmosphere that is hard to find in the city. <br><br>To conclude, Small Cheval was a really good eat, and you should go get a burger a beer then chill at the patio while it's still not winter.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Pk8VT85L-l_tPJ-5_ZR4tw/348s.jpg", "caption": "Burger time"}]}}, {"review": {"des": "You really can't go wrong with any of the options here.  Especially considering how simple it is.  Burgers.  Shakes.  Fries.  Booze.  I usually do the burger with everything (inc. the optional lettuce/tomato) + bacon, with no cheese, just to later slather it in that sweet, sweet aoli, but to each their own.  I've never gotten alcohol here of any kind for some bizarre reason, but I imagine it's what you'd expect.<br><br>Also a great place to just grab a shake and go for a walk.  Doesn't hurt that Royal Palms opened up next door either.  What better way to work off a burger than the epitome of athleticism, shuffleboard? <br><br>(Answer: there is no better way)", "pics": null}}, {"review": {"des": "Classic, simple menu of burgers, fries, and shakes. One of the best surprises of this restaurant is you order a burger, or cheeseburger and you not only get one, but two patties! They are cooked on a flat top and taste absolutely delicious!<br><br>Fries are big enough to share, unless you're really hungry. Sodas are lined up above a cooler right before the counter where you order your burger(s), so don't forget to check out the selection and dig through the cooler to find it.", "pics": null}}, {"review": {"des": "I'll separate this into 3 categories in order of what I find most important going from least important to most important to me: <br><br>1) Toppings i.e. cheese, lettuce, tomato, pickle, sauce...I give the toppings a 4 out of 5 (dijonnaise was to heavy on dijon; out of balance)<br><br>2) Bread. This is ALMOST as important as #1...the bun was beautiful. Just looked like a proper brioche. And then I bit into it, and instantly remembered why I hate brioche buns for burgers. Too dense, requires a full mouth bite (top teeth touching bottom teeth) which cause the meat and cheese to shift out of place ANNOYING!. I give the bread a 2.5 out of 5. <br><br>3) MOST IMPORTANT.... Two properly well done patties, resulting in a texture that just crumbles in your mouth. Great beefy taste, clearly freshly ground chuck (80/20). My only regret is not getting a triple so that I could taste more of the meat...damn ! 5 out of 5 stars<br><br>FRIES: all I have to say is \"potato jerky\". 2.5 out of 5 stars <br><br>SHAKE: vanilla was phenomenal. 5 out of 5 stars", "pics": null}}, {"review": {"des": "Different ...<br><br>I've been here before and the experiences seemed different. Today the burger wasn't as tender and airy as I remember it being before. What I had today tasted more like a meatier cafeteria burger from CPS like maybe thirty years ago. It was still a good sandwich, service was good and the line was at the door which is good cause I've seen it worse.<br>I'll be back I have to make sure I get the regular taste.", "pics": null}}, {"review": {"des": "These are the best burgers i've ever had. What I love about Small Cheval is that they really don't attempt to be the \"burger bar\" styled burgers that are essentially just everything the kitchen layered in between two buns. Instead, Small Cheval's burgers focus back on mastering the basic of a burger: the bun, pattie, and cheese. And they don't fail.<br><br>It's hard to explain how you could be different from the typical \"cheeseburger\", but Small Cheval's burgers really are extraordinary. The bun is always the perfect firmness without being too dense or too fluffy. The patties have that nice grilled \"crust\" that keeps all the delicious flavors in. The cheese is melted just enough to stick to the patty without outshining the meat. The burger as a whole is wholesome. Additionally, the fries are always top notch. Crispy, golden, straight cut fries taken with some garlic aioli. Believe me when I say I would drink the aioli.<br><br>You MUST try Small Cheval if you come to Chicago. Avoid the burger bars and see how they really should be made!", "pics": null}}, {"review": {"des": "I dropped by here on my way home from the airport. At around 9:30 pm on Monday, it was pleasantly empty. The lady at the front desk taking orders was very friendly.<br><br>I had been to Au Cheval before. The burger here is basically the exact same burger (minus the egg option) but in a fast food fashion. <br><br>I like their burgers very much, but I also do not think they're the best burgers out there (see my review of Au Cheval). My belief that this place is a little hyped remains unchanged. <br><br>Nonetheless, the food/drink hit the spot for me. I had the cheeseburger plus bacon, the fries, and a cup of Founders. After a week of traveling, nothing screams \"Chicago!!\" in your ears like a good old American cheeseburger that you can get at Cheval. I sat outside in the patio enjoying the warm summer night, sipping my beer and munching on my fries/burger. I loved every moment of it. God bless Chicago, good to be back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/aZV3B23x9iUaJuyLSxErSg/348s.jpg", "caption": "Cheeseburger with bacon."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jzh5I85drPPtN5TNQrAZgA/168s.jpg", "caption": "The fries were above average."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NkWq8vRjZRSRnBjje2j32A/168s.jpg", "caption": "A minimalist menu. It's the right way to go for this place."}]}}, {"review": {"des": "There weren't many choices of burgers here, so I got the cheeseburger with a side of fries. It was very mediocre, tasted like a normal hamburger. The fries were tasty as they were piping hot when served, and there were some yummy sauces to accompany them. The meal was very expensive though at almost $15 post-tax for an average burger and fries. The portions weren't very big either, and I was surprised they gave me the food in to-go packs. The decor is pleasant but there aren't really any private tables as the seating is a bit like cafeteria seating.", "pics": null}}, {"review": {"des": "It was great that they had beer and shots at this location, but the french fries weren't cooked right.  I had a friend with me and he tried my fries and immediately told me that the fries I had were different than the ones he had that week.<br><br>I'll give this place another try because the restaurant group is so good at everything else.", "pics": null}}, {"review": {"des": "This is the place we take out of town people for a burger.  It's basic but delicious.  For those doing keto, they offer lettuce buns.  For those who cannot eat 2 patties (fools. also, this is me.), they offer single/kids burgers. Outdoor patio is pretty and a perfect setting to eat all the garlic aoli and sip on a boozy shake.", "pics": null}}, {"review": {"des": "Oh, that burger!  I mean, if you're going to hit up Small Cheval, you don't really have a ton of options... but why would you want any more options than that burger?  <br><br>Some wonderfully perfectly crispy fries on the side?  Yes please!  And maybe a shake?  Hmm, how about a spiked shake with a shot of whiskey or some other tequila?  Now you're talking!<br><br>Admittedly, I was a little disappointed to not be able to include a fried egg on my burger at Small Cheval to really make it an Au Cheval burger... but to be able to enjoy this awesomeness without the hour and a half wait, it's all good!<br><br>Burger from Small Cheval, you're my burger in shining armor... and I will be back to enjoy your greasy delicious goodness time and again!<br><br>*****FIVE STARS*****", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NkQz4cjL3NSjFqHirK1pvA/348s.jpg", "caption": "Oh, that beautiful sexy burger!"}]}}, {"review": {"des": "Alright so here's the scoop. If you're venturing here in replacement of the OG big papa Cheval with high expectations, lower them juuuuusttt a tad. <br><br>I suggested this location with a group of friends after our hearts were set on that of who shall not be named. To avoid over an hour to two and a half hour wait on a Sunday, we decided to try lil bro instead after much much word around town.<br><br>To reiterate, if you're looking for the similar to spot on version, it's not here. Although the style is similar with a double patty, the bacon(extra 2.00) is NOT pork belly and just all around a good/more decent burger. <br><br>Don't get me wrong, it was a great burger in a fast food style sit down location. Service was friendly and the price was still relatively high, but I am firm believer in getting what you pay for, and this meat, is quality all day. <br><br>If we must do comparisons I'll say it's a step below big bro and a step above Five Guys. It'll do the trick for a burger fixing and booshie budget when you just don't have 2 hours to wait at their counterpart. <br><br>My friends were impressed considering the nick of time we had. However, I kept getting the, \"it wasn't the same, it just wasn't the same.\" Okay, it's NOT the same. But can you honestly duplicate perfection? I digress. <br><br>Overall, if you're in a crunch of time, come here. If you have all day and no set plans, you already know which way to go.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eiMmKW7AKF9SY1k0nlbycA/168s.jpg", "caption": "Cheeseburger  House style"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iOopbNkkAVqY_spNusVuzA/168s.jpg", "caption": "Patio life"}]}}, {"review": {"des": "In the past year and a half, I have been here too many times to count. I just love it so much. It's a great place to take visitors from out of town who want to try Au Cheval, but don't want to spend the three hours waiting. <br><br>The menu is really simple (especially compared to Au Cheval). You can choose between a cheeseburger or hamburger, fries, and a vanilla or chocolate milkshake. They have some alcoholic beverages, as well. <br><br>I literally always order the same thing when I go - a burger house-style, fries, and a vanilla milkshake. SO GOOD. The burger has two patties and is decently sized. I always forget just how many fries they give you, so I'd suggest sharing with someone! The vanilla milkshake is a good combo between creamy and thick. <br><br>The best time to come here is in the warmer months when the patio is open. They have hanging lights with picnic benches out there that add to the upscale fast food feel. Indoors is pretty small. They have bar seating around the windows and then a huge table in the middle. Prepare to wait for seating on the weekends when they are busy. Even at 10PM on a Saturday night, they are popping!", "pics": null}}, {"review": {"des": "Looking for a much quicker, but fairly comparable experience to au cheval? Small Cheval totally does the trick. They have a pretty decent sized restaurant and large patio with tons of seating. The big picnic tables and cute tea-lights make for the perfect outdoor Chicago eating experience in the summer. <br><br>The wait staff was super efficient and kind. The menu is extremely limited, but honestly I think they would be doing themselves a disfavor if they were to make it any larger. It's perfect for what they're doing here. The food was simply delicious! Though I did miss having the egg option available. <br><br>I had the cheeseburger with bacon, house style and fries. Obviously added on some garlic aioli to both, and had a fantastic dining experience overall.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0KUiQJ33tfz7ez8BykcfGw/168s.jpg", "caption": "Bacon cheeseburger house style with fries"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-p0ziwckHGO5B9MJXgLVaw/168s.jpg", "caption": "Bacon cheeseburger house style"}]}}, {"review": {"des": "This place is good and pretty straight forward. Went for a run to check out the 606 and walked over for my constellation prize with friends. I'm so glad we came and none of us felt guilty about the goodness we consumed.", "pics": null}}, {"review": {"des": "It is burger like almost every other burger in town. Place is super cute with patio and line is huge but goes really quick. Yes I expected more for almost 40$ ( two cheeseburgers, two fries, two sodas). For me, it is just ok. Burger is not huge, is normal size. Tasty but then again nothing special. Fries is large so you can share. Cute place if you are near and want to meet some friends. Oh and fries have some seasoning on it.", "pics": null}}, {"review": {"des": "No frills burgers, fries, and shakes visiting you in your dreams to tantalize your dreamy tastebuds. Slather on that cheese and onion delight and dip those crispy taters in garlic aioli to apply the food goose bumps down your forearms. Don't forget bacon. Why would you do that? You wouldn't forget bacon. Kicking it at a wooden slab of a family style table with ground meat fiending strangers completes the scene. There's nothing small about it.", "pics": null}}, {"review": {"des": "Loved this place! Service was great, there's a cute area for communal sitting. Food was AMAZING!", "pics": null}}, {"review": {"des": "Oh we will make this our spot every time we come to Chicago!  <br><br>The burgers are just perfect goodness", "pics": null}}, {"review": {"des": "I haven't been to Au Cheval, but this was one of the best burgers I've had. It takes a little while for the line to move, but there's plenty of space out back for seating. They have a cool selection of beers, shakes, etc.<br><br>It's all about the Cheeseburger cheeseburger.", "pics": null}}, {"review": {"des": "I usually try to portion-control my meals but I couldn't help myself in this case...I wanted seconds. The burgers were perfectly prepared. My mouth is watering just thinking about it. Can't go wrong with a bacon, double patty cheeseburger. And their fries are double fried so they have the perfect soft center and super crispy outside. To go on, they also make their own garlic aioli dip for the fries. Wish I was able to pack some of that to bring back to CA!", "pics": null}}, {"review": {"des": "I'm probably going to get some flak for this review, but I really don't get the hype about this place. Take this with a grain of salt, because I had the same feeling about the Au Cheval burger, but the burger here is only slightly better than average, but nothing to write home about.<br><br>To me the burger tasted greasy, which wasn't helped by the mayo heavy sauce. The meat was good, as was the cheese, but overall, no real flavors to talk about.<br><br>The fries are good - no argument there, but overall I can't really recommend waiting in line for this burger. But then again, hundreds of other review tell me I might be crazy, so give it a try for yourself. See if it lives up to the hype!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/12RB5QKd06dBNGTHc908aA/348s.jpg", "caption": "Cheese burger, chocolate shake, and fries."}]}}, {"review": {"des": "Went yesterday aug 20,2018 for lunch with my daughter, we never been and as soon as we got out the car you could smell delicious in the air.<br><br>I got her a single patty cheese burger and I had the regular double patty cheeseburger with bacon mmmnnn<br><br>We split the fries<br><br>As Samuel Jackson said \"that's a tasty burger", "pics": null}}, {"review": {"des": "A diamond in the rough. Doesn't look good from the outside. But once you get inside you can see the nostalgia of the place. Only serve hamburgers and cheeseburgers. And oh boy are these burgers tasty. Get the fries and use there custom ketchup and garlic aoli sauce. I've been here 2x in a week and I'm not usually a burger person. Plenty of outdoor seats and seating inside is a big square table with bar stools. Serve a few different kinds of beer and at the checkout counter you can get a shot. Place is my new favorite place to go in Chicago!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/S82w8Jb5mKN38HuaZ5Yz8g/348s.jpg", "caption": "Cheeseburger. Yummmmmy"}]}}, {"review": {"des": "Absolutely incredible burgers at a decent price.  Small place so it can get very crowded at popular times but they pump out the food pretty quickly and you never have to wait for too long - even with lines commonly out the door.  The fries are a little boring but the \"melt in your mouth\" burgers more than steal the show and make the trip down to this fun shack worthwhile every time.", "pics": null}}, {"review": {"des": "If you want a burger, cheeseburger, fries, shake, or a beer - and nothing else (since that's the entire menu - truly those 5 items), look no further than Small Cheval. It's a small joint with limited indoor seating, but a great outdoor patio (that can also become crowded). This Bucktown favorite brings the famous Au Cheval burgers up to this neck of the woods, which is a delight. There's almost always a line out the door (to order your food), but it moves so you're not waiting too long. This line even happens in winter, which shows how good the food is. Don't forget to get the condiments on the side near where you pick up food. Their ketchup and garlic aioli is delicious. <br><br>Aside from the line and limited indoor (and sometimes limited outdoor) seating given how popular they are and how good the weather is, my only complaint is that the quality of food as diminished slightly since it opened. When Small Cheval first opened, it was probably the best burger I've ever had - or definitely top three (as I've eaten many burgers in my day). Since then, sometimes the patties are a little overcooked and not as incredibly flavorful as the first bunch of times we went - but I'll still take it.", "pics": null}}, {"review": {"des": "Never got to try Au Cheval (due to long lines, but will attempt to at some point) so this review won't be a comparison between the two.<br><br>I knew this place was popular so I wasn't at all surprised with the $10 cheeseburger--it came out pretty tasty, but I don't know if it was really worth $10. I liked the chewy bun of the burger though!<br><br>There was a nice patio area for people to share tables and eat under cute lights, with the cta train passing every now and then. The line also moves really efficiently so I wouldn't stress if you see a lot of people trailing out of the restaurant. Overall, the burgers are good and worth a try, but it's lil overhyped.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/w-WrLoNsbV5QcpK5oSymYQ/348s.jpg", "caption": "Cheeseburger!"}]}}, {"review": {"des": "Very small place to eat but great hamburgers. You can order anything on the menu as long as it's a hamburger, cheeseburger or fries. Don't come in here looking for anything else that's OK that's what they do and they do it well. Not much to say other than the hamburgers are very tasty. Patties  are cooked to medium unless you specify otherwise.  The French fries were crispy. They serve a lot of drinks but because I went  to lunch I was not able to partake in any alcoholic beverages.", "pics": null}}, {"review": {"des": "Was taken here by a friend who lives nearby, who claimed they had a great burger and possibly even better atmosphere. The line extended well out the door, which is always a good sign. After a short wait - maybe 10 or 15 minutes, our orders were taken. The cashier was super friendly and personable, and recommended the garlic aioli for the French fries.<br><br>The burger was fantastic, fitting perfectly on the buttered and lightly toasted brioche bun. A double patty burger, cooked perfectly and perfectly juicy. The fries were crispy, perfectly seasoned. A friend claimed they were too salty but honestly I disagree, there is nothing sadder than an underseasoned potato. <br><br>The aioli and the special ketchup were both delicious with the fries. I didn't have one, but they seem to have quite a selection of beers on tap. Just another point in their favor.<br><br>In addition, the patio was spacious and quite effectively tucked away from the street - didn't feel like you were on a heavily trafficked thoroughfare.<br><br>I say 5 stars.", "pics": null}}, {"review": {"des": "Awesome burger joint! It's a simple concept: order at the counter by choosing a burger ($8.95) or cheeseburger($9.95), side of fries ($2.95), chocolate or vanilla milkshake ($3.95- with or without whipped cream), and beer or cocktail (around $7.00). Then grab an open seat on a barstool along the perimeter or a giant table on the middle. A buzzer rings then you pick up your order on a tray. The hype is real! The double patty burgers are delicious and the shakes are filling. During peak hours, you'll stand or sit shoulder to shoulder with other diners, but the turnover is pretty quick so you won't have to wait for a terribly long time. Indoor dining during the winter is not very convenient for families with young kids or strollers, but you might have better luck in the summer when the outdoor patio and picnic tables open. Loved every bite and will be back many more times!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/exutb7kyBgB9c6yq34AYbw/348s.jpg", "caption": "Cheeseburger, fries, chocolate shake. Total happiness."}]}}, {"review": {"des": "The double-patty cheeseburgers and fries with garlic aioli are so good here, Small Cheval had this CA native questioning her loyalties towards In 'n' Out.", "pics": null}}, {"review": {"des": "A solid burger, better than most.  I'm usually not a double patty sort of gal, but it works here.  I feel like buns are always overlooked, but this place picked a great one that holds everything together well.  And the best part of this place....the GARLIC AIOLI.  It is everything!  Their fries are great but the aioli just kicks everything up 20 notches.   I could dip my shoe in it and have it taste magnificent.", "pics": null}}, {"review": {"des": "You know a place must be good if there's a line forming out the door. I went during dinner time on a Saturday night (in the summer too!) so it was super busy. <br><br>Small Cheval is in a prime location with ample outdoor seating. I loved seeing all the babies and doggos hanging out together with their parents outside. <br><br>It's so clean for how many people go in and out-- good job on keeping keeping the condiment area looking like it's nobody's business. With a bajillion people pumping that garlic aioli dispenser every other minute, I really have to commend Small Cheval for being on top of it. <br><br>Service was pretty good too. I appreciate any eatery that can keep their cool and treat everyone with respect through all the craziness.<br><br>I have to admit though... my burger was only delicious because of the condiments I slathered onto it. If you look at my pictures, the hamburger looks verrrrrry plain. I got it with all the complimentary toppings but still *shrug shrug.* I am convinced the only reason why this burger was so delicious was because of the garlic aioli and ketchup. <br><br>ALSO, this is NOTHING like the Au Cheval burger!!! Do not come here for that! It's far less decadent, and much more plain. It kind of reminded me of a very naked In N Out?? Like it could've been In N Out but it couldn't.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MpnP-08aYbzylTWf13ywFA/348s.jpg", "caption": "But looks super plain. Don't worry I doused it with condiments."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8FKZOVkX-E2WOPqVdRMEOw/168s.jpg", "caption": "Hamburger with everything on it"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AlkRPg0I2vN7NhKKW9ipwQ/168s.jpg", "caption": "Small menu, makes it super easy to order"}]}}, {"review": {"des": "When I'm craving a burger, Small Cheval is exactly what I want.  I order a cheeseburger (add bacon) with all the house toppings, fries, and a chocolate shake (no whipped cream). Everything is the best version of itself. I love the simplicity of the menu, and the staff is friendly and informative. Sometimes I dine in, and sometimes I take them to go. They're great both ways.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/I5ElUinSyqEfdm9peDIgjA/348s.jpg", "caption": "Here's what I like to order."}]}}, {"review": {"des": "This place was delicious!!! I had a cheese burger and added lettuce and tomatoes and got a milk shake on the side!!!! The burger was one of the tastiest burgers I've had in a while. I decided to skip out on the fries but I'm sure they're delicious. The line was long so if you plan on coming here especially during lunch hours make sure you give yourself enough time. I highly recommend this place.", "pics": null}}, {"review": {"des": "Ehhh.... there was a long line and I thought this place would be excellent. I read the reviews and expected this burgee joint to be something special. To be honest, the burger actually was really good, the shake wasn't bad (it wasn't really good either) and the fries were subpar. I rarely leave my fries but I couldn't finish them. I thought they were flavorless and dry, not even the ketchup added much flavor to them. The service was great, the food came out quick, they really have a good system to handle their long lines. I'm glad I tried this place, I'd be surprised if I went back.", "pics": null}}, {"review": {"des": "Truly the best burger I've ever had in my life. So juicy! <br>If you don't want to wait probably 4 hours to get the burger from Au Cheval, come here!! <br>They also have boozy milkshakes that goes perfect with the burger and fries!! <br>Love coming here in the summer time!", "pics": null}}, {"review": {"des": "Apple is the largest company on the planet with a market cap in excess of 800 billion dollars, yet everything they manufacture can basically fit on your dining room table. While Small Cheval is not quite there yet in terms of Apple's size, everything they produce can basically fit on a cafeteria tray. <br><br>So what else do these two great behemoths have in common... Focus, Quality, Service and Execution. With their limited menu they can deliver great products consistently and the seamless service and Execution necessary to ensure a solid customer experience.  Also, Both companies also have cool accessories (e.g. Shots at Small Cheval) and stay true to who and what they are. <br><br>Oh BTW, did I mention they make a great burger with delicious house cured bacon, solid fries and a killer chocolate shake!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ki2bOMmSjkFHVtZO8RvdoQ/348s.jpg", "caption": "This is what they do and the do it better than just about anyone in their class."}]}}]}