{"name": "smoke-daddy-chicago", "reviews": [{"review": {"des": "Verdict: good food and decent prices<br><br>Atmosphere / decor - 4<br>Service - 3.5<br>Food - 4<br>Value - 4<br><br>Overall 4<br><br>I went here with my bf on a Tuesday night ($7 nachos with two meats!). They had a lot of outdoor seating, which looked like it might have heaters in cooler weather. Service for us was meh but I saw other tables getting good service so I'll give the benefit of the doubt. <br>We sat on the patio until it started raining when we were graciously given space inside.<br><br>They have a good cocktail menu and beer menu but there were no descriptions on the beer menu so we had to look everything up. <br><br>We got pulled pork and brisket nachos which came covered in bbq sauce and chili. They also come with cheese normally. I thought they were tasty, although I'm not a fan of chili on nachos but the bf loved the addition. <br><br>For the main event we got pulled chicken and burnt ends with St. Louis style ribs, all of which was delicious. The fries and coleslaw were on par as well. I will definitely be back!", "pics": null}}, {"review": {"des": "This place was just \"meh\". I would never go back to it and would suggest my friends to go to Chicago Q or Bub City or Green street Meats for BBQ instead. <br>This was the first place where I ordered mac and cheese and did not want to finish the entire bowl. It wasn't good. <br>The sliders weren't anything to really talk about either. <br>The service was okay and the waitress was nice. <br>The live music was way too loud on one side of the bar so we were happy we were at least able to sit further away from the noise. All in all, this place is just over hyped.", "pics": null}}, {"review": {"des": "I had been craving a pulled chicken sandwich so I thought I would give this place a try. What I liked about the restaurant in general was the fact that it was open until 11pm. Anyway I ordered a pulled chicken sandwich with a side of Mac and cheese. They also had 6$ cheeseburgers with a side that was the Wednesday night special. The server came around with the food. It smelled great, looked great. I tasted the mac and cheese first, nothing special. It was to cakey and thick. Needless to say I didn't finish it. The sandwich was ok, It was filled with an abundance of chicken. I tried all the bbq sauces with it. I enjoyed the mustard bbq sauce and the sweet one too. Overall, the food was ok. <br>The server was cool and friendly. The ambiance of the restaurant is cool, hip, with a little hint of a country feel to it. It looked like a band had just got done playing when I arrived.<br>I wouldn't come back for the food. But I would definitely stop by here and have a beer.", "pics": null}}, {"review": {"des": "One of the best  BBQ Joints I have been to in a long time. We arrived and was seated right away.  We ordered the \"Big City Eats\" with the baby back and St. Louis Style, Pulled pork, brisket, chicken with coleslaw and cornbread and smoked pit beans. It was $49 bucks and there was a ton of food. My  favorite by far is the brisket and coleslaw. Don't get it twisted though, all of it was really good. The brisket was juicy and you can really taste the smoke. Our servers were really nice and the decor of the place is real BBQ smoke house-eque. There was a musician playing on a little platform the night we went. Pricing was decent for the amount of food we got. They have a fully stocked bar.  Parking is street parking from what I can remember. Really easy to get to.  Overall, it was a good meal for some city BBQ.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KPCcwS-IOfI6gF2LrLXdbA/168s.jpg", "caption": "$49 bucks for all this. Yumm!"}]}}, {"review": {"des": "FATHER KNOWS BEST<br><br>If there's one thing dads can appreciate, it's tasty barbecue.<br><br>Following a really underwhelming Elite event at the International Museum of Surgical Science (about as exciting as it sounds), my +1 and I made a stop for late dinner, desperate for food.  I'd driven by -- and heard plenty about -- Smoke Daddy in the past, so I suggested ribs to Nichole C, who eagerly agreed.<br><br>We sat outside on 10/2/18 and got a couple pints of Abita Purple Haze ($6).  Their nachos are discounted to $7 on Tuesdays (normally $12) with your choice of meat.  We got pulled pork, and although they were tasty I saw no jalapeños?!?  What blasphemy is this!?!<br><br>Unsatisfied with mere nachos, we placed an order for the chicken & ribs ($22), included with two sides.  The chicken was juicy and had some kind of Jamaican jerk spicy rub on it, very good.  I thought the mac 'n' cheese was decent (NC loved it), but the smoked pit beans were fantastic.<br><br>That brings us to the ribs.......holy pope on a rope, that sh*t was outstanding.  Given our choice of preparation (baby back, rip tips, etc), we opted for the St Louis style.  An incredible, peppery BBQ sauce highlighted meat that literally fell off the bone and had me licking my fingers in delight.<br><br>Bread = 4.5<br>Circuses = 4.5<br><br>To cap things off, we got a terrific banana pudding ($6) for dessert.  Garnished with vanilla wafers and precisely the fresh flavor I'd hoped for, I could tell it was homemade.  On a future visit I'll be sure to try their key lime pie!<br><br>Service was fairly attentive and the bathrooms were brilliantly clean (at least the men's was).  Their outdoor area couldn't be nicer, and the heaters ensure that you'll stay warm during chilly autumn evenings.  Impressive array of high-def TV's, too.<br><br>* TL;DR *<br><br>Come for the ribs, stay for the heated outdoor patio (and that 'naner pudding, god damn!)  I'm very happy we stopped in and look forward to returning again, possibly to sample their burnt ends.  Smoke Daddy knows what's up!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zyDrW5AOV8K5Q2p7BhPMAg/348s.jpg", "caption": "Granny's banana pudding ($6) is an amazing dessert. Garnished with vanilla wafers and brown sugar!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/37fliuX7TD_Fc35cnRCIyg/168s.jpg", "caption": "Nachos with your choice of meat (normally $12, but only $7 on Tuesdays!)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/U3oxIf03B4nOTkAr95f2Fg/168s.jpg", "caption": "Chicken & St Louis style ribs ($22), choice of two sides. Mac n cheese = good, smoked pit beans = GREAT!"}]}}, {"review": {"des": "Smoke Daddy's ribs are very delicious, leaving your mouthwatering for more of that tender, juicy barbecue meat. They also make some solid chicken wings as well!<br><br>My partner and I met a couple of friends here on a Thursday evening to celebrate their dog's birthday. While the the outdoor patio tables are fairly small for the giant rack of ribs they serve, it is great that Smoke Daddy has plenty of outdoor seating. My friends and I started our dinner with some smoked bbq chicken wings appetizer. The wings were surprisingly very tasty and flavorful. <br><br>For the main course, everyone at the table ordered some sort of rib dish, getting a sample of the two rib styles: St. Louis and Baby Back. Both were very good. The sauce and overall flavor on the ribs were excellent. The meat cooked was cooked okay but could have been a bit better; the meat was juicy and tender but not quite falling off the bone. Also, there were three extra sauces that were available to try at the table. The sauces were decent but nothing really stood out. My partner and I enjoyed both the mac and cheese very much. The sweet potato fries were solid. The overall servings for each platter was more than enough food for one person.<br><br>Smoke Daddy is one of the better barbecue places I've tried in the Chicago. They have great service and excellent outdoor seating. The food is also very savory and delicious. Despite limited sauces, the barbecue is worth, in both price and quantity, and general environment merits more visits to come in the near future.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jW2M-i3QszKibHBWv75GJA/348s.jpg", "caption": "Baby back ribs with sweet potato fries and mac n cheese."}]}}, {"review": {"des": "So many great places to eat on Division and The Smoke Daddy delivers on the BBQ. When I popped in over the weekend, they had a great acoustic artist strumming covers of 80s hits. Loved that they had live music going!<br><br>My friend and I copped a seat on the patio and chilled out on the sunny 80 degree Sunday afternoon. Our server was so incredibly friendly and seemed really happy to be working. That is always a sign to me that a place must treat their people really well & I appreciate that. They had a very sessionable FFF IPA on tap that I had with my meal for $7. Again, perfect for the warm summer day. They have TVs even out on the patio, as well, so you sports feins should be satisfied!<br><br>For my main meal, I went with the Burnt Ends sandwich and a side of Mac & Cheese for $11. Incredibly filling, great burnt ends, alright mac & cheese. My friend had the Smoked Platter for $17 and was disappointed in the thin brisket, not-on-the-bone chicken, baked beans which was more like chili with burnt ends in it and an order of fries which had no potatoes longer than an inch. So, we had some hits & some misses in our meal overall. <br><br>I really did enjoy the atmosphere of Smoke Daddy plus they have daily specials! So even with the missed, I'll be back to try more on the menu. However, I just don't see myself getting any of the same items I did this last time. Except that great IPA!", "pics": null}}, {"review": {"des": "I have been a fan of Smoke Daddy since my first visit in 2012. They have the best and meatiest rib tips I have ever had! Today I ordered the half order of Rib Tips with Collards and Coleslaw. (The best coleslaw ever! I don't usually like slaw) I also ordered the Nachos with Smoked Chicken and Chili. The only reason I rated Smoke Daddy a 4 instead of a 5 is because the collards were undercooked. (Nothing that steaming in chicken broth can't cure) Other than that everything was awesome.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/AGwCOsVDNKV6OFhwQ2cHAA/348s.jpg", "caption": "Their sauces"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sIY3yJCn30YJnUruU9T_HA/168s.jpg", "caption": "Smoked Chicken Nachos with their beef and Italian Sausage chili on the side"}]}}, {"review": {"des": "Haha, well the last time I ate here was when I was in Wicker Park for a Renegade Craft Fair, and my friends and I just did the same thing this week-end. Seems like we had about the same experience: decent food but \"ehh\" service. <br><br>We were there at brunch time when the menu has a number of unusual offerings, but I just went for the pulled pork sandwich and sweet potato fries, which were pretty standard as BBQ go. My friends seemed to enjoy their meals of burnt ends and \"The Daddy-O\" sandwich (sliced brisket, smoked provolone, onion rings).<br><br>Our waitress was a little scattered: she introduced herself to us by dumping a tray of full water glasses right at our feet (gladly we were sitting on the patio), then later assured us she could split the check but brought it to us intact. Sigh. <br><br>It was nice to sit on the patio on a mild day; the restaurant inside is pretty small, and has probably the darkest ladies' room I have ever experienced. <br><br>Overall, the next time I'm here for Renegade I'll probably try someplace else for lunch.", "pics": null}}, {"review": {"des": "The veggie burger I got was pretty tasty and filling. Tasted much better with BBQ sauce slabbed on it though. My side choice? The cornbread and it was kind of bland. This place gets only three stars because of the service. <br><br>I get it: Lunch rush on a Saturday can get hectic. The hostess that seated us seemed annoyed when my friend asked for a booth (since there were 3 of them open) so not sure what the problem was. Curse my observant eye! The waitress we had wasn't attentive with us. We also weren't being served water throughout our meal. <br><br>Everyone's experience is different! My lasting impression here is that if you like dogs, then you'll be dog watching during your entire meal when it's nice out. Otherwise, nothing left to say.", "pics": null}}, {"review": {"des": "Solid BBQ spot in Wicker Park. I've tried the smoked meat platter and the Daddy-O and both were pretty tasty and offered a decent amount of food (you might not finish depending on how hungry you are). The sweet potato fries have a hint of cinnamon and make for a great side. The mac n cheese is also delicious!<br><br>Plenty of seating, really friendly service, kind of expensive prices, overall a good experience!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0XcPuunMD7tUnvZdRj40mw/348s.jpg", "caption": "Daddy-O Sandwich"}]}}, {"review": {"des": "INEDIBLE candied meat sold as ribs.<br>So sweet.<br>Baked beans, soaked in sugar.<br>Collard green fine.<br><br>Ordered a full rib and took half with me hoping i'd see a homeless who may enjoy it. Did not see anyone. Ended up putting it in a trash bin finally.<br><br>I assume their other meats would be better as they do not have the maxed out glazing of the rib eye. But this was my third time there and i do not remember ever being impressed.<br><br>Could not wait to get home and brush my teeth.<br><br>Service by Alanna was pleasant, professional and attentive, hence two stars instead of one.", "pics": null}}, {"review": {"des": "Love me some Smoke Daddy. I'm more a spare rib guy than back ribs. The wife and I usually split the rib sampler. It's plenty of food for 2 hungry people. The brisket is one of the tastiest around. They have a solid selection of beer, wine, and booze. <br><br>The weekend brunch is truly special. Monkey bread is ooey gooey, sweet, buttery bliss served with a main dish, like brisket benedict. Wow, just wow. Add some juice or a boozy beverage to your meal, and you have one of the best spots in the city. <br><br>A few years ago, they expanded their seating, indoor and outdoor, which was a welcome respite to the long waits that we suffered through. <br><br>Overall, great spot, food, and service. I've been coming here for over 10 years.", "pics": null}}, {"review": {"des": "Love the combo dish with all different types of ribs and they have a great beer selection ! Great place<br>To go and see some live music and people do enjoy dancing here :)", "pics": null}}, {"review": {"des": "Wednesday is $6 burger night. What are you waiting for? Come grab one of these awesome burgers and enjoy the outdoor patio. Cheers!", "pics": null}}, {"review": {"des": "I almost lost my mind in this place because of all the food options, but my friend and I decided that we would try the sampler platter and order a few more sides and that was the best choice that we could have ever made. I was skeptical at first because I thought since the place was so nice the food couldn't be as good but they surprised me. I also appreciate the fact that the drinks were relatively inexpensive so of course I had to buy two Adult Cherry Cokes. I will be back, that is for sure.", "pics": null}}, {"review": {"des": "Lives up to the hype!<br><br>Man there is no place I would rather be than smoke Daddy for Sunday brunch during the NFL season. <br><br>The vibe is like your cool uncle's garage. Cold beer, great Bloody Mary, some of the best bbq in town and TVs with the games on every where. During halftime there is live music up front and the service is top notch.<br><br>Cheers", "pics": null}}, {"review": {"des": "Some friends and I stopped by Smoke Daddy one late night after a concert in Wrigleyville and was pleasantly surprised! The ambiance was awesome. There was a live band covering many popular songs, and they were pretty good. We walked right in and were immediately seated at the bar. Our server was so very sweet and attentive. She helped make the night. The menu is not huge, but there was plenty to choose from. I opted for the cheeseburger (I know - who goes for bbq and orders a burger) and hubby ordered the half rib slab. Everything came out delicious! The ribs were great, tender and seasoned well. We also were surprised at how tasty the sweet potato fries and mac and cheese were! This place definitely exceeded my expectations and I wouldn't hesitate to stop in again if I'm ever in the area.", "pics": null}}, {"review": {"des": "Ohhh, first time here and we will definitely be back. My ribs were tender and off the bone cooked.  Service was great and a very comfortable atmosphere.", "pics": null}}, {"review": {"des": "BBQ pulled pork nachos were pretty good. TONS of food. Should have split it with someone. It was layers of chips, meat, a meat and bean chili, cheese, onion, cilantro, and pico. Maybe a little too much bean chili... but good spice. The Moscow mule I had was good, but not super strong. <br><br>Service was okay. The live music was great.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Wehd81xfZu_UJELVCqQMTg/348s.jpg", "caption": "BBQ pulled pork nachos. SOO much FOOD!"}]}}, {"review": {"des": "I came here last week for the Three Floyd's tap takeover and Pig Roast. I didn't have the pig roast, but I have had their pulled pork sandwich before and I think it's pretty decent. I am a huge BBQ fan as my Dad and I smoke our own and I have had a lot of BBQ in my life. Smoke Daddy is no where near the best BBQ I have had, but it is average. I did have the hush puppies and I thought they were very good. They weren't your normal hush puppies as these were massive and they had pimento cheese, which made them super rich and green chile jam on the side. I would rate the food a 3.5. I will have to try some other menu items in the future to get a more accurate rating. <br><br>The service and drinks is where it makes up for it. The servers are chill and attentive as they come back and check on you quite a bit. Shout out to Ben Kitchen!!! My beer was never empty as I was trying to ride the rail. I was close with 7 out of 10 beers, but no cigar. This WAS a Thursday night and I HAD work the next day. I didn't have any cocktails that night. But I have had their Bloody Mary and Mule Daddy and I really enjoyed both of them. So I would rate service and the place as a bar a 4.5. <br><br>Overall, this is a solid place to unwind with good company, decent food, and good drinks.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/83p7y2R2NgGcvamF3AneGQ/348s.jpg", "caption": "Hush Puppies"}]}}, {"review": {"des": "Great bbq and fun atmosphere.  They have live music which is always a plus.  Skip the cocktails and go for a local beer or cider.  The baby back ribs were super tender and the collard greens were the best I've had!  End your meal with a cookie skillet- obviously!  Great place!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5XZkKVaeV4GzMXumOiUPFg/168s.jpg", "caption": "Half slab of baby backs with fries and collards"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZSxyw21kpNF2zg5Ulb2qjQ/168s.jpg", "caption": "Cookie skillet- yummmmm"}]}}, {"review": {"des": "I think the ambiance and nice staff is what saves this experience. <br><br>We got smoked wings and shared a full slab of bb ribs. Both were suprisingly dry and tough. The sauces we're good but still couldn't save them from being disappointing. <br><br>For the price Ill probably choose other spots in the future.", "pics": null}}, {"review": {"des": "The BBQ was really good at Smoke Daddy, everyone continued to rave about this spot, so we finally checked it out.  The main restaurant is small but there is outdoor seating in front and side extension. <br><br>We ordered a sampler with baby back ribs, brisket, and burnt ends. Also started with hush puppies.  Everything was really good. The ribs were excellent, meat falling off the bone.  They have three types of BBQ sauce on the tables, I liked all three flavors. <br><br>I would recommend this restaurant to friends.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IfNoK5MPJGzSWVCnFwzEWA/348s.jpg", "caption": "The line-up..."}]}}, {"review": {"des": "I had the same catered lunch as the person below and found the food to be quite exceptional. Smoke Daddy is one of the best BBQ joints in Chicago and is my personal favorite. <br><br>I used to live right by this place and would visit frequently to enjoy their brisket, chicken & of course- their mac'n'cheese. The cornbread is always amazing and always has the perfect amount of butter in it.  As a matter of a fact- I even enjoyed seconds today. <br><br>In conclusion- Smoke Daddy is the best BBQ joint in town. Keep doing your thing!", "pics": null}}, {"review": {"des": "I always get the brisquette sandwich. It's amazing. The coleslaw is one if the best, if not THE best, I've had. One of the best in Chicago for sure.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YXpqqjx2m__m70PZ_PfMNg/168s.jpg", "caption": "I love this sauce."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-PluR2RDl0MH9HBJgvR_Ow/168s.jpg", "caption": "I ate it all! Soooooo good!"}]}}, {"review": {"des": "Really neat place with live music, dog friendly patio and always a good place to watch a game on TV. Food is very good and reasonably priced. For a BBQ joint, they do an amazing salad- The Wrightwood- with their in house smoked chicken. <br>Service is friendly and neighborly and take out is always easy! <br>Home made sauces are also delish! A staple in our house!", "pics": null}}, {"review": {"des": "Get the most amazing fricken bloody mary at this restaurant. Great vibe inside the restaurant and they have live music sometimes and that makes being in the restaurant very enjoyable. HIGHLY recommend the nachos", "pics": null}}, {"review": {"des": "I've been coming to Smoke Daddy for a long time now with my family and friends and i've got to say, this may be one of my favorite BBQ joints in the city. They're consistently hitting the mark and when I say that they're generous with their portions I do mean they are GENEROUS.<br><br>My most recent visit we were immediately greeted and seated by an awesome hostess, Laura. She made sure that we got to our table quickly and was able to accommodate our large party even tho it was very short notice. Our service was spectacular, thanks to Maureen who was running around making sure our table got everything we needed. Always friendly, always accommodating, their staff really makes Smoke Daddy one of my favorites in the city!<br><br>Now the food. If you're just ready to pig out on some BBQ with some tasty sides, there is absolutely no better place than Smoke Daddy. All of their platters are stock piled with delicious, flavorful meat. My favorite has always been their rib tips and brisket. Their sides are also always fantastic: get the mac n cheese! You will be in heaven.<br><br>If you're ever around make sure you stop by. Truly a great place near Wicker Park!", "pics": null}}, {"review": {"des": "Great BBQ place! <br>There's a lot of good so think about that when ordering. The taste of daddy sampler was definitely enough for 2 to share comfortably. We also had the chicken combo with St. Louis style, collard greens, Mac n cheese and fries. All were pretty good. Fries were a bit salty. Greens were garlicky, not over cooked and just amazing. <br>I had daddy's house salad which was so good! An amazing blend of apples, blue cheese, walnuts and greens and a delicious vinegarette. Definitely enough for a full meal! I totally recommend that!", "pics": null}}, {"review": {"des": "In an area saturated with other restaurants and places to eat, this was an underwhelming experience. We had poor service, and food took over an hour to be served, even though we watched other tables seated after us get served their meals and drink refills. I am also a vegetarian, and was served meat in the nachos, after explicitly asking what was in the nachos and the meat chili was omitted from the server's response. Skip this place.", "pics": null}}, {"review": {"des": "This is a review of Smoke Daddy's catering business. My wife and I recently catered our wedding and they were our saviors. A few reasons why you should use Smoke Daddy to cater your wedding: 1) Their prices are so reasonable - they are one of the few catering operations who don't jack up wedding catering prices to obscene levels. 2) The food is outstanding. We had so many guests tell us they wish they'd served BBQ at their wedding rather than a half frozen piece of chicken or tasteless filet. 3) They are a one-stop-shop who can sub-contract out all of your tables, linens, plates, bar, service staff, etc.. needs. They are practically like your wedding planner. 4) Helena is incredibly accommodating and responsive and has a bias to solve problems rather than create them. You won't regret this!", "pics": null}}, {"review": {"des": "I ordered Smoke Daddy delivery from Postmates and the food was terrible.  Poor quality meat that was flavorless & mostly fat. The Mac n cheese was like noodles in thick wax. I didn't even eat most of the meal b/c it was disgusting. They wrap the cornbread in wax paper so it became a wet, soggy piece of bread from the heat/condensation. The only thing that was good were the beans. Don't waste your money here.", "pics": null}}, {"review": {"des": "They have live country music and hush puppies, the real question is why wouldn't you come here? But seriously though, get the hush puppies they're some of the best in the city.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tCkWsWxep6ufpBQYE-swkw/168s.jpg", "caption": "Live country music? Sign me up"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UGxIZnK1w1YWbVCPdCWDSw/168s.jpg", "caption": "Hushhhhh puppies"}]}}, {"review": {"des": "My first experience ordering from here was really disappointing. The collard greens were just mildly blanched, unseasoned and served with a lemon wedge that only discolored them. The grilled chicken wasn't bad but it could have been more flavorful. I was unhappy with my food, I wouldn't recommend it.", "pics": null}}, {"review": {"des": "I was excited to come here but was disappointed.  But let me start off with the positive - we were seated right away I like the booths how they are up high so we can look directly at waitress rather then looking up at her, the decor was fun this place is family friendly...so we placed our order my husband had full slab ribs with baked potato, he enjoyed his meal wiped that plate clean -I ordered rib tips with greens and mac n cheese- buuut my tips were huge chunks wasn't expecting that and dug in...not good the meat was hard and dry my greens were not cooked soft they were tough and the Mac n cheese was bland and the noodles were soggy....THE CORNBREAD  was really good I ordered 4 to go.  I am going to go back and order full slab ribs next time since my husband liked his so much.", "pics": null}}, {"review": {"des": "Always happy with everything this place has to offer! I'm from Stlouis and the ribs compare to some of my favorite spots!", "pics": null}}, {"review": {"des": "Service was great. Good bbq. Nothing really mind-blowing but everything was good. Wouldn't mind going back if I'm in the area. The wings were good, and we also had the big daddy plate with sides of macaroni & cheese and corn bread.", "pics": null}}, {"review": {"des": "Very good this time my tip was so tender. The greens were extra good with the lemon omg then I had the sweet potatoes fries which was good.", "pics": null}}, {"review": {"des": "1 Star for smoked chicken wings 1 Star for the key lime pie the rest was dreadful. I went here with a bunch of fellow hungover 40'somethings. It was not good. The problem was the meat, which at a barbecue place is important. It was as if they pulled it off of the animal and slapped it on the grill. The sauces were horrible as well. Over sugary and under flavored. Even the Carolina which I never eat was flavorless. The other sides were fine but what you expect eating out! The waitress was great. An attentive Australian young woman who interacted well with the table and divided the checks easily.  It's just the MEAT SUCKED. And I don't pay people to make food that I would not eat if I made it at home.  <br><br>So after this initial review the owner contacted me and gave me a gift card to give them another shot. While I don't do this trying to get free food. Frankly I am shocked that they think the review is that important. But I am always appreciative that they care enough to try to make it right.  This was true here. Full disclosure whenever this happens I always order different dishes in order to get a greater idea of the menu.  This time I had the brisket sandwich and fries, a sour beer from Oberon. The brisket was solid Smokey and good. The fries were good as well but it is hard to ruin fries. For desert I had the cookie in a skillet with ice cream. Delicious!! I know that when a rib restaurant has amazing dessert it means that the supplier has great top shelf desserts but I still darn near licked the plate lol! So after further review this place has earned an extra star from me because of service and commitment to satisfying the customer.", "pics": null}}, {"review": {"des": "I came to Smoke Daddy and was able to sample a little bit of everything at a Crown Royale partnership event they were doing. My god, if the brisket isn't the most tender, juicy, fatty, succulent, unctuous piece of meat I have ever put in my mouth. I think I could marry this piece of brisket (sorry husband)! Seriously though, the brisket is a must-try. I can't explain how many times I've had a dried out burnt piece of stringy brisket. You won't find that here. We also had a chopped salad which was delicious and filled with a soft cheese and vinaigrette ! In addition, their cast iron corn bread is to die for--- so pillowy soft and buttery and crumbly like how it should be! I also tried their pulled pork and chicken, while moist and great in their own right, the brisket stood out. In the tableside there is different BBQ sauces to try, including honey bbq sauce in a little plastic bear jar- so cute! I like their outdoor patio where you can sit and watch drunk people from Wrigley and people watch.", "pics": null}}, {"review": {"des": "What am I missing here? Maybe I caught them on a bad night, but this was a really disappointing and over-priced meal. <br><br>I ordered the brisket and shredded pork combo with fries and macaroni and cheese. (Pretty pricey, too...$17) The brisket was decent--it was tender and had a nice smokey flavor to it. But it was 50% fat. The sauce also tasted more like chili sauce than BBQ sauce. The shredded pork was also doused in a different kind of sauce that was also overly-tomato-based. It was incredibly salty, too. I only ate a couple bites of it. Shame, because the meat was tender, and it was a decent portion, but totally inedible on account of the sauce and salt. Fries were really good--nice shoe string fries and a good portion. Macaroni and cheese....where do I begin? Well-cooked pasta and good portion, but again, another really off flavor profile. I think they overdid it on the nutmeg, but it almost had a ginger-y flavor to it--also very heavy-handed on the salt. I was not a fan. I wanted to like it given the positive reviews, but not at all impressed with the BBQ.<br><br>Banana pudding was good, though! Not overly-sweet, nice fresh bananas and a good texture.", "pics": null}}, {"review": {"des": "I've loved this place for a long time but after today my opinion has changed. I let the server know right away I have some food allergies, and asked for a substitution. She completely blew me off even though the substitution I wanted is cheaper than the regular item so it wasn't like I was asking for a free upgrade. I used to be a server and you make any effort you can to help a customer with a food allergy request if you want to be good at your job. I also was without a drink a majority of the meal and didn't even have water or anything to drink for 30 minutes. I will say, the food was good but this review is for the terrible, insensitive service I received today. The menu even says they care about food allergies, well clearly you don't. Not sure if I'll be coming here again.<br><br>Edit: management blew me off when I explained my issue. They acted concerned about it but didn't do anything to rectify the situation. I'll find bbq elsewhere in the city.", "pics": null}}, {"review": {"des": "Some of the best barbecue I've ever had hands-down... Definitely give it a try!!<br><br>I had to smoked chicken and my wife has the smoke brisket and pork combo plate... Truly amazing, the flavor was spot on and the meat was absolutely delicious!!", "pics": null}}, {"review": {"des": "Just left your bbq place and I must say it was not good at all. The bbq sauce was nasty you should allow people to put their on sauce on the food you have it at the table. The only reason I gave you 2 star is for the nachos and the cornbread those item was ok.", "pics": null}}, {"review": {"des": "staff is suave. Beans are THE BOMB!. Tuesday's nacho and Wednesday's burger specials are great deals. Catering comes out very good too, maybe better than any most Chicago bbq.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/23R3qLFXiiyZHKigIrVccg/348s.jpg", "caption": "Burger special is worth a weekly stop. Wednesday's."}]}}, {"review": {"des": "first time. It was good but not as good as told. Had three meat combo. Ribs were over cooked. Tinder but over cooked. Brisket was very good, great smoke flavor, chicken was pulled. I was not s fan of any pulled chicken. Beer was great. Rated over experience ad middle of the pack. I preferred Fat Willys and Twin Anchors", "pics": null}}, {"review": {"des": "In the interest of full disclosure, I'm going to preface this review by admitting that I am a Memphis native. I will readily admit that this sets my expectations higher than a lot of people, so please take my words with that in mind: I am a BBQ snob. It is in my blood. It's my birthright.<br><br>I will also state that my review is based off a catered lunch at my workplace, and not a dine-in experience. Perhaps that would be different. Perhaps not. It's hard to say.<br><br>Now, that said, my first clue that this was not so great was that the pulled pork was swimming in sauce. Covered in it. Smothered in it. This is generally a sign that the pork is subpar if you have to serve it pre-sauced. It's the sort of trick you find in chain restaurants to add flavor to otherwise bland meat and it turns what should be tender and smoky into a greasy blob.<br><br>Beneath the sauce - which I found to be a singular note of tang with no spice or sweetness to balance it - were chunks of fat and pork which, while moist, had little taste of its own. It was distinctly disappointing. I've had better pulled pork from a school cafeteria. If properly slow-smoked, a pork butt or shoulder will usually have the fat melt into the meat, imparting flavor and moisture without leaving behind blobs of it.<br><br>My dad, who used to tend the smoker all day on weekends in our backyard, is probably rolling in his grave over this travesty.<br><br>And then there's the matter of the collard greens, the likes of which my Memaw would have rewarded with the most wilting of her disapproving looks. Proper southern-style collard greens are cooked long and low with bacon, fatback, or a hamhock. That meat is an important part of imparting flavor into the typically bitter vegetable - the fat lends a silky mouthfeel, and the cure gives them a delicious salty umami. These greens have neither. They are flavorless, and even my beloved Crystal or Mamie's chow-chow would not be able to salvage the taste. Plus, on top of this, they are nowhere near cooked long enough. They are tough and stringy, while greens are meant to be slippery and almost falling apart and melting in your mouth.<br><br>The only redeeming parts of the meal were the mac and cheese - which, while a little strange in texture, at least had some good flavor - and the BBQ chicken (but then it's chicken, and I had dark meat, and it's kind of hard to screw that up).<br><br>On the bright side, I managed to learn where to avoid when I'm craving BBQ, and I wasn't the one paying for it, so that's a plus, I guess. For now, I will continue searching for somewhere local that'll live up to my expectations so I don't have to drive back to my hometown for a taste of the real thing.", "pics": null}}, {"review": {"des": "Was super excited to find a BBQ place within walking distance to our new home. This place is pretty cool, a nice big outside patio, a bar eating area, and a separate private dining area; All with awesome open window views. This is a cool vibey place with a nice BBQ style. We ordered the BBQ chicken and ribs with collard greens, mac and cheese, and corn bread. The meat and greens were soooooo good. Like something straight outta the true south. The mac and cheese was good but nothing special and the corn bread was salted without warning and I was hoping for some honey butter but, that didn't happen :(. I wish they had a spicy option for BBQ sauce as I am a hot sauce lover, but their Original sauce was good with a kick of its own flavor. The drinks here were okay, maybe a little soft for quality liquor. I have also ordered from SDs with uber eats and the food was just as in restaurant, fast delivery, and still hot. Will continue to come, until we find a more true BBQ place with more good options for sides.", "pics": null}}, {"review": {"des": "They've made some updates to their brunch menu.  I like the idea of the unlimited offerings to go with the main dish (Monkey Bread, Bacon, Sausage, Pancakes, Fruit) for $19 and the mimossas.  The main dishes changed... Last time I had some fantastic French Toast, but that's gone as is the Blueberry Corn Bread which was really really good... bring it back pleeeeease.", "pics": null}}, {"review": {"des": "The ribs are not good at all, anyone who says they are is either lying or doesn't know what good ribs taste like.", "pics": null}}, {"review": {"des": "Great BBQ, decent prices, killer patio.<br><br>This is a great neighborhood BBQ joint. I am from Memphis and can be a little picky about BBQ restaurants, but this one does a pretty good job of diverse menu options without impacting the quality of the classics.<br><br>LOVED the brisket sandwich (the bread was incredible). They have a mustard-based cole slaw that was very refreshing, and the cornbread was delicious.<br><br>If you have enough room, the BBQ nachos are a great choice for appetizer, and if you're feeling boozy at brunch their bloody Mary comes with a mini bottle beer back, so cute!<br><br>Can sometimes be a bit of a wait on the weekend, but there's tons of seating inside, service is fast and attentive, and when it's warm the patio is great for sunning and drinking and people watching. Great stop on Division!", "pics": null}}, {"review": {"des": "I've been coming here for years - I am not sure why it's taken me so long to write a review. The first time I came here was on a date forever ago and the date was eh but the drinks were pretty good!<br><br>Ever since I moved around the corner one month ago, I've come here a bunch - I think 2 brunches, and two lunches in one month. The brunch is solid but my fave item is on the lunch menu - the Wrightwood Salad. Wow. The cornbread croutons are freaking out of this world. I would eat a plate of those. I also like the outdoor area and that you can bring your dog. I came here with two dogs the other day and did some work on their free wifi and ate a salad. It was a great place to relax. <br><br>I'm only docking one star because I reserve 5 star reviews for places that really knock it out of the park and while I do love this place, it's a solid 4 star place.", "pics": null}}, {"review": {"des": "We had this food catered for a photoshoot meal a couple weeks back. Man, great barbeque! Admittedly BBQ is not my first choice of food because it's typically heavy. But this kept me wanting more. We tried:<br>- BBQ beans (not usually a fan but these were the perfect balance of sweet and savory with plentiful chunks of brisket)<br>-  The pulled chicken and pork were flavorful, moist and tender, loved the balanced smoke taste they left me with<br>Even the coleslaw was delicious - crunchy yet sweet.", "pics": null}}, {"review": {"des": "Came back for lunch today, had the pulled pork sandwich with a side of beans. Delicious.<br>The beans tasted like they had chorizo in them", "pics": null}}, {"review": {"des": "I highly recommend throwing a private party here!!! My mom had an engagement party for my fiancé and me on Saturday night and it could not have gone any better. The food and the service was amazing. Our friends and family were super excited about the location and the atmosphere. Many had been to Smoke Daddy when it first opened and told me it's their favorite BBQ place. And, finally, the band was terrific! We also had goodie bags filled with Bloody Mary mix, BBQ sauce, hat and cozy. So much fun!", "pics": null}}, {"review": {"des": "Fantastic BBQ. The hash brown are phenomenal. Crispy exterior with a gooey interior, it like it was made in some magical kitchen. The pulled pork benedict is simply phenomenal. A mixture of everything good in life in a plate. <br><br>The food was so good, it inspired me to take a job blocks away from the restaurant.", "pics": null}}, {"review": {"des": "We stopped there for brunch after going to renegade-art fair, we were seated right away and only waited a few minutes. Our waitress named Eva gave us a very friendly welcome and was very polite. The food was great as usual, we ordered the bottomless bloody Mary's the brunch special, the brunch special ended at 2 and it was 2:30 and we wanted another round of bloody Mary's, when we asked her she said that it was after 2 but she'll see what she can do and she definitely came through for us with 2 bloody Mary's, thank you again for a great time , the hospitality was great and we definitely will be back there again soon.", "pics": null}}, {"review": {"des": "I know this is a popular place, and I've been twice but both times the experience has been disappointing. The service is always good, and they have a nice beer selection - however the food is below average. If you look for real good BBQ food, in my humble opinion this is not it. The BBQ sauces are kind of weird tasting, and the meat feels more like \"Applebee's\" than a BBQ joint.<br><br>I could go without eating here again.", "pics": null}}, {"review": {"des": "One of the only places in town that is pet friendly and we love barbecue, so we thought we would give it a try. Staff and service were great!  However, we ordered the wings and ribs.  Wings were ok, but the ribs were a little tough and there was way too much Cumin we were guessing.  ..left for quite and aftertaste.  We could tell that it was also present in the wings as well, but not as potent though.  I have lived in Lincoln Park most of my life and I am giving these new places on Division a shot, but this one may be tough to come back to.", "pics": null}}, {"review": {"des": "I ordered takeout so I can't say much about the restaurant itself; the server was nice however. I ordered the small rib tip order and I was surprised how much did came with. I'm used to smalller chopped tips because these were huge chucks of meat. Nonetheless it was flavorful and fell right of the bone. The Mac and cheese wasn't too bad. I took one star off because of the collard greens. Very little flavor... And there was a lemon in the greens. A lemon?!! Put some smoked meat and seasoning on these greens okay? Lol", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BMnqDYQEOtffcvS6kFY-BA/168s.jpg", "caption": "A lemon. A lemon in collard greens. Well I've never..."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/y7I2cd7k5PjoTuAS_llUvQ/168s.jpg", "caption": "Huge rib \"tips\""}]}}, {"review": {"des": "Quickest service, most delicious BBQ sauce and excellent customer service! The atmosphere was amazing, you can actually see the meat cooking if you sit in the inner side where the bar is. We went there as a recommendation from a friend and I am glad we did.", "pics": null}}, {"review": {"des": "Great beautiful place! I just ordered mac and cheese in the side and for my sandwich will be KC Style burnt ends and it was so good. After that, the cocktail drinks are so super good and I cannot wait to try it.", "pics": null}}, {"review": {"des": "Server made only ONE daddy reference although it was sly and well delivered, after serving our bbq (which was tasty) she asked; \"how does daddy taste?\" And we told her that daddy did NOT disappoint. We loved the food and the beer was cheap. Daddy treated us very well and I cannot wait to taste him again!!", "pics": null}}, {"review": {"des": "We had a wonderful breakfast/brunch meal here on a Sunday morning and it was quite delicious. My sister and her husband both had bloody mary beverages (a house specialty it appears) and they were delicious. I had another breakfast beverage and it was also good. We split the housemade monkey bread to start- it was just as wonderful as I remembered from my childhood. I also had the pulled pork benedict which I thought was quite tasty, though the fruit was not my favorite part (I would go with the potatoes next time). The service was excellent & I really enjoyed the restaurant space itself. It appears they have a great outdoor seating section for during nice weather (though that was not open when we were there in December). I would definitely come back to try other items on the menu in the future.", "pics": null}}, {"review": {"des": "Smoke Daddy has a great, outdoorsy layout. I went here on a summer afternoon and really liked the atmosphere. <br><br>The food however is quite below par. We ordered a platter and none of the things on it tastes too great. Come here for a drink or two but not on an empty stomach", "pics": null}}, {"review": {"des": "Came to check out the Family Brunch . All you can eat monkey bread ,pancakes, hash browns , fresh fruit ; bacon , sausage and you pick your entree.  Also bottomless mimosas...The monkey bread here is everything.. not to sweet and  very buttery.  I don't eat hash browns but here the hash browns are Service is excellent and food is hot.  They have a new customer . My friend and I enjoyed ourselves.", "pics": null}}, {"review": {"des": "I went to the Wicker Park location on a Sunday evening. It was very nice, open, and pleasant. I had the $27 meat sampler, brisket,  baby back ribs,  bbq chicken,  Mac and cheese, beans, and cornbread. God bless the cornbread! It was AMAZING and I am from Texas, so we are some cornbread eating people. The brisket was awesome. The ribs were good but slightly over cooked. I didn't care for the bbq chicken. The mac and cheese was good but could've been hotter in temp. The beans were great but again, not hot enough in temp.", "pics": null}}, {"review": {"des": "Ordered the Taste of Daddy to share between me and a friend. You get a choice of ribs, two meats, and two sides. We got the baby back ribs, brisket, hot links, mac n cheese, and hand cut fries. This all totaled out to be a little more than 26 dollars. <br><br>I started off with the mac n cheese. Drenched in the creamy, milky cheese it was absolutely delicious.  Next came the ribs, which were smoked well but didn't exactly slide off the bone. It took a little more gnawing than I would have liked. They were saucy enough that you didn't have to add more, but if you'd like I would suggest the sweet and smokey. The fries were shoe string cut and weren't that great.  I would say a tad too crispy and over salted.We noticed a lot of people getting sweet potato fries, which actually looked a lot more appetizing. Hot links were actually just a hot link cut in half, but so flavorful, had just enough kick. The brisket was good but nothing above the average. <br><br>I don't know about the ambiance inside, but outside at there patio there are four TVs going and it was nice and lively. The waitresses were all super friendly and patient. It is a tad squishy with so many tables and chairs that a handful of people bumped into our table.", "pics": null}}, {"review": {"des": "I am upset. Smoke Daddy used to have excellent BBQ sauces, but something changed. Their sauces are bland and boring. I did not like the Original, Sweet & Smoky nor Mustard Q versions. The mac n cheese had a weird flavor and was bland. The collard greens were awful and tasted like it had been boiled in hot water. No flavor or seasoning whatsoever. The only tasty items were our Bloody Mary's. We skipped dessert on purpose. Service was excellent though and their staff is friendly. However I am disappointed because I love Remington's which is owned by the same 4 Star Restaurants Group and expected the same high quality food. This is unacceptable.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/j8C7uuRw84reIEIPmptUxQ/168s.jpg", "caption": "The only highlight of the meal"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jNt7nh27RRp6TqCUn-DssA/168s.jpg", "caption": "Do not order collard greens"}]}}, {"review": {"des": "Nice but better for a twenty something on a date. Decent BBQ, but not a fan of the sauce, liked the live music. Might try again", "pics": null}}, {"review": {"des": "This place was good 5 years ago, not sure what happened but the food isn't very good anymore. Not much effort or care is being put into making good BBQ. Lots of better places to go. I won't be back.", "pics": null}}, {"review": {"des": "Smoke Daddy's is a staple in Wicker Park for BBQ. And their biggest asset is that they don't have much competition. No one on the block is known for barbecue so if that's what you're craving, this is where you go.<br><br>I don't have anything bad to say about the place. But I also don't have anything exciting to say about it either. It's just there. It satisfies that barbecue craving, but also doesn't leave you blown away or wanting to come back the next day. It's like having a plain M&M when what you were really hoping for was a peanut M&M.<br><br>Also, if you're seated right where they play live music, don't expect to have a conversation with anyone at your table.", "pics": null}}, {"review": {"des": "I crave this place all the time. We always do pick up when we go,which doesn't take long to get. The jalapeño beer cheese is mouth watering,and they serve my favorite ribs in Chicago hands down. The smoke aroma will seriously be on your clothes for the rest of the day,which is totally a good thing! All the sides are good. Chicken and ribs platter is classic,baked beans great,rib tips two thumbs up. Love love love!", "pics": null}}, {"review": {"des": "Delicious bloody Mary comes with bacon wrapped brisket. <br><br>Ample seating indoors and out with great service.<br><br>The cheese fritters are essentially fried cheese that melt in your mouth accompanied by pepper jam. Very tasty and unique. Heavy app!<br><br>Split the brisket/tip sandwich. Bun could be more hardy. Meat is cooked to perfection. They smother it in their signature sauce but my favorite is their mustard one. <br><br>The mac and cheese as a side is thick and genuinely cheesy.<br><br>Great bbq in the city, would come again.", "pics": null}}, {"review": {"des": "My first time trying this place and it was good. I had burnt ends and brisket and cornbread and slaw. Now I must admit I'm not a slaw person but I have had some good before but there's is not..lacked flavor and kinda tasted watered down. The burnt ends and cornbread were by far the best for Chicago. The food took a long time but the waitress was very attentive and nice!", "pics": null}}, {"review": {"des": "Such great food! They had a live band playing during our visit which I absolutely love. The burnt ends sandwich with Mac and cheese AND a couple PBRs was a delicious dinner.<br><br>Great patio area although we went when the weather started to cool down. Definitely planning to come b", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jAZa6YrrZ8HliivQzzvy3Q/348s.jpg", "caption": "Burnt ends and Mac n cheese!"}]}}, {"review": {"des": "SmokeDaddy is my favorite spot in the city,<br>They have a new guy booking the music there & they are getting some really good bands there.<br>In addition they have added a county/roots music to Thursday <br>Hoyle Bro's, Dan Whitaker & the Shinebenders, How about <br>Bailey Dee!<br>The weekend continues with Blues from Billy Flynn, Chicago Bound,<br>Dave Spector, Blue Coast; Andrew & Night Men, Mary Lane: man more.<br>Last night Mojo 49 played their first gig there, a very good band,<br>Let's hope we see more of them.<br>This is a great restaurant, Great People,ribs& music,<br>Kudos to the music schedule,", "pics": null}}, {"review": {"des": "We ordered Smoke Daddy catering for our wedding, and were very happy with the decision! They arrived slightly ahead of our scheduled delivery (which was great!), helped set everything up, came prepared with more than enough plates and silverware, and we had plenty of food for our guests, who raved about the dishes! Our order included ribs, pulled chicken, pulled pork, coleslaw, mac and cheese, beans and salad, as well as buns and several sauces, and we feel we got a fantastic deal that easily fed 20+ people (not to mention having leftovers for days).<br><br>If we have another event, I would definitely hire Smoke Daddy! We've also had good experiences dining-in, and will absolutely be back.", "pics": null}}, {"review": {"des": "finally try it<br>i when there whit my kids my son is picky so i order the  roast chicken fries and  corn bread that was a lot so we took the rest to go<br>my daughter order the st louis ribs ,mac cheese and collard greens boy these collard greens was bland and huge no bite  sizes !!!!!<br>well i order the ribs, brisket , hot link and coleslaw and some beans was  a lot of food we take left over for dinner  tomorrow<br> 2 drinks no refills  the server never came back they don't  fill my  water neider <br>one  bloddy mary and key lime pay $93 .00 <br>plus tip<br>key lime pay server said is homemade <br>ewww taste terrible<br>hasta la vista smoke daddy", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fW6W_f2JbT_gRMStr4UK_Q/168s.jpg", "caption": "key lime pay just the crust taste good lots butter"}]}}, {"review": {"des": "WILL NEVER EVER EVER COME BACK, OR RECOMMEND THIS PLACE. <br>Absolutely the worst BBQ food I have ever ate! Horrible. <br><br>A friend and I decided to try the BBQ from smoke daddy, so we ordered to go and picked it up. <br><br>The locations is a nice, and the service is ok. But the food is absolutely horrible, and over priced. <br><br>We ended up trying the BBQ platter. We had the pulled pork, burned ends, and brisket. Absolutely no flavor what so ever in any of the options we got. <br>The meat tasted boiled in water. UNACCEPTABLE! <br><br>No flavor, small portions, over priced. <br>I will never come back. <br>Defiantly isn't work it. <br><br>So many other places that are cheaper and have way better BBQ food! OTHER PLACES THAT HAVE ACTUAL BBQ, not boiled tasteless meat.", "pics": null}}, {"review": {"des": "My boyfriend and I went on a date for our first time here on a search to find a good BBQ place in the city. A glance at the menu and the fact that they have live music was enough to make us check it out. The first thing I noticed was the attached outside area. Even though it was not warm enough for us to be seated there, it already looked like a place I would like to go back to in the summer. The inside reminded me of the BBQ joints in Nashville, TN. A shot gun layout and old/modern country mash up decor made this restaurant really unique. <br><br>The service was great and our waitress was quick and attentive. We started out with the smoked jalapeño beer cheese. A semi small portion but a perfect size for a starter cheese. Very smooth with a good flavor and a kick of spice. For our main course my boyfriend ordered the \"Taste of the Daddy\" which is a choice of ribs, 2 smoked meats and comes with 2 sides (he got ribs with pulled pork and burnt ends with cornbread and coleslaw). A great spread of BBQ for the price. I ordered the pulled chicken sandwich with the mac and cheese as my side. The meats were tender and juicy with deep smoke flavor. My mac and cheese was creamy, had the perfect amount of salt and seasoning and had a great breadcrumb topping. I'm usually not a fan of coleslaw... but after trying it off my boyfriend's plate I ended up putting it on top of my chicken, delicious. <br><br>The meal was filling and the live music made the whole experience that much more enjoyable. It wasn't exactly mind blowing food... but definitely worth returning to.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aJaTY_Lc-Vq3E2BQXWkgAw/348s.jpg", "caption": "ribs with pulled pork, burnt ends, corn bread and coleslaw.  Pulled chicken sandwich with pickles and mac and cheese."}]}}, {"review": {"des": "Had been here over the summer and ate outside and really enjoyed it. We came back after Christmas. Really wanted to like it! The inside of the restaurant was great, great beer selection, wait staff were awesome. Our Nachos were fine (not great) for an appetizer.<br><br>The name is \"Smoke Daddy\" but their meats were just not smokey or good. I ordered the Brisket and was disappointed. Not sure what wood they used or where they smoked this, but I got no smoke flavor and way too much of what was on my plate was fat. To me, brisket should be great with no sauce but without the sauce, there was no taste. I understand that Brisket has a lot of fat, but usually it gets trimmed off and not served. This was about half meat and half fat.<br><br>Burnt Ends were good, as was the pulled pork.Those that had the Wrightwood salad were happy. <br><br>I really wanted to like this, but I can only give it 2 stars. Smoque has way better food!", "pics": null}}, {"review": {"des": "This space landed on our radar at the right time, the 4th of July, when folks were looking for a BBQ fix. I was able to find something as a vegetarian (that veggie burger was pretty tasty). The service was wonderful, and even though the waiter warned that the kitchen was backed up, the food came quickly and the server checked in on us frequently. Fun, low-key vibe in Wicker Park where we were able to relax, watch some sports, and enjoy each other's company!", "pics": null}}, {"review": {"des": "The chicken was pretty good. But the rib tips, brisket and pulled pork were just mediocre. My drink the hurricane daddy was great. The greens were also not good at all. The mac n chz was decent, very rich. I may go again and try the ribs but not likely. I also want crazy about their bbq sauces either, too much vinegar for me. The burgers are better from my experience years ago.", "pics": null}}, {"review": {"des": "BBQ ribs heaven. Had the rib sampler and the meat was cooked to perfection. Great music playing and a fantastic vibe. Great local beers and nice staff.", "pics": null}}, {"review": {"des": "When planning a visit to Memphis, TN, you'll want to see what the fuss is all about at Graceland. You'll want to catch a glimpse of the ducks in the Peabody Hotel lobby. You'll want to take a stroll down Beale Street and indulge in a diver from Silky's or check out some blues music at one of the countless venues. For most locals, paying a cover charge to walk down a street or searching aimlessly for street parking to see a duck splash in a fountain for three minutes is not on their list of things to do today. But one thing local and tourist alike CAN agree on is that Memphis barbecue (known for the rest of this review as BBQ) is amazing. Well, dear reader, I'm from Memphis and have spent 63% of my life eating BBQ, trying new BBQ restaurants and challenging to duels anyone who dare besmirch the glory that is Memphis BBQ. In short, I know good BBQ. Smoke Daddy BBQ is good BBQ.<br><br> Smoke Daddy is located on the ever-so-happening section of Division smack dab in the heart of Wicker Park. It's a quick walk from the blue line stop that shares its street name. The outside looks like something that might be found on Beale Street--neon lights molded into the outline of a pig, strings of lights and copious amounts of outdoor seating.<br><br> I arrived for a late lunch on a recent Thursday afternoon, and was instructed by a waitress to sit wherever I liked. Wanting to people-watch and take in the comfortable temperatures, I opted for one of the outdoor seats. She handed me a menu and promised to return shortly. The menu is loaded with meats, ribs, southern-inspired sides and lots of sandwiches. Oh man, the sandwiches--pork, chicken, brisket, burgers, you name it! <br><br> While I sat there in hog heaven (thank you, thank you...I'll be here all week), the waitress returned with two glasses of ice water and two rolls of silverware. \"Should we wait for the rest of your group?\" she asked, incorrectly assuming that a man with my rugged good looks and rapier wit would be dining with whatever choice of billionaire/bikini-model/astrophysicist that he wanted.<br><br> I informed her I was, in fact, rolling solo today and that I would be having the Smoked Pulled Pork Sandwich with a side of fries. She scurried away, leaving me to revel in the shade of my table's umbrella and wi-fi hotspot.<br><br> The sandwich arrived in about 10 minutes. Some BBQ places are stingy on the sandwich bread which allows them to skimp on the meat too. That wasn't the case here. I could tell immediately, this would more than fill me up. Each table offers ketchup and three Smoke Daddy sauces of different flavors and heat (original, sweet and smoky and mustard Q). There's something I love about squeezing the cylindrical plastic condiment bottles to see their contents shoot out from the tightly tapered opening. The pork was flavorful and juicy, the bread toasty, and the sauces not lacking in their kick. My only qualm is that the fries are so short and small that it makes them messier and more difficult to eat when dipping them into the ketchup. I've never been a fan of using a fork for fries, but if there ever were a time then it would be here.<br><br> A quick gander at the Smoke Daddy website will show you their weekly specials (Tuesday BBQ nachos!), brunch offerings and how to buy their original sauces. <br><br> Thirteen dollars with tip makes Smoke Daddy tough to beat in terms of value. If my diet weren't an issue I'd come here every week. Regardless, this is an establishment that should be on anyone's list for comfort food and a fun atmosphere. <br><br>Food: ****1/2<br>Atmosphere: ****1/2<br>Service: ****<br>Overall: ****", "pics": null}}, {"review": {"des": "Came here on Saturday evening for dinner and drinks, as it is a good place to start an evening out and about.  <br><br>Service- The service was good. Had a waitress, Alison I think, who was from Ireland, and just as friendly as can be. She was great with my group of friends and very attentive with her service and care for her patrons.  <br><br>Atmosphere- The atmosphere in this place was great. Fun, lively, and bustling with energy. <br><br>Food- The food was great.  Ordered a pulled chicken sandwich, with fries and slaw and it was great.  Only downside is fries and meat were room temperature by the time I got them at my table.  <br><br>Otherwise everything about this place was great.  It is huge and during the summer has a lively outdoor eating area which was a blast.  Definately will go back.", "pics": null}}, {"review": {"des": "Great ambiance and food. I LOVE THEIR WINGS!!! The manager  \" Mike\" is the BEST. Very engaged with what's going on and very patient with customers (like me). He's always around to fix issues from food to lighting. He's good in what he does:HE RESOLVE THE PROBLEM. He deserve a raise and / or a bonus.", "pics": null}}, {"review": {"des": "First time here and I wasn't disappointed one bit. We did a taste testing for our rehearsal dinner and everything we tried was absolutely amazing. From the salad to the cornbread, sliders and the ribs. Didn't get to try the monkey bread, but was told it's just as good as everything else. Would def recommend!!!", "pics": null}}, {"review": {"des": "Sooooo good!!! Cornbread yummy. Ribs amazing. If you are not a fan of sweet bbq sauce than this place is for you..there sauce is just right. Chilli is delish. Awesome find for us!!! Would definitely come back again...the next time I am in this great city - Chicago.", "pics": null}}, {"review": {"des": "If you're a BBQ fan, this is your place. Tre sauces on the table when you arrive. All equally delicious. Huge menu that includes brunch as well as all of your favorite BBQ items. The pulled pork was unreal. Bloody Mary was huge and very good. The waitress we had was extremely attentive and was always refilling drinks. The outside patio is one of the coolest I've been to. Fans, TVs, and tons of dogs. I'm actually going back today to try the burnt ends because it was that good. Don't miss out in this spot.", "pics": null}}, {"review": {"des": "We were in a group of about 12, so I am totally aware that we probably were not the ideal situation for a table. We sort of ordered in waves as people arrived. I will give them the benefit of the doubt for that. <br>But we were not impressed by the food, and were NOT happy with the service. This seems like a restaurant that will survive for a few years just based on being located in a prime spot. But hopefully they will step up their game. Mediocre food is okay when your server is at least taking care of you and not making it apparent that you're inconveniencing her in some way.", "pics": null}}, {"review": {"des": "I love this place! Went with my boyfriend for date night. Nice atmosphere. We had drinks and the pulled meat nachos out on the street side patio.  I got cold and we moved inside.  For another drink and entrees...the brisket on the nachos was delicious. I will definitely come back again", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/l0Ur6wtJQnNlT_ufP8U1nw/348s.jpg", "caption": "Finished off the huge pulled meat nachos.... The brisket was amazing"}]}}, {"review": {"des": "Hands down my favorite barbecue spot in Chicago. And trust me, I've tried many. Every time my family comes to visit, this is where they want to come. <br><br>All of the meats are great, but the brisket and burnt ends are my favorites. My family also raves about the ribs!  As for sides, I would highly recommend the greens- they're cooked perfectly so they still have a bite to them and aren't soggy at all like some places. The Mac and cheese and bbq chips are also great options. <br><br>I will say that this place gets packed on the weekends, so I'd highly recommend making a reservation beforehand.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Znlp54eqf0XTW5Ky5svUEw/348s.jpg", "caption": "Brisket, chicken, greens, and Mac! So delicious."}]}}, {"review": {"des": "Six Words: Get the delicious Adult Cherry Coke!<br><br>Smoke Daddy is the kind of barbecue I've been looking for across the city: lowkey restaurant with good food. I like a fancy restaurant ... at times. But most days, I'm looking for good food somewhere that makes me feel like I'm a regular the moment I walk in. That is Smoke Daddy.<br><br>I came here around 7pm on a Saturday and the place was buzzing but we were seated immediately. Located on Division, it's near a bunch of barbecue places and bars, but there was a steady flow of traffic all evening. The booths are bright red booths - the kind of booths I've only seen in movie diners. So I was quite happy to stumble upon that. <br><br>Drink menu is pretty large. I was seated across from the bar and it's well-stocked with all the liquors. I opted for their Adult Cherry Coke. From the menu: \"It tastes like cherry coke and Seagram's Stone Cherry Whiskey gives it a kick.\" It was perfect. I ordered one and my roommate ordered their cider, tried a sip of my drink and ordered one for herself. It's really good.<br><br>For dinner, I opted for the Daddy-O sandwhich: sliced brisket, provolone, and onion rings with a side of fries. It's delicious in a \"I don't mind that I'm consuming a million calories and my heart will probably regret this in 10 years.\" It's a beast of sandwhich that comes with some barbecue sauce on it. Personally, I found it a little dry so I just dumped more barbecue sauce on it. Then it tasted perfect. It was a smokey barbecue sauce that they make/manufacture/label/whatever themselves and it's amazing. <br><br>My roomate ended up with the Rotisserie Chicken with a side of collard green and Mac and Cheese. The chicken was seasoned deliciously - I wished I stole more than one bite. The Mac and Cheese was mehh (Lillie Q's has better Mac and Cheese). What was truly surprising was the Collard Greens. Normally, I don't find Collard Greens entirely delicious. But my roommate spent a year in Georgia and that's what she missed most from the South. So when they arrived on the table and tasted as delicious as they did, she fell in love with Smoke Daddy. And I have to say, they were the best Collard Greens I've ever had.<br><br>Overall, I was very happy with Smoke Daddy. I definitely will be back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Bb0e0bb4gfLkgQ0uMAVGOQ/348s.jpg", "caption": "Daddy-O with a side of fries."}]}}, {"review": {"des": "They did an awesome job taking care of us. We started with a table for 6 and over the course of 15 minutes it ballooned to 13. This is on a Friday at 8pm. They went over the top working with our group which included 7 kids. <br>The food was excellent. The big daddy platter with ribs, pulled pork and burnt ends was the best. I highly recommend this place to anyone looking for some great BBQ!", "pics": null}}, {"review": {"des": "This is a great place to take friends or family when they come into town. The food is wonderful and the atmosphere is authentic to Chicago. I highly recommend this place to any one.", "pics": null}}, {"review": {"des": "I've officially chosen this as my go-to BBQ joint and I am never let down. I've gone here when there are live bands and the atmosphere is always lively and servers are friendly. Food is to die for. GET THE BEANS AND PULLED CHICKEN! In love!", "pics": null}}, {"review": {"des": "Awesome platter!  Brisket was tender. Pork was delicious. Service was awesome and friendly!  The wicked Radler was refreshing (keep the can for the extra $3...it's almost a full can!).  Smoked beans were the best.", "pics": null}}]}