{"name": "southport-grocery-and-cafe-chicago", "reviews": [{"review": {"des": "Avocado toast was simple but delicious. Perfectly cooked egg with a bit of crispiness around the edges. <br><br>Had this sort of omelette tortilla chip bowl which was so amazing! Only downside was that by the time we were at the bottom of the bowl the chips became super soggy from all the juices.<br><br>Every time I'm here, I always get the stuffed French toast. It is what French toast dreams are made of.", "pics": null}}, {"review": {"des": "I came here this morning because my college roommate and dear friend was in town for the first time, and for one day only, after moving out of state 3 years ago. This has always been her favorite brunch spot so I made the trek from my comfort zone of the north shore suburbs to the city. <br><br>I can totally see why she raves about this place. It's cute, but not as much of a \"grocery\" as I expected based on the name. But we were there for breakfast so it's irrelevant. <br><br>Breakfast and lunch are served all day, which is kind of awesome. We ordered a bunch of things between us, including individual pancakes and full dishes. I like that they give an option for an individual pancake, though $4.50-$5.50 seems a bit excessive. That said, it was delicious. I had the cupcake pancake, which happens to be gluten free if that's your thing (it's not mine but it sounded amazing, and it was). The vanilla butter that came with it is epic. I also tried a bit of my friend's hash, which was awesome as well. Our other friend ordered the avocado toast, which contrary to being a millennial, I've never actually seen in-person (though I've made it myself). Holy crap I understand why my generation spends their rent money on it. It looked amazing, and next time I would totally risk my semi-avocado allergy to try it. <br><br>I wouldn't make a special trip here purely because it's an annoying drive from where I live, but I would absolutely come back if my dining companions wanted to. (That said, street parking on a weekday morning was relatively easy. I found a free spot a block and a half away and there was plenty to go around)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EHhl_C7T7X6lDoiu1aB9zg/168s.jpg", "caption": "My friend's avocado toast that I creepily took a photo of bc it looks awesome and I want to recreate it ($11? $13? I don't remember)."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6ZAxDr_lnImg1yHYe-cynw/168s.jpg", "caption": "1 cupcake pancake (GF) $4.50"}]}}, {"review": {"des": "Over a decade ago, this was one of my favorite brunch spots in the city. Now...not so much. I'm not sure if the restaurant went downhill or my tastes have changed. Maybe both.<br><br>I visited here about two months ago for brunch. Our server's \"service\" was abysmal. I haven't encountered a server so obviously rude in a long time. He seemed annoyed by our presence, our orders, and life in general. I knew ahead of time that if I checked in on Yelp, I would get a free cupcake...when I showed him said check-in though he just stared blankly at me. He waited about 5 seconds before saying something like \"I guess I can bring you a cupcake.\" I felt foolish and embarrassed...not emotions you want to feel interacting with a waiter. The cupcake itself wasn't even that good. I had remembered it being amazing, but amazing it was not. It was generic and even dry. <br><br>For brunch I ordered the hash minus the cheese and my dining companion ordered an omelette. Even without the cheese my hash was so incredibly greasy, as well as salty. My friend thought the same about his omelette. Of course I expect restaurant food to be a little more salty and heavy than a homemade brunch, but this was excessive. I think I consumed my sodium intake for the day. Meanwhile the server continued to be curt throughout our meal and even at the end when I was purchasing some jam from the grocery part, I felt like he was glaring at me while ringing me up. Seriously what is up with this dude? Ugh the one star is for my positive memories of this place from a long time ago. Also it's not possible to give 0 stars. I don't plan on making the trek up here again to pay for greasy food delivered by a snippy person. Onward and upward.", "pics": null}}, {"review": {"des": "I was looking for a casual, but GOOD brunch spot. Southport Grocery and Cafe was right on the mark.<br><br>After reading that this was the best brunch spot in Chicago, I had to check it off my list. I'm so happy we did. Surprisingly, our Saturday morning wait for two was only 20 min for a pretty small dining space. Once we were seated, we ordered coffee: I had an iced latte and my boyfriend went for the bottomless black coffee. Neither of us were impressed with the coffee, but it was drinkable. I'll probably cover my AM caffeine elsewhere next time.<br><br>Everything else we had was amazing. I ordered the breakfast sandwich (photo attached), in the mood for a sort of basic, but not boring breakfast. The sage sausage was on point and who doesn't love a good over-medium egg on a sandwich? Yolk drip for days. Also, you can't argue with mashed potatoes for brunch. They were so delicious, I cleared my plate. (Rare) My boyfriend had the brisket and gravy and LOVED IT. He would not stop talking about it all day. And it was his birthday. There was a lot to talk about. <br><br>We were big fans of the laid-back vibe and of course, the food. I'll be coming back to try other items on the menu, I've heard amazing things about the bread pudding banana pancakes.", "pics": null}}, {"review": {"des": "Came here with a few friends on a Saturday for brunch. This place doesn't take reservations so you have to come a little early and put down your name beforehand. We were told an outside table would be a 30 minute wait but the table was actually ready in 7 minutes! A few people in our party hadn't arrived yet, but luckily the hostess was willing to wait for our whole party to arrive without releasing the table.<br><br>I ordered a latte with almond milk which came a huge mug ($5.25) and the brisket and gravy ($13). Both were delish, especially the homemade biscuits which were buttery and flaky. We also ordered the bread pudding pancakes ($12) with vanilla anglaise and cinnamon sugar butter which were fantastic! I've also heard good things about the cupcake batter pancakes. I would definitely come back to try some of the other breakfast dishes as well as their bakery items (the savory muffin!). There's also a small store inside where they sell artisan food items like jams, pasta sauce, chocolate etc.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3RCG34QYZp2tYlrCY2F52w/348s.jpg", "caption": "Latte with almond milk"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fTUEc0l6128_6OcLXgJqzA/168s.jpg", "caption": "Bread Pudding Pancakes"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/g3jBpChEBZmiG-SgMhhg5g/168s.jpg", "caption": "Breakfast Sandwich"}]}}, {"review": {"des": "Southport Cafe is a great afternoon stop for a casual lunch. With fresh sandwiches and salads, there are tasty and healthy options to choose from. My favorite is the turkey club on challah -- it's delicious. Also, the scones are amazing!!", "pics": null}}, {"review": {"des": "My husband and I stopped in for breakfast today. We really enjoyed our meal! I ordered the avocado toast and my husband ordered the chilaquiles. We also shared a cruffin--omg order this! <br><br>The service is quick, the staff is nice, and the food is delish. I know for a fact that the wait on the weekends is quite long but since today was a weekday there were many empty tables.  The place is small, not too many tables. <br><br>Don't forget to check in, you get a free cupcake. We were so full we took it to go. Can't wait to try it later.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Sy27Y_oloeDDqiDKjajZHw/168s.jpg", "caption": "Yummy cruffin (croissant muffin)"}]}}, {"review": {"des": "I love this place! It's so cute and warm. The staff is very friendly and patient. I had the hash and it was one of the tastiest, most satisfying brunches I'd ever had. The coffee was super good, too. The only issue I had with the restaurant was that it was a bit small, but there isn't much you can do about that. Not the best place for big groups, but the PERFECT place for you and a friend to grab brunch and catch up. It's a bit on the pricier side if you are trying to have a cheap brunch, but the portions are also pretty big so you get your money's worth. I couldn't even finish mine.", "pics": null}}, {"review": {"des": "Traveled from Denver Colorado to visit family, came to eat at the Cafe as it was highly recommend. Atmosphere super cute, service Absolutely Terrible. We were sat and not greeted for 10 minutes, which wasn't the end of the world, it happens when servers get busy, Stephanie has the absolute worst attitude I have ever experienced in the customer service industry. She triggered everyone at the table with her aggressive mannerisms, rude attitude as if we were putting her out. We never saw her smile one time. Our food was great, took a while to come out but again the restaurant was busy so it happens. With that bad of service I would never return.", "pics": null}}, {"review": {"des": "30 min wait on a Saturday for brunch isn't the worst thing, especially in an area where you can shop while you wait, and check on the online waitlist which keeps you posted on your place in line. <br><br>The food itself is great, and I immediately regret splitting the brisket hash because it was great! A tad salty for me but a savory dish that has the hash cut up like fries with a Smokey flavor that doesn't need much hot sauce. As for a sweet part of brunch, a solo order of the cupcake pancakes is a nice balance. I don't know how else to describe them besides smashing an actual cupcake so it's flat as a real pancake and then putting butter and syrup on it. It's great. <br><br>The masala chai is a nice refreshing drink too that's just sweet enough without overpowering the chai flavor. We definitely need to come back and explore the menu even more!", "pics": null}}, {"review": {"des": "This is a great casual brunch spot with awesome menu selections that really deliver on the taste. I only give it 3 stars because we waited a really long time for our food. We ordered the bruschetta- which I would have never ordered but the description was much different than the typical Italian dish- and the hash with brisket. The bruschetta was more like scrambled eggs with bruschetta seasonings on top of soggy bread- still tasty though. The hash was delicious and on top of fries as opposed to your traditional cubed potatoes. I really like this Southport area, so this was a good find for brunch- just took a lot longer than we anticipated.", "pics": null}}, {"review": {"des": "Food was good but small portions for the price. The wait for the food was horrendous.. I don't think they should have only 2 cooks working when there was such a wait already to get in. The seats were cramped together and it's not the most comfortable. <br><br>We got the:<br>Hash $13<br>Southern Omlet $13<br>Free vanilla cupcake with yelp check in + entree purchase<br>Black coffee for $4? Overpriced.<br><br>All in all, I wouldn't come here again. I didn't feel too full after finishing my omlet.. and if I'm going to spend $13+ on a meal, I would want to feel full afterwards..", "pics": null}}, {"review": {"des": "I came here for brunch on a Friday, and got myself their triple apple salad - it was two kinds of diced apples, with dehydrated cider apple crisps, caramelized cashews, and goat cheese. It was quite a tasty salad, everything tasted fresh and yummy.<br><br>I had a bite of my boyfriend's bread pudding pancake and it seems like they slather the thing in a melty cinnamon butter which was really delicious but I'm sure is terrible for you. I also got a chocolate cupcake for checking into Yelp - the cupcake was rather meh (dry, not very flavorful) and I would not recommend paying for it.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FiZMFq30LTIGIImUf_MACA/348s.jpg", "caption": "Triple Apple salad"}]}}, {"review": {"des": "This place is THE BEST. Started off with a slight hiccup as our name was on the list to be seated and by the time we went back, our name was not on it anymore. They were so apologetic and seated us as soon as they could PLUS gave us a delicious cupcake. So all was forgiven. Now, on to the food. We started out with the adult pop tart which was more like an adult toaster streudel, but so freaking good. Then I had the brisket and gravy and it was so delicious. Savory and sinful and amazing. My fiancé had the bread pudding pancakes and they were rich, but fabulous. Overall, a wonderful experience and there's so many more things I would love to try on the menu!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/geT6THISpBz9l0Z9MPJb6Q/168s.jpg", "caption": "brisket & gravy- the star of the show"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oO0NB_zZb7iLG5RYFQTxuQ/168s.jpg", "caption": "Bread pudding pancakes"}]}}, {"review": {"des": "I absolutely love Southport Grocery & Cafe. Their breakfast is outstanding and I would highly recommend the breakfast sandwich. Their pork sausage is delicious as well as the pairing with mashed potatoes. I also really enjoy the biscuits and gravy! It's a bit artsy for the breakfast genre and worth the extra penny. <br><br>However, the place is pretty small and compact and there is almost always a wait on the weekends. To avoid wait times, I would recommend arriving before 9am! <br><br>They lose a few stars from me because the last two times I stopped in, the wait staff was highly anxious and somewhat rude. They clearly get bothered by you waiting indoors due to the compact nature of the place and one waiter even became frustrated by us waiting near the coffee bar. Flustered and heated, he mentioned to us that standing there was \"just not an option\" and that we \"had to move\". While I understand that it can be tough to manage close quarters, I just feel like they should be kinder in the way they treat the patrons. We happily moved! But, the greeter/hostess should have been more clear about where they would like people to wait for tables. <br><br>Overall, I would recommend. But, just go wait outside or something--to avoid the anxiety ridden staff!", "pics": null}}, {"review": {"des": "I had brunch here today with my girlfriend for the first time. Ì was really impressed with the professional manner of the whole staff. The restaurant was really clean and to me that is really important.<br><br>The food was superb. We shared the bread pudding pancakes and the were awesome. We also shared the hash, sie of bacon and the biscuits. The potatoes in the hash were crispy with a ton of flavor. The biscuits were light and buttery. The homemade jam that came with the biscuits made me smile. Hats off to the whole staff especially chef Randy for the great food. We will be back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TVryw62yMC7dnfXcfLERag/348s.jpg", "caption": "Sunday brunch."}]}}, {"review": {"des": "PRO TIP: Check in on Yelp for your free cupcake if you're eating there and get an entree!<br><br>This was soooo yum! I got the hash, my mom got the breakfast sandwich, and my dad got the cuban sandwich. Everyone was extremely happy with their dish- and my dad said the cuban sandwich was the best he'd ever had.<br><br>Highly recommend eating here if you're shopping on Southport- plus they text you when your table is ready so it's super convenient even though there's typically a wait.", "pics": null}}, {"review": {"des": "I'm going to start by saying this used to be a spot I really liked. But my last experience left a terrible taste in our mouth and me and the friends I was with will NOT be returning. What shameful and pathetic customer service this restaurant has. They messed up my order, charged extra for substitutions we didn't even want under the pretense that it was going to be at no charge and then charged us for them and then had the audacity to tell me the manager said it is what it is and to deal with it.<br>What a pathetic way to deal with a customer, especially after it was miscommunication on their part. <br>You lost a handful of regular customers, restaurants that have pathetic customer service are not restaurants anyone wants to waste their time in. Mediocre food, pathetic customer service and overpriced. Don't waste your time, plenty of other spots.", "pics": null}}, {"review": {"des": "Fresh and fun breakfast on Southport which will become a spot into the rotation. Great coffee and the cruffin was a revolution.", "pics": null}}, {"review": {"des": "Cute spot and good service but the menu always sounds better than the dish tastes somehow...  Been here a couple times, this time it was:<br><br>- chicken and grits - looked appetizing but tasted ok- good: hot sauce was flavorful and the yolk was properly runny... Not so good: grits were on the thinner side and lacking salt, fried chicken was dry and the egg whites not fully cooked on top (the last one is preference I know, but goopy whites freak me out).   <br><br>- brisket and eggs - huge portion, easily good for 2 ppl especially since it's a pretty rich dish... Brisket was too fatty given the sauce and not really seasoned but biscuits were huge, yolks properly runny<br><br>Overall I may come back but it would be to try the sweet stuff, some options looked interesting", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yU7lkVPgWtl4o5k6MWy-IQ/348s.jpg", "caption": "chicken & grits"}]}}, {"review": {"des": "Great service! Our waiter was really kind and helpful. Someone else accidentally brought us a deathly hot sauce and he offered to bring us more grits to compensate for the spice (we didn't even ask!) Food takes some time to come out but it was really tasty. The line was long but we had a good experience so that's what matters. <br><br>I didn't think the cupcake lived up to its hype unfortunately... it was sorta why I came! I wouldn't rate it as one if the best cupcakes in Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Fo_lroW-B8gAnAANudoRAA/348s.jpg", "caption": "Smoked salmon plate"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/52xEqX2rzmdu4cMjlR5sWg/168s.jpg", "caption": "Bread pudding pancakes! So delicious, love the thick sorta chewy texture."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/j6LlQzDeXZ7L0--HWJglvQ/168s.jpg", "caption": "Chicken and grits-- very moist chicken. Grits were lukewarm though."}]}}, {"review": {"des": "Southport Grocery and cafe is my new favorite place. A friend of mine from out of town who was visiting from Boston told me about it and boy and I'm glad she did. The food was phenom! Everything we ordered was delectable. The cheese and herb omelette! Yum! The hash! Yummy! The chorizo and eggs! Yummiest! We also shared the grown up pop tart. I do declare! The service was spot on. I cannot wait to go back.", "pics": null}}, {"review": {"des": "Pricey for what you get. <br><br>- Bread pudding pancake ($5 for 1 pancake - delicious!)<br>- Biscuit and gravy ($6 for the taste - meh, biscuit was hard)<br>- Squash and Bacon omelet ($12 - it was OK)<br>- Chai latte ($4.5 - good)<br>- Latte ($4.5 - tasty) <br><br>The best part of the meal was the pancake and I'm so sad we only got the taste portion (1 pancake)! The omelet came with a biscuit and it was pretty disappointing. The biscuit was large but pretty hard, it wasn't buttery or flakey.", "pics": null}}, {"review": {"des": "I came here with my friend on Monday morning for breakfast. The staff was so friendly! They were busy but sat us right away. My friend and I both got the biscuits and gravy. It was so rich in flavor! I loved it so much! The hot apple cider was so good as well. It feels very mom and pop like and it reminded me of home!", "pics": null}}, {"review": {"des": "We love this place. The food is excellent. We got the hash with wheat toast and biscuits and gravy with scrambled eggs on top. The biscuits are the best I have had in Chicago. The pulled pork gravy is absolutely amazing. The staff are very friendly. They were apologizing to us when we accidentally spilled our coffee cream. Completely our fault and thank you for being so helpful in cleaning it up. The free cupcake for checking in on yelp was also amazing. The seating is community so you can be potentially set next to louder people. But everyone was very friendly. Definitely recommend if in Southport.", "pics": null}}, {"review": {"des": "Southport Grocery is one of my favorite places for brunch! Sure you have to wait a bit to get in, but the food is worth it. I highly recommend splitting a bread pudding pancake for your brunch app, then split tastings of their other great dishes. I got a tasting of the seasonal chopped salad and the brisket and gravy last time, but they also have really good omelettes, grown up pop tart, and breakfast sandwich. Service is always great as well!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cVEEjYFhOCB3XCsWRQ_kwA/348s.jpg", "caption": "brisket & gravy"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-oUZg2bACgsguwJ_o4iyOw/168s.jpg", "caption": "Seasonal Salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FV0iz1XAMwbJOVzRWFyQNg/168s.jpg", "caption": "Bread Pudding Pancakes"}]}}, {"review": {"des": "First time here. Excellent unique brunch items to choose from. I had the Chorizo and egg meal with an old fashioned mimosa and double Expresso. <br><br>The old fashioned mimosa was the star of the show and the Expresso was very good with a good flavor. The chorizo egg was very good but I regret not getting the brisket and gravy because it was the best at our table without doubt. Maybe next time!", "pics": null}}, {"review": {"des": "First off the food was great. We were visiting from out of town and ate here before heading to Wrigley Field.<br><br>That being said, I should give less than three stars, as they completely forgot about us and lost our slip :(  the server was complaining since we arrived that they were \"down a person\" and training someone new. This I understand, but they weren't that busy and the place is so small that they walked past us probably 50 times. We were patient and understanding, but were there for maybe 1.5 hours before he asked \"...did you guys eat yet?\" We received a small discount and two free cupcakes but honestly was not enough to compensate for the poor experience.", "pics": null}}, {"review": {"des": "The atmosphere was clean and comfortable. Food was outstanding and stands on its own! Would definitely recommend for brunch. (Snag the quiche and brisket hash if you want to do it right!)", "pics": null}}, {"review": {"des": "Ugh. Obsessed. <br><br>Came here one morning before a cubs game. Only disappointment was how small the $9 mimosa was (in a small mason jar)<br><br>Split the adult pop tart to start. Wow. Can't say enough good things about this. May be a little too fancy for my taste but you have to try it. So good.<br><br>Then split a cupcake pancake (I'm a sucker for anything covered in whipped cream and syrup, but definitely very sweet). <br><br>Also split the chorizo and eggs. Kind of a strange twist on chilaquiles, was more like breakfast nachos that were kind of hard to eat. Delicious, but a lot of crunch.<br><br>Definitely worth a stop, maybe not as an attempted boozy brunch though", "pics": null}}, {"review": {"des": "At 9:45 on a Sunday, the wait was 45 minutes for a table for two. The retail stores don't open until 11:00 on Sundays, so plan accordingly if you want to shop while waiting for a table. <br><br>The place is tight and I had visions of my clumsy self bringing down one of the shelving units with a wrong move. <br><br>We started with the \"grilled coffee cake\" with cream cheese filling and it was just okay. They had a lot of other sweet options which I recommend you try over the coffee cake. <br><br>I had the chorizo and eggs, which to me seemed more like chilaquiles. I do think it would be better if they mixed the tortilla chips in with the verde sauce and eggs, instead of placing everything on top of the chips. The chips at the bottom are dry to the bone. Also, the chorizo was boring. <br><br>As stated on the menu, the ice tea is \"bottomless\", yet not one person offered to refill my empty ice tea glass. <br><br>The man said his tamale was a 7 out of 10. <br><br>So all in all, not bad, but don't wait more than a few minutes for a table. There are so many other brunch spots to try.", "pics": null}}, {"review": {"des": "Ordered Chorizo and eggs through DoorDash, delivery. Thank you for putting my sauce on the side so my chips would not get soggy, without me having to ask. You would think it's obvious but it is not. #sickofsoggy", "pics": null}}, {"review": {"des": "Brunch Recommendations: if you like savory, definitely get the biscuit and gravy or the hash! The gravy is so creamy and deliciously drenched over a large, flakey biscuit. The hash is a perfect combination of crispy potatoes, veggies and protein with a delectable egg on top. I've been here a few times and always get the masala chai; it has the perfect amount of sweetness that will warm you up on a cold winter's day. You will not be disappointed!", "pics": null}}, {"review": {"des": "One of the best brunches I've had in a long time! I didn't have a reservation in advance so I did have to wait about 30 minutes for a table, but it was well worth it! Both the hostess and waitress were very friendly but the food was AMAZING! I had the brisket & gravy and a solo cupcake pancake...the perfect combination of sweet and savory. I loved the cupcake pancake but can see how it might be a little too sweet for some. It was all too much food for me to finish in one sitting. I like quite far but would be willing to come back on cheat day!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MjEfQA7F5GsSPxjb9hFtag/348s.jpg", "caption": "Solo cupcake pancake (I forgot to take the photo before I spread the butter around)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/d-IRtmJKSY60pxx32vxLoQ/168s.jpg", "caption": "Solo Bread Pudding Pancake"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OrZgbT2rCYrIsohQzPxGkQ/168s.jpg", "caption": "brisket & gravy (eggs over medium)"}]}}, {"review": {"des": "Came back again today. The food was still incredible. If you go, go early (even during the week) as it gets crowded. The service once again was mediocre at best. Our waitress was really friendly, but didn't come around much. The tables are also ridiculously close together, but understandable for a small place.<br><br>I highly recommend the bread pudding pancakes, southern omelette and breakfast sandwich.", "pics": null}}, {"review": {"des": "I've visited Southport Grocery & Cafe numerous times over the past few years.  It's one place that I only go to early in the morning because otherwise, it's too busy and the wait can be long..however, if you have time and are willing to wait, definitely check it out!<br><br>Southport Grocery & Cafe is just what the name implies - there's a small 'grocery' area where you can buy some packaged goods and also bakery items (and coffee).  There are some unique items here, but where some of the items (various hot sauces) could only be found in a few spots a few years ago, now some are widely sold.<br><br>The outdoor area in the summer is popular, and that's where I sat during only one of my visits (inside is great, too).  <br><br>Service is friendly, and while the menu states that everything is made to order, we didn't have to wait long for our meals.  The portion sizes aren't huge, but decent enough, and you can get smaller portions of some of the sweet entrees.  The side of pork sausage was wonderful - I do highly recommend that.  I also had french toast on my recent visit - which was not too sweet, but nicely cooked and with a refreshing citrus flavor on the topping.  <br><br>Coffee is tasty, but strong.  They are very attentive to ensure you get enough coffee also, so don't worry about your cup running empty.<br><br>Price-wise, considering there aren't really any side offerings to some of the breakfast entrees, it's a bit pricey...I think for 2 of us we somehow spent $50 on breakfast with no breakfast cocktails (I did buy a savory pastry on the way out, but I don't think that's what tipped the scale).<br><br>So, all in all, good, but a bit pricey for breakfast, but the menu is fresh and high quality ingredients abound.", "pics": null}}, {"review": {"des": "The cruffin was fantastic! Flakey butter fruit filled deliciousness that will be a staple in my regular favorites", "pics": null}}, {"review": {"des": "Cute and quaint little grocery shop/cafe. I'm so glad my sister took us here for lunch. It's small but friendly and cozy :) The breakfast menu is modest but has a variety. I went with the vegetarian quiche of the day - it was tasty and I loved the crust. I wish it was a little larger. My hubby went with the hash, one of their more popular breakfast items. The potatoes are sliced and taste delicious with the perfect fried eggs on top. They also have a full coffee/espresso bar as well. Next time, I'm curious to try the homemade poptart and some desserts. I didn't shop around the grocery at all, but loved the natural, local ingredients there. Cute spot to bring guests and have a tasty meal! PS - free cupcake when you check in!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XrbY9cTNN2_eVbTgeSXEDA/168s.jpg", "caption": "Hash"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/z8zCfg7GEelLSh7BoHMZeg/168s.jpg", "caption": "Quiche"}]}}, {"review": {"des": "I've been here a few times now. The food is pretty good but the service is sooo slow. I assumed it was just table service but it took me over 20 minutes to get a breakfast sandwich to go when there were hardly any people in the restaurant. It's not worth it.", "pics": null}}, {"review": {"des": "Overall: Delicious, charming, and charming, brunch doesn't get much better!<br><br>The good: Superb tasting food, the quiche was fantastic and the coffee cake was well done. The variety of the menu puts a fun twist on brunch. I'm sure the non-breakfast options are great. Charming atmosphere and also tons of to-go bakery items and bakery spices and goods.<br><br>The bad: Small space, especially if the outside is closed. Tight squeezes. Service can be hindered due to that. Menu, while great, good of had a few more options. Long wait<br><br>Atmosphere: 8/10<br>Service: 8/10<br>Food: 10/10", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8JBBooJm5aWeQ3nvlpGwWw/348s.jpg", "caption": "Breakfast sandwich"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AaaYLK3kkJbKvA5_TE0G5Q/168s.jpg", "caption": "Veggie quiche"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3wlTLI91xGdhukbi92chnw/168s.jpg", "caption": "Grilled coffee cake"}]}}, {"review": {"des": "Wonderful service, fantastic food and a beautiful environment. I could not have been happier with our meal.", "pics": null}}, {"review": {"des": "I am surprised at the high yelp rating, H. and I went there for a breakfast and were very disappointed. Food was not seasoned properly and was quite bland. I got the chicken and grits, while the chicken was nice and crispy but the grits were just bland. H. got the hash which was also nothing exceptional. For the same price, there are better options in the neighborhood to grab a good breakfast.<br><br>I did give them one star extra for good knowledge of gluten free items and risk of cross contamination.", "pics": null}}, {"review": {"des": "I was in a party of 7. The table was available upon arrival since we made reservations, but we weren't able to sit down until everyone from our party arrived. This made no sense as we were made to stand around waiting for the last member of party... while the empty table sat there waiting for us to sit down. Just absolutely no sense. I understand that they probably wanted to take our orders all at once, but they could have done that while we were waiting, seated... so ?<br><br>I got the breakfast sandwich. It was pretty good, especially the side of mashed potatoes, but it took a long time to get to my plate since we waited a long time for the waiter and then for the food to arrive. Looking at other Yelpers' reviews, this seems to be a trend for this place. The food was also pretty pricey for the portion size.<br><br>I got the free cupcake deal Yelp offers. The frosting was completely overwhelming the cake, which itself was dry and not flavorful. I feel like this place was also trying to be Instagrammable, and while the decor and main course certainly was, the cupcake looked pretty sad. <br><br>I won't be coming back unless my friends are dying to go back. One only-okay breakfast sandwich isn't enough for me to return.", "pics": null}}, {"review": {"des": "Been here two times now for breakfast/brunch <br><br>Menu looks amazing <br>Lots of great items that should be delicious if executed properly.<br><br>First time I went we had the world's most disinterested/unpleasant/grumpy server <br>Forgot coffee, then didn't bring cream/sugar dish over and didn't return for so long we had to ask for help from the busboy.<br>Also during this visit they were out of the chicken for the chicken & grits.  I got just the grits as a side to try. They were flavorful & not runny. <br>I got the biscuits/brisket & gravy which was pretty good.<br>Grilled Coffee cake appetizer was also pretty delicious.<br>My boo had the hash which was way too oily.<br>Cupcake pancake was pretty great. Had 1.<br><br>Second visit we had a wonderful server compared to previous guy. She was attentive without being annoying. <br><br>This time boo got biscuit/brisket & gravy  and I finally got to try the chicken & grits. The grits were a runny mess, the chicken was overcooked & dry. Egg on top was only saving grace.<br><br>One thing I love is that at the end of meal you just go up to register to pay with your table number tag.  <br><br>I really want this place to be better because the menu looks so good. Execution is too hit or miss.", "pics": null}}, {"review": {"des": "I was in Chicago visiting friends and they brought me to Southport Café for brunch on our way to a Cubs game.  Despite having a hipster vibe, this was the perfect spot on this particular day.  The weather was so nice we opted to sit outside.  This worked out well as I high-fived my fellow Pirates fans as they walked by.<br><br>The chorizo and eggs bowl paired nicely with a beer from local Off Color Brewing.  Since my friends recommended the cupcake pancakes, I ordered some for us to share.  The chorizo and eggs were fresh and tasty, served on top of homemade tortilla chips.  The portion was just the right size - enough that I was full and felt I got my money's worth.  Those cupcake pancakes were fluffy and sweet, a great ending to a great meal.  <br><br>Highly recommended for an enjoyable breakfast.  There might be a wait on the weekends, but it's totally worth it.", "pics": null}}, {"review": {"des": "Hmm...I've been here twice, and both times have just been average.<br><br>First off, whenever I've come it's been crazy cold out, and I was stuck with the table by the door.  It's not the end of the world, but the second time a couple came in after us, threw a shit fit about having to wait, and immediately got a kick ass table where it was about 20 degrees warmer.  Twenty minutes later, we were eventually placed at a table where I got to enjoy my entire meal in my winter coat.  The service was always friendly, but slow.  Still, the menu is where this place shines.  Every sweet breakfast item I've tried has been delicious.  Oh, and their bourbon hot chocolate was so strong I couldn't finish it - which is saying a lot, cuz I had had a really shit day when I tried it.  One thing to note - check the date on items in the grocery section.  I paid way too much for pretzels that had already expired over a month before.  Final verdict?  Go during summer, rock some drinks, and rock some sweets, and thank me later.", "pics": null}}, {"review": {"des": "We had to stop here after hearing all the hype. <br><br>And the verdict: DELICIOUS. <br><br>There isn't a lot of seating indoors or outdoors, so if you can go on a weekday, I would highly suggest it! Service was simple; water is on the table, so you only order and receive your food from your waitress, and that's it. No fancy extras. <br><br>I ordered the savory hand pie, which was good, but not great. There was a lot of dough, and everything was separated on the inside- egg on top, spinach and mushrooms on bottom. The flavors were actually tasty, and having it warmed up was a great choice, but it was missing a holistic feeling. I also ordered the cupcake pancake which was the <a href=\"/redir?url=http%3A%2F%2Fbomb.com&s=bb4f996415a9c2f21137e27cfb68f439a48cec2652b53e9b50dd7e766dbe177e\" target=\"_blank\" rel=\"nofollow\">bomb.com</a>! I'm glad I went solo, because it's obviously very sweet; but man, was it something that I have only imagined in my wildest dreams so far. Ooey, gooey on the inside, and topped with vanilla frosting. To die for! <br><br>My friend ordered the chorizo and eggs and thought it was superb; best she's had in the city! The iced tea, however, was terrible and tasted like Chapstick. We certainly didn't utilize the bottomless feature as we could barely finish 1/4 of the glass between the two of us. <br><br>We took a red velvet cupcake with goat cheese frosting to go. Such an amazing combo of flavors, with just the right amount of frosting that it almost made you miss the fact that the cake was a tad dry. Not to the point of being off-putting; I would just expect a moister cake. <br><br>Overall, some misses, but they certainly didn't take away from the hits. I would definitely dine again and just try something different... But I'll keep getting the solo cupcake pancake forever. :)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TwVoz9wQb4rXpo3yC6kkfg/348s.jpg", "caption": "Red velvet cupcake with goat cheese frosting"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/G6H70c1UGiYod8mPbXYo7g/168s.jpg", "caption": "Chorizo and eggs"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/G2A5xbuMO4eCKSJvwnMhDA/168s.jpg", "caption": "Savory hand pie $4 and solo cupcake pancake $4"}]}}, {"review": {"des": "Great spot, found it on our last day in Chicago ... the hash was amazing! Staff were very friendly and quick! It's small so get there early to prevent a wait! <br>Definitely going back!", "pics": null}}, {"review": {"des": "We went for a Saturday brunch at 11am. We waited for about 20min for an outdoor seat. The service is bad. The waiter forgot our juice and the food takes forever. There are many people waiting and moving around. <br>I ordered the bruschetta and the chicken sausage is very chewy. My friend ordered the chicken and grits, and the chicken is very tender. Overall the ambience and dishes worth the wait.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6N6sYywobyjc1fLmINK-mA/348s.jpg", "caption": "Bruschetta"}]}}, {"review": {"des": "Southport Grocery has been a favorite for years. Always a fresh, creative and delicious breakfast or lunch. Love all the baked goods and coffee drinks. Such a cute and bright space.", "pics": null}}, {"review": {"des": "Best brunch in the city. Every time I go, I am not disappointed. Service can vary though. Some of the wait staff is friendly and others not so much or seem rushed and stressed. Other than that, the food quality is superb. I love the fresh, organic options they have. But the homemade biscuits, jam, and butter are to die for! Try the cupcake pancake...not only is it gluten-free but it is by far the best thing you'll ever have for brunch! Highly recommended!!", "pics": null}}, {"review": {"des": "Quiche is delicious!!  Tasty herbs on top. Hash also very good. Has a nice chew.  Wait was about 20 min Sunday early afternoon. Lots of shops nearby so it didn't feel long at all.", "pics": null}}, {"review": {"des": "I just dined at Southport Grocery today for breakfast and I give this place a solid 3.5 stars.<br><br>Food<br>* Ham & Grits - was delicious indeed. The ham was soaked in the maple syrup type substance that not only smelled amazing, but tasted amazing as well. The grits were so so and didn't really add to the dish. 4 stars<br><br>* Hash - my dining companion added bacon to this dish and said it was very good. 4 stars<br><br>* Bread Pudding Pancake - this was sadly disappointing. The pancake was bland, but thankfully the vanilla anglaise gave it some flavor. 2 stars<br><br>Drink<br>* Hot Chocolate - was pretty much all foam and little liquid go actually drink. The cube shape marshmallow was good though. 2 stars<br><br>Seating<br>* I wasn't a huge fan of the seating situation here. The tables are so close together you can hear every word the people next to you are saying.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2ZwCMAutCVmDys0ggVjB7w/348s.jpg", "caption": "Hash with bacon"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SbAE4MpBW5ozgT3qfioL2w/168s.jpg", "caption": "Bread Pudding Pancake (solo)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AZcbRcuOKF5X83bAikw1lQ/168s.jpg", "caption": "Ham & Grits"}]}}, {"review": {"des": "Wait can be long. Usually quicker than what they estimate. Food is always great. Love trying new meals here. Pancakes are amazing. Great selection of menu items. Great brunch spot in a great neighborhood.", "pics": null}}, {"review": {"des": "The chorizo and eggs breakfast dish was the perfect day after St. Paddy's Day breakfast. The wait to be seated had always deterred me from eating at Southport Grocery but every time I walked by I felt a twinge of guilt to all of those who I could see eating in the window. Apparently the trick is to get there around 9 to beat the rush. <br><br>Our waiter was engaging and entertaining and apparently afraid of mushrooms. He did a great job following up with us and taking the several modifications that came from a group of hung over girls. <br><br>I've only been once so it's a little bold to say this but I think this may be the best brunch spot on the southport corridor. Cute, great food, and low key.", "pics": null}}, {"review": {"des": "many years later...<br><br>...and one more star! breakfast salad! yum. what a cool combo of ingredients and flavor but please use lacinato kale especially because that's what's listed on the menu. there's a huge difference. if you don't have lacinato kale and are substituting, kindly let me know :( i would've gladly ordered something else. #firstworldproblems", "pics": null}}, {"review": {"des": "This place is all-around amazing; and by all around I mean the service, staff, food, menu, beverages and catering.  Yes, it's busy but they will take your number and text you if you want to kill time and shop or grab coffee on walkable Southport.<br><br>I used Southport Grocer first for some catering items for a brunch party.  They have a nice mix of some unique items and normal party staples.  Everything we ordered was great, and the prices were comparable to other (lower quality) catering options.  Hope they don't read this and realize they could raise the prices.<br><br>Dining in offers a similar awesome experience.  The menu is creative but not dumb 'trying too hard' creativity.  Beverage menu is again creative with options like an old-fashioned mimosa or a wheat beer beermosa.  For food we had the brisket and gravy and bruschetta, which both were awesome.  I'm really running out of positive adjectives so I will just say, it's darn good - check it out!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wqaiXx7DivIdP9D31Xq_wA/168s.jpg", "caption": "Brisket (and biscuits) and gravy."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MrVumlpLPqXy7uncd6fooA/168s.jpg", "caption": "Breakfast bruschetta with chicken sausage."}]}}, {"review": {"des": "I'm sorry but since when does drip coffee cost $4? That is completely absurd. We stopped by for breakfast this past weekend and thought it was good. Unfortunately my bread pudding pancakes were very under cooked, you could taste the dough. Service was ok - we asked for coffee but were never brought sugar or spoons to stir with. I don't think I would go back.", "pics": null}}, {"review": {"des": "world class club sammich .....nuff said....but Yelp wont let me stop... so the fresh berry lemonade also great, and healthy side options", "pics": null}}, {"review": {"des": "One of the best locations for a fresh, satisfying breakfast in Chicago. All ingredients are made to perfection. I had the breakfast sandwich with mashed potatoes on the side, both had lots of flavor. The breakfast sandwich has a cranberry jam that blends wonderfully with the flavors of the sausage and the arugula. Overall, great experience.", "pics": null}}, {"review": {"des": "Brunch here was kind of flat.  Whomp whomp... especially after a 30 minute wait.<br><br>The highlight: that Metropolis iced coffee served up in a mason jar!<br><br>The lowlight: the rest of my meal!  I was super excited to try one of the bread pudding pancakes, but it was lackluster.  It tasted mildly like cinnamon because it was topped with cinnamon butter, but other than that, it was rather bland.  My entree was called bruschetta, and it just tasted like it was made from several prepackaged ingredients: crostinis + mediocre chicken sausage + chopped tomatoes and basil (ok, I know those didn't come out of a box).  It reminded me a little of cafeteria food.  (Ouch, yes...)<br><br>P.S.: also took home a red velvet cupcake with goat cheese frosting, but the cake was way crumblier than I prefer.  The frosting definitely delivered on the goat cheese!<br><br>Note: after finishing your meal, take your number to the counter inside to check out and pay.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KIO9hjhKF_pkVi7yIq9QrA/168s.jpg", "caption": "Bruschetta and bread pudding pancake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/auLG_v2mRTKuLrroiKftoA/168s.jpg", "caption": "Hash"}]}}, {"review": {"des": "I had a solo bread pudding pancake and the bruschetta with eggs. My buddy had the chicken and grits. <br><br>Both of my dishes were superb. Pancakes were just the right amount of sweet with a fluffy/soft consistency. The bruschetta was similar to a typical bruschetta, topped with great scrambled eggs and crumbled Mexican cheese. My friend seemed to enjoy the chicken and grits as well. I also had the vanilla cupcake, which was good but a little dense for my liking. The cupcakes are apparently on some \"Best Cupcakes Of Chicago\" list, so go for it if you enjoy novelties.<br><br>There was a bit of a wait (30 minutes on a Sunday around 10:30 A.M.), but it wasn't bad compared to a lot of Chicago breakfast spots on the weekend. They text you when your table is ready, so you'll be free to walk around the area while you wait. Great customer service, we will definitely return.", "pics": null}}, {"review": {"des": "What can I say?  My wife and I were both off in a Friday so we decided to hit the south port grocery and cafe up hoping it wouldn't be too busy.  The patio was full but room inside (it was a humid day, anyway).  It surely didn't disappoint.<br><br>I had the southern omelet with a biscuit (omg) and mashed red potatoes and the wife had the banana pudding pancakes.  Everything was a.m.a.z.i.n.g. The food was fresh and served hot. The food took a bit longer than expected to come to the table but maybe I was just hungry and impatient.  The tables inside are a bit close to each other as the establishment is pretty small and they're trying to fit as many people in there as possible. So just beware you might be a little bit closer to your neighbor at the next table. <br><br>Overall, amazing food and I will be back.", "pics": null}}, {"review": {"des": "This place stays busy for a reason. <br><br>GLUTEN FREE cupcake is amazing. I always grab one on the out and save it for later. <br><br>I always get the HASH here... It's fun to legally order Hash and it's pretty much breakfast in a bowl. Hashbrowns, Eggs, Peppers, 'Shrooms, Cheese.   <br><br>Lots of great local companies used here and they carry a wonderful assortment of groceries if you feel like cooking or need stuff to go for a picnic. <br><br>Oh and Anytime after ONE is perfect time to grab a quick table and still get breakfast! :o)", "pics": null}}, {"review": {"des": "If you are going here for the brisket and gravy, don't!  I love biscuits and gravy and this was the worst I have ever had. The gravy was thin and acidic and the biscuits were not rocks but not good and fluffy. I was starving but I couldn't even eat half of it. Also, the coffee tasted like dishwater. I understand that I may have just ordered the wrong thing, but for breakfast, good coffee is essential. The iced coffee on tap was not good either. My daughter couldn't finish hers.  The server was nice, but then they got busy and you know how that goes...", "pics": null}}, {"review": {"des": "I love this place, can't believe its taken me this long to write a review.  We just had catering in my office today but I've been to the actual restaurant several times.  I'm never disappointed and the food is always tasty.  The chicken salad sandwich just knocked it out of the part for me today though.  Love this place- 5 stars all day.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dk9W8RShdoMy3NkTEfQ58g/168s.jpg", "caption": "Catering sammiches"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RYqHmbZkgps9pgahix4FdQ/168s.jpg", "caption": "Catered salad"}]}}, {"review": {"des": "I now have a new favorite pastry stop...they seriously have the BEST cupcakes and the DING DONG was amazing! I loved the vanilla and the chocolate cupcakes, but the Ding Dong made me cry when I ate the last crumb. Can't wait to come back for brunch.", "pics": null}}, {"review": {"des": "Sitting outside was nice, the food was good, and they are very gluten-free friendly. Killer GF cupcake!", "pics": null}}, {"review": {"des": "The food looked great!  My friend had soup and I had unlimited coffee.  Nice friendly staff.  BUT the music was so loud that  I found myself shouting across the table.  My friend said the same thing and we laughed about it.  Maybe I'm getting too old for that kind of place.<br>I would go back and sit near the window.  It might be a bit quieter over there.", "pics": null}}, {"review": {"des": "This place is perfectly located if you're trying to grab brunch before a Cubs game and is perfectly located in a cute area with shops, restaurants, and fun stuff to do. <br><br>When we got there around 11, the wait was 45-60 minutes, and ended up being right around 50. While the cafe and patio are cute, it's definitely packed once you get inside and a bit of a tight squeeze. <br><br>I ordered the chorizo and eggs, and honestly, I was less than impressed. It wasn't super flavorful. There was nothing specific about it, it just overall was kinda lacking for me. However, my friends and I also split the bread pudding pancakes and they were AMAZINGGG!!!!! THE BEST PANCAKES IVE HAD IN MY LIFE!!!! God they were so rich and sweet, so avoid them if you don't have a sweet tooth, but they were seriously to die for. But they are rich, and if you have a sensitive stomach like me, don't say I didn't warn you....... I also tried a bite of my friend's chicken and grits, and that seemed pretty good. I would probably order that if I went back. <br><br>Our service was ok. Like I mentioned, they were definitely busy, but it took a while for our waiter to come and even take our drink order, waters got low, little things like that. He was nice and polite and apologized when he did finally make it to our table thought. <br><br>I live in Wicker Park and probably wouldn't hike all the way back up to go here again. If I was in the area and there wasn't a huge wait, sure. But I think there's better options out there.", "pics": null}}, {"review": {"des": "Southport was amazing. The food was great and the environment was somewhat welcoming. They serve what they sell. Everything was amazing, Especially Sean! Great server.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bYJIAwksMxzY4ZWcDpE74w/348s.jpg", "caption": "Chorizo and eggs"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IFZby5QWuz9smVPrniDKBw/168s.jpg", "caption": "Cuban"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MswXl_7oVo_NDuqJ_IQG-w/168s.jpg", "caption": "Hash with Brisket"}]}}, {"review": {"des": "Wanted to check this place put for a while now. I was disappointed.... Had the chorizo and eggs... when I saw my plate I thought they mistaken my food for chips and salsa... they loaded my plate with chips, and absolutely no flavor. I couldn't eat my food.", "pics": null}}, {"review": {"des": "The food is pretty good but heavy on mayo etc. The server was nice but the host was terrible and rude. We had friends in from out of town and all of us felt uncomfortable. Sheesh.", "pics": null}}, {"review": {"des": "Great breakfast!! My husband and I shared the grown up pop tart which was very good. Their homemade preserves was delicious. I ordered the hash with brisket - I love how the potatoes were cut. Great flavor! My husband had the bread pudding pancakes and he loved them. All of the staff members were very friendly and attentive. There were other great options on the menu so we will definitely be back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ishrdoNxVfPmNRNRokeLsw/168s.jpg", "caption": "Hash"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XK-TZqIVwqfwi2YD2jjZSg/168s.jpg", "caption": "Hash with brisket"}]}}, {"review": {"des": "Meh. I was pretty disappointed with this place. Everything seemed quite disorganized from the moment we walked in the door. We were looking for a quick bite before a movie. I also have dietary restrictions so even though it was 1:00 a breakfast joint seemed like it would fit the bill . Despite being several signs asking folks to park strollers outside there was a tank sized stroller blocking 2 seats at what appeared to be the communal table making the wait longer than it needed to be. I get that that's not really their fault but it's how our experience started off. When we finally got sat it was over 10 minutes for our server to arrive. We were ready to order but I had a question so it was another 10 minutes before she returned.  Because of said dietary restrictions there was only ONE item I could order without any modifications, several I could order with 2 more more modifications and one I could order with only ONE modification. I'm aware of those restrictions and I try my best to make them as easy as possible ensuring that the restaurant carries the items (by studying the menu thoroughly) before I even ask. Unfortunately they were completely unwilling to make a small and simple change for my dietary needs. So I had to chose the one item I COULD have (but didn't really want) the chop salad. It was...weird. The flavors did not pair together well at all and there was something incredibly sour in there. My fiancé is also too nice to have sent back his specialty soda but it tasted alcoholic, almost like the \"fresh strawberries\" were either spoiled or fermented. It was AWFUL. He thought his brisket and gravy was ok, but not great. All in all this place is adorable and the shop is nice, but there are just too many other great places to eat in Chicago to return to anywhere that is mediocre. Oh, and we missed our movie thanks to the slow service.", "pics": null}}, {"review": {"des": "I'd give this place 4.5 stars if I could. Love how quickly they seem to move people in/out without rushing anyone. Food is always delicious and I've enjoyed every waitress I've had. <br><br>Only complaint is that if I come here after about noon something is always out. Once, what I wanted to order AND my backup order was out. That was disappointing to say the least but the waitress gave us 15% off and gave me some other food suggestions.  Overall a great place!", "pics": null}}, {"review": {"des": "No wait on weekday mornings! On weekends loooong waits are very possible. When you check in here yoy get a free cupcake! Woo! Pretty delectable cupcake too! For my main meal, I got the southern omelette. The omelette was excellent the potatoes great (small portion though), the buscuit eh (could have done without it), but seriously overall solid establishment! Oh and service was exceptional!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PebEN5HGA1jdyc2sv4CUEw/168s.jpg", "caption": "When you check-in here, for the first time you get a delectable free cupcake!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-OlBLHNAUYZ1mjg-fBLW-Q/168s.jpg", "caption": "The Southern Omelette! (Served with potatoes and a buscuit)"}]}}, {"review": {"des": "I came here for their secret supper on Friday night at 7pm (we heard about it through our friends who attend regularly, but you can get on their mailing list to know about the next one). For roughly 35-40 dollars, you get two entrees and a dessert. For this past secret supper, we had bread with aioli/some type of butter, gumbo, crab cake salad, and this AMAZING dessert of shortbread cookies, chocolate mousse and a shot of chai tea. Service was impeccable even though we arrived a little late. I would highly recommend their secret suppers.", "pics": null}}, {"review": {"des": "Went here on a Monday morning and was seated immediately. (I hear it can be very busy on weekends, and it was packed by the time we left). I had the hash, and it was phenomenal! My date had the cupcake pancakes and he loved them. We shared the pull apart bread, and the flavor was great! However, it could've used more goat cheese and it was a little tough in spots. Also, the iced tea is the best iced tea I've ever had. Which is so random, but seriously it's awesome. Server was attentive and really nice. The whole staff was very friendly. Loved this place, will be back!!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xdcD1I1HvxZkjQZcPm3Y-w/348s.jpg", "caption": "The hash with brisket"}]}}, {"review": {"des": "EVERYTIME Mom and I go to Southport they are out of what I'd like...EVERYTIME.  This time we both wanted blueberry and banana french toast.  Guess what? They are out of them, at 11:00am on a Friday.<br><br>This was our LAST attempt.  Good luck ordering what you'd like from their menu!  Don't waste your time by trying to eat here.", "pics": null}}, {"review": {"des": "Get the pancakes. Without thinking twice. They are amazing. The wait is long but well worth it and they move people in and out pretty quickly. I loved the hash!!!!! Can't wait to go back!!!!", "pics": null}}, {"review": {"des": "Came here on a Sunday with two other people. The wait was about 45 minutes around 1p.m. I had high hopes because the place was getting good reviews and because it is in a neighborhood I tend to frequent. I was a little underwhelmed. The place was tightly packed and our two combined tables were uneven. Upon sitting, we ordered an \"appetizer\" for the table and put in our orders. The place was out of shareable bread, which was odd, as it is probably the easiest thing to make. Therefore, we settled on the grilled coffee cake as a starter. Unfortunately, the coffee cake did not come to the table for 45 minutes. The other food items probably took another 20 minutes after that. The cake itself was pretty good, the rest of the meal was not much to rave about. I ordered the cuban with a side salad. The bread on the cuban was pretty dry to the point of hurting my gums. The salad was edible. The presentation of the dishes looks good, but the taste was not there. I had difficulty digesting the sandwich for hours.  Overall, this is a convenient but mediocre place for brunch.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Fuc29fTEr5wJyYP6i9GOfg/168s.jpg", "caption": "Cuban sandwitch with side salad"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cac1dDeNyYkEoejf_ACB6g/168s.jpg", "caption": "Sweet Bread"}]}}, {"review": {"des": "Awful. Tried to get breakfast this morning & there were several tables available with a line out the door. No one took our name for 10 minutes while staff stood around without helping. I've been here several times & always found the service rather unaccommodating. How could you not even have a host to seat people on Sunday morning for breakfast? As a 10+ year resident of the area, I'm sad to say this was the last straw with Southport Grocery. Julius Meinl was happy to get our business this morning.", "pics": null}}, {"review": {"des": "This is a 4 star place, but had some issues with a Sunday late morning brunch that drops it down a bit... Never fear, it will get my return business.<br><br>Came in a group of 5, and with an estimated time of 35 minutes, we ended up waiting close to 90. That's not entirely on the staff, as customers who enjoy a place can linger a bit, but would be nicer to have the tables turned a bit more quickly. <br><br>The food was pretty good - the special meat quiche was unconventionally thin (think a piece of thin crust pizza), but the size of the portion was wide/long. Still tasted very good, and the provided hot sauce was a nice touch.<br><br>The salad on the side had no dressing whatsoever, so maybe that was a miss on the kitchen? The elements included in the salad were tasty, however. <br><br>I also ordered a biscuit, and had to ask for jam/butter separately (would think those come with as a default), but it was a tasty & flaky biscuit.<br><br>Had the Bourbon & Bourbon (cider), that was oddly served lukewarm - apparently their drinks refrigerator was on the fritz, so received a cup of ice on the side.", "pics": null}}, {"review": {"des": "Great service. Came on a Friday afternoon when it's not as packed. Great breakfast dishes - loved the bruschetta and the hash. Sweets weren't as great. The coffee cake and cupcakes were on the dry side - likely since we had them late in the day. Overall, great quality food, reasonable prices, and nice wait staff.", "pics": null}}, {"review": {"des": "We stopped in here for brunch before heading to a cubs game on a Saturday. It was pretty busy but I love that they give you a time and text you when they're ready for you. The hostess asked if we were going to the game and doubled checked that we would have enough time to eat and get to the game. While we waited we wandered down the street and found it convienent to not have to just wait in the smallish cafe. <br>Once we arrived back we were seated and promptly served water and our drink order taken. Our waitress was super friendly and made sure we didn't have any questions about the menu before ordering. <br>All of our food came as ordered and was absolutely delicious! We had the banana pudding pancakes and bacon, the hash with bacon, and the brisket and gravy. I was a little skeptical about the brisket and gravy and even though I didn't order it it was probably my favorite thing. <br>Once you're done you pay at the counter which I appreciated since we were in a bit of a hurry. <br>Overall it was a fantastic brunch and I will definitely be back when we visit Chicago again.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wc8TTYe_7kwPUZT_SpYVFg/348s.jpg", "caption": "Ice coffee"}]}}, {"review": {"des": "I came here with friends before going to a Cubs game. A server at the Green Door Tavern recommended it to us. We all ordered Bloody Mary's, which were spicy and delicious. The service was very good and the staff very friendly, but it did take a long while to get our food. We had plenty of time, so it wasn't bothersome, but if you're very hungry or in a hurry, this may not be the place. <br><br>I got the breakfast sandwich. Usually chicken sausage is a bit dry, but this was not at all. The sandwich was super flavorful with cheese, arugula, and pepper jam. I requested my egg be medium instead of over-easy, and it came out perfectly. The potatoes that come with it are mashed, which seems a bit different for breakfast, but they were soooo good. Everyone in my group really liked their food. It is maybe a bit more than moderately priced; for a Bloody Mary and the breakfast sandwich, my bill was about $24. I felt the meal was well worth it.", "pics": null}}, {"review": {"des": "A definite jewel of the Southport neighborhood. Expect hour+ waits on the weekends during brunch hours as this place is small and they don't have much outdoor seating, but well worth the time - shop around the neighborhood and get to know it a little bit. <br><br>We ordered: Old Fashioned Mimosa, Mimosa, Hash, Mushroom Melt, and Cupcake Pancakes and they were all fantastic. A little pricey, but all ingredients and produce are fresh and local so I am willing to pay for that. Server was great and attentive.<br><br>The only negative of the entire experience: they lost our name on the list (claimed it had been cancelled even though I had no notifications on my phone), but they promptly sat us when we returned to ask about our table.<br><br>Highly recommend this place for vegetarians!", "pics": null}}, {"review": {"des": "The best brunch I've ever had. And I love brunch. We shared the chicken sausage/egg/tomato bruschetta (highest quality ingredients--how are the tomatoes so good?!), grown up pop tart and pull-apart pancakes, which tasted like the most amazing, decadent cinnamon monkey bread I've ever had. The grocery is a cute stash of different rubs and salts and garnishes for cooking/baking. Go during the week if you don't want to wait for a table. This place is understandably popular.", "pics": null}}, {"review": {"des": "This little spot is so consistently phenomenal. Clark and I ordered carry out this time around and picked up our breakfast sandwiches on our way to watch the Browns finish out their (heartbreaking) season. We couldn't wait the hour+ wait to sit, but we were dying for those homemade English muffins and sausage. <br><br>Clark picked up the food while I grabbed coffee down the street and we snacked on our breakfast inside the Southport Brown Line stop. They didn't include any utensils or napkins, which we seriously needed (the egg is a perfect medium fried egg, so it's still runny, but not overwhelming), so that proved a bit of a challenge. I think we were both so hungry and excited to be eating the food that we didn't care all too much. (I even stuck my bare finger in the red potato mash for a little taste because I just had to.) Even the cheese stayed melty on the sandwich despite Clark's walk from SPG to the Brown Line! I was delighted. <br><br>Would you believe the adult pop tart was easier to eat than the breakfast sandwich? I think it was my favorite one too...blueberries, this time of year. <br><br>I love that SPG continues to provide such fond, funny memories with their delicious and tasty and perfect and yummy and incredible food.", "pics": null}}, {"review": {"des": "We came here on a Saturday afternoon in the summer. Around 1pm, there was a wait for the outside section and the inside was wide open, and for good reason, since the AC was broken. I order the breakfast hash and I ask if I can add in spinach. The waiter went to the kitchen to ask and apparently, adding spinach to a dish is not allowed.... Strange but okay, still giving it a shot. The almond milk is an extra $.75 and the vanilla was another $.75 to go with my iced coffee. About 25 minutes so by and we've only gotten our coffees when the waiter asks us how everything is. We have literally no food on the table so this question is impossible to answer. Finally after almost an hour our food comes. My hash is French fries with bacon and an egg in a bowl. Mind you, this \"dish\" is $14. See picture for proof. <br><br>On our way out, the girl at the register is completely soaking wet. I asked her if she was sweating or if she spilled. She replied, \"Neither, the AC is broken to I poured cold water all down my shirt to stay cool.\" Since when was that okay to do, and then help customers?<br><br>Will never be returning here. Horrible food. Over priced. Not even worth grabbing a coffee. Sad to say this since we live in the area.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/R5dT1sc0deIKVOvvzsUq9A/348s.jpg", "caption": "Breakfast \"hash\""}]}}, {"review": {"des": "Great place for good food with a twist on traditional breakfast. Sampled brisket and gravy, cupcake pancakes, and stuffed french toast. All good but cupcake pancakes were outstanding. Adult drinks are good too.", "pics": null}}, {"review": {"des": "Neighborhood feel with an interesting blend of grocery store and brunch spot.  The environment was eclectic which matched the menu selection.  <br><br>I went for the chicken and grits, which was a grazed chicken thigh over well seasoned grits and a sunny side egg on top.  I had a biscuit on the side with Metropolis coffee as I waited on my order.  <br><br>The food was good but I was slightly disappointed there weren't any muffins available at 11:30, but when pastries are made fresh, it's to be expected.  This along with my critical judgement of brunch food is what resulted in 4 stars. <br><br>Pro Tip - <br><br>You pay at the register.  Pick up your table number given to you when you sit down and take it to the front when finished.  <br><br>I would come back.", "pics": null}}, {"review": {"des": "The gluten free pancakes and desserts are reason enough to visit every time I'm in Chicago. The location is perfect and so is the service.", "pics": null}}, {"review": {"des": "I loved this place! The wait in line was long, but def worth it. I ordered the stuffed French toast which is new on their menu and it was good, but once you taste their bread pudding pancakes... You will think every one of their dishes is sub par. The bread pudding pancakes are gooey and melt right in your mouth. It's not undercooked!!! That's the common misconception people have about them, but they are cooked to perfection. Go to Southport Grocery & Cafe for bread pudding pancakes!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fBgiZRfTnC4uqz5JrRpsXQ/348s.jpg", "caption": "Stuffed French toast were good, but bread pudding pancakes are the way to go!"}]}}, {"review": {"des": "From the time we arrived this morning at 9:50am with 6 open tables to the time we received our cold breakfast took more than an hour and a half.  Ice cold chicken and grits, stale/cold bialys, warm mimosas and $30 later. TERRIBLE   <br>Poorly managed, poor service, I don't understand the good reviews, really and truly don't.  This place would fail in a month if it were in the suburbs.", "pics": null}}, {"review": {"des": "I got the Our Club for take out (turkey, bacon, avocado, apricot compote on challah). The sandwich very satisfying - a decent size and jam packed with turkey. The mashed potatoes as a side were also a great choice :) Inside they have a lot of different food options for purchase, including dressings, jams, spices, etc. They have very unique products - things you wouldn't find in a normal grocery store.<br><br>This is my second time coming to Southport Grocery and it's a delicious, quick option if you're on Southport. I will definitely be back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ADiqI5hbIwOjs-S6XhY_lg/348s.jpg", "caption": "Our Club (turkey, bacon, lettuce, tomato, avocado, apricot compote and mayo on challah)"}]}}, {"review": {"des": "I love this place for both food and special groceries. The food is consistently delicious. Definitely recommend for breakfast or lunch!", "pics": null}}, {"review": {"des": "Best brunch I have ever had in my life!! Food is amazing and the quaint ambiance of the restaurant is fantastic!!! I would definitely recommend to a friend and will be going back very soon!!!", "pics": null}}, {"review": {"des": "This is a cute, trendy little place. Small outside patio and limited, close seating inside. Hubby and I started with the chipotle chicken soup (we were disappointed that it was just a simple vegetable soup) and shared a club sandwich. The sandwich was good and I liked the chipotle mayo (pretty sure that's what it was...) that they used. It was plenty big to share. <br>Hubby liked their motto and thought they did it well \"Modern, simple, fun\"", "pics": null}}]}