{"name": "spacca-napoli-chicago", "reviews": [{"review": {"des": "Aimee's review.  Telegram style.  You know, if they still sent telegrams. <br><br>Get the Burrata stop.  Try one of the specials, or all of them if you're there with a group stop.  And the desserts stop.  You have to try at least one of the desserts stop.  If it's nice outside, sit outside stop. Stick around even if they quote you a 45 min wait stop.  Because it might not be that long, we only waited 20 stop.  Please stop here and have pizza. Stop. <br>For real. Stop.", "pics": null}}, {"review": {"des": "Well, I gave an another chance, 2 years later. Same disappointment.<br>The dough was too soggy and too chewy. It was soft enough to be folded, but not enough firm to stay folded, how it should be. I guess the flour and the water in the US doesn't give the same results as the original.<br>Ingredient were good. The mozzarella di Bufala was great, but they don't make it.<br>I won't go anymore.", "pics": null}}, {"review": {"des": "The last time I went to SpacciaNapoli was sort of disappointing. I had an 8:30 reservation with my parents and boyfriend. My parents were visiting from out of town and I'd really hyped up SpacciaNapoli to them. I knew that the kitchen was closing at 9, but I wasn't prepared with how rushed we were. Our waiter is a nice guy, I've had him before there a few times, but he pushed us through really, really fast. Like we had no time between courses at all, he tried to drop the check at least twice not bothering to ask if we wanted dessert or coffee and seeming disappointed that we did. The bussers were really hovering, like ready to pull the plates away the second we put our forks down. They were really nice too but young and maybe less focused on making us have a nice night than on getting out. We were sitting in one room right next to another room that had cleared out and before we finished our pizza the bussers started loudly putting up the chairs and moving the tables, which I felt bad about because then I could tell that my mom and dad felt uncomfortable. <br><br>I get it that people want to get home after work. But we were out by 9:20. I don't think 50 minutes is an unusually long time for 4 adults to have dinner at a restaurant. If it was so critical for everyone to be actually out of the restaurant right after 9, I would have rather had the manager say something like \"just so you know we do a hard close at 9 so why don't you come in earlier or come in on another night\" when I made the reservation. That way I would have known what I was getting into. He did say that they closed at nine but I didn't realize that meant like.... you have 30 min to eat and drink. I thought it meant like, you should have non-dessert food orders in by 9. <br><br>The pizza is still the best in the city so I'm sure I'll be back, and in general the service is great plus they have the best southern Italian wine. So, I guess bottom line: if you're planning to do wine/dinner/dessert, make sure you don't go for a late reservation unless you don't mind rushing really fast. From now on, if it's later than 7 I'll go somewhere else.", "pics": null}}, {"review": {"des": "This place is so good, I went there 2x in one week the week I discovered it! The burrata special is out of this world! The hazelnut gelato is the best I've ever had (including Italy). The pizzas I tried were all bomb. And the service is great. 100% recommend!", "pics": null}}, {"review": {"des": "For the love of pizza! This place was amazing and everything I was hoping for. The food and customer service was superb and definitely kept me wanting for more. I went here on a Saturday night and it was crowded. The wait was supposed to be 40 minutes or longer but ended up waiting 30 minutes instead. While we waited outside for open tables, the staff passed around a sample of their burrata which already set the tone on how good this place was going to be.<br><br>Once seated the server goes over any specials of the day and answer any questions about the menu. I ordered the melanzane- roasted eggplant with tomatoes, basil, and garlic...amazing! They have a wide variety of pizza flavors to choose from. The pizza of choice was the porcini e carciofi which consisted of mushroom, artichoke, and parmesan which was also very tasty and filling. The pizza does take awhile to cook but that's what the appetizers are for! Also don't forget to grab a dessert on your way out, they gave away free canoli  that were also very good. I'm already looking forward to my next visit and savoring the other pizza flavors and toppings.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TGX2ey-gYxb38I1xjrT6rg/168s.jpg", "caption": "Porcini e Carciofi-mushroom, artichokes, parmesan"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qiQHl5Fug3jnazTlH-X2CA/168s.jpg", "caption": "Melanzane-eggplant w/ tomatoes, basil, & garlic"}]}}, {"review": {"des": "This place does pizza right. [please don't throw things at me, Chicagoans, who argue that deep dish is the only way to go] <br><br>I've been here several times, and each time have devoured several slices of usually two different kinds of pizza. <br><br>We've gotten the traditional, the super cheesy with some kind of classier burrata or mozzarella, and occasionally something even a little more exotic. (I will always choose the pear on pizza if a place has it.)<br><br>What's more, is that one time I was here and they had tiny complimentary cannolis as you left. YUM. I already love cannolis when they're done right, and if they're done right and are free...I mean come on. <br><br>The pizzas range from $12 to $18, and 2 pizzas is plenty for 2 people. <br>Affordable, delicious, thin and slightly addictive.<br>Crap. Now I want pizza.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JiF1Krsf42ObzAoaCK_muQ/168s.jpg", "caption": "Tomato, mozzarella, basil ~ delish"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MG9webWKM4dnf7yRZo1ebA/168s.jpg", "caption": "6 cheese pizza"}]}}, {"review": {"des": "This restaurant saved a perfect Father's day.<br><br>So it was Father's day.  There was this pizza place that my daughter agreed we would go to just for me, after we had been to an art fair.  Had been there ages ago and arriving, we found it was forever closed!  So disappointing!<br><br>We scrambled and finally casted about to find this wonderful restaurant.<br><br>Salad, wine, pizza!  Can't beat it!<br><br>The pizza had a crust that had that sort of soft, crunchy edge.  <br><br>Our pizza of choice was the Diavola with blended San Marzano tomatoes, fior di latte, Calabrese soppressata, and basil.  Superb!<br><br>Sat outside on a sweltering day.  Nice setting, very nice!", "pics": null}}, {"review": {"des": "Best neapolitan style pizza in chicago, I know Yelp shows just this one check in but I've probably been here 30 times in the 3 years I've lived in Chicago.<br><br>Nothing seems to beat Antico in ATL, but Spacca comes real close. Get the spicy sopresotta one and enjoy the crisp crust and the gooey soft insides. A texture match made in heaven.", "pics": null}}, {"review": {"des": "Best Neapolitan style pizza in Chicago indeed. The wait was supposed to be 30 minutes or longer but ended up waiting 20 minutes instead. Customer service was superb but can come off condescending when explaining items on the menu. I might not look I Italian but I spent a lot of time in Napoli.  We had the Bufulo and Daviola pizza and, of course, Buratta appetizer. This place keep busy... Definitely worth a try.", "pics": null}}, {"review": {"des": "We came here for a birthday celebration. What a cute place! Definitely has the \"family owned\" vibe! There were enough of us that we were seated in a private area in the back and it felt like we were sitting at a gigantic family dinner table. The food? Really awesome. We had the mushroom pizza and, of course, buratta appetizer and spumoni dessert. Everything was to die for. Highly recommend!!!", "pics": null}}, {"review": {"des": "Best. Gluten free pizza. EVER.<br><br>I came here for lunch with a friend and was totally blown away by this unassuming neighborhood spot.  When you've been gluten free for as long as I have (9 years, but who's counting?), you get used to subpar food.  You know how sometimes gluten free pizza is really small?  Or it tastes like a cardboard cracker?  Well, thankfully that's not the case here!  Spacca Napoli's gluten free pizzas are legit, doughy, and truly Italian-style, and they're absolutely delicious.  Initially, I was scared by the disclaimer at the bottom of their menu recommending the gluten free pizzas to only people who make it a \"lifestyle choice,\" but I'm happy to report that this sensitive celiac had no reaction at all!  And there were at least 15 different pizza varieties plus three on the specials board, so you can be I'll be back here ASAP to try more. <br><br>My only regret?  Not checking this place out sooner!  The service was great, and I loved the little pizza cutters at each table to cut your own pizza.  If you're gluten free, run -- don't walk -- to Spacca Napoli. This is the best gluten free pizza I've had in the entire country, hands down.", "pics": null}}, {"review": {"des": "I've always heard good things about Spacca Napoli, and after trying it, it rivals some of my favorite pizza in Chicago. We arrived for lunch on a Saturday at 12:30pm and easily got a table. By the time we left at 1:30pm, there was not an empty table in sight!<br><br>Fried Aranchini- they have a daily fried street food, and the special for today was aranchini. This was perfectly seasoned with the right amount of salt and sauce in the rice balls to keep them moist. <br><br>Sausage and Mushroom pizza - deliciously tender crust with a few charred bubbles. Good amount of sausage and mushrooms. Most people get their own pizza but my husband and I felt we could share just one since we got an appetizer.", "pics": null}}, {"review": {"des": "Simply AUTHENTIC fresh ingredients from farm to table. <br><br>Margherita, Calzone, and Diavola is what was on my menu tonight. <br><br>I would suggest eating the pizzas first to allow the flavors to merry together in the Calzone and finish with that last. <br><br>That's what I did, and the Calzone flavor took away the pizza flavors immediately from my taste buds. It was like a mint after dinner. Very satisfying. <br><br>The BEST Tiramisu I had thus far in Chicago. I went to classy places and ordered it but they didn't even come close to this places tiramisu. A must have!!!!<br><br>Panna Cotta need I say more? Light and refreshing end to the massacre tonight. I would choose this over creme brûlée any day.", "pics": null}}, {"review": {"des": "Is it just me, or is everything delicious loaded with calories and/or unhealthy? <br><br>If I ruled the world and everything in it. .. I'd make pizza, burgers, wings, mac n' cheese, pork belly, BBQ, ice cream, beer and brownies the staples of a nutritious diet. Spacca Napoli pizza would eliminate belly fat and promote being svelte in general (shout out Ju).<br><br>The pizza here is good. Really really good. From the salty-chewy-slightly charred-brick oven baked crust, to the flavorful yet balanced San Marzano sauce. Mozzarella isn't usually flavorful, but this hand pulled cheese helps make this one of the more authentic pies you'll find. My favorite is the Diavola with added sausage. It has just the right amount of heat to balance the rich cheese and buttery crust. <br><br>My only criticism is the crust being a little too weak to hold the toppings especially when it's piping hot from the oven. Not a deal breaker for me. If you're in Chicagoland & an avid pizza lover, Spacca Napoli is worth a special trip.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/83LQrCT05YtkgegOVNnT-A/348s.jpg", "caption": "Diavola | blended San Marzano tomatoes, fior di latte, calabrese soppressata, basil"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Vv9K3MoH_T1gfUmGGceBVA/168s.jpg", "caption": "Prosciutto e Rucola | prosciutto crudo, arugula, parmigiano reggiano, olive oil"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JlH0MFaiojbZxSuTOZHKnQ/168s.jpg", "caption": "Prosciutto e Rucola | prosciutto crudo, arugula, parmigiano reggiano, olive oil"}]}}, {"review": {"des": "Everything was great until I saw a cockroach. We informed our waiter and he didn't really react and just brought us our check. We then informed the front desk and she said \"it's just a water bug our owner knows about it\" - which is actually a form of a cockroach when I googled so???? <br><br>We were still charged for our meal too. Very disappointed.", "pics": null}}, {"review": {"des": "BEST PIZZA EVERY!!!!<br>This is the place to come to in Chicago for the BEST Napolitano style pizza period!<br><br>The restaurant is easy to find, street parking available. The staff is very friendly, accommodating and knowledgeable. The pizza is super fresh quickly made and amazingly delicious.   There are daily specials from antipasti to pizzas.   <br><br>Hands down best pizza for brick oven style !!", "pics": null}}, {"review": {"des": "I fell in love with this pizza years ago. It makes my mouth water even thinking about it. During a trip to Greece and Italy, we chose to go to Naples over Florence simply because I needed to see is Spacca's pizza is as good and comparable to the mother land. In one day in Naples we tried three different pizza places, and Spacca was the exact same as two and much better than the third. Reading the negative reviews on here has my mind blown. People complaining about the crust not being crispy simply don't know what Neapolitan pizza should be, because Spacca makes the absolute perfect pizza every single time.", "pics": null}}, {"review": {"des": "Everyone raves about this place and it's gotten media attention too so I had to try it myself - I mean who doesn't love great pizza? Stopping in at 7:00 pm it as crowded, but there was no wait for a table of two. Service was great from all of the staff. Food came out pretty quickly even though it was a steady night, which is great because we were starving.<br><br>I was a little disappointed in the pizza. The crust was only okay, and in the center of the pie, it was even a bit soggy and too floppy. The crust wasn't undercooked, but it just didn't have the kind of crispiness I was hoping for from a pizza made in a wood fired oven. You do get a *bit* of the wood fire oven taste in the crust, but not a lot.<br><br>The tomato sauce was very sweet - I don't know if it's because the tomatoes were especially sweet or because of sweetener added, but I did not really love the taste of the sauce. A fair amount of sauce could've been what made it slightly less crisp than I would've liked - especially in the center of the pie.<br><br>I think people love this place because Chicago doesn't have as many great pizza places as other American cities. So in a land of deep dish (which is actually just casserole, don't let anyone fool you otherwise) and \"thin\" crust pizzas that actually aren't that thin at all compared to Italian and New York or New Haven style pizza, coming to a place like Spacca Napoli, which strives for authentic Neapolitan pizza, is definitely a welcome change for many. I'm just not sure it was great enough for me to go back. But I'm glad I tried it so I could taste for myself.", "pics": null}}, {"review": {"des": "This has become a default go-to place after seeing productions at Black Ensemble, which is just a few blocks east of here.  My friend turned me on to both BET and this place.  I've been here several times, but only on Sundays when parking is plentiful and free on Ravenswood.  Good luck trying to park if you come during the week, or on Friday/Saturday.<br><br>They don't have an extensive selection, it's not \"traditional\", and might be what some consider on the high side for what,to me, is an individual sized pizza, but what they do is done very, very well.  Nice outdoor patio too.", "pics": null}}, {"review": {"des": "Came here with 2 other friends and glad we were seated before the rush. We tried 3 pizzas: Enzo (smoked mozzarella/ parmigiano regiano/ buffalo ricotta) Funghi e Salsiccia (mushroom and sausage), Prosciutto e Rucola (proscuitto/arugula).<br><br>I enjoyed all 3 pizzas. The crust was perfectly chewing and there's a brick oven in the restaurant so you can see your pizza going in and coming out right in front of you. Plus, free cannoli on the way out!", "pics": null}}, {"review": {"des": "I've had 5 different pies over two visits. They ranged from good to very good. The arancini is good but they don't serve any marinara sauce with it, which is the usual presentation in my experience. The wine is pretty much a rip-off, a 3 ounce pour of mediocre red for ten bucks.", "pics": null}}, {"review": {"des": "A local brought me here many years ago and I was happy to return. The restaurant is a bit off the beaten path (in a residential neighborhood about a 15-20 min cab ride from the heart of downtown) but the journey is worth it. Because we got stuck in traffic, we arrived well after our reservation time but the host was very gracious and sat us after a quick wait.<br><br>Spacca Napoli serves truly an authentic Neapolitan pizza! I started with the octopus appetizer and the pizza alla diavola (both pictured...and both delicious! <br><br>Because of dietary constraints, we also tried 2 of the gluten-free pizzas (Spacca Napoli will make any of the pizzas on the menu with gluten-free dough) which were also good for what they were.<br><br>For dessert, split the panna cotta and raspberry sorbet which were great with each other. No doubt I will return if I'm craving great pizza when I'm back in Chicago.", "pics": null}}, {"review": {"des": "I would love to give it 5 stars but we had to wait FOREVER to be seated, then waited another forever to be served. My beer was served kind of warm, not like my friend who got the same beer super chilled... Pizza was FABULOUS  however!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/81er3lWdo0gUEGMxct_Nlw/348s.jpg", "caption": "Funghi Pizza!"}]}}, {"review": {"des": "This is more of that gourmet \"old country\" pizza that seems to be the flavor of the day, those little circles of crust with a smidge of sauce wiped across in a thin veneer, a sprinkle of cheese on top of that, and, like, three spinach leaves unevenly spread across six tiny slices. Which is all fine, of course, given that's what you're in to (though other spots do this  better). These are essentially personal pizzas and pretty pricey for what you get. The service, the location, and the interior/exterior dining areas are all top-notch, though. Maybe that's what we paid for.", "pics": null}}, {"review": {"des": "Not surprised to see this place crowded,. Wow, the quality for Margherita pizza was sooo good! <br>Best drive munching on this delicious, fresh firewood pizza.", "pics": null}}, {"review": {"des": "Okay - so I know there are a lot of people who LOVE this place. But, I rate a place on more than just the food.  <br><br>Pizza aside - ok.  It is Napoli styled pizza made from a brick oven.  The pizza choices are decent and fine, tasty enough.  But, my dining goes beyond that. <br><br>I have been here a couple of times and I doubt that I will return.  The place just isn't comfortable.  The restaurant is loud. I like my Italian dining experiences to have proper wine glasses and decent sized tables.  The arrangement of the front of the house seems to be unorganized and if you are stuck at a table in the middle of the room you always feel like you are in the way.  I hate to be snobbish about the wine glasses because I get that they are trying to be old style and maybe european.  <br><br>It just does not do it for me. I think part of the problem is that I had heard raves about this place and when I got there - was underwhelmed.", "pics": null}}, {"review": {"des": "This is the best \"fancy pizza\" place I've ever been to.  I'd give them five stars if I was a fancy pizza kind of guy.  The quality of the ingredients really make the pizza pop. I've never had such delicious tomatoes!  Also, order the burrata, you can't go wrong.", "pics": null}}, {"review": {"des": "I'm not the biggest fan of pizza, but this place had me sold! Just the simplicity of everything really brought out the flavors. The pizza here is definitely not a deep dish pizza and it's not over load with sauce. <br><br>We had the burrata as an appetizer and it was amazing! <br><br>We both ordered the diavola since my friend didn't want to share and I couldn't make up my mind. Hands down I'm glad we both got our own. It had blended San marzano tomatoes, fior di latte, spicy salami, basil, and some chili powder.", "pics": null}}, {"review": {"des": "First I would like to say that the owner was nice to me and my family.<br><br>The Hostess was not accommodating at all we had a family of four and were seated at a very small table, with three and nine year old just wasn't enough space to relax and eat.  <br><br>The pizza was not authentic Naples, we spent several years in Italia and was very disappointed in the food and service the hostess is the face of a place and we felt un welcomed by her. Better tables were available in a big space that was completely empty but we were told \"sorry those tables are  for people that call in reservations so we suffered for room and comfort.<br><br>The food came and we suffered again. the crust was not fermented well, the sauce was salty and tasteless and the cheese was sour. the orange drink recommend was very sweet, so in essence.<br><br>The experience was not what I expected it was very unwelcoming from the moment we stepped in the  door and that turned us off from the start.", "pics": null}}, {"review": {"des": "I am a pizza fanatic above and beyond what most would consider to qualify for that statement. And of all the various pizza styles, true\"Neapolitan\" Pizza requires the most finesse & attention to detail as well as the highest quality ingredients (hence why only certain places earn the true VPN certification).<br>After dedicated study and apprenticeship in the pizzerias of Naples, Jonathan Goldsmith opened Spacca Napoli, which is the best pizza I've ever had. And I've had a LOT of pizza & can go into great detail about what makes each one good or bad. This one is authentic Neapolitan, so it needs no explanation. It's as good as Neapolitan gets. That's that. Best pizza I've ever had ANYWHERE. Including NYC & I travel there a lot & i've had almost all the greats there (of which there are MANY more than Chicago mind you), but Spacca Napoli is just pure magic.", "pics": null}}, {"review": {"des": "Always an amazing experience at Spacca! Ordering the burrata is a must. I've dined in here several times and have always enjoyed the food. <br>One Friday evening we ordered carry out (you have to order in person) and while we waited they gave us a complimentary glass of prosecco and fresh bread with olive oil. They also give you a cannoli on the way out. <br>Love this neighborhood spot!", "pics": null}}, {"review": {"des": "Absolutely loved the airy, chewy Neapolitan style pizza dough here! The pizzas do remind me of the ones I had in Italy that I still dream about. I tried the Funghi e Salsiccia (mushroom and sausage), Enzo (smoked mozzarella, parmigiano regiano, buffalo ricotta) and Prosciutto e Rucola (proscuitto and argula). They were all, quite frankly, equally delicious. My personal favorite is the mushroom and sausage one. Each bite is a burst of freshness, the simple ingredients bringing out the flavors of a real, authentic pizza. <br><br>This is your place if you need to take a break from deep dishes, and just want to enjoy the simplicity of a light, thin-crusted pizza.", "pics": null}}, {"review": {"des": "Let me preface this review by saying I can't tell you how happy we were to find this Neapolitan gem in Chicago. What a wonderful restaurant.  We made reservations for an early dinner before a concert. The restaurant was not very busy at this time so we got a table inside near the window. They also offer outside dining when the weather is good.  We started our meal with mozzarella and prosciutto. Perfect, salty and delicious. On a previous visit we had the special appetizer - fried zucchini flowers stuffed with cheese and peppers - which was out of this world. For dinner I had the margarita and he had the prosciutto and arugula pizza. They are the real deal with the crust. This is as good as pizza gets.", "pics": null}}, {"review": {"des": "Not much to add to what was already written. Great dough - has the nice salty-chewy taste/texture similar to what I tried in naples. the marg was well balanced and worked. Felt slightly soft at parts but still good none the less.<br><br>They have a lot of other pizza with a bunch of toppings. I had a mushroom one that was just ok. I would just stick with the simpler ones.<br><br>Burrata is really good. Nice big creamy piece. 16 bucks but I don't know where you'll find this quality anywhere else.<br><br>Also had the eggplant app which is a huge portion. Also recommend.", "pics": null}}, {"review": {"des": "I've been to Spacca Napoli a couple of times now. The pizzas are always delicious, soft, and chewy! On the server's recommendation, we ordered the burrata appetizer. We also ordered the octopus. Both were great!  Spacca Napoli is becoming one of our regular spots!", "pics": null}}, {"review": {"des": "The best pizza! The oven is real deal and the kitchen is very cool! Service is also great staff is professional.", "pics": null}}, {"review": {"des": "This is our favorite Chicago pizza place! We have tried many pizzerias but there is nothing like this one. It is usually busy so I highly recommend calling and making a reservation. They don't have delivery and if you want take out you have to go order the pizza and wait until is perfectly made to take home! Either way if you eat at the restaurant or take it to go it is amazing and will make you tummy very happy!", "pics": null}}, {"review": {"des": "GO TO HERE!!! So delicious! My celiac and gluten free people, I've had gf pizza all over the place and this is the best! The crust was actually chewy! Not sure how they do it, but it's magical. And the cheese is amazing! And the soppresata is amazing! Loved the patio and the server as well. My non gf dining companion loved it as much as I did. Worth a drive if you're not nearby. Seriously. Get a little of the chili oil to dip your crust in if you like spicy. <br>We had the tortufo for dessert and it was fabulous as well.", "pics": null}}, {"review": {"des": "I had the biggest chunk of burrata in my life here. Then, I got a white pizza special that had even more burrata. It was freaking delicious - I may have regretted my burrata gluttony afterwards, but you know what, it was still worth it. <br><br>The service was great and the bread they served up before the food came out had the perfect crunch level (I ate a lot of bread with the burrata). I really liked the pizza as well - my white pizza had truffle and ham and it was just so wonderful. I'm reliving my burrata coma just thinking about it...", "pics": null}}, {"review": {"des": "Meh....this is chicago there is much better pizza on every corner than this place. It's basic and has an interesting menu but honestly don't waste your money.", "pics": null}}, {"review": {"des": "I've heard wonderful things about Spacca and it's been on our list to try since we moved down the street 1.5 years ago!<br>We finally made it over on a whim for a late lunch and it was delightful!<br>We started off with burrata for our appetizer, it was not what I expected but it was very delicious! The cheese is cold on the inside, drizzled with olive oil and served with crusty bread.<br><br>I don't even know what pizzas we tried but they were so good!<br>I can't wait to come back again & try other pizzas!", "pics": null}}, {"review": {"des": "This is by far my favorite pizza place in Chicago. Simple and perfect. Neapolitan style, perfect fluffy outer crust and thin bottom crust. Toppings are yummy and not greasy. Great date spot or with a friend.", "pics": null}}, {"review": {"des": "Still the best. This is not a Chicago vs. NYC pizza battle kind of place. This is genuine Italian pizza (among other fabulous appetizers and entrees), and it is FABULOUS. Everything is fresh, house made, so very, very good. Interestingly, one of the best places for fresh anchovies I've EVER been to. Great for a date, AND a reasonably large (10?) gathering. In the warmer months, dining is both inside and outside.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ID2p3BpHkErAAqq_Y60UmA/348s.jpg", "caption": "Go here. Eat here. Get a pizza here..."}]}}, {"review": {"des": "OMG. You guys. This place is unbelievable.<br><br>My dude and I had the octopus (YESSS), the prosciutto and mozzarella (HELLO GLUTEN FREE CROSTINI), and the pistachio pizza (gluten free). It was STUPID good. I could not stop eating. <br><br>I just got a new job, and that's great, because I live way too close to this place and I'm gonna give them all my moneys.", "pics": null}}, {"review": {"des": "THE ABSOLUTE BEST PIZZA IN ALL OF CHICAGO.<br><br>- Pizza tastes the best<br>- BURRATA<br>- Daily fresh specials<br>- Patio during the warmer months<br>- Complimentary after-dinner cannoli<br>- Glass of Prosecco if you're waiting for takeout<br>- I can walk to Spacca Napoli*<br><br>*This may not be the case for you, but I'm fortunate. Well, *I* am fortunate, not really my adult metabolism.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/u5059G87HOzpNLKpo7EAgQ/168s.jpg", "caption": "pizza sul patio"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/B2Zy9BQ8aC1wRg1wNnKzAw/168s.jpg", "caption": "margherita forever"}]}}, {"review": {"des": "Spacca Napoli is an adorable neighborhood gem. It is bright, welcoming and the pizza lives up to its reputation. Wouldn't hate if there was a bar to sit in, while waiting for a table, but the pizza was so good; it still got (5) stars in my book. <br><br>Now, on to the 'za...<br><br>*If pistachio pizza is your jam, order (2). This pizza flew off the table, definitely the crowd favorite. The house made tiramisu didn't disappoint, either. I can't wait to go back to try more of their options. <br><br>Key Tip: Make a reservation, don't try to walk in there without one, as you'll be waiting awhile. :)", "pics": null}}, {"review": {"des": "Superb! Absolutely superb! <br>Get the spicy pizza!!<br>Don't hesitate to stop by. You won't be disappointed :)", "pics": null}}, {"review": {"des": "Visited on 11/17/2017.  After growing up in the suburbs and then living in Chicago the last six years, I always considered myself a deep-dish guy.  Lou Malnati's has been my favorite, as well as my first recommendation for any out-of-towner wanting to try the Chicago-style pizza experience.  There have been a couple of strong challengers that have come close to knocking Lou off of his pedestal (e.g., Piece Brewery & Pizzeria, Chicago Pizza & Oven Grinder Co.), but now I believe that Spacca Napoli has finally conquered my pizza throne.<br><br>Three of us ordered a different pizza so that we could share and try two slices of each style (which seemed excessive at first because I'm used to feeling stuffed after two slices of deep dish, but I guess every pizza is a personal pizza if you try hard and believe in yourself.)  First, the Diavola was the most popular pizza on the menu and had a perfect, spicy kick to it.  Second, the Salsiccia was more traditional and what you would expect at an Italian restaurant.  Finally, the Pistacchio was the most unique, and quite possibly the best sausage pizza I've ever had.<br><br>It sounds like blasphemy, but the next time a friend comes to visit, I would rather recommend any of these authentic Italian masterpieces over the traditional Chicago-style deep-dish pies.", "pics": null}}, {"review": {"des": "Ok, so my 3 stars is pretty much because the pizza was so delicious.  We had reservations for 3 of us on a Friday night and arrived to throngs of people waiting in and outside. Obviously a popular place.  They don't seat you until your whole party is there and I think they may have a 10 minute limit on holding your reservation (check on that!) so be mindful.  We got seated and it definitely took about 10 minutes for our server to even stop by.  <br><br>We ordered the misto salad, a bottle of red wine and 2 gluten free pizzas.  The misto salad was fine, nothing special.  A little to vinegar-y and needed a touch of salt.  I'm not a huge fan of their wine list, maybe it's just that I'm not very familiar with wines from that Italian region and I think it's a little overpriced. Our wine was ok, nothing to write home about.  The pizzas were delicious and one of our 3 in our party is NOT gluten free and said she definitely would not have known it was GF if she had it blindly.  The margarita with arugula was simple and flavorful.  The other one we got I can't remember, it was actually similar to a margarita but didn't have red sauce (and we forgot to add sausage to it).  The margarita was better, the latter needed a little salt.  But that crust!  So good.  Our server was just not great--not around very much, another young man came to remove our plates and helped by ordering us another glass of wine.<br><br>I'll go back and try other, more adventurous pizzas (and a different salad or app) and hope to get more attentive service next time.  Could give it 4 stars next time if all things align!", "pics": null}}, {"review": {"des": "Stopped in with my wife while in town. We were seated next to four people of which two of the women were drunk, loud and abnormal. We requested our server to be reseated on the opposite side of the near empty dining room. We we rudely told that the \"staff\" was going to use the table that we wanted to eat their lunch. We were given no option but to leave and go elsewhere. I let it be known to the waitress that it must be more important for the staff to eat instead of the customers. If I could give it a zero I would.", "pics": null}}, {"review": {"des": "Walking in the door and checking in a host desk, I see Tony Gemignani Pizza Bible for sale.  Did they attend his cooking school? I am not sure but they they are believers in the faith.  <br><br>The pizza was as expected for a Neapolitan pizza.  A nice char on the crust, a  good chew to the dough.  Overall a great pizza.  Why not 5 stars?  Take a look at the pizza attached to the review.  This was the buffalina.  Buffalo mozzarella with basil.  I think that the cheese is a little lacking, but the shocking part is that there three pieces of basil on there.  Even if you quartered the pizza it would be missing basil.  Not OK.  <br><br>I also had the charred octopus with greens.  That was a health portion an tasty.  <br><br>I would come back.  However I might have to show my waiter the pizza photo to ensure that we don't repeat the same mistake.   <br><br>What did I learn today?  People in Chicago 'respect the craft'.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/o4LY7NN9EQ3OGMJHgClUig/168s.jpg", "caption": "Buffalina.  The missing basil is a mistake."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZBbxK_6PZCwgxNrlp4sFdg/168s.jpg", "caption": "Charred octopus"}]}}, {"review": {"des": "I have never been so insulted by a business in my entire life. For the record, I used to LOVE this place  I hosted my daughters first birthday here. We tried to hold my baby shower here too but they were sadly booked. In the last year, each time we've been here the service has been horribly rude. When we sent to sit tonight my husband was running late and I was with a two year old. I assured the host after he literally flipped out at me that the whole party had to be there. I said I understand but we will still order right now and if my husband comes late he comes late we won't take up a table. Against his best judgement he let us sit. <br><br>then with a party of five (four and a high chair) which seemed tight to begin with. My baby had to sit on a corner where she banged her face into the corner. Then we couldn't fit all three pizzas on the table with room for people to eat. <br><br>Our waiter, god love him, was apologetic. He got the maitre'd who basically shrugged and gave zero f's. So we said fine take our boxes to go and he was literally relieved. I could see the look on my waiters face that he could see his tip go out the window but it wasn't that poor souls fault (we tipped 25% FYI). So he sent the owner over. He cared even less than the host and literally said to us \"that's the way it is\". Never met a bigger prick in my life. <br><br>By the way not only has service gone down but so has Pizza since this place became \"discovered\" but I loved it so much as our old gem. Sad to see it run by people so ignorant to turn away loyal customers for 10+ years. I'm sure it won't impact their bottom line but something for them to consider for the long term", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Dp9CeHnu-EY9mvKrZ5AgBw/348s.jpg", "caption": "Told us a party of 8 was coming at 7pm. Never saw them and we left after 7 so couldn't offer us the large table for six in the corner."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XhGBdS67ssS2pvQnmAWbdQ/168s.jpg", "caption": "Happier times at Spacca Napoli (and yes we dropped ~$500 so probably why)."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3e0QtwdQ3hoVB85rAnDbPw/168s.jpg", "caption": "The empty seat is mine. This is how they sat five people with no apology or offer to wait longer for a new table."}]}}, {"review": {"des": "Shhh, you can not tell anyone about this hidden gem of a pizza place. Yeah yeah, Chicago is known for their deep dish, but ever wanted to try something different? Get ready to have your taste buds blown wide open!!<br><br>I was brought here by my girlfriend who waited a whole year to try this place again. I did not read the menu or anything about it beforehand, I allowed her to choose what we had, and boy was I surprised. We had the Burrata, please for the Love of God, if you are a cheese lover...please order this, you will not be disappointed. It had the hard exterior of mozzarella and the creaminess of soft cheese on the inside. (For a little treat, try a dash of pepper for added flavor)<br><br>We also tried the Pistacchio pizza. Let me tell you, you have never had a pizza like this before. Have you ever thought, \"yeah I am sure I can imagine what that tastes like...\" well this is not that. The base sauce is so creamy with a hint of pistachio. It was not overpowering, but what surprised me, was the nice little chunks of pistachio and the sausage mixed together. A odd mix of flavors that were surprising and delicious. I only wish I had a larger stomach to try other pizzas. Also, I had to update this review because it was so delicious that I forgot to mention, it was a gluten free pizza. <br><br>I am already counting down the days when I can come back again and try everything on the menu, including the Burrata, always the Burrata.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CiQySwRRlXK4-Ed6RFIRnw/168s.jpg", "caption": "Pistacchio pizza :D"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/x6njvKKN5eB0XyE8dH-J1w/168s.jpg", "caption": "Such delicious burrata"}]}}, {"review": {"des": "Chicago is known for its deep-dish pizza, but I compel you to visit Spacca Napoli for some Italian-style pies. Seriously, if you find yourself in the neighborhood, do yourself a favor and try the Pistachio and Sausage pizza. It was so delicious. This place seems to always be packed, and for good reason. Also, something to remember is the small pistachio canolis that are complimentary at the end of your meal- just grab one on your way out!<br>Go here, you'll love it!", "pics": null}}, {"review": {"des": "Been here with my wife and had a great time! Pizza is a must - best napoletan I've had in U.S; marguerita is so good - but there are some other options and specials. We had the ricotta (imported from Italy) and it was amazing. They also have specials daily.<br>My tip is - bring your friends, order many pizzas and share the slices so you can taste the many delicious options.<br>Wine list is good but kinda pricey", "pics": null}}, {"review": {"des": "My partner and I were so excited to try this place that just so happened to be located right down the street from our apartment. With his birthday being yesterday, we took him down to Spacca Napoli to celebrate. A call was placed ahead of time to inquire about making a reservation. I was told reservations were not allowed and the restaurant only did walk-ins. <br><br>Upon arrival, we were greeted by a blonde, very rude and unpleasant hostess. She seemed to be having a bad day, and gave me a disgusting look as I approached her. She stated they'd have us seated shortly. Ten minutes after waiting, another hostess came around and told us that we'd have to wait for other people coming that created a reservation ahead of time. I continued to explain that someone from the restaurant had stated reservations were NOT allowed. She then became extremely defensive and stated we'd have to wait 20-30 minutes, with not a single person or group in front of us. At this point, I was already extremely frustrated, especially with this being a birthday celebration.<br><br>We are finally seated. Our waiter greets, and spews out a million different specials they were offering at the time. He spoke so fast, not one member of our party understood what was said. It was clear he was trying to rush us, so he could leave for the night and close the restaurant. Side note, there were at least twenty other taken tables. <br><br>The whole rest of the evening was rushed and uneventful. Our appetizers were bland and nowhere near the \"taste of Napoli.\" Towards the final course, our server had taken our plates away, grabbed my silverware and splashed oil all over our table, which was already unsanitary. I was appalled. Our main course consisting of pizza was fine. Nothing to scream about. <br><br>To conclude, I would not recommend Spacca Napoli. Not for lunch, dinner, or anything in between. Certainly NOT for a birthday or any other celebration.", "pics": null}}, {"review": {"des": "Come for the patio and the pizza! Great little sidewalk patio, which is always busy and you can't make reservations for it, so expect a wait. I like to switch up my pizza orders, especially if their special sounds good.  Last visit I ordered the funghi and added pancetta, which they don't always have. We also split the melanzane appetizer, which was good but could use a few extra pieces of bread to go with. <br><br>I think their wine list options are okay, but could be better. Also don't fully understand their pricing method on bottles, so we just went by the glass. At about $45/pp it's not a cheap meal but at least you're getting good quality pizza!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hznINsAe6wD4u3q7LbBuMQ/348s.jpg", "caption": "Funghi with pancetta"}]}}, {"review": {"des": "We've eaten on the patio several times before we had our elopement lunch here recently. The team was so accommodating when we showed up a little before opening, they gave us a table right away. Our arancini, pistachio white pizza and margherita pizza were all delicious, especially with the generous prosecco tastes they gave us!<br><br>Such great attention to ingredients and customer service, thank you!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/g1-rB3hFbJqxVIoNquZynA/348s.jpg", "caption": "Pistachio White Pizza & Margherita Pizza Photo by  www.ryangreenleaf.com"}]}}, {"review": {"des": "The owner or manager served me a slice of pizza with a hair in it! <br><br>I also watched a staff member pick a fallen piece of food off the ground and put in back in the serving tray to be given to a customer. <br><br>Really questionable sanitation training Spacca Napoli.<br><br>My octopus was good though, pizza was ok, far far from best pizza I have had in Chicago.", "pics": null}}, {"review": {"des": "It's very hard to find a place that has this attention to detail when it comes to making true neapolitan pizza. They absolutely nail it. I can honestly say this is as close as you can get to the experience of eating a margherita pizza in Naples without getting on a plane. I know people who have spent a lifetime working on this, and it is an art. The pizzaiolos at Spacca are masters, and the service was great, too. Highly recommend, but make sure you know that neapolitan pizza is very different from the slices that most people are used to. It is an experience that is truly unique. <br><br>   Also, they have Gragnano wine by by the glass- it is known as the single greatest pairing for a margherita pizza, but very hard to find in the states. I looked for years and this was the first time I had ever found it. Sure enough, it was delicious and a perfect match with the margherita. Try it out, and be sure to spring for the d.o.p. buffalo mozzarella, it is well worth the upgrade.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MaUmKYiIdwxmMLlonaqEUg/348s.jpg", "caption": "Margherita with mozzarella di bufala. Woodfire magic."}]}}, {"review": {"des": "My favorite authentic Napoli style pizza ever! Most amazing fresh ingredients and flavors. Unique pizza ingredient combination. Perfectly thin but tasty crust to tie it all together. Refreshing Italian wines as well. Overall A+++", "pics": null}}, {"review": {"des": "4 stars for a delicious, filling, authentic, and affordable meal.<br><br>For ~ $25 per person, including tip, my dining companion and I split:<br><br>The caprese salad appetizer - large portion. A wonderfully TANGY fresh mozzerella drizzled with olive oil, cherry tomatoes, and fresh basil leaves. Accompanied with a few thin slices of bread drizzled with oil as well. Note: Tangy. It may throw you off. But we thought it was delicious.<br><br>The margherita pizza - the true way to test how delicious and authentic a napolitano pizzeria is: order a margherita pizza. This one was delicious. Light, cheesy, fresh sauce, just heavenly!<br><br>The bianca con rucola pizza - again, a bit tangy. My friend preferred this one. Very cheesy and delicious. No sauce on this one, just an olive oil base to let the fresh ingredients shine.<br><br>The ambiance wasn't anything worth mentioning. We thought it would have a more rustic look or some character. There was no music playing (okay, there was, but it was so quiet we couldn't hear it), and there was minimal art on the walls. Neutral colors throughout. Everything just seemed to blend together. Nothing stood out to mention. Maybe because we were seated in the far back room? I got a glance of a beautiful wood fired oven on my way out!<br><br>The service was interesting. Our waiter was very thorough with his descriptions. People came by and filled our water glasses - I kid you not - every time we took a sip from them. While it's a nice gesture, it kept interrupting the meal which was kind of obnoxious. Then, as soon as we paid, we wanted to hang around and chat for a bit and there was no water service as we sat there with empty glasses...<br><br>We decided to skip dessert this time around, but they had adorable and delicious, light, melt-in-your-mouth cannoli at the host stand to grab on your way out. A cute, nice touch. Since we sat chatting for a bit, it would have been a nice option to have the cannoli delivered to the table with the check, a la mints at some establishments.<br><br>I was curious to know more about Spacca Napoli. Conveniently, they have a \"History\" section on their website while we read in between courses. I just didn't feel much of that history translate into our experience at the restaurant. That said, I did appreciate the photo of napolitano street pizza - that is, folded in quarters and handed to you in a paper napkin - and showed my friend my photo holding the same thing from my time in Naples not too long ago. Good memories!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iCzj5wo3v-_2qi9Ujfx8zg/348s.jpg", "caption": "Caprese antipasto"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kfzLWZQUbPCeF_dOflGwEA/168s.jpg", "caption": "Margherita e bianca con rucola"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tzarcu2RrSPTiGcrCQ4Z5A/168s.jpg", "caption": "Bianca con rucola"}]}}, {"review": {"des": "Fantastic Neapolitan pizza and tiramisu!! AVPN member so the pizza is authentic. After coming back from Italy I've become an annoying pizza snob and spacca really does it well. <br><br>It's busy so make a reservation.", "pics": null}}, {"review": {"des": "Best pizza I've ever had. PERIOD. We were in town visiting friends and my husband was hankering for a good slice but we aren't fans of deep dish. They knew just the place! <br><br>Wood fired, fluffy crust on our Margherita pizza was just perfect. Loved the sauce and the the cheese, absolutely delightful. You slice your own pizza right at the table which was a nice touch. And when you leave, free cannoli! <br><br>We also ordered the Buratta, which we'd never had before, one of the most delicious apps I've had in a while. Overall this place was just fantastic!", "pics": null}}, {"review": {"des": "I had my worst dine-in​ experience here!!!!<br>We waited one hour for our table to be ready. Finally, ​we got to the table. After we waited for our food and ate​ for literally less than 30 minutes​, the waiter came to us with a really rude attitude​ and told us that we have to leave because​ his next reservation for the table is here. <br><br>We understand that so many customers are waiting to get the table, but we did not even finish our food yet!!!!! Even less time than how long we've waited​ for our table!!! <br><br>For the ​restaurant​ that disrespected​ customers like this, no matter how good their food is, we will definitely​ not come back. We are not the only ones with this issue​ there and please do not come here to eat or you might be treated terribly​ like us.", "pics": null}}, {"review": {"des": "This is by far and large, THEE best Neapolitan pizza in the city of Chicago (dare I say the best pizza PERIOD). Here are some pro tips:<br><br>1. Go on the weekend so you have the opportunity to order the burrata and have a complimentary cannoli on your way out (both of which are only offered on the weekend).<br><br>2. They take reservations. So especially if you're going on the weekend, make one.<br><br>3. Need take out? Fine, but you can't order in advance. Have to venture to the restaurant and order there and wait. Which is absolutely fine because they'll give you a complimentary glass of prosecco while you're waiting. <br><br>4. Order the pesto pizza. Just do it. And need a second one? (which if there is one person consuming it then you will)...get the margherita pizza too. You really can't go wrong with any of them.<br><br>There kitchen is fast, the ingredients are uncompromised, and the food is authentic. This pizza is better than all the pizzas we consumed during our recent trip to Italy. This little gem of a restaurant is a gift to Chicago.", "pics": null}}, {"review": {"des": "Delicious Neapolitan pizza. Very thin and crunchy crust. The burrata, served with olive oil, was creamy enough to spread on the bread. Petite cannolis were displayed at the host stand for customers to eat on their way out. <br><br>Restaurant was almost full as it was a Saturday night. Food was served quickly  and wait staff were attentive. Casual environment - great for a family dinner!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5n49cSTWfoTdA06B1QBWBQ/348s.jpg", "caption": "Pistachio and Funghi Pizza"}]}}, {"review": {"des": "Burrata was awesome.  Creamy cheese. Rustic bread. <br>Pizza was fresh and hot.  <br>The crust was \"soft\".  Expecting it to be a little crisper. <br>Overall value for money. <br>Easy parking and nice neighborhood.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MwC-1fJuUwvlDihJ-hKsAQ/348s.jpg", "caption": "Ok"}]}}, {"review": {"des": "Great Pizza! Get the Pistachio and Sausage for sure. Octopus is succulent and delightful. Wait staff is friendly too.", "pics": null}}, {"review": {"des": "Major oversight.....I was first here years ago on or near my birthday. It was a nice time, great pie etc.  Then today i came, i saw and i conquered. The fried mushroom app was so good, i left asking WTF just went into my mouth. it's from the fried family but tasted like a health food. i would work in their kitchen just to steal a few of these a day. Then the pizza came which i ate by myself, complete with this spicy pepperoni. Their rep is well deserved...but the dessert is where i lost any hope of losing weight. the tiermasu (spelled completely wrong) and chocolate ball was gangster.  And then i came home and slept. I'm pretty sure the mafia does their hits before eating.", "pics": null}}, {"review": {"des": "Two years later, I have to update my review of this place, even though not that much has changed. They still serve top-tier Neapolitan pizza here, blistered hot, lightly topped, chewy, addictive and delicious. And they still have some shortcomings, like the weak beer list and occasional service hiccups.<br><br>The main thing that has changed is that I have been back over and over and over again, always eager and always happy. As of 2017, I think it's the best pizza in Chicago. My wife thinks it might be the best in the country.", "pics": null}}, {"review": {"des": "Simply amazing gluten free pizza. I've never had a crust as fluffy and chewy as this. If you're gluten free, you must try this pizza. Get whatever toppings you want--I had the margherita, and you can't go wrong with that. They offer gluten free bread with the salads too, although it takes a while to bake. There are free cannolis on the way out for all your dining buddies that aren't gf.", "pics": null}}, {"review": {"des": "Great pizza! Service was excellent as well! Try the Orange sparkling fruit drink.....Galvanina.", "pics": null}}, {"review": {"des": "Good lord that burrata was heavenly. I have never seen a more beautiful mound of cheese. The prosciutto, the salad, and of course--the pizza. <br><br>On top of all that deliciousness, it was ridiculously affordable.<br><br>A bit of a snotty hostess, but I can barely remember her face in light of the deliciousness in my belly. <br><br>Five stars? At least. <br><br>Get here. Fast. Invite me.", "pics": null}}, {"review": {"des": "I think Spacca Napoli has the best Neapolitan style pizza in the city.  Always a great crisp yet chewy crust with fresh toppings.  They also always have interesting specials.", "pics": null}}, {"review": {"des": "I'm not sure how anyone could give this place anything but 5 stars! I've been here several times and loved the food and experience every time. The food is phenomenal (fresh ingredients) and the wines are delicious. Highly recommend as a date spot if you like Italian foo.", "pics": null}}, {"review": {"des": "Welcoming atmosphere and staff serving dough topped with cheese. What's not to love?<br><br>It was a friday night and they had burrata, which was not a hard choice to make as a starter. It was fresh and light and creamy and indulgent and delicious. As for the pizza, I love a good doughy, but thin crust that is baked just to that right kind of almost-charred doneness. I tried one of their specials, because it was topped with an egg, and when I was in Italy, I had an egg on basically everything I ate, which was mostly pizza. And I wanted to eat all of it, but after devouring the burrata, and still trying to get my drink on, I was to the brink. I could have though, easily, if it was my last and final stop for the night before rolling my doughy self home. Anyway, I will be back, because I need to try everything on the menu.", "pics": null}}, {"review": {"des": "My bf and I came here for dinner with reservations. We had the burrata and polpo grigliato to start. The burrata, as usual, was light, creamy and delicious. The portion size is a bit large for two people to share, so we made sure to box up the leftovers. The octopus was nicely done and the arugula salad on the side was a nice contrast, but a little too oily. We shared the funghi  e salsiccia pizza which was yummy. We had to pass on dessert since we were overloaded with carbs. But don't forget to pick up a complimentary cannoli on the way out!<br><br>This place makes a great Neapolitan style pizza and I had to take a trip up north to try it out, however, Forno Rosso in the west loop also makes a solid pizza and is in my neighborhood, so that will continue to be my go-to spot.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4sy3kP6GAvUU2IvDEuKB7g/168s.jpg", "caption": "Funghi e Salsiccia"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UD6m6k1s0k4QmHelHv7-eQ/168s.jpg", "caption": "Burrata and Polpo Grigliato"}]}}, {"review": {"des": "I am very dissatisfied and disappointed in this establishment. Not to mention, I'm staving. I came here with a group of friends and we waited a good 45 minutes for our food. Service was eh and food was even eh-er. I did not at all understand the hype surrounding this establishment. I'll stick to Blaze pizza and Coalfire thank you very much.", "pics": null}}, {"review": {"des": "The burrata is undeniable. Creamy, rich, flavorful. Every bite was unrepentantly savored.<br><br>Pizza diavola, delish. Crisply light crust that was tasty instead of falling dead in boring.<br><br>Definitely will be back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/18lB6uh81I3I5SqWyFKDGg/168s.jpg", "caption": "Diavola ($16) - blended San Marzano tomatoes, fior di latte, spicy salami, basil, Calabrian chili powder"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1F8rKelVIuPanz5E9kBorA/168s.jpg", "caption": "Burrata, yumm"}]}}, {"review": {"des": "This was a very good meal.<br>We started with the Insalata Mista. It wasn't fancy but featured fresh ingredients. Our main course was a pizza listed among the specials that featured blue cheese and walnuts and tasted very good. <br>I wasn't planning on dessert, but we ended up sharing an excellent Tartufo, which featured rich chocolate gelato rolled in hazelnuts. <br>I will be back.", "pics": null}}, {"review": {"des": "Didn't love it but I didn't mind it. Bathrooms were clean but I was insulted by the owner's unruly sons. My piece of advice to the owners: send the manchildren to college or put them to work. Pizza was A+.", "pics": null}}, {"review": {"des": "I've been to this place a couple times and had great experiences each time. <br><br>Fresh pizza, amazing burrata, and delicious tiramisu!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dQ0YvPdM7WUEfNUbJ1CU8Q/168s.jpg", "caption": "MUST TRY!!!! So good"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/576yGLPwvmuiZQmMF0tP3w/168s.jpg", "caption": "GET THE BURRATA!! A must try. They also give you extra garlic bread if you finish it before the burrata is gone"}]}}, {"review": {"des": "Definitely one of the best pizza places on the Northside of Chicago.  I didn't want to like it as it took the place of one of my favorite breakfast spots I frequented, but my wife and I have grown to love this cozy restaurant.  The owner is genuinely interested in his customers, frequently chats with people, and has great staff to match the friendly vibe.  Great for many occasions and the food is simple and perfected.  Go for the pizza of the day on the board and surprise yourself, and pair it with their recommended wines.  Simple pizza out doesn't have to be I elegant when you have Spacca Napoli!", "pics": null}}, {"review": {"des": "I came here one night after work to pick up a couple pizzas (they do not take orders to-go). This is hands down the BEST, most authentic Italian-style pizza I have ever had - and I grew up in a home with a Sicilian father, so this speaks volumes! The gal working at the front was very friendly and helpful with offering suggestions. Street parking was relatively easy.<br><br>I am glad we don't live nearby or else I'd be there every night!", "pics": null}}, {"review": {"des": "One of my fave pizza places in the area. Great for groups, an intimate dinner, or just when you want a delicious 'za. You can't go wrong with anything on the menu and the wine list is extensive.", "pics": null}}, {"review": {"des": "We've been coming here for years, but we're in the western suburbs so it's a bit of a drive, so we don't get here as often as we'd like. (Though this is probably a good thing in the long run, for the sake of our waistbands and our wallets.) Last Friday, with the rush hour traffic, it took us over an hour to get here for dinner. We're committed to this pizza.<br><br>We didn't have a reservation, but while we waited, the chef brought us some pizza to try (a new kind they are doing on a whole wheat crust), thus reaffirming our decision to make the trek that night. Cheesy and healthy-ish? Sign me up.<br><br>At dinner, we got our usual Bufalina pizza (the very best and completely inhalable) as well as the burrata (just a big pile of gooey cheese on bread, so...basically heaven) and another pizza with smoked mozzarella and ricotta and arugula. That one wasn't our favorite. I think in this restaurant, our favorite dishes are the simplest ones because the ingredients they use are so top-notch that you don't need to add much to make them shine. <br><br>If you're lucky, you'll get a free cannoli on your way out the door. They really know how to keep you coming back.", "pics": null}}, {"review": {"des": "How does this not have a 5 star rating?! We come here every time we visit Chicago--and in fact we will fly here just to go to dinner here for the day! It's that good.<br>So authentic. Amazing crust and fresh flavors. Love the prosciutto but also love trying all the daily appetizer/starter specials. A bit pricey--we rarely come out with a bill less than $100, but so worth it.<br>Treat yourself to a great evening and dinner here. It's pricey but you will feel like you have been transported to Italy.<br>Oh, and the cutest outdoor patio too!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/h-VxeyMEFZEyVQ348mbGUg/168s.jpg", "caption": "The funghi with sausage! My favorite."}]}}, {"review": {"des": "The wood-fired pizza is among the best ever. The sourdough crust is lightly charred and a little chewy - heaven! The toppings are fresh and range from traditional to inventive. This is a family-friendly environment with outdoor seating for beautiful days and evenings. We enjoy this restaurant on a regular basis.", "pics": null}}, {"review": {"des": "Came here Friday night for dinner and was really happy!  The pizza was amazing and tasted like more authentic Italian pizza than your traditional Chicago style pizza.  The only thing I felt was missing was a great salad to compliment the pizza.  They had some cheese/tomato salads but I didn't see a family style salad with a green base unless I missed it!  Will definitely be back regardless as the pizza was amazing.  They also give you a cannoli on your way out- highly recommended!", "pics": null}}, {"review": {"des": "Waitress - A+.  Charming that she sounded like she was speaking Italian when she gave the specials; more importantly, didn't bat an eyelash when asked to repeat one or two details on a busy Friday night in July.  She also took the time to discuss alternative toppings for one in our party as though it mattered to her that he enjoy his personal pizza.<br>Manager - D+.  Looked good.  Glowered at me when I smiled to say goodbye and to tell her to have a wonderful weekend.  <br>Hostess - No letter grade, as she's evidently already traumatized enough.  That kind of blanching of the complexion upon being asked for my free cannoli at the start of the meal instead of at the end doesn't happen by accident.  It's a trickle-down thing.  I hope she didn't get tarred and feathered for letting my blood-sugar argument win her over.  Dear Manager: Please spare her the \"If we did that for everyone....\" admonishment.  My cannoli indulgence isn't changing the tide for the rest of Chicago's North Side.<br>Food - expensive and tasty. Each pizza thin-crust is a meal (and then some).  $16-18<br>Atmosphere - suburban family restaurant; bring your kids", "pics": null}}, {"review": {"des": "I went here with friends who were raving about the Spacca Napoli pizza for years. It took us about forty five minutes to get there, and I thought that the pizza had better be worth a long drive. It didn't start off well because we had to wait for an hour, in order to get in, on top of the forty five minute drive. Once we got seated, the waiter came right away, and explained the specials. One of the ingredients I really liked was the porcine mushrooms. They are rare and hard to find in the US, but are very popular in Italy. I was excited to see them as one of toppings on the menu. The pizza crust is very thin and has burnt small spots all over. I really liked it because it was a real authentic Italian pizza that tasted very similar to the pizza I ate in Italy. At first I thought it was expensive because an individual size pizza costs around $18.00. However, we ordered three pizzas and it was plenty for four adults and one child (she did not eat much). Canoli on the way out was a nice touch. Overall,  it was worth a long drive and a long wait.", "pics": null}}, {"review": {"des": "I've been here at least six time and each time left feeling like a better woman that before. I've had the soft shell crab, burrata, both red and white pizzas, dessert, fried zucchini. Every thing was delectable. They have a beautiful wine selection too and the servers are very knowledgeable about which wine pairs best with which dishes. In the spring and summer there is a patio which is really nice. This is a great place for a solo dinner, a date or a night with friends. The only drawback I have is that the menu is a little hard to read being that a lot of the ingredients are in Italian. Be sure to ask for clarification if you need it.", "pics": null}}, {"review": {"des": "I was waiting for table with my friends for 40 minutes.  The guy in the front kept sitting the white customers that arrived after us.  Furthermore, the staffs in the front did not realize that we were already frustrated due to their ignorance. We realized that there were available tables at the patio that were waiting for. We were deadly hungry that we could not stand any longer waits.  We decided to change the restaurant, so we went to tell the guy in the front that we changed our mind. He only nodded his face and said OK.  We were here not to complain the queue.  We believed that we were patient, polite, and reasonable. We hope to go back to your restaurant in the near future, and we are looking forward to get a fair service for every customer's ethnic. Thank you for your attention.", "pics": null}}, {"review": {"des": "Overall: What a fantastic experience for quality pizza. It's not deep dish, and thank god it doesn't want to be. Some of the best pizza I've had in a long time.<br><br>The good: Great tasting pizzas with plenty to choose from. Red sauce, white sauce, and strictly oil based pizzas are available, and all of them are delicious. The dough was perfectly cooked, not too chewy or soggy and not too crunchy either. The appetizers and salads were also fantastic, the octopus, salads were great, and the fresh cheese special was some of the best cheese I've ever had.<br><br>The bad: Expensive, but what can you expect with a quality product. The menu, for us non-Italians, was hard to read without guidance. <br><br>Atmosphere: 9/10<br>Service: 10/10<br>Food: 9/10", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mIGkb6AqKJok75_hps_sLw/348s.jpg", "caption": "Fresh cheese special"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4JOtqjPsV9zX9cv4o5gNxA/168s.jpg", "caption": "Six cheese pizza"}]}}, {"review": {"des": "Pizza is excellent as are the appetizers. Brick oven style done well. Wife had the pistachio and I had the margherita. Thought the pistachio would suck but proven very wrong , a little oily but very intense flavors. I love this place but it's expensive, with the pizza and appetizers, plus tea and a red wine and shared dessert it was $70.", "pics": null}}, {"review": {"des": "Here is by FAR the BEST pizza of Chicago! I ordered the puttanesca pizza, wowwww really good! It was a recommendation of a friend! <br><br>They also have a gluten free option! Which is really good option! <br><br>The price is reasonable! And the service is really really amazing!!!", "pics": null}}, {"review": {"des": "I had a delicious pizza for my birthday while on a trip to Chicago.  The menu is in Italian, I had to ask the waitress to translate for me, which they were happy to do, and the pizza is fantastic.", "pics": null}}, {"review": {"des": "Delicious authentic pizza napoletana. Wonderfully fresh ingredients, good service, great location, nice ambiance. Having lived in Italy before, this was some pretty authentic Italian cuisine and I'd definitely return. Thank you for bringing the tastes of Italy to America.", "pics": null}}, {"review": {"des": "I have never had Neapolitan pizza before. We tried this place last night for the first time and we will definitely be back.  We had the Prosciutto e Rucola appetizer and the Arancini.  Both were delicious. Our server even suggested we get tomato sauce with the rice balls, and it was very good. The sauce it's self was very tasty, they should offer it with pasta! For our main pizza, we had the Diavola, it was also delicious. The ambience is very nice, and we didn't have to wait for a table.  Our service was pretty good, though I had to wave down our server for our check.  We will definitely be back!", "pics": null}}]}