{"name": "spinning-j-chicago-2", "reviews": [{"review": {"des": "Bread & butter heaven.<br><br>A quaint, bustling diner tucked into a diverse neighborhood; Spinning J nails it. Fantastic quiche, pastries, pies, and freshly baked bread.<br><br>Get your comfort food fix and take a passionfruit arnold palmer to go. Trust me.", "pics": null}}, {"review": {"des": "The reign of being a 5 star joint is over, but after seeing them drop to 4.5, I felt compelled to right a brief review. <br><br>This place makes me smile, every time. My daughter loves breakfast there and repeatedly asks to visit. My wife loves virtually every thing on the menu. Their service is also happy and warming, much like the interior. <br><br>Even their sweets are not too much of a sugar bomb. Expertly crafted. <br><br>Lastly, their dirty chai's are one of the best in the city. So any of their breakfast sandwiches or quiche are a must order. <br><br>I'm reluctant to be like virtually everyone else in Chicago who loves to give 5 star reviews to places that they live next to. But this place is a destination restaurant, assuming you are in the mood for their menu and you've got time to burn.", "pics": null}}, {"review": {"des": "I've been super excited to come try out the unique pies from here. Finally made it in after church with the family. I'm standing behind two women looking at a menu wondering how this works. The lady at register starts talking to them for a bit so I wait to ask her how this works. She's done speaking to the women I stand right in front of her. She acts as if she doesn't see me standing there so I say \"Hi, how does this work here? Do we wait to be seated?\" She barely gave me a glance and said \"you order with me and find a seat\" looks away. I say \"thank you\" and see the menus on corner of counter that we're not visible that easily considering there were three women standing there. <br><br>Needless to say the first impression I got from the woman at counter was she did not want my business. She continued to talk nicely to the women. I should mention I am Latina and the woman working and the other customers she was speaking to were Caucasian. I'm not saying that she was being racist, but unfortunately that's the impression I and my husband got. Must add I've never felt that way here in Chicago.", "pics": null}}, {"review": {"des": "Enter into my life: this little soda fountain shop. This place is not for the faint of stomach. Specializing in quiche, strata, soups, pot pies, and desserts; this place is like a scene from \"Shape of Water\". It's old-fashioned, classic, and cozy small. <br><br>Hardly ever a wait, but popular among locals, we gave this place a go on Saturday at 11:00AM. Ten minute wait- the line moved incredibly fast. A slight wait also gave us the chance to look at the days menu, which was posted on the chalk sandwich board. These are your BEST options! My husband does not eat onions and found it hard to find a brunch item without onions. He chose the Spin Wheel cinnamon roll (gooey, room temperature, proper amount of cream cheese frosting), breakfast sandwich (mediocre, fresh bacon, toasted english muffin with eggs and cheese), quiche (SO STINKIN GOOD, fluffy, not too cheesy, great portion, today's quiche: sweet potato, caramelized onions, turnip, roasted corn), and the peanut butter milkshake (SERIOUSLY, HOLY PEANUT BUTTER COW- a complete blast of peanut butter, followed by rich creamy ice cream).  <br><br>Spinning J deserves it's five star Yelp rating. We did not get our paws on any of the pies or other desserts (We DID purchase a Blueberry Peach pie for our friend's housewarming party, but DREADFULLY were not able to sample a piece). 100% will return for breakfast/brunch/lunch/dinner. I recommend this place for soda fountain storefront lovers, old timers, sweet tooth fanatics, adventurous brunchers, and for people who don't want to wait a long time to eat.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4cdfGyRyYyFhs9uvc-AWlw/348s.jpg", "caption": "Peanut Butter Milkshake!! So rich! Comes with extra like they should!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Fbq7LyXV2v3aut5l4q-O2w/168s.jpg", "caption": "Pies sold by slice or whole pie"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HeBpAoJViYOK25lAV6GHAQ/168s.jpg", "caption": "Breakfast sandwich- not good, not bad"}]}}, {"review": {"des": "I've only had the pie so this review will be short and sweet until I go back for more!  They do some interesting variations on classic recipes such as Key Lime Hibiscus & Strawberry Lemon Meringue.  They do them very well.. puts Bang-Bang to shame, they said.  They also have classic pies and a list of usually like 6-8 different selections everyday!  The Smores is amazing as is the Banana Cream/ you really can't go wrong. $5/ slice", "pics": null}}, {"review": {"des": "Why don't you have servers? I kept getting dirty looks from the people that work there as I sat there with my empty plate and empty coffee. I would've ordered pie, and refilled my coffee but instead of having servers like most restaurants have, I got dirty looks for sitting there keeping a space away from other customers. Even if I had gotten up to order at the counter, there was always 10 people standing in line so it would have taken ages to order.<br><br>Get some servers, your restaurant needs it.", "pics": null}}, {"review": {"des": "I liked the inside - it had spunk. Didn't try any savory offerings. I will be back for these! A little confusing, but you order first then sit down. They will bring you your order. <br><br>There is no server to take your order at the table. There's a little note on the table kindly asking you not to loiter for too long after you're done. <br><br>I think pies rotate. Not always gonna see the same pie everyday. I spotted a funky Easter pie and wanted a slice of that no questions asked. It was lavender lemon. It was very lemony, I wouldn't have minded some more dominant lavender notes up in dis bish. <br><br>I hope there are more funky pies, I eat those. Non-funky pies are okay too but the funkier the better inmo. <br><br>Cappuccino was decent. I got that also. Thx for pie", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/L8cutGePvqliaAhNeN1NFQ/348s.jpg", "caption": "I forget what the pie in the cut is"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Br8g1jNzM5JG3x0rpGI4IA/168s.jpg", "caption": "12oz cappuccino and lemon lavender pie"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/z5L8Qicvn0579-Ik2tRrlw/168s.jpg", "caption": "Easter lemon lavender pie"}]}}, {"review": {"des": "Waking early for ten miles on a treadmill, six eateries on Independence Day straight off the LAS-ORD red-eye yielding great sleep despite neighborhood fireworks, it was with another two miles walked that Spinning J was located in a largely residential neighborhood, a tip from one of Las Vegas' best Pizzaiolos proving true as the Soda Fountain and Bakery proved to be an underappreciated gem in west Chicago.<br><br>Situated not far from a hospital and sizable green space at 1000 North California Avenue, the cozy corner-pocket space originally opened in 2015 still flying beneath many \"foodie\" radars, it was immediately upon entry that a middle-aged woman offered greetings, a low-slung Pastry case equally welcoming as it tempted with several sweet and savory items.<br><br>Owned and operated by Dinah Grossman and Parker Whiteway, the young woman emerging from the kitchen temporarily around 8:00am to put a dish on display and greeting several apparent regulars on the way, it was as light music played overhead that a seven part order was delivered in segments, house Cold Brew refreshing the palate first between bites of a room temperature Cinnamon Roll that was loosely wound and fluffy with light tanginess helping to balance thick Icing on top.<br><br>Tightly spaced yet cozy, small booths flanking bar seating and signage requesting guests give up larger spaces to groups if need be, it was next into a crumbly Buttermilk Biscuit that teeth pierced, Honey from a self-service Coffee and Tea station added to taste but still not enough to make it stand out compared to the rest including two Cookies which were both far better than Warm Belly Bakery thanks to a soft center and crispy rim.<br><br>Known for Pies long before going brick and mortar, four styles all tempting on this day in addition to a savory Vegetarian Strata, it was in two $5 slices that remaining appetite was invested, the Coffee Sugar Cream textured like Chess with bitterness and sweetness both well represented while Raspberry-Citrus Custard danced atop a buttery crust crowned in faultless Meringue.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gJnDjgWSUbnzuXbTKaVmJg/348s.jpg", "caption": "07/05/18 Spinning J: Cold Brew Coffee"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0VOn0BXVYXlys36tbYdTGA/168s.jpg", "caption": "07/05/18 Spinning J: Cold Brew Coffee"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kNpA04EwkOkrDc8wDf8FTQ/168s.jpg", "caption": "07/05/18 Spinning J: Cold Brew Coffee"}]}}, {"review": {"des": "Spinning J serves up pies and various breakfast and lunch bites in a picture-perfect diner straight out of the 1920s. Their key lime hibiscus pie is easily in the top three slices I've ever had in my life, and I wish I had had more time to go back and try more of their pies! <br><br>While killing some time in the Humboldt Park area, I got caught in an afternoon shower and in a moment of serendipity, I spotted Spinning J. Upon walking in, I immediately saw the display case of pies. The meringue pie was topped with billowing, lightly browned clouds of meringue, the smores pie had a perfect caramelized swirl of marshmallow on top, and the banana cream pie's crust looked so flaky and buttery, I wanted to try them all! The lady behind the counter was very helpful and I finally managed to narrow my selection down to one - the key lime hibiscus pie, one of their most popular pies. Served with blueberry compote and fresh-whipped cream, the pie had that lovely sour tang characteristic of key lime, but with a floral accent from the hibiscus that was accentuated by the tartness of the blueberries. The texture of the filling was really light and smooth, and the level of sweetness was perfect.<br><br>The space has a good variety of seating - there's intimate booth seating for groups of two, some slightly larger tables by the storefront windows, and a long counter where a few people were catching up on their reading. (Would be cool if they added some hooks under the counter to hang bags.) I noticed that the bartender/barista took the time to chat with some of the other people sitting at the counter - the whole vibe just felt like a friendly neighborhood hangout. (Shout-out to Milo for the great conversation!) If I lived in Chicago, I could easily see myself stopping in often to try a new pie flavor and enjoy the lovely atmosphere of Spinning J.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Gx8K8hl2HRBHnVt3bHyfHQ/348s.jpg", "caption": "Really, really good pie (key lime hibiscus with blueberry compote) - $5"}]}}, {"review": {"des": "After reading so many rave reviews of this place I had to check it out so I made the suggestion to my friends that we go for brunch.<br><br>Walking in, the place has a very quaint, old-school vibe.  The style is that of a '50s soda/coffee shop.  Things started out a bit rocky as we asked for a table for 5 (open seating) and most of the tables seat 4 or less.  There's one large table in the back but it was taken when we arrived so we sat at the bar, which was a bit uncomfortable as the stools are backless and there are no hooks for coats or purses.<br><br>......but once we tasted the food, all was forgiven.  I had the roasted poblano and chipotle sandwich, which is now probably my favorite breakfast sandwich of all time. And that's saying a lot because I'm not the type of girl to be okay with a meatless sandwich.  The homemade english muffin was rich and buttery, the eggs were perfectly scrambled, the peppers gave just the right amount of kick and the white cheddar pulled it all together.  <br><br>We of course couldn't leave without having some of the baked goods.  My husband got a chocolate chip cookie which was amazing.  I had a slice of the coffee cake, which was a tad dense, but still very good.  My friends had one of the scones and a house made biscuit, both also delicious.<br><br>We washed our meal down with mimosas made from some of the house made mixers and spritzers (they get extra brownie points for being BYOB!).  If you're looking to grab a casual bite to eat alone or with a friend or two I highly recommend this place.  If you're with a big group.....you should ditch them so you can come here.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9RWkdmMR_pRU6pWOGscwWw/348s.jpg", "caption": "The Spinning J Breakfast Sandwich"}]}}, {"review": {"des": "My sister lives around the corner from Spinning J, and I don't understand why she doesn't pop in at least once per week.  The decor is vintage chic (I love the flower light fixtures above the counter), the seasonal desserts are fabulous, and the height of the stratas will have you producing an audible gasp.  I'm SO jealous I don't have a Spinning J in my neighborhood!<br><br>Recommendations:<br>-Guava Cheesecake<br>-Keylime Hibiscus Pie", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/S7E7db4XjGOBdbPm0tZIHw/168s.jpg", "caption": "Guava Cheesecake"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fpTDrVXtBgGuJDI01miYPQ/168s.jpg", "caption": "Sorbet via Black Dog Gelato"}]}}, {"review": {"des": "FYI: no outside food/drink allowed. There's a sign on the front door which is exactly how that message should be delivered to avoid awkwardness between staff and patrons. <br><br>Anyway! <br>What a beautiful space with attentive and helpful staff. It's an order at the counter and seat yourself type of place with few tables but we didn't have an issue with that on a Wednesday morning. We ordered the quiche, grilled cheese and a strawberry-chocolate milkshake. The quiche was incredibly flavorful and moist with a beautiful flaky crust. The grilled cheese had a crunchy crust (slightly too crunchy) with a great buttery tasting bread center that paired nicely with white cheddar. I wish there had been more cheese but it was good regardless. <br>The milkshake was the star of the show. Creamy and sweet and everything you would want a milkshake to be. I highly recommend getting the chocolate mixed with strawberry for a nice flavor pairing. Don't skip the whipped cream! <br>Wouldn't get the grilled cheese again but definitely an exceptional place. Will gladly return for pie.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/O98fQYT5r7f6uKGJXW9uZw/168s.jpg", "caption": "Grilled cheese on sourdough with chips"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/59EaL8mRvd29ZQNeKXfjuA/168s.jpg", "caption": "Quiche of the day. Sweet potato, onion, cheddar and mozzarella"}]}}, {"review": {"des": "Not that they need any more five star reviews (way to go, guys!) but I wanted to add to the chorus on this one.<br><br>I went on a whim today around 3:30pm for a tuna melt and chocolate malt, and now I plan on going back as often as possible.<br><br>The food was delicious (perfect, really) the atmosphere was bursting with charm, and the folks working there couldn't have been nicer.<br><br>I highly, highly recommend a visit!  So glad to have you guys in the neighborhood, Spinning J!", "pics": null}}, {"review": {"des": "Wow! Best pie I've had in the city and that's saying something!<br><br>Firstly the atmosphere is great-really cute spot where you order from the friendly owner and take a number to your seat after paying. The lotus lamps over the tables are particularly cool. <br><br>The variety of pies savory and sweet varies daily. I ordered a chocolate egg cream and the saag paneer pot pie. My shake was delicious and the pie crust incredibly buttery and flakey. the filling was thick with well spiced spinach and creamy paneer. It came with a side of chutney and we finished every crumb. <br><br>My company ordered the s'mores slice, grasshopper slice, and the guava cheesecake slice. The s'mores was heavenly-the chocolate filling was luscious and the marshmallow topping was lightly roasted and gooey perfection, all served in thick yet melt-in-your-mouth graham cracker crust. The grasshopper was incredibly rich with creamy mint filling and a layer of thick chocolate-my boyfriend was loathe to give me a second bite haha. <br><br>He was so impressed he got back up to order the guava cheescake slice to go, but that never made it out! This was a smaller but incredibly rich cheesecake slice layered with guava paste. Even my sister who isn't a cheescake fan loved it. <br><br>I would come here again in a heartbeat, it's worth waiting in line for and i'd consider buying a whole pie to impress at a party.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/y5vgzZtTq3V5mOeQ56_9rA/348s.jpg", "caption": "S'mores, Grasshopper, Saag Paneer, and chocolate egg cream and the smiles they created!"}]}}, {"review": {"des": "5 Stars for great breakfast food, an incredible chai latte, and unique decor!<br><br>First thing to say is check the chalkboard! It's filled with the day's specials and if you get a chance to try their strata, take it! It's a brunch dish, similar to a quiche and a frittata, but they take this savory bread pudding to the next level! This strata is enormous, but not just for the sake of being big. It was filled with eggs, vegetables (sweet potato, onions, and others), and cheese and though I'm notorious for not being able to finish a dish, there was not a crumb left on the dish!<br><br>Besides that, my friend ordered a blueberry scone, a breakfast sandwich and a chai tea latte. I don't know about her food, but the latte was a topic of conversation for the rest of the day because it was creamy, had a beautiful foamy top, and a rich spiciness! I'd go back just for this. And my strata. Can't forget the strata.<br><br>Anyway, ask them about the insane, large lamp you can see back in their kitchen area. Is bold and makes a statement! The pink walls and lovely fixtures add to an environs ambience that you can't help but adore. <br><br>They have a new fan!", "pics": null}}, {"review": {"des": "This place is perfect. Vintage meets modern. <br><br>It has a 1950's soda shop vibe that is utterly adorable. I stalked their website beforehand and read that nearly all their decor is refurbished and recycled from decades past. That makes me appreciate this little ma and pop shop even more. If you appreciate aesthetics, design, and diy, you will geek out over this place.<br><br>Food: Saag Paneer pot pie- unique twist on a classic.. just like the Spinning J itself! Delicious, creamy flavors. The mango chutney gave it the fresh, light kick it needed! I highly recommend!<br>The grilled cheese was just ok. <br><br>Drink:<br>Homemade rootbeer is delicious!! I tried the egg cream (never had one before) and it wasn't my scene. I could see other people appreciating it but it tasted like watered down chocolate milk to me.<br><br>Pie:<br>We got 3 different flavors (peanut butter, s'mores, berry) all of which were amazing. <br><br>I adore this place and highly recommend! It is a bit expensive for the value but worth it due to the detail of design and flavor.", "pics": null}}, {"review": {"des": "By far the best pies you'll eat in Chicago. So far I've had the banana cream, strawberry lime meringue, and s'mores and they've all been delicious.<br><br>Give this place a try and you will not be disappointed.", "pics": null}}, {"review": {"des": "The cat's out of the bag: This tiny masterpiece of a diner is definitely worth checking out!<br><br>My friend with whom I visited recommended this place for brunch on Sunday after church. It. Was. Packed! Apparently, it used to be Humboldt Park's best kept secret, but someone told.  Lol...but I'm happy for the owner(s).<br><br>A lovely woman named Dinah (sp.) was working as the expeditor and she actually turned out to be the owner! She was super sweet and she complimented the kitchen staff on their skills when we asked if she'd prepared our food: 2 slices of quiche (it's always vegetarian) and 2 side salads. I'm not normally a fan of quiche but this quiche was the tops!<br><br>I would return during off-peak hours if there are any.", "pics": null}}, {"review": {"des": "The BLT that I ordered was fantastic and full of flavor. When they say fresh tomato, they really mean it. It was highly reminiscent of tomatoes that my family grew at home--full of color and flavor unlike the unripe tomatoes found in grocery stores. There was also a generous amount of crispy bacon in the sandwich (maybe 3-4 slices?) and the sourdough bread was fantastic!  For $12, however, I would've hoped to get a lot more sandwich.<br><br>The old school diner theme of the restaurant was super cute and well done. However, I found there to be quite a few flies buzzing around which really detracted from the experience.<br><br>Overall, I would not recommend coming here to get lunch. It probably makes more sense to get the soda/pies that they are known for.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cbcyTSDjkUBnOt-QxeZFrA/348s.jpg", "caption": "Sides menu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/B_RXyPsm3etps-Un_KsDNQ/168s.jpg", "caption": "Back of the menu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YWapXHEqrLJPa_BhRwbTQQ/168s.jpg", "caption": "Front of the menu"}]}}, {"review": {"des": "Those baked goods though! Totally worth a pop in.<br><br>My friends and I went in for brunch but ended up just getting sweets to go. Spinning J is first come, first serve and gets incredibly busy and packed. There are only a couple of tables that fit 4 people (literally 2), 1 for 3 and maybe 6 for 2somes. This would be a great place to dine solo at their counter, but with a group? Noooooo! We got our table scooped out from under us by a little Grandma we didn't have the heart to put in her place. <br><br>That being said, the staff was very friendly and of totally cool composure under stressful circumstances. And the baked goods I took to share were all just delicious!<br><br>I had read their Peanut Butter cookie is a must get, raved about in reviews. Truth. Thicker than what I'm used to but perfectly done with just the right amount of soft & chewiness with a sugary topping.<br><br>Their chocolate chip cookie was again thick, soft, chewy with a good consistency, not overly sweet and I enjoyed it. It could use a dash more sugar & chocolate chips, but that's just for my personal taste.<br><br>I also read their Cinnamon Sour Cream Coffee Cake was bomb so I got that for my friend who loves coffee cake. He said it was great and I enjoyed the bite I had but honestly found it ever so slightly dry.<br><br>The Keylime Hibiscus Pie topped with a blueberry compote - insanely tasty! I usually like my pie in chocolate form but this may have converted me to the fruity flavors. I had to also try their Chocolate Hazlenut since I'm a cocoa girl and I loved it! It had just the right amount of richness when eaten with the crust and both layers in white bite. The topping is nearly 2 inches thick, this pie is a beast! $5 a slice.<br><br>Pro-Tip: BYOB and they encourage you to add into some of their drink creations!<br><br>I didn't get a receipt so can't comment on the prices but I know all 5 items ran me $20. I need to go back for a full meal and also one of their sodas! I mean...it's a sofa fountain after all! Spinning J does a wonderful job bringing back that old timey diner feel in an updated atmosphere where everyone feels like a regular. Plus great food to boot!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cwmEG6Z4HEU9qIkWUTOBQQ/348s.jpg", "caption": "Chocolate hazelnut pie"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mmtESKVM2j5U4QdjlcA8sg/168s.jpg", "caption": "Chocolate hazelnut pie"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Qtkva-kvACdUpUU-4-D6RA/168s.jpg", "caption": "Chocolate chip cookie"}]}}, {"review": {"des": "So my friends wanted to meet up at the bar next door and I got to the area early, starving, and they'd already eaten. With my GPS saying I was in Humboldt Park on a Friday evening, this suburban girl was not about to take a walk around town to find a place to eat. Instead, I saw Spinning J on my Yelp app with 5 stars. Spoiler alert: I hate pie. But with limited options, I decided to make the trek down the block and get something to eat.<br><br>Lucky me, when I arrived they had a sign saying Friday night is pizza night! They had a couple options and I got something with pesto, ricotta, olives, and other things that were of the same tasty nature. It was delicious -- but $6 a slice was steep. You had the option of making it a meal with a side salad and soda for $10 but I don't really drink soda and who likes a boring side salad? <br><br>Instead I decided to take a gamble and try a slice of pie for dessert. Everyone else was doing it, so I felt like I'd be missing out if I didn't (seriously, they were serving up slices of pie left and right in this place). I got a slice of raspberry lemon something -- it was actually quite delicious! And a very large, filling slice. Considering I don't like pie much, this was good.<br><br>The inside of the place is a very vintage, authentic diner feel. Not particularly comfy (tiny, hard booths or small barstools are your choices of seating) and the waitstaff wasn't particularly friendly or helpful (when I asked what kind of pie they had, they pointed to a chalkboard A frame on the floor behind them, as if I should've seen that from the start). That combined with the steep cost ($6 for the one, average sized piece of pizza and $5+ for the piece of pie), I had to leave this place with an A-OK rating. Would I return? Maybe if I become more hipster... or love pie more in the future... or find myself nearby again, starving, with nowhere else to eat.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/79zlz7mDAK875da7uP4YiA/168s.jpg", "caption": "Pizza night on fridays!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZrHBrg92-KrQzcvCGNusCw/168s.jpg", "caption": "Raspberry lemon merengue"}]}}, {"review": {"des": "Literally I wish you could give 6 stars. The food is delicious and clearly handmade with care, and the sodas and milkshakes are better than I thought possible. Me and my partner went here while staying in Chicago and were so delighted. I got the smoked trout Bialy sandwich ($9) which was crispy and super flavorful and the ginger lime fizz ($4) which clearly was full of real ginger and real lime juice, and they got the roasted poblano and chipotle sandwich (8.50) and the Thai tea milkshake ($6) which we're both fantastic. It's pricey for milkshakes and breakfast but after tasting everything I realized that it's actually a steal for food this good. We're planning on coming back tomorrow, and maybe the day after too.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_qwEa3a7UKVE5P0kersAhg/348s.jpg", "caption": "Thai Tea Milkshake (empty of course, we didn't stop to take pics before jumping in)"}]}}, {"review": {"des": "Cute little bakery. Unique selection of pies, cookies, gelato, quiche. Prices are moderate. There is also a full food menu.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mqoT7eIQc8LcjGfwTaWLZg/348s.jpg", "caption": "Cherry apple crumble"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/k47xROKxYB0G2QMoMsRNNg/168s.jpg", "caption": "Grasshopper pie"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mN1eU6DcbyLlkQDP2jrqQw/168s.jpg", "caption": "S'mores pie"}]}}, {"review": {"des": "A Nice Cozy Hipster soda fountain Shop. This place is very inviting with a nice cozy feel to it.<br><br>I felt welcomed the minute I walked inside. Trendy and authentic. It reminds me of those cute candy and snacks shops when I was younger.  The menu even has healthy and vegetarian options for you to choose. The display of pastries had me on a sugar high this morning. I selected the lemon drop fountain soda and a Maple Pecan Scone. Both were delicious not too sweet but just right. The cashier was so sweet. She gave me a cup of freshly brewed coffee on the house.<br>Make sure to here a little early to find a seat. The place isnt that spacious.<br>But I was able to seat up on the stool at the bar station. <br>Spinnning J's has many things to pick from fountain drinks Shakes Floats Breakfast Sandwiches and many different yummy desserts. The prices are even reasonable. <br>Its a must that I come back one weekend and try out the other goodies.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/D3LP8VBHzsjvb46CZuzwPw/348s.jpg", "caption": "Outside Wagon Sign"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9TkxHRsiCQtY-h4jMZE_bA/168s.jpg", "caption": "Behind The Scene"}]}}, {"review": {"des": "You can get an ice cream cone made of butter pie crust!<br><br>It's a secret menu item (shhhh) so I probably shouldn't even be writing this review. You're welcome.<br><br>Yes, indeed. You can get Black Dog gelato served in a cone made of buttery, crispy, sugary heaven. Taking the humble ice cream cone to a whole new level. Whether paired with the slightly spicy Mexican chocolate or the tart and refreshing strawberry-rhubarb sorbet, it's seriously good stuff.<br><br>If you thought a waffle cone was as good as it gets, think again.<br><br>Oh, and everything else about Spinning J is aces too. The homemade sodas. The pies. The quiche, strata, and sandwiches. <br><br>Be warned: there is a limited number of pie crust cones available. Get there early in the day. And don't be telling everyone about them either. The cones are an additional $2. Makes for a pretty expensive ice cream cone, but sometimes you just have to live a little, amirite?", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qxUE7a3waGpWL83bVdZ0ug/168s.jpg", "caption": "Black Dog Mexican chocolate ice cream in a pie crust cone"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0gE41YesRA-4GlIY_b5Pcg/168s.jpg", "caption": "Black Dog vanilla bean gelato in a pie crust cone"}]}}, {"review": {"des": "I stumbled upon Spinning J on a random Friday afternoon and I'm SO glad I did. <br><br>1) The atmosphere- SUPER cute retro diner feel. It was so cozy and I loved everything from the quirky wallpaper to the tile floor.<br><br>2) The FOOD - I got the breakfast sandwich with bacon and it was delicious. I also picked up a few blue cheese biscuits and YA'LL. These biscuits. Maybe the best I've ever had. <br><br>Everyone working there was so friendly and there was so much delicious food to choose from. I can't wait to go back.", "pics": null}}, {"review": {"des": "My friends & I stayed at an airbnb in Humboldt Park and was looking for a quick and delicious breakfast spot since we didn't have time for a sit down. We came here on Saturday morning around 10 and there was a line, but not too bad.<br><br>I ordered the spinning j breakfast sandwich with bacon & decided to get a peach nectarine and cherry crumble pie. <br><br>The breakfast sandwich was delicious and it filled me up. My favorite was definitely the pie. It was SO good. I didn't think the flavors would go well together, but they did and I wanted more.<br><br>It looks like they switch up the pie flavors, which is pretty cool if you're a regular and like to try everything on the menu.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lDrXP2gPf3FQZlQ3rH2RJg/168s.jpg", "caption": "Peach nectarine & cherry crumble"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/We6YN_p7JDFxe6uXhvNfjA/168s.jpg", "caption": "Some of their baked goods selection."}]}}, {"review": {"des": "The pies and cookies are delicious one-of-a-kind actually there all amazing! takes me an hour to get to their location and it is definitely worth the drive ! The owner Dinah is an absolute sweetheart this is a small business that will be around for a very long time .", "pics": null}}, {"review": {"des": "Well i ended up buying a Cinnabon swirl butter cake and never ate it (dont ask im so sad) but my spouse got the key lime pie and she nearly choked from not chewing she was eating it so fast and bragging about how good it was she forgot to swallow! I tried it and let me say I'm not a fan of key lime pie but that was really good! I wanted to ask for another bite but she looked so happy eating it i didn't want to make her mad with me asking for one more taste lol <br><br>With that being said  their desserts are delicious!!!", "pics": null}}, {"review": {"des": "I have been waiting to try this place out for months! My friend found them through Instagram because of their delicious and beautiful pie pictures *so gooddd*! <br><br>Located on the corner of Division and California, it's a quick bus ride away from the California blue line stop. Mannnn is this place adorable. It's smaller than I was expecting with a bar area and a few small booths. The inside really feels like an old soda shop. <br><br>We walked in at 9:30 AM on a Saturday with no wait and a couple of empty tables. My friend said she had tried to come in the past, but the line was always out the door. You are forced to drool over the baked goods display as you wait to order at the counter before finding a seat.<br><br>We both got a breakfast sandwich and thanks to yelp, I expected small portions. I would order some baked goods and a drink to pair with your main order, otherwise you may still be hungry. I got a chai latte and the coconut cashew honey pie. My friend got a coffee and the s'mores pie: So.GOOD.<br><br>Since we were both full after all that but still wanted to try more, we got a cookie and cinnamon roll to go. The cinnamon roll was not like those store-bought fakes- this was a doughy, cream-cheese frosted, cinnamon masterpiece. <br><br>I will obviously be back soon to try their other pies, strata, milkshakes..and basically just everything on the menu...YUM.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ttF_xxdBzYMLVO8l50-6iQ/348s.jpg", "caption": "Coconut cashew honey and s'mores pies"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iwEgwVmTdbyoZEbwINXewA/168s.jpg", "caption": "Chai latte and breakfast sandwich with bacon"}]}}, {"review": {"des": "On the advice of Sarah the Juilliard trained Pietender I got the cherry chocolate cheesecake.  She claimed I would cry with joy after eating this heavenly pie, while I didn't shed tears I did have visions of Jesus as I felt the diabetes surging through me.  <br><br>The pies are delicious! You must come to this place and try them out!  <br><br>The ambiance and atmosphere is very cozy and warm.  My wife got the Ginger Pear Pie, she loved it! We will definitely be back!<br><br>Also if you're fortunate enough you'll see Sarah the Pietender dispensing pie related advice.", "pics": null}}, {"review": {"des": "Even though it was a bit out of the way, my friend and I stopped here for breakfast while in town on vacation.  In the early morning on a weekday, we didn't have to worry about the crowds.  We walked in, admired the old school décor and took a step back in time.<br><br>I was excited about the idea of a milkshake for breakfast.  Sure, they offer your usual chocolate and vanilla.  But even those can be malted or have an espresso shot added.  I was feeling a bit more adventurous given all my choices and went with the Thai Tea Egg Cream.  The food menu isn't too long but it too has some interesting items.  I didn't wander too far from the beaten path when I ordered the BLT.  <br><br>My sandwich and drink came to nearly $20 which, for breakfast, seemed a bit much.  But I was on vacation and treating myself and, well, I could have eaten another one of those BLTs and had five more of those egg creams.  Not to mention some of those mouthwatering sweet and savory pies.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Y0MgbsoNqF1Xu-k664krbA/168s.jpg", "caption": "Chocolate milkshake on the left, thai tea egg cream on the right"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VRrMQi4Ftpe6nLLAtXsMAw/168s.jpg", "caption": "Breakfast sandwich (BLT in the background)"}]}}, {"review": {"des": "Cute space, simple menu, delicious food; that's sometimes all you need in a restaurant. Spinning J is pretty small, you order at the counter then grab a seat at one of the tables. I was looking at some plants at Adams & Sons Gardens and needed something small to fill me up. I ordered the quiche which was absolutely delicious and everything you need in a quiche: fluffy and cheesy filling with a crispy crust. I also got a cup of the pumpkin soup which paired well with the quiche. Both the quiche and the soup came out to be around $10. I wasn't too hungry and didn't have a chance to order a pie which I fully regret.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zcmoGKWnjGkjcF-jQdwiOg/348s.jpg", "caption": "Quiche, pumpkin soup, coffee cake"}]}}, {"review": {"des": "Eh. I got the guava cheesecake. It wasn't anything special. It was alright. I'll try something else the next time I come here. The staff was very friendly! Speedy service.", "pics": null}}, {"review": {"des": "Spinning J is perfection. From their baked goods, to the savory food, to the shakes and sodas, the vintage decor, and the quality service, it's just all so on point! A real gem...", "pics": null}}, {"review": {"des": "I thought I had already updated this, but I guess I was wrong...bottom line, Spinning J's is the best soda jerk/bakery/shake shop in Chicago, and maybe that I've ever been to.  The quality of everything I get here is fantastic, and as a guy who gets 2-3 shakes a week, I always make sure to get one of them at Spinning J's.  Perfect consistency, price point is just right, and there's always just a bit more than I need.<br><br>Over the time they have been open, I've had the chance to steer a lot of traffic to this business and my friends and family have never been disappointed.  The pies deserve special attention also: I've tried all of the \"regular\" pies as well as many of the special slices--really, any that don't have peanuts--and I can vouch for all of them.  I probably need to try the sodas out more often but I'm usually leaning towards cold treats when I come through.<br><br>Besides waiting for a second location, I can't think of anything less than perfect here.  The service is always friendly and ownership is a delight to work with.  Already looking forward to my next visit!", "pics": null}}, {"review": {"des": "Favorite diner in the city. The pies and the food are tremendous. A smaller area so definitely sneak in when you can.", "pics": null}}, {"review": {"des": "awesome house made soda! also loved the black dog gelato to be put on top of the soda as a float!<br><br>the quiche is also very good here, the outer crust is crispy and the quiche itself is very tasty. lots of good bakery items here too.<br><br>small storefront, generally large line to get food, but a lot people are getting it to go, so seating is not really a problem", "pics": null}}, {"review": {"des": "Was out for an early morning walk and discovered this gem of a restaurant. First of all the vibe and atmosphere are awesome.  The owner and his wife are beyond friendly as the rest of the staff follow the lead.<br><br>I started my morning with the fresh 16 oz drip coffee.  For breakfast I enjoyed the the spinning j  sandwich with scrambled egg and sharp white cheddar on buttered house English muffin. This was absolutely delicious. <br><br>Love this place and Five Stars for delicious food, great service, and cool atmosphere.", "pics": null}}, {"review": {"des": "Lovely decor, yummy pies!! Esp the saag paneer pot pie, genius combo! But i would skip the thai tea egg cream soda next time...", "pics": null}}, {"review": {"des": "We got a variety and the only thing I would recommend is the Smores pie. Shared the hibiscus key lime-not good with a pudding like texture. The blue cheese biscuit was extremely dry and hard. Shared the strata- BF enjoyed but I was not a fan of the overwhelming amount of onions in it. Took a full smore pie to an event-so good and possibly the best pie I've ever had! Also ordered a full cherry cheesecake to go that was not good and reminded me of the box ones you make-very disappointed in that. My vote is go to Bang Bang...probably won't return.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CXdZXj5G2NYCZyf-6Zr1Aw/348s.jpg", "caption": "Strata - good but lots of onions-so that's where I wasn't sold."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HRYS2hL6Hp3BJvOFTxBX5A/168s.jpg", "caption": "Key lime hibicious -not good..flavor and texture blah"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/exl11tzEapAlsm227244Cw/168s.jpg", "caption": "Smore pie-best pie ever!"}]}}, {"review": {"des": "Spinning J's is a rarity today; kind service, freshly made food, and pleasant atmosphere.<br><br>What to eat:<br><br>The chicken pot pie is heavenly. However, it comes out  nearing the temperature of fire so prepare to wait a bit before devouring. Fresh carrots, celery, and seasonings abound in this must try dish.<br><br>Blueberry scone required upon visit. No matter the time of day, I always get a blueberry scone. I've tried scones all over the city and Spinning J's is my personal favorite. Plenty of blueberries paired with a hint of lemon is what makes it delicious. <br><br>Milk shakes. Duh. Get one. You won't be disappointed. I recommend dining in for the milk shake because true to soda shop fashion they give you a glass full of milk shake plus the shake tumbler. It's basically a milk shake and a half. Yes please!<br><br>For newbies, you have to order at the counter before taking a seat. It's actually the only hiccup at this place. I opine that one shouldn't have to decipher a code before understanding how to place an order. Chicago Bagel Authority is the same way. It should be more intuitive or something is off.<br><br>Go.", "pics": null}}, {"review": {"des": "Charming corner spot with gourmet pie slices and a decent chai. Interior is a cute time warp. Hibiscus key lime pie had wonderful fruity notes and tangy flavor delivered in a light but creamy mousse filling. Hazelnut-chocolate (think there was another nut in there?) had great nutty chunks to crunch and fudgy chocolate thrown into the mix. Both pie slices were delicious whereas the chai was more one-dimensional. Would have gone with coffee if not for friend's preference. Wish this place were closer to home so I could get through more of the menu!", "pics": null}}, {"review": {"des": "Excellent and charming place spent longer than expected here we were having a really good time and decided to order a pot pie after we just had pies haha. Very good pies can't wait to come back and try their that stuff on the menu.", "pics": null}}, {"review": {"des": "Food quality is great....but pricing is significantly off!  Sandwich with tiny side salad was $15?  Side salad for $3 had about 5 greens.  Supposedly they also remove the chips when you get the salad, but the cook gave me a few chips.  Overall that is a serious disconnect with value -- I can make the same sandwich at home for less than $3.<br><br>One of the oddest things was that one of the staff sat 2 seats over at the bar and had a dinner break when it died down -- both her main and side portions were much larger than mine.   So I guess that staff gets fed at the expense of the guests -- that makes no sense.  I would have loved to have the size of her greens salad, which was easily 4X the size of what I was served.<br><br>Slice of pie at for 6?   Don't get me wrong -- it was great -- but not worth that much.  By gosh I am almost at a whole pie at that price?   And when the staff used their bare hands to transfer from a plastic to-go container to a plate -- that was gross.<br><br>I think the real problem is that the have way too many staff...which is taking away from potential food value.  When I was there I counted at least 8-10 staff when they could have run the restaurant with 2-3 staff.   The lazy guy behind the counter barked at the dishwasher to bus the tables -- tables that sat dirty for 10-20 minutes -- sorry, pal, that is your job, not the dishwasher's.   In the meantime he stood there and folded boxes, never offering me a water or asking how the food was -- that's sad.<br><br>We'll only be back if they lower their menu princes or increase the very tiny portions!  This model is not sustainable!", "pics": null}}, {"review": {"des": "Cozy little corner bakery / cafe. Try the strata (savory bread pudding). Great medium roast strong brewed coffee. Oatmeal raisin cookie rocked as well. Eclectic decor in the dining area. <br><br>I'll be back.", "pics": null}}, {"review": {"des": "Yes. Updated to 5+++ with stars because they are consistent and i still love their desserts, ambiance & service. And the new matcha almond cake is so moist!  (excuse the half eaten photo i couldnt put it down)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BjtSj576RsPqJTdVbVL8Hw/168s.jpg", "caption": "The coconut cream pie. ULTIMATELY the absolute BEST ever coconut cream pie ive ever had. Sorry bang bang, hoosiermama."}]}}, {"review": {"des": "This place won't disappoint if you are looking for good food in a cute diner setting.  Blueberry scones and the ham and cheddar scone....life changing.  The pie, sandwiches, quiches, soups & bread omg...<br><br>The only problem I have is choosing what I want as there is not enough stomach room for it all!", "pics": null}}, {"review": {"des": "Did not have any pies or desserts but the BLT was delicious.  Seating is limited so I'd call ahead.  Serve your own water and to have your coffee refilled you need to bring it to the counter.  You order at the counter and then food is brought to you so don't expect a traditional waiter.", "pics": null}}, {"review": {"des": "My husband and I had a really fun lunch at Spinning J. I got the lemon drop soda topped off with vanilla bean gelato - a perfect combo. I liked my BLT a lot, it had like a tomato jam instead of tomato slices. I would absolutely come back for a quick yummy meal, some pastries, or a soda float.", "pics": null}}, {"review": {"des": "Out of this world key lime Hibiscus pie. Perfect sweetness, you wouldn't feel smothered with sugar at all. And coffee - salted caramel soy latte - what a wonder! Blue cheese biscuits are a little overrated. Recommend to go earlier in the day when they have everything, we went in the evening, which limited our options but the PIE!", "pics": null}}, {"review": {"des": "A-<br><br>Pros:<br>Fresh well prepared food<br>Delicious pies <br><br>Cons: <br>Limited seating <br>Small menu", "pics": null}}, {"review": {"des": "I discovered this morning that Humboldt Park is the Hipster epicenter of Chicago and nestled in it is the delightfully charming Spinning J old fashioned soda shop and bakery. <br>This is clearly the perfectly crystallized vision of gritty down to earth hipster snobbery, a snobbery of authenticity and craftsmanship, manifest as a pie shop.<br><br>I live for a good slice of pie, and it is phenomenally rare to come by. <br><br>I am truly grateful to find a slice of by that doesn't break my heart with disappointment.", "pics": null}}, {"review": {"des": "I love this place, their delicious shakes and the people who work there! It's charming, authentic, urban chic vintage and has a lot of character. <br><br>Stopped in just before closing for a shake. Even though they were closing soon, they we're welcoming and hospitable and made us our shakes, despite going past their closing  <br>time. They let us stay and finish them as well. <br><br>I had one of their special of the month or week flavored shakes which wasn't in the menu but was outstanding so if you're going in for a shake be sure and ask about the specials.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0YKG6Yuyd84KFEnD9bZMmw/348s.jpg", "caption": "Seasonal special, Thai Ice Tea Milkshake with homemade whip cream. Excellent."}]}}, {"review": {"des": "Spinning J has yummy pies and great quiche. See grasshopper pie photo--peppermint chocolate mousse pie. Great coffee to. Owner is a gem.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/x_yiuKWsj6yTD9V5e_fhSA/348s.jpg", "caption": "Grasshopper pie--peppermint chocolate mousse."}]}}, {"review": {"des": "This place is so worth the money!!! The breakfast is delicious, the drinks are delicious, everything tastes homemade and the decor is great too. I might come here every day if I can, lol!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/b-07XzutXxIEckQMKE7kSQ/348s.jpg", "caption": "Best Thai tea I've ever had... is a milkshake?"}]}}, {"review": {"des": "This place is right on the corner of Augusta and California-- an intersection I don't normally venture out to.<br><br>But I'm SO glad I did. Went here with a girlfriend on whim. They have fantastic pot pies. We went for the Saag and Paneer one, along with their quiche. Both were divine! So flavorful and the perfect size for us both to enjoy and pick at. Also got a chocolate shake and watermelon hibiscus crush to wash down our pot pies. We went a little pie cray, because we wrapped up the experience with an incredibly decadent slice of blueberry pie. Cannot wait to go back. Also, the folks who work here are extraordinarily pleasant. Was such a refreshing experience!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ep3Pq9VoUKB-O22EFbBB7w/348s.jpg", "caption": "The most photogenic blueberry pie I ever did see."}]}}, {"review": {"des": "A step back in time with a nod to food and treats made with quality ingredients that a foodie would approve of. The place isn't particularly large and it's very popular so expect a bit of a wait on a nice day, don't be discouraged if the line is out the door, because there isn't that much room to wait inside, so it isn't as tragic as it looks. Perfect place to bring the kiddos, or even for a fun coffee and dessert date.<br><br>I've also stopped in and brought food home, it was packed up with care and made the trip without falling apart. I've brought quiche home from other places and have had it look like scrambled eggs. When eating in I've found the service to be friendly and fast even while every seat is taken. Great tasting coffee, and solid lattes, although for me I need that extra shot. <br><br>I'm so glad I don't live nearby, I'd easily be 20lbs heavier.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_G-ntPELXc8ELC88R7cX1A/168s.jpg", "caption": "Sourdough Strata"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/j3D_QNdDK5nfuxS6Bb8vBQ/168s.jpg", "caption": "Mmmmm!!!"}]}}, {"review": {"des": "This is a beautiful establishment. Their baked goods are world class and their service is amazing. Go here!!!!!", "pics": null}}, {"review": {"des": "Love this spot. It's so homey and has great pie. I feel like I'm at a nicer version of the Double R Diner from Twin Peaks. It's a simple spot with great food. Take a friend here to chat or bring a good book to read. Will definitely return!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2f_dmnSseOCcI_fUzvSxpA/348s.jpg", "caption": "Honey cashew coconut pie"}]}}, {"review": {"des": "Simply amazing. We walked in early Sunday morning to a quiet peaceful ambience fueled by soft 60's music. Two breakfast sandwiches and a sourdough cinnamon roll that we couldn't have enjoyed more if we tried. Only visiting Chicago for the weekend, but will definitely be back next time round.", "pics": null}}, {"review": {"des": "Get the breakfast sandwich with bacon. Omg. So yummy. Our out if town guests still talk about it. <br><br>Great lunch options too. Love this neighborhood place!", "pics": null}}, {"review": {"des": "Great place for breakfast with affordable prices. I ordered the \"Spinning J Breakfast sandwich.\" Everything is freshly made in house! The English muffin was toasted perfectly. A soft chew combined with a buttery taste.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/okoyf4P9JDl7LTVBA8FvDQ/348s.jpg", "caption": "Great place for breakfast! I ordered the \"Spinning J Breakfast sandwich.\" Everything is freshly made in house!"}]}}, {"review": {"des": "Sweet mother of lattes! This place is beyond incredible. The vanilla latte was delightful and the potato pepper quiche was the finest quiche I have ever consumed. <br>Also, the service was top notch. Very knowledgeable and friendly staff. Highly recommend this gem of a restaurant.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gpuDEqfWmcEGhT62L8K9RQ/348s.jpg", "caption": "Vanilla latte + potato pepper quiche"}]}}, {"review": {"des": "Such a cute place! They don't have too big of menu, I ordered the strata which was great. Not too expensive and a large piece of it with a ton of veggies. <br><br>The overall vibe was very chill and cute, including the lotus flower lights above the tables. You order at the counter upon arrival and sit wherever available seating is between the bar and a few tables. Pretty small place with great food and even friendlier staff!", "pics": null}}, {"review": {"des": "Might be the best food spot we stopped by during our trip in Chicago. <br><br>It might be that I didn't have any expectations walking in but I thought the breakfast sandwich and the quiche were great. My friend ordered a cherry peach pie and it was a great blend. <br><br>I wish I tried a meat pie.", "pics": null}}, {"review": {"des": "Awesome little place for sweets and savory foods! Their milkshake is addictive. Their breakfast sandwich with bacon is just the right size and the flavors really meld well together. This makes a cute first date place too, if that's your thing.<br><br>The area can be dodgy, so be careful walking or where you park your car. But once inside, it's warm and safe and cozy!", "pics": null}}, {"review": {"des": "Yoooooo, this place is 10/10. I went in today for the first time and every aspect was as good as it possibly could be. The food was insanely good, the atmosphere was perfect, the service was great. Seriously no complaints. My mind was kinda blown at how incredible a food spot could be. Will be back, and will bring anyone I know.", "pics": null}}, {"review": {"des": "This is the best pie in Chicago, hands down, no competition! The shop is utterly adorable, a vintage soda shop with so much charm. The food is absolutely incredible -- do NOT miss the key lime hibiscus or the s'mores pie!! But the savory dishes are delightful as well, and the sodas and gelatos too! The owners are really wonderful folks who support their local community. Do NOT come to Chicago without trying a slice of pie here! We buy whole pies at holidays because there's just no use in trying to top Spinning J! Homemade can't even compete.", "pics": null}}, {"review": {"des": "Strata is very tasty and satisfying. Interior has the tone of the movie the shape of water", "pics": null}}, {"review": {"des": "I love that we have a soda shop in the middle of the city. There was a really great soda shop in the middle-of-nowhere Michigan that I used to go to all the time for coke floats and Spinning J left me really nostalgic. <br><br>The decorations are very retro and you immediately feel like you've been sent back a few decades. Even the lamps at the booths are just dim giving the place an aged feel. <br><br>We got a lime soda, coke float and the hibiscus key lime pie. 5/5 on the pie!! But I'd say the homemade soda flavors aren't the best I've had. Loved the cool paper straws with the designs on them!<br><br>I'd come back for the pie and the experience... maybe to bring a friend from out of town to a cool dessert spot.", "pics": null}}, {"review": {"des": "Amazing pie place!! Definitely visit again! <br><br>I always go to the next door, CC. Ferns, but I was wondering this place and finally tried one sunny afternoon on weekends. It turned out great!<br><br>As everyone reviewed, pie was just amazing! It was my first time trying S'more pie. It looked a little too much, but you cannot stop eating. It was soooo good with toasted marshmallow, moose inside, and nice crust of the pie! I need to try other pies as well. They have all kinds!<br><br>My husband got a cup of coffee and it was great! I got a latte w/ almond milk because I'm on weight loss and it has less calories than whole milk. I wasn't a big fan, but it's ok. It was my first time to try milk alternative, so I don't know if it's just as it is or not. <br><br>I like both exterior and interior. They have a cool bar counter, too. The size of table was a little bit small, but it's a good size for one person to work on PC.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/c6EHR4J6yS2OejGOesIzaQ/348s.jpg", "caption": "Latte w/ almond milk, coffee, and s'more pie"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4lYgOHlK82OAniNL6bs2xw/168s.jpg", "caption": "Flower on the table"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/73Pz_GdTdyPTfcbhEXPHeA/168s.jpg", "caption": "Inside"}]}}, {"review": {"des": "The space is beautiful. The staff are sweethearts. I've been here dozens of times since they opened and I STILL have an agonizing time deciding what to get because EVERYTHING IS PERFECT. I highly recommend the smoked trout bialy, tuna melt and beet reuben! Obviously you want to save some room for pie, too, but you already came here knowing that. Get a few slices between friends and try to get a bite of everything.<br><br>Also, while I'm thoroughly hooked on the aforementioned menu items, they make the best quiche I've ever had, extra fluffy English muffins and a meeean blue cheese biscuit.<br><br>Go get you some carbs. You deserve it, baby.", "pics": null}}, {"review": {"des": "It is no surprise that this place has consistently held 5 stars. I would give them 10 if I could. The food, especially the cinnamon rolls and breakfast sandwich are to die for and I literally have dreams about them. The atmosphere is vintage old world charm reminiscent of the soda shop era without trying too hard and the staff is laid back, incredibly efficient and always working on something. You won't see anyone standing around in there. They also possess an effortless friendliness that is genuine and not forced which is incredibly rare. Spinning J is everything you want from a neighborhood spot and although I want to keep it to myself, everyone should know about it.", "pics": null}}, {"review": {"des": "Spinning J is one of my favorite places to go to for dessert in Chicago. The only problem is that it's a bit out of the way for me! When we went, we had a watermelon hibiscus crush soda, chocolate malt shake, and key lime pie. (This was all before we went out for actual dinner -- we were stuffed.) Everything tasted amazing, and my sweet tooth definitely got its fill. The place itself is very cozy with a small diner vibe. <br><br>Also, if you're not much of a sweets person, they also have great savory options! I wish I'd gotten to try them (always a next time!) But they have meat pies and breakfast options too!", "pics": null}}, {"review": {"des": "You'll love the feel AND ice cream cones made of pie crust! I was ready to eat by the time we decided to have lunch at 1:30 pm. A few of us from the Plein Air Painters of Chicago picked that corner, California and Augusta to tackle some urban storefronts. I focused on the Clipper Lounge but kept seeing the sandwich board propped on a wagon for the Spinning J. It just intrigued me. Once inside it even got better. It's an old diner! Spinning stools and dark granite counter, cool way before its time. I had a tunafish sandwich. Sounds simple right? It was and it was complex too made with watermelon pickles - absolutely perfect.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FhHK_iq6tLCZKKHL8gNLgg/348s.jpg", "caption": "While painting at California and Augusta, the Spinning J drew me in."}]}}, {"review": {"des": "I'll definitely be making return visits to Spinning J. We (2 of us) came for a weekend lunch. The place was close to capacity when we walked in, but as we were ordering a booth thankfully opened up. Otherwise we may have had a hard time finding a place to sit. I ordered the pb&j milkshake, which was really delicious and nostalgic. We both loved it. The coffee here was good too. For food we got the strata (with broccoli, onions, and cheese) , which was also very tasty, perfectly cooked, crunchy bits on the outside and soft/moist on the inside. The BLT was also good, but the crust of the bread was really hard to bite into. Overall a very nice lunch. There are also some fun shops nearby for exploring. If the place is crowded you could also get your food to go and make the short walk to Humboldt Park for a picnic.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MSH3uIaiwo0LjLOtG2Z6hw/348s.jpg", "caption": "PB&J milkshake. Get it."}]}}, {"review": {"des": "Out of this world pies! They are all amazing but I just had the Lemon Lavender Easter Egg pie and OMG I never want it to end.", "pics": null}}, {"review": {"des": "Ordered Thai Iced Tea shake here and several different pies... I'll have to update this review,  but will definitely be going back!!!!", "pics": null}}, {"review": {"des": "Really chill place.  Old soda shop turned into bakery and breakfast.  Had the breakfast sandwich on a biscuit.  One of the best in the city.  Got a cookie for breakfast dessert", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VjUnjYiaq4XYZJMzSFgbnw/348s.jpg", "caption": "About 6 tables and a cool soda bar seats."}]}}, {"review": {"des": "I enjoyed this place! The decor is nice and retro.  I had the S'mores pie which was very delicious, while my friend dined on the Apple pie.  I thought the Apple pie was a bit tart and lackluster but pretty decent.  Overall I would say the pies were solid.  Definitely delicious and definitely worth the bite.  I also had a grapefruit ginseng soda... I was very hyped for it but it was a tad too sweet. One to two less pumps of simple syrup and it could've been delicious.  Oh well... still a great place for low-key humble  dessert.", "pics": null}}, {"review": {"des": "I had dessert here on Tuesday with my husband and friends and really enjoyed it. Hubs and I split a slice of hibiscus key lime pie and a PB & J milkshake, both of which were amazing. The key lime pie was less dense and definitely fluffier than a typical key lime pie, but we preferred it that way. The shake came with the mixer cup with the rest of the shake that didn't fit in the glass serving ware. Our friends had the smores pie (also yummy) with a chocolate egg cream soda and a homemade bay rum cola. Chocolate egg creams are a special treat when you can find a retro place like this that makes them! The bay rum cola was delicious, with a hint of baking spices in the syrup. Black dog gelato is also available here in addition to a number of other pastries and baked goods. Definitely worth a visit!", "pics": null}}, {"review": {"des": "Molasses cookies are wonderfully chewy and full of molasses flavor! I would love a dozen of these to eat by myself, not in front of another person, so I wouldn't feel as selfish as I'd be!<br>Hibiscus key lime pie was beautiful, pink, luscious flavor and not as sweet as most key lime pie, graham cracker crusted and served with whipped cream as a garnish. I highly recommend it! I think this pie would be a terrific special occasion dessert to order, pick up and serve at a home-based dinner party! I think restaurants should contract for this pie to serve!<br> Coffee is excellent, flavorful, full-bodied with self-service refills.<br>This is a tiny beautifully appointed place. The bar which provides counter-type seating is beautiful and an antique displaying such admirable workmanship! There are upside down glass lotus blossom light fixtures.<br>When you enter, there is a tiny display case as well as a blackboard of daily specials. Decide what you want and place and pay and tip at the register. You will be given a number and it is up to you to find a seat somewhere. Take your number with you, that's how the runner will be able to find you with your food and drink. <br>Not a place for large groups. Frankly I was angry with the two separate souls who were each occupying a booth for 4 people while the rest of the customers were having a hard time finding seating, let alone seating for a group of 2 or 3 or 4! <br>This is not a place to park all day hogging a table with a cup of coffee and your paperwork, books and laptop! <br>The decor is beautiful, the pastries are very tasty, the coffee is excellent, and the staff is pleasant, efficient, and helpful. <br>Very clean and no dirty tablets waiting to be cleaned. The staff stays on top of that!<br>Street parking was not a pain at midday during the week.<br>Except for the rude people occupying too much space for far too long with their laptops, I highly recommend the Spinning J Bakery and Soda Fountain!", "pics": null}}, {"review": {"des": "Get the saag paneer pot pie and the bread and butter. Just do it. Trust me.", "pics": null}}, {"review": {"des": "Adorable space, fantastic food, and wonderful baked goods. While it is usually quite busy, I have somehow never had to wait for a table (how does that work?). Enjoy!", "pics": null}}, {"review": {"des": "Charming luncheonette. This place is the perfect mix of vintage and hip. The light menu of breakfast, lunch and sweets has something for everyone. You order at the register, find a seat at the counter or in one of the comfortable booths, and they bring your order to you. <br><br>One lunch was delicious -- an eggy red pepper quiche with a tossed green salad, a blueberry scone and a sugary peanut butter cookie. Another not so much -- the beet reuben was a terrible idea (this from a guy who likes beets). Coffee comes in 3 sizes and refills are $1. <br><br>Service is friendly, the decor is beautiful, abd the diner is very calm. People relax over coffee, take their time and read. I went at lunch time, I'm guessing after school can be busier and noisy with kids. In fact I saw a mom place her baby on a counter while she ordered; I'm not sure I like having baby bottoms on food surfaces. Still the place is charming, like grammar school for older folks.", "pics": null}}, {"review": {"des": "This place is amazing. Everyone is super friendly and the food is amazing for breakfast, lunch, dinner, or dessert.<br><br>Try their s'mores pie or guava passionfruit cheesecake pie. We usually get both!", "pics": null}}, {"review": {"des": "Been wanting to try this place since it had raving reviews and they're right down the road.  Right when you walk in, it definitely takes you back decades when  people sat at the counter ordering pie with some coffee or having an old soda fountain drink.  The decor in the place is cool. A lot of the things seems original down to the booths and the stools at the counter. We had a piece of the strawberry cheesecake, I had a biscuit and for drinks we had the watermelon hibiscus soda and the bf had ginger lime soda. First the cheesecake was really good and super light.  They also added their own homemade whip cream. The biscuit was buttery which I put their homemade jam on and it came warmed up just the way it should be. Both sodas were good, but his was a bit too acidic but mine was really good.  I would definitely go back.", "pics": null}}, {"review": {"des": "Last night we tried the individual chicken pot pies. Perfect double-crust and loaded with delicious chicken and veggies. A definite do-again-soon. Banana cream pie was excellent, too. No wonder these folks get such great ratings! Comfort food at its very best.", "pics": null}}, {"review": {"des": "Spinning J is one of the most unique restaurants in Chicago. It has an old school feel. They have an interesting menu as well. Their pies and sodas are so good. It's a restaurant that everyone should go to at least once.", "pics": null}}, {"review": {"des": "Shakes are out of this world!  So are the pastries.  I love this corner of California and Augusta.", "pics": null}}, {"review": {"des": "I got a huge chocolate chip cookie and a chocolate shake and, what can I say, my life has drastically improved. I came here to write with a friend and the atmosphere here was perfect! Also.. did I mention the chocolate shake? Oh I did... my bad. Anyway, GO HERE AND EXPERIENCE THE BLISS! This place is great for casual lunch, brunch, or just grabbing coffee with friends and also... seriously. Chocolate. Shake.", "pics": null}}, {"review": {"des": "The food is great, but the service ...oh...my...god. we stopped in to get 2 slices of pie to go. They ring up the sale and then put the order in line with everything else including people at tables ordering meals that need to be cooked. Literally 15 minutes later, would somebody PLEASE cut me a slice of pie? It's right there. Maybe I did not tip enough? I don't know, but now I don't even want the stupid pie.", "pics": null}}, {"review": {"des": "Spinning J is a modern, yet still vintage, take on the soda fountain. The first things I noticed were the vintage fixtures everywhere--the marble counter, the seating, the lights. The ice cream and soda menu is where modern takes over...along with Black Dog's super premium gelato, you'll find creative and eclectic soda creations and bakery items made on site. <br><br>All their soda syrups are made on site...and these are not just plain jain flavors. I opted for a watermelon hibiscus soda topped with vanilla gelato.  Not only was it the prettiest shade of pink/red effervescence but it was refreshing and delicious.  My husband got the butterscotch soda with a scoop of butter pecan and it was creamy without being overly sweet. My son gobbled up his vanilla and dark chocolate scoops of gelato-he's a huge fan already. <br><br>The pie menu looked delicious and the scones beckoned (particularly the bacon cheddar scone), but that I will save for another visit. A great addition to the Agusta/California corridor.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gf2j51WPcuP3ye0EsTan5A/348s.jpg", "caption": "Watermelon Hibiscus soda, scoop of Vanilla gelato"}]}}, {"review": {"des": "I came here with the boy. We both ordered scones (blueberry and everything scones; they were both very delicious) and a root beer float with vanilla ice cream (ice cream was frozen like a rock and very icy).<br><br>Service was a bit slow considering we were maybe one of three couples in the store? Scones were already sitting in the display case.<br><br>Overall, I would come back for the scones.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hoK0Kv4dZZjtHopEgx7fQw/168s.jpg", "caption": "Root beer float with vanilla bean gelato"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/udoFpqni4rRgfhjvYem4tw/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "Such a cute spot for some pie, shakes, and handmade sodas! They also offer sandwiches and other food items that I didn't have a chance to try yet. The dessert counter with cookies and other items looked so delicious as well. I'm a tough pie critic and was really impressed with the pie here! The s'mores pie is absolutely delicious and decadent. I am really eager to try the bananas cream the next time I'm in. Looked amazing and I heard great reviews. Can't wait to go back!", "pics": null}}, {"review": {"des": "I want to say something so badly that hasn't previously been said, but I'm speechless. The qualify of items, the staff friendliness, the unique ambiance, the affordability of high qualify baked goods. The breakfast sandwich. The everything.<br><br>Needless to say, whenever I'm in the neighborhood I find myself magically appearing here.", "pics": null}}, {"review": {"des": "The pies are amazing! The style and ambience are also unique. Great spot in the neighborhood.", "pics": null}}, {"review": {"des": "I love this spot! From the decor to the friendly staff and of course the delicious concoctions they whip up. The daily pie specials are always on point and the malts and shakes come in unique flavors. This is also one of my favorite spots for a quick breakfast, get the breakfast sandwich and an iced coffee to kick off a great day in Humboldt park. I love supporting this local business in my backyard", "pics": null}}, {"review": {"des": "This place is just darling!  The booths and counter seating, the retro lights, and the mauve and gold wallpaper scream 1950s in the best way possible.<br><br>The whole menu is so appealing:  sodas, milkshakes, gelato, pie, and more.  My husband had a slice of key lime pie which looked really good, and there was also key lime hibiscus pie on the menu which sounded even better.  I had a soda, Chocolate Egg Cream, and decided on a scoop of Butterscotch Bourbon Pecan gelato in my soda.  The chocolate was not too rich, because this is soda and not a thick milkshake.  If you've never had a real soda before, the texture and flavor may surprise you!<br><br>All of the sodas are homemade, the cola was not as carbonated as Coca-Cola, but the flavor was so much better.  There are some creative soda flavors too that I would have liked to try.  The gelato is from Black Dog, but I believe everything else is made in-house. <br><br>There's a lot going on at this intersection, do dinner across the street, maybe some drinks, and dessert at Spinning J's!  Parking on the street was super easy too.", "pics": null}}]}