{"name": "sprinkles-cupcakes-chicago", "reviews": [{"review": {"des": "First time having Sprinkles. Apparently their Hazelnut cupcake is a late night Saturday flavor? Correct me if I'm wrong!! A friend and I came about thirty minutes before closing and the atm line was longer than the one inside. <br><br>Curious, so my friend and I went inside. They only had four to five flavors available inside. My friend got the sugru free red velvet. Didn't hear feedback on it though.<br><br>First bite of the cupcake I had? Overwhelming because I was not expecting the top layer to be solely icing. The best part of the cupcake was towards the end where the hazelnut spread was. Nothing beats Nutella! I really enjoyed the Hazelnut cupcake. <br><br>Worth coming on a Saturday night? You know it.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/y6piYtCu-QgsibRmDN7R2w/168s.jpg", "caption": "Hazelnut"}]}}, {"review": {"des": "Firstly, this place looks amazing. They have a cupcake ATM outside. That just blew my mind. Once you go in, the place smells like cupcakes. One of the biggest turn off was the price. It was crazy expensive. On an average a cup cake costed $4 and just a little bigger than golf ball. It might be the greatest cupcake in the world, i don't think i would pay that exorbitant price for 1 cupcake. <br><br>Consider buying a dozen lol. Never.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4oFur2KDcuknUUr9kazmOw/168s.jpg", "caption": "Atm for cupcakes"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6Bg_Y3BuKTeDg8WicNc7wQ/168s.jpg", "caption": "Cupcakes."}]}}, {"review": {"des": "I really liked the idea behind this place, a vending machine for cupcakes. It was located right outside of the actual store for anyone looking for a quick cupcake without having to go in.<br><br>I can't say it was a great cupcake, specially when you can walk a mile or so and end up at Magnolia's bakery. The icing was sickly sweet, but the cupcake itself (the cake part) wasn't bad, it was moist and flavorful.", "pics": null}}, {"review": {"des": "I love that they have two different gluten-free cupcakes now.  <br><br>What I don't like is overflowing trash cans, filthy table tops and sloppy cupcakes.  My lemon blueberry GF cupcake was purple.  I think they tossed the blueberries in when the mixer was going, thus popping the berries.  :(", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iTg6Jmt0B1YkMhbmkDyM8A/348s.jpg", "caption": "This store needs to spend more time cleaning. Overflowing garbage INSIDE and outside in front of store. Extra staff needed on Saturdays!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HRxggo-7OaXDUvYrcWLhlQ/168s.jpg", "caption": "This store needs to spend more time cleaning. Dirty tabletops and floor filled with trash and crumbs."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DnHqa8qfvZ_tIO5I7riU1w/168s.jpg", "caption": "This store needs to spend more time cleaning. Used cups left by previous customer. Dirty tables and floors."}]}}, {"review": {"des": "Sprinkles is a simple yet delightful storefront with a variety of delicious cupcakes that will make your eyes jump out looking through the glass. I went with the the black and white cupcake, which is the best chocolate flavor on the menu in my opinion. My husband got the Christmas cookie special which he went on and on about how much he liked it. Their 24/7 cupcake ATM is such a unique feature that adds convenience for everybody as well!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/H0ZhiFOCgyBGLfVtqeGkew/348s.jpg", "caption": "Black and white cupcake. My favorite!"}]}}, {"review": {"des": "\"Ehhhhhhhhhhhh\"<br>Me and my husband went here because we heard so many things about this place and we were in town. <br>So we got a train ticket and went there and the line wasn't bad. <br>We got Red Velvet, Vanilla, Chocolate Milk, Cinnamon.<br>My favorite was the Red Velvet, you can tell is also peoples favorite because they had a lot of those. <br>The Vanilla wasn't bad but it tasted like cupcakes from couple days ago.<br>The Chocolate Milk didn't have much taste. I didn't feel like trying the cinnamon one after i was very disappointed but my husband said it was okay. <br>I would go once but Ive had better. If you want to try one they have mini sizes as well.<br>I gave it 3 stars because the staff is very friendly, if not i def would give them 2.", "pics": null}}, {"review": {"des": "These are my favorite cupcakes hands down!  so I try to visit every state that has sprinkles cupcakes. I was introduced to sprinkles about 5-7 years ago, ever since I've been ADDICTED.<br><br>The best part of sprinkles cupcakes is that they aren't too sweet, when it comes to desserts sometimes they can look good but after a few bites it gets too sugary and overwhelming. Sprinkles provides a variety in flavors to choose from, my personal favorite is the chocolate with the coconut on top and the classic red velvet. The cupcake is moist with the perfect balance of sugar with the frosting on top. Frosting is not too heavy and sugary like other places and has a great taste to it.<br><br>This specific location even has a \"cupcake ATM\" where you can get a cupcake from the machine. The price for one cupcake is about $3 which I think is not too bad a fairly priced for such scrumptious dessert.", "pics": null}}, {"review": {"des": "These are some good tasty cupcakes. Got a banana one and a milk chocolate cupcake on my last visit. They are normal sized cupcakes no jumbo cupcakes here. Sprinkles is some kind of corporate cupcake chain. I enjoy the cupcakes but always question if the prices they charge are reasonable for cupcakes. Genuinely don't know but boy are they some sweet treats.", "pics": null}}, {"review": {"des": "I came here on my birthday, while traveling for work, in need of a cupcake.  We got three of them. <br><br>Chocolate cupcake with vanilla frosting - this was the best one.  The cake was super moist and delicious. <br><br>Cinnamon - a cream cheese frosting that tastes like churros.  However the cake was a little on the dry side. <br><br>Sprinkles - you have to get the bake sale cake.  This one was my least favorite.  A little on the dry side and found the sprinkles to be crunchy.  <br><br>What did I learn today?  I love the cake ATM up front.  Instead of dispensing cash it dispenses cupcakes.  Truly brilliant!", "pics": null}}, {"review": {"des": "I have to say, I was really impressed with these cupcakes. It's currently November and their fall flavors, pecan pie and pumpkin were dynamite. I also got vegan red velvet, and it was pretty spectacular. Let's be honest, most people choose red velvet for the color experience, and the color of this red velvet was the deepest, decadent, garnet red I've ever seen in a cupcake. It was truly beautiful, and actually sort of mesmerizing, I was just staring at it in my hand, admiring the color lol. And tasty! You'd never know it wasn't made with dairy, eggs, etc. The dark chocolate was simply divine. The cake wasn't too sweet and balanced out the frosting really nicely. Each cupcake was a pleasure to eat, and the only reason I'm rating it 4 instead of 5 is because for me Jennivee's Bakery still reigns supreme as the best cupcakes in Chicago. If it were possible I'd rate these 4.5", "pics": null}}, {"review": {"des": "Cute cupcakes, fun flavors, and efficient service. Not special enough to pay $8 for 2 cupcakes more than one time, though.<br><br>I can see why this place is popular; the interior and the cupcakes are Instagram-worthy. The cake part of the cupcakes is very good, but I honestly think there's a bit too much icing for my taste. It was deceiving based on how they looked- I would say there's about an inch of icing. For icing lovers, this would be ideal- but it was just too sugary for me.<br><br>Still, these are cute cupcakes and the flavors are good. I wanted to try the cupcake ATM (which is just such a cool idea), but it was cold out so we wanted to eat inside.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/x5lHB5ZlV084mnuupLsuOA/168s.jpg", "caption": "Cupcakes"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YG3WzVjRmS7_4K2j1ZhsVw/168s.jpg", "caption": "Chocolate chip cookie cupcake and sprinkle cupcake"}]}}, {"review": {"des": "I ran over to Sprinkles for a gift.  What I got was my gift and a lot of inspiration from William.  Trust me this kind of service does not happen everyday!  Thank you William!!", "pics": null}}, {"review": {"des": "The Chicago Sprinkles store is absolutely beautiful with gorgeous architecture and creative design, along with its famous Cupcake ATM right out in front of the store. It is a smaller, cozy atmosphere with a few seats incase you want to sit in front of the window and admire the city view while enjoying your cupcakes. The idea of a Cupcake ATM is pretty amazing and allows you to pick up cupcakes of your choice at any time of the day or night.<br><br>There are tons of flavors to choose from, and I tried the Red Velvet and Peanut Butter Chip. They were both delicious, and I would recommend trying these for sure! The cupcakes were very fresh with rich, creamy frosting. In addition to the flavors I ordered, they have tons of others, along with special seasonal offerings. There is actually a really cool menu on their website that shows what cupcakes they will be serving on which days every single week! <br><br>Overall, I had a wonderful experience at Sprinkles. It is a fun atmosphere with friendly staff and unique offerings. I would recommend trying Sprinkles, and I will definitely be going back on my next trip to Chicago!", "pics": null}}, {"review": {"des": "Dear Sprinkles, <br><br>Please open up a location in the suburbs! Say, Schaumburg or Rosemont? Just a suggestion. <br><br>Sincerely,<br>Trisha A.<br><br>Sprinkles is my favorite cupcake place in Chicago! The cakes are moist and I am in love with the icing. It is the perfect amount of sweetness. My favorites are their dark chocolate, chocolate marshmallow, peppermint, and s'more. (Can you tell how much I love chocolate?!) <br><br>I understand this loca is just for pick-up or a quick bite, since they have a long window table and a few high chairs, but it would be nice if there was a bigger location so people could enjoy the cupcakes there. Love the ATM machine, though. It's very useful for when the lines get long and people are waiting outside.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/v9Nfydn-ixeOeXNf2XwrbA/168s.jpg", "caption": "Summer '17 -- IG: @triishful_thinking : follow me! (shameless plug)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-fD8I4xNTZTB2f9-iVaLwg/168s.jpg", "caption": "December '17 -- love their member perks!"}]}}, {"review": {"des": "Hands down my favorite cupcakes in the Chicagoland area. I still remember my first experience at Sprinkles there was a minor celebrity there and there was a line out the door but everyone was there for the cupcakes and not the celebrity to the celebrity manager's dismay. (this was a day before the cupcake ATM existed) But since then the ATM in my opinion has sped up cupcake acquiring. <br><br>My PERSONAL favorite cupcake of all time at Sprinkles is the S'mores Cupcake - dark chocolate ganache, graham cracker base, and the torched marshmallow top - nothing short of perfection. I like that Sprinkles cupcakes aren't TOO sweet. Too bad it's limited time - but maybe I wouldn't be so crazy about it if it weren't. I thought the recent breakfast cupcakes were fun too - tried the Captain Crunch one and enjoyed it even though I don't like Captain Crunch. <br><br>My usual go tos though are either the Chocolate Marshmallow (seeing a theme here?) is my personal favorite or the Black and White which is my sister's favorite. Both are good. I wish they served the ice cream at this location! I found out they didn't serve it when I went in trying to obtain the limited time Black and White ice cream. But the one cupcake I regret missing the most is the Creme Bruleed Cupcake. PLEASE BRING IT BACK. I WILL MOST DEFINITELY GO AND BUY IT IF YOU GIVE ME A SECOND CHANCE. (please put in a nice word to Sprinkles corporate or whatever other governing body can make this happen!!!)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2VBkt80ugU1_vIuduUVqWA/168s.jpg", "caption": "Raspberry Chocolate cupcake for the month of February!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vcKJ_lqV_qBr25rl-eZPwQ/168s.jpg", "caption": "Smores  cupcake"}]}}, {"review": {"des": "Not my favorite cupcake place in Chicago...but they make moist cupcakes!  <br><br>I've sampled many of the cupcakes over the years but my favorite is their red velvet cupcake which has cream cheese icing.  I'm not a big fan of their signature sugar dot on top though.  <br><br>They do customized cupcakes for showers!  We got cute baby girl ones.  <br><br>TIP: <br>1. They have a cupcake ATM that you can buy from.  <br>2. You can sign up for sprinkles perks for various rewards and a free cupcake on your birthday", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gaivmSsOEH1VonOY779VOg/168s.jpg", "caption": "For a baby shower"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/F45MmEgWgjKsBB-mbMDSvw/168s.jpg", "caption": "For a baby shower"}]}}, {"review": {"des": "This is coming from someone who doesn't have much of a sweet tooth- Sprinkles Cupcakes are GOOD cupcakes! They are not too sweet (think Crumbs cupcakes before they fell into oblivion) but actually moist cakes paired with the perfect proportion of sweet icing that doesn't make the entire concoction taste artificial by any means. I like the banana; my boyfriend likes the red velvet. Paired with a glass of milk, these treats are a nice way to finish off a meal or indulge yourself in before snuggling up into bed. I have no reason not to give 5 stars.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/J89mJBkExSX-BRUU4YSYyg/348s.jpg", "caption": "Cute holiday edition box"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CjXN5J7DmkDBj6TI2OwGgw/168s.jpg", "caption": "Left: Banana Right: Black and White (chocolate and vanilla)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/AvkkBA6LBANql7PvCxVVjA/168s.jpg", "caption": "Inside of the Banana cupcake. Look at that moist cake!"}]}}, {"review": {"des": "Really basic cupcakes!! If you do a blind test of sprinkles cupcakes with Walmart cupcakes, you won't be able to tell the difference ~~ I tried milk choc and strawberry cupcake ... the strawberry frosting was soooo sweet, literally was made up of just sugar !!! Can't believe how sweet it was ; gave me a headache !!! <br>The milk choc cupcake was so basic!! Again, the frosting was extremely sweet and just yuck!!! Had to throw it after couple of bites <br><br>I paid $8 for 2 cupcakes!! The price is totally not justified !! A flop show !!! Avoid this place if u don't want to get diabetes !!!", "pics": null}}, {"review": {"des": "Used to be my favorite cupcake place in Chicago, but disappointed with the quality today. The frosting tasted old (I got my cupcake at 1pm) and the cupcake was made sloppy. Right out of the bag the frosting fell off the cake part and was hard to eat. Bad ratio of frosting to the measly cupcake size.", "pics": null}}, {"review": {"des": "Very disappointed. There was only 2 flavors to chose from. When driving all way from the suburbs and only having my least favorite available was very unbecoming.", "pics": null}}, {"review": {"des": "Everyone seems to love this place and I just can't seem to figure out why. I think the cupcakes lack flavor and are dry. They just taste sweet and have no other distinct flavor.", "pics": null}}, {"review": {"des": "Wow..I went here on a Sunday Afternoon to purchase some holiday cupcakes and the line was out the door!  According to a patron behind me he had tried to purchase a cupcake at the Cupcake ATM on a Saturday Evening and stated that \"There was a line 30 people deep-waiting to use the ATM to purchase cupcakes!\"<br><br>There were only two staff members working (one on the cash register and another filling orders)-but they could have easily employed more people to handle the masses of cupcake enthusiasts waiting to order. <br> <br>People were even using the Cupcake ATM....which sells one at a time.<br><br>I purchased the Chocolate Peppermint Cupcake and the Gingerbread Cupcake...as always top notch-delicious, moist, and flavorfully delicious! As always the cupcakes are carefully packaged and sealed with beautiful stickers!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-U8JtVOcCU3IKSt-rjtFww/348s.jpg", "caption": "Gingerbread (left) and Chocolate Peppermint (right)! Nom, nom, nom...need I say more?"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gedKPWOPXjBaWbboqzoIvw/168s.jpg", "caption": "Box of 2!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HXq25Dj0sx1MIxG6Bnmq8g/168s.jpg", "caption": "Display Decorations!"}]}}, {"review": {"des": "Their gluten-free red velvet cupcake is amazing! The others tried the Cuban chocolate and also liked it.", "pics": null}}, {"review": {"des": "Fresh, delicious cupcakes! Amazingly clever flavors like Lemon Blueberry and Banana Split. But why Sprinkles?? THE ATM!! It is just far too clever and a fun way to buy a cupcake. This is the same bakery that is in Disney and has chains um, sprinkled around the US.", "pics": null}}, {"review": {"des": "Paid a visit to them on our recent trip to Chicago to claim my free birthday cupcake !! <br>Unfortunately they were out of the carrot, but they did have my second most favorite flavor: the chocolate cupcake! <br>They sure made my 30th birthday a whole lot sweeter! Thanks!!!!", "pics": null}}, {"review": {"des": "I ordered the layer cake for my daughters birthday celebration in Las Vegas. The cake was much smaller than expected if you could call it a cake. The layers of frosting were larger than the cake layers. At the price of $50, $40 for the cake and $10 for the message on top, the cake was terrible and a huge disappointment. I will never buy anything from sprinkles again.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5oJ5rQfsO2rqaYFJgJj-wQ/348s.jpg", "caption": "Red velvet layer cake"}]}}, {"review": {"des": "Not really a cupcake guy, but sweet-tooth friends mean i end up here a lot.<br><br>Their red velvet cupcake is a bit legendary, but to be honest with you i just come here for the cupcake ATM. I love how the door slides open. As if the gates of heaven open up..", "pics": null}}, {"review": {"des": "I'm going to change my rating from 1 to 3 stars based on service recovery. I was contacted by management and received an apology and complementary cupcakes. Who knows if I'll go back, but I appreciate the nice gesture.", "pics": null}}, {"review": {"des": "I like the cupcake machine more than the cupcakes and wanted my kids to experience the cool machine . Unfortunately, the machine was not working and I was pretty bummed", "pics": null}}, {"review": {"des": "I love Sprinkles and the Chicago shop is amazing!  On a recent visit, William was outstanding!  His attention to customer service was fantastic.  He took the time with each customer and truly exhibited exceptional customer service. <br>Well done William!", "pics": null}}, {"review": {"des": "I've heard about this place from my friends and I couldn't believe a cupcake ATM existed. This was my first time visiting Chicago and I found this gem downtown and I have to say it was pretty hidden. It's just as an ATM where you order from the machine and a cupcake comes out.<br><br>The cupcake itself was alright but I think the experience was also pretty cool to try out. I got the Black and White and I might consider getting the Carrot Cake next time I'm there!", "pics": null}}, {"review": {"des": "I tried the chocolate sprinkles cupcake for the first time. It was a bit on the dry side and would not get it again. The red velvet Chinese New Year one was perfect as usual", "pics": null}}, {"review": {"des": "I'm on a cupcake kick for some reason so I needed to try Sprinkles! The girl who took my order was super sweet. I think the people in front of me were extremely daunting because the cashier was completely frazzled and it took forever to pay for my two cupcakes. That's probably not his fault but the whole process took a lot longer than I expected. <br><br>As for the cupcakes-- i had a vanilla cake with chocolate buttercream and a banana cake with vanilla frosting. The banana was the clear winner- super moist, not cloyingly sweet. I would absolutely get it again. The vanilla/chocolate one was decent but the cake was a little on the dry side. I liked the frosting though and the chocolate sprinkles tasted more like rich chocolate shavings than plasticky sprinkles. I don't think I'd get this one again because for $4 each you want your cupcakes to be delicious!<br><br>I would definitely return and would more than likely try some new flavors.", "pics": null}}, {"review": {"des": "I have walked by this location many times and always said to myself I see this sprinkles cupcakes everywhere when I go to Vegas when I go to other places I always see this name, and people always tell me you need to go in try their cupcakes.<br><br>Well I was driving around the area again and I thought I would pick up some cupcakes to bring home for my wife to try and anyone else that might be interested.<br><br>Immediately when I walk in I see all the cupcakes and the glass shelves ...trying to figure out which flavors are best... Service was kind of slow there were two girls but only one girl was ringing out the other girl I can't really tell what she was doing but with three people in line it took around 10 minutes to be served. <br><br>I looked online to see pricing and they were stating half a dozen cupcakes would be around $15 I'm fine with that I understand it's a gourmet cupcake fine..<br><br>I end up going with the red velvet the dark chocolate the banana another milk chocolate and Smore's.<br><br>When I get to the counter area to pay the girls told me that will be $27!! Please cupcakes are good they are not $30 worth good.<br><br>I could not justify paying that much for these cupcakes. The only stand out part of some of the cupcakes, were the cream cheese frosting.<br><br>Some of the cake was dry on the red velvet others like the milk chocolate or dark chocolate ones the frosting felt too sugary.<br><br>Thats my opinion check it out for yourself. Parking kind of sucks in the area if you drive, and service can be slow. So be prepared to wait.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wFaeMc_u82Wz2RfMrPQaJw/348s.jpg", "caption": "Rather velvet,Banana, dark chocolate, Smore's, milk chocolate cupcakes."}]}}, {"review": {"des": "The cupcakes are delicious- especially the Strawberry. But my gosh- this location is awful. How long is the cupcake ATM going to be out of order??? Not only that, is impossible to keep a basic flavor like vanilla stocked?? You literally have a full kitchen in the back in order to keep up with demand. It's no wonder you walk in on a Sunday afternoon and the only few flavors available are Sugar free Red Velvet, Carmel salted and a few other random flavors- who wants that???", "pics": null}}, {"review": {"des": "The store is small and cute, the person that waited on me and the other person that checked me out was friendly and helpful, but the cupcakes were Average in taste.  This is based on one visit and the end if the day, but average.  We had two flavors.  The price we paid was way to high for the taste.<br><br>The only reason this is a 3 and not a 2 was the service.  I will try again if I get a chance and rescore if appropriate.", "pics": null}}, {"review": {"des": "Delicious!<br>Cupcake ATM?!  What a fantastic idea!<br>Cupcake was perfect, but frosting a tad on the sweet side.  Smells great when you walk in.  Would be great if there was more seating.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kltL7OcU38VlORCRvGWiDw/348s.jpg", "caption": "It does t get better than this!"}]}}, {"review": {"des": "Balance. That's what the cupcakes at Sprinkles had. Im typically not a fan of how sweet cupcakes are, but i found Sprinkles to be just right. <br><br>You must eat the cupcake, as, a cupcake. Don't eat the cake or frosting separately, bc one may find the cake bland, the frosting sweet...but together in a bite, its good and complementary. Im glad the moist cake was not sweet bc personally i couldnt handle if they were both sweet. I typically swipe off a lot of frosting, but found i did a lot less of that with Sprinkles, and ate quite a balanced amount of cake to frosting ratio. <br><br>I liked the black & white cupcake, the vanilla milk chocolate was also a classic good, i oddly found the Sprinkley frosting fun to eat bc of its texture. My friend loved her Red Velvet too. <br><br>Its not exactly a sit down kinda spot. I do wish it had a lil room to hang and have a drink with, its more of a grab and go kinda setup. Service was friendly and speedy, i look forward to trying some other flavors.", "pics": null}}, {"review": {"des": "These are by far my favorite cupcakes. The cake is so bouncy and soft, the frosting so good and addictive... one thing that made me uneasy was the fact that their cupcakes contain dyes. I know this because I read the ingredients of their baking kits they sell in store. Red and yellow dye!! Even in the vanilla cupcake batter!!!! But, if you're looking for something sweet and quick, this is the place. My go-to is the vanilla. The frosting is a bit cream cheese-y, which is delicious!", "pics": null}}, {"review": {"des": "Their gluten free red velvet cupcake was so good! My husband and I went at 7pm and both of our cupcakes tasted fresh like they were just made. The cake was moist and the frosting was to die for!", "pics": null}}, {"review": {"des": "We have visited sprinkles several times on our visits to Chicago. It's a favorite of my daughter as she is a cupcake connoisseur!  Sprinkles has a nice variety of cupcakes that hold up well. We ate our last cupcake 2 days after our trip and it was still good. I also bought my puppy a doggy cupcake home and needless to say she loved them also.", "pics": null}}, {"review": {"des": "Yet another hyped up food spot that is always crawling with tourists. However, like most of the other highly recommended places, Sprinkles lived up to the hype! The shop itself is really small, and is dominated by the large display case, with all of the goodies, front and center.<br><br>Overwhelmed by choices, I decided to go with the classic vanilla cupcake with no sprinkles. The cake itself is light and fluffy, but doesn't crumble when you bite it. The frosting on top is smooth and thick, but not too creamy. It's so interesting how the frosting is able to hold its shape so well, even after you bite into it. It also wasn't too sweet, which I enjoyed, and the simplicity of the cake is definitely one of its appeals. <br><br>The cupcake itself was a bit over $4, but I guess that's expected for a world famous, tourist attraction. If you're in Chicago, whether for vacation or anything else, it's worth the splurge at least once!", "pics": null}}, {"review": {"des": "I drove from Indianapolis to come here, so you best know that this place is motherfarking LIT. Lit, motherfarkers. I am judgmental about my baked goods, especially cupcakes, and these are the best cupcakes I've ever eaten. Ever. I am so glad that there is a Sprinkles Cupcakes in the Midwest, but I wish there was one in Indianapolis so I don't have to drive so far. But what can you do? You do the best that you can and you drive where you need to in order to get some Sprinkles Cupcakes. <br><br>My favorite is the s'mores cupcake, which, unfortunately for me, they did not have when I visited this time. But if they have it when you are there, you should totally try it. It's a seasonal cupcake, so they don't have it all the time. My favorite cupcake that they have ALL the time is the black and white, which is a chocolate cake with vanilla frosting and chocolate sprinkles. This time, I also grabbed a strawberry cupcake, which I had never eaten before, but I'm glad I tried it because it was so delicate and fresh-tasting. The frosting really tasted like it had fresh strawberries in it. <br><br>This Chicago store is pretty neat because it has a cupcake ATM, which you can access 24/7. I saw a lot of people using it while I was in like waiting for my cupcakes.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2PawL683ed9rrRnmU8iDFA/348s.jpg", "caption": "Sprinkles"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/D0xRVf4y55l9Wx7GrB9G2A/168s.jpg", "caption": "Five Sprinkles cupcakes"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jdC_BAp44L3XTAAuPRJvug/168s.jpg", "caption": "Vanilla cupcake"}]}}, {"review": {"des": "Cupcakes are my favorite sweet treat and sprinkles offers so many mouth watering flavors. I can never pick just one. Red velvet is my absolute favorite. They have gluten free options which always gets me excited. Service is quick, even with long lines and the cupcake ATM is a great alternative for waiting. Everyone's always smiling and friendly, the place is pretty tiny though. These cupcakes are cute and delicious, don't miss out", "pics": null}}, {"review": {"des": "I went to this cupcake place and not sure what the hype is all about.. <br><br>Seems like the cupcakes are make fresh but they are not that great, too sweet for me, typicall American Bakery. Too much sugar and icing and I guess there is a reason sorry the name sprinkles because their icing on the cupcakes is covered in icing. Sugar overload. <br><br>Place is pretty clean, some stools to sit and eat your cupcake. A little pricey for this sugary cupcake. Is cupcake  not candy. If you want a to go box is. 50 cents. <br><br>Staff of friendly while they serve your cupcake.. Did not notice a lavatory in here so be prepared. Also notice they serve coffee which is kinda nice. <br><br>An overall look I was not impressed with the sugary overload on their cupcakes. I expected more of a quality cupcake.", "pics": null}}, {"review": {"des": "Ambiance/Decor: 8/10 - super cute but very little seating, ATM machine! <br>Cupcakes: 7/10 - good but comparable to other places in the area <br><br>Honestly, I think the best part about this place is just the novelty of the ATM machine and 24hr cupcake access!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WIDCFoH6imySI6yjAtq9iw/348s.jpg", "caption": "My fav ATM in the city :)"}]}}, {"review": {"des": "I thought the cupcakes were okay, not the best I have ever had but this place gets points for the cool ATM outside!!", "pics": null}}, {"review": {"des": "The best cupcakes, obviously. But I've gotta say, is it just me, or do cupcake shops in general just NEED the workers to be upbeat and smiley? Especially one as highly regarded, well known, and such a tourist destination as Sprinkles! Well, expect anything but that at this Sprinkles. Each time I've come, the workers are strictly business. No smiles, no small talk, nothing. <br><br>Get in, get your cupcakes, and get out.", "pics": null}}, {"review": {"des": "I love visiting Sprinkles cupcakes when I'm in Chicago! It is such a delicious treat, any time of the year! I wish they had more locations, but it does make it so special when I get a cupcake here. <br><br>I love the Red Velvet cupcake, Vanilla, Milk Chocolate. There's probably more but I can't think of them right now. <br><br>Definitely worth a visit!", "pics": null}}, {"review": {"des": "When I want a little treat I come into Sprinkles! They have a lot of seasonal flavors but I prefer the black and white flavor (mini). The mini is about two bites but that's enough to satisfy my sweet tooth. I'm impressed with the consistent quality and taste of Sprinkles over the years. I recommend only buying what you plan on eating the day your purchase because the next day they're not as good. Also... if you have fur babies you can pick up a treat for them too!", "pics": null}}, {"review": {"des": "Sprinkles has some seriously amazing cupcakes. They're insanely well made, efficient in service, and even have a cupcake ATM outside of their storefront. <br><br>I came here for the second time ever the other day, and remembered it being delicious the first time, but man was I blown around round two as well. I went for the salted caramel, classic red velvet, and chocolate marshmallow this time, and genuinely loved them all. <br><br>The cake itself was all perfectly cooked, packing lots of flavor and also incredibly moist. The icing parings are also on point. My favorite was by far the salted caramel. I would venture to say that in the midst of a highly competitive Chicagoan cupcake market, Sprinkles takes the cake.", "pics": null}}, {"review": {"des": "I think this is my first cupcake shop in Chicago. They have Sprinkles in New York too, but there were so many options that I never made it to one. I think they are fast becoming my favorite. What's so adorable, is that if you just need a quick fix and the store is closed or the line is too long, there's a cupcake ATM right outside that's freshly stocked with cupcakes every day. How insane is that???<br><br>Well, luckily enough, when I got there, the store was still open. So inside we go. OMG, so many options to choose from. How will I ever and ...I didn't have anyone to help me eat them. The woes of living alone. I mean...I don't know when the next time I'd be a Sprinkles would be and because I couldn't make up my mind. I ended up walking out the door with four cupcakes. <br><br>Cupcakes:<br>2 Broke Girls (because 2 Broke Girls) - Vanilla Caramel (that caramel frosting is key)<br>Halloween - Caramel Apple (with a sugar ghost on top in orange) - have yet to try<br>Dark Chocolate with sprinkles (so far this is my fav - not overly sweet)<br>Lemon with the signature Sprinkles dot on top (delicious)<br><br>TLDR: Definitely worth getting some cupcakes here...and use the ATM if given the chance because why not!", "pics": null}}, {"review": {"des": "Best cupcakes in the city!!! Amazing service as well", "pics": null}}, {"review": {"des": "By far one of my favorite cupcake places, the cupcake ATM makes this place sweeter! Get it? sweeter? (;<br><br>I think they make one of the best red velvet cupcakes in Chicago. S'mores is a second favorite of mine. It's great that they do pup cakes and gluten free cupcakes. It's nice to cater to a lot of people.<br><br>I love that they have a cupcake ATM. It is such a smart idea. I love to show my friends from out of town it, too. <br><br>Now I drop into Sprinkles for cupcakes for friends or events. If I have a late night craving then I go to the cupcake ATM.", "pics": null}}, {"review": {"des": "This is my favorite place. The test is very good.<br>I alway go to thais place every week for buy some cups cake.<br>And this is a famous cup cake in the USA.<br>The server very nice and you can join this place at Chicago, New york and LA", "pics": null}}, {"review": {"des": "William was beyond helpful and was a joy to meet. He took the time to interact gave me extra packing bags and boxes. You could tell he truly likes his job.", "pics": null}}, {"review": {"des": "Cupcake ATM And Cupcake Review: <br><br>- ATM was fun to use also great for social media. <br><br>- You get to watch a robot retrieving your order on the screen which is fun. <br><br>- Cupcakes come in cute little cardboard boxes with the logo. <br><br>- Around $3-$4 for a cupcake. <br><br>- ATM has less cupcake options than in store. <br><br>- Line for ATM and Store are both about 7-10 minute wait.", "pics": null}}, {"review": {"des": "We didn't try the cupcake ATM. Fairly good selection and they were moist and tasty but I thought they had a little too much sugar taste to them. The shop could have been cleaner.", "pics": null}}, {"review": {"des": "Sprinkles Cupcakes is one of my favorite cupcake places in the city. So delicious and so many options. Their seasonal options are typically amazing but you can't go wrong with a delicious carrot cake cupcake. Moist cake, delicious cream cheese frosting. Yum! I've also loved their salty caramel and their red velvet. <br><br>Definitely recommend stopping into Sprinkles! It's a delicious treat that will satisfy your craving for sweets!", "pics": null}}, {"review": {"des": "Very long lines and a smashed cupcake, but the cupcake was delicious and not too much frosting like most places.", "pics": null}}, {"review": {"des": "Super cute spot been meaning to check it out since I see people come in everyday to my work with bags. Gluten free options! All cupcakes on display and super friendly staff!<br><br>-<br>Lemon and coconut just brought a sprinkle to my eye and made my heart stop-fucking amazing!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eYZ3CQuoqLg2YTuKyiwbPg/168s.jpg", "caption": "The lemon and coconut/ blueberry and lemon"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_9Sgjkxutaetq_MRIDABaA/168s.jpg", "caption": "Cupcake ATM wuhhhhhhhh!!?"}]}}, {"review": {"des": "Lorenzo and William gave us the best customer service - super friendly and in the best moods! Can't wait to come back :)", "pics": null}}, {"review": {"des": "I LOVE SPRINKLES!!!!!! <br><br>My FAVORITE part is the Sprinkles ATM. Since I live in the suburbs, driving to the city in heavy traffic is not super convenient just to get a cupcake. But the genius sprinkles ATM inventors knew just the fix for this problem!!! I can go any time of the night and get there super fast without waiting in traffic. The ATM is so amazing and the cupcakes taste just as fresh as they do when you order them in the store. <br><br>The location is bomb! It's ok a beautiful part of the city and is easily accessible by walking or driving. There is plenty of meter parking in the area, especially at night. <br><br>NOW..... for the actual cupcakes. I can't describe just how delicious these cupcakes are so you will have to go try them yourself. Peanut butter chocolate chip, dark chocolate, and red velvet are my favorites:)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/x5Dicwz2w4V6VnwHOfGZlw/348s.jpg", "caption": "peanut butter chocolate chip cupcake YUM!"}]}}, {"review": {"des": "The ATM is a nice touch!!! It's a cool thing to get people to come visit! The \"withdrawal\" process for the cupcakes was neat to see!! The cupcakes are definitely delicious enough to keep you coming back!! The cupcakes are moist and flavorful! Unlike cupcakes from other places that are overly sweet, the cupcakes from sprinkles won't leave you with diabetes! Red velvet and the Cuban coffee are the family faves!!", "pics": null}}, {"review": {"des": "I was very excited to try Sprinkles given their national reputation and was glad I visited with friends who were willing to share so I could try 3 flavors. The staff was helpful in explaining what flavors had buttercream vs. cream cheese frosting and making recommendations - we wound up tasting the Salty Caramel (the best), Triple Cinnamon, and a Dark Chocoate. Sadly, I found the cupcakes to be a little dry, perhaps because we came by right before closing.", "pics": null}}, {"review": {"des": "This location is super busy since it's located around a very touristy and populated area. I did not walk in to the actual store because the line was to the door but they have the cutest Sprinkles Cupcakes ATM outside that you can order from. We ordered a Vanilla cupcake and Fudge Brownie and the camera screen shows your order being vended through the shoot. This was super exciting and from the crowd forming behind me, it's certainly a must when visiting this area!", "pics": null}}, {"review": {"des": "They are very pretty and the icing is always good but the cake is usually dry.  <br>Hopefully they will eventually come out with a moist cake & then it will be perfection.  Enjoy with a glass of milk.", "pics": null}}, {"review": {"des": "I left dinner and was in need of something sweet and I read that Sprinkles closed at 9pm, with Giordanos extremely long wait, I of course didn't make it. <br>Anywho, when I read that there was a 24/7 cupcake ATM I knew I had to try it. Best Decision Ever.<br>If your in there Chicago area you must stop by, make sure you come in the middle of the night, it gives it a more exciting feel.<br>I had a vanilla cupcake and my friend had the brownie(which he said came out warm). They both were yummy.<br>They tasted fresh and it was the easiest ATM ever.<br>My cupcake was moist and the icing was a little sweet(which it should be) and it was a good size, I could only eat half of it. <br>Stop by and enjoy the infamous cupcake ATM.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Wbs-AW-fRUlH3sYwwpaMSw/348s.jpg", "caption": "ATM"}]}}, {"review": {"des": "A lot of people say don't believe the hype.  Here's my advice:  DO.<br><br>The staff is amazing.  Every single one of them are so accommodating and sweet.  Check their Twitter to get \"secret words\" that garner you free cupcakes.  Look out for their seasonal specials.<br><br>Now for the flavors....<br><br>Red Velvet:  hands down their best, most classic flavor.  Absolutely delicious and perfect.<br><br>Chai tea:  great for breakfast, not overpowering.<br>Pumpkin:  same as chai.<br>Carrot:  (see Pumpkin and Chai)<br><br>Vanilla-based cakes are not my favorites in general and the same hold true here, but that isn't to say they are terrible.  The chocolate based cakes are moist and delicious.<br><br>The Bailey's Irish Cream, Lemon Blueberry, Brown Sugar Praline, Key Lime, and Cherry are all delicious.<br><br>Essentially, you can't go wrong.  But their season specials, and non-vanilla based cakes are where Sprinkles really shines.", "pics": null}}, {"review": {"des": "I have been wanting to try a Sprinkles Cupcakes for so long but have never been close enough to try one-until now. This Sprinkles Cupcakes seemed like it was in a good location-near plenty of other shopping areas and the like. We stopped in quick and grabbed a red velvet cupcake and a milk chocolate with vanilla frosting. Both cupcakes were delicious! The frosting was light and not too sugary, and the cake itself was moist. Definitely would go back!", "pics": null}}, {"review": {"des": "Cupcake ATM outside? That is all. <br><br>No seriously, but if I lived around here, I would make it my duty to stop by for a cupcake. We ordered 6 cupcakes from #Sprinkles and they were magical. My favorite was the banana! (see pic)<br><br>The line did move pretty quick. The space is small but as you wait on line you see the display of cupcakes and the varieties offered. They have a few seats so most people head out but we got lucky and tried some while we were there. And of course, those that live around there, just head straight to the wonderful cupcake ATM! #Chicago", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_xAhYPz05C_LZVmL9n2WhA/168s.jpg", "caption": "Banana, vanilla, sprinkles, and milk chocolate!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0zKEGDEr6d8WSBZNq_Y8qw/168s.jpg", "caption": "Now this is what I'm talking about! Cupcake ATM!"}]}}, {"review": {"des": "The cupcakes here a heavy and rich, which I love!  It's hard to go wrong with any over the flavors but my favorite is red velvet and Black & white. They also have the cupcake ATM, though I will usually go inside.  The place is small but very neat and modern. The cupcakes are fresh and extremely tasty. I do think it is a little over-priced but each cupcake is great quality.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jgTK9W_3n7w6g3zo-B2sEw/348s.jpg", "caption": "The inside selection. Changes pasted on the day."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qPX1QBD4I_VmWI60jP4qbw/168s.jpg", "caption": "Red Velvet Cupcake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tO9XdrU3I0PQawwzhH4zkw/168s.jpg", "caption": "Red Velvet in back and Valentines Day special in front."}]}}, {"review": {"des": "Cute store and great marketing. Wanted to love the cupcakes but I need a cupcake to be moist. All 3 versions I purchased were slightly dry :( <br><br>BUT- the chocolate brownie with white frosting...TOTAL WIN! Amazingly rich, and dense! <br><br>The people working at the cashier- fun and friendly!", "pics": null}}, {"review": {"des": "We specifically went at night so we could experience the ATM. Unfortunately they were out of cupcakes and the only thing available was cookies. They were ok but I'm not a fan of crunchy cookies - I prefer soft - but we really wanted to get the cupcakes!", "pics": null}}, {"review": {"des": "This place was seriously incredible, my mom took me for my 28th birthday and the cupcakes were so fresh and the place was so cute. They had their own plates and forks and knives that said sprinkles cupcake and the boxes and everything they put the cupcakes in our so adorable and it was my birthday so they gave me all kinds of birthday stickers on top!! And then the ATM cupcake machine outside was so adorable I loved everything I totally recommend this spot and it's such a great place for everybody kids and adults!", "pics": null}}, {"review": {"des": "So I've kind of been on a cupcake kick this week and I'm kinda embarrassed to say that I've been here twice within the 72 hours. But I finally tried out the famous cupcake ATM today and it's definitely a great way to quickly buy a cupcake without having to wait in line. Their menu rotates daily (you can see what flavors they're offering online), so there's always a new cupcake to try!<br><br>My personal favorites are the carrot cake and the peanut butter banana cupcake. They're super moist and the frosting is perfectly sweet. I do agree that $4.50 is quite pricey for a single cupcake but doesn't hurt to treat yourself every now and then! They also have a rewards program you can sign up for (buy 15 items = get 1 free).", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fP3ubcoVSytTuYxJt-osPw/348s.jpg", "caption": "Banana cupcake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wXwC2v2GaDmfgnO7mmPAiw/168s.jpg", "caption": "Red velvet, pistachio (monthly special), lemon, carrot, salty caramel, and vanilla milk chocolate w/ sprinkles"}]}}, {"review": {"des": "We came for the cupcake atm and left with diabetes...wait no, I already had that. These are good cupcakes, but I've had better. They've done a great job marketing this atm thing. It had the kids hooked!", "pics": null}}, {"review": {"des": "Sprinkles cupcakes are so freaking good.  Honestly was not expecting just how wonderfully delicious they are. We were unsure what we wanted and the worker, Helen, was so patient and friendly to us. She answered all of our questions and made us feel like we were old friends. Someone in our party had a nut allergy and they were very helpful and courteous with that as well.   <br><br>Honestly probably best part of our visit to the city.  Will 100% be back.  If not for the cupcakes then for Helen.", "pics": null}}, {"review": {"des": "Craving satisfied!!!<br>I've been wanting this for so long and finally got it!<br><br>ILOVEYOU BOX:<br>*4 chocolate marshmallow <br>*5 red velvet<br>*3 vanilla", "pics": null}}, {"review": {"des": "As I've gotten older I tend to steer away from overly sweet delicacies but Sprinkles always seems to hit the spot! Their cupcakes are generally delicious, moist, not overly sugared and light. My favorite is the Chai Latte flavor - which I've only been able to try once (they're always out - ugh) and cinnamon. <br><br>They're ATM, obviously the highlight for tourists and locals alike and make it convenient to pick up a cupcake at any time of day. My only complaint is I wish they delivered like some other cupcake shops. It would be nice to be able to gift these to someone as you would an edible arrangement.", "pics": null}}, {"review": {"des": "Isn't it the best cupcake place ever ?! All different kids of cupcakes , delicious  creamy", "pics": null}}, {"review": {"des": "They advertise as having gluten free cupcakes, this MAY be true but it was not the case from my experience. I got a gluten free cupcake for a friend and she ended up violently ill. I asked the worker if it is really was gluten free and he said yes, but it still made her sick. Do NOT go here if you need gluten free, there likely IS cross contamination.", "pics": null}}, {"review": {"des": "I go to Sprinkles Cupcakes every time I am in Chicago! The cupcakes aren't fancy, they're just delicious! Most are plain and simple looking with amazing tasting icing and cake. My favourite is the red velvet, but the many other flavours are good too! You can't go wrong with a cupcake from Sprinkles! I wish there was one closer to home!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NOQiOzCO4SwH4Od_lCNcjw/348s.jpg", "caption": "Red Velvet and chocolate"}]}}, {"review": {"des": "Loved the cupcakes. Tried the Red Velvet - a classic. The cream cheese frosting had the perfect balance of sweet and creaminess. The soft, moist cake melted in the mouth! And the ATM just got me excited!!! Overall must try", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jIx102ksEtZeK1i3K96G7w/348s.jpg", "caption": "They have a cupcake atm!"}]}}, {"review": {"des": "2 Stars because I think the cupcakes are good and my dog loves the pupcakes. I usually go to this store twice a month. However, the attitude I get from the same lady (I think she is the manager) every time I call or go in is unacceptable. <br>Earlier this week I placed a small order over the phone and went to pick it up at the agreed upon time. I went straight to the cash wrap since the line was about fifteen people deep. I had already paid over the phone (the guy read my card #, exp and CVV back to me and probably all of Chicago TWICE), and he acted like I was jumping the line and kept assisting other people. I waited for at least fifteen minutes and my order was right behind him. <br>I also did not agree with the political nonsense Sprinkles decided to chime in on. Make cupcakes, focus on customer service, and PS, I won't be coming back.", "pics": null}}, {"review": {"des": "Found this place on yelp while waiting at the airport. We were able to find parking right in front of the store. You approach the atm, there was no line. The touch screen is pretty easy to navigate but be ready with your payment because it has a timer and if you don't make it in time it starts over. Lots of options including 1 gluten free and vegan. We had ordered red velvet, chocolate, vanilla, and a brownie. The brownie was not available and I was initially charged and then given a credit. Cupcakes were moist and very rich. I only ate half and ate the other half the next day. My friend scarfed down the vanilla in a matter of seconds so I would go ahead and assume it was delicious. I had a great experience. I will be going back when I visit again and hopefully it will be fully stocked so I can try some brownies.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/41KN53mneDyv-7_HmMhqjw/168s.jpg", "caption": "Street view"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MAUAhcX3AegxzuQaiBVFrg/168s.jpg", "caption": "Dark Chocolate"}]}}, {"review": {"des": "I had the best service at Sprinkles with William and Ruby! Very nice, energetic, helping and fast pace. They are definitely the <a href=\"/redir?url=http%3A%2F%2Fbomb.com&s=bb4f996415a9c2f21137e27cfb68f439a48cec2652b53e9b50dd7e766dbe177e\" target=\"_blank\" rel=\"nofollow\">bomb.com</a> and more!!!!!!! I will definitely be coming back and recommending this place to family and friends!!!!!", "pics": null}}, {"review": {"des": "Special thanks to Lorenzo and Will for the outstanding customer service!! You guys made my visit extra special :)", "pics": null}}, {"review": {"des": "Used their automatic teller system last night around 8pm because the actual walk-in store was sold out.  I returned home to open my box containing my cupcake and noticed the frosting was completely melted dropping all over the side of the cupcake and making it extremely messy to eat.  I would HIGHLY recommend NEVER using this automatic teller because you'll never know what you get until it's too late....with the significantly high price they charge for a single cupcake, I'm disappointed and would expect more from them.", "pics": null}}, {"review": {"des": "Delicious! One of the best frostings ever. The base cake was normal but the frosting was so much better than a lot of other cup cake places.", "pics": null}}, {"review": {"des": "Any place that serves shots of frosting is worthy of a 5 star rating!  The staff was exceptional, as well.", "pics": null}}, {"review": {"des": "Cup Cakes here are actually really good. I'm giving this place one star purely because of a recently encounter I had.   I called and spoke with a Sheila,  I don't know who hired this woman but she needs to be fired. <br><br>I don't understand how someone has attitude towards a customer. It felt like I was bothering her and interrupting her on her  time. Rudest employee I've ever counter.", "pics": null}}, {"review": {"des": "Great cupcakes with an ATM that you can buy from. $3.95 for full cupcake. Goes great if you order with skim milk. We got the Cuban coffee.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mWZsTdEQANIvNczAHOWO-Q/348s.jpg", "caption": "Cupcakes"}]}}, {"review": {"des": "Treat for mommy YEEEES! I enjoy the surprise cupcake of the month then sad it's gone... There's a cheesecake cupcake I still haven't tried hope I make it there before it's gone<br><br>Normally eat my treat within minutes. Unfortunately, I waited till the next morning. Sorry Sprinkles 1 star. I've had cake or cupcake the next day and it never taste this bad. The strawberry taste like a bag of flour and the chocolate was dry and yucky chocolate taste.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YBqNLflkM250JWHwryIy1Q/168s.jpg", "caption": "Strawberry (sweet) and Double Milk Chocolate (rich taste)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cX8aRC-UnA2OcpxUUH-b8w/168s.jpg", "caption": "Strawberry and double chocolate"}]}}, {"review": {"des": "I honestly don't know what the big hype is all about. Tried the dark chocolate and the black and white today. Very disappointed. Both cupcakes were dry. I've had so much better for less $$. For instance, I got to try Molly's Cupcakes on N. Clark and I enjoyed my cupcake selections.<br>Anyway, I really wanted to like Sprinkles but their cupcakes sadly fell short. Just wasn't for me.", "pics": null}}, {"review": {"des": "Been to one sprinkles been to them all, right?! They are good cupcakes, but not my favorite. We were visiting Chicago for the weekend and I had no intention of even looking up a location or coming to Sprinkles, but I saw online that they had a seasonal flavor of key lime and that sealed the deal. I had to have it! <br><br>There was a short line out the door, but this location has a cupcake ATM, so I used that. Fast and easy and way quicker than ordering inside. I'm not sure why anyone wouldn't use it! <br><br>The Key Lime Cupcake was tasty! Not too heavy, with a citrus zip. I could have used more lime flavor, but I like it to pack a punch.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xhq8KHk9cIZlDChIGMFV7Q/168s.jpg", "caption": "Cupcake ATM"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/z1Lo7Tb78sZs0tGEiVvuEw/168s.jpg", "caption": "Key Lime"}]}}, {"review": {"des": "Such cute mini cupcakes!! They also have a cupcake ATM which id definitely try out next time~", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kvEo8rPjMGHuokkYsSHZgQ/348s.jpg", "caption": "Mini cupcakes // @london_eatss"}]}}, {"review": {"des": "Sprinkles is that one place where you think \"it's a cupcake. What's so special about it versus the millions we have in and around the city.\" Well, let me tell you what, that was my thinking and now I am in love. <br><br>During a two day stay in the city, I visited this place twice. Actually, I visited the ATM cupcake around 8pm and I went back at 10am for some more. <br><br>The ATM cupcake is very convenient. It is card only for those who wondered. My girlfriend and I had to pay for people's cupcake because they didn't know. But who are we to deny them some deliciousness. It is nice that we don't need to be morning people to get cupcakes since we are night people. Donut shops are normally closed by the time we are awake. But with an ATM, you can get a cupcake at any time. Love it!<br><br>We got the Chocolate Marshmallow. It had a very good and strong chocolate flavor without being too sweet. The marshmallow was a cream filling in the middle. <br><br>The Banana Cupcake tasted like breakfast. A lovely banana nut bread that we all grew up with. <br><br>Next morning. We bought Salty Caramel. It was exactly that. Peanut Butter Cup, Margarita, and Cuban Coffee. All of them were delicious and yummy and not too overly sweet. <br><br>Staff was semi quick and nice. It was a different system that we are used too. Probably done to quicken the lines. One person asks what you want, another will get it boxed up. And then they place it on the counter for another person to charge you. Different than what we are used too but we didn't wait too long once our order was complete. <br><br>Overall, we love this place and will return in the near future. Another point for them. If you order a lot, just go to the website to find out what flavors you ordered since they post a little color code. That way you know exactly what you ordered instead of guessing or taking ante on the bottom and cover it up like we all used to do as children eating a box of chocolates.", "pics": null}}, {"review": {"des": "This is one of my favorite cupcake shops in Chicago! I really like the salted caramel and carrot cake in particular. Great service, cute vibe.", "pics": null}}, {"review": {"des": "Pleased with cupcake ATM and flavor of their delicious cupcake selection. <br><br>Came here on a late summer night to satisfy some sweet cravings. Parking around the ATM is difficult and could prove to be a hassle. Luckily, I came here with my date and was able to run out while they stayed in the car.  It was a nice hot evening so several people were lined up  ahead of me. <br><br>The cupcake machine offers a decent selection of cupcakes including gluten free options !  Individual cupcakes are priced at $4.60 with tax and machine only  accepts credit cards or debit cards with major labels. (I.e visa, MasterCard or American Express ) <br><br>We tried the cinnamon sugar and coconut options. Both cakes tasted fresh, moist and lived up to their given names. <br><br>The cinnamon sugar was a lightly spiced buttermilk cake that was dusted with cinnamon sugar. The coconut cupcake (my personal favorite ) was a Madagascar bourbon vanilla cupcake with coconut cream cheese frosting. The frosting filling definitely distinguished this cake and added a nice creamy rich taste to the cupcake. <br><br>Super neat concept and definitely would recommend checking out.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rIDiSjsp-5qePN9lcIKavQ/168s.jpg", "caption": "Cinnamon sugar"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bkfufluz5IYhk0Trvm0zCQ/168s.jpg", "caption": "Coconut cupcake"}]}}]}