{"name": "stans-donuts-and-coffee-chicago", "reviews": [{"review": {"des": "I've only dreamed of gluten free donuts, but I had yet to find one from my favorite donut providers (looking at you Doughnut Project). On a quick trip to Chicago a hole was filled in my donut shaped heart when I found a blueberry gf donut at Stan's. <br><br>They had a few options available but I couldn't help but pick my favorite donut flavor, blueberry. While you could tell it was gluten free, it wasn't super obvious and it did taste delicious. The flavor was mostly unaffected and the texture didn't bother me, like most gf breads. It was just a bit dryer than your average donut, but way better than your average gluten free donut. <br><br>Good job Stan. I will be back one day.", "pics": null}}, {"review": {"des": "Came here for a pick-me-up after travelling most of the day.<br><br>Got a pistachio glazed donut and a cup of coffee. The donut was wonderfully chewy and sweet.<br><br>Nice place to just sit and chill as well.", "pics": null}}, {"review": {"des": "Stan's is to donuts what Starbuck's is to coffee.  It's not really just another donut shop and if that's what you're expecting, yes, you will think it's expensive.  But if you look at the exceptional quality and size of what Stan calls donuts, you'll realize it's actually a bakery more than a donut shop. <br><br>Stan's has a wonderful selection of donuts which makes it hard to walk away with just one.  When you think you've decided which one you want, you'll notice another one calling your name that should also be in your bag.  I went recently to buy some for a coworker to thank him for his help. By the time I finally pulled myself away from the display case, I had a box of four for him and four more in bags for other people in my office that I knew would like them! <br><br>So forget about your diet or your budget and enjoy yourself. Life's too short not to! :-)", "pics": null}}, {"review": {"des": "Unbelievable donuts! <br><br>My husband and I were in Chicago on vacation and we walked by Stan's while looking for breakfast. As we smelled the amazing sweetness and checked out the display, we headed in really excited for some sugary goodness. <br><br>The line was a little long but it moved quickly. Don't be discouraged if you see a line. The donuts all look phenomenal and we had a really hard time choosing. My best suggestion is to get half a dozen of different ones and share them. Some of these donuts are gigantic and I think would hurt the tummy if consumed all in one go. I opted for the Boston Creme which got 5 stars from both of us. My husband chose the the peanut butter banana pocket which got 4 stars from us. The center was a little too thick and dry, we wished it had some sort of creme in it as well. <br><br>Next time we want to have all of the fritters or cinnamon rolls that are the size of your head. <br><br>My husband really loved that they had a cold brew coffee station with roughly 10 different kinds. This place is quaint so it doesn't offer a ton of sitting room. We grabbed our donuts to go and headed towards millenium park to sit and enjoy them.", "pics": null}}, {"review": {"des": "I stan Stan's. I had seen a couple of these throughout Chicago but didn't know they were good! I am from out of state and was just visiting and this made for a quick and yummy breakfast. I got a regular coffee and a chocolate donut with chocolate icing. It was one of the best donuts I have ever had. It was sweet but not too sweet and even though it was messy I didn't mind!", "pics": null}}, {"review": {"des": "Pros: Delicious large doughnuts...many unique flavors.<br><br>Cons: $3-$4 each<br><br>Old fashion pistachio is a personal favorite. Peanut butter filled isn't all I thought it was personally. I ate them too fast to take pics.", "pics": null}}, {"review": {"des": "Located in downtown Chicago, Il this place is where you want to satisfy your sweet tooth. Pretty small place inside and gets crowded quickly; luckily they have an outdoor patio in front of the store. Donuts are pricey but they are the best donuts I've ever had!<br><br>Four donuts cost me $17 & change. My favorite donut has to be the custard filled powdered cronut; the size is massive & is filled with lots of custard. My second favorite \"donut\" is the powdered hand pie filled with Nutella. They also fill the pie with lots & lots of Nutella. Third favorite is the Biscoff filled donut; the donut is good & slightly disappointment because they barely fill the donut with Biscoff. Last but not least, the pistachio glazed donut is just a regular donut that's not worth getting.<br><br>Love the cronuts & hand pie because the dough is flaky like a croissant & fill the donuts with lots of filling. Must try if you are in the mood for sweets & in downtown.", "pics": null}}, {"review": {"des": "We stan Stan's donuts!!!!<br><br>I went for the first time to the Wicker Park location and loved it! I took the L down to here specifically to try their donuts, and I fell in love. My boyfriend and I got a half dozen and out of all of them I loved the toffee flavored one the most, but thought they were all so yummy. The staff was so kind, patient, and very helpful in making suggestions on what to try. I actually didn't even realize Stan's had multiple locations since the vibe inside definitely felt really cozy and unique, but I guess this speaks to how well each shop is run. The shop is so well decorated and very cute, so definitely worth a stop for the gram at the very least :-)<br><br>I wouldn't suggest trying to work there since seating isn't really conducive to getting work done, but definitely would recommend to go on a date or meet someone for a dessert! It's super clean and wasn't too busy, so seating was definitely not an issue (and I was there on a Saturday!) It's so convenient that the shop is not even a block from the L stop, as it's super accessible and definitely worth the trip down!<br><br>As someone that loves donuts and lives in the suburbs, I'm honestly surprised at how long it took me to try Stan's. I'll definitely be back whenever I'm in Chicago and in the mood for a sweet treat!", "pics": null}}, {"review": {"des": "This cute cafe had a great donut and dessert selection! Would highly recommend the chocolate Nutella which basically tasted like a Ferraro rocher inside a donut.. yum !", "pics": null}}, {"review": {"des": "Great Doughnuts <br><br>Stan's doughnuts can be considered among the best doughnut shops in all of Chicago, vying fiercely with Do-Rite, Doughnut Vault, Firecakes, and more for title of best doughnut in Chicago. While people's opinions tend to vary, often with heated debate, about which doughnut shop is the best there is no doubt that all of them are high quality. For me, although I tend to rank Stan's towards the bottom of the doughnut hierarchy, I still find it a lovely spot to enjoy a quick treat.<br><br>One thing I absolutely love about Stan's though, is the decor. The inside of every Stan's is adorned with KitchenAid mixers, that really give off an exceptionally homey vibe. Stan's wants you to know you are in an artisan bakery, and is typically much larger than either Firecakes or Doughnut Vault, which have zero space for sit down and enjoy your treat. <br><br>Stan's, Firecakes, and Doughnut Vault are all similar to traditional doughnut shops in that they all attempt to create creative combinations of doughnut flavors. I would say though Stan's tends to be slightly less adventurous than Firecakes' bacon flavored doughnuts, although it is definitely far more adventurous than Do-Rite's traditional offerings. <br><br>Overall though, this are small nitpicks. My advice: make a beeline for whichever one of these stores is closest to you, and don't bother counting calories. Enjoy!", "pics": null}}, {"review": {"des": "This place is da bomb and it is conveniently located just off of the Damen Blue Line station. Their doughnuts are delicious and so is their coffee! I've had their ice coffee before here, as well as their caramel latte and both are so delicious. <br><br>They have a variety of doughnuts, such as standards, specialties, and assorted doughnuts. These are all so fresh and soft, and if you think Dunkin has anything on these, then your opinion is invalid. You need to try the chocolate sprinkles doughnuts, as well as the cinnamon sugar!<br><br>The only downfall of this place is that the doughnuts are pretty expensive for each one... it's like $2.50.. so do not come here if you are on a tight budget! This isn't a place I would come every single day, but it's a place to come once in a while when craving it.<br><br>I've once waited almost 10 minutes to get Stan's before because the line was so long, but in my opinion, it is so worth it. Like most places around Wicker Park, come here during the day rather than later in the evening.", "pics": null}}, {"review": {"des": "Dunkin, step aside. Wow. These donuts are scrumptious and delicious. There's no wonder why the lines here are long. The selection of donuts are overwhelming. Just can't decide on which ones. They all look so good. We decided on 3 donuts, red velvet, chocolate glazed, and cinnamon sugar. They were all good but Red Velvet cake donut wins in my mind. It's so cleaver how they fill the inside with cream cheese frosting. The chocolate glazed donut was also delicious. That was more of yeast donut. And lastly the cinnamon sugar cake donut was yummy. <br><br>So worth the wait in line. Can't wait to try some other flavors when I'm in the city.", "pics": null}}, {"review": {"des": "What I ordered: Beignet Pair | Pistachio | Blueberry Fritter | Peanut Butter Banana Pocket<br><br>Taste: PB Banana Pocket was the best. The blueberry was good but too sweet I could prolly just eat one bite of it. the Beignet pair was simple and not too sweet. <br><br>They had really unique flavors for donuts and a lot of selection for the afternoon when we came.", "pics": null}}, {"review": {"des": "This place is A-OK! Quaint chain that everyone should check out at least once. I scream, YOU scream, we all scream for Stan's Donuts...<br><br>This place has a knack for getting down and doughnutty. You seriously have to be okay with not counting calories. Live a little. Also, you can smell the JOY right as you walk in. So many smiles and sprinkles, so little time. Some crowd favorites are the Nutella pockets, Pistachio, or ice cream donuts. The Pistachio surprised me with being my least favorite; not a lot of flavor compared to the other options. I liked the Blueberry Bismark.<br><br>This fine establishment is A-OK! I'll add to the comments and say, yes, it is expensive here. That being said, it's a Chicago staple. Try it out!", "pics": null}}, {"review": {"des": "LOVE this donut place! I am not a huge fan of donuts nor am I a local to Chicago, however every time I visit this city I make it a goal of mine to stop by Stan's before I go. This place was originally recommended to me by an Uber driver who insisted that I can't leave without trying Stan's and eating their biscoff banana pocket. Needless to say, I gave him five stars for this recommendation because this place is awesome. The donut place serves both cake and yeast donuts, and has many flavors perfect for anyone. My favorite is the biscoff banana pocket! It is a yeast donut oozing with cookie butter and fresh bananas, drizzled in caramel and sprinkled with crunchy cookie bites that taste like the kind in ice cream cake that you save for last because it's the BEST. If you love cookie butter you will undoubtedly love this donut. In addition, the pistachio lemon cake donut is another good option if you're looking for a lighter donut with more subtle flavors and not as indulgent. I also enjoyed the blueberry cheesecake yeast donut; the blueberry topping is somewhat sweet but it is balanced out by the tart cheese filling. Definitely recommend as a midday snack or for tourists looking for good eats in Chicago!", "pics": null}}, {"review": {"des": "Ambiance: Every corner of this place is instagram worthy! Sit and relax while you catch up with friends. <br><br>The donuts: A wide variety of choices that taste amazing! Don't forget to order some coffee while you're at it!", "pics": null}}, {"review": {"des": "Forget your diets. This is where they come to escape.<br><br>To be honest, I'm not a donut person and if I want a true sweet treat, I'd always pick something else.<br><br>This has made me rethink that. Many delicious looking donut delights await. I picked the simple coconut cake style donut and it's the bomb. Soft sweet deliciousness. I didn't want to eat the whole thing and it took great restraint not to. My husband had the Shake which seems gimacky with the donut straw. However it is a very solid and thick milkshake. <br><br>This place is memorable.", "pics": null}}, {"review": {"des": "I am not much of a sweet tooth person. However, these doughnuts are borderline magical. <br><br>The Interior = Urban Retro<br>The Service = Super friendly<br>The Doughnuts = Amazing!<br><br>My go to doughnut is a biscoff pocket. A speculoos filling (a thick spread with the texture of peanut butter and the taste of ground up cookies with a hint of ginger snaps) is the perfect contrast to the buttery dough. Make sure you grab a can of vanilla La Colombe coffee to wash it down. <br><br>Dang this Stan's is good.", "pics": null}}, {"review": {"des": "Excellent fresh donuts.   You can smell it right when you walk up through the door and you see a line of people getting antsy and talking among themselves which ones they want to get.  Got the cherry filled one and it was awesome.  Paired very well with the coffee.  I can still taste it hours later each time i burped", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rkOYIXTLhmz4G6uazcqxuQ/348s.jpg", "caption": "View from there platform"}]}}, {"review": {"des": "Better than the grocery store but not as good as they should be for $2.50+ donut.  But the location is awesome.  I get donuts here often coming back from work when getting off the L.<br><br>Advice - hold the coffee and get it next door!", "pics": null}}, {"review": {"des": "Yes. Just yes. The only time you should NOT go to Stan's is if you are on a diet and not going to enjoy every savory, delicious bite. Once you've had these doughnuts and bagels, you will never be back to Dunkin Donuts again!", "pics": null}}, {"review": {"des": "Not the best donut place in the city, but definitely worth a stop if you're in Wicker Park and looking for something sweet to munch on. <br><br>Definitely a super chic and hip aesthetic to it, so it adds a nice touch when your inside people watching others getting off of the Blue Stop near by.<br><br>First Timers: Get the Nutella Pocket Donut", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7kzGYFmj-JZvRIrxuCi5Wg/348s.jpg", "caption": "Stan's Donuts from Damen Blue Line"}]}}, {"review": {"des": "Gluten free pistachio donut? Yes please! Note to gfers: the gf donuts aren't made in a separate kitchen so there could be some cross contamination (thus, you could have a reaction depending on how sensitive you are to gluten). But, to me, this donut was perfection. I've always seen a line at this location on the weekends, so when I passed by on a weekday mid-morning and saw no line, I had to check it out for myself. Worth the wait.", "pics": null}}, {"review": {"des": "Great variety of donuts including a gluten free and a vegan option. Donuts tasted so good!! Also offer coffee if you like that with your donuts. Not tons of places to sit and hang out, so if it is busy you will have to take it to go. Friendly staff.", "pics": null}}, {"review": {"des": "The variety at Stan's is great and their pastries taste wonderful. One that that stands out to me is their variety of pastry pockets. (My three favorites are their peanut butter, cookie butter, and Nutella pockets!) <br><br>I also found that their donuts felt a little more fried for my taste. Even so, their variety and unique options make Stan's always a blast to visit.", "pics": null}}, {"review": {"des": "Not all Stans Donuts are created equal. We tried a couple of other locstions and found the donuts to be average at best. Pretty much a slight step above Dunkin Donuts. This particular shop had donuts that rivaled any famous NY shop. The banana biscoff is one of the best donuts ive ever had and the glazed pretzel was on point. The only negative is this location not having this hibiscus yerbe carbonated cold brew that we had at other Stans Donuts locations. That tea is absolutely delicious.  Bonus points for the super nice and smily (at 7am mind you) employee who helped us (super cheerful with painted fingernails).", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HWaXdzXHfnxsxRzBp9FhXg/348s.jpg", "caption": "Donut trays"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rWKmBFVjN3FZI0uk2UTW_w/168s.jpg", "caption": "Stans donuts"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xbP4rm0rwx00yRjR23kg8g/168s.jpg", "caption": "Stans donuts"}]}}, {"review": {"des": "Awesome donut and coffee shop!<br>Got the plain glazed donuts for my kids which they LOVED literally ate that thing so fast. <br>I had the peanut butter banana donut. It's a lot of a donut but dang it was good! <br>The bacon donut I was a little scared to try but actually it was reallly good and not over powering with the bacon. It's good if you like sweet and salty. <br>Oh And we got the chocolate lighting coffee. It was delicious! <br>So glad we pulled over to try this place!", "pics": null}}, {"review": {"des": "I love how family friendly this donut shop is! The colors pop out and all the kiddos get excited because they get to pick a delicious donut off the rack! FYI- this is a chain from LA!<br><br>+1 Really good service<br>+1 Really fresh donuts<br>+1 Decent pricing<br><br>+/-1 The donuts were a bit too heavy and sweet for me. You definitely need coffee with this!<br><br>Their most popular are:<br>1) banana biscoff pocket<br>2) Pistachio lemon raised donut <br><br>We ordered all those, in addition to:<br>3) Lemon pistachio old fashion<br><br>My favorite was probably the raised donut or the old fashion! Biscoff was a bit too much for me.<br><br>There are a bunch of Stan's popping up on Magnificent/Riverwalk, so you don't have to come all the way to Wicker Park!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/57mHFXqQEZmwhQUKbfKm4A/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "I'm not a donut person but these were delicious! The Biscoff and Nutella Pocket ($3.60) were equally indulgent. If you're a fan of savory sweets the Nutella version is 100% the way to go. Filled to the brim with banana, PB, and creamy Nutella you get the perfect mix of doughy goodness and filling in every bite. <br><br>Tip: Don't be deterred by the long line, it moves wicked fast!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/avn1rX9D-UCsTcPd0kjSHQ/168s.jpg", "caption": "Nutella Banana Pocket ($3.60)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PS0VESKQePJeR_8q2yzGrg/168s.jpg", "caption": "Biscoff Banana Pocket ($3.60)"}]}}, {"review": {"des": "Pretty good donuts <br>Good variety <br>A tad expensive but that's just the market now days", "pics": null}}, {"review": {"des": "The staff was very friendly and opening to inventing you in to their shop, the coffee was great, the donuts were delicious, there is a public restroom, (which is always a plus for me), but the chairs are uncomfortable to sit and it's a little bit pricy for some coffee and donuts. <br><br>It's a pretty good place just a bit pricy for me. That's all.", "pics": null}}, {"review": {"des": "What makes Stan's is the wide variety of decadent donuts. I've tried a solid selection over the years and have never been disappointed, but I will say some are a little too rich for my tastes. One example (no surprise here) is the Chocolate Pocket with Nutella. I, like many, am in love with Nutella, but this was just too much; I couldn't finish it in one sitting.<br><br>People often regard Stan's as the best donuts in the city. I'd say they're up there, and the donuts are undeniably good, but not numero uno. Plus, I know they're considered premium donuts, but they're just a tad overpriced in my opinion.<br><br>Note that they'll usually run out of their most popular varieties in the afternoon.", "pics": null}}, {"review": {"des": "Delicious and beautiful place. They have to many options and originals flavors. We tried Boston cream and coffee cake. Both were so yummy.", "pics": null}}, {"review": {"des": "Solid place. Ordered 6 donuts not knowing there is an up-charge (standard vs. specialty) as it's not clearly listed. 6 donuts rang up to $26. Expensive but still satisfying. Stick with the simple donuts and skip the pie (too dry) and picket donuts (underwhelming).<br>Picks: toffee and cronut", "pics": null}}, {"review": {"des": "I got a cup of coffee and a donut the coffee was that perfect temperature and the cup was super cute! The donut was a good consistency and they had a great selection available! The decor and uniforms add so much to the experience it's a Chicago MUST visit", "pics": null}}, {"review": {"des": "I'm not a big doughnut person but we passed by this location on the way to grab coffee and figured we'd check out what they have. Little did we know how much we'd like these doughnuts.<br><br>The shop is quite cozy with the line snaking in front of the display case making it slightly a challenge to scope out everything before ordering. The line moves fairly quickly too. It seemed like half the doughnuts were cake and a lot were filled.<br><br>Their popular Biscoff Pocket and Captain Crunch Bismarck didn't sound like the one for me, but thankfully they had a bowl of Blueberry Fritter samples right there which was really good so I ordered that.<br><br>I haven't had a doughnut this great in a very long time. I think they use dried blueberries - small pockets of blueberries, a blueberry glaze and wonderful dough.<br><br>My boyfriend got a Cinnamon Sugar yeast doughnut Glazed yeast doughnut. Both solid too.", "pics": null}}, {"review": {"des": "Super small cute spot.  Came here for their gluten free and vegan donuts.  Tried all of them.  Cinnamon glazed, sugar glazed, gluten free chocolate and gluten free pistachio.  Yes I love donuts haha who doesn't!?<br><br>They were all great and I didn't particularly like one better than the other.  Will defiantly come back when I'm around!  It was really hard not to get the other ones since they all look so good but gotta stay strong! YUM!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WS_LuSHknPMVmRpWND7Qvg/348s.jpg", "caption": "Yum!!"}]}}, {"review": {"des": "Stan's is packed at all times of the day, despite that, I managed to get donuts within minutes of waiting in line. The service is great and the taste-y treats is worth the experience.  It was hard to make a choice with so many amazing-looking donuts.  They are bigger than normal size donuts,but expect to pay around 2-3 dollars for a donut.", "pics": null}}, {"review": {"des": "A donut is a donut - a famous somebody once said.  Well no it aint.  Good old fashion donuts - I like the chocolate myself.  Be brave and order 2 for you only live once.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Sj5xKqu2H14rsWjzAZz-3A/348s.jpg", "caption": "damn this is good"}]}}, {"review": {"des": "I had the pistachio lemon donut. It was good, but would try something else next time. Service was great. It was my first time at a Stans. It was clean", "pics": null}}, {"review": {"des": "My favorite place to come get glazed donuts. They never let me down. The consistency of the donuts are soft and filling. The size of the donuts are worth the price. Yes the donuts are a little pricey but I don't care they are satisfying. But let's be honest I could probably eat half a dozen of them. I have tried most of the donuts here and they are all great. There is the standard donuts, specialties,and dough boys best. The dreamsicle bar, glazed old fashion, chocolate glazed,maple long john,blueberry fritter are some of my go to donuts. They also serve coffee, lattes, and ice cream. Oh yea and they also have bagels. This location is right of the Damen blue line spot. It is a busy area but who doesn't love Wicker Park. I mean why not grab a donut after eating tacos.", "pics": null}}, {"review": {"des": "AMAZING.<br>The chocolate donut.<br>The chocolate ON the donut. Was. Ah. May. Zing.<br>I actually contemplated buying another one just to smell it. And lick it. I really liked the people who worked here too. All smiles and very friendly. As well as a bite of my fiance's chocolate donut, I enjoyed a delicious glazed which impressed me very much and left me licking my fingers. Unfortunately the coffee was kind of meh. But I will be back!", "pics": null}}, {"review": {"des": "Stan's Donuts is such a fun place. I got a chia latte and it was absolutely delicious. I am definitely going to be coming back whenever I am in the area. The pastries are also amazing. Come here and try them for yourselves!", "pics": null}}, {"review": {"des": "People might think I'm weird, but I'm not a huge fan of Stan's Donuts. I can see why they're so popular and hyped up, but I just don't really like sweets like chocolate and maple. They're too heavy for me, especially their glazed donuts. All I taste is heavy, sugary glaze and not much of the dough. Stan's Donuts are on a sweeter side for me, so I think they're just meh. But generally, I don't find their donuts THAT great. Now I only come here when a friend or relative wants to stop by. And because their donuts are way too sweet for me, I just get their lemon pistachio. It's one of their less sweeter options.<br><br>The glaze on the blueberry fritter was overly sweet, I had to drink a lot of water to wash the sweetness away blegh.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zdAof6yN5qMKwCuJ5754xQ/168s.jpg", "caption": "Gave it another chance. Still too sweet. :("}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pq22U9lEWXvtR_d-AUkH8A/168s.jpg", "caption": "Blueberry fritter - way too sweet"}]}}, {"review": {"des": "They have shakes with mini donut straw holder.<br><br>Get the Nutella square. Mmmmmmmm.<br><br>Just a lovely place right off the L. So fun and yum.", "pics": null}}, {"review": {"des": "Stan's is always a treat when you're feeling especially indulgent! This location is especially awesome because the staff is always extremely welcoming and efficient, even during their busiest hours. <br>The best donut they have, by far, is the biscoff pocket. It's fluffy and filled with cookie butter and it's just about the best taste in the world. I highly suggest you try it!<br>They recently changed their decor too, and not that it wasn't cute before, but the new look is super cool and trendy.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uYZNM5nryUnw-mjfFGhbGw/168s.jpg", "caption": "Decor after"}]}}, {"review": {"des": "Excellent donuts and service was great as well.   I've come to this location several times and it's always amazing.   I'm a glaze and Boston Creme donut guy all the way.   As you can see from the photos my daughter approves of these donuts lol.   Actually, the whole family approved.", "pics": null}}, {"review": {"des": "Super cute and conveniently located specialty donut shop in wicker park. They're known for their wide variety of unique pastries and donut flavors. I opted in for the vanilla iced coffee, the double chocolate old fashioned, and the cinnamon pretzel. <br><br>For a weekday morning right next to the damen l stop they weren't overly crowded, making their service pretty efficient. The pastries overall were solid. I personally thought the double chocolate old fashioned was a bit too rich to enjoy the entire thing alone, but being the chocolate lover I am I can't deny that I did in fact love this donut. I shared the cinnamon pretzel with some colleagues later on and it was quite the hit as well. Super soft and doughy wth plenty of flavoring, just how I like it!<br><br>Definitely a little pricey and not my all time favorite donut place I've been to, but I will absolutely be back to indulge again soon.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/H9zIexUzfazC8sa1sNpo1g/348s.jpg", "caption": "Cinnamon pretzel, double chocolate old fashioned, vanilla iced coffee"}]}}, {"review": {"des": "A two (star) is hard for me to do. Especially so when the shops are so cute and the staff so friendly. (And worth mentioning, I guess, the shop at Roosevelt L is quite a bit less cute given how cramped it is, as compared to this shop at the Damen L.) Anyway, Roosevelt is where I had my first taste of Stan's and I didn't care for it whatsoever. <br><br>I mentally bookmarked giving them another shot and finally went with two that where SURE to please me, if any were going to get the job done: <br><br>Chocolate butterfinger - ick. Sorry, Stan. Dough so heavy and chocolate frosting so sticky. I bite and frown. It's just that undesirable. <br><br>Cherry old-fashioned - after my first bite of butterfinger, I took a breather and then tried this one. Cmon. Super sweet and then the mouthful felt like it disintegrated into a sugar mush. <br><br>Yes. I went back and tried the butterfinger again. I really can't believe my buds. <br><br>I'm not sure why my tastebuds just don't get these donuts, but there it is. <br><br>I'll still walk by and appreciate the pink and perky aesthetic, but I'll wonder how do people enjoy the product.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XJf1Ldh5Afa9DDT4FIDS_Q/348s.jpg", "caption": "Cute shop & serious convos :-)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/G2WwEiliylHzudcp426Kmg/168s.jpg", "caption": "You are the beautiful person who turns out sadly one-dimensional"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wKC5zbCrLLkrWSZE-voQEw/168s.jpg", "caption": "So long Stan"}]}}, {"review": {"des": "My top 3: Biscoff Pocket, Nutella Pocket, Old Fashioned Pistachio<br><br>Not going to lie, these donuts are loaded sugar and filling, which can be overwhelming for some... but I have a huge sweet tooth so it's not a problem for me. They have a fantastic selection of donuts and every single donut I've tried here has been delicious; you really can't go wrong.<br><br>Donuts are a bit pricier than your average donut place (they're about $3-4 here) since Stan's is a specialty donut shop, but it's definitely worth it.", "pics": null}}, {"review": {"des": "Stopped in to try their cronuts. There's a lot of hype about this donut shop, and while they are good, they aren't great, and surely not worth the price tag. I bought two donuts and it was over $8. I don't mind paying that much for a great donut, but I don't find Stan's to be worth it. I've stopped in a handful of times and have yet to eat a very fresh (soft) donut despite them always handling trays of fresh donuts. <br><br>The cronut was heavy. Flakey and crispy, but not light like a croissant. The filling was good. Will I get this one again? Probably not.", "pics": null}}, {"review": {"des": "Definitely a joyful place!  Just walking in created a smile. Had a cake sprinkled chocolate donut  that was yummer.<br>A nice variety and have a donut of the day.<br>Bottom line- check it out", "pics": null}}, {"review": {"des": "Oh man the donuts are to die for! <br>This is my First time at Stan's donuts and they had a large selection of donuts that made it really hard to choose only one or too, I picked the captain Crunch and the banana peanutbutter filler and joined it with a tall Cafe Latte and it set me back for around $10bucks.<br><br>I tried the peanut butter and banana first and it was nice and fluffy on the outside and had plenty of banana and peanut butter on the inside topped with a sugar glaze that made it extra sweet then I had captain crunch that's was also very good as well but I was hoping that the cream filling would of tasted more like captain crunch. The large coffee was also good and piping hot but needed to add plenty of sugar because if not it tasted bitter in contrast with the donuts...it was also a lot of coffee and ended up very full...<br><br>To sum It up, the donuts are great but they were a bit to cold for my taste and I just wish they had been warm and they would be perfect. The coffee is also very good and the decor reminds me of an old school dinner which is pretty cools and cozy...the place was clean and the staff was nice.", "pics": null}}, {"review": {"des": "Unfortunately did not live up to the hype for me. Pricey donuts with unique flavors. I tried the cherry old fashion and the buttermilk bar. Which weren't that good. They were just okay. Really didn't make me want to go back. I also got the caramel frappe. Which was a huge disappointment. It literally tasted like a milkshake. Maybe they made it wrong? Who knows. Not interested in coming back to find out.", "pics": null}}, {"review": {"des": "The donuts a bit expensive but totally worth it.  However, the place is somewhat dirty.", "pics": null}}, {"review": {"des": "I was in Chicago for a week over the summer and needed a go-to breakfast joint. I stumbled upon Stan's on Yelp and went nearly everyday. I can't say anything bad about a single donut, and I'm almost certain that I tried every one; however, I do recommend the pistachio, banana biscoff, and red velvet donuts. I also recommend that you go early before all the popular donuts are taken.", "pics": null}}, {"review": {"des": "In my humble opinion, it's hard to screw up donuts. The difference between an average donut and a phenomenal donut is minimal, but maybe I just don't have a sophisticated donut palette. Regardless, Stan's has some bomb-ass donuts! We ordered a half dozen, and went with the largest variety we could choose from. Classic vanilla frosted was exactly what you'd want. Toffee cake was ridiculous. We ordered a cinnamon sugar pretzel, which might have been my favorite! The maple bacon was not very well received in my group, but I personally loved it. I wouldn't say Stan's is very expensive either, at $2-$3 per donut, it is very reasonable for the size you're getting!", "pics": null}}, {"review": {"des": "Lots of flavors! It's a bit overwhelming trying to figure out which one to try. I ended up picking Cap'n Crunch and lemon pistachio. <br><br>Capn crunch was just okay. It was filled with the cereal flavor custard. It tasted like a bowl of cereal and the doughnut was also powdered. If you like custard, you'll like this but I didn't taste the cereal flavor too much. <br><br>Lemon pistachio - loved!!! It's one of their top sellers! And I agree - it had a balance of both flavors and a more crunchier glazed doughnut. Highly recommend this one!", "pics": null}}, {"review": {"des": "Pistachio donut is my all time fav! The decor is modernly kitschy and the staff are quick and friendly. I love the massive variety of flavors and the quality of the product. Worth every cent!", "pics": null}}, {"review": {"des": "Assuming this place is a Chicago staple as there was always a line at this place. The donuts were delicious, lots of options. I only tried their strawberry glazed old fashioned donut and their beignets which were better than the ones from Disneyland and the ones that my husband brought me back from NOLA. <br><br>Obviously they have coffee as well. Definitely a must try.", "pics": null}}, {"review": {"des": "One of the best donut shops in Chicago. This is my 2nd time here and it never fails.<br><br>It is cute, and people are friendly.<br><br>I always get tee Original Glazed.<br><br>Everything else looks great, I definitely will have to come back and try something else. But you can't go wrong with an original glazed.", "pics": null}}, {"review": {"des": "I don't know why I felt compelled to visit Stan's Donuts while in Chicago when I'm from LA where the original Stan's is located but there's something about the pink neon sign that just draws you in!<br><br>I visited the Stan's on Damen twice while in Chicago because it's right by the blue line station and nothing sounds better when you're heading home on a fall evening then a donut, am I right?<br><br>I tried their cherry old fashioned and their blueberry old fashioned because I'm a big fan of cake donuts. Both were pretty good. A little overpriced for what they are but I love a good donut so I wasn't mad.<br><br>But if you want to try a real Chicago donut, Doughnut Vault all the way!", "pics": null}}, {"review": {"des": "Definitely nothing to call home about. I got three donuts and the plain glazed was my favorite. I akso got a buttermilk donut stick and it tasted like the little debbies donut sticks you can get at the 7eleven. Very expensive too. 9 bucks for three basic donuts. Go to dunkin donuts. I promise there is no difference.", "pics": null}}, {"review": {"des": "Ordered a butt-load of donuts as dessert from my wedding and Stan's delivered!  Their delivery time made it so we had to receive them a bit early, but a late night donut delivery is a bit out of the ordinary.<br><br>The food was great and we thank them for facilitating such a large order!", "pics": null}}, {"review": {"des": "The coffee is the best-I'm not a fan of the other big chains but this is a great place. Yes I had to get a fresh donut and I wasn't disappointed!", "pics": null}}, {"review": {"des": "The donuts here are \"amazing\". They have extravagant flavors and Classic Donuts. My favorite is the Captain Crunch Bismarck. It's filled with a Captain Crunch cream and as Captain Crunch cereal sprinkled on top- I feel like a big kid eating it.<br>If you go early in the morning there is definitely a wait. Usually it's a line out the door if its before 9 a.m. Stans is a little bit pricey for donuts but you get what you pay for. I don't care too much for the coffee here it's a little bit flavor less. I will make the trip though just for the donuts because it's so worth it. I did have to use the restroom while I was here and there was toilet paper and stuff all over the place, also the staff wasn't too friendly.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IN1t-jWUTrIsweY-rkcUQg/348s.jpg", "caption": "Got my fix!"}]}}, {"review": {"des": "I was on my way back to Michigan and decided to bring back a dozen of donuts for my friends. My favorite donut shop had closed and so I was looking for a new place to try out. Stan's was highly rated so I decided to give it a try.  I had trouble picking the donuts that I wanted, so many looked good.  The first donut that I tried, the biscoff pocket was good.  The subsequent donuts were not. My friend had a chocolate long john - after making a weird face and trying to decide what was wrong, I took a bite. We came to the conclusion that it tasted uncooked. A couple others thought theirs tasted undercooked too. It was an odd doughy taste. My boyfriend tried the cream filled and really didn't enjoy it either. I was hoping to get my friends a nice treat and I ended up spending more than going to go to a grocery store for inedible donuts.", "pics": null}}, {"review": {"des": "This is a cute donut and coffee shop with a huge variety of donuts! I loved the coffee and twisted glazed donut that I got. You should stop by for a quick treat if you're in the area.", "pics": null}}, {"review": {"des": "The donuts here are great, but they cost way too much. There are three price ranges. The specialty ones cost the most, and the most plain are the cheapest. While I love donuts, I'm not sure I'll be back due to cost.", "pics": null}}, {"review": {"des": "Wow! Neat doughnut shop on Damen just shy of the Damen/Milwaukee intersection in Wicker Park. Are they a bit pricey...yes. Are they worth it...yes. Nice selection...very nice staff...and excellent coffee. We stopped in after visiting the Myopic Bookstore right around the corner.  Try this.", "pics": null}}, {"review": {"des": "this place sells donuts. one time i was standing outside of a stans waiting for a bus and a girl came up to me and asked if i wanted a free donut. \"it's cherry olde fashioned\" she said, a little flustered, i said \"uh yeah,sure!\"...i just didn't have it in my heart to tell her i was vegan... but not one to say no to opportunity, i ate the donut and it hurt my stomach really badly. it'd be cool to see her again. <br><br>three stars for the pain", "pics": null}}, {"review": {"des": "They have amazing gluten free donuts.  It's always difficult to find gluten free options.  I got the pistachio one and it was the best donut I've ever had.  It was moist, not too cumbly and not overly sweet with bits of real pistachio on top.  My husband got the regular lemon pistachio old fashioned and he loved it. <br><br>We also loved the atmosphere with a couple benches to work at and a beautiful statement wall of stand mixers.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/r_rnB-gSw7NHxPYlyZ-9zw/348s.jpg", "caption": "small iced tea, gluten free pistachio donut and lemon pistachio old fashioned.  Delicious!"}]}}, {"review": {"des": "Super cute retro style donut shop. I haven't tried the donuts (although they looked generous and fantastic) but I had coffee here a few times and it was tasty and the service was very friendly. <br><br>There's always a line at this location but it moves very quickly.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/K5VuVDZJydRAqMHSdEvUHA/348s.jpg", "caption": "Like a toy shop for me."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/963dUj6zHGgXXhSUYxicBw/168s.jpg", "caption": "Retro~"}]}}, {"review": {"des": "My boyfriend is obsessed with this place and he and I are such gluttons that we came here for dessert after dinner! I love the pretzel donuts, particularly the ones with chocolate drizzle! Ate it too quick to snap a pic.", "pics": null}}, {"review": {"des": "2 words . .  . Banana . . . Nutella . . . . OMG these two words will change your world, I promise you.  These are easily the best donuts I have ever had.  Made fresh daily, you can come in and pick from donuts such as chocolate butterfinger, blueberry bismark, coconut cake,  lemon curd bismark, toffee cake, etc etc etc . . . They also have bagels and gluten free options as well. BUT THE DONUT TO END ALL DONUTS IS THE MAPLE CARAMEL BACON PECAN BAR. If you don't read that and immediately start drooling I don't know what to tell ya.  I am craving one of these as im typing this! Aside from the baked goods,  The smell alone is worth the trip.  Just something I love about the smell of fresh baked goods. Shop is small and has a small seating area.  Parking is practically non existent but you can luck out and find a spot time to time. I am always here if Im in Chicago.", "pics": null}}, {"review": {"des": "You know when you've done your research and hope you're stumbling onto something worth while? All I can say is WOW!!!! This place is an absolute gem, hands down. Every aspect is perfect. The signage, logos, bags, and boxes are all beautiful and well thought out. Location is perfect. Decor inside is perfect. Last but not least, the donuts. These are what every donut strives to be. I bought a dozen for $30. Was worth every dollar. The four of us sampled many different things. Blueberry fritter excellent. Nutella pocket beyond words. I had a lemon one with pink icing. It had the most perfect texture and taste to it. Cronut with a cream cheese filling, was one of those you must try before you die foods. I think they called it \"The Stan\". Yes I held up the line for some time picking all these out, lol. Will not forget this place anytime soon!", "pics": null}}, {"review": {"des": "Like most visitors, we did not realize Chicago brunch places get really busy. If your like us and don't timely get on the wait list, check this place out. Had some great donut options, but our boys really enjoyed the chocolate and glaze. Would definitely recommend in a pinch.", "pics": null}}, {"review": {"des": "donuts are as good as they get.  the bischoff glazed donut was amazing", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Pn4MIqlIZJclkkYsOz4_TA/168s.jpg", "caption": "Visited Chicago last week and stumbled upon Stans. I ordered this big square shaped glazed donut with. it was heaven in my mouth !"}]}}, {"review": {"des": "This was the last spot I went to before heading back to the bay after my weekend trip in Chicago. <br><br>First off, the service was exceptional! All the employees were friendly and cheerful, which pretty much made a gloomy rain filled weekend all the better.<br><br>While it may not be as unique and creative with the selection at Blue Star in Portland, it was definitely something that cured my craving for a sweet treat.<br>I ordered the biscoff banana pocket donut, which probably would've been better if it was fresh and warm with ripe slices of banana (wayyyyy too tart for my taste).<br><br>It's definitely a convenient spot for people coming and going on the blue line when they need a quick bite for a donut or bagel.", "pics": null}}, {"review": {"des": "I do enjoy this place. Donuts are always fresh & employees are always nice. FAT selection of your everyday donuts (yes I said EVERYDAY DONUT dont judge;) & specialty donuts. <br>Excellent location.", "pics": null}}, {"review": {"des": "It's 2017, and people around here go GaGa for doughnuts. It's the new-ish food trend that has been getting higher and higher in demand as the years go on. When I was growing up, when I thought of doughnuts, I thought Dunkin and Krispy Kreme. Nowadays, everyone and their mothers are opening up doughnut shops and the people LOVE it. Personally, I'm not extremely crazy about them, but I did stop by Stan's in Wicker Park one day to see what all the fuzz was about.<br><br>To keep things short, it's aight. Like I said, I'm not one for doughnuts so obviously my opinion doesn't hold much merit to objectively judge such an establishment, but I do appreciate the creativeness the bakers put into with this concept. The doughnuts come in all shapes in form. There's your original old-fashioned one flavor type of little pastries, and then there are the more inventive, custom type of flavors and designs, placing the dessert on a much higher scale. I had a jelly doughnut from there which I had no problem with, very tasty and satisfying.<br><br>Aside from doughnuts, Stan's got a whole lot of other sweet stuff to keep you happy and jittery for days. Fresh brewed hot and iced coffee is sold here along with milkshakes (provided with a cute lil doughnut on the straw) and their famous frozen hot chocolate, another item I had when I went to Stan's, it was pretty darn good.<br><br>So if you got a sweet tooth, Stan's is right up your alley. Stay for the lovely smell of dough and sweets, or get some goodies to go. It's a good time nonetheless!", "pics": null}}, {"review": {"des": "Big donuts, full of calories but every bit was worth it! It doesn't hurt to have something like that once in a while. Does it?", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BWymJXjVGNXWAaV3rZmvrA/348s.jpg", "caption": "Chocolate pocket with Nutella and cinnamon roll. Soooo good."}]}}, {"review": {"des": "Very good donut spot, great variety and friendly staff will return. Old fashioned blueberry donut was best I think I have ever had. Had chocolate was very chocolates and smooth. Interior was nice.", "pics": null}}, {"review": {"des": "Donuts, donuts!! This is the best place to people watch at six corners (especially on Halloween or on the weekends). I always stop by Stan's when I am in Wicker Park. Their fruit filled donuts are so amazing and my absolute favorite being the blueberry. They make a blueberry jam from scratch and pipe it into a sugar coated donut. The best version of a bismarck donut.<br><br>Their chocolate old fashioned will melt in your mouth. The chocolate covering the donut is dark and rich without being overly sweet and it goes perfectly with a cup of coffee. (They also taste amazing if you warm it up in the microwave for 30 seconds).<br><br>Their biscoff donut is amazing and my friend once got their orange creamsicle donut, which she has been obsessing about (but I think it's a special edition donut).<br><br>Stop by with your kids or friends to grab a sweet snack between shopping or walking around. They also have the El schedule on the flatscreen tv menu so if you're a commuter, you can grab one to go on your way to work.", "pics": null}}, {"review": {"des": "Donuts are my second favorite dessert (just below cupcakes), but Stan's is the best of the best. <br><br>The donut signs are either yellow, green or pink, which corresponds to the pricing. Yellow are the lowest priced and are your basic cake donuts and glazed donuts. Green are the middle priced and include fun choices like cream filled and old fashioned. Pinks are the highest priced because they are reserved for the beloved pockets!!!<br><br>My boyfriend enjoys the basics (yellow) because he thinks they're done to perfection. I have more expensive tastes, and I love the Boston Cream (green) and the Biscoff Banana pocket (pink). <br><br>I've never had an issue with the donut I wanted being sold out, even when visiting late afternoon on a weekend. They seem to have PLENTY made and waiting. You really can't go wrong with whatever you choose! Stan's is awesome.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bl87wYXyFeD2ipqql0aPRQ/168s.jpg", "caption": "Boston cream with PLENTY of filling!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tsyCuqiESw7JBMoSZNuwOQ/168s.jpg", "caption": "Basic glazed donut."}]}}, {"review": {"des": "Loved the Vegan Recipe donut! It was amazing! Rare for vegan sweets. Fast WiFi and good customer service too:)", "pics": null}}, {"review": {"des": "Great coffee shop. Authentic drinks. great machiato and cappuccino, must try the pistachio donut!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/psqemQK6sgTEnQVtvoXLeQ/348s.jpg", "caption": "machiato and cappuccino"}]}}, {"review": {"des": "There are donuts and then there are donuts.  Niece and boyfriend said this was must stop and try before we flew home to San Francisco.  I'm glad we made the stop.  There was a long line of folks waiting patiently to buy including ourselves.  I'd have to say the line moved quickly.  Plenty of donut offerings.  I wished I could have tried them all, but I selected the pistachio glazed donut.  Very very good.<br><br>I'd rate this as a 5 star but it's difficult with only one donut tasting.  If and when I come back to Chicago, Stan's will be on my bucket list.", "pics": null}}, {"review": {"des": "From out of town and was trying to get brunch, but the wait was about 2 hours so thought we would get a coffee or small snack to not get hangry while waiting. Looked around and saw Stan's! <br><br>This place did not disappoint. We actually decided to skip brunch because of how good the donuts were and got one more to share before trying to find a different place to eat at.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jPgw__CZbJ-APDAtNWK3SQ/348s.jpg", "caption": "Super messy but oh so good!"}]}}, {"review": {"des": "Does Stan's donuts really need any reviews? incredible donuts. Go here, be happy.", "pics": null}}, {"review": {"des": "Everyone here is so nice and they have the best vegan donut I've ever had! The line always moves fast too.", "pics": null}}, {"review": {"des": "Couple of out of Towners who wanted to catch some Of Stan's donuts before flying out of Chicago and crying from missing such a gorgeous city. <br>It was a Sunday and we arrived 2 minutes after opening (desperate for some donuts before leaving!) That being said, coffee was great, staff was still working on opening up, water jug wasn't filled yet, the chocolate glazed was delicious. Wasn't your typical donut with icing on top it was like Krispy Kreme, where they glaze the entire donut then add some icing on top. Unfortunately, my husband asked for a maple bar and they gave him a maple bacon cake donut which we didn't notice until we were at the airport. <br><br>All in all, I'd give it a shot again if we're ever back in Chicago. Not sure about the husband", "pics": null}}, {"review": {"des": "i don't know why everyone raves about stans..... i found the 2 donuts we tried to be bland and tough . the flavour selection they had was great , but i think there are much better donut places around .", "pics": null}}, {"review": {"des": "Best donuts I've had. I tried the Biscoff Banana Pocket, the most delicious donut ever. Only 4 stars due to prices and timely fashion to make a hot chocolate.", "pics": null}}, {"review": {"des": "Coming from NY, I can't help but compare. This place is just as good as Doughnut Plant in NYC, which is good news. I had the toffee donut, which was not SUPER sweet but still pretty damn sweet. Not too much flour and just the right amount of sugar. It is still pricey for a specialty donut -- $3.90 after tax. But I guess it's worth the size.<br><br>Was pretty bummed that this is a chain, since I expect great places to stand on their own. But that's okay; can't wait to try all the other donuts the next time I visit!", "pics": null}}, {"review": {"des": "Great place for a tasty treat . The pistachio lemon old fashioned was great. Can't wait to try more!!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4CJyxpZcpLS9p5xjvCnxSA/348s.jpg", "caption": "Lemon Lemon Pistachio Old Fashioned"}]}}, {"review": {"des": "Adorable decor, fancy donuts! It's pretty heavy so unless you're huge on sweets you might want to share.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mK0zragnVZc5EmzYK7H_Ng/348s.jpg", "caption": "The chocolate old fashioned."}]}}, {"review": {"des": "Simply put, I am a nut for a donut! A great donut is hard to find and this place does not disappoint. Cute little donut shop with tons of choices to appeal to any sweet tooth. If your palette prefers a basic donut, such as a plain glazed, they have that. However, if you have a craving for something over the top like the Maple Caramel Bacon Pecan Bar, that too is available. <br>The selection and variety of donuts at Stan's is tremendous and this place is not to be missed.<br>If you are a donut fanatic, Stan's is a must-try.<br>Note: Because this is a small, often crowded, quaint donut shoppe, it is quite beneficial to review the online donut menu in advance; so as to have an idea of what flavors you may want.<br><br>Do-nut miss this place!", "pics": null}}, {"review": {"des": "Oh boy! Amazing donuts for everyone. Old fashioned, fluffy yeast, cronut, and other types of donuts are ready for your liking. It was hard to chose just one. Highly recommended! <br><br>The old fashioned double chocolate and (stuffed) croissant donut were awesome!", "pics": null}}, {"review": {"des": "I love there vegan glaze donuts! They taste amazing! Stan's Donuts have a great quantity of different types of donuts!", "pics": null}}]}