{"name": "star-lounge-coffee-bar-chicago", "reviews": [{"review": {"des": "Star Lounge sign inside and a Dark Matter sign outside- confusing the bejesus out of me.  This location was a former bar and I'm assuming that it was called Star Lounge.<br>They roast the beans on premise (upstairs)<br><br>A long bar to sit at where you can chat with locals or sit quietly and work.<br><br>Back outdoor area for warm weather coffee sipping...great for the fall (cool weather and hot coffee is a great option)<br><br>Excellent local coffee roaster and delicious product...very comfortable vibe", "pics": null}}, {"review": {"des": "I'm probably at this coffee shop at least once a week at the end of the month thanks to running out of data or slow service via Tmobile.  (Tmobile users know what I'm talking abt ) <br><br>I don't think the coffee is that great here and not alot of options but I love the reliable internet service I get there as well as the space set up.  The main area is the loudest with patrons talking, the music playing and the normal hubbub of a coffee shop.  There's also a quiet room upstairs.. I mean dead quiet which I have used many times and have enjoyed.  Every once in awhile you get that jerk who is having a whole 45 min conversation on their phone or people meeting.  I haven't encountered this all that often though.  Last, there's a back patio area if you want to set up outside and enjoy the weather, get some air, etc.<br><br>For the most part, very friendly service, the hot teas are pretty good, and there's usually a nice choice of pastries depending on the time of day you go.  I haven't personally tried any of them but maybe one day.  I wish they had other healthier options rather than donuts and croissants.  Other than that, not bad!", "pics": null}}, {"review": {"des": "Came here this morning because I generally like the coffee and usually have no problem paying... but for some reason they have since removed and their Apple Pay feature without making it apparent ... This is gonna sound like a truly first world problem but if I'm used to using a particular pay method you probably should under no circumstances remove that method especially when I have become acustom to it and have no alternate form of payment because of it.<br><br>Came here , ordered a full order just to realize I couldn't use the Apple Pay service and had to get out of line and leave lol. Actually so embarrassed? To be fair the clerk was nice and was willing to comp the order but I was mortified to say the least . I probably won't be back, and it's not the employees fault . Simply the business owner or management that thought it was okay to remove the system... headed to Starbucks I guess lol.", "pics": null}}, {"review": {"des": "Finally got a chance to check out Dark Matter coffee in Chicago! Hit up the Star Lounge after a Cubs game in Wrigleyville, they were open later which was a super plus for us because most of the other coffee shops had already closed by the evening.<br><br>The barista was super friendly and helpful, and answered our trillions of questions we had about the coffee and the roasting process. The coffeehouse itself is a dive with a hipster feel. Think bar/graffiti art atmosphere. It's not one of those clean-cut, business people working on laptops type of coffee shop. In fact, it is partially a bar/lounge hence that name. But you can work on your laptop, do they have seating arrangements for that and Wi-Fi. They also have some outdoor seating that looks pretty nice, just too hot when we were there.<br><br>I had a chai latte, which was made with their own black tea concentration and spices. It was okay, but didn't blow my mind. We also tried a latte, it was pretty good. I think we need to give this place another chance in order to give a full review. Until then giving it a 3-star for awesome customer service and good coffee. Knocking off some stars for dirty bathrooms.", "pics": null}}, {"review": {"des": "Star Lounge is part of the premium Dark Matter consortium of coffee bars and the nearby \"Mothership\" roastery. I first learned of Dark Matter coffee from a restaurateur friend years ago. True to the name, they're only darker brews. While I'm actually a lighter brew type of cat (counterintuitively lighter brews have more caffeine precisely because they're roasted less), DM is very good premium beans.<br><br>Star Lounge has a nice neighborhoody feel with bar swaying area, a few tables, and even a colorful, mural-ed up back patio. It's very hipster, as befits its Ukrainian Village neighborhood. I rarely get frou-frou drinks but their agave lattes and the like are excellent, if a bit pricey at upwards of $5+. But their daily brews, usually 2 to choose from, rock!<br><br>I buy beans here sometimes too and they brew up wonderfully at home. They're similarly pricey at $16-19+ for 12-16oz. I paid $25 once for the out of production Fernet Branca steeped beans. The packaging of all beans is amazing, works of art in their own right!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Tvo1tXdnXJRtZlIibOZoRA/348s.jpg", "caption": "Fernet Branca steeped beans. 12oz for $25!! Better be good! Alfie was meh. A rip at $4."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/69Qy0fOUgpC2ANxhtwRQmA/168s.jpg", "caption": "Fancy Fernet Branca steeped beans. $18/12oz"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0tmaZCChBe8_o7r0c7evEg/168s.jpg", "caption": "She's board"}]}}, {"review": {"des": "Came here yesterday for the first time and I won't be back. The staff was honestly just rude. Nothing about the ordering process was positive. They were super short and made me feel uncomfortable. The menu said they offer soy or rice milk so when I ordered rice milk, they snapped 'you're going to have to pick soy or almond - we don't have rice milk'. Umm ok I was just going by the menu, but thanks. <br>The drinks we ordered (gingersnap trainwreck & the wake and bake) were not good. They were luke warm and the gingersnap tasted incredibly bitter. It has honey in it and it was all sitting in the bottom of the cup. The wake and bake was the better of the two but not worth going back for. That, coupled with the service left a bad taste in my mouth. Literally.", "pics": null}}, {"review": {"des": "Wow<br><br>Oh. My. WOW. <br><br>Mayan Mocha. Absolutely delicious!!! The vibes and energy of the place is warming and welcoming, personally I enjoy the artsy feel. <br><br>I get a \"Fear the Loathing\", vibe from some of the art work. They have a beautiful outside seating area too. <br><br>The coffee has a beautiful aroma, taste, and me-oh-mighty-Boldness.<br><br>The staff was as helpful as can be considering how busy it was around 9. <br><br>They have dairy alternatives too; Almond or Soy¿", "pics": null}}, {"review": {"des": "Everyone is great here, always a smile on their face and very welcoming. Usually it's not too hard to find a seat here and they have a fairly large outdoor patio in the back parking is also not usually a problem", "pics": null}}, {"review": {"des": "Cool vibe. Punk rock, art space, with a patio and coffee that will kickstart your heart. Seriously, the caffeine in this coffee is insane. Bonus: their coffee sometimes supports organizations doing cool things.", "pics": null}}, {"review": {"des": "Time for a 5-star update! Star Lounge is such a great independent coffee shop, serving Dark Matter Coffee, free WiFi, bakery items, and neighborhood vibes.", "pics": null}}, {"review": {"des": "If Han Solo frequented Coffee Shops, then he and Chewie would probably cap-off the Kessel Run at the Star Lounge...because this place is cool.  Most importantly, it is one of Dark Matter's cafes, and the roasts themselves set higher standards.<br><br>This Coffee segment will take a minute because I have specific examples of just how good it is.  As for the drips, you have a $3.00 bottomless option while at the cafe featuring no less than three distinct, delicious, and deviating from the norm.  A constant rotation supplemented with some of Dark Matter's stalwarts (e.g., Unicorn Blood roast) compliment the espresso bar.  Turning thereto, the establishment serves a variation on the Mexican Mocha known as the \"Mayan Mocha\" that still brings the heat but implements a better craftsmanship to produce a creamier result than normal with this mixture.  Also, although it is slightly comparing apples to oranges, the Mayan Mocha will crush the Ipsento Sissy (but not the Ipsento Sassy) in a taste contest.  (NOTE: the Sassy is just such a different animal with the Cayenne Pepper.)<br><br>As with any legitimate coffee shop, one must review and compare the cappuccino.  Star Lounge will destroy anyone--maybe even other Dark Matter stores--on the quality of this cappuccino.  The staff takes pride and does not serve you a wussy latte that they call \"a cappuccino\".  This thing is legitimate: perfectly frothed cream of your choice, correctly brewed espresso that has not been burned, and properly served in appropriately-tempered glassware.<br><br>The shops pastries form the backbone of your coffee experience, featuring some unique flavor choices to compliment your roast, as well as some old favorites like the croissant.<br><br>The iced coffee on tap is ahead of La Columbe on flavor and consistency, and the theme of constant rotation like the aforementioned drips continues to this tap.<br><br>Onto AMBIANCE: this is the spot.  Because the establishment is located in a former two-flat, the space is quasi-original.  The furniture is standardized with a coffee bar nearly the length of the first floor and standard high- and low-top tables.  Two individual-use bathrooms ensures customer comfort. Upstairs are more high-tops and WiFI printer in case you need to get prepared for a meeting or something.  However, the place has a DOG-FRIENDLY, FULL PATIO in the back off of the first floor deck/porch with access to/from the alley and from the gangway gate on Chicago Avenue.  If you're a neighborhood person, then you can stay away from busy street and also guard your pooch.<br><br>As for SERVICE, perfection takes a minute on the espresso drinks.  However, you will be hard-pressed to find a better delivery on Drip, Iced, and pour-overs in the City.  The staff is friendly and treats everyone like they belong in the neighborhood.  The number of regulars likewise indicates a healthy staff to which people innately wish to return.<br><br>Make this your coffee place if you live anywhere, but especially if you live in Uki Village or West Town.", "pics": null}}, {"review": {"des": "Living in Milwaukee, I have an abundance of great coffee shops, with great roasts and great atmosphere (I.e. Colectivo, Anodyone, Valentine, Fuel).  I have always been disappointed with the selection of shops in Chicago (Intellegensia, Peet's, and the abundance of Starbucks and DD's).  Embarrassingly I learned of Dark Matter from the Netflix series, Easy (which is a great show btw.)  I walked into the Mothership with the intention of sitting down and reading but that location is where they roast so it's just grab and go.  Right astound the corner is Star bar.  Obviously they had Coloring book blaring and the coffee was on point.  I bought a bag of a sip of hope to take home and I'm glad I did.  Dark Matter can definitely compete with the Milwaukee greats as far as coffee shops go!", "pics": null}}, {"review": {"des": "Imagine coffee in non-alcoholic \"cocktail\" form. That's what I had.<br><br>I had the Wake and Bake, which had sage, black pepper, and maple syrup in it. Sounds gross, but the barista said it was his favorite, and that it tasted like breakfast. He was not wrong. It wasn't too sweet, and it had a slight spicy taste to it. Who knew maple syrup would be so good in coffee!? I'll have to try this at home too.<br><br>The patio was empty with customers going in and out, but it took a while for me to get a table inside. It's a busy cafe with customers either working on laptops there (PS spotty wifi) or just running in to grab some delicious coffee.<br><br>I can imagine the place being packed on weekends, so I'll keep my visits to weekdays only.<br><br>Little note on the side: Cutest bathroom wallpaper... EVER.", "pics": null}}, {"review": {"des": "There was no one outside when I walked up the other day. I thought it would be empty inside but I couldn't find a seat. It was surreal. I got the drip and for the Dark Matter drips I've had around town I'll say that I wasn't blown away, it was still good, but odd to be at their own bar and feel like I'd had other people make it better. Good music, good service. Maybe try one of the espresso drinks, I get the vibe that they're better.", "pics": null}}, {"review": {"des": "Worst service ever. Lady had a rude attitude when we asked her to wipe down the table upstairs. Shes like \"oh its sooo dirty\" as she wiped down the table. With lots of pretentious sarcasm. <br><br>Very loud music for studiers. Nice upstairs but dislike stool/high top chairs and tables. <br><br>Would not return because of bad service.<br><br>If you're gonna be a white owned business in a latino neighborhood, at<br>least be courteous to POC (people of color) and knowledgeable of the culture. Don't dominate and use your entitled, white superiority complex on me or any others.<br><br>Think twice before going here! #highlygentrified #raciallyignorantcoffeeshop #rudestaff", "pics": null}}, {"review": {"des": "My boy Matt is the bomb. The people here are great, the vibes are great. The coffee is dope. Go to this place.", "pics": null}}, {"review": {"des": "V chill, v hipster. I like the Mayan mocha (chocolate, cinnamon, cayenne pepper, agave). Staff is welcoming/friendly and there is room to do work at the bar or at a table. Free WiFi as well. The only thing I dislike is their taste in music - it sounds like a death metal spaceship. Somewhat distracting for either getting work done or having a conversation", "pics": null}}, {"review": {"des": "Located just down the street from the mothership Dark Matter location, which is convenient since that one doesn't have much seating, whereas this location has 2 floors of seats. It can still get packed weekend morning/afternoons but if you're there early enough you can get a seat. I just got the regular coffee that was being served that day, very good as expected. They also serve a variety of baked goods and bagels. I didn't get any but they looked up to snuff. They also serve bags of coffee beans and Dark Matter apparel. NO parking lot but street parking wasn't bad. Location is a bit out of the way but still wasn't too hard to get to. I'd go back, or maybe a different location", "pics": null}}, {"review": {"des": "The coffee itself is very good. However, I can't say that about the barista. She was very rude. She seemed annoyed from the beginning and it only worsen when she mistakenly gave me the wrong size. I politely told her I ordered a large not a medium. She made a new one and I asked her what should I do with the extra one. She said: \"well did you drink out of it because if you did I can't give it to someone else. I'll just have to toss it.\" First of all, wouldn't a person coming in for coffee want it freshly made not one sitting on the table? Apparently, this barista thinks it's McDonalds that they serve food sitting in a hot lamp.  Side not the cashier was very nice.", "pics": null}}, {"review": {"des": "The staff was welcoming and the tea was amazing! They take the time to explain the various drinks. This place has a bar like feel, but is also a great place to get some work done. Free WiFi which is always a plus! I will be back soon!", "pics": null}}, {"review": {"des": "Free first drink as I was visiting town. So much caffeine I almost died. But that's what I wanted so... They have non dairy creamers sitting out so you don't have to awkwardly ask them personally for creams other than the typical half and half. They also have a sick patio for everyone's instagram #instaawarenesss", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xsdTUy1-8oTOlHFmhWxRng/348s.jpg", "caption": "Great people behind the bar. Traveling from out of state and had never had their coffee before and they gave me my first cup on the house!"}]}}, {"review": {"des": "Wow! Such a cool chill spot for a hot cup of joe or chai I should say ( I don't drink coffee). Shiny disco ball, loud rock music, and a wonder world of murals painted in the back patio! I can't believe I didn't try this place sooner! I def will be returning!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zbM63GOASD32SZDNl-sU5g/348s.jpg", "caption": "Star Lounge"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rwrf1F8dMxF9K-AnM8GPqA/168s.jpg", "caption": "They make a mean chai tea latte at Star Lounge!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eyeVXL3BJClNE-ViQ-5kqg/168s.jpg", "caption": "Star Lounge"}]}}, {"review": {"des": "Best coffee I've ever had and really great customer service :) upstairs was cute and quiet and downstairs was more like basic bar vibe", "pics": null}}, {"review": {"des": "Star Lounge is a good place to relax or study (if you are okay with extremely loud music). The staff are super friendly and the coffee is pretty good. I usually get the one with agave and cinnamon...yum! Outdoor seating is available, but it is often filled.<br><br>I would greatly appreciate it if the music was turned down. It is to the point of blaring, and I couldn't even hear my friend talking when sitting across from her when I was there last. Also, I hope that this cafe will increase its pastry stock, as they ran out of many (besides the bagels) around 3/4 on a Sunday.", "pics": null}}, {"review": {"des": "This place, along with the other Dark Matter coffee shops Osmium and Meddle, are my favorites in Chicago.  Dark Matter roasts their own beans and I think all of their coffee styles are excellent, especially \"A Love Supreme.\"  With Star Lounge and Osmium I love the bar setup, always great music, the pastry and bagel selection is great (love the ham and cheese croissants), and the staff is always awesome.  I do try other places across Chicago so I know what's out there and the Dark Matter shops are still always my favorite and a destination even when out of the way.  Also, \"A Love Supreme\" is the only coffee I drink at home and gift out to friends.  My favorite place for hot chocolate and mochas too, you taste the chocolate without being overwhelmed by sugar.", "pics": null}}, {"review": {"des": "Finally got to try this place out and could not have been more happy with the experience! The service was quick, efficient, and friendly. The food items and beverages were incredibly tasty as well. The aesthetic of the place is perfect for hanging out with friends and getting work done. <br><br>Ordered a 12oz Vanilla Soy Latte, Iced Coffee on Tap, Pistachio donut and the chocolate croissant. <br>I know that the baked goods are from elsewhere but they were both so delicious and fresh! The Vanilla Soy Latte was perfectly creamy and foamy on top. The vanilla shot in it made it very sweet but still palatable and I couldn't stop sipping on it. The Iced Coffee on Tap was very refreshing in comparison to the Latte and was perfect for the 90 degree weather today. I highly recommend ordering whatever they have on Tap that day if you're craving a refreshing Iced beverage. <br><br>They also provide wifi which is awesome! Whoever you sit, inside or outside, you'll be able to enjoy beautiful artwork!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xqjTBCFwOISj_8ygKE2p6g/168s.jpg", "caption": "Iced Coffee from Tap and a pistachio donut"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oRU8jNyECDbJV06hB7g1DA/168s.jpg", "caption": "Left: Iced Coffee from Tap, Right: 12oz Vanilla Soy Latte"}]}}, {"review": {"des": "The concept of a coffee bar is a new one to me. And I must admit I like Star Lounge had done in that space. They've repurposed a bar with a coffeehouse feel and it works well. <br><br>I had a Mayan hot coffee for my first visit and I took it at the bar. Not one grain of sugar did I need in it. I shall have to return at a later date and try some of their other coffee selections.<br><br>Star Lounge gets it correct.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xvXv3ZfB_mlVUaSFGFxLgA/348s.jpg", "caption": "Mayan Hot Coffee"}]}}, {"review": {"des": "My first time here and I love it. Great coffee and awesome old wooden bar. Also plenty of outdoor seating on a back porch.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VNZKjUNW-PDQiSnFRiiibg/348s.jpg", "caption": "Nice bar seating"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kxO6mTl4F-X3RcR6QdJfVg/168s.jpg", "caption": "Sweets!"}]}}, {"review": {"des": "Awesome coffee, super friendly staff, great music, room to chill, work or hang. <br>Love this spot", "pics": null}}, {"review": {"des": "I live in the northwest and we love our coffee! I have sampled coffee from some of the best roasters in Seattle and I can say that non are better than Dark Matter! I've been visiting Chicago every 4 to 5 weeks and I make my friend bring me here on every visit! My go to is the a basic iced vanilla latte and I have to say this is the best I have ever add. The balance of flavor is perfect...not too sweet and a nice strong velvety coffee flavor that is not overpowered by milk. My favorite part is that they top off the iced latte with foam! If you aren't interested in hanging out while you drink your coffee...you can also just run into the mothership location not too far from the coffee shop! Love this place and it is a \"must do\" every time I visit Chicago...I am addicted to Dark Matter", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wRfpJw1DGAWeqhiI6bqT4Q/168s.jpg", "caption": "Unicorn Blood"}]}}, {"review": {"des": "This place is amazing! By far the best coffee of all the coffee shops I've studied at. Bonus, there are no pay to park meters to worry about. Very thankful they have been nice enough to let me camp out and study as of late without even asking for rent. The employees are always super friendly. If I pass my board exam it will be thanks to them. Side Note: This place is frequented by the hottest police officer I've ever seen in my entire life and the probably the only one with full sleeves... Never have I been so excited to see the police.<br>Xoxo Girl Who Bought 2 Chocolate Croissants in The Same Day", "pics": null}}, {"review": {"des": "Good coffee. Pretentious staff. I was hoping to start a dialog about drink recommendations but, instead, the menu was shoved in my face and the barista impatiently began asking other people in line if they knew what they wanted to order. Maybe they should post the menu in a conspicuous space so that customers can decide what they want prior to approaching the counter since the baristas are in such a hurry to get you in and out.", "pics": null}}, {"review": {"des": "No question, Dark Matter has hands down the best coffee in town.  Not just coffee with a pulse, but plenty of soul.  Step unto the mothership and let the funky coffee take control.", "pics": null}}, {"review": {"des": "I've been to this location several times and every time the employees are pretty rude or disengaged. The drinks never taste the same, it really depends who makes it if it's gonna be good or not, and often times the barista spends her time chatting with people at the bar stools while holding the stuff to make your drink but not actually making your drinks. Waiting 10 mins for a vanilla latte when you're the only one waiting just isn't right (this has literally happened to me 3 separate times in 2 weeks) I really like dark matter coffee though. I would suggest going to their quick stop location on western instead, they are nice, fast, and drinks are always consistent.", "pics": null}}, {"review": {"des": "First of all, the coffee here is very good.  <br><br>The cons.  First, I go to a coffee shop to get great coffee. I don't go there to see political signs and hear about the liberal politics of the shop or the workers.  Huge turn off.  Secondly, the outdoor patio in the back is nice but it's always so full of dogs you can't enjoy it so you are stuck inside.  <br><br>Dark matter coffee is good but the shop made me feel very uncomfortable.  I won't be back.", "pics": null}}, {"review": {"des": "Great coffee  fresh, strong , bold and smooth. Pastries poor selections of vegan deserts. They need to change that. <br><br>The staff are great , cool and laid back. I will come back.", "pics": null}}, {"review": {"des": "My #1 go-to coffee shop for when I have to work. Their internet is lighting fast, they have bottomless large coffee and it's probably the only establishment that I can work for hours at with no one making me feel like I have to leave.", "pics": null}}, {"review": {"des": "OK let's get this straight. Nobody makes a better cappuccino! The thing I love about this place is THE STAFF! They are super sweet super helpful and seem to love their job and love what they do. In the world of coffee can be really pretentious and the people could be really nasty but they're not. <br><br>Everyone of these dark matters coffee shops I go into the people working there are lovely. Get the large cappuccino for there and it comes in two servings. It's like two drinks for the price of one!", "pics": null}}, {"review": {"des": "Hip and chill coffee shop with friendly staff. Came in on a Sunday afternoon at around 11am and place was popping, super busy. All the tables and bar space were occupied. I ordered a large Gingerbread Trainwreck with almond milk since it seemed to be a seasonal item given it is November. It had a good mix of spices and gingerbread to the point that it wasn't overpowering, but enough to mask the coffee taste (if you don't like that). Their pastries looked really good too, but since I came from brunch I didn't try them. Will have to next time. <br><br>Ambiance wise, it's chill, but the music is loud. So if you can't work with loud music  (especially rap or hip-hop) or are looking to catch up with someone, this may not be the best place to do so. I had headphones in trying to listen to my lectures and could still hear the music. It's not a bad thing, I personally can't have both playing at the same time, it's too distracting. I'd come back for the coffee and to work here if I didn't need to listen to lectures.", "pics": null}}, {"review": {"des": "Came in on Sunday after brunch with my Boyfriend and a friend of ours. Our friend raved about their coffee during brunch and mentioned they even have it on tap! I thought that was really cool and was totally up for checking this place out and I'm glad we did! <br><br>We were immediately welcomed and greeted, this place is definitely the spot for coffee! In a world that is ruled by Starbucks and Dunkin Donuts.... This place is definitely holding it's own. The atmosphere, the awesome welcoming staff, this place wants you come in and enjoy! They even have outdoor patio space in the back!<br><br>The iced coffee that I got was off the tap and it was really good! It was just what I needed after a filling brunch! I was a little sad that we were only picking up... Now that I know this place exists, I will definitely be back to sit down, relax, and enjoy my coffee! Check it out for yourselves!", "pics": null}}, {"review": {"des": "Wow -- never seen harder works.  It was 40 degrees outside, the doors were open, and half of the employees were sweating from running around taking care of everyone's orders with immaculate detail.<br><br>The coffee itself is great, the menu is innovative, and the people are friendly.  A hidden gem in Chicago.", "pics": null}}, {"review": {"des": "I've lost count on the number of delightful Dark Matter Coffee espressos and specialty lattes I've had here (and the Mothership and Osmium) and never ever ever once have I had one remotely crappy or even mediocre coffee. <br><br>That's it, I'm in love. Who knew I was so easy?<br><br>p.s. Just don't call me a coffee 'ho (but if you insist, buy me some and prove it).<br><br>p.p.s. Jokes aside, Dark Matter Coffee is SO GOOD I even do mail order now if I run out of beans in my home brew lineup. I'd probably mail order a Star Lounge barista or accept traveling volunteer visiting baristas too too (DM me, boo).", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/v8mDdY8QaSuZ1TUSZ3Tx3Q/168s.jpg", "caption": "Cortado"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3Xc8hXNL5rDHRnvDBHAJJQ/168s.jpg", "caption": "Mocha"}]}}, {"review": {"des": "Great coffee, superb staff and awesome music. Pretty much sums it up. Check this place out. Seriously.", "pics": null}}, {"review": {"des": "Star Lounge is my favorite coffee shop and I feel so lucky to have it in my neighborhood. The Mayan Mocha and Gingersnap Trainwreck are my go-to's--so delicious!  I haven't found other coffee shops comparable since I found Star Lounge. The vibe is also super cool and they are always playing some fun music. I remember I walked in one Saturday morning and they were playing the Dirty Dancing soundtrack.  Oh and they have a disco ball...enough said.", "pics": null}}, {"review": {"des": "Sooo I work from home so I use cafes as my office daily. This is my favorite neighborhood spot, the staff is hella friendly and always remembers me. The specialty lattes are amazing, the wake and bake is my usual. The cold brew on tap is great and the bottomless drip is a really good deal. You can alternate brews and sip all day. The back patio is amazing and dogs are encouraged! Head upstairs for a quieter, focused zone and downstairs for the party. Real talk, sometimes they get carried away with cranking the music. <br><br>They get docked a star for a couple of reasons, 1) their wifi is often spotty  2) the chairs upstairs at the two person tables don't fit under the tables, the seats are too wide 3) the way the bar is designed downstairs, the lip doesn't come out far enough so ergonomically speaking, your knees can't comfortably fit underneath it so it's impossible to sit with your back against the backrest and type on a laptop.", "pics": null}}, {"review": {"des": "What a gorgeous Monday evening in Chicago!  I finally was able to explore the West Town/East Humboldt Park neighborhoods without having to worry about the temperature.  <br><br>As many of you've known me on Yelp, I can't go on living without coffee.  I've seen people on Yelp rave the Star Lounge Coffee Bar, located just one (1) block west of Western Ave. on Chicago.  I had to pay the visit to find out exactly what this was all about.  <br><br>They definitely have one of my favorite, the Mayan Mocha.  Nevertheless, I opted to try something different this time.  Hubby and I went with a 20 oz. Agave Mocha.  <br><br>If you're a cinnamon lover, agave mocha would be right down your alley.  My preference still goes to Mayan Mocha, for it is consisted of the cayenne pepper which I like.  However, Agave Mocha was a great change-up.  <br><br>I'm especially fond of the sitting arrangements at Star Lounge.  They have a plenty of bar stools so you can watch baristas make your drinks in actions.  The patio they have in the backyard is also amazing and very comfortable to chill for an extended period of time.  <br><br>Star Lounge is an ideal place to be during the upcoming summer season in Chicago.  Are you ready for the advent of \"prime time\" in Chicago style?  I know I am.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eWrWAZXkuSp7-0icxEOnmQ/168s.jpg", "caption": "Agave mocha"}]}}, {"review": {"des": "A coffee bar in the tradition of the coffee bars of the past. A place to hang-out. Great porch. Gladly it is nothing like a Starbucks. So if you are looking for that vibe...you won't find it.", "pics": null}}, {"review": {"des": "I hate to do this but their wifi was not working when i went. That is mainly the reason why i came in the first place. They dont even have a sign or warn their customers. What a shame because their coffee is great!", "pics": null}}, {"review": {"des": "5/5<br><br>I've FINALLY made it to Star Lounge!! I've always stopped by the Dark Matter Coffee Mothership that's around the corner to pickup my beans, but had some time and came to the cafe. My review will be VERY biased as Dark Matter is my favorite coffee roaster. <br><br>Upon walking in Friday night, it was a bit empty, but that just meant I could roam around and gaze at their interior like I was at a museum without getting weird stares. THIS is my candy store. Wish I had taken pictures of their walls because they actually had little tabs mentioning the artist for each hanging. Naturally, I questioned the baristas about some new beans and they were very insightful and gave great recommendations that suited my tastes. I liked the fact they weren't trying to push any purchases, but were genuine in the recommendations. They told me Friday's are $2 off beans and psh, of course I'm buying a bag then!! You had me at first taste, you don't have to convince me otherwise.<br><br>I read some reviews and regret not checking out their upstairs, I was too busy rummaging through their merchandise, like \"Look at this jar with their logo!\" as my friend proceeds to roll their eyes. Small thing that caught my eye was how tiny their main floor, bathroom sink was. I wouldn't suggest this for the claustrophobic, but that thing was cool! Sorry I don't take pictures in the bathroom.<br><br>I grabbed a cortado and sank into my seat. How can something so small make such a big impact? The Unicorn Blood was velvety smooth with the perfect balance of milk. The worst part was sipping the drink knowing it was coming to an end soon. It was Friday night and wasn't planning on slamming down 5 cortados (wish I could though...). I've bought the Unicorn Blood before, but realized the world of difference in having it as an espresso than the normal pourover at home. Got my loyalty card stamped and took my Giant Step to begin my Friday night in Chicago strong.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gfK88jyrHENrC3ZKeg6fJw/348s.jpg", "caption": "Velvety smooth Unicorn Blood cortado. No sweeteners added but the cortado itself bring out some sweets that makes your tongue dance"}]}}, {"review": {"des": "I went on a trek here because I wanted to try a different local coffee shop in the nearby area and this was next on my list. There were a lot of people there even though it was the middle of the day. Plenty of people were sitting at the bar while there were at tables. There was also seating upstairs, which I didn't even need to check out because I found seating right downstairs near the bar area. <br><br>I ordered an 8 oz latte and a sea salt bagel with cream cheese. I was a little disappointed because there was a plastic knife, a Philadelphia cream cheese, and he didn't offer to toast it. I know I probably sound like the most spoiled, pickiest person on the planet, but I definitely have received that basic service at similar cafes. I was also a little disappointed by my 8 oz latte because it came in a paper cup. The barista had warned me before ordering that the largest size comes in a to-go cup, but I wish that he had informed me that the smallest size would also come in a paper cup. All of that aside, the coffee was delicious (for coffee--I'm not a big drinker) and also had the most adorable little latte heart! It was very Instagrammable (my favorite). <br><br>The atmosphere at Star Lounge is great and very laid-back. I felt relaxed there and was also able to get down to business to get work done on my laptop. A lot of the people there seemed to be regulars and there was a lot of greeting each other. I loved that sense of community! So, even though the bagel was two stars and I wanted a real cup for my latte, everything else was five stars. What a cute place!j", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Kf7n_nkz7iosKbYJ_PV1Bw/168s.jpg", "caption": "Bathroom"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eWs8IcZweC_g1bK19U78mQ/168s.jpg", "caption": "8 oz latte, sea salt bagel"}]}}, {"review": {"des": "UPDATE: changed my review from 1 back to 5 stars, they upgraded their high speed, it's now 30mbps.<br><br>So of course their coffee rocks.  I compare it to Blue Bottle in SF.  Quality, rich beans.  It's got that \"beefy\" taste I like to call it when you have their mochas or lattes, and coffee that has that beefy sorta taste is the best.  You cannot find a better roaster in Chicago, and no Intelligensia doesn't come close to Dark Matter", "pics": null}}, {"review": {"des": "Favorite coffee place in Chicago. Awesome staff and great coffee with decent prices. I only wish they had better parking so I can get in and out on my way to work in the morning..but I know this is a lot to ask for the location so I'll get over it. Get the chocolate city iced coffee!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/czmpoI5gFjiOyfJX9uHOsA/348s.jpg", "caption": "Another plus: supporting a great cause"}]}}, {"review": {"des": "This has been by far, the best coffee and coffee shop I've experienced. The staff are genuine and awesome, the \"locals\" are super friendly, and the coffee a<br>Is absolutely delicious!  Before I leave I'll be taking pounds of beans home with me!", "pics": null}}, {"review": {"des": "Ugh. I really wanted to love this place based on the great reviews and good things I've heard about it in the past. I'm new to Chicago and have been trying all different coffee shops to find my favorite. I came here this weekend to sit and have a cappuccino. It was pretty busy but I was able to grab a seat at the bar. My drink was ready pretty quickly, which was nice. The cappuccino itself was totally fine, but underwhelming. I really expected it to be darker or have a deeper flavor and it was just kind of plain. The drink also wasn't very hot. Did I drink it and enjoy it? Sure. Was it the best I've had? No, not really close. The staff wasn't particularly friendly, and as I've read in some other reviews, the place didn't seem to be the cleanest. I'm glad I gave it a try, but I won't be back.", "pics": null}}, {"review": {"des": "Stopped by for the Scopes in the City event for my birthday. Absolutely loved the ambiance and the music. Spent some time admiring the art they had all over while my coffee was being made. I ordered the Mayan Mocha and my girlfriend had the Agave Latte. I was not disappointed, the presentation was beautiful and the dash of cayenne added a nice kick. Loved their patio, wasn't able to enjoy it too much since it was chilly but I'll definitely be back.", "pics": null}}, {"review": {"des": "i don't know why it took me so long to come here.  i love the bar, the pastries (was that donut vault i saw?), the vibe, (although i wish people would stop ruining cafes with their laptop office spread).<br><br>dark matter for there, beans to go.<br><br>that's really all i need.", "pics": null}}, {"review": {"des": "5 stars seems a little much for a coffee shop -- doesn't it?<br><br>Let me tell you why only 1 out of 20 coffee shops reach this esteemed status:<br>(1) Some of the best coffee in town. This is a must to earn 5 stars. Consistently well brewed. Espresso delicious. Best Iced Vanilla Latte in town.<br><br>(2) Having come here 20+ times, the Wi-Fi has never been an issue. This is a must to earn 5 stars. Never slow, never finicky, never elusive. BUT, it isn't always easy to connect to it once you're outside on the patio. I'm going to go ahead and try to convince you this was a conscious decision by Star because they want the outside to be free from connectivity, so much as they can help it, for your benefit of enjoying the air, the people, and the space around you. That's why the patio is free from Wi-Fi waves, not because their routers aren't strong enough to reach out there.<br><br>(3) It's a place for everyone. Outside patio for when it's nice. Downstairs space when you want good, loud music and activity. Bar seating if you came alone or you want to talk up your barista-friend. A couple long, communal tables that make it easy to share with strangers on a packed morning. And, don't fret -- an ENTIRE UPSTAIRS where the music barely reaches for students, programmers, writers, businessmen, and the extreme introverts who can quite literally hide away. There should be a separate Yelp review for \"Star Lounge - Upstairs\", maybe even a separate tax.<br><br>(4) Loyalty cards. A place like Star does not need a loyalty card to gain traffic. But they have them, and they are a lovely bonus.<br><br>(5) Star has as many restrooms as it does menu items. That might not actually be true. But they have 3 restrooms. 2 downstairs and 1 upstairs. Think of the assurance that this gives you, being that caffeine is a natural diuretic..<br><br>(6) Sometimes, a barista named Dennis works there. He's cool and his babies warrant another star on their own. And his wife cuts my hair and I look damn good.", "pics": null}}, {"review": {"des": "This is the second cafe I visited on the most recent Chicago trip. Dark Matter caught my eyes a few months ago because I began hearing stories that these guys were making coffee with green beans aged in used whiskey barrels. Yeah, seriously and beyond the fact that I love Bourbon and Scotch, the concept had me intrigued yet every time I tried to order the beans, they were sold out online.<br><br>Overall:<br>I was here Saturday morning around 9AM and it was a packed house. Too cold to sit outside but they have an awesome sitting area with benches and a mural out back. The bar itself is long and seats about 18 people with a few tables scattered around. I ordered an espresso, Chai Soy Latte and a pour-over of their Barrel Aged Eden Coffee. Layout was nice but the line for coffee took a while to get through. They also had some cold brew on draft presumably on Nitrogen and they offered tea as well. Sorry to any Dark Matter lovers, I probably won't return as you'll see from my notes below but maybe I'll give it a second chance next time I'm in Chicago and update this review.<br><br>Espresso:<br>I was fairly happy with it. It was dense but a bit too bitter for my liking. Nice crema but the espresso was served not very hot like I could have drank it immediately down the gullet which was surprising but also a bit troublesome. Not sure why it was so 'warm' instead of hot but still the taste was okay. 6/10<br><br>Chai Tea Latte:<br>This wasn't my drink so I only had a sip of it but it was very 'latte' like. Thick, lots of froth, lots of sweetness and the tea was masked by this. I liked it but didn't love it. 6/10<br><br>Pour-Over, Bourbon Barrel Aged Eden:<br>I discussed this bean with the barista making it. It turns out a year or two ago, the barrel aged coffee offering was 100% barrel aged and now they're blending virgin and barreled beans together to get a good taste. The barista said he was thankful that was the case now because he really loves this product compared to the 100% barrel aged they used to offer.<br>My thoughts? Hmmm, it tasted like Irish coffee or basically straight up coffee with cream and Jameson whiskey added. It was thin, a murky brown color and after 8 sips over 10 minutes, I decided I couldn't finish the cup. 4/10...because I guess whiskey and coffee aren't for me. I went in expecting to buy a bag to take home and am glad I ordered a cup on-site first.<br><br>Pastries:<br>I split a chocolate Croissant with the GF and despite not being baked on-site, it was slightly warmed with a good flakiness and butter quality. 8/10 but probably a shame that this was the best thing they offered.", "pics": null}}, {"review": {"des": "I absolutely love this place to the friendly people to the amazing coffee. I can't even drink another coffee without comparing them to star lounge. <br><br>The only downfall for me is that I live in Indianapolis. :( My sister lives close to it so whenever she comes to visit my whole family makes sure she comes home with some. I try to explain to my friends how amazing their coffee is. You just don't know until you try it yourself. <br><br>I'm hoping one day that they have a location in Indy!  :)<br><br>I would highly recommend this place for the great coffee and friendly staff. It's a chilled laid back environment!", "pics": null}}, {"review": {"des": "I drive past here everyday on my way to work I finally decided to stop in for some growlers. I love the coffee but I hated the fact that I grabbed two growlers and some iced coffee and was charged an extra 20% .... I mean really!? I guess there iPad automatically charges that as tip? That's a $7 tip for being there for 5mins. Well I'll just have to go else where for my coffee.", "pics": null}}, {"review": {"des": "I finally tried this place and I must say it's awesome!! Mayan Mocha is to die for and since it was my 1st time they gave it to me for free..<br>Presentation is exquisite.<br><br>Awesome customer service I will definitely be coming back!", "pics": null}}, {"review": {"des": "I first went to Star a lounge about a year and a half ago when Ji, from the Windy City Live TV show (whom I met randomly on the bus...lol), suggested that I go check it out. She said she loved this coffee shop. So I did check out the place and remember thinking that the music was way too loud for a coffee shop. Now that I have joined Yelp, I feel the need to write this review.<br><br>Most recently, just a few days ago, I went again and my review is based on this most recent visit. I got there around 6pm on a Friday night and there was a small crowd there. I ordered tea, which I don't think should have been $2.50 when I can get a much bigger cup of tea somewhere else. Although, it is nice that they have a selection of teas since I don't drink coffee.<br><br>After getting my tea, I went upstairs because I heard it was quieter up there and I needed to get some work done. It was indeed quiet up there and I loved it even though I could still hear people chatting downstairs and I could still hear the music, although the music from above wasn't as loud as below. There were only 2 other people up there when I arrived. Later on, one of the workers starting badging up and down the stairs VERY loudly. I mean, granted, the steps are a bit squeaky and loud but he should have been considerate when he came up and down the steps. He kept coming up to take out the trash and do some other stuff (I think he was preparing to clean the bathroom). He later came up again to say that we all had to leave because they close out the upstairs an hour before the coffee shop actually closes. I wasn't too happy about that but it's their policy so I couldn't fight it. <br><br>I then went downstairs to try to finish my work but I couldn't because the music was SO LOUD. I felt as if I was in a club or at a dance party. Most coffee shops that I have been to play mellow music and I'm fine with that but Star Lounge just seems to play the wrong type of music and the volume is never turned down. Also, a bunch of guys in front of me where so loud that I just couldn't take it anymore. Do people normally scream and yell at coffee shops? Not to my knowledge. So, I left because I was upset and probably will never return here if I want to get work done. I guess the name 'Star Lounge' says it all - it really is a lounge and seems like a bar rather than a coffee shop.<br><br>I mean, I think this is a cool place if you want to hang out and chat with friends but it isn't a good place to try to stay focused in front of your Mac or PC (getting work done or studying). Go to Sip coffee House on Grand Ave instead - that place is awesome for trying to stay focused.<br><br>P.S. I think my experience would have been a lot better here if that one employee didn't keep running up and down those stairs. It was super annoying!!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JRtt50KbgO9c36crcEXNsg/348s.jpg", "caption": "24 January 2014 - the upstairs at Star Lounge."}]}}, {"review": {"des": "Best coffee in Chicago, great service, and nice atmosphere.   You can easily spend an hour or more here, with the free wi-fi and coffee-positive ambiance.   The coffee produced by Dark Matter is always top notch.   Have a cup of pressure pressed coffee, and take a bag of Unicorn Blood home with you.<br><br>Unfortunately, this environment suffers from a MAJOR HIPSTER INFESTATION.    And we're not talking about the bushy bearded, work-jacket wearing, PBR guzzling fun-loving kind of hipster.   What you have here are the trust fund babies on their MacBook Pro's in their outfits from Urban Outfitters (shirt buttoned all the way up to the collar), who will shoot you the stink eye if you sit next to them at the counter.   Unfortunately, slapping these little brats on the back of the head is not permitted.   Luckily, the excellent coffee served here will calm any violent urges, allowing you to peacefully co-exist with all that Ukranian Village has to offer.<br><br>Bottom line:  If you love coffee, and want to drink coffee in a place that is only about coffee (and perhaps bring a bag of home of amazing beans), this is the place for you.   Just remember, Ukranian Village hipster babies need coffee too, so you might as well get used to it.", "pics": null}}, {"review": {"des": "Incredibly bold coffee in a classy bar setting. What more could you ask for? A warm interior and playlists that make you want to leave your headphones off. And, to top it off, the service was delightful!", "pics": null}}, {"review": {"des": "This is one of my most favorite places to go to grab some coffee, good conversation, or a place to do some work. I've been going since they first opened, but never wrote a review yet. The atmosphere is great, and will be even better during the summer when you can sit on the patio with their awesome art covered picnic tables. Highly recommend.", "pics": null}}, {"review": {"des": "Cool local roaster! <br><br>Cool thoughts/vibes:<br>+ FREE WIFI. Have been going strong all day!<br>+ On drip coffee, free refills. <br>+ Baked goods are from West Town Bakery. Super yummy!<br>+ Outdoor seating, and there is tons of it. <br>+ Must try: Agave Latte.<br>+ Milk substitutions available: Soy milk<br><br>Keep it, fun place to hang/work!", "pics": null}}, {"review": {"des": "Friendly baristas, great ambiance and nice outdoor area to sit at on summer morning. I highly recommend it. The doughnuts are good too!", "pics": null}}, {"review": {"des": "Came here to get some work done with a bagel and coffee on a weekday morning. The sesame seed bagel was amazing and the (bottomless) Dark Matter coffee was too! Found a spot to sit on a very busy day, and started at it. For the level of focus I needed to have, the place was pretty loud (music and talking), but I loved the vibe. Strong \"neighborhood feel\" with local art on the walls and shelves displaying locally produced goods. I loved the back patio, though I was unable (unwilling) to sit outside on a 90 degree summer day. I will definitely be back to work on the patio!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/O_lCl7vi9nppbT00L1bBbQ/348s.jpg", "caption": "Bathroom door animation"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IoKfC8uIdqXq1YckHySAeQ/168s.jpg", "caption": "The bathroom decor!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/goTpeE7iLniQG32hV6FDng/168s.jpg", "caption": "Coffee & a bagel! Yum!"}]}}, {"review": {"des": "I stop in here at least once a week.<br>I'm busy doing my student teaching at a school just around the corner from Star Lounge so I like to come by to get some fresh air and a pick-me-up.<br>I always get a Cappuccino and every time it's good. If you don't like yours bitter though be sure you add in some sugar because the ones they make can really be that way. So because of that I'm always adding in maybe 3 Splenda. But besides that they're very tasty.<br>I also had one of their cinnamon roles and it was sooooooo good.", "pics": null}}, {"review": {"des": "This place makes the best lattes in the entire world. I have no idea how they do it. They even foam a little bit of milk for the top of your iced lattes.", "pics": null}}, {"review": {"des": "Checked out another dark matter shop in Chicago and yet again they don't disappoint! This converted bar has the hip vibe that you can expect from dark matter. There isn't a lot of traditional seating, so it's not the best place to sit and do work unless you don't mind sitting at the bar. Great experience!", "pics": null}}, {"review": {"des": "The coffee is good.  Very good, however,  everything else is hard to accept.  <br>This place is dirty.  Dirty doors to bathroom,  dirty walls,  crumbles on the floor next to the walls.  <br>Laud music.  Without noise reducing headphones I couldn't hear my thoughts.  <br>For the crew -  it looks like it's not working place but social networking place.  I would be OK with that if this coffee shop would be cleaner and the line would go faster.  <br>Once again -  great coffee,  lousy place.", "pics": null}}, {"review": {"des": "This place is great!  Good coffee, great deck, love that it's 2 levels.  Really wish they had more vegan options though.<br>The baristas are super friendly, love the feel of this place.", "pics": null}}, {"review": {"des": "I love Star Lounge. I really do. <br>If I want good tasting coffee, good espresso, or a bad ass tasting latte I come here. <br><br>The only problem is (and they reason why I am giving 4 stars) is because they almost NEVER get my order right. Luckily for them, everything is delicious and I am not super picky so It usually turns out ok- but DAMN if I'm not frustrated most of the time I go there. I sometimes feel like I might as well play \"barista roulette\" because I'd be less annoyed. <br><br>Also, the service tends to be quite slow. Which means I can't make this my morning coffee spot because I'm never sure if I will have enough time to get it and get out.<br><br>BUT if you want to hang out (there is a fun atmosphere), you aren't in a hurry, AND you like good tasting 'coffee' - this place is for you.", "pics": null}}, {"review": {"des": "I was looking for a coffee spot near Smith Park and saw that this place was only 2 minutes away. <br><br>The coffee was delicious and the staff was friendly. The seating was comfortable and there is an out door area.<br><br>It's a great place to get work done with plenty of outlets and nice, speedy wifi.", "pics": null}}, {"review": {"des": "Service, best coffee jawn service i have had in a looooong time. <br><br>They use Dark Matter here. Enough said there. <br><br>Best coffee ever? Yup. <br><br>I knew unicorns had to be involved.<br><a href=\"http://www.yelp.com/biz_photos/star-lounge-coffee-bar-chicago?select=eUieBGzCcSwbZP_lwuol6w#eUieBGzCcSwbZP_lwuol6w\">yelp.com/biz_photos/star…</a>", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/reWFNnPNoVtf-NpHYNKTeQ/168s.jpg", "caption": "perfect Iced Americanos"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eUieBGzCcSwbZP_lwuol6w/168s.jpg", "caption": "only the best espresso ever"}]}}, {"review": {"des": "because (1) their staff is friendly and patient with me as I decide on what to get, and they engage in conversation. (2) great musical vibes on the first floor. (3) great place to get work done. It's quiet upstairs (no music), so I can plug in a tackle my inbox. They also have a printer available for use, which comes in handy. (4) there is plenty of seating. And lastly (5) they're coffee is top-notch. From their cold brew coffee and loose leaf teas to their wake & bake espresso drink, I'm a fan. That is all.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Y1cuaXBhzDOsW_jFQnitcQ/348s.jpg", "caption": "Wake and bake (front) and iced coffee (back)"}]}}, {"review": {"des": "I'd been meaning to try this place for a while, having heard about it, but I hadn't gotten around to it and didn't know exactly where it was. So I was biking along Chicago about to pull out my phone to look for a coffee place when I looked up and saw a Dark Matter sign. It was positively providential. My go-to and meter stick is a latte. this one was decent, the coffee flavor was nice, but it was definitely milkier than other lattes ice had recently. Next time I'll try one of their concoctions. But I really liked the vibe, it was unique, and felt very westtown Chicago. there are some coffee places you could easily find anywhere, from LA to new York. This one not so much, imo.<br><br>You'll recognize the place by the mass of bikes parked outside. there's also a bunch of street parking around. There's lots of seating, including on a nice patio. The chairs out there look like uncomfortable iron things, but you sit down and it turns out they have some bounce, and are like rocking chairs. The spray painted walls and fences outside are great, and I could help but smile upon seeing them. There were a bunch of people waiting, but the barista was quick and it wasn't a long wait. They brew a bunch of their own blends fresh, and I'm looking forward to some home-brewed unicorn blood.", "pics": null}}, {"review": {"des": "I asked for a large latte, in two parts. I asked for both parts to be given right away because they were closing in 30 mins and the lady actually said 'it's like you're ripping us off' because we should have been ordering two lattes instead. What? And this was on thanksgiving day. It's sad, because I was just here a few days ago and rated this place 5 stars. I brought my gf here telling her this was the best cafe in West town but the poor customer service brought this down to 1 star. The lattes are still pretty darn good.", "pics": null}}, {"review": {"des": "I came in in the late afternoon and ordered and iced coffee per the other stellar reviews, as soon as the barista handed it to me I dropped my large iced coffee *shudders*. He didn't miss a beat, handed me a new one and was so sweet to make light of the situation and calm my red hot embarrassed face. I didn't catch the guys' names behind the counter but they were so sweet and kind. I sat upstairs by the window at a little table to read. I'll definitely be back to these guys!", "pics": null}}, {"review": {"des": "This is a hip little coffee shop located in-between the Ukrainian Village Humboldt Park area. <br><br>There is street parking pay as you go but you can find side street parking for free as well.  <br><br>This place was pretty busy for a Sunday morning.  They have a bar like area on the left with table seating on the right and in the front.  If you continue out and to the back they have outdoor lawn furniture like seating.  The place is really just a two flat that was repurposed into a coffee shop.  There is an upstairs that is quieter than the downstairs area.  You can get there by turning right as soon as you enter.  Up here there are high top tables and chairs for a slightly quieter atmosphere.  <br><br>Can't comment on the coffee or food items as I didn't try any.  I'm not a coffee person so I wouldn't know where to start even if I wanted to.", "pics": null}}, {"review": {"des": "Top notch.  That's right, this place does exactly what a coffee shop is supposed to do and does it well.  Fresh roasted beans, excellent pastries, quick service and pleasant staff.  Seriously well executed.  Pastries come from West Town Bakery and Do-Rite.  No sad faces here.  Free Wifi and plenty of seating both downstairs and upstairs.  Perfect for reading or doing some work from \"home\"!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GKaqcx8TuUczy0oZI7_r_A/348s.jpg", "caption": "Belly up to the bar!"}]}}, {"review": {"des": "The AMBIENCE<br>This is a really hip and trendy place. As you walk in everyone is talking and it's not crazy loud. There is an upstairs section but it's creepily quiet. I went up and it was packed yet not a single peep from a single person so I decided to find some room downstairs and hang out with a friend.<br><br>The FOOD.<br><br>DRINK<br>I had a bottle orange soda which is whatever.<br><br>EAT<br>I got a poppy seed muffin which tasted a little stale but it could be because we were here at 3 in the afternoon. There really wasn't much else to pick from besides a scone and one more thing. Just seemed like the place lacked selection. I also saw a menu for coffee but that was it - nothing freshly made besides the coffee and maybe that's their thing. No idea but the scone my friend got was ok - but nothing amazing or above average. <br><br>The SERVICE<br>We barely stood in line and the coffee was avail crazy quick! The girls working behind the counter were super chill and really nice to us and made the place feel inviting.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kkCakB7UWpUHF5GtqUpDpg/348s.jpg", "caption": "inside"}]}}, {"review": {"des": "While I'm not certain I'm in love with the coffee, I am in love with this space.<br><br>Star Lounge, seemingly, has taken a converted bar space in Ukie Village/Humboldt Park and turned it into a really awesome coffee shop. They carry doughnuts here - I believe the varieties are from Do-Rite downtown - and many other pastries and sandwiches. <br><br>The Wi-Fi here is fast and the space for doing work is plenty. As a law student, I am always looking for good coffee shops with places to spread my casebooks out and a good cup of coffee to keep me motivated. <br><br>Star Lounge even has a backyard for when it's warm out!<br><br>While I have not had the chance to have anything beyond the pour over or latte, the drip I've had here is a little off-putting. Dark Matter is known to have the best blends in the city, so I think I just need to have another variety next time!<br><br>Parking is tricky if you're coming from the east, but usually you can get a spot on Maplewood or Rockwell. The #66 bus stops right out front as well for anyone looking to get here via CTA!<br><br>This must be one of the best spaces I've seen across Chicago - so while my review doesn't give the coffee justice perhaps the space will convince you to make a visit!", "pics": null}}, {"review": {"des": "Comfortable place, great tasting coffee and specialty drinks (had a Gingerbread Trainwreck and it was amazing) and unlimited internet access. Staff is also very kind and helpful letting you check out the beans before you get a pour over and what not. Sure they'll describe the flavor, but it helps so much more to be able to judge by sense of smell.  The Dark Matter coffee that they serve is really fantastic. <br><br>I really like this place. Check it out if you are in the neighborhood. Prices are pretty reasonable too.", "pics": null}}, {"review": {"des": "I came here on a early afternoon day and I was shock that it was packed since it was a weekday. The inside doesn't have much tables so my friend and I had to wait awhile for a table. I ordered their matcha which was pretty decent. Their wifi is really fast unlike other cafes. It's a good studying place with nice atmosphere. However, I wish their place is bigger with more tables. They have more tables outside but that is for the summer.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kNTSM93dVfkwqjZQCJiq6Q/348s.jpg", "caption": "Mocha"}]}}, {"review": {"des": "Great vibe, great coffee. $3 unlimited coffee and quality coffee at that? Unbeatable. Friendly staff, interesting artwork, diverse music selection, and shirts and mugs for sale from local artists.", "pics": null}}, {"review": {"des": "Pros:  Great environment, nice flavored drinks.  <br><br>Cons:  Potentially weird service, most of the coffee tastes like slightly burnt blueberries.<br><br>I like coming here a few times a year when I'm feeling indulgent and want a Mayan Mocha.  Generally their 20 oz is served as two small drinks - I love this because you can space them out over the course of your time there.  For some reason, the last two times that I've been here they have just served it up in one large to-go cup, completely defeating the purpose of my ordering that size in the first place.<br><br>I've bought their beans a few times and wasn't incredibly impressed.  Still, it's a nice spot to go to when you want to mix it up.  If you want to sit around and sip on a frothy, sugary, spicy coffee drink then you could do a lot worse.", "pics": null}}, {"review": {"des": "Great coffee bar. Great. Go here. <br><br>You walk in, and you can tell people are happy. You can tell this place takes coffee seriously, and you will get your caffeine fix, and the wold will be a better place. The servers here are all knowledgeable, and super friendly and will definitely help you start your day off better. And their bagels and pastries and such are also pretty tasty too!<br><br>But with a fun, trendy, hipster like awesome coffee spot, comes a price tag. Coffees and pastries here definitely add up quite quickly, so just be prepared for that. Just because it isn't starbucks, doesn't mean you won't be paying starbucks prices. But, you will have a pretty fun environment, with lots of fun colors inside, they advertise local events in the area too which I appreciate. This is definitely one of those spots that if you live nearby you would go all the time, and if you are in the area, you may miss it, but you shouldn't, because their coffee is great.", "pics": null}}, {"review": {"des": "Favorite coffee in the city, hands down! I always bring out of towners to this hidden gem (although now dark matter is spreading like wildfire-both excited for them and sad to lose my little secret place)<br><br>You get fantastic and quality drinks here no matter what you order. Also for 2 bucks you get bottomless delicious coffee!!! Who can beat that! So bring your books, your board games and your friends to spend your afternoon surrounded by good people, graffiti and great coffee", "pics": null}}, {"review": {"des": "Come for the coffee. Stay for a long time. Huzzah!!!! My 100th review!!!<br><br>Star Lounge is one of my favorite coffee shops ever. It's a very nice looking shop that has two floors and a spacious patio. They have a rotating variety of coffee that will not disappoint. There are also permanent drinks on the menu that I love. Be sure to try the Wake & Bake and Gingersnap Trainwreck. Both of those will definitely change your life for the better. If you're looking for something to eat they've got it covered. They have some great sandwiches available. My favorite is the pastrami and swiss. The cake donuts go perfectly with the coffee. <br><br>The staff is very cool and friendly. They don't hesitate help you decide on what to get to drink or eat. Sometimes the music, while very good, can be very loud sometimes. However, there's a quiet upstairs area and a deck/patio out back. Even though they take credit cards you can't leave a tip on the card. That's the only downside of the place. Be sure to bring cash.<br><br>Lastly, one of my favorite things about this place is that you can get any tea you want iced or hot. I like this a lot because I'm a big iced tea fan. This might be only coffee shop I know that does something like that. Mix and match different flavors or do whatever makes you happy.", "pics": null}}, {"review": {"des": "Star Lounge has, hands-down, the best coffee in Chicago. I particularly love their specialty coffee drinks. Cortez the Thriller and Wake & Bake are absolutely wonderfully concoted, not overly sweet with subtle herbal notes. I also enjoyed their almond herbal tea. The staff are friendly and knowledgable as well, and are always patient with my various questions.<br><br>I love the patio area in the back, which is perfect now that the weather in Chicago is (finally!) getting warmer. However, after having taken my drinks to go on all other prior visits, I tried to spend the day here getting some work done and realized that I couldn't concentrate much with the loud music. This place may be better for casual dates or hang-outs with friends.", "pics": null}}, {"review": {"des": "Better than Starbucks! After finally trying Star Lounge I don't want any other coffee. My personal favorite is the agave latte!  So delicious and doesn't taste like burned coffee beans! I'm happy with my coffee every time I leave. They also have sort of like a rewards program where after you buy 10 coffees you get one for free. The place is usually very crowded but the baristas still find time to draw a cute leaf or heart and are always smiling and friendly.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vHMfVAxfClqinQRArIccOw/348s.jpg", "caption": "Perfect agave latte"}]}}, {"review": {"des": "FIVE STAR FOR PROUDLY SHOWING LIVERPOOL FC COLORS!<br><br>Coffee was pretty awesome too. Ordered a doppio. Got a Unicorn Blood (that's what they call it) ristretto. Super short, but super awesome. Thick and syrupy and oh so sweet.<br><br>Tons of seatings with a backyard as well. But I stood at the bar and slurped my espresso like a true gentleman. No sparkling water, but that's okay. I wanted to savor the taste of my coffee.<br><br>Staff were very friendly. Didn't shoo me away as I pretended to be looking at the bags of coffee beans while blocking the pastry display case.<br><br>For some reason, I decided to go to this location in the middle of nowhere (thanks Google Maps), but you know what? I'll definitely be back next time I'm in Chicago.<br><br>PS: Free coffee if you buy a bag of beans.", "pics": null}}, {"review": {"des": "Dark Matter is a great brand. The iced coffee is delicious and trippy to say the least. Combine that with a pastry and life is good. Staff are super helpful and the venue is one of those places where you end spending longer than you anticipated.", "pics": null}}, {"review": {"des": "Not a big coffee connoisseur so I wasn't really sure what to order. The female barista who helped me was very patient... and generous! I told her it was my first time here and she gave me my Cortado on the house. <br><br>Friendly staff<br>Delicious coffee<br>Good vibes<br>Chill tunes<br>Smooth atmosphere<br><br>Thanks for the pleasant experience, Star Lounge. I'll be back.", "pics": null}}, {"review": {"des": "Wanted to get out of the city to try something new last week, and Star Lounge was SO worth the trip.<br><br>Having worked in a few really special cafes, I'm very particular about my coffee. Ever since I got to Chicago, it has almost seemed safer to make my own brew than to buy -- so I've been scoping out new roasteries, buying their beans, and enjoying the atmosphere. I didn't try their brewed coffee in-house (already had a healthy caffeine buzz), but I did buy a bag of their \"A Love Supreme\" House Blend. I brew with Chemex, and for the past few days I've been really pleased with the taste and quality. The bean isn't over-roasted, and has a nice balanced flavor. <br><br>Star Lounge has an incredible feel. Very friendly baristas who seem like they know what they're doing -- and that's probably the most important part. The music was a bit loud, but I tend to like that in a cafe, so hey. <br><br>Only note is that they didn't have a ton of snacking options. But who am I to get picky, you come to a cafe for coffee. <br><br>tl;dr Loved the atmosphere, beans are well-roasted for home consumption, great place to relax and enjoy a great brew. Definitely going back.", "pics": null}}, {"review": {"des": "Yep, you're in the right place. This hip little coffee shop looks like they'd be serving up the other type of buzz, but if you need a caffeine fix me it's an awesome little place for a pick me up. <br><br>They've got some great signature lattes, the regular coffee is quite good, and they even sell 8lb bags to go if you're really into it. I highly recommend the Dolor De Oro which is espresso, steamed milk, honey, habanero, cinnamon, and chocolate. It's a tasty little treat with a spicy kick. <br><br>Although the bar style setup is cool it's not the most comfortable way to get some work done, so if the table tops are all taken you might want to grab something to go. Other than that the music, staff, and signature drinks make this a great place to get a cup of Joe.", "pics": null}}, {"review": {"des": "Love setting up shop upstairs at Star and working all day. It's really quiet upstairs and great for times when you need to get in some uninterrupted work time. It can be a little awkward to make phone calls or have any sort of conversation upstairs because it is so quiet.<br><br>The downstairs is so loud that you may want to cut your head off. I've been told that I am kind of like my 90-year-old grandma, but the downstairs makes me want to emerge into a hole and never return. <br><br>The coffee is great. Fun atmosphere. It is just too loud. My grandma would agree.", "pics": null}}, {"review": {"des": "Great coffee!  <br><br>Star Lounge is the opposite of Intelligentsia when it comes to looks. <br><br>The patchouli smell was a little overpowering as I entered the place, but I actually expected that due to the location and the storefront.  This is absolutely a hipster mecca, so if you show up in a suit looking to buy a little Unicorn Blood, you might feel a little out of place.  But don't be shallow, the coffee is excellent, the guys working the coffee bar are very knowledgeable, and the atmosphere is very relaxed.  <br><br>I'm not sure I'd trek over here regularly to get coffee since I live near a good coffee shop (Starbucks does not constitute good coffee), but if I was a Humboldt Park resident I'd be here daily (time and weather permitting).  I will however on occasion ride my bike there for a change of scenery, or to pick up that bag of freshly ground Unicorn Blood.<br><br>Lastly, if you are a coffee aficionado, due come here.  This is ground zero for Dark Matter.  These guys do it right.  You won't have any life changing experiences, but you do need to check this place of your list when discussing Java in Chicago.<br><br>The neighborhood is lucky to have this place.", "pics": null}}]}