{"name": "staropolska-restaurant-chicago-3", "reviews": [{"review": {"des": "Absolutely delicious. Ate my actual weight in food. Potato and cheese pierogis were moist and the dough was delicious. We passed around the golabki , beef stroganoff and chicken devolay. Chicken was seasoned well, moist, and full of flavor. Golabki was unbelievable (never made anything that good at home). Beef stronanof was rich and flavored with dill with these amazing dumplings that were spongy and complimented perfectly. Service was fantastic. Nice quiet atmosphere . Will be back :)<br><br>Also the chicken soup with Lithuanian dumplings was an unexpected star.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FjkWYRQDZLoMEL3N5BSRVw/348s.jpg", "caption": "Chicken Soup with Lithuanian Dumplings"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0WBlHOjJJeo3r5ACwueH9w/168s.jpg", "caption": "Beef Stroganoff"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gOiiCmPoHLn6VTxZui7LTA/168s.jpg", "caption": "Golabki"}]}}, {"review": {"des": "Alright, so this review is based off of a delivery and not actually dining in. With that said, WOW, how delicious! <br><br>I had had this place bookmarked for a while, as although I grew up hanging out by the 6 corners and Logan Square (used to have a very big polish community), I never actually tried any Polish food growing up. I figured it would be good, but I was blown away with the very first bite! <br><br>I ordered the Polish Plate, beet soup in a cup, the cabbage and carrots salad and stuffed cheese pierogis. <br><br>Polish Plate: The 2 pierogis were amazing, especially the mushroom and cabbage one. Without the Polish plate, I would of never have thought to get this, since I'm not a big fan of mushrooms, but it was absolutely divine - better than the meat. The stuffed cabbage came in an amazing gravy and was to die for. The sausage was great! The potato pancakes are like latke,but bigger and softer. The last item I was not a fan of-it was kind of dry-BUT I assume at the restaurant it would be different, as it would be mixed in with the gravy. They give you an option to get a side with the Polish plate and I got the cabbage and carrot salad. It's like cole slaw. <br><br>Beet soup: very good...similar to borsch. <br><br>Cheese pierogis: They came warm, but as I was eating the huge Polish plate, I left these for later so they got cold. Definitely taste better warm, so keep that in mind! <br><br>All in all, I will definitely try more things from here and dine-in at the restaurant.", "pics": null}}, {"review": {"des": "I've ordered from here before on Grubhub. The owner kindly brought me my food instead of making me wait because when I ordered I did not realize how close it was to my house. I was rather embarrassed. The food was great and about a month later, I decided to order take out. The women kindly took my order and told me it'd be ready in 10 minutes. 15 minutes later I pull up and the restaurant is completely empty and the women at the desk appears confused about my take out order.<br><br>After making me wait, she explains they gave my order to someone else and it'd be ready in a few minutes. I was tired and frustrated as to how you give away a pierogi order but I continued to pay meter and wait.<br><br>The part that pissed me off was the hostess. She was not the women who took my order. But she essentially scolded me for them messing up my order. A business with all but one patron in the restaurant and I'm being treated me like a kid because I placed a telephone order and was told next time I need to order online from Grubhub. Funny thing is, same women told me \"the manager\" took my order and if ordering over the phone was a problem, wouldn't she have told me then?<br><br>Good way to mess up the reputation of a place that has good food, but a bitchy ass hostess.", "pics": null}}, {"review": {"des": "After a great event at St Hyacinth Basilica, Concert for Peace, we set an appointment earlier to enjoy a great meal, unfortunately, many did as well. Restaurant was short staffed and overwhelmed with patrons. Took 30 minutes before our waitresses, Svetlana was able to assist.  Not her fault. but definitely overwhelmed. We ordered our drinks of:  Polish Martinis, Sodas & Iced Tea's.  Placed our orders immediately.  Devolo's, Zuchini pancakes with Chicken, Plum Sauce with Duck Breast, Vienna Schnitzel, and Beef roll ups.  Meals were good, just felt sorry for the waitstaff working more than tegu needed to.  Svetlana, afterwards, apologized for disappointing us, but I felt she was a true champ.  Looking forward to coming back without a huge crowd. Cheers!", "pics": null}}, {"review": {"des": "I have been wanting to try Polish cuisine for a while and couldn't pass up the opportunity to stop here when we were in town. Staff was friendly and attentive. My husband tried the sausage special and I got the vegetarian sample plate, which included spinach pierogis, zucchini pancakes, mushroom/rice cabbage rolls, potato dumplings, etc. Most of the items on my plate were delicious, especially the pierogis. I was very underwhelmed by the vegetarian cabbage rolls though; they were quite bland and in desperate need of some seasoning or sauce. Otherwise, it was a great experience; we will be back!", "pics": null}}, {"review": {"des": "It was my first time and on the recommendation of a friend. I was mad craving on some pierogies. I couldn't wait. So, a couple friends and I made out way out here to get some, from what I've heard, amazing Polish food.<br><br>The service was great. It was a Thursday night; it wasn't too busy, which was kind of nice. There's a bar right when you walk in but then tables and booths further back. There's a second room that looks like its for really big parties and events. <br><br>We got a couple beers to start and then it was onto the food. We started with meat pierogies. Of course we got bacon on top. It also came with a side of delicious cream cheese. An order comes with 10...and so worth it.<br><br>The rest of the food:<br>Polish Plate - (pierogies, stuffed cabbage and sausage with pasztecik, sauerkraut) the pierogies are the mushroom variety (still so good), stuffed cabbage was awesome, the sausage was also sooo good, sauerkraut was delicious (and I don't even like sauerkraut, but i would eat this all the time) basically a worth-it plate of Polish specialties<br>Staropolska - (beef stew, pepper, potato pancakes) basically a beef stew sandwich with potato pancake as bread. Comes with a side of beet salad, which is very non-dirt tasting and sooo good<br><br>TLDR: definitely get yourself here for an amazing Polish cuisine experience. The pierogies are a definite must. The Polish Plate and the Staropolska are a great introduction to Polish food.", "pics": null}}, {"review": {"des": "Great place food great staff excellent beautiful place I wood recommend this place to everyone", "pics": null}}, {"review": {"des": "Came here on a Polish holiday so naturally very busy. They seated the 6 of us, gave us 1 menu, and we sat for about an hour without even any water. I understand it's busy however.. a restaurant should never seat people it is unable to serve. They didn't even give us a warning or estimated wait time, so we just sat there starving (we had not eaten all day and it was 4pm). Tried to get a drink at the bar and was still not served. Huge waste of time", "pics": null}}, {"review": {"des": "Today was my first time trying Staropolska.   The food was so delicious.    The server was very attentive even though she was very busy.   I will be returning soon.", "pics": null}}, {"review": {"des": "Finally getting around to writing this review! <br><br>After a disappointing endeavor at the World's Dumpling Fest, my boyfriend, his parents and I were in need of a pierogi fix. My boyfriend's mom has been wanting to try Staropolska, so the fact that the Dumpling Fest was an epic fail, this restaurant was a perfect choice. The restaurant is decorated beautifully with an old world flair. Dimly lit with a casual ambiance. When we entered, we were warmly greeted and seated promptly. <br><br>While we looked at our menus, the waitress brought over a plate of chicken pâté, sliced rye bread and butter. Spreading both the pâté and butter on the bread was delicious. We all enjoyed the pâté, especially my boyfriend's dad. They had an assortment of Polish beers, which my boyfriend and his dad ordered. Not sure on the brands of beers- sorry, it's been awhile. I ordered the Polish martini, it was sweet and strong at the same time. Since we barely ate dumplings at the Fest, we were determined to order some pierogis. We ordered the sauerkraut and mushroom pierogi. So delicious and authentic! They also have strawberry or blueberry filled ones, that I hope to try on my visit back. As for the entrees, I ordered the stuffed cabbage with rice and meat. Wow, loved every bite of it. My boyfriend's mom ordered the stuffed cabbage with rice and mushrooms and she also took pleasure in the dish. My boyfriend ordered from the \"Dinner Specials\" menu, the veal meatballs with potato dumplings. I tried some of his meal, and it was also delicious. I don't recall what my boyfriend's father ordered but I do remember only compliments about the feast. We were all thoroughly satisfied and talked about coming back in the future.", "pics": null}}, {"review": {"des": "Read my bio & I'll set the stage for this post.<br><br>Had to work this Saturday.<br>Definitely not planned.<br>Sporadic timing coming here.<br>Wasn't my idea.<br>Wasn't even hungry.<br>#suckeredintogoing. <br><br>We came in mid evening and sat at the bar as a couple of tables were drinking while being patient to be sat in the dinning room.<br><br>So we squeezed in at the bar and that's when the hospitality started to drench us... Ohhh Anna!<br><br>She was tonight light keeper. She sampled us all 3 draft beers, and because of that I currently have a new favorite beer. ZYWIEC. Wowzers. <br>We each had 3. <br><br>Before we even spoke of food she had bread and butter sitting in front of us. That timing is something you don't often find anymore. <br><br>We chit chatted laughed and made light of current news and the night set sail.<br><br>We had this entree influenced sampler and it absolutely made me hungry all over again.<br><br>Anna, we salute you & thank you.<br>The night was well server bc of you.", "pics": null}}, {"review": {"des": "What a fantastic find! I am a huge pirogi fan, and have only been able to get them in cultural festivals or my local Oktoberfest. When we stumbled upon this place, I was hopeful based on the reviews.<br><br>We started with the potato pancake and a plate of mixed pirogi. Man was it delicious! I loved it all that we were cleaning off these plates before our main meal arrived. We had the schnitzel and pork chop, which were both amazing as well. After our apps, we had to pack most of our entree up. <br><br>The service was fantastic! Our waitress was friendly and very happy to help us with the menu. It was her recommendation that we get the mixed pirogi plate to get a taste of everything. The restaurant is very clean and super cute!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OdEqOtebrqxtWsj7ZFpDhQ/168s.jpg", "caption": "Mixed pirogis"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gqmpLv1kgDPn0cSGllTMWg/168s.jpg", "caption": "Potato pancake"}]}}, {"review": {"des": "What a fantastic find! As somebody from Eastern Europe, authentic polish is hard to find. But Staropolska delivers. I highly recommend this restaurant. Off the beaten path in Chicago ( about 15 minutes by car from Magnificent mile) this gem is worth the trip. The flavors, the service and the atmosphere took me to Warsaw immediately. I had beer soup with Lithuanian dumplings (so yummy) and stuffed cabbage ( just like my mom used to make when I was little) . Five stars all the way.", "pics": null}}, {"review": {"des": "On my last trip to Chicago, I wanted pierogis and I was on the hunt for 'the best' in town. I think I found them, along with the best of everything else Polish. <br><br>The place itself was super cute. Very rustic and old feeling. They staff, especially our server (I think her name was Molly), were exceptional. The Polish beers were cold and refreshing. My friends and I couldn't decide what to get so we got the Family Dinner, which is a little bit of everything. Seriously, everything. <br><br>Potato Pancakes with apple sauce and sour<br>Soup Of Your Choice (I opted for borscht, which cost extra)<br>Assorted Salads <br>breaded chicken breast, stuffed with parsley and cheese butter<br>Sausage with sauerkraut<br>Beef Strogonof <br>Mashed Potatoes<br>Pierogi (we got an assortment of all kinds)<br>Blintzes<br><br>We had to rolly-polly ourselves out of there and ended up taking half of everything home because it was overkill. I would 110% absolutely go back when I visit Chicago again next time. This place is definitely worth checking out!", "pics": null}}, {"review": {"des": "We had a remarkable dinner here with friends.  The place is casual and has a family-run feel. Service was good, with a very friendly and pleasant server. But the star of the evening was the food. <br><br>The Devolay (breaded chicken breast stuffed with parsley, cheese and butter) was tender, juicy and very tasty. The Pierogis were rich, delicious and quite a lot of food for the price. My friends were very pleased with their potato dumplings. <br><br>Clean, welcoming restaurant with some recommendable Polish specialties.", "pics": null}}, {"review": {"des": "I'm here seated right now writing this review as I wait for my dessert. This is my first time here and so both the Polish sausage entree and the vegetarian platter looked appetizing so I asked my server for her advice and she suggested the vegetarian platter with a tiny piece of Polish sausage to the side. My vegetarian platter was so tasty and filling that I'm taking a third of it home for tomorrow's lunch. The platter consists of cabbage stuffed with mushrooms, pierogis... pancakes with zucchini and cheese, potato dumplings and a portion of brocolli with grilled red peppers. My sausage was spicy and juicy so I'm very pleased with my selection and here I am now literally biting into a slice of rich and fulfilling chocolate cake so I will be returning again and trying something new. This restaurant is located in Logan square and the atmosphere is very cozy. I'm so happy to have found this authentic Polish restaurant!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_Ki1J0VoBH6DnwVWiPRZZQ/348s.jpg", "caption": "Sumptuous vegetarian platter...I've got leftovers!"}]}}, {"review": {"des": "Excellent! I have to say this is the best Polish food I've had in Chicago next to my mother-in-law's. She is from Poland and I have not had any Polish food from a restaurant as good as hers. It tastes fresh and homemade. The mushroom soup was just like her recipe, which is one of my favorites! I started with the soup then had the golabki, which is stuffed cabbage with meat. It comes with mashed potatoes and your choice of salad. I had the cucumber salad with sour cream. We also ordered a plate of the potato and cheese pierogi. Delicious! Everything I ordered was so good! The prices are very reasonable and you get so much food. They also have a good selection of drinks including various beer, wine, and cocktails. The place is really nice inside and there is also a separate banquet room that looks very elegant for private parties. I will definitely come back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZIZ2wyh6WHdNFDy-_GukjQ/168s.jpg", "caption": "Golabki and mashed potatoes"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Xszt-S6iuM4j26MSLQ8RtQ/168s.jpg", "caption": "Pierogi with potato and cheese"}]}}, {"review": {"des": "The best food I have had in Chicago during our 7 days stay<br><br>Authentic Polish food like my grandma used to cook. Very professional and pleasant service.<br>I forgot my credit card and called them 3 days later. They offered ( not being asked for it) to send it to my address in California.<br>I would love to come back to Chicago and sample their other dishes. Thank you", "pics": null}}, {"review": {"des": "Wow! Just wow! Delicious polish food, really friendly staff, and clean and nicely decorated environment. Came with a group of 7 of my coworkers and tried almost all of the soups (really really good) and did the family meal which gave us family style bowls of some of the best of their food. I cannot wait to come back with my family soon!!", "pics": null}}, {"review": {"des": "Third visit Thursday night. One waitress with 10 tables plus the bar. She did a fantastic job. Management needs to do a better job with staffing. The potato pancakes, chicken tenderloin cutlet with blueberry sauce, and plum blintzes were excellent! Kudos to the overworked and understaffed waitress.", "pics": null}}, {"review": {"des": "My extended family has been coming here from the VERY FIRST day they opened in 1984 and has dragged almost everyone we know into Staropolska.  My children, nieces, and nephews were so young when we first brought them here that they could not say Staropolska and we had to call it 3030 for them.  When we moved out of town we made special trips back to Chicago and told people it was to visit family when actually we wanted a Polish plate. When my daughter brought her new husband to Chicago she took him two places - \"3030\" and Gene's and Jude's! Well, sad to say we will not be returning.  Why would we do this?  We have ordered almost everything on the menu in the last 34 years BUT the Polish Plate was the favorite of most of us.  The perfect combination of tastes and treats.  First (years ago) they cut out the soup it used to come with and now they have taken it off the menu.  We have actually had a discussion about the matter with the entire family - Aunts, Uncles, cousins, immediate family, nieces and nephews (most of whom still live in Chicago).  We have decided we really don't want to patronize a place that would make such a poor decision.  Almost everyone we know says the Polish Plate is their favorite and they will not be coming back either.  Come on, Staropolska!  Yes, we would expect the price to rise once to be raised every few years but to take a customer favorite off the menu all together is rather a strange decision.  Wave me on my way to my search for a new Polish restaurant........which one would you (the staff at Staropolska) recommend?", "pics": null}}, {"review": {"des": "Delicious, authentic, with great customer service. Tatar was to die for and schabowy was just like my mom used to make. The only thing missing was dark bread.", "pics": null}}, {"review": {"des": "Ever since moving to the south side I have yet to find a good polish restaurant. This place is best polish food hands down, the veal cutlet and mushroom soup always hits the spot!", "pics": null}}, {"review": {"des": "I love, love, LOVE this place. I had strep throat for a weekend, which was the absolute worst, but the only good part was discovering this place and ordering lunch and dinner 3 days in a row. <br><br>I got the chicken and dumplings soup with some really good sourdough bread all three days. It was SOOOO GOOOOD. <br><br>On my last day of being sick I treated myself and got the beef stroganoff. It's not the stroganoff I'm used to but holy Moley it was so tasty!<br><br>I'll definitely order from them again and again!", "pics": null}}, {"review": {"des": "I was in town on business. I scoped out some local places to try and this was a great find. I have heard some awful things about Chicago so I was weary about going anywhere. This place is in what appeared to be a safe area. It was easy to find and walk to from the blue line. I went on a Saturday around 6pm. The place was surprisingly not crowded. The interior is not only nicely decorated, but it is cozy. I sat at the bar was greeted by a friendly bartender. There were locals coming in and out the whole time I was there. Everyone inside speaks Polish which is actually kinda nice.<br><br>I was given some slices of bread and butter while I decided what I wanted. I ordered pierogies (potato and cheese) and the beef stroganoff. The pierogies were very good. The balance of cheese with potato was perfect. The beef stroganoff was very well seasoned. The potatoes in the dish were fantastic. <br><br>The prices were very reasonable. I was in and out and felt welcomed and never rushed. I was asked several times if I was OK and if I needed anything. Its a great place to have a good Polish dinner.", "pics": null}}, {"review": {"des": "My uncle was in town and we were looking for an authentic Polish Restaurant. This satisfied everyone from young (10 year old) to old. Great prices and awesome food off the beaten track in a family friendly comfortable atmosphere. Have vodka and some herring while you decide what to eat. Relax and enjoy yourself. I'll be back.", "pics": null}}, {"review": {"des": "We had family dinner which is sampler of signature polish dishes. It brought me back to my childhood. Wonderful experience.", "pics": null}}, {"review": {"des": "My bud and I dined at Staropolska on Milwaukee Avenue awhile back.  Since I was chowing down with my Polish pal, I figured we would be in for an authentic Polish dining experience.  The interior has the feel of a Polish lodge (not that I have ever been inside a Polish lodge) with assorted artifacts displayed on brick walls.  One of the adjacent rooms looks like a very elegant banquet hall, but I am sure that is saved for special events.<br><br>We each got off to a good start with a Polish beer, and the complimentary basket of bread and butter.  I ordered the Polish plate, a combination platter which had potato pancake, pierogi, stuffed cabbage roll, sausage, sauerkraut, and something called pasztecik which was like a stuffed meat and dough pastry.  It was all hearty and tasty and filling.  My bud had a bowl of chicken noodle soup, and a stuffed cabbage plate with meat and rice, and mashed potatoes.   No complaints from him either.  We both passed up dessert because we were too full to enjoy it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9g3t_ovXpmFUCkYTDAwdcw/348s.jpg", "caption": "Polish plate and beer"}]}}, {"review": {"des": "What an experience! I used to live in Chicago and have taken a few friends for great Polish food there. Usually getting a sampler or the family dinner special. So good.", "pics": null}}, {"review": {"des": "My favorite Polish restaurant in Chicago! They serve the best żurek (rye soup) I have ever had abroad, and probably better than some I had while visiting Poland. Their potato dumplings are authentic and delicious, same as zucchini pancakes (served with goat cheese -   great combination!) and stuffed cabbage, while beef stroganoff is very well spiced. I am not a huge fan of their crepes, portion seem to small for the price, but they were pretty tasty too. I usually order delivery, food is always on time and I was never disappointed with the quality or had a missing/wrong order. If you have craving for some Polish delicacies, Staropolska is a great place to get them.", "pics": null}}, {"review": {"des": "OMG, food was super tasty!! Super delicious!!! This was my first time eating Polish food but thanks to my husband (which he eaten polish food before) I went for it and can't complain!!! We had the beef stroganoff and the plerogles  Definitely will order again and again!", "pics": null}}, {"review": {"des": "Three of us had a variety of dishes.  I had the stuffed cabbage.  All of us were happy and surprised with our food.  Somehow they manage to lighten these traditional dishes while keeping the original flavors.  You can eat the two stuffed cabbages without being stuffed.<br>Service was friendly, but they do push for table turns.  Felt a little hurried.<br>Only one Polish beer on draft and some bottles out of stock.  Place was busy, so there's no excuse.  Will be back.", "pics": null}}, {"review": {"des": "This place is truly amazing. I had tried some Polish food in the past, but it was not nearly as outstanding as the food here. We came in for lunch and were lucky enough to get a table. The staff was very nice and the service was great. <br><br>I wanted to try so many items on their menu, but had to settle with one option. Fortunately, it was a great option. They had two types of samplers with standard Polish staples, such as the meal for 2 and the Polish plate. We ended up going for the meal for 2, which was delicious and could actually be shared among 3-4 people. <br><br>Every item on it was amazing, from the bacon-wrapped plums to the potato dumplings to the pierogis to the hungarian pancakes topped with beef stew and chicken with creamy spinach sauce, not to mention the delicious crispy chicken rolls (sorry, I don't remember what they're called). I wished golabki also came with the meal for 2, but halfway through the meal, I was so stuffed that I just accepted the fact that it was okay that golabki was not included on the plate because if there was any more food on the plate, it would probably go to waste. <br><br>I was also sad to forego dessert (I was eyeing the sweet cheese blintzes), but alas, there was not enough room for those either. Overall, great experience. They have coffee and Polish beers, as well as a wonderful atmosphere. I will definitely come back and try the other menu items next time I'm in town.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pFqh5S0ycTu0LtxOYfoWag/348s.jpg", "caption": "Meal for 2"}]}}, {"review": {"des": "Staropolska brings a great vibe, authentic polish food and quick service. A friend of mine invited me here for the first time and of course I wanted to try everything but I got the Crepes with sweet cheese and potatoes dumplings and upon arriving to the table within 10 minutes both were gone in 5. I think I'm going to go back today to try something else. This is a must try if you like polish food!", "pics": null}}, {"review": {"des": "Came here with my mom as we visited Jackowo for a trip down memory lane. This restaurant has been a staple in the area for years.  We stopped in around lunchtime and it wasn't crowded at all. The waitress was extremely friendly and the food was good. We both had a plate of pierogi and they were tasty.  The pierogi had thin dough and ample filling.  If you are in the area, it's definitely worth a stop.", "pics": null}}, {"review": {"des": "The wife and I grabbed dinner on a Saturday night. We arrived at 8pm and the restaurant wasn't very busy yet. The service initially was pleasant and prompt.<br><br>The food:<br><br>We had the potato & cheese pierogi's to share. These were very good. The wife had the Chicken Devolay, which she really enjoyed. I had the Staropolska, which was fantastic! For dessert we shared kolaczkis and blintzes with plum butter. The kolaczkis were the better option for my tastes. Overall, the food quality is quite high and very reasonably priced. <br><br>Just as we got our meals, the restaurant filled up. From this point forward the service suffered greatly. The two servers were running hard taking care of multiple large groups and it just made it difficult to stay on top of our little two top. We had to flag our server down to order dessert and again to pay. I really do not fault the server. She simply had too much going on for one person. <br><br>Overall, great spot. We will definitely return.", "pics": null}}, {"review": {"des": "The food was amazing. We had the potato pancakes, pierogis, beef stroganoff and polish sausage with onion. I didn't take pics but presentation was appealing. Very impressed. Will return for the liver and onions.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rnT6oSUxeXYil-m4rKr13w/348s.jpg", "caption": "Tea with thyme"}]}}, {"review": {"des": "Much classier than I remember from years ago, the food is just as good only a little more expensive.  I do like the fact that then as now, the staff speak Polish, they are Polish, this is a really Polish place.  I like that the decor, the space has much more polish, if you will, than in the past, but it's not the bargain it once was.  Still prices are quite reasonable, I highly recommend the pirogi.  Service is a little wanting, had to hunt down our waitress a couple of times, once for sour cream (come on!), and this was a little ironic as the decor is supposed to be Polish hunting lodge.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rqG8danjDaK5DVcaJPamZg/348s.jpg", "caption": "It's much classier than I remember"}]}}, {"review": {"des": "Excellent service and very good food. The staff was welcoming and engaging and all of the wait staff stopped by our table and talked for a few minutes. I had a huge veal schnitzel with whipped potatoes and sauerkraut with a Polish beer. All very good.", "pics": null}}, {"review": {"des": "Our Polish sister-in-law and nieces are in Chicago visiting us, and whenever they're here, they enjoy trying our Polish restaurants, with Chicago having such a huge Polish population. My husband knew of this place and from the time we walked in, we knew we would like it. The decor is very different; reminiscent of medieval, and we were seated at a large, wooden table to peruse the menus. Sis made several recommendations and we placed a rather large order, to be able to try a variety of dishes. <br><br>Our nieces went crazy over the steak tartare! Hubby loved the mushrooms! We all enjoyed the appetizer platter of meats, olives, and cheeses! And the hearty, healthy chicken soup!!<br><br>I won't even try to rename the actual dishes, yet I can say that everything we had, continuing with the three side salads of cucumbers, beets, and Polish cole slaw, to the entrees of veal, chicken cutlets and the combination platter that we shared...were all delicious! We particularly liked the pierogies, the potato pancakes that were served under chicken breasts covered in spinach, the beef slices in a savory sauce, and the stuffed chicken breast (\"Devolay\") which kind of reminded me of chicken kiev...chicken breast stuffed with parsley, cheese and butter...and the stuffed cabbage! Rice and meat! Yum!! It was all excellent! The fish dishes sounded good, too; we just didn't have room! (Polish people love sweets but we couldn't even think about desserts this trip!)<br><br>Even the Polish beer was delicious and refreshing! It was hard not to overeat. Our server was pleasant, throughout, cheerfully accommodated our every need and request, and I know sis enjoyed chatting with her in Polish. It was a lovely dinner, and hubby, our daughter and I will definitely be back...even without our translator!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iJLihhfiKIi1oAmAEhRHPw/348s.jpg", "caption": "The bar"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0MkCYovCyy9QGIv67NsmTA/168s.jpg", "caption": "The front"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nw9Xmxw6HqX49WBYyHPfAA/168s.jpg", "caption": "Our combination platter to share"}]}}, {"review": {"des": "This is for delivery through Yelp. I love, love, LOVE Polish Food and especially Polish buffets. Home on doctor's orders, I developed a hunger that couldn't be denied. Got the combo platter and sausage, saurkraut & mashed potatoes. Quick delivery (in horrible weather, you guys were saints - definitely used the Yelp app to leave you a great tip). Food was hot & fresh. I'm devouring it as we speak. THANK YOU, POLISH FOOD GODS!", "pics": null}}, {"review": {"des": "Very authentic.  Friendly, helpful wait staff.  Made a reservation which wasn't necessarily needed at the time we went.  Food was delicious and appealing.", "pics": null}}, {"review": {"des": "Lots of tasty choices, good beer, good ambience and a great place to visit. I had a combo plate, it was great with a Polish beer. Looking forward to another visit.", "pics": null}}, {"review": {"des": "My family and I loved Staropolska! The waitress was attentive and seemed like she really cared about our experience. The food was amazing. Perogies, stuffed cabbage, soup, etc. was all amazing and very flavorful. The atmosphere was also very warm and cozy on a chilly night. I will be back!", "pics": null}}, {"review": {"des": "I came into Staropolska because I was missing the delicious and hearty Polish food I had had months earlier in Warsaw. I'm glad I did.<br><br>My friend and I were greeted by a dim room filled with dark woods, brick, and furs hanging from the walls. I immediately felt like I was in a warm cabin kitchen somewhere not in the middle of Chicago.<br><br>The server was an actual Polish woman with a thick accent. Her English was great, and it was fun to practice what little Polish sayings I knew with her.<br><br>The offerings were very similar to the Polish casual restaurants I found in Poland. Staples like pierogi, borscht, sausages, and savory pancakes filled the menu. They also had żurek, or sour rye soup, which is something I absolutely adore about Polish food but can't find anywhere stateside. Everything tastes phenomenal and exactly how I remembered it in Poland. <br><br>I wish I lived in Chicago solely so I could eat here more often.", "pics": null}}, {"review": {"des": "Friendly staff, cool vibe, fair prices, great polish beer options last and definitely not least, absolutely delicious food! Try a little but of everything and you won't be disappointed.", "pics": null}}, {"review": {"des": "This is my favorite Polish restaurant in Chicago. Anytime any of my Polish family comes into town, I take them here and they all love it. Great food and great service.", "pics": null}}, {"review": {"des": "Tasty, filling, Polish peasant food, albeit not necessarily at peasant prices.  :)<br><br>This is where you go when you're not concerned about calories but want serious, hearty, central European dishes to soothe your soul.<br><br>Wonderful presentation.<br>Terrific ambience.<br>Good service.", "pics": null}}, {"review": {"des": "The service here is wonderful. Everyone is so nice and quick. The Lithuanian soup is so tasty. I'm a huge salt lover and usually have to add to a broth based soup but this soup is perfectly seasoned. The platter for two is the perfect group of food and a prefect amount for two. The dumpling balls are melt in your mouth amazing. The pork chops (I never order pork it's normally my least favorite) with cranberry sauce so freaking good. I love the decor and ambiance as well.", "pics": null}}, {"review": {"des": "One of the best dinners I've had in Chicago. I've lived in the area for over 15 years and tried countless restaurants. This one is definitely in the top 5 in the city. I had the zucchini pancakes and sauerkraut and it was delightful. The waitresses are extremely nice and the decor is lovely. Would recommend to anyone!", "pics": null}}, {"review": {"des": "What a wonderful surprise.  The neighborhood is a little sketchy as you approach but inside it is a wonderful place.  The food was delicious and the service was great!  We had everything from pirogues to sausages to pork tenderloin in gravy.  We will go back!", "pics": null}}, {"review": {"des": "This place is fantastic! The food tastes like my grandmothers growing up which is why I've been there three times in the last week. The spinach pierogis, breaded chicken cutlet, breaded pork cutlet, beef stroganoff and potato pancakes are all highly recommended. Sylvia, the waitress/bartender/possible cook(?) is one of the hardest working people in the business. Make sure to give her a little extra, she definitely deserves it!", "pics": null}}, {"review": {"des": "Family gatherings are an excuse to pig out and try different cuisines. <br><br>Tis our family's belated mother's day celebration and we pinpointed this sweet Polish location. For such inexpensive prices, portions were insanely generous. Our party of us went all out with appetizers, entrees, and dessert! <br><br>For the hot appetizers, we had the breaded camembert cheese with pineapple and cranberry sauce and the stuffed mushrooms with prosciutto. The cheese was melted and very soft, but it had an odd aroma to it. The stuffed mushrooms were pleasant but I wouldn't know there's prosciutto in them if they weren't stated on the menu.<br><br>As for entrees, we tried a wide variety: vegetarian platter, beef stragonoff, veal cutlet, white fish, Vienna cutlet, and Swiss cutlet. It was a lot of meat and carbs. I had the Swiss cutlet with a side of potato dumplings. The cutlet was well fried but not as crisp as I would have liked it. The potato dumplings were quite new to me. It came in little white balls and the texture was very sticky on the outside. The inside was very compressed mashed potato. A few of these and you would be too stuffed to proceed with the meal. I gave the veal cutlet a try as well and I would probably order that on my second visit. It isn't as heavy as the cutlet and I liked the mushrooms they served with the entree. <br><br>In hindsight, I realized I should have taken dessert elsewhere. We tried the cheesecake and blintzes with cheese. We're obviously dairy fans and lactose-tolerant. The cheesecake was very crumbly and each fork would send chunks tumbling onto the plate. It came with a slice of pineapple and I thought the flavors were misfitting. The blintzes were served warm but it was heavily filled with cold cheese. I'm not certain if that's how it is supposed to be served. <br><br>All in all, it was a heavy meal and perhaps more suitable for a cold, wintery day. Service was a bit unattentive as they had a big party in their other dining hall. But the overall dinner was pleasant and interesting.", "pics": null}}, {"review": {"des": "I can't believe how disappointed my family is right now after dining here for a Monday 1pm lunch.  It was tough to decide between a Red Apple and the Polish restaurant with the highest Yelp rating in Chicago...but Staropolska won out since we didn't have to pay in cash.  <br><br>After freezing for over an hour on hardwood chairs as our food reached refrigerator temperature faster than we could eat it, each of us tried (but failed) to find more than bad in this experience.  <br><br>First of all, there were only 3 other seated during our entire visit and yet it seemed like our waitress was bothered by our presence.  She spent more time doing things in the back of house between rushed visits to our table and consequently our meal had terrible flow.  <br><br>When we were still deciding on our entrees, I asked her to get our soup order in so things could get started.  10 minutes later, we had figured out the full order and still had no soup.  It finally came out and we had enough time to finish it before the cold salads arrived, but we barely plated those up when she brought 3/6 entrees to the table.  The few minutes that passed waiting for the other 3 entrees made everyone anxious because of how fast the first 3 were cooling off.  It was very inconsiderate.  <br><br>Then, getting into the food was difficult because the pork cutlet as well as the chicken stuffed between zucchini pancakes were both overcooked.  Our flatware only included a butter knife which couldn't even spread the damn butter that was still rock hard after an hour on our ice block...I mean...table.  When I asked the waitress for a steak knife to cut through my veal cutlet, she went back to the kitchen area and started stacking plates for a couple minutes before realizing I was staring at her in disbelief.  WTAF?!?<br><br>Some of the food was actually excellent, but not everything.  Certainly not enough to justify coming back or even to make the hour drive back home any less shameful for the ass who picked this place.  <br><br>5 star restaurants don't hibernate, and paying customers shouldn't need to keep their winter coats on while eating.", "pics": null}}, {"review": {"des": "This place was delicious! We got the potato and cheese pierogis, beef stroganoff, chicken soup with Lithuanian dumplings, and stuffed cabbage. Everything tasted amazing, and curbed the craving for homemade Polish comfort food. We will definitely go here again.", "pics": null}}, {"review": {"des": "The only time I've ever ordered 4 different soups in one night because they are all so good and I can't decide which one. My favorite is the borscht with dumplings. Cozy and the perfect cure for an oncoming cold, or a Friday night in watching movies with friends. <br><br>I also recommend the potato and sauerkraut pieorgie, and have seen my best friend put away the stuffed cabbage like it was his last meal. The latkes are savory and a great combination of fluffy and crispy.", "pics": null}}, {"review": {"des": "Bardzo dobrze!!  We had a wonderful lunch today searching an old favorite spot of my father in laws  Chicago youth. My daughter and I each had a policy plate and my wife had pirogi.  The food was delicious and the servings were large. Our server was warm, friendly and charming. The ambiance reminds me of a hunting lodge, warm and cozy, just perfect on a snowy Chicago day.", "pics": null}}, {"review": {"des": "We arrived at the restaurant, which is split into two separate areas--a fancy dining area, and a rustic bar/ dining area. At the time that we went, they were seating customers in the bar/ restaurant. The rustic and rural feel of the bar and the paintings of the wall reminded me of Chlopskie Jadło in Kraków; however, the food was not as great, according to my girlfriend. We ordered some vodka, the \"Polish plate\", a veal entree and a chicken entree. Food was good but nothing spectacular. Hey, maybe that's just how Polish cuisine is! Also, I wanna mention how friendly our waitress was, she definitely rounded the experience and even talked in Polish with my girlfriend :D<br><br>From my girlfriend: Lokalizacja wygląda super, przypominając restauracje typowo góralskie w okolicach Kraków. Dlatego czułam się swobodnie jak w domu w Polsce mimo że, jedziecie było amerykanizowane. Jest bardzo dobre ale nie jest to samo co w domu lub w Polsce.", "pics": null}}, {"review": {"des": "Amazing food and ambiance. Staff was incredibly kind and accommodating. Would highly recommend!", "pics": null}}, {"review": {"des": "It's been about 10 years now since I last visited Poland. I live on the west coast and I've been craving good polish food for a long time now. Happened to be in Chicago and found this place. Staropolska did not disappoint. The pierogi Ruskie with bacon was perfect!  I'll be dreaming about that pierogi until I make it back to Poland or Chicago. I also had the Żurek which was delicious. Thank you Staropolska for the delicious food. Until next time...", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iNP3eM9Rx7MofPxJndoJ_Q/348s.jpg", "caption": "Pierogi Ruskie with bacon!  Sooooooo good!!!"}]}}, {"review": {"des": "3.5 Stars.<br><br>Atmosphere is nice. Server is nice. Food is above average. Slavic foods are heavy and hearty. I like that most of these Slavic places in Chicago or elsewhere typically take various takes (Borscht in Polish style, for example) on standard dishes; a platter might have a polish Borscht but a style of different food from a different Slavic nation. <br><br>The Polish beer on tap I had (see photo) was so fresh, I would go there for it by itself; but when you start drinking, you crave food..so they had me at Polish Beer!<br><br>Take some friends, get some platters. enjoy!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/p7Xe7ediKhZo3RrSDYt2yg/348s.jpg", "caption": "blueberry fried cheese (cranberry sauce used since blueberry sauce wasn't available)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LpY_1Tf0aN2oJq89yBZOpw/168s.jpg", "caption": "bread basket with butter"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WMJ526nNPPvXVc-4TpzChg/168s.jpg", "caption": "atmosphere"}]}}, {"review": {"des": "I came to this restaurant without a reservation (big big mistake at Saturday evening) but still they were able to find me a place. I ordered a red beets soup (borscht), beef stroganoff and a chocolate cake. I came to this Belmont area specially to eat a polish food in a good polish restaurant and I was not disappointed. Great food, super fast and efficient service, beautiful blond polish young ladies, reasonable prices. When I will be back in Chicago one day, I definitely will come back.", "pics": null}}, {"review": {"des": "Disappointed tonight! Management needs to step it up! Ive been here a few times, the food is good, staff is friendly, but they're understaffed. Every time I've been there there's two servers working the bar, serving, and bussing the tables. The servers are constantly running around trying to keep up. Today I waited 40 mins for Perogis, and 47 mins for a chicken cutlet. Watched a number of tables that arrived after us get served before us. Found out a couple minutes before my dish arrived that I would be receiving friend potatoes, instead of the mashed that I ordered because they were out. Was told our sodas would be free, but I was charged for them. Didn't mention it because I was frustrated and ready to leave.", "pics": null}}, {"review": {"des": "The food is impeccable. The service is not.<br><br>We had to ask for water refills, and even then it took 10 minutes to get water. We were never checked on outside of ordering entrees and desserts.<br><br>However, it's on the cheap side, so I'd say it's worth the poor service.", "pics": null}}, {"review": {"des": "I feel as though I should confess that part of the reason why I enjoy eating at Polish restaurants is the masochistic delight I take in experiencing the myriad ways in which old Polish women can show disdain and indifference toward my presence in their restaurants. The last time I ate Polish food in Chicago, I ordered one item and was told to order another; I declined a starter salad and was given a salad nonetheless. I was deprived of this particular entertainment at Staropolska Restaurant because our server was a young Polish woman who brought us the food we ordered and was nice about it to boot! She even affirmed my (Polish) friend's decision to sprinkle sugar on her potato pancake dressed with sour cream and apple sauce. <br><br>The food was good at Staropolska - the potato pancakes tasted as though they had been made with secret meat (I cannot confirm nor deny the addition of meat), and the veal liver had a nice sear on it. The liver was covered in crisp, greasy onion strands and accompanied by buttery, garlic mashed potatoes. I do have to say the pierogi was disappointing - the skins were somewhat uneven, the sweet cheese filling was grainy, and the fruit filling insufficient. The kitchen seems more adept at the griddle and the fryer than the boiling pot. Nonetheless, an unusually pleasant Polish eating experience!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lrhEEexExK9R2ZLVuXS3Cg/348s.jpg", "caption": "There was a small dish of beet salad too, dressed with horseradish"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/M3YGuAwcVIWbCw7Tl7GUxQ/168s.jpg", "caption": "Pan-seared veal liver covered in shallow-fried onions"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mTYarE3AkbpOG4kJDlpfdw/168s.jpg", "caption": "Meaty-tasting potato pancakes"}]}}, {"review": {"des": "I was excited to try Staropolska on a Friday night for a birthday dinner party. We had a group of about 15, and were seated at a large table in the middle of the restaurant. The ambiance and decor of the restaurant is the main attraction as you feel like you just walked back in time into a log cabin in the middle of the Polish hinterlands, with deer antlers and animal hides on the walls. <br><br>The food was also very good. We started with a couple of orders of the combination pirogi plate and potato pancakes. Both were excellent-- not at all bland or greasy. I shared the breaded schnitzel, which came with potato dumplings. I was happy with my choice and the size was good for sharing, especially after appetizers. I was surprised to see that they offered several vegetarian options, including stuffed cabbage that was stuffed with mushroom and rice, instead of the traditional meat and rice. I tried a bite of this and thought it was very tasty. The one thing I realized the next day, was that I never received the soup that I ordered, but I didn't realize it because I was having a good time. Despite that, the staff was very attentive and allowed us to stay for a while after dinner. The restaurant wasn't packed, but there was steady business. <br><br>I would definitely go back next time I'm in the mood for good ol' Polish cooking and a unique dining experience!", "pics": null}}, {"review": {"des": "Took my suburban parents here when I moved into the neighborhood and even they were happy! Food was delish - I recommend the chicken zucchini pancake. Service was also top notch.", "pics": null}}, {"review": {"des": "This place is amazing.  We have an infant, so we have those days where we just uh, well, give up, lol.  My husband is of Polish descent and one of the great joys of living in Chicago is being able to easily acquire a variety of niche ethnic foods with ease. <br><br>Thank you Staropolska! We ordered a Polish combo and a couple of other items and it was a LOT of food and was about $30 delivered.  We both had very \"healthy\" portions for dinner, because fat, and had enough food for leftovers.<br><br>Very flavorful.  I don't have any other Polish food experiences with which to compare, but being a novice in the flavors of this cuisine I'd still mark it as solidly good food.", "pics": null}}, {"review": {"des": "Listen. My parents are off the boat from Poland. I'm first generation American. I grew up with mom cooking all of this food every night so generally I'm very spoiled and reluctant to pay of Polish food. Was out with a pal who was urging me go Polish and it told him I have no idea where to go. If you want tacos I'm your man. But pierogi?! We go to moms. I found Staropolska on yelp. We went. We dined. We drank. We googled at the hot bartender. We enjoyed our charming waitress. Final result? This place is legit. Food was all old style with contemporary twist. Nothing disappointed. Pierogi where not moms but they where delicious. Potato pancakes where actually better. Sorry mom", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZIHJE4ihbBdOdw75p5wkeA/348s.jpg", "caption": "Fat and happy pals"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GViSiAJwk8eD6BVJxc5QuQ/168s.jpg", "caption": "Formal room reminds me of Krakow"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/m45rZUaedHeC5l9T0ZUGEg/168s.jpg", "caption": "Nice inside"}]}}, {"review": {"des": "Just had lunch there.  VERY disappointed in the service. 6 people. 5 ordered the polish plate.  1 ordered crepes.  3 polish plates came out.  5 minutes later. 2 more came out.  About 15 minutes or more the crepes came out.  We had to ask 6 times before they finally were brought out.  Food was only OK. Nothing great.  Some item on our plates was SOOOO dry.  Not one of us liked it.   Would NOT go back or recommend.  Second time we have been burned by yelp reviews.", "pics": null}}, {"review": {"des": "First time ordering delivery. Got 2 polish plates, TOTALLY AWESOME!!! Best of comfort food all in the same box. Kielbasa was crazy smoky, pierogi were meaty and tender as were the cabbage rolls, potato pancakes to die for?! Flaky sausage rolls (I'm Irish so I don't know what they're called) we're tasty but dry, BUT! The beets w/ horseradish?!? OMG!!! Totally solved that!! Wish I got a paper menu to pass around for next time. Can't add a photo because we ate it ALL!!", "pics": null}}, {"review": {"des": "Gonna throw another fiver on this pile after finally stopping by Staroplska for dinner. With a Polish population the size of Chicago's I expected some pretty big things and I got em. Both literally and figuratively. <br><br>My date and I ordered the special dinner for two and this thing was massive. It had two potato pancakes with staropolski stew, veal scalopino, chicken breast with cranberry sauce, dumplings, stuffed mushrooms and 4 pierogis of our choice. This is the perfect thing to order if you've never done Polish food before, and if you want to stuff yourself till the point of waddling out of the joint. <br><br>The interior has perfect ambiance as well. Between the rustic decor, the oh so perfectly dim lighting, and the extremely friendly service everything besides the food is on point at this place as well. <br><br>After all the awesome reviews, there's really not much else to say so I won't. I'll just go eat my leftover pierogi instead.", "pics": null}}, {"review": {"des": "Great polish food and service! Even on a very busy night, the staff is still very attentive and the food comes quickly. The pierogies, potato pancakes, and mushroom soup are my favorite items and will definitely be coming back for more. They also have a full bar so it's great for dinner and drinks. I highly recommend it and can't wait to go back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pn7KOPrTGFhc3juv032iNQ/348s.jpg", "caption": "Meat Pierogies"}]}}, {"review": {"des": "Overall: One of the best unique dining experiences in awhile. Truly authentic and delicious food, fantastic flair, and great service. Polish at it's best!<br><br>The good: Great tasting food that is authentic. Prices are very reasonable. Service was fantastic, considering we had 20 people. The food and drinks were constantly being refreshed. The atmosphere is awesome, with props abound, fireplaces, and art. Portion sizes are great.<br><br>The bad: The bathroom was freezing? Seriously, that's the only complaint.<br><br>Atmosphere: 10/10<br>Service: 10/10<br>Food: 10/10", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/O2d_5dZcidLfJtSrXpIX0Q/348s.jpg", "caption": "Family dinner plate of goodness, times 2 or 3 if you wish"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zd70VrdEi6Qw27DF_pQBCA/168s.jpg", "caption": "Sweet cheese crepes"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3WmQTH72xn81YP6PkTY-Dg/168s.jpg", "caption": "Peirogis"}]}}, {"review": {"des": "I did not expect to like Polish food as much as I did here at Staropolska! Solid menu and great atmosphere inside the restaurant itself. Our server was very helpful with my group, since many of us did not know what most of the things on the menu were, and she helped us pick good drinks and dishes. I got the Polish Plate, which is a great sampler and was very delicious! <br>I am knocking a star off because it took an hour for our food to arrive and we didn't get much of an explanation. However, our server did allow us to get two free desserts (after checking in on yelp!). We got two orders of blintzes served with strawberries which was alright, though the strawberry syrup was very artificially sweet. I will say you MUST try the potato pancakes-- SO GOOD!", "pics": null}}, {"review": {"des": "PERFECT POLISH<br><br>My friend and co-worker has been bugging me for over 10 years that he was going to fly to Chicago and that I had to take him to an authentic Chicago Polish restaurant. This felt like a lot of pressure because he is of Polish decent. When he called to say I'm in town, I had to jump to action.  I went to Yelp to help me and this place stood out like a gem. <br><br>We arrived on a Tuesday night and there was plenty of street parking, unfortunately we had to pay LAZ. As we walked in, we  were greeted and seated incredibly fast. My buddy immediately started speaking to our waitress in Polish. I thought that was cool and realized I had picked the right place. Hopefully they weren't making jokes about me. <br><br>The restaurant was not very packed. There were three other tables already seated and eating. We decided to grab a few beers on tap. I recommend going with the large over the small because it's a better deal plus it only costs a $1 more to get almost double beer. That seems like a no brainer. <br><br>We looked over the menu and everything looked fantastic. We decided to order a bunch of dishes and just share. That's always better because you get such a nice variety of food to sample. Our waitress came back with our beers and my buddy started bantering back and forth in Polish with the waitress. I had no idea what they were saying but I knew he was getting some fantastic insight into the food that we were about to order. This was one of those times I was getting so excited to have dinner and we hadn't order a single dish yet. <br><br>So my buddy asked if I liked herrings and I said no. I informed him how my grandparents terrorized me every New Year's Eve by making me eat a herring out of a jar. It wasn't even fresh. I told him I would get over my childhood trauma and try them. So he ordered the fresh Herring In the Oil Sour Cream. When they arrived there were three giant herring filets on the plate. These definitely did not look like what I ate as a child. I would probably never order these on my own but I must admit I liked them. My friend said that they were really good and reminded him of what his family use to make, so that was a positive compliment. <br><br>Next came out our Pierogi. This was more my speed over pickled herring. We couldn't decide which ones to order and asked our waitress to get a mix of meat & potato/cheese. Both varieties were amazing and house made. I would recommend the meat over the potato. They were probably the best meat pierogi I've ever had. <br><br>For our main courses we went with a Hungarian Style Pancake with mild pork, pepper & onion and a Stuffed Cabbage with Rice and Meat over mashed potatoes. Both entrees were so good but the Hungarian Style Pancake was out of this world. We ordered this as a recommendation from our waitress and she was dead on with this selection. I can hardly wait to come back for this. The stuffed cabbage was really good and reminded me of what my Mom use to make but I must admit these were much better then what my Mom use to make. I guess Campbell's Tomato Soup is not the official sauce of stuffed cabbage. Ha! Sorry Mom!<br><br>We also got a few sides. The cucumber and onion salad was really good and refreshing.  The Sauerkraut was probably some of the best I ever had. Typically sides like these don't usually taste great because they are just free sides but these were delicious. I can't wait to come back and enjoyed these again. <br><br>When our waitress came back to ask us if we wanted desert, I showed her our Yelp Check-in, which meant a free cheese blintz. Score! The desert even came out hot which means it was freshly made. Sometimes it pays to Yelp Check-in. <br><br>The meal here was really good and I can hardly wait to come back. My buddy is already planning his next trip to Chicago, so if anyone has anymore Polish suggestions I'm going to need them. <br><br>On a side note if you come here with a party of 7 or more ask for the VIP room. It is nothing more then a back table that is really awesome and includes some dead animals on the wall. It has the feel of a hunting lodge. We tried talking our way in to the table but were told we needed 5 more people. We started thinking about who we could invite. We saw 3 guys in the alley who were sitting around a burning garbage can but we would still be 2 people short. We figured we would just sit in our boring booth. So plan ahead if you're bringing a group for the VIP room.<br><br>They also have a banquet room next door which is typically booked on the weekends. So if you're planning a big wedding Polish Food Fest Bash then this is the place. The room is always pre-decorated, so you can get an idea of how gaudy a wedding could be. Ha! Hopefully I captured a photo, so you can see for yourself. <br><br>So this is the place to get your Polish on! The food is amazing and very affordable. The staff is great and speaks Polish too which makes it even more authentic. I really am looking forward to my return trip and maybe one day I will sit at the VIP table", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4M_893ZKu_HH5dlzorRPBw/348s.jpg", "caption": "Large Tap Beer only $5"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/l-JQehhpzkCBwWUO1G8NVQ/168s.jpg", "caption": "Dinning Room"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/u3jlmAGy62tcyu9YgEo5nw/168s.jpg", "caption": "Cheese Blintz free with Yelp Check-in"}]}}, {"review": {"des": "We love, love love  Staropolska . Neither my husband or I are Polish, and before living in Avondale we had never eaten much Polish food. But we live with in a three minute walk for the restaurant and decided to check it. The food is incredible home made yumminess and the staff is equally warm and accommodating. Over the last year and a half we have come to eat at Straopolska at least twice a month. <br><br>We got engaged in the early summer and planned our wedding for October 1 2016. We value our neighborhood and believe strongly in supporting local businesses when it came to feeding our wedding guests we wanted all the food to be made in Avondale in family owned resturants. Staropolska was an easy choice. As I said the food is amazing and the staff fantastic. They have a pretty banquet room next to the restaurant which accommodated our modest wedding of 63 guests. <br><br>The day before the wedding it rained badly and we made the hard decision to move the ceremony from our back yard in doors. When we put down the deposit the owner agreed to let us have the ceremony at the restaurant in the event of rain, she was true to her word and saved our day when our yard became a mud pit. The owner and her staff are beyond incredible. Our favorite server/ bartender Silvi couldn't have been more accommodating and kind. They let us come in 2 hours early for the wedding and we were allowed to deck the venue with the garlands we hand made. <br><br>Our guests raved about the quality of the food, the attentiveness of the servers and the warm atmosphere. We couldn't have chosen a more special place to exchange vows and celebrate with friends and family.", "pics": null}}, {"review": {"des": "We always come here and do the family style meal and with 2 bottles of wine it was still under $50 a person. Great food, Great atmosphere, Great fun.<br>Soups salad apps dumplings potato pancakes krout stroganoff chicken sausage desserts coffee tea soft drinks included. BEST DEAL in the city!", "pics": null}}, {"review": {"des": "This  is one of the worst places I have been to in the city. My husband and I went here for Easter Brunch buffet. While I understand buffet are different than the restaurant I expect similar quality. Everything was cold. They didn't have burners under most foods and the meat was extremely dry. The. They added an automatic gratuity of 18% to a party of 2. Nothing worse than cold food!!!", "pics": null}}, {"review": {"des": "My friends and I recently went to Prague and Vienna and we had a craving for schnitzel. We had the Polish Plate for a starter. Good size starter for a group of 4 to all get a taste. My husband and I shared the vienna schnitzel. Is was delicious! Food and service is amazing. Beer is inexpensive as well! Will absolutely be returning. I am mad I didn't find this gem sooner!", "pics": null}}, {"review": {"des": "This is a Chicago gem. The portions are large, polish, and tasty. The vegetarian platter is a surprising find in a meat & potatoes kind of place, but truly tasty. I was actually blown away by the flavors, as I was expecting something very bland. My meat eating companion was pleased as punch with his Vienna Schnitzel (not really polish I suppose, but something they did just great at preparing).<br><br>Highly recommend this spot as a true taste of Chicago.", "pics": null}}, {"review": {"des": "Zywiec on tap is always perfect temperature and someone here pays attention to keeping tap lines clean.  Best tap beer anywhere.  Red beet soup perfectly seasoned.  Pierogi's always fresh (ruskie are the way to go).  Potato pancakes light not greasy.  My only wish is that they do czarnina and Golonka.  Best Polish food in the city!!!", "pics": null}}, {"review": {"des": "Stopped by to pick up some dinner to go after leaving O'hare and driving toward downtown.  I'm a big fan of Polish food and Staropolska did not disappoint.  Ordered the cabbage rolls and loved them.  Nice creamy tomato sauce, savory rice and meat, and mashed potatoes.  The ultimate comfort food to recover after a long week of travel.  It also came with a good amount of beet salad with horseradish sauce.  Very satisfying.", "pics": null}}, {"review": {"des": "Totally bummed out, how does this place have such an amazing rating? I was really looking forward to having some delicious polish food. Instead we got horrible service and mediocre food. The best thing about the place is the decor, as long as you don't go to the disgusting bathrooms", "pics": null}}, {"review": {"des": "Had this last night for the first time. My wife spent a summer in Poland so I took here here on a date. Everything was delicious. Great staff and great food.", "pics": null}}, {"review": {"des": "Great food.  I wish they would state on their menu that they sprinkle bacon on their cheese and potato pierogi.  Yes, vegetarians do exist in the Polish community!<br><br>Their zucchini pancakes are fantastic!<br><br>I hope they expand on their kids menu or their American food options just a little bit. :)", "pics": null}}, {"review": {"des": "One of my dinner groups came here for my January 2015 pick. I had the place bookmarked since 2008, so I was very excited to finally cross it off my list. Who doesn't love hearty Polish food in the winter?<br><br>*cough* Angela P. *cough*<br><br>Just kidding! We converted Angela with Eastern European hospitality. And beer!<br><br>I had 2 helpings of Żywiec. It's a light, pale lager that pairs well with heavy foods. I also got a small cup of the grzaniec (mulled wine), which is also a great option in colder weather.<br><br>The interior of the restaurant is very inviting, regardless of the season. It has an Old World feel. Lots of brick and wooden accents with large, dark wooden tables and chairs. They also have an additional fancy banquet area, but we didn't eat in that part, and I'm glad we didn't. You can find that anywhere.<br><br>What you can't find everywhere is perfect pierogi. They have it. At least the meat ones were done just right in my eyes. I was particularly fond of the added bacon bits and side of sour cream.<br><br>Service was great. They were on top of everything and we didn't wait long for the food to come out. That's pretty impressive anytime you have a table seating more than 4 people.", "pics": null}}, {"review": {"des": "This place is a bit strange. It's been recently remodeled, and from the outside, you'd imagine a modern Polish eatery.  Walk in the door... and you'll wonder if you're starring in an episode of Xena Warrior Princess.<br><br>The decor is reminiscent of a peasant's hut, or maybe a medieval pub.  Brooms and kettles and pots and pans hanging on the walls.  Odd.<br><br>This place is also very local, my friend and I walked in and people gaped at us like they'd never seen two women eating out alone before.  Mind you, it was around 3pm on a Sunday.  At the bar sat several men in suits and hats, eating alone.  The tables were filled with families.  We were the only ones who weren't regulars.<br><br>This didn't stop us from enjoying a few million cocktails and a giant platter of cheese and sausages.  The cocktail list was interesting, with drinks like \"rum and coke\", \"gin and tonic\" and \"sex on the beach\".  Literally every traditional bar drink with nothing unique.  We settled in for a few Long Island's and Sex on The Beach's because hey... actually they reminded me that was an ordering option since I usually order whatever the onsite mixologist has come up with.  To be fair, the drinks were very, very cheap, and quite strong, which resulted in us having way, way too many of them.<br><br>The food was decent, also affordable, but nothing very fancy or surprising.  I was pretty disappointed in the mashed potatoes, which tasted days old and possibly out of a box - my friend, who is Romanian, declared that they tasted just like the ones from her childhood in Romania and proceeded to eat them all, so perhaps my taste in potatoes is off!  The food was a great value and the staff was very nice, although a little judgmental about our drinking, which I never appreciate.  All in all, a good time was had, and if you're into Polish food, this is a very authentic place to check out.", "pics": null}}, {"review": {"des": "Heck ya! What a little gem. Growing up in the Polish area of Chicago makes me crave my childhood comfort foods. For those looking for a hearty meal that'll leave you full and happy while experiencing REAL Polish Chicago culture, look no further. <br><br>This ain't a contrived hipster joint, just an authentic family restaurant where you hear Polish being spoken around you and have a chance to immerse yourself and appreciate a true local experience. Oh, and the prices are excellent too.", "pics": null}}, {"review": {"des": "This is by far the best Polish food I have ever eaten! I was never a big fan of Pierogi until I tried the Pierogi from Staropolska. You can easily tell this food is made fresh on site. I can't wait to come back!", "pics": null}}, {"review": {"des": "Great service by Jola for a light lunch of rosół with Lithuanian dumplings, and pierogi with strawberries. Staropolska will be near the top of my list of places to re-visit next time I'm in Chicago.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-m3t3ZLtpn9a-CiFN7hnGg/168s.jpg", "caption": "Pierogi z truskawkami"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nEaLJWpJgiCFuS7xDps3nw/168s.jpg", "caption": "Rosół z mięsnymi kołdunami"}]}}, {"review": {"des": "We will be going back! Went on a Wednesday with my boys (17 and 13,) it was not crowded so we took in the cozy decor. Food was very good, you get a good amount for your money. We will be back because there are many meals we want to try. Service was good, we did not feel rushed and our drinks were filled before we needed to ask.", "pics": null}}, {"review": {"des": "So glad I got the Bacon Sandwich.  It was delicious and more than satisfied my bacon craving.  This wasn't no wimpy sandwich: a good 4-5 slices of cheese, with a hearty pile of quality bacon, some lettuce, big slices of pickles, and some slightly sweet mustard, all between some soft white bread slices.  I'll definitely order it again. The fries it came with were also great.  You know it's a good fry when you order delivery and they're still crispy... and you know it's a tasty sandwich when you keep taking another bite even after you're stuffed.<br><br>I also got an order of pierogies.  Stuffed with potato & farm cheese and sprinkled with bacon bits, these hearty dumplings were delicious. Perfect with some sour cream.<br><br>I'm definitely ordering again and will probably check out the restaurant next time. I gots to get me my bacon fix!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SZRluQtZde2bD-CUcOx4Yw/348s.jpg", "caption": "Bacon Sandwich"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4rUTsFS8RxFT9RghemjpvA/168s.jpg", "caption": "Potato & Farm Cheese Pierogies w/ bacon"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Fm9-G4A9Ev4EZQGrsEcVYw/168s.jpg", "caption": "Bacon Sandwich"}]}}, {"review": {"des": "Polish cuisine always got an icy reception from me.  A raised eyebrow and a \"no thank you,\" can often be heard when being offered anything other than a pierogi.<br><br>But the zucchini pancakes at Staropolska might have changed the game for me.  Crispy zucchini, shredded and fried as a pancake, stuffed with chicken, peppers and goat cheese - it's not what I expected at a Polish restaurant, but it was a delicious and filling meal.<br><br>I also had the sweet cheese pierogi, which I honestly didn't like very much.  The dough had a gummy texture, and the cheese was dry.  This could be because I'm used to frying Kasia pierogi in a pan, and I've come to really like the crispy, buttery outside that I'm used to.  My friends had some meat pierogi and seemed to really like them, so maybe it's just me.<br><br>I tried Zywiec (Zyv-ee-ech, I think), a Polish beer, for the first time.  It's definitely better than the Millers and Coors of America, but not as special as some of those fancy craft beers out there.  It complemented my meal nicely.<br><br>The inside of Staropolska is like a lodge.  We sat in the \"VIP\" section in the corner, at a large wood table, with bulky chairs that were like mounds of lead.  The fireplace in the corner added to the cozy, ski-lodge effect.  There is also a separate banquet room, which is gorgeous with its exposed brick walls, white table coverings, and clear, delicate chandeliers.<br><br>Our server was great.  She was caught offguard when our party of 11 walked in (WITH a reservation), but she took it in stride and got us settled with beers in ours hands within minutes.  She was very patient with our group - a few of which were indecisive or unfamiliar with the menu.<br><br>The parking situation was perfect on a Wednesday night, I parked on the street right in front of the building (no lot).<br><br>We all ate well at Starpolska.  Most of the entrees were less than $12.  After all was said and done, we spent maybe $30/person.  I'd recommend Staropolska to anyone who wants to try Polish food.  Even if you're already familiar with the cuisine, you should get here.  If you're with some picky eaters, they even have simple items on the menu like chicken sandwiches.", "pics": null}}, {"review": {"des": "As far as Polish food goes, I am a fan of the homemade goodies from Babcia, but other than that I have not been to many Polish restaurants. To be honest, the Polish cuisine is not my favorite, but I do love me some pierogis. <br><br>We arrived a little earlier than our reservation time. There was only one girl working and the restaurant was not busy. She had totally forgotten about our reservation, but was very nice about it. She seated us in the VIP section and got everything ready right away. The whole place has a lodge feel with a nice fireplace, which we happened to be sitting next to.<br><br>After taking a look at the menu I tried a Polish beer called Zywiec. For my first Polish beer ever, I enjoyed it. It is very light, like a Coors or Bud. I ordered the potato pierogis and tried some of the sweet cheese pierogis as well. To be honest, I have had pierogis that were wayyyy better. Again, they were homemade and nothing can really beat that. But these were plain and pretty tasteless. They were filling though. But overall I thought the food was disappointing. It is cheap, however.<br><br>For only having one person working, our server was pretty good. There were times that it would have been nice if she could have come around more often to clear plates and ask if we needed anything else. But she did a good job overall.<br><br>Another side note is that there is parking on the street that is easy to find. That's always a nice perk in the city.", "pics": null}}, {"review": {"des": "This is the best Polish food I've had since my Busia passed away years ago. I could not. stop. eating, even though I was stuffed halfway through my meal. <br><br>The waitress brought over a basket of bread when we sat down, and then I had the Polish Plate since I couldn't decide on an entree. The plate had a sampling of pierogi, golabki, kielbasa, a potato pancake, pasztecik, and sauerkraut. I asked for a side of sour cream for my potato pancake and pierogi, and she brought over (I swear to God) a small gravy boat full of sour cream.<br><br>HEAVEN.<br><br>The decor is awesome. We were reminded of a medieval banquet hall/peasant's hut (we couldn't decide which). We peeked into the banquet room, which is much brighter and classier; it would be good for a post-wedding brunch or an anniversary party.<br><br>I can't wait to go back and stuff my face again.", "pics": null}}, {"review": {"des": "You know you found an \"authentic\" spot when you are the only one speaking English! I was wanting some Polish food while in Chicago, and saw I bookmarked this place before and never went. It's a little tuck out in the Polish neighborhood up Milwaukee near Belmont Blue Line Station (about 11 minutes walk). And by the way, the servers speak English, just that all the patrons were speaking Polish (or Ukrainian?) when I was there.<br><br>The door to the right is for the restaurant (the one on the left is their banquet room, which is very nicely decorated). I sat down at the bar since I was by myself. Place was hopping with a big party and several other small tables of patrons at an odd hour of 3pm. The 3 ladies (including the bartender) were mostly caught up serving the large table, so the service was a little lacking but I didn't mind. I ordered the Polish Plate ($11.99) which was a lot of food. The only thing I didn't enjoy as much was the pierogies - mainly because I like mine pan fried and theirs were boiled. Everything was tasty. I even tried their Polish Pudding Cake ($2.99) for dessert, which reminded me a lot like Napoleon (or mille-feuille). <br><br>Overall I thought the food quality was great, good value, and great decor. Definitely a good local spot for a good meal.", "pics": null}}, {"review": {"des": "Staropolska was a great experience. Service was good, food was delicious and plated well, and the atmosphere is pretty solid. The selection of food on the menu is great, and the bar has a reasonable Polish selection.", "pics": null}}, {"review": {"des": "My boyfriend took me here for my 30th birthday dinner and I haven't stopped telling people about it! Very affordable, delicious and fresh food! High quality and the business appears very clean. We split the dinner for 2 - incredible and you will have leftovers. The staff is extremely friendly and the patrons appear to be regulars (a table next to us sang me happy birthday). Can't wait to go back - go if you havent!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MURQBBsuSYT_BMY9e8qjJA/348s.jpg", "caption": "Dinner for 2 - everything was amazing!"}]}}, {"review": {"des": "I may have a heart attack soon, but it was totally worth it. I had a serious pierogi craving and happened to be in the neighborhood. This is a quaint spot where the staff greets you in Polish and then hands you a menu where each dish could easily be a meal for two. I had the meat pierogi and they were delicious - perfectly seasoned with butter and bacon on top. (See what I meant about the heart attack?) They have plenty of outlets and seemed totally comfortable with a student working on her laptop next to some old Polish men debating something next to a guy at the bar watching tv. I would definitely come back for dinner to try more of the menu... Once I've lost the 10 pounds I just gained.", "pics": null}}]}