{"name": "steak-48-chicago", "reviews": [{"review": {"des": "My boyfriend and I went to Steak 48 for my birthday celebration dinner on a Saturday night. There was a birthday card that was handed to me when we were seated, which was so sweet!! I studied the menu before arriving, so we already kind of had an idea on what we wanted to order. <br><br>The bread they serve comes in a pan so it's warm and delicious. We ordered the crispy shrimp (5/5) and king crab & avocado stack (5/5), which was recommended by our server. We then each got filet mignon (6/5) - extra point for being super good! For sides, we ordered corn creme brûlée (4/5) and brussel sprouts (4.5/5). I was so full by the time I had a third of my steak, so I knew I needed a box to take home. <br><br>After this delicious meal, our server brought us a dessert menu but we were very full so we told her we were going to pass on the dessert. And she said it's going to be free because it's my bday and I just have to take one bite. That was so sweet of her!  So... we got the famous ultimate warm vanilla caramel cake. And it came with the happy birthday message and a candle!! (It was delicious too). What a lovely experience! I would recommend this place to anyone looking to celebrate a special day.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/brJQDtF2Nl4Z8-4qzWrGMQ/348s.jpg", "caption": "Filet Mignon*, Corn Créme Brûlée, Roasted Brussels Sprouts"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1esGzbAYn3LLQOsz41cyYg/168s.jpg", "caption": "Left: King Crab & Avocado Stack Right: Crispy Shrimp"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FKSlUGu3PrarSzJnMZvgWw/168s.jpg", "caption": "Ultimate Warm Vanilla Caramel Cake"}]}}, {"review": {"des": "You'd expect some professionalism at an establishment like steak 48, however my party ( of 3 people) was met by a host who kept stringing us and other patrons around for 30-1hr+.<br><br>My party had reservations at 8:15 on a Thursday. When we checked in, the host informed us that the wait staff was \"busing the tables\" and that we will be seated shortly. We stood to the side and waited patiently. <br><br>As time passed, more patrons would come in and the hostess would say the same thing, \"your table is almost ready\". Big red flag. This man walked up from the bar and he was visibly upset. He stated that he'd been waiting for an hour past his reservation time. The hostess, like a record player, tells him \"your table is being bussed\".<br><br>Once hearing this, we had enough. We asked the hostess one last time for an honest answer on a wait time. She gave the same vague answer. We had enough and left. We walked over to Mastros, where we were treated with some professionalism that you'd expect at an establishment you spend 200$ /per person at. <br><br>The ownership really needs to retrain their staff. Ive been to Gibson's, STK, Swift and sons, Sullivan's, RPM, tortoise club, prime and provision and this is the first time I've been left a restaurant. Honestly, I've gotten better service at a chili's. <br><br>I'm giving two stars because the decor was unique and the food smelled/looked great.", "pics": null}}, {"review": {"des": "Steak 48 is another beautiful, dark, classy steakhouse in River North. The space itself is really giant and would be great for a business dinner or you could even hide in the corner for a date! We had the crispy shrimp appetizer which was everything you would imagine out of a large sizzling platter of fried shrimp in garlic aioli, yum! The shrimp was the all star of the meal. Quite heavy though. The chopped salad wasn't what I expected- the lettuce was quite sad and not as crisp as I would want. Definitely expected more out of this. <br><br>I had a filet mignon with sugar snap peas and whipped potatoes. Although it was impressive how the staff brought out steaks on a 500 degree plate, the steak was quite salty even though it was cooked to a perfect medium rare. Whipped potatoes did not spare the butter and cream and were delicious, and the sugar snap peas added some green to the plate. <br><br>Overall it wasn't the best steakhouse in Chicago (this is based on one steak, maybe salt bae prepped it) for the price $$$ but it is a beautiful venue with great shrimp!!<br><br>Not sure I would go back.", "pics": null}}, {"review": {"des": "My wife and I always do a pre-Christmas steak dinner and we chose Steak 48 this year to veer away from our usual spots (Swift, Joe's).  I thought about giving this entire experience 1 star, but the food itself had to bump the rating up to 2 stars.  I'll start from the beginning.<br><br>We arrived right at 745 for a 745 reservation.  We were told our table was \"just wrapping up\".  There was no offer to hang our coats, even as the hostess offered this option to every patron that came in after us.  755 comes around; 3 additional tables are sat of various sizes.  800 rolls around; a table was sat of patrons that appeared to not have a reservation.  For the entire 20 minutes, we stood to the side of the narrow entrance and no one acknowledged us again, even though there were 4 hostesses and what appeared to be the front of the house manager (more to come on him).  I finally returned to the hostess stand and asked for an update.  Our table still was still not ready.  <br><br>At 807, the hostess came by and asked if we'd be ok with a \"table\".  I said \"of course\".  As it turns out, they had our reservation booked for a \"booth\" which my wife couldn't recall requesting.  We generally will ask for some privacy in our reservations, which might have prompted the front of the house to book us in a booth, but the lack of communication surrounding this was absurd.  It took 22 minutes of us standing there in confusion for any of the 5 of them to realize \"wait, we should probably ask them if they want to be sat at a table.\"  We had begun looking for other availability at other restaurants and would have definitely left had we found something suitable.<br><br>Once I said, \"of course\", we were immediately seated.  It was astounding to me that this was the only question needed to be answered to relieve us from standing in the lobby waiting.  <br><br>We were escorted to a table that was right next to the bussing stations for water, glasswear, and POS (point of sale) systems.  There were other places to sit in the room, but, in the grand scheme of things, we were content that we weren't still standing in the lobby.  I pulled the hostess aside that escorted us to our table and explained everything above to her, and I definitely conveyed my displeasure.  I rarely show my emotion but she definitely got the brunt of both my wife and I's mood.  She again reiterated that we had asked for a \"booth\" which we still didn't understand.  We have never, nor will we ever, ask for a \"booth\" which I assume to be their internal seating for \"private\".  To her credit, she took it stride and clearly notified management of our experience immediately.  <br><br>At this point, we were visited by a gentleman that introduced himself as the GM (I believe) and he was pleasant.  He let us know that he apologized for the situation in the lobby and that we'd be taken care of.  We both appreciated the visit from him.  About 5 minutes later, the gentlemen that was at the front of the house stopped by as well, and apologized.  I explained that I concluded the mix up probably came from us likely indicating we preferred privacy for our dining spot, and that likely triggered this \"booth\" allocation.  He agreed and we all went along with the night. <br><br>Our server was pleasant, albeit incredibly scripted and could not read us as patrons at all.  It took 5 minutes to explain the menu; perhaps he was nervous about being told that we were already having a bad experience.  I had worked in restaurants in my earlier life and that was never a good position to be in.  That said, his ability to read our body language and demeanor was just not there.  <br><br>There was a bar code issue with our bottle order, and he came back to ask us which vintage of the Pinot we wanted.  He asked if it was from the reserve menu or the regular menu.  For the price point and what had occurred thus far, this is where the small errors started to become comical.  <br><br>We placed an app order of the burrata and select oysters.  When these dishes came, the runner started placing the dishes on our table.  After some awkward silence, he said \"you ordered these right?\" to which I replied yes.  He then started to struggle to explain which oysters where which (I almost corrected him as I knew which ones were which just by seeing them visually) at which point the server jumped in hastily and corrected the runner.  1.  Your runners should never ask a table \"is this yours?\"  2.  A runner should know the origin of the oysters he/she is delivering to a table.  <br><br>As for the food, (including our Ribeye and sides) it was all very good.  We had no issues with the quality or taste.  Well done all around.<br><br>To end, we did not order dessert, but i did order an espresso.  We then got a comped dessert (which we didn't touch) in an obvious attempt to \"make things right\".  It ends up being a waste of food and nothing else is taken care of, not even the espresso.  <br><br>Service was a disaster all around.  I've run out of room to type; we won't be back, unfortunately.", "pics": null}}, {"review": {"des": "So this is one of those places  that people call \"Sexy Steakhouses\" they cater to various people and it's clearly a nice spot, one that is filled with beautiful lighting, scenery and they do provide excellent customer service.<br><br>I went with a group of folks and I love my steak! Truthfully I've had better steaks at Fleming's and Ruth Chris. I really had better steaks,but I will get another steak from there and give them a shot. <br>Now their bread had garlic and herb taste to it, and it was good! Now let me tell you what their good at! Their drinks and appetizers are amazing! The Laphroiag Old Fashioned hands down was one of the best Old Fashioned's I have ever had, the shrimp was colossal! The Alaskan King Crabs we're tasty and succulent, however my lobster tail that I had with my steak was sub bar, no flavorful, no seasoning and I was truly disappointed, especially since it was soo big! <br><br>Overall a solid 3 with the ability to get a better rating, but like I said sexy steakhouse.", "pics": null}}, {"review": {"des": "A touch of heaven, came here with colleagues, in town for a commercial real estate conference.  This place really makes Chicago look good. Great location, in the heart of River North.  As you enter you'll hear the cacophony  of all the people.  On your right, a row of butcher knives.  On the left, some really, tripped-out art work.  We had reservations, for six but it was a bit of a wait. Not to worry, the bar was hopping and the bar-backs can pour some drinks. <br><br>Starters<br><br>We where seated and the waiter, Anthony was all over it.  Very knowledgeable in walking us through the menu and helping to select a bottle of wine.  We started with appetizers. Gargantuas Prawn cocktail, oysters, Alaskan King crab legs  & avocado, smoked Shishito peppers, braised pork belly's,  sautéed mushrooms, Prime Steak House meatballs ,veal amazing  devil eggs.  Not quite everything on the menu but,  getting there.  <br><br>Entree<br><br>Chilean Sea Bass, topped off with shrimp... delicious, there where no complaints around the table, the Bone in Ribeye & the New York steak where both hits.  <br><br>Deserts<br><br>The fried bananas with ice cream,  fantastic.  Everyone should try a taste of the chocolate cake cake.  <br><br>Absolutely, loved it!", "pics": null}}, {"review": {"des": "We don't do repeats on restaurants much but this place is so good every time! If you're not feeling steak on this particular visit, their crab cakes are the best. Get the crispy shrimp to start, anything from the raw bar and end with the warm vanilla cake or the red velvet bread pudding. You will leave so full and happy!", "pics": null}}, {"review": {"des": "Overall a fine steakhouse but in the city of amazing steakhouses, not a standout. I very much enjoyed my meal, though if I was choosing a favorite steakhouse in Chicago, this would not be it. <br><br>FOOD: We has half a dozen oysters to start, then shared the 18 oz bone in filet. On the side we had the crab and shrimp Mac and cheese, Brussels sprouts and mushrooms. All of it was very good but extremely rich. The Mac and cheese was especially decadent and I admit I felt a little sick after eating just a few bites of everything. Despite that, we of course ordered dessert: the chocolate bread pudding which was FANTASTIC. May have been m my favorite part of the meal!<br><br>DRINKS: I had a Paloma. It was pretty typical though my server was very odd and kept warning me it would be \"spicy\". Yes I know what mezcal tastes like, that's why I ordered it. <br><br>SERVICE: Again, our server was a little overly attentive. I prefer a level of service that is timely and courteous, but not needy. Not only that, we had about three different folks come by our table throughout the meal to introduce themselves and ask how we were. It's fine overall, but just so you know, you will have tons (and maybe too much) attention if you dine here. <br><br>Again, it was a nice meal and the food was good, but I likely wouldn't return. Go for it if you're looking for a nice, indulgent steak dinner.", "pics": null}}, {"review": {"des": "This is one of the best steak houses in Chicago. <br><br>If they have the Tomahawk cut, get it! Great wine, cocktails and appetizers, too. This is the place I will be taking the in-laws to for a special celebratory dinner when they are back in town.<br><br>After some hiccups during their first few weeks in business, they recovered very well.", "pics": null}}, {"review": {"des": "Great place for steak.  We had several seafood appetizers that were very good.  Then shared 4 steaks as a table...All were cooked perfect and tasted equally as well....<br>Atmosphere was quaint and service exceptional.", "pics": null}}, {"review": {"des": "This is a tough review. As I write this review I'm debating between 4 stars and 5 stars. But for now I'll give it 4 stars. Here's the breakdown. Had a reservation through Open Table and came here on a Wednesday evening. Place was pretty full, we came early however our table was not ready so they told us to wait at the bar and they will come get us. (aka get a drink spend more money spend more money and spend more money LOL). At the bar, right smack in the middle of the restaurant I decided to get their French Old Fashion. They have 4 different old fashions and each cost $18. That is insane. A bartender/waiter took my order at the bar. I think she was in training. I have no idea if my old fashion was made the way it was supposed to be. She started to make it, then took a break, took others orders then after a couple of minutes finished my drink. I really did not like that. Probably the only reason that I'm clouded to give this place a higher rating. Anyways the old fashion was fantastic. Very smooth and I love how they gave me a single cube. However it became watery very fast. I don't think the bartender or the one who washes the cups did a good job making it. Think it could've been better. BLAH.<br><br>We were seated near the kitchen. Kitchen looks amazing. Our waiter David (same name as me) was phenomenal. He was personable, very outgoing friendly and just made our experience great. Props to him. Wanted to get some appetizers but like I always do at steakhouses, I over eat and feel like dying afterwards so I held off on the appetizers. Thank goodness because they came out with complimentary garlic bread. It was very soft, tasty and delicious. <br><br>For my entree I got the bone in rib eye. My go to at any steak. $59 for a high end steak house? Not bad at all. My steak was cooked perfectly. I really enjoyed my steak. Thought it had the perfect mix of a little tender juicy fat along with good meat. The cut was fantastic. I was a fan. Comes out HOT in sizzling plates so beware. For sides we got the mac and cheese and Brian's potatoes. Initially I didn't like the mac and cheese at all because at the top, there was really no cheese or ingredients I felt like. But as you mixed it more and more it was very tasty. Brian's potatoes were an interesting twist. I liked it but felt like it didn't mesh well with my steak. All in all I really enjoyed my experience here. Service alone, it's more than 5 stars. Service was fantastic. Props to David our waiter for a great enjoyable time. Steak was good again. Was it the best in Chicago? No, it's still Bavettes but Steak 48 creeped up to #2 on my list. I wouldn't mind coming back here again. Check it out. Let me know what you think!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9fhbTxQk89iOxq_FsLpfzA/348s.jpg", "caption": "My bone in rib eye with Mac and cheese and Brian's potatoes"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-NyotMfpv_lWcFxqWhVG6w/168s.jpg", "caption": "Bar area"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bNBF3JU2dW9W-tMzwT5UtA/168s.jpg", "caption": "French old fashion. $18. damn pricey but damn smooth and good"}]}}, {"review": {"des": "I can't believe I never tried this place in my neighbourhood until now. I LOVE this place.<br>We came here for late night drinks and got some small plates to nibble and I was impressed:<br><br>Drinks: they have a great selection of whiskey/scotch/bourbon, from low scale japanese toki to high end glenmorangie pride. If you love whiskey, this is your place for sure. They have a great list of creative cocktails too: mango habanero is a great one to go if you like a little bit spiciness in your drinks. wish it was less sweet tho. Not a huge one person, so I can't comment on their wine, but they do have a long list of wine collection too. <br><br>Food: we ordered prime steakhouse meatballs (loved it, fresh/chewy with great italian spaghetti sauce, which you can dip bread into). the complimentary buttery dinner rolls taste amazing. they make them on the 2nd floor in front of you and served hot and fresh in skillet--Loved it!! Crispy shrimp taste amazing too (buttery and sweet, reminds me of chinese lemon shrimp tho). I'm a huge fan of their roasted brussels sprouts, best brussel sprouts I've had in the city!! it's cooked to a perfect texture. Corn creme brulee is interesting, it looks like the dessert creme brulee with corn and cream in it. I liked my first bite, but then it's becoming too much...<br><br>Service is great and attentive. Atmosphere is classy and romantic with great music selection. <br><br>Def will come back to try their steak...", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8W1IpdYBZIHNeU6oSu5zcw/348s.jpg", "caption": "Roasted Brussels Sprouts"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eei2hqkvjvMt6YCE0-UlJg/168s.jpg", "caption": "Prime Steakhouse Meatballs"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TKJS_e_ojAttptkHfSWrzg/168s.jpg", "caption": "Corn Créme Brûlée"}]}}, {"review": {"des": "BEST DINING EXPERIENCE EVER.  Seriously.  I'm not sure whether it was the occasion, the company, our awesome server, the delicious food or the ambiance, but it was truly memorable.<br><br>AMBIANCE:<br>Very dimly lit (great for making you look better than you actually do!).  Soft, calm romantic art prints on the walls helped create a romantic ambiance.  It's much more contemporary than your typical steak house.  You can tell they care about quality down to the last detail.<br><br>SERVICE:  <br><br>The classiness of this place is evident in the details (not that I'm an expert in upscale restaurants by any means):<br><br>-  There was a 'Happy Anniversary' card on our table when we arrived.<br>-  We were asked if we wanted black or white napkins. <br>-  You get the martini and the shaker, not just what's in the glass.<br>-  Crab legs are already split.<br>-  Hot, wet towels scented with lavender (and eucalyptus?) after your meal. <br>-  They scrape the crumbs off the tablecloth after you finish.<br>-  You get a free dessert off the menu on special occasions.  <br><br>Our server, Heather, gets an A++++++.  She greeted us with pep, a smile and genuine happiness for our anniversary celebration.  She was laid back and friendly, but also professional.  We were treated like old friends, not just a means to get a good tip.  And she was genuinely excited for us to get our 2 orders of Alaskan king crab clusters, because it was her idea of the \"perfect date.\"  (*Hint, hint* to Heather's boyfriend, if you're reading this!  I think you know she deserves it.)<br><br>FOOD:<br><br>The garlic butter rolls you get before the meal are delicious.  But don't fill up too much!  My husband ate 4... Way to pace yourself, hun...<br><br>We both knew exactly what we would order 1 month before we arrived - because when you see a photo on Facebook of your friend holding an Alaskan king crab cluster the size of her arm, you order that!  It was the reason we came here.<br><br>A crab cluster is 1/2 of an Alaskan king crab (which are usually 5 lbs each).  It was Market Price, so about $89 a pop.  Yikes!  (But soooo worth it).  When they brought our crab legs out, I kept repeating, \"wow, that's beautiful\" out of sheer excitement.  I'd never had king crab like this before.<br><br>My husband ate almost all of his cluster (2 lbs!!).  I ate about  1/2 lb.  This left us with about 1.5 lbs of extra crab meat to take home.  We figured we'd make crab cakes the next night, but that never happened.  We scarfed it down with garlic butter the next day.<br><br>Oh, and the corn crème brulee - you need this in your life, trust me.  It's super rich, and quite large, so share it with 1-2 people.  Thank God we didn't order any other sides or we'd have to be rolled out in wheelbarrels.<br><br>I truly hope I get to come back to Steak 48 again someday.  I know there are a ton of places to eat in Chicago, but this place knows how to win your affection.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tV-3IZcwhCOlVAa1WqrbKw/348s.jpg", "caption": "Abhgg!!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JUtkg0gnop-zzPUQzA6eKg/168s.jpg", "caption": "Hubs"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/y3f-Trl3djynjwUiLHCMQw/168s.jpg", "caption": "1.5 lbs of leftover Alaskan king crab meat"}]}}, {"review": {"des": "Where do I begin? This was our first time visiting since they opened last year. My date and I pick a restaurant to splurge at every month and November was Steak 48. Definitely make a reservation well in advance, because it was totally booked--we visited on a Friday evening. <br><br>Service was exceptional. We were greeted by numerous staff members upon arrival, seated promptly and did not have to wait for anyone to take care of us at our table. My only criticism was that the music was a tad loud, so it was difficult to hear some staff members at times. Our waiter was extremely helpful and knowledgeable about the beverage and food menus--there's a lot of info to take in if this is your first time so beware, but he answered every single question we had and was very patient with our decision making process. <br><br>The food? C'mon. Out of this world. I ordered the 16oz NY strip and I've never had a knife glide through a steak so easily. Their house rub was delicious and it was cooked perfectly the way I asked for it. Definitely recommend Oscar-style steaks because the crab cake was everything. You can tell a lot of thought and skill goes into the meat selection, the aging, and the cooking process. My date ordered the king crab and it was delicious and the meat was so flavorful on its own. The clarified butter and touch of lemon made it even more spectacular. <br><br>All in all, great new-ish spot if you're looking for an upscale night out. It's pricey, but 100% worth every dollar spent. We will certainly be back for more.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SwGjMUEr6Bo0mbiuZ9jH8A/348s.jpg", "caption": "16oz NY strip, Oscar-style"}]}}, {"review": {"des": "Steak 48 (named after AZ state) entered the River North neighborhood last summer and caught my eye, but the opportunity to visit kept slipping. However, it was on my list of must-experience, given the history (founded by the Mastro family) and the exclusivity (third location nationally). <br><br>While I regret not doing a better job of preserving my appetite, and given that I was going to head to Tao immediately after (2 blocks away, so quite convenient), I am still happy that my wife and I experienced Steak 48. Overall, a great experience across the atmosphere, food, and service.  <br><br>We were seated on the second floor which tends to be a bit less noisy and social than the bottom floor. That said, on a Saturday night at 9 pm, even the second floor mirrors the first. The art and atmosphere are less stodgy and \"old school\" when contrasted with other Chicago steakhouses. <br><br>After being seated, we were immediately greeted with hot parmesan rolls / bread, which are tempting to dive into but one has to remember that the meat is only a course away. We started off with mocktails, followed by the notable king crab avocado stack (good but could've used a but more flavor / kick), beet salad, and then proceeded to order the (market price) 12 oz wagyu filet, which has limited availability as well (and is served on a 500 degree plate that continues to reinforce the hot and fresh taste of all items that you plate). For sides, we had the creamed spinach (great - the smoked garlic and artichokes were solid) and the venerated / recommended double baked truffle potato (amazing - the black truffle oil is bold and powerful, complemented by the Gouda). As we had to continue the night, we opted not to indulge in dessert but saw so many delicious options at nearby tables. I should add that our server, David, was absolutely delightful and very easy to work with throughout the night. <br><br>Very happy that I finally had the opportunity to try out Steak 48. Next time, I will need to try the Tomahawk based on David's suggestion (but need a couple more folks)!", "pics": null}}, {"review": {"des": "I didn't think any other steakhouse in Chi came close to Bavette's, but this one did. Food, drinks, service, and atmosphere were equally stellar. <br><br>Apps-<br>Sauteed shrimp: 5!<br>King crab and avocado stack: 5<br><br>Dinner-<br>Sauteed asparagus: 5<br>Creamed Spinach: 5<br>Steak Farina (with egg on top): 5! Excellent cut of meat and perfectly cooked.<br>Bone-in Filet Mignon (12oz): 5!<br><br>Drinks-<br>Silver Oak Cabernet: 5!<br><br>Excellent experience!", "pics": null}}, {"review": {"des": "I have one word to describe my dining experience with Steak 48: Outstanding. From beginning to end, the food and service were impeccable.<br><br>Our service started out by our server reviewing the menu with us and bringing out some rolls. I had a stare down with the rolls, thinking about how good they looked but I wanted to save some room for dinner. Well, the roll won out and wow! Have one. They are fantastic-perfectly warm and buttery with garlic on top. <br><br>I got the Petite Filet, medium rare and it was perfectly cooked and slightly crispy on the outside. The steaks are served on 500 degree plates, which was unique and actually make the steak even better. The steak and sides were sizzling away on the plate for about 5 minutes after it all came out. Now on to the sides. I would say I enjoyed the sides as much as the steak itself, and that's saying a lot because the steak was fantastic. We were a bit overzealous and got 3 sides: the Corn Créme Brûlée, Chef Brian's au Gratin Potatoes, and Roasted Brussels Sprouts. All of them were amazing but the standout was the Corn Créme Brûlée-a sweeter take on creamed corn with the classic crispy crème brûlée crust on top. <br><br>Once the table was cleared and my 20 pounds of leftovers were wrapped up, we got hot scented towels and two small, warm (complimentary) chocolate chip cookies, which was a sweet touch. <br><br>The ambiance is on the romantic side with dim lighting. The room we were in was a little bit tight with the tables very close so it seemed more loud than it should be. Restrooms were single rooms and spotless. <br><br>Overall, great experience and attentive service. I would definitely consider this newbie one of the best steakhouses in Chicago and I will absolutely be back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MMDRJNyb8BLTWUwmlk_Kuw/168s.jpg", "caption": "Petite Filet with the Corn Créme Brûlée in the background-Fantastic!"}]}}, {"review": {"des": "Steak48 is a wonderful addition to the Chicago and the strong steakhouse reputation as one of the top cities to<br>Enjoy a steak dinner. For my birthday every year, my family takes me and we try a new steakhouse. It's a great idea because you get to enjoy new and popular steakhouse around the city just like, Steak48, and have an upscale dinner for your birthday. This was an extra special dinner for my 30th and we had this restaurant selected about 10 months ago- it might have even been the week after my last birthday ha. We had high hopes, and to say the least, they were definitely fulfilled. There were multiple celebrity spottings on this Saturday night as this is clearly one of the favorites for athletes to enjoy the best in the restaurant business when it comes to wine & dine. From the seafood tower and the appetizers with the warm garlic bread buns, on to the sides & Prime Steaks, your experience is left feeling impressed. From the moment you enter the door and see the butcher knives, to the large bar and multi floor restaurant, you enter a higher end steakhouse establishment. <br><br>When I walked in I was welcomed by a good friend Benny who recently joined as a manager. I had a good feeling that with Benny and our awesome waitor, Anthony, that we would be in for an overall tremendous meal, and it was exactly that and more!! Thank you guys for a delivering a memorable bday dinner. It is clear that they both really enjoy working at Steak48 and delivering a superior steakhouse experience. <br><br>Now, on to the food because that's where the 5 Stars truly get what they are worth because the meal was about as good as it gets for a steakhouse. I always enjoy a quality steak, is it my favorite meal- probably not, but I definitely enjoy all the courses and sides. The steak is the star and they do a great job here sizzling the steaks at a blistering 1500 degrees. For starters we enjoyed seafood dishes- crab and ahi tuna, along with the crispy shrimp. I tried the Caesar which was really good too. The sides were all good and you can only choose from 16 of them- I repeat 16 side dish options. You have to salute that amount of sides because everyone enjoys four side dishes with their meal! It was all<br>Good and I wolfed down the 22oz Ribeye which was also cooked perfectly. They brought over an array of desserts for my birthday including the cake pictured, a red velvet cake and also Beignets which were the best I've had. I enjoyed all courses of the meal which shows this restaurant cares a lot about the full meal and delivers from starting with apps to the steaks and finishing with desserts. <br><br>I am not sure if I spelled it out in this review, but go to Steak48 for your next steak dinner, you will not be disappointed! You will walk away wanting to comeback for more.", "pics": null}}, {"review": {"des": "We ventured to River North to eat at Steak 48 after seeing them on Check Please. We were a group of 4 on a Saturday night and were seated right away, despite being late due to holiday parade traffic.<br><br>Our entire evening was delightful. Our server, Susan, self-proclaimed newbie to Steak 48, was professional and awesome. I would go back just to talk with her. Also, it was nice that several people came by to see how we were doing - just like a great steakhouse should be.<br><br>Starting with appetizer/salads, we had poke, crispy shrimp deviled eggs and wedge salads. All delicious! Probably one of the best wedges I've ever eaten.<br><br>Main dishes around the table included the crab cakes, filet with truffle butter and the boys got rib eyes. All exceptional.<br><br>Our sides included the potato gratin, Brussels sprouts, lobster mac and cheese and creamy corn brulee - which is more like a dessert.<br><br>Speaking of, we all split the bread pudding which was more than enough. I feel that we all rolled out of there from being too stuffed! Our drinks were also great - Paloma and some sort of spicy mango drink. Yummy!<br><br>I would go back and would recommend it. Well done Steak 48! (but don't get your steak well done, please)", "pics": null}}, {"review": {"des": "Best dining experience by far. I rarely go out to restaurants that has as many dollar signs as Steak 48. But it's nice to splurge once in a while, especially while on vacation. My dining experience started the moment I walked through the door. We were seated at our table and served bread rolls right away. Our server was so friendly, attentive and new the menu inside and out. The bread rolls were delicious! So so soft and warm, we asked for 3 orders of it. <br><br>The menu had a lot of options to chose from. I went with the small NY Strip. I was a little disappointed that the steak does not come with any sides. You have to buy your sides. I went with the crispy shrimp and au gratin potatoes. The crispy shrimp is a must! Very flavorful, I think I liked it better than my steak. <br><br>The steak came out on very hot plates to keep the meat constantly warm. It was perfectly cooked and had a lot of flavor. I could only finish half of my small NY Strip.", "pics": null}}, {"review": {"des": "I start this by saying I am a huge Chicago steak house person and my usual go to is maple and ash<br><br>I am actually still here at dinner and felt the need to write a review before I left. What an amazing steak house. We sat upstairs with my fiancé family and fell in love with this place. Fillet with burrata. Lamb chop. All brilliant<br><br>Jeremey was our server and he did a phenomenal job. Not only great with the menu but was a pleasure throughout the whole evening. <br><br>I highly recommend this spot", "pics": null}}, {"review": {"des": "Phenomenal all-around experience. For whatever reason, Steak 48 isn't mentioned among the top steakhouses in Chicago, but it emphatically supplants many of the mainstays. There's a raging debate between new and old. This one is obviously new, but it feels more futuristic. Steak 48 provides an atmosphere that tourists will find delightful, young people won't feel patronized in, and the see-and-be-seen crowd will enjoy. That's basically impossible.<br><br>There is attention to detail here. I was given a black napkin to accompany my black pants. I've recently taken to wearing black pants and I've developed a fear of those white fibers flying whenever I sit down at a nice restaurant. The waiter was a true professional. He didn't assume it was our first rodeo because we were young. He spoke to each member of my group in a manner that was tailored on the fly to our experience. It worked really well.<br><br>The food was exceptional. I hope nobody is offended by this, but the steak was overshadowed by the oyster selection and other appetizers. The KC Strip was great but not the best in the city. When I return I will try a large-format cut instead.", "pics": null}}, {"review": {"des": "November 15th is not a great day for me. It's my dad's birthday- but he made his transition a few years ago.   One of his favorite things ever was a great steak dinner, so every day on his birthday,  I treat myself to a fabulous dinner<br><br>This year I chose Steak 48 to celebrate, and by far it was one of the most exceptional dining experiences I've had.  I sat at the bar and the bartender was gracious,  willing to answer questions, and made superb food recommendations.   I started with a few jumbo shrimp, and then had a petite filet and creamed spinach.   Every bite was phenomenal,  and I was so happy with my selections. <br><br>If you're looking for an unbelievably delicious meal with service that is second to none,  this is the place for you.  I can't thank them enough for making a rather difficult day for me enjoyable and memorable.", "pics": null}}, {"review": {"des": "Second visit was a charm!  <br><br>The service improved from my initial visit and I must give this place 5 stars!  From our view on the side, the kitchen is a finely tuned machine.  <br><br>Special thanks to Neal for making my daughter's birthday flow smoothly. <br><br>That truffle butter is more than enough to share. Yes,  try it!!!", "pics": null}}, {"review": {"des": "Really waffled between 3 and 4 stars here.  Came here with a large group-they call themselves a 'boutique steakhouse' which made for a unique atmosphere.  When you first walk in there's butcher knives all over the wall-interesting!  There's lots of private rooms for parties, as well as a a nice covered patio (which we didn't get to enjoy as part of our group, but a few of us did after dinner since it was the first nice day that spring.<br><br>Our servers did a good job of selling the experience-explaining the menu, their principles and history, etc.  The food was mostly ok.  The starters, the shrimp and meatballs, were pretty good, almost too good, as we filled up then realized we had more courses to go!  The shrimp does have a bit of a kick to it.<br><br>I ordered a pomegranate martini, and they're one of the places that leaves the shaker with the leftovers so it was really 2 martinis, which is nice.  The chopped salad was 'meh,' it was very large and kind of drowned in dressing, but nothing else notable.  The salmon, while seasoned well, seemed overcooked and dry.  It seems that poor cooking was a theme for other diners in our party.  The dessert was the best part, but it was way too much after having three courses already.  They could cut the cake portion in half and it would balance better with the amount of ice cream.<br><br>The room we were in was almost too small, we couldn't have fit another seat in the room, so it made things tight.  Also, the decor was a little odd-they had some nice historical photos on the wall, but also a very large picture of a Taylor-Swift lookalike in an evening dress sitting in the drivers seat of a sports car . . . I couldn't figure out quite how that fit it.<br><br>Aside from the salmon, the food was okay for the most part, but it does seem others had more difficulties (including wilted lettuce on the salad).  I'd heard good things, it was a bit disappointing.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/W8kdPWjb3HuinxBnWH4HuQ/348s.jpg", "caption": "Prime Steakhouse meatballs"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/S8Qj2jkKuhl0XCu3rT7awA/168s.jpg", "caption": "Chopped salad"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/S8VqN_ZXSM5CSXup761Ing/168s.jpg", "caption": "Shetland Island salmon"}]}}, {"review": {"des": "What a great steakhouse. Made reservations through open table for a Saturday night, got seated instantly. Our seats were on the second level and we took the nice elevator. The servers were well versed on the menu.  Amazing warm bread with parmesan garlic and butter. The burrata was delicious and creamy with the tomato jam. My filet was butterflied and cooked perfectly. My colleagues also had the KC bone-in and were happy with their choice. The price for the meal was on point. Highly recommend it.", "pics": null}}, {"review": {"des": "The ambiance, decor and service were all what one would expect of an upscale steakhouse in a major metropolis. Unfortunately, so are the prices, oy!<br><br>The best part of the meal was the shrimp appetizer. The cocktail sauce was every bit as good and spicy as that famous place in Indianapolis, St. Elmo's. The shrimp come individually ($8 a pop) but they're chilled, fresh, expertly peeled and --pardon my French-- fuckin' huuuuge! 3 of them were more than plenty for a terrific start.<br><br>The hot bread that came with it had some fancy herbs in it, like oregano or maybe thyme, but I wish they were more buttery or at least butter or olive oil & vinegar came with them. They only come in one size, like a pastry loaf with 8 buns, easily enough for a whole table of people, so 80% of it was wasted on just me, which is a shame. <br><br>My 22lb ribeye ($59) was cooked perfectly and thankfully not as fatty as you get in so-called \"marbled\" ribeyes in lots of places. There was more honest to goodness meat in this one, which is appreciated. It came on a sizzling plate, Ruth Chris style, but with less butter than they use, which agin is better in my view. I'm not sure you can say $60 bones is worth it for any steak, but this came close.<br><br>My glass of Malbec ($12) blended well with the meal, though perhaps a Cabernet would've been a better choice for such a heavy meal. <br><br>The only regret was the loaded baked potato ($13). It wasn't loaded enough, kind of dry. Pick a different side when you go and thank me later.<br><br>I do wish I had room left to try the s'mores in a jar, but nope too full. <br><br>Overall a solid experience if money is no object or you just want to splurge on a fancy meal for a special occasion or you're visiting as a tourist as I was. <br><br>One thing that did disappoint me: I sat on a table by the bar and didn't get a regular server. I'm not sure if my server was a bartender or a hostess or what but she didn't tell me about the specials. I only found out that they existed by overheating a server at a table near me. I wish I had been given that option as I might've opted for a smaller ribeye to save room for dessert. I felt like an undervalued guest just because I was a party of one.", "pics": null}}, {"review": {"des": "Fine Dining at its Finest! The moment you walk in you notice the upscale modern decor which goes along with the upscale ambience. Just walking into the restaurant you know you are about to have one of the best food experiences of your life.  The food and the service is impeccable. The managers and waitstaff are extremely knowledgeable about the menu and what to pair which alcohol drink (wine or champagne) with any item on the menu.  Everything on the menu is done with the highest standard and the presentation is on point.  You cannot go wrong with anything on the menu but here is what I recommend:<br><br>Bread - This is the first thing they bring to the table.  The bread comes out hot half sea salt and half Parmesan.  The bread is warm with a nice outside crunch and a fluffy, light, chewy center.  This wakes up the taste buds nicely.<br><br>Braised Pork Belly - This dish has local honey, sweet Thai chili, sautéed spinach. Wow. The Pork Belly is nice juicy and tender. When you take a bite you get the sweetness of the honey along with a little heat from the Thai chili, mixed with the buttery sauteed garlic spinach, then the tender juiciness of the pork belly which is cooked to perfection. Love the Asian twist to this belly!<br><br>Prime Steakhouse Meatballs - This appetizer is amazing.  It has prime beef - white marble farms pork - Markham veal. You can taste the freshness and the spices of the meatball.  <br><br>Rhode Island Calamari & Shrimp with cherry peppers, buttermilk seasoned flour. The taste of the  Calamari and Shrimp are so fresh I could have sworn they came out of the ocean that day along with the light fried batter which is perfect because the fried batter does not over power the flavor of the calamari and shrimp. You can also dip your goodies in a Louise sauce, cocktail sauce, or a mustard sauce.  The money sauce is that Louise sauce which is like a thousand island sauce.  The Louise sauce complements the Calamari and Shrimp perfectly.<br><br>NY Strip with Black Truffle Sautéed Maine Lobster - This was the best steak I have ever had.  The steak was tender, juicy, melt in your mouth perfect. Then you add another layer of flavor from the black truffle and sauteed Maine Lobster. Talk about a mouth punch to your taste buds! Best steak enough said!<br><br>Bone in Ribeye Farina Style - Once again the steak is cooked perfectly. A ribeye steak is already packed with flavor but you have the bone in with that get ready to take a trip to flavor town! The steak melts in your mouth then you get that runny egg yolk that runs into the steak. Boom Flavor Town!<br><br>Creamy Mac & Cheese (Side) - This is not your Kraft Mac N Cheese. This is your the Mac N Cheese that puts Kraft out of business! This Mac N Cheese has 3 different cheeses that merry well with each other Provel, Parmesan, Tillamook cheddar. From the first bite you can taste the mixture of cheeses then the texture feel from the crunchy top, but the best part is the bottom where you get the nice gooey bottom of all the cheeses combined that soaked into the perfectly cooked noodle.<br><br>Roasted Sweet Potatoes (Side) - Talk about the layers of flavor! This dish is sweet potatoes with a bourbon torched marshmallow.  Every flavor complements each other nicely. The sweet potatoes soaks up the bourbon sauce nicely then you get the torched marshmallow that marries well with the sauce and sweet potatoes. Phenomenal!<br><br>Hope you saved room for dessert! The best dessert in my opinion is the Beignet Tree which comes with a Nutella Ganash and a Vanilla sauce. These lightly fried outside with a pillowly, light, fluffy inside are a perfect closer to the night. Once you take a bite you get the nice texture of the fried dough with the nice sweetness of the powdered sugar, then you add either the Nutella Ganash or the vanilla sauce. You cannot get any better!<br><br>Cookies & Cream Popcorn Sundae - This is your upscale shake! You have hot fudge, vanilla gelato, cookies & cream popcorn. You have to love a real milk shake that is made with real vanilla gelato, hot fudge, and cookies and cream. The thing that makes this shake is the cookies and cream flavored popcorn which adds that nice texture that goes with the cold creaminess of the vanilla gelato and the hot fudge.<br><br>(New) Triple Chocolate Almond Bomb - This Gluten free option was actually amazing! you have the sharp dark chocolate outer shell with creaminess of the chocolate ganache which melts on your tongue, then you add the marshmallow and the almonds for that layer of flavor town along with the amazing texture feel. Its pretty much a high end S'more until you hit the bada bing cherry center.  Oh and don't forget the gold flakes that are sprinkled on top giving that classy look.<br><br>With Steak48 you get what you pay for and more! This is one of my favorite restaurants to go to and definitely my favorite steakhouse. If you want an amazing food experience just stop looking for it and go straight to Steak48 and check off that box in your life!<br><br>BrandonFitFoodie", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/s6btudXUvmjxKB5bJazM1Q/348s.jpg", "caption": "Bone In Ribeye Farina style with Garlic Toast"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qPKT2TfwSoHSahAOzasDCQ/168s.jpg", "caption": "NY Strip - Black Truffle Sautéed Maine Lobster"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FrxZMMnuLno3PqD6mFEaiQ/168s.jpg", "caption": "Creamy Mac & Cheese"}]}}, {"review": {"des": "I had a great experience! From beginning to end, the service was very welcoming. We never felt rushed and our wait staff did a great job explaining the menu and servicing our table. We were celebrating a birthday in my party and they did recognize the celebrant. The crispy shrimp 6ounces was a good beginning to proceed to the rib eye bone in. I loved how they had tafelstern plates that kept the steak warm without burning them as we enjoyed our meats. The Brussels sprouts were a bit too salty but everything else was perfect!", "pics": null}}, {"review": {"des": "We live close to Steak 48 and when the urge hits us, we try to make a reservation. Last evening we were fortunate to get a seat at the bar which was lively and bustling for a Saturday evening . Our server was excellent and responsive as we enjoyed a nice bottle of wine and took in the scenery. We shared the wedge salad which we think is one of the best you will have along with a Shrimp Cocktail which was also one of the best we have had. For dinner a wonderful Filet cooked perfectly and along a loaded baked potato . All in all a very fine dining experience that , in my opinion , is one of the best in the Chicago area. I would highly recommend Steak 48 and we will no double be back soon.", "pics": null}}, {"review": {"des": "Best Dinner Ever. Ever. Ignore The Bad Reviews. Ignore Them. Best SteakHouse In Chicago. Service Amazing! Ambience Amazing! Appetizers Amazing! Steaks And Sides Amazing! We'll Be Back! Worth EVERY Dollar! I Signed Up For YELP, So I Can Leave This Review!  #ignorethebadreviews #eatlikeaking #500degreeplates #amazing #eatherenow", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eP2R0F3PaPbiFJ7_YPYOeg/168s.jpg", "caption": "Smore In A Jar"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9AXTCe8Dxk9bLZGnC-Tnbg/168s.jpg", "caption": "Alaskan Crab Mac N Cheese"}]}}, {"review": {"des": "This was the second time that I have been to Steak 48, this time with my other half. Why is the bread so good here? We obviously started with their famous bread and butter and also tried the Calamari app. It was a good choice, they fry the pepperoncinis with the dish and it's great! We both ordered a steak, bone in, and they were cooked perfectly. We also had truffle butter to top them with. For a side we split the creamed spinach and sautéed corn. Everything was really good. Desert was warm vanilla Carmel cake and it was sinful. I could just eat that all the time! I also really appreciated the wine selection here. Since it was my birthday meal, we splurged on some Martha's Vineyard Cab. Would always recommend this place for any occasion, the first time I came I sat at the bar solo and the meal was just as good, only missing my other half :)", "pics": null}}, {"review": {"des": "I'm giving the food 5 stars the service however wasn't all that great considering it was a Tuesday night.  The steak I ordered was absolutely delicious it tasted good and look even better the cream spinach was gross it had a offal taste to it and it smelled even worse.  The shrimp mac and cheese was really good I've never tasted anything like it I  Recommend when you go there that you get that as a side dish . Our waiter was very nice my problem with her was she hardly came over to our table to see if we needed anything or to refill our drink . The food was good but I am very big on customer service and  satisfaction and that is the reason I probably will not return to this  establishment.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/U5OrtRWUzIRFaIc5VjlppA/348s.jpg", "caption": "Omg absolutely delicious"}]}}, {"review": {"des": "Where do I start? This was truly a five star experience. Steak 48 has quickly acceded to my favorite steakhouse in the city. Douglas who was our sever made this an experience I won't soon forget. From his knowledge of the menu to the few minutes we got to talk baseball. The food was a 10 out of 10. You've got to get the lobster Mac and cheese, the jumbo shrimp to start. The bone in fillet was out of the world, love that it comes out on a 500 degree plate. <br><br>Overall a really enjoyable experience. I'll be coming back soon and making sure all my friends know to check this place out in the near future. Thanks again Douglas for the great experience!", "pics": null}}, {"review": {"des": "If you're black, you will be treated poorly here. I watched as manager used\"dress code\" as an excuse to turn away well dressed black people while white people dressed liked bums were welcomed in. Food is ridiculously expensive and staff is rude.", "pics": null}}, {"review": {"des": "Came to Steak 48 with one of my good friends and we had a phenomenal dining experience. Everything (music, drinks, food, service) was top notch for our evening of catching up, boozing and eating. I highly recommend you give Steak 48 a try. I will definitely be back to eat AND drink at Steak 48.<br><br>Service - 5 stars<br>Our server Broc was awesome. He was funny, personable and gave us the perfect recommendations for drinks and dishes (appetizers and entrees). Count your blessings if you get the chance to sit in his section when you dine at Steak 48.<br><br>Drinks - 5 stars<br>I had 4 Ginger Peach's and I could have had more, but I was feeling the bourbon big time so I stopped myself. This drink was refreshing, the peach purée dulled the taste of bourbon which allowed me to semi-chug my drinks. I have found my go to drink for every visit to Steak 48 in the future.<br><br>Food - 5 stars<br>Everything we had was amazing and my stomach will be utterly content for the next week after that meal.<br>* Braised Pork Belly<br>* Rhode Island Calamari & Shrimp<br>* Heirloom Tomato Salad<br>* Bone-In Filet Mignon (12oz) with Truffle Butter and seared scallops <br>* Filet Mignon (12oz) with Sautéed Blue Cheese and seared scallops <br>* Chef Brian's au Gratin Potatoes<br>* Alaskan King Crab & Rock Shrimp Mac & Cheese<br>* Ultimate Warm Vanilla Caramel Cake", "pics": null}}, {"review": {"des": "Yesterday was my initial visit here. I posted at the bar, which had a pleasant buzz even for a Sunday around the dinner hour. The wines by the glass list was extensive although I decided to order a Belvedere Martini with blue cheese stuffed olives. The Martini glass was perfectly chilled, there were three olives (!), and the martini shaker was presented to me so that I could top up my glass. Shortly after my drink was prepared, out came an order of parmesan-garlic bread. I was almost tempted to ask for this wrapped up to go--it was that good. Foodwise, I opted for the sauteed shrimp. The shrimp were perfectly cooked although I couldn't really discern the chardonnay and paprika that the dish was purported to contain.<br><br>The patrons seated next to me spoke highly of the crab and avocado stack and the crispy shrimp dishes. When I mentioned to the bartender (I believe his name is Mike) that I live nearby, he asked what had taken me so long to venture here, given that Steak 48 has been open for a year now. Even though it took me a little while to make my way over, I am now so glad I did.  Will definitely be back to try some of the offerings from the red meat side of the menu.", "pics": null}}, {"review": {"des": "Probably one of my top dining experiences in Chicago.. this place is SPECIAL. <br>  You'll start your meal with the house bread although tempting, don't dabble! It'll just fill you up unnecessarily however, if you must, try the garlic. We started with the king crab and avocado stack which was just simply perfection. I do suggest trying one of their seafood options because everything looked super delicious and decadent. <br>  For my main course I went with the filet and for sides we went with the creamed spinach and double baked potato with truffles. <br>  We ended the meal with the warm vanilla caramel cake which blew our minds. <br> Awesome ambience, great service, and the best dining experience. Truly. I cannot wait to go back and try more of the menu. You must make a reservation, stat!", "pics": null}}, {"review": {"des": "The top half of my attire fit this environment but not my bottom half unfortunately. It was like party on top, lounge on the bottom. This is a super fancy steakhouse restaurant. I saw groups in there, but it definitely feels more like a date spot with its candle-lit tables and dim lighting.<br><br>Upon entering, you'll see a long wall of butcher knifes on the left. Don't worry! They're dull knives because we all know there will be at least a couple of people touching them...including myself. So you know, it has been tested. The first level was quite large with different dining areas. What I didn't expect was a second level that was equally large and somewhat mirrored the layout of the first level, except the kitchen is downstairs. We were seated on the second level and got to pass by the display of various seafoods. They had shrimps the size of my palm!<br><br>We received a mix of garlic and butter bread to start that were quite delicious. You might be tempted to dominate the entire loaf, but save room for the rest of the meal!<br><br>APPETIZER<br>We ordered Crispy Shrimp that had a sweet Thai chili peppers and garlic aioli. It was flavorful and indeed crispy. <br><br>ENTRÉE<br>The tomahawk steak was the special for the night, which was ordered medium rare plus and enough for two people to share. However, it looked rare. We had to send it back to cook it to medium unfortunately. We were provided extremely hot plates that had a dash of parsley sprinkled on them. They warned us not to touch the plates, and I can see why. I felt the heat radiate from the plate even without leaning in towards it. They also said people, particularly men, have touched the plate before. Hence, the warning. The steak was extremely succulent and tender.<br><br>SIDES<br>We ordered Roasted Brussel Sprouts - the menu actually stated \"get these!\" - and Sautéed Wild Mushrooms. The brussel sprouts weren't very crispy, but they complemented the steak well. The bacon added a good flavor to it. The mushrooms were okay because they were on the bland side.<br><br>The service was impeccable. Our server took time to explain and recommend menu items and was extremely attentive and friendly. He even had a good sense of humor.<br><br>If you're in the mood for an upscale, fancy restaurant, look no further!", "pics": null}}, {"review": {"des": "Great food, great service! We had a table<br>Of 4 and Anthony was our server. He was extremely attentive, went over the menu, and was personable all without being overbearing. Everything was prompt and prepared just the ways we expected. We got a seat near the kitchen which always gives a neat atmosphere in restaurants in my opinion. <br>I'd give recommendations to everything we got. Some of which includes their amazing steaks, crispy shrimp, corn creme brûlée, avocado and crab stack. Even the dessert was great! The caramel cake is sweet but not too sweet has a great touch of Pecan praline and vanilla ice cream. Very enjoyable dinner! Definitely will be returning to this restaurant and won't hesitate to stop by their sister restaurants in other locations!", "pics": null}}, {"review": {"des": "Went there on a Friday night. With my four hour delay at LaGuardia Airport the restaurant was VERY accommodating every time I called to delay my reservation. The decor is fantastic and the food (and our waitress) was fabulous. This place has fantastic food across the board. And here's something really impressive. The next day they called me to ask how I enjoyed the my meal and the restaurant. Quite impressive.<br>Let me get the one little comment out of the way I must mention. This place is big and has many really nice rooms... the room we were in was very loud. I must admit though great atmosphere... it was just loud. Besides that the entire dining experience was spectacular.<br>As far as the food I cannot say enough about how awesome everything was -- probably the best Chilean Sea Bass I've ever had. My wife and my friend had bone in steaks and they were amazing. I would go back in a second.", "pics": null}}, {"review": {"des": "Another Chicago steakhouse. I'm here for it! I love a good steak and couldn't wait to check them out. We tried to walk in at 730 and they were packed, so we got a 845 reservation. We sat at the bar in tables that sit to the side until our table was ready. We could've eaten there, but my date declined for whatever reason. Our servers were pleasant there too. We had drinks and by the time we got to the 2nd drink the table was ready. We were led upstairs by elevator. <br><br>Once upstairs we thought we knew what we wanted, until the waiter seemed irritated with us for not really knowing what we wanted lol. I got the bone in filet med rare/to med, w/crispy shrimp atop. He ordered the rack of lamb chops med well. He got 3 diff sides asparagus, mac & cheese, & creamed corn. Starters were a salad and fried deviled eggs. Deviled eggs came 1st and they were different. Good, but in a weird gooey way, I wouldn't order them again. While waiting They give warm garlic bread too. It took our entrees a brief amount of time to come out. They came on VERY hot plates. <br><br>Temp on my filet was almost rare, the outer part was med rare. Not a major biggie, but I hate when that happens. Filet was also HUGE. I got the regular sized filet. (served small or regular) Asparagus was good, it had a nice flavor & they were tender too. I tasted the lamb chops they were good as well. I didn't try the other sides, but he said they were good.<br><br>Coming here be prepared to pay a car note. 3 drinks were $50. I didnt even see the dinner bill. But the prices were high on the menu. I'd like to come back to try a few more items, but not sure how often I'd get in. I think Gibsons serves better food at a cheaper rate. It was nice to try it out though. Service wasn't anything spectacular, it just sufficed.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LxzdY0O2ei1WFEWFICDvVQ/348s.jpg", "caption": "Rack of lamb chops"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ug0wQ02HTHVQDdDaeGI5pA/168s.jpg", "caption": "Filet w/crispy shrimp on top w/mac & cheese sides"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NHCTvEU-crTFKKl1UMIDWQ/168s.jpg", "caption": "Fried deviled eggs"}]}}, {"review": {"des": "Ugh, I'm so bummed the food wasn't as amazing as my family said it was going to be, and maybe they had an off night, but it was just ok....<br><br>Good things- the shrimp deviled eggs were sooooo delicious, and it was hands down the best thing we ate that night. The ambiance is gorgeous, and really loved the bar area. Would definitely go back to have a drink at the bar and have the deviled eggs. I had the crab for an entree and it was good as well, but nothing spectacular. The scalloped potatoes were also great along with the mushrooms, but it wasn't any better than what you would get at Capital Grill for example.<br><br>Bad things- really hard to hear in the dining room (and no I do not need a hearing aid) and every time my husband or brother put their elbows on the table (yes, I know you are not supposed to do that) the table leaf that makes the whole table round kept dropping into my lap which was really annoying. The steak was not mind blowing and was subpar at best. <br><br>I would maybe try one more time as I wanted to love this place. Just sucks it wasn't as good as I expected.", "pics": null}}, {"review": {"des": "I'm so disappointed in the level of service my party received! It's so much I could say about the entire night that plays in my mind. However, before I review this Resturant I want to go back & allow the Resturant an opportunity to redeem. <br><br>The food was excellent (kudos) to the kitchen! The front of the house was NOT as pleasing.", "pics": null}}, {"review": {"des": "Excellent filet! <br><br>Service 5/5 the wait staff and host were very attentive throughout the entire dining experience, plates were removed and replaced promptly after each course. <br><br>Venue 5/5 great design / modern and dimly lit makes for a romantic setting. They have several seating areas that accommodate groups or more intimate dinners. <br><br>5/5 - good solid steakhouse food. I split the filet mignon and it was a very filling portion in addition to sides. The meat was flavorful and moist just like steak should be. I don't eat red meat often but when I do, I want it to taste like this. <br><br>Order the crispy shrimp for apps / very filling and great if you like shrimp! Well done :)<br><br>Sides creamed corn, wild mushrooms and loaded baked potato all delicious!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/srAinyn5F3BKTL7emzpo1A/348s.jpg", "caption": "Warm bread to start"}]}}, {"review": {"des": "Wow - where did I go wrong???  I was looking forward to a business dinner at Steak 48 and had heard great things...<br><br>Service was awkward and slow - how many empty glasses does it take???  <br><br>The table bread looked amazing!  Unfortunately, it was crusty on the outside and did not taste fresh.<br><br>Apps were shared, deep fried hard boiled eggs, crab and avocado stack, shrimp - nothing was bad, but none of it was good enough to bring me back.<br><br>Sides were also shared - and our awkward waiter put 1 asparagus spear on each side plate.  How strange is that???  Just let us pass the asparagus and if we need more, we will order more.  One lonely asparagus on a side plate is just weird!  Mushrooms had good flavor but were over cooked.  Potatoes were good - but who cares???  <br><br>I had the ahi for my main - probably a bad choice when at a steakhouse to not order a steak!  It was seared but over seasoned and lukewarm.  Two bites and I shared it with everyone else because it wasn't worth eating.<br><br>Maybe a group of 12 was more than they could deal with on a busy Thursday night - but nothing about the experience was impressive.  Very average meal and below average service for Chicago.<br><br>I won't be back - and would not recommend Steak 48 for a group.  Too many great restaurants with awesome service in Chicago to settle for a mediocre steakhouse.", "pics": null}}, {"review": {"des": "We had a reservation for thanksgiving which is definitely needed. The service was great. Our waiter was very patient with us as we kept changing our minds on what we wanted. The complimentary bread was delicious. It was nice, soft, and fluffy. It even came with a lot in one pan. Sadly that was the only pan you get. We ordered a lot but this was special for thanksgiving. The calamari and avocado stack were delicious and great appetizers. The calamari was a little spicy but it was very good that I kept eating. They were my favorite appetizers. The braised pork belly was just normal; nothing special. The Mac n cheese was very creamy and also a little spicy. I love a creamy Mac n cheese. The steak we got was delicious. It was easy to cut and crispy just a little which I prefer. I definitely recommend the red velvet bread pudding. It was a perfect hot and cold, and the bread pudding was so soft. It melted in my mouth. For a special occasion, this was perfect even though it was quite expensive.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hY4d6fw-bH18iKM7UcmrBQ/348s.jpg", "caption": "Fried devil eggs $8/$11"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Wbfz6BadCPkjNv412N8PkQ/168s.jpg", "caption": "Crab cake $18"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pTgKnoE22E7xd2X4MJLClg/168s.jpg", "caption": "Braised pork belly $13"}]}}, {"review": {"des": "I have been to Steak48 a few times now and this has got to be my favorite steak house in chicago. The vibe here is amazing from start to finish. We were seated by the bar area and we loved the diversity of race and age ranges as we looked around.<br><br>Our server was excellent with recommendations. We had the sea food tower as an appetizer and for my entree I went with the filet mignon topped with Lobster. AMAZInG!!! Don't forget the vanilla  caramel cake for dessert!<br><br>I've also been here for their private event space upstairs. The lighting is a little dark, but a great size for a big group.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ok1ei7lndveOyo2S8Rokdw/348s.jpg", "caption": "Corn Creme Brûlée"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gESWlGe0ecG26dIMZ4_6cw/168s.jpg", "caption": "Ginger Peach Cocktail"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_qWfpeMLOx4S9KFRGAzRqQ/168s.jpg", "caption": "Beignet dessert tree (Small)"}]}}, {"review": {"des": "Had a absolutely amazing 20th anniversary experience at this restaurant I was recommended to patronize this restaurant by several different people and I am so glad that I did  inbox the restaurant because I was inquiring about different options far as seating and celebration options <br>Someone did respond in about 1 day and they were able to secure me one out of the four  private glass-enclosed booths within the restaurant itself <br>what the wonderful view of the kitchen staff preparing our meals<br><br>My husband went with the 16 oz Ribeyes I went with the  avocados and king crab appetizer,  scallops as my main entree and we split side dishes of mashed potatoes wild  mushrooms a type of Japanese pepper also our  waiter brought out a wonderful red velvet bread pudding which was absolutely orgasmic<br>Make sure you get the fresh bread rolls<br><br>We were blessed to have a waiter name Z who absolutely exemplifies wonderful customer service detail oriented knows the menu back and forth wonderful recommendations so attentive even gave us a tour of the restaurant upstairs gave us a special anniversary dessert he was absolutely amazing and I love the personalized touch even my husband who does not impress easily was wowed by the service and I will recommend to friends who won a fine dining experience to come thank you so much steak 48", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Dl1qtoYm-LvSEbX85FczXw/348s.jpg", "caption": "Blood orange martini"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kyrM9LcVAJb0rCn1-yly5A/168s.jpg", "caption": "King crab avocado"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wpO2Y6obH2G-BTR8MkYYkQ/168s.jpg", "caption": "Rolls"}]}}, {"review": {"des": "OKAY YUM<br>Party of 5 made reservations for 8:30pm on a Sunday night, but our plans changed a bit and we were able to get to the restaurant around 7:30pm. The reallyyyy nice hostesses seated us right away (!!) at a table right by the kitchen. I had the superfood salad (very fresh, dressing excellent) and everyone else ordered different steaks with rave reviews. We also ordered a a few sides: mushrooms, baked potato, and corn (corn side was life changing). Because dessert is essential :) we ordered some and they gave my boyfriend \"ultimate warm vanilla caramel cake\" on the house for his birthday (which we didn't expect so that was a huge plus). All of the above plus a couple cocktails came out to $400+ so would only recommend for special occasions or if you're only picking up your own tab, but even then, this place is an amazing restaurant - must try!", "pics": null}}, {"review": {"des": "Yes, I came to a steak house and didn't order steak. However, I recommend the twin lobster tails and the king crab legs--both dishes are really good also the rack of lamp was good too. Ordered the whipped potatoes, roasted sweet potatoes, corn creme brûlée and sugar snap peas and didn't care for any of it. The house bread is really good!", "pics": null}}, {"review": {"des": "In Chicago for a long weekend.  Had never been to Steak 48 but read the fantastic reviews and decided to give it a try.   Mere words cannot describe the dining experience!   Started out with a shrimp cocktail and the shrimp were tasty and looked like baby lobsters!    They were huge!    Shared a bottle of Pinto Grigio with my date and then shared the pan roasted Salmon with sautéed spinach.    Great atmosphere.   Great service.    Will<br>Return Again when back in Chi Town.", "pics": null}}, {"review": {"des": "Steak 48 is my new favorite steak house in Chicago.  It's gorgeous, the food is fantastic, and the service is great.  <br><br>The steak was seasoned and cooked perfectly.  I would like to say that it's obvious for the steak to be good at a steak restaurant, but sadly I think we all know that's not the case.  The sugar snap peas were delicious, I tried some of the double baked truffle potato and it was wonderful.  I think I could have the king crab and avocado stack as a meal, not that it's huge, it's just the right size.  <br><br>The dining rooms and bar decor are a great balance of warm and dark wood with bright and open from one space to the next.  This is a great place for a date night, celebration, or any random Tuesday you feel like a great meal in pretty place.", "pics": null}}, {"review": {"des": "This place is awesome. The ambience was great. Romantic mood setting. Lights dimmed. Service was impeccable. I did not have to look for my waiter one time. Food was DELICIOUS. I had the 12 oz and my boyfriend had 16oz and they were cooked to perfection. Juicy and tender. The experience was very personable. My boyfriend got a happy birthday card when we arrived and we received a phone call next day to make sure their service met our needs. Never svoerienced anything like that before. I will definitely be returning", "pics": null}}, {"review": {"des": "Seriously ridiculous! Melt in your mouth... hot... seriously perfect sizziling steak w best flavor ever! Service from Douglas was top of class! .  Seek him out.  Start with the seafood which is refreshingly perfect. Group loved crab claws- shrimp was firm - zesty and off chart and oyster icy cold w great sauces. Salad - chopped was exceptional .  And main course steak ...steak and wait for it....then there was steak.  No place better.  Top it off w lobster.  Recommend share - so you can try more . Thats it! Drop the mike!!!!!! Done baby! Woooosh", "pics": null}}, {"review": {"des": "Great atmosphere, great food, and great service from Rachel. My gf and I dined on a Friday to a lively bar scene. Judging from all the seemingly single women posted at the bar, clearly, this is the place to be if you're looking for a man. We sat in the area abutting the bar, so we were able to take it all in.<br>While checking out the scene, we dined on some amazing food; bone-in ribeye, the white fish special, double baked potato with truffles, creamed spinach, and vanilla caramel cake. The drinks were also good and strong, 48 Manhattan and Delightfully spicy...refreshing, spicy, and delish.", "pics": null}}, {"review": {"des": "If you are looking for a new steak joint that can play in the same sandbox with all the Chicago chop houses then call steak48 and reserve a table for tourney t evening out. <br>We decided to give this place a try this past Saturday. Our experience was amazing and almost flawless (will explain below) but considering the place been open for only 7 months it's getting a five star rating from us hands down. <br>We called to make reservations on Friday and the hostess that answered the phone took her time and didn't rush which is unusual. <br>Our reservation was for 7:30p and we showed up around 7p. Figured we check in and get a drink at the bar. Almost immediately one of the three ladies at the hostess table checked us in and we were escorted to our table. We were very impressed knowing that there were no more reservations between 6 and 10p and the place was packed. Got a beautiful corner table right by the window as requested. Mr. Erik Olson was our waiter and he did an amazing job taking care of us. <br>We started with a bottle of Pinot noir and based on a small conversation we had while the wine was being open he recommended a decanter and within minutes had the wine breath in it. <br>The menu at steak48 is not at all limited and in fact they offer off the menu items like the butchers cut wagyu steak which we ended up ordering. I was little surprise that they don't present the off the menu items in some cleaver way to promote them. Both the wagyu steak and the filet mignon were prepared as ordered and came out on a super hot plate which we were told was at 500 Fahrenheit. Caution HOT!!<br>The side orders of wild sauté mushrooms and the au gratin potatoes were great. The order of corn didn't hit our taste buds just right but Once again Erik came to the rescue and replaced the side we didn't like with another side. <br>We ran into one other issue during our dining experience which was a sticky seat. Part of the seat at our table was covered in what I think was glue from a large sticker that was peeled off the seat and some of the glue was still left on the seat. Mr. Olson tried to address it right away but he couldn't get it off with damp rag so we shifted to the other side of the table and the sticky seat was no longer a problem. One advise to management is to keep checking the cleanliness of the restaurant especially the seating area. <br>We ended the night with desert. Red velvet cake and the bread pudding topped with ice cream and a side of heavy whipped cream were all delicious and generous in size. <br><br>Overall this is great new spot for dinner regardless of the occasion. Great location, beautiful decor, friendly and top notch service staff and delicious steaks. Plus unlike many nearby restaurants steak48 has figured how to fill all the tables on a busy weekend night without overbooking.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PgUw6AEUiQtkQuZLET_ulQ/348s.jpg", "caption": "Great selection of wines"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Mc7BrTpGA1DInFK0wjGmlQ/168s.jpg", "caption": "Butchers Cut Domestic Wagyu Filet*"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QwRk-I_KtJ4Iq0GYPdO6pw/168s.jpg", "caption": "Filet Mignon*, Sautéed Wild Mushrooms, Corn Créme Brûlée"}]}}, {"review": {"des": "Simply Put the Best of the Best........ <br>The setting is beautifully laid out... Two floors where no two dining rooms are the same.... The music was great, musical selections range from county to 90's hip hop....... the lively bar scene is great for people watching.<br><br>Dinner starts off with some really good bread (Parmesan and sea salt) then we are met with an incredible server (Marcus) who tells us about the extensive wine list, then perfectly guides us through the rather large menu, we order some great wine, got some really good crispy shrimp and Crab stacker and we're off to an amazing experience.<br><br>Me and the husband get I believe the KC strip as well as a butchers cut and dig in.The food @Steak 48 is amazing, it's so freaking good.We are so stuffed we didn't save any room for dessert . <br><br>With an ambiance that's amazing, servers like Marcus, Food that makes your mouth water, other steakhouses in Chicago have been passed by by this newcomer.", "pics": null}}, {"review": {"des": "They say that a great restaurant is 50% food and 50% service and Steak 48 is a perfect example. Fantastic food and unbelievable service<br>Thank you to Douglas and Blayder for your truly personal service was really appreciated <br>For our one night in Chicago we couldn't have enjoyed anymore", "pics": null}}, {"review": {"des": "By far, this is probably one of the best steakhouse I've dined in. I ordered the bone in filet (12 oz) and it was well cooked to medium rare. The tenderness and internal temperature was perfection. We ordered a few deserts and they were all amazing. But my favorite was the caramel cake!!", "pics": null}}, {"review": {"des": "Best steak house in town!  Timing of service, knowledge of menus and quality of ingredients were best in class!  Ambiance was rustic elegance with a flair for detail.", "pics": null}}, {"review": {"des": "I was in Chicago to celebrate my birthday with friends, and my husband found this wonderful steak house! Steak 48 !!!! I tell you, I have eaten at Fleming's, Mastros (Beverly Hills), and hands down, the customer service I received from my server \"Crystal\" was the absolute best!!! She was always available to assist with questions and she offered suggestions. Crystal was excellent, as well as all the supporting staff, and it was an absolute magical experience. Highly recommend Steak 48 and Crystal as your server. P.S. the steak and Chilean sea bass was amazing as was the lobster Mac and cheese!!!", "pics": null}}, {"review": {"des": "We dined there two nights ago. You have to book a reservation a few weeks in advance because bookings fill up very quickly. Upon entering the restaurant I saw why the reservations fill up so fast. The establishment is beautiful. There were a lot of people seated and others waiting to be seated. Since we had a reservation we were directed to our table right after arriving. They seated us at a beautiful table near the kitchen and seafood bar. Although the table was near the kitchen it was not noisy at all. It actually added to the already established upbeat atmosphere. Our server Rachel was amazing. <br><br>      For starters we ordered the the chef's PB & J and for cocktails we had the Ginger cocktail. For dinner we ordered the Prime Rib-eye 22 medium-well ounce steak with sweet potatoes and creme brulee. The steak was fantastic and so was everything else. I would most definitely return.", "pics": null}}, {"review": {"des": "Simply wonderful experience! My wife and our two children joined us for an early dinner at Steak 48 last Friday. The service (server Daniel) was exceptional, food was beyond our expectations and the \"Beignets Tree\" finished it off perfectly. Our children (and the kids within us) absolutely loved the presentation and they tasted even better. I got the Bone-In KC Strip and we all shared a few sides. our favorite was crime brûlée creamed corn, wow that was amazing! Several tables around us commented that they wanted to join our table when they saw the tree come out, definitely a statement piece that we will not forget. Would definitely come back to Steak 48 for our next visit to Chicago.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kU-4AtNxvXwVxRP5OtK_bw/348s.jpg", "caption": "Last one!!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/e4Dyg1yim4PnwRwppTO4dA/168s.jpg", "caption": "Bone-In KC Strip*"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qZ4CqDsz6Z81eEeCpzOJnA/168s.jpg", "caption": "Beignets Tree"}]}}, {"review": {"des": "Alright right CHICAGO and its Tourist. If you are looking for GREAT food and drinks, this is your spot. I have visited this restaurant twice already first with some good friends ( The men night out) and then with my gorgeous and wonderful wife. Both visit were unique but great. I say unique because my first visit I ate meat, my second I was a vegetarian. So I ate Steak my first visit and Salmon my second. <br><br>Now the Steak on my first visit was truly tasty, juicy and melted in my mouth. Perfectly seasoned with Sea Salt and Peper, no need for any steak sauce, perfectly seasoned for the pallet. Now my second visit with the Salmon was excellent. No fishy smell or taste, I have to be honest, I almost ordered another dinner; which would have been for later that night ...wink wink! <br><br>All the sides ordered on both visits made your  mouth water because the aroma was just breathtaking. I give this place 5 Stars for Service, delicious food and ambiance!", "pics": null}}, {"review": {"des": "Amazing food. Incredible service. Sexy atmosphere. This place has it all. I literally savored every bite. Servers were attentive but not intrusive. Make a reservation because this is the new hot spot!", "pics": null}}, {"review": {"des": "I didn't know much about Steak48 before my friend booked the reservation, and I was blown away.  One of the best Chicago steakhouses. We ordered their martinis at the bar and was promptly seated shortly after. We had one of the best 4 top tables for just 2 of us. We ordered the chilled Alaskan king crab, ny strip, filet, Brussels sprouts and the lyonnaise potatoes. I would recommend any of the above.  They comped a vanilla cake for my birthday and it was absolutely delicious. The service was amazing- sit in Douglas's section if possible. He was very prompt w a delightful attitude. I would go back in a heart beat!!", "pics": null}}, {"review": {"des": "Came here for the besties's 35th birthday after reading the reviews. I waited a couple days to give my review for this place because I couldn't decide between 2 or 3 stars. I wanted to like this restaurant. The decor and ambiance is gorgeous. The patio seating...beautiful. However, I was underwhelmed. I ordered the wedge salad....which was delicious...and the boned-in Ribeye, cooked medium. It was bland. I mean bland. I was severely disappointed that such a beautiful piece of meat tasted like nothing. Bestie had the same. Said hers was in desperate need of salt. Another friend got the meatloaf...said hers was extra salty. Another person ordered the mac n cheese with bacon added...was disappointed as well. <br><br>The food was very disappointing overall and unfortunately so was the service. Even though most of us did not finish our food, it was not addressed by the staff. The people that had drinks had to flag the waitress for refills. She also forgot a side of Mac n cheese for another person at the table. They took forever to bring the check and then apparently didn't know how to split the check 6 ways. It was a baffling experience that 3 employees were hovered around the machine trying to figure this out. I'm not sure if it was a machine issue or human issue but it was clearly some type of issue. Even the valet service was lacking. <br><br>I decided on 3 stars because of the ambiance and the subtle attempts to try to make the evening special for bestie. They brought her a card from the staff. Though the staff member who delivered randomly came to my seat and told me happy birthday. I kindly pointed out the true birthday girl. The waitress provided a chocolate cake to the person whose ordered she messed up and the staff did a good job with surprising bestie with her cake I bought. <br><br>With that being said, the inconsistencies were a bit too much for me so I probably won't be back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7L-9oU0w8j6-nQ1khEeOLA/348s.jpg", "caption": "Steak Knife BLT Wedge"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CzaSJ5VwStj1A9MffuZbnw/168s.jpg", "caption": "Oysters"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4U-cspNbk7fQ8cPhoIG6OA/168s.jpg", "caption": "Shishito Peppers"}]}}, {"review": {"des": "Had dinner here for my birthday Sunday and I was very disappointed. I ordered filet medium rare and got it well done. Was so hungry so my disappointment was at a high, plus I had been wanting to try this place for such a long time. The waiter saw and brought me a new steak but by then my husband finished his food. It would have been nice if he left me something to eat or brought me potatoes or something instead of taking my plate and watching my husband eat for 15 minutes until mine was finished. And to top it off it was probably the saltiest steak and asparagus I have ever had.", "pics": null}}, {"review": {"des": "Recommended by a colleague and I was very impressed.  The servers were very accommodating.  The food was excellent.  I decided to go all out and asked for their best filet mignon cuts, and exceeded my expectations.<br><br>Please note that this restaurant is pricey, but I would go back here for personal celebrations with small and close-knit groups of friends, anniversaries, dates, etc.  Quality and price go hand in hand with this restaurant, so it gets a 5 star from me.", "pics": null}}, {"review": {"des": "We celebrated a birthday tonight at the gorgeous Steak 48. Amazing!<br><br>The rooms are beautiful with many seating options. Great tables and booths in the bar area allow super people watching. A smaller room off to the side is a bit more quiet. The tables near the open kitchen are exciting with one special semi-private area that feels very exclusive.  And don't forget the upstairs outdoor patio. <br><br>We sat in the small dining room connected to the bar area. It was very spacious with exciting artwork adorning the walls. Since it was a bit elevated it provided a great view of the master bartenders. <br><br>Steak 48 offers sincere hospitality from the valet, hostesses, managers and beyond. This big beautiful room felt cozy and inviting. <br><br>We ordered salads, steak, sea bass and several sides. Everything was fresh and delicious. The menu is diverse with an incredible raw bar. Then there are the desserts. Oh my gosh - unbelievable. <br><br>Another sweet moment was delivered by the hostess by way of a hand written birthday wish from Steak 48. Very nice touch!!<br><br>I can't wait to return to try a different entree and a delicious dessert!<br><br>Street parking is available but not abundant. Valet is an easy option as well.", "pics": null}}, {"review": {"des": "Ok. So the place is beautiful!  Very modern and chic with a little bit of a classic steak house feel.  The pork belly was to die for!  Steaks were also great. They usually are when it comes to the top tier places. So what I normally look at is cleanliness and service. <br><br>They're still new so everything is super clean. Restrooms were spotless. Although, one downside-- there's only one men's room upstairs. While the women's restroom has 4-5 stalls (each stall with its own sink!) Turn and burn fellas! <br><br>As for the service, our server knew what he was talking about. Very responsive and knowledgeable. Knew what time to bring each course and was really friendly and wasn't snobby. <br><br>The bussers could use a bit more training though. A lot of then seem fairly new to the industry.  Somewhat younger than the other top tier steak houses. I literally had an empty dinner plate in front of me for more than 20 minutes. He passed by several times without picking it up. That's a pet peeve of mine. Also, I was another busser put up 2 table settings of a table of 4 thinking there was only two people dining. Even though there were coats/purses on all the seats.  Might seem a bit picky, but it's really not. In comparison to the others, they really need to train them more. <br><br>Other than that, it was a great experience. Side note: upstairs mural-- one is Dennis Farina. Who is the guy next to him???", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jDxWVY44GLlO4DFP4aZC-A/348s.jpg", "caption": "Braised pork belly!"}]}}, {"review": {"des": "We went to Steak 48 to celebrate our anniversary and everything about it was phenomenal.<br><br>The food was delicious, the service was on point, and the ambiance was perfect for our special day. We had a reservation for 630pm, but got there super early, and it being the weekend after Valentine's Day, we were skeptical that they would seat us early, but they did. <br><br>We ordered the crispy shrimp and the server brought out their signature rolls, which complemented the shrimp perfectly. I had the ny strip steak and ordered it medium rare since their entrees are served on 500 degree plates, I knew I would have another opportunity to continue to cook my meat. My fiancé ordered the Kanas strip steak and his was cooked perfectly. We had the asparagus fries and the potatoes au gratin and they were amazing! Absolutely everything about this meal was exceptional. <br><br>I have tried all the big steakhouses in Chicago, and Steak 48 has surpasses all of them! I look forward to going back soon and sharing our great experience with all of our friends.<br><br>Thank you to all the staff for making this anniversary an unforgettable one.", "pics": null}}, {"review": {"des": "Food is good and service is great...But the desserts...the desserts are heavenly good!", "pics": null}}, {"review": {"des": "Had the best night at Steak 48 celebrating our 10th wedding anniversary.  We got seated where the action was... I got to see the chefs do their thing while waiting for our food.  Our servers Tony and Kristal gave us great recommendations and service.    We started with crispy shrimp and oysters.  I ordered the bone in ribeye with black truffle and lobster and it did not disappoint!  My husband had the the delicious scallops.  For our sides we shared the fries and brussel sprouts with bacon .  It was very sweet of them to give us a free for dessert because it was our anniversary.  I also liked that they called us a couple of days later to make sure we enjoyed our experience.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/np11YHS-Q5OXKtE0IgHvVQ/348s.jpg", "caption": "Very Chocolate Cake"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KBL6HnSEPaxgHbFh6O4CZw/168s.jpg", "caption": "Bone-In Ribeye with Black Truffle Sautéed Maine Lobster"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4tcyXqndQC_84F1MhuFcnw/168s.jpg", "caption": "New Bedford Sea Scallops"}]}}, {"review": {"des": "This is absolutely top notch in Chicago, a city full of all star steakhouses. Amazing meat quality and impeccable preparation. Worth the top 10 ranking.", "pics": null}}, {"review": {"des": "Amazing from beginning to end. Host staff, server, support staff, food and drink were perfect. Our server Kama, was very personable, knowledgeable but not intrusive. Timed our meal out perfectly and gave great recommendations. The food starting with the steak tartare, wedge salad, ahi tuna and scallop entrees were perfect. And to finish it off was the red velvet bread pudding. Could be the best dessert we've ever had. His wine and drink recommendations were great too!  Can't wait to go back!", "pics": null}}, {"review": {"des": "Best meal and service ever... from conformation call 2 hours prior to reservation up to the follow up call I got the next day. Hands down the best dining experience ever. We had a table right by the open kitchen. Service is impeccable from start to finish. Our server Michael R. was very attentive and fast. We had some east and west coast oysters as well as deviled eggs which had fried shrimp on top. The 40oz wagyu tomahawk steak just made it even better. Soft like butter and perfectly cooked this meal is the best my wife and I had anywhere. The Chefs Au gratin are also amazing. Hard to believe but the plates are heated to nearly 500f which i really liked as the meat stayed warm! Also the Atomic Horseradish is one of a kind!<br><br>After all was done we enjoyed the baked goods with some Nutella and Vanilla Whig was a great finish to an amazing dinner!<br><br>We will be back hopefully soon. Would recommend Steak48 to everybody.", "pics": null}}, {"review": {"des": "I was in Chicago last week for a professional conference and a friend/colleague and I planned ahead and purchased tickets for Hamilton. We decided to start the evening with dinner at Steak 48. The food was fabulous from start to finish. Most importantly, Devin, our server, enhanced our experience. I was debating between scallops and crab cakes so Devin offered to do both. Both were scrumptious (I'm from Boston so I know great seafood.) and my companion had a petite filet, which she thoroughly enjoyed. Devin was sensitive to our time restraints and brought out a dessert that was flawless and delicious. The food alone deserved 4.5 stars. Devin deserved 5.", "pics": null}}, {"review": {"des": "This restaurant is amazing! I've been coming here for business for the last 20 years and just went to this restaurant last night for the first time and it was spectacular! The main dishes and cocktails and desserts do not disappoint. Our waitress was phenomenal and her name was Heather although I think she is transferring to another steak 48 in Scottsdale Arizona. Will try to make it back to this restaurant anytime I'm back in Chicago. Can't wait!", "pics": null}}, {"review": {"des": "Wow what a true Chicago steakhouse fantastic dining experience. Glad I wasn't paying the bill but.. we came with a group of about 20 & it was an awesome experience. <br><br>The wine was phenomenal. The food exquisite. The service fantastic. I had the lamb chop which was a large awesome tasting portion of 8 chops. I was going to have a filet but was talked into the chops by the wAiter & glad I did. They were awesome. <br><br>I've been to many of the top steakhouses in the city as well as the burbs & this ranks right up there in top 3. <br><br>Enjoy", "pics": null}}, {"review": {"des": "Very good experience, steak, wine and all other sides & seafood were perfectly cook, service was perfect too.", "pics": null}}, {"review": {"des": "I dined during a private soft opening and was thoroughly impressed with Steak 48. Our server was awesome, I wish I remembered her name to pass on the positive feedback. She took the time to explain the menu and highlighted a few recommendations.<br><br>We started with Garlic Rolls, Crab Cakes and Crispy Thai Shrimp. The bread was brought out straight from the oven, buttery and pillow soft. The Crab Cakes were breaded on the exterior, but had very little mixed throughout the cake. ..a good thing of course. The star of the first course was the Crispy Shrimp. I suspect they use sesame oil, but couldn't identify what was used to take these to the next level. Definitely order them and let me know if you can figure it out.<br><br>I ordered the Surf n' Turf Ribeye with King Crab as an entree. My steak was a perfect medium rare. The crab was sweet and not overcooked. One of the better steaks in Chicago and not a surprise because the original family behind Maestro's owns Steak 48.<br><br>The dessert menu was so enticing I ordered two, lol. The Red Velvet Bread Pudding and the Ultimate Warm Vanilla Caramel Cake. What's not to love? Both were sinfully good and worth indulging in caloric bliss. I still prefer steaks on a charcoal grill, but Steak 48 is the next best thing. Add this to your bookmarks and stop in the next time you're feeling carnivorous.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Hhfj2-iKPrsEY9f7OpPUAA/348s.jpg", "caption": "Surf n' Turf - Wet Aged Bone-in Ribeye, King Crab Cluster"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yycE_9wbgGJRtwBM1sSWDw/168s.jpg", "caption": "Surf n' Turf - Wet Aged Bone-in Ribeye, King Crab Cluster"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fa-uysNM_d9rEUl9xjz__Q/168s.jpg", "caption": "Bone-in Kansas City Strip"}]}}, {"review": {"des": "I really had high hopes for this place. Came here for my birthday celebration with a few friends.  I love the decor but my food was only okay.  My steak was so burnt and dry I asked for well done but it came out burnt. But the sides are good. The cream spinach is awesome omg. I would recommend this place", "pics": null}}, {"review": {"des": "We had a fantastic table looking right into the kitchen, separated only by a floor-to-ceiling glass wall. The avocado and crab appetizer was flavorful. The bone-in steaks are amazing and served so hot that you have to be very careful handling the plate. Service was great and the ambiance very modern", "pics": null}}, {"review": {"des": "Brother (big steakhouse fan) was in town without his wife and daughter (not steakhouse fans), so boyfriend and I thought it would be nice to take him to Steak 48 on their opening weekend. <br><br>I'm patting myself on the back for a great pick! <br><br>The guys loved the bone in ribeye and NY strip! They loved the char, seasoning, and perfect temperature. <br><br>This is a real steak place. No dainty slices of cold meat on a plate (GT Prime), its large slabs of meat on a sizzling plate for real carnivores. <br><br>We also had great King Crab and great desserts, so everyone was super happy. Hip-pity, hop-pity all around. <br><br>Service was phenomenal, space is beautiful. <br><br>The only negative I have is I think some of the sides could be larger. They really only serve one hungry person. I did like that there were so many sides to choose from, just wish they were larger to share with the table.  <br><br>Overall, we loved it and will be back very soon since it is literally a block from home.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vExj1IOQN9iO_lDkRh0Tsg/168s.jpg", "caption": "Hot fudge cookies & cream sundae"}]}}, {"review": {"des": "Steak 48 is from the team that used to own Mastro's Steakhouse. The chef is Brian Key, who previously worked at Gibson's.<br><br>It's a very large restaurant, on two floors with a huge bar. Some of the rooms can get quite loud, so if you don't want that, ask to sit in a smaller room. There are three glassed in tables back by the kitchen that are fantastic.<br><br>The music soundtrack is excellent, with upbeat rock mostly from the 70s and 80s.<br><br>We started with the shrimp cocktail, which is sold by the piece; it came with cocktail sauce and mustard sauce. We also tried the crab and avocado stack, which was made more interesting by a layer of crispy wonton.<br><br>On a second visit we had the PB&J pate appetizer and the crispy shrimp (which is almost identical to Bang Bang Shrimp at Bonefish Grill). Both were excellent and were, in my view, the best appetizer choices.<br><br>Caesar salad is traditional, and definitely has anchovies blended into the dressing. The only non-traditional element is a poached egg, which we skipped.<br><br>The wedge salad isn't exactly a wedge, it's the whole heart of a head of iceberg lettuce.<br><br>Steaks are cooked in a 1500 degree broiler and served on 500 degree plates. Do not touch.<br><br>My bone-in small filet mignon was nicely seasoned, but cooked beyond the requested medium, and the hot plate added to that. My companion's NY strip was a much better choice, perfectly cooked to the requested medium rare, and was actually as tender as the filet and of course much more flavorful. It was the best steak I've gotten at a Chicago steakhouse. Even though it was also the \"small\" it was a generous 12 ounces, with no wasted fat to trim off.<br><br>For sides we had the mac and cheese, which was fairly light, and the creamed spinach which was nicely smokey.<br><br>On a second visit we had the asparagus fries and the Brussels sprouts, neither of which seemed remarkable. The corn creme brulee was interesting, but is very, very sweet, more a dessert than a side.<br><br>The crispy banana split was an interesting variation on a classic, with salted caramel ice cream, luxardo flavored whipped cream, and corn flake crusted bananas.<br><br>I would rate the food as good, but not exceptional, except for that NY strip. If you're looking for a great steak, that's the reason to come.<br><br>The wine list has a fairly high mark up, especially on the prestige bottles, but the wines by the glass are generous pours, so they aren't quite as expensive as they appear.<br> <br>Service was incredible, especially considering the place had been open four days. It's the reason for the five star review. It's the best service I've experienced at a Chicago steakhouse by far. The bus persons were measuring the distance from the edge of the table to the silverware as they set the tables, and when clearing plates they asked how we enjoyed each course. <br><br>Our server, Nadiyah, was extremely knowledgeable and personable, and even took time out to give us a tour of the restaurant. Kudos to management for assembling such an amazing staff so quickly.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-EEyGvmxzmZ-0RExUHRLFw/348s.jpg", "caption": "Creamed spinach"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Rzxl58UXzF4obo-bjp9jRw/168s.jpg", "caption": "Mac and cheese"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6_faRdCVZzYssRpH8Iip-Q/168s.jpg", "caption": "Small NY Strip"}]}}, {"review": {"des": "We came here for our second time for our anniversary. The ahi tuna appetizer was one of the best dishes we have ever tasted. My steak was excellent and the butter cake was a great way to end the night. Service was ok, but would definitely come back for the food.", "pics": null}}, {"review": {"des": "Steak 48 is located in the heart of River North, has an exceptional staff, and a classic yet innovative menu. <br><br>I made reservations a few days in advance since it was opening weekend, it was easy enough to find an opening for 7:45 and they even called to confirm the reservations. We started off with cocktails,I had the blackberry mint and my husband had an old fashioned with a walnut twist.  <br><br>Our server, Wayne, was absolutely great and made our experience even more enjoyable. He made a few recommendations and arranged for a special treat for my birthday.<br><br>We ordered the Wagyu NY Strip, filet mignon, creamy mac n' cheese and the potatoes au gratin. The Waygu is a must! It is ridiculously flavorful and tender.  Skip the potatoes and double down on the mac n' cheese instead!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xsD5kGu4EecoLbQt2VRANw/348s.jpg", "caption": "Popcorn sundae"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/y8sqw8XfP1JWJDRqsUYdNQ/168s.jpg", "caption": "Garlic rolls"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IomsTy5YVsTmSKBjFloZuw/168s.jpg", "caption": "Blackberry Mint"}]}}, {"review": {"des": "Girls weekend in Chicago started the best way it could have. At steak 48!!!!<br><br>We had reservations but ended it finding a table at the bar. <br>We started off we cocktails. I got a lemon martini and my bff got some pineapple cocktail with tequila both were perfect with just the right amount of alcohol. <br>We had spicy shrimp and crab cocktail for appetizers. Both were delicious. <br>I ordered the crabcake mac n cheese and Brussels sprouts while my friend ordered the zucchini straws and short rib. Food was great. Even with the crowd we never felt rushed. This was one of my absolute favorite meals!!!! <br>We ended the night with the caramel cake. Next time I'm going to try the red velvet bread pudding. If you are looking for somewhere to eat in Chicago go!!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HwSdMy-fm9WhloBoLdtBew/348s.jpg", "caption": "Lemon martini."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/739s1JCieaL7OZiWwavupw/168s.jpg", "caption": "Shrimp appetizer"}]}}, {"review": {"des": "Great Anniversary Dinner!<br><br>I don't write many reviews but when something is great people should know.<br><br>Being from Chicago we get spoiled by all the great steakhouses in town. We love Joe's ,Gibson's, Morton's and Del Frisco's - time to add another great one to the list Steak 48.<br><br>We were celebrating our anniversary (a big one) with my kids - we had reservations for outside which was closed ( too hot out) and we sat are a in a booth with a glass wall facing the kitchen which was awesome.<br><br>Our server Devin made the whole dinner special - treated us like family!<br><br>Now the food - apps shrimp the size of your hand, fresh oysters and a couple of great salads.<br><br>Dinner - we all had steak bone in ribeye was big enough for two ( son killed it) bone in NY amazing, bone in filets giant ) dogs loves the left overs. We all like our meat Rare Plus - cooked to perfection!<br><br>Sides - we order a few and the house sent us one of everything one was better than the next.<br><br>Desert - I am not a sweet lover but OMG the buttercake was the best thing ever. We had beignes and chocolate cake ( Sis birthday - who joined us for a drink)<br><br>Overall if you are looking for a great dining experience at a Chicago Steak house got to Steak 48 and ask for Devin.", "pics": null}}, {"review": {"des": "Fantastic food, atmosphere and service! Loved the seafood and the wedge salad. Great old fashioned drinks and knowledgeable bartenders.", "pics": null}}, {"review": {"des": "Steak 48 is a Chicago Favorite! The food was amazing, and flavorful. The ambience is romantic and relaxing. I ordered the Rib Eye steak and corn. The portions are very large. We vacancy our journey in the bar with bourbon and Martins. My husband and I were impressed. For Appetizers we tried the fried devil eggs and crab stack. Both were delicious. Then we were served warm garlic bread, the BLT salad was fresh. Our steak were tender and juicy falling off the bone! No room for dessert", "pics": null}}, {"review": {"des": "I'm BACK! Hell I come here way too much to keep Yelping em but here goes. I love this place, I went to RPM last month (PISSED) I went to Ruth's Chris' (PISSED) and I went to Capital Grille (PISSED) I want to McCormick and Schmidt's (PISSED) sadly in the past I've had NO issues with any of these places but since Mike Maestro and partners decided to open this place it's made all others take a back seat! From the service to the awesome food there hasn't been any complaints from me! I've been sending ppl here and NO ONE has had any issues! It's become one of Chicago's FAVES! Even my out of town guest LOVE it! Whatever has had you hesitant about giving them a try put it aside and go you won't be disappointed!!! I sent my daughter and her party here for her bornday and her over 50k followers has sent MANY here and all has been sending rave reviews to her to tell me about.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/py42hqYR6vuqDb6M5ZZ6VQ/348s.jpg", "caption": "Sautéed shrimp"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Z_4JPl1A66QUi9ypV0WYDw/168s.jpg", "caption": "Plated"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oIpJOD9FjO3D_oTp_jnWqA/168s.jpg", "caption": "Roasted sweet potatoes and creamed spinach"}]}}, {"review": {"des": "I came here last week for a work function.  We had a ton of apps and small plates to start- the beet salad was fantastic.  I opted for the tuna over the steak and it was fantastic.  It was a very large portion and the leftovers were just as good the next day as it was that night.  I would also recommend the mushrooms as a side dish- delicious!", "pics": null}}, {"review": {"des": "Yes! You should check it out! <br><br>Went last night with my family to celebrate my mom's birthday. From the outside it's very chic and has a clean design. When you walk in, on the right wall you'll notice an endless display of butcher knives (not sharp tho; out of curiosity I of course felt the edges). Down the hall there was a coat check to the right; to the left was the receptionist/host desk. Everyone was extremely welcoming. We made a reservation for 6:15pm, got there 5 mins after and were seated right away. <br><br>I made a reservation via OpenTable and in the comments section mentioned we were celebrating my mom's birthday. The hostess told her happy birthday, when we got to the table there was a handwritten happy birthday card from management, the waiter right away said hbd and at the end of our meal they surprised us with the Ultimate Warm Vanilla Caramel Cake with a candle and hbd spelled out on the plate. That cake was amazing btw!! .. Overall I was so impressed and really appreciated their attention to detail. Also you can call in and they will arrange flowers and/or a cake if you'd like. <br><br>Ambience is classy, semi-dark, romantic, kinda loud near the bar, and they played good music (hits from the 80s-present). <br><br>Our waiter Jose was amazing!! So positive, kind and knew the menu inside out! Also shout out to the guy filling our water and the other guy changing our plates and silverware. They were super kind and professional as well.<br><br>We ordered: <br>- Chopped Salad: really good<br>- (3) NY Strips: one of them topped with spicy shrimp.<br>- Filet Mignon<br>- Corn Créme Brûlée: amazing!! <br>- Sautéed Wild Mushrooms: okay<br>We had a whole bunch of the warm bread with the garlic seasoning too!! It was so good! <br><br>The steaks were quality x delicious. I ordered medium and it was perfectly cooked and seasoned. Keep in mind they serve the steaks on superrr hot plates so you can even continue cooking your steak. Also your steak stays warm the whole time. One thing I would recommend though is to ask for a second plate for the sides and steak bites you want to eat right away. Placing the sides on the super hot plate kinda cooked them and it was hot to eat. <br><br>After dinner we were given warm scent towels to wash our hands, then we were surprised with the birthday dessert and when we got the bill they gave us some nice homemade chocolate chip cookies. <br><br>In summary, I was extremely impressed and will definitely come again!", "pics": null}}, {"review": {"des": "Charred, buttery goodness. The bone in ribeye was cooked perfectly. The char crunched in my mouth while the inside was simply butter. One of the better steaks I've had in awhile, so I'm definitely going back. Nice feel to this place and a nice crowd. This place certainly places itself towards the top of the Chicago steakhouse scene. If you haven't tried it for whatever reason, I recommend you do soon!", "pics": null}}, {"review": {"des": "Went for the first time Wednesday night and I was definitely not disappointed. Everything was amazing! Food, service, atmosphere, everything! <br>Such friendly people and such a cool environment. I couldn't believe how busy it was for a Wednesday night. The place was packed!<br><br>For a steak house, the prices are actually very reasonable. The food literally comes out sizzling!! I couldn't believe how hot everything was. NOT JUST THR PLATES. The food itself. And everything is so yummy! <br><br>I cannot wait to come back!!", "pics": null}}, {"review": {"des": "Summary, amongst the best steak houses in Chicago.Not to give away why this place is phenomenal but it's a family owned restaurant (started by the original family that started Masteros) so quality runs through their veins. <br><br>Came here for my birthday and the attention to detail from the get go (hand written card for my birthday from the staff set the tone for the night.)<br>Had west coats oysters, mac and cheese, corn soufflé and of course the tomahawk steak! The steak was perfectly cooked at medium rare + and continued to sizzle on the 500 degree plate. Service is some of the best I have had in Chicago. <br><br>The one and only thing that is a small critique is that their was no offer for fresh ground pepper and the chocolate cake was milk chocolate with dark chocolate ganache (wish the milk chocolate part was specified)<br><br>Will be back without any hesitation.", "pics": null}}, {"review": {"des": "This is a wonderful place to dine and relax. The service provided by the entire team is excellent! The food quality is outstanding. <br><br>My dining party enjoyed each course of the meal: bodacious bread; superb salads; awesome appetizers; elegant entrees; and, dazzling desserts! <br><br>The magnificent beignet tree is something you need in your life!", "pics": null}}]}