{"name": "stellas-diner-chicago", "reviews": [{"review": {"des": "Stella's is a staple in the Lakeview community. You can always expect consistency when it comes to the food and service. Your typical diner food, it's by far one of the more casual breakfasts and dinner places you'll venture to. Personally, I love the staff. Some of them have been working here for years and truly make it a gem of a place. <br><br>Food wise, omelets are always on par, and I also love the grilled cheese. It's all fairly basic, but still solid quality. It's also BYOB, which is a plus in my book. Can't wait to be back soon!", "pics": null}}, {"review": {"des": "This place is totally not worth it. We went here for Sunday brunch and were seated shortly after we reached the place. We had a nice outdoor table and other than the ambience of Lakeview East on a Sunday afternoon there was nothing else going on even remotely good.<br><br>The food was totally not worth the money and completely lacked flavor. I ordered an omelet and it was lackluster, having not being seasoned at all. Even after adding a considerable amount of salt to bring out some flavor, it was still bland and the texture of the eggs wasn't anything great.<br><br>There are a ton of brunch places a stone's throw from this place, go there instead.", "pics": null}}, {"review": {"des": "We enjoyed our food. <br><br>Pros - <br>The portion sizes are relatively large espeically for the price so don't worry about leaving there hungry. More than likely you will leave food on the table or take leftovers.<br><br>The coffee was decent. It was not gourmet or something to rave about. They have a $3 per person fee for the booth if you don't order food in case you are one of those want to sit and wait for hours in a booth and sip unlimited refills of coffee. I swore that only happened in the movies, but if it's a fee added to their menu well I guess it happens more often than it seems. <br><br>They use fresh ingredients! My food took a while to come out but it was worth it. I could tell it was made with fresh eggs and meat instead of something out of a can. <br><br>Street parking is available but start looking for it early. This extremely busy area is known for having limited parking and lots of traffic! <br><br>Excellent service - The busboys, waiters, and waitresses understand good service and work to continuously provide it. From the friendly greeting down to quickly removing used dishes from our table to being prompt in offering refills on coffee and water, this place understands how to be attentive without clingy. <br><br>:) Our waitress had the flare! She wore this gold metallic eyeliner and was full of energy. It was one of those things where it's a small detail that makes you smile and is hard to forget for no reason at all.<br><br>The bathrooms were very clean which is a huge plus but beware they only had two in the whole place and they get kind of busy so there maybe a line.<br><br>Cons - <br><br>No parking lot. Most diners at least have a small parking lot, but I'm guessing in Chicago those are hard to come by. <br><br>:) No other con's it was nice.", "pics": null}}, {"review": {"des": "They serve delicious diner food with a friendly, family vibe. I've dined in and ordered take out and everything is perfection. <br>Do yourself a favor and save room for dessert or a milkshake. I had the chocolate pudding. That was a big mistake. I'll be stopping in every day for some!  So good!", "pics": null}}, {"review": {"des": "With my wife out of town for the weekend, I was craving a casual breakfast where I could read the news and the coffee would keep coming- a Sunday morning diner mood. I had heard good things about Stella's, so I dropped in after a lazing around in bed all morning, around 11 am. There was a wait, but only 5-10 minutes. Since I was going solo, I bypassed the line and sat at the counter. <br><br>I read a lot of reviews about the friendliness of the servers. However, the lady setting me up with coffee and getting my spot set up seemed a little grumpy and didn't get me a place setting, a menu, or any fixings for the coffee. When the woman next to me left I took hers.<br><br>The eating experience was fine. And I liked my actual server who came by once I had settled in. Coffee wasn't very good, but they kept it coming. The food was pretty good. I got the Mexican Jolt skillet, and it was about what I was looking for. I was disappointed that hash browns are the only potato option; I generally prefer potato rounds. But they were good, as hash browns tend to be.<br><br>Overall this place is decent, I just don't really get the hype. Not just in Yelp reviews; I have friends who love this place. I love a good diner, but would classify this as average for a diner. I will come back because there are only so many diners in the neighborhood, but probably won't be bragging it up to my friends and trying to get them to come.", "pics": null}}, {"review": {"des": "Decent food, good coffee, and mostly friendly service. I would recommend dining before 10:30 a.m. on weekends. This place fills up very quickly and they don't have the most space to wait to be seated. It feels like you're always in the way when waiting to be seated unless you wait outside, which can be unideal depending on the weather. Nonetheless, it is a cute diner to have breakfast in Lakeview. Expect to pay $30+ minimum with two people, so if money is an issue, there are cheaper breakfast options.", "pics": null}}, {"review": {"des": "Went here on a beautiful Chicago Wednesday evening before attending the esteemed Briar Street Theatre. It was a relatively quiet dinner experience, but that doesn't mean the aura inside the diner was boring! The service was lively and attentive, they also accommodated well for my nut allergy.<br>(Enough about the ambience, how was the food?!?)<br>Well I'm glad you asked. Me and my SO both got the granny grilled cheese, which is a heartier version of your childhood favorite. It was warm and delicious. The fries were crisp and a good accompaniment. All in all, a good meal and look forward to coming back!", "pics": null}}, {"review": {"des": "I used to live in East Lakeview and I have never been to Stella's Diner until last weekend. Every single time I walked by on the weekend, the place was packed and people waiting outside. Stella's Diner is a cute little neighborhood diner that fits Lakeview well. <br><br>Stella's is a typical diner that is better than your Denny's and IHOP. The menu and food is simple at a very affordable price. I ordered a Bleu Cheese and Bacon burger with fries and a vanilla shake. The burger was average and a little dry and I wish the shake was a little thicker. The fries were hot and crispy. Food 3 out of 5. <br><br>When you come to Stella's, don't expect anything special or over the top. This is your no thrills, simple eats, local neighborhood small business diner. Prices are very cheap and you pay for what you get. Portion sizes were big so it's a good bang for your buck. Service was fast and efficient, but nothing spectacular. It is what it is and Stella's a solid place to have in Lakeview.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/e3r1wf6_V6R4mj1HQ2W5rw/348s.jpg", "caption": "Bleu Cheese and Bacon Burger."}]}}, {"review": {"des": "Great spot! My husband and I had a lovely breakfast here. Service was attentive and friendly. My husband got a breakfast sandwich that was delicious! I got the chicken fried steak and eggs. A HUGE portion of food for a reasonable price. The steak was so tender I didn't use my knife at all. The batter was seasoned well and the gravy was tasty. We each got fruit on the side which was strawberries and bananas. I would definitely come back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/g404wXvhTvIRoeldUkU_YQ/348s.jpg", "caption": "A very delicious meal"}]}}, {"review": {"des": "Magnificent! Large portions and lots of delicious options. The total diner experience; possibly the best in the area.", "pics": null}}, {"review": {"des": "After picking up my order, I arrived home to find what my germaphobic mind thought was romaine lettuce on my sandwich. I called the manager...twice...to ask (rudely) why they would include romaine (which I was sure it was) in their dishes after the CDC urged all restaurants to toss their supplies due to E. coli. Both calls ended with the manager assuring me it was not romaine but another kind of lettuce that closely resembles romaine. I was skeptical until the manager texted me a picture of a giant produce box labeled GREEN LEAF LETTUCE and a head of the \"romaine\" I was so concerned about. <br><br>In my defense, the two are nearly indistinguishable. <br><br>But alas, not only does Stella's follow the CDC's recommendations, they also go out of their way to appease crazy customers.<br><br>Also the buffalo chicken sandwich was excellent.", "pics": null}}, {"review": {"des": "Standard diner with standard options and friendly service. If you want skillets and omelette that never disappoint, then this is your place. <br><br>We ordered the Two Eggs Scrambled with Corned Beef Hash and the Hungry Person Skillet, as well as the Dive Cake.<br><br>The Eggs, both scrambled and sunny side up, were perfectly seasoned. The Corned Beef Hash was a little on the salty side and the hash browns were a little on the bland side. The Eggs and hash browns really benefitted from the hot sauce and ketchup combo. The Hungry Person Skillet was filling and well seasoned as well! The Diva cake was like a less runny lava cake with a layer of fudge and topped with vanilla ice cream. Truly a decadent dessert that everyone deserves for whatever reason! <br><br>The food was honestly standard and nothing really that spectacular, but it does its job.", "pics": null}}, {"review": {"des": "I am blown away by my experience at Stella's! After attempting to go to the swanky place across the street and being told there was an hour wait (for one), I moved to next on the Yelp list. Admittedly, I wasn't thrilled about classic diner fare, but was just damn hungry.<br><br>Stella's was busy, but got me seated right away. A gentleman (not my server) brought me water immediately and asked about other drinks. I got a coffee, and throughout my visit, neither my water or coffee hit within two inches of the bottom of the glass without someone asking about a refill, whether it was my friendly server or one of the other folks helping out. A++.<br><br>I have a habit at breakfast places of maximizing my dollar in terms of variety, so after a thorough examination of the menu, settled on the Country Style Eggs Benedict. For $10.50, I was able to get biscuits topped with ham off the bone and covered in gravy and poached eggs with hash browns. From what I could see, this was the best value on the menu.<br><br>The food came out in about 5 minutes, super fast! Up till now, this was a solid 4 star experience... Then I tried the food, and WOW! I don't really even like ham, but this was truly delectable, very moist and tender, cuttable with just my fork, and with excellent flavor. I truly don't know if I've had better ham. And they didn't skimp on how much ham was on the plate.<br><br>The gravy, hash browns, and eggs were solid, but the biscuits!! The biscuits were perfectly fluffy, stopping just short of crumbling apart on their own...I didn't know it was possible to strike such a balance, it was just damn good. <br><br>The best part about this meal was that it wasn't over-salted like you'll find at many diners, it was just great. I ate half the meal, then thought \"Let me try this with some ketchup!\" I ruined that bite, and went back to eating the rest as it was meant to be enjoyed, sans anything extra.<br><br>When I finished what was on my plate, two gentleman asked simultaneously from different directions if I was done. Talk about service. All in all, I was in and out in a little over a half hour, and now this place is on my radar, which I'm ever grateful for. Best diner I've been to.<br><br>They do have room for groups of 6 comfortably, but you might have to wait. There's also a dessert board that looked super fun, but if you read what I ate you know I had no room left over. There were also three specials on the board, so it seems like they like to change things up a bit.", "pics": null}}, {"review": {"des": "Love this cute, neighborhood diner!<br><br>My fiancé and I stopped in after walking by the place. It's your casual diner filled with friendly people. It definitely feels like a neighborhood inside- people know each other and say hello. <br><br>We ordered two egg scrambles with chili on top. Our waiter was fast and friendly and our food came out fast, even though it was busy. Our egg scramble did not disappoint and we ate every last bite. Everything here is also very reasonably priced.<br><br>We will be back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wqVFa71q1DgHZXnMvDrayA/348s.jpg", "caption": "Two egg scrambles with chili and over-medium eggs (one has hot sauce on top)."}]}}, {"review": {"des": "I've had breakfast a few times here so far and it has yet to disappoint me. The service here is really great. I never waited long to get my food. I had the same waitress a few times and she is very attentive, always checking to make sure everything is okay. Last time I came here I ordered the skirt steak with eggs. The steak was really juicy and decently priced. Definitely can't go wrong coming here.", "pics": null}}, {"review": {"des": "Love it here! No complaints. Be prepared to strike up a conversation with Gus, the owner, and he will strike one up with you whether you want him to or not. Best milkshakes in my opinion, this time I got the chocolate peanut butter milkshake and oh boy it hit the spot! I can never go wrong with the buffalo chicken wrap and the cajun fries. Also the side of mac and cheese is soooo good.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KluuHqVXzWfvu-ZE5piSdQ/348s.jpg", "caption": "Chocolate peanut putter milkshake, two straws :) So good!!!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Xm1bi1IobReQEUyXKhdB3Q/168s.jpg", "caption": "Buffalo chicken wrap with cajun fries.... the best!!!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1_bBu0qzkIIcQuAEV3hYSQ/168s.jpg", "caption": "Macaroni and cheese"}]}}, {"review": {"des": "Quick to be seated, quick to be served. Huge menu with tons of options. Basic food but hits the spot after a night out! I got the hobo skillet which was hashbrowns topped with kraft singles and 2 eggs with a side of toast. I got exactly what I ordered and it was delicious. The only complaint was that my friends hashbrowns were cold.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/O3lhJAoeZKvkLONRg4xVGA/348s.jpg", "caption": "Hobo skillet with 2 eggs over medium.  Corned beef hash in the back of the photo"}]}}, {"review": {"des": "Compared to other spots in the area Stella's Diner is no longer a great option. The food was a bit dry and the only plus for me was that we didn't have to wait long to get a table for brunch. Maybe what turned me off from the beginning was that the spoon on the table was used and dirty, that is never a good start to the meal.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/btXcUsWcIwvsI-8LT3bd8Q/348s.jpg", "caption": "The Vegetarian Egg Skillet Breakfast"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-IcyqL6YwcdchhQ9aBCMTw/168s.jpg", "caption": "Vegetarian Omelet Breakfast"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/udPOlEnRZlKffnFmjIZBFA/168s.jpg", "caption": "Tea"}]}}, {"review": {"des": "Stella's was everything I was hoping it would be! The wait staff and owner were very friendly and attentive. And as a bonus its BYOB-can't beat that! Wide variety of food options (breakfast/lunch/dinner/dessert) at reasonable prices. I got a club sandwich with fries and my boyfriend got a breakfast combo with pancakes and sausage. Top off your meal with a milkshake-they're good but slightly pricey at $6ish. We got the s'mores milkshake which was delicious I just wish it was a bit bigger because we were sharing. If you're not sharing it's definitely a good size for one person. Overall Stella's is a nice little diner in East Lakeview that's worth the visit if you're in the diner mood. I will likely be back!", "pics": null}}, {"review": {"des": "Pretty decent meal. Got chicken noodle soup which was rather flavorless and a salad which was way better than I was expecting. The waiter was probably the most delightful human I've ever had the pleasure of engaging with. Will definitely be back for a no frills meal.", "pics": null}}, {"review": {"des": "Probably one of the nicest diners I've visited! The wait staff were all super nice. My gf was craving a meatball sub, which they didn't have on the menu, but our waitress was able to work something out with the chef and create a meatloaf/marinara sandwich, which was delish - really above and beyond level of service. The buffalo chicken sandwich was also great. We're so glad we live walking distance from this spot, we'll be back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/W_9YlMs3sIB0KaH5y4KEYw/168s.jpg", "caption": "Buffalo chicken sandwich"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mmhm3CPcNqPe19WxgD6OyQ/168s.jpg", "caption": "Meatloaf sandwich (not on the menu!)"}]}}, {"review": {"des": "We stopped in to split a strawberry milkshake and it was very tasty, the decor was nice, and our server was attentive and polite. <br><br>The shake was thick, creamy, and blended well and we were given two straws and two strawberries. <br><br>There were no actual strawberries in the shake, so we were a little disappointed in the strawberry flavoring, but overall we had a nice time.", "pics": null}}, {"review": {"des": "Walked in here with my friend for a mild-hangover breakfast (mild, but still this meal was important). Before we sat down I had misgivings: First of all the place looks like it's from the 1960's and not in a good, intentional way. Secondly they only had 100 year old, nonperishable creamer and granulated sugar for the coffee. It was generally just a depressing atmosphere to me. <br><br>There were prob other telltale signs that this was a bad call on my friend's part, but the COCKROACH was what finally ended this stupid endeavor. I hadn't been seated long enough to remove my sunglasses before we overheard the man in the booth behind me relocating tables. \"Why\" the waitress asked, \"oh bc I just saw a cockroach crawl across my table.\" She seemed unsurprised. My friend saw it too and finally conceded that she made a huge ass mistake and we should run. <br><br>So I can't speak to the food...but needless to say I do not recommend trying this place.", "pics": null}}, {"review": {"des": "I love this place.  The family that owns it is so sweet.  Food quality is so consistent and their skirt steak is the best!  The waiting staff is so friendly. Cooks are very experienced. Good crowd... Nothing bad to say about this great restaurant.", "pics": null}}, {"review": {"des": "This place is bomb! Went here for lunch on a Saturday afternoon with two friends. We were quickly seated by really friendly staff. Place is nice and clean. There are two gender neutral and clean bathrooms, and the place is actually pretty big. <br><br>The waitress gave us enough time to look over the large menu before coming back for orders. I got the hot roast turkey sandwich, which was so good. The mashed potatoes tasted like real potatoes and not powder. A friend got the spicy steak sandwich, medium rare, which he said was super tender and juicy. My other friend got a skillet which was hearty, filling, and delicious. The shakes here are also huge, and to die for. Definitely don't come here looking for a bunch of diet meals. The mac and cheese was a little soft for my taste, but still tasted good. <br><br>All in all, great experience and we will be back! They really make you feel like family.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5awnmOR80DVfdtbsBypdIw/348s.jpg", "caption": "Mac & cheese"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tjIsl1do1xvfdUAgSBRYNw/168s.jpg", "caption": "Roast turkey hot sandwich"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JqFP0RZqKTDDRBN3xHA09g/168s.jpg", "caption": "Steak sandwich"}]}}, {"review": {"des": "My family and I were looking for a laid back and somewhat quiet place to eat dinner.  We walked down from Wrigley Field area, it's about a 20 minute walk.  The service was awesome and the food was very good and huge portions!    I had the turkey club and the turkey was the real deal!  Not processed crap!  I wish I could have eaten more!  Very kid friendly!", "pics": null}}, {"review": {"des": "Yesterday was a hot one, and I was both hungry and dehydrated as a fool. Walking down Broadway in Lakeview, I had many options but none of these places peaked my interest. After a while, i got desperate. Suddenly, I ran into this diner, Stella's Diner, that stuck out like a sore thumb. The building was brightly colored, with a nostalgic purple and gold color pairing that drew my attention so much that I had to walk in.<br>Oh the kindness I was greeted with was some I haven't felt from a restaurant in a while, everyone here was at their most cheerful, as if they love their jobs. Such great hospitality here, that's one key thing I feel every eatery, as small as a hot dog joint to a big 5 star restaurant, needs to have.<br>I ordered this filling Portobello mushroom sandwich, and for what it was, it was outstanding! Lot of delicious breakfast and lunch items on the menu, and dessert as well. The shakes looked amazing. <br>Nice to see a diner from the 60's still standing strong in the ever changing Lakeview neighborhood. Don't pass this place up!", "pics": null}}, {"review": {"des": "Pretty darn sad we wasted our money here. For 2 people, it was $40, not including tip. Really pricey for diner food if you ask me. The best thing here was the milkshake I'll say. For just $5, it was reasonably price and decent. <br><br>We ordered<br>-Country fried steak ($13)<br>-Meatloaf ($14)<br>-Butterfinger milkshake ($5)<br>-Mac & Cheese Munchie ($5)<br><br>The food was mediocre. My boyfriend who was super excited for the mac and cheese was disappointed. I took a bite and it tasted like mush. They definitely overcooked the elbow macaroni so it just kinda all tasted like cheesy mush. Super disappointing.<br>Service was good but that's not why I come to restaurants.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Yc0nsBT3Eg1WI1_-jZWgTw/348s.jpg", "caption": "Country fried steak"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xPEBcNxSdlsVwbYnZPMwsg/168s.jpg", "caption": "Meatloaf"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5BJDFfiyNxwbEytmBVP-jw/168s.jpg", "caption": "sides with dinner entree. CN Soup and House salad"}]}}, {"review": {"des": "It's hard to overstate my love for Stella's. It's also hard to overstate how much of my paycheck has ended up here. :)<br><br>I'll say this: it's a diner. It's not a Michelin-starred brunch spot in the west loop, and they're not *trying* to be. What it *is* is a local spot, with good food, reasonable prices, decent coffee, and a Key Lime Pie milkshake that has no reason being so delicious.<br><br>Having perused the reviews, I'm puzzled. The waits aren't bad, even on weekends. It's always clean. Food is always good (again: not a celebrity chef temple of culinary masterpieces; but a diner). Coffee is that slightly weak but really addictive diner coffee that you just can't stop drinking. Prices are not waffle-house low but Chicago ain't cheap and I never feel ripped off. Service is actually really good. Decor isn't shabby, it's different and cute. <br><br>I don't know. This is probably my favorite restaurant, period. Ever. It's home in a way my house isn't. I'm a little defensive. Buzz off haters, and I'll take your booth. Go instagram your food at Alinea or something.", "pics": null}}, {"review": {"des": "I am not one for leaving negative reviews, BUT was very disappointed in the service, food selection, and food quality. <br><br>Food was meh, but they were out of almost everything I had ordered. The skillet I ordered came with what looked like a slab of kraft cheese half melted- if you're into that GREAT but not for me. <br><br>Overall fine, but if you're looking for a culinary experience I would look elsewhere in the area.", "pics": null}}, {"review": {"des": "Literally whatever you're craving, it's most likely on Stella's menu. Fun atmosphere, low key, service that aim to make you laugh and smile. And you can't leave without a milkshake otherwise you're doing it wrong.", "pics": null}}, {"review": {"des": "If I could have a job it would be just to eat at diners across the country and write about them on Yelp. Wouldn't that be like truly amazing?<br><br>First, the place is super clean which is always a good thing, especially when it comes to diners which have a tendency to be less than beautiful inside. The staff was uber friendly. My friend who I was with new the owner/manager and she sat down with us at one point and chatted with us, constantly making sure things were good with our meal and believe me, they were.<br><br>I love the art on the wall. They had cool handmade artwork with superheroes on them. That made me super happy (get it?) to see.<br><br>For my meal I had their buffalo chicken salad which was huge. It was really spicy but definitely delicious. I couldn't finish it. Who can't finish a salad? I felt like less of a man that day. Either way, it was an amazing meal.<br><br>I really liked it here. Great good. Great staff. Cool vibes. Fun neighborhood where it's located. Definitely a place I would recommend and a place I'd go back to the next time I'm in Chicago.", "pics": null}}, {"review": {"des": "Great breakfast place!  Eaten breakfast at Stella's many times, always a good decision.  My favorite is biscuits and gravy.  Always friendly and fast.  I'll go back again!", "pics": null}}, {"review": {"des": "This place is the epitome of average. The scrambled eggs were nice and fluffy but the cheese was kinda weird as it was just melted slices instead of shredded. The service was decent, the food could have come out a little quicker and but the waitress was nice. The saving grace of this place is the prices. They're pretty cheap compared to some of the other brunch spots in the neighborhood.", "pics": null}}, {"review": {"des": "I've always walked by this diner, and made a million mental notes to come here for breakfast.  There are always lines out the door, and the restaurant is filled on a given weekend morning.  I finally made it after living in Lakeview for 6 years, and it was just ok.  I wasn't amazed or wowed.  It was just the typical diner food.  <br><br>I had one of their skillets, the Mexican Jolt.  It sounded delicious with having ground beef, jalepeno, cheese on a bed of hash browns but it was just a normal skillet.  It was also a little dry for my preference.  The skillet itself felt like it was missing something.<br><br>The diner is cute, and it has a nostalgic feel.  The staff is super nice although the one rule on the weekend was a little annoying.  The weekend rule: your entire party needs to be there to get seated and there's really no good waiting area. <br><br>I'll give this place another try, and get some of the other Yelpers favorites to see if it was just a off item on the menu.", "pics": null}}, {"review": {"des": "Basic diner done right.  If you want good food without a lot of fru-fru embellishments, Stella's is a great place to go.  The eggs and pancakes are nice and fluffy and the gypsy skillet has a good amount of meat without being overwhelming.<br><br>We were looking for a brunch place with the basic brunch options done properly: eggs and pancakes.  So many other places either have too many weird options without a good choice of simple options or have the simple options, but prepared very averagely.  Stella's has the basic breakfast options with a good attention to proper preparation.  Of course it has other good options, but we like it for the quality basic ones.  Oh, and the coffee is great!", "pics": null}}, {"review": {"des": "Awesome \"old school\" diner; one of very few left in the area. HUGE menu and everything in it is awesome from breakfast to dinner. Service is awesome and bottomless cup of coffee! Tables inside and out and booths along every window, they are on a corner; great people watching while you're dining or finishing your coffee!<br>They also have a \"dining counter\" with old fashioned feel and stools. It gets my vote all day long over some of the Belmont-Sheffield area diners that are over priced and only half as good.", "pics": null}}, {"review": {"des": "I ate here about 6 years ago (when I lived nearby)... and have been meaning to come back since I loved the pesto pasta dish I had.  But for some reason I only ever passed by very late at night after they had closed.  Today, however, I was in the area to see a flick at Landmark Cinema and made a point to accomplish my goal before the 7-year itch set in.<br><br>The handsome, lanky, long-haired waiter was delightful... as was the gorgeous gal who whipped-up my cherry malted (and cleared my used dishes).  I was craving a bacon cheeseburger (with a fried egg on it) and it certainly hit the spot.<br><br>All-in-all, it was a nearly perfect visit and I do hope to return again someday.", "pics": null}}, {"review": {"des": "I live in the neighborhood and have been to Stella's quite a few times.  Great place.  The service is easy and has a more personal touch.  Brunch menu is quite good.  Yolk may be slightly better in taste, but I've found the service to be better at Stella's.  I usually invite out of town guests for brunch here.", "pics": null}}, {"review": {"des": "We stopped by here for a meal before heading to a party. Not the right time for this place. I am sure their breakfast options are really good but their non-breakfast options weren't as appealing. I would try this place again for the actual diner feel and their breakfast but not for non-breakfast items.", "pics": null}}, {"review": {"des": "The most family friendly diner of all time! They have a huge variety of food for everyone from wraps and burgers! The owner is so kind and very funny and makes you feel welcome there by talking to you about your day!", "pics": null}}, {"review": {"des": "This is a typical diner, nothing more and nothing less. Bright colors on the wall, glass dessert case up front, and plastic booths that make your legs stick in the hot summer months. <br><br>The food was decent. I split a BLT with a friend and enjoyed it despite two things: it took over 25 minutes to receive the single sandwich, and it was smothered in mayo despite ordering it without. The breakfast at other tables looked delicious, but it's hard to mess up some eggs and toast. Side note: There is a wall menu of lots of milkshake flavors that I'd like to come back and try. <br><br>The staff was friendly with the exception of the rude (owner?) woman in charge of the front desk where you pay on your way out. I definitely got the vibe that if you're a regular then you'll be treated like royalty while the rest of us are a mere annoyance.", "pics": null}}, {"review": {"des": "after years driving by the flashy sign...<br><br>finally hit up stellas and were not disappointed. the breakfast fare is good not amazing. i would've liked to see more creative sweet breakfast items. however having said that, they make up for it with their dessert menu and SHAKES. yum to the shakes. also, staff is charming, laid back and fun!", "pics": null}}, {"review": {"des": "I stopped in here on a Sunday morning for brunch. We were sat quickly and our server came to us not long after being seated. I ordered the chorizo skillet and it did not disappoint! It was a hefty skillet and it was delicious!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0_vi1VxDRFfEAEfuP9tIFg/348s.jpg", "caption": "Chorizo Skillet"}]}}, {"review": {"des": "I went here on a Saturday morning for breakfast. In and out within 40 mins, you can't beat that. Parking sucks, but most places in this area is like that. Staff is friendly and fast, loved the fact that I didn't have to ask for water refills and napkins, that just keep it coming.<br><br>Food is pretty good, I had scrabbled eggs with spinach and feta with hash browns, turkey sausage and raisin toast. Food came out fast and didn't have that fried egg taste, which means the grille was set at the appropriate temperature. Overall it's a good cozy diner. I will be back if I'm in the area shopping or visiting.", "pics": null}}, {"review": {"des": "My favorite place for affordable breakfast in Lakeview East. They have awesome milkshakes too. Tried the Key Lime Pie, if you like your key lime a little tart will definitely recommend.", "pics": null}}, {"review": {"des": "Good diner food! I got an egg, toast, and pancakes and all were great. Would recommend! Very nice waiters and a fun atmosphere.", "pics": null}}, {"review": {"des": "Was very impressed with this neighborhood spot. A great break from the upscale and pricey eateries dominating the area. The service was spectacular and quick. Our server was cheery and had great menu recommendations. The bacon jack chicken sandwich was well fried and the chocolate milkshake was a solid addition. A great place to read the paper over some breakfast or chill on a slow Sunday morning with some pals. Definitely stop by!", "pics": null}}, {"review": {"des": "I've been meaning to come to Stella's for ages since I'm basically Ron Swanson when it comes to breakfast food. Service was prompt and friendly and we only waited five minutes for a table. Food came quickly and portions were huge. The food itself tastes fine, pretty standard diner fare for a good price (I'm throwing shade at you, Yolk). Since there are just so many other breakfast spots, this probably won't make my regular brunch rotation, but is perfectly adequate for fast diner breakfast.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GOIYiojXb_OmalPY82Nr7Q/348s.jpg", "caption": "Make your own omelette with crispy hashbrowns and chicken fried steak."}]}}, {"review": {"des": "SO GOOD. A little on the pricey side for a dinner but very tasty. Loved the greek toast! I had some sort of chorizo hash that was out of this world. I would definitely recommend this place to a friend. The neighborhood is great, they offer outside seating and the menu is large.", "pics": null}}, {"review": {"des": "Wow! What a place! The turkey, bacon club is amazing! Best I've had anywhere!! They make a fresh turkey everyday! <br>Breakfast here is amazing as well. Well priced and healthy portions. <br>Maria (owner) - you are amazing!", "pics": null}}, {"review": {"des": "If I could give this place zero stars I would. DO NOT COME HERE. Absolute horrible and incompetent manager. Got my order wrong and food is also meh. Save your money and go somewhere else.", "pics": null}}, {"review": {"des": "This diner was $&@*ing awesome. Great and friendly staff, fantastic food, and a nice atmosphere. My patty melt was mouth watering and the fries were on point. I'm definitely returning.", "pics": null}}, {"review": {"des": "This is our special go to place for a great meal in a great hood. The owner is old school, awesome and committed to  amazing food with wonderful service to boot. We use this great dining experience both personally and professionally.", "pics": null}}, {"review": {"des": "Solid diner food. I got the eggs Benedict but swapped in sausage instead of ham. It was absolutely delicious!<br><br>Everyone else enjoyed their various meals. Lots of specials of the Mexican variety.<br><br>Waitress was knowledgeable, nice and fast.<br><br>Side of bacon could be crispier and parking around here is a real challenge.", "pics": null}}, {"review": {"des": "Great, friendly service. Delicious and fast food. Great old style diner feel. Easy parking.", "pics": null}}, {"review": {"des": "The people who work here are amazing...so welcoming, personable, helpful and great at their jobs. Food prices are fair, quality is outstanding and service is excellent. Large menu, plentiful seating and clean restroom. Ordered the turkey club and my partner had the turkey reuben. He had the mac and cheese as a side which was wonderful as were the sandwiches. He also had the cream chicken soup that was great. 1 coffee, 1 soda, 2 sandwiches and a bowl of soup and the bill was approx $31. Would return.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GDk_f-00iShkr5VVNGjcow/168s.jpg", "caption": "Turkey reuben with Mac and cheese for side"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8paGG-dJeuqD-3TIfMbAiQ/168s.jpg", "caption": "Turkey bacon club"}]}}, {"review": {"des": "Love Stella's!!! The breakfast is delicious!! Also, prices are reasonable! I also love they have outdoor seating in the summer. I recommend the meat loaf sandwich for lunch and the hungry man for breakfast! Can't go wrong with anything you pick!", "pics": null}}, {"review": {"des": "This is one of the best traditional diners in the city of Chicago great food and the very best employees would recommend it to anyone !", "pics": null}}, {"review": {"des": "I ordered the buffalo chicken sandwich and arrived around lunch time; the service was great (not sure if it was due to low population) but the sandwich was upper class mediocre. Good price for a an equally valued meal, extra cheese or extra buffalo sauce will cost you extra but are necessary to add any flavor. Decent place if you're looking for a quick bite and not expecting a whole lot, good enough to revisit!", "pics": null}}, {"review": {"des": "* tried Stella's Diner today 2/5/17<br><br>* we had no wait which was surprising on a Sunday morning. <br>* almost as soon as we were seated , the bus staff brought water and asked for our drink order<br>* soon after our server arrived and we placed our order for : The West Coaster, the Firehouse Breakfast Special and The Breakfast Special. My husband asked for them to substitute corned beef hash for the hash potatoes but they wouldn't even for an up charge. The food arrived in a timely manner, was hot and plentiful. <br><br>* we would frequent this diner if we lived in the area", "pics": null}}, {"review": {"des": "I'm in love with Stella's. I've gone there a few times now and it's a place I constantly want to go to. The food is really good and the prices are reasonable. The service is lovely, and I enjoy the decor. It tends to get a little crowded during the weekends, but I've never waited long to get a table.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dS_vVAB1ovN2tK7cLe0qOA/168s.jpg", "caption": "The Gypsy Egg Skillet"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_pazwSSPlwOHChXe8Z0ZRg/168s.jpg", "caption": "Chocolate Chip Pancakes"}]}}, {"review": {"des": "Food was so so table was dirty water had things floating in it cool place to look at pictures", "pics": null}}, {"review": {"des": "Great neighborhood dinner with a new look and twist. Not your typical old greasy dinner, very clean and modern looking. Menu has all of your old dinner fare plus some new modern twist. I eat everywhere from road side hot dog joints, to the occasional food truck, to the Chicago Cut type of steakhouse and Stella's dinner is a great choice for an amazing breakfast, lunch or dinner. Family owned and operated serving up some great diner food, you can't go wrong here. Oh and killer milkshakes.", "pics": null}}, {"review": {"des": "Ah! What can I say? Stella's is an awesome part of the neighborhood and I'm so glad I discovered it upon moving here. I had the buffalo chicken sandwich which was probably one of the best sandwiches I've had in a long time. The fries were nice and fresh, not greasy in the slightest, and the atmosphere was comfortable. <br><br>I'll definitely be back!", "pics": null}}, {"review": {"des": "Stella's is a throwback to the traditional neighborhood diner and I couldn't be happier when I stop in for breakfast. Service is always amazing and the food is always spot on. The best part is the collection of people you'll see here on the weekend.", "pics": null}}, {"review": {"des": "Pre-made breakfast skillet. $5.50 for a glass of orange juice poured from a gallon Costco jug. Definitely underwhelming for a greasy spoon. The service was good but the food, not so much. Plenty of better options in this neighborhood.", "pics": null}}, {"review": {"des": "The food is delicious. They have a great choice, like most visitors. The service is excellent. The atmosphere is cozy and it makes you feel that you are at home. I love them for that.", "pics": null}}, {"review": {"des": "Go here regularly for breakfast. It's your standard Greek owned diner with all of the staples you would expect. I also enjoy going here for dinner. Prices are a bit higher here but so is the rent along Broadway. I would definitely recommend Stella's for either breakfast or lunch and dinner", "pics": null}}, {"review": {"des": "Standard, nothing special diner breakfast fare with a side of rudeness. My friends and I had just finished up our meals and were asked to leave to make room for other patrons (the line was \"out the door\", the waitress said). There were many other tables available, not that long of a line, and we had only been seated about an hour. Unacceptable and terribly rude. I won't be back.", "pics": null}}, {"review": {"des": "Don't believe the hype. I've been here multiple times and the food is always subpar. The experience is nice, as it has a very retro/old school diner aesthetic, but the food is flavorless. I mean you have to drown this stuff in syrup, salt & pepper, and hot sauce to get any inkling of flavor out of these dishes! I wanted to like this place so badly as it's right by my apartment and the aesthetic ticks all the boxes for an american diner, but the food is just not worth the money. It's a little bit pricey too.<br><br>Food: 2.5 - no flavor, poor value<br>Service: 4 - usually pretty good but sometime its awful<br>decor: 5 - lovely aesthetic<br><br>Go to Nookie's instead. They do this magical thing where they add flavor to the food.<br><br>Overall it's about a 3 star experience for me dawg.", "pics": null}}, {"review": {"des": "This will do the job if you're stumbling in drunk from the bars and you're taste buds aren't at peak performance.<br><br>I ordered delivery and the turkey sausage had the texture of rubber. Turkey burger was only saved by the Sriracha mayo I had at home.", "pics": null}}, {"review": {"des": "This is one of my favorite places to take friends and family when they're looking for some simple, yet tasty diner food-- I'm particularly fond of their egg skillets. The staff is super friendly, and I've never been disappointed with their breakfast menu. I look forward to further exploring their menu!", "pics": null}}, {"review": {"des": "We have been here on several occasions and absolutely love it. It has a diner feel, with big portions and good service. The outdoor area is great for dog watching and relaxing during the summer months. The Mexican Skillet is fantastic.", "pics": null}}, {"review": {"des": "This place has been around for as long as I can remember. The food is always fresh and delicious. The service is fantastic and friendly. I love this place.", "pics": null}}, {"review": {"des": "I and Stella's have parted ways. I went there for a desert today, apple cobbler. I was a regular customer for breakfasts. I enjoyed all the people there until today. I have a club on Facebook  called  The Two Dollar Bill Club. I only carry $2 bills and $1 coins for environmental reasons. $1000 in ones cost twice as much as $1000 in $2s. It uses twice the paper, ink, printing and even shipping. The rest of the industrial world do not even print ones any more. It is important to me to distribute them so people can use them. I went to pay and since it was the slow period the regular cashiers were off. The man at the register was either a boss or owner. He looked at my money and said that I was one of those Crazy $2 bill guys. I started to explain but he just said that they were stupid. I did not say it but I think that insulting a paying customer to their face is stupid. I promised thet he would never have to deal with my $2 bills ever again. He said \"good.\" Since tht is all I use , you do not have to worry about seeing me there ever again. I said good bye to the waitress and used their door for the last time. Do what you will but I am out of there.", "pics": null}}, {"review": {"des": "Stella's is quickly becoming one of my favorite places to eat. I've always been pro any place that has all day cheap breakfast. I've visited Stella's on different occasions, ranging from dates to solo, and they never fail to leave me smiling when I leave. <br><br>Pros: <br>- Large amounts of food for reasonable prices - the food isn't that memorable though<br>- No matter how busy they seem the wait time to sit down is always very quick<br>- This is a great place to go if you and your friends can't decide where to eat<br>- The artwork in the restaurant is pretty cool and you will definitely be tempted to snap a photo or two<br>- The owner is extremely nice and had us laughing while we waited to pay our bill<br><br>Cons: <br>- There has always been a pretty long line to pay your check<br>- The server are always hit or miss the few times I've gone", "pics": null}}, {"review": {"des": "Had a pretty disastrous Postmates experience with Stella's, but Gus was great. Though my food arrived almost 3 hours after I ordered (oof), Gus was fab and actually put a note on my order to call if I needed anything and asking me to ensure I wasn't charged twice. Food is as per usual delicious (and I'm quite hungry at this point ). Thanks, Stella's and Gus, for making sure I had food today and for dealing with what I'm sure was a headache on your end too!", "pics": null}}, {"review": {"des": "Good stuff. Had the chicken fried steak, Meegs had veggie skillet. Comfort food for sure...cool pop art on the walls, unisex bathrooms. Had a good time.", "pics": null}}, {"review": {"des": "Stella's is surprisingly good. Went in expecting a quick, cheap bite but thoroughly enjoyed everything we ate. We started with the monster mozzarella stick which was weird but good. I got the blt burger with fried avocado with a side of Mac n cheese and it came with cole slaw. The burger was juicy and delicious and the fried avocado was a great addition. The Mac n cheese was also surprisingly good. My boyfriend got the patty melt and fries. Both were excellent. Will definitely be coming back!", "pics": null}}, {"review": {"des": "A solid choice for breakfast. I went with a group so I got to try a bit of everything. For the price, the portions were a pretty good size.  Your classic diner experience with good cheap food and a friendly staff.", "pics": null}}, {"review": {"des": "THIS IS THE BEST DINER IN CHICAGO! I'm from a town that has diners everywhere so I was surprised to see that there aren't many diner style restaurants in Chicago. I came across this one and it was pretty life changing. The Vegetarian Egg skillet is so good .", "pics": null}}, {"review": {"des": "The food is pretty good and I've never had a problem with the service. When I lived down the street I would often go here. <br><br>However, one evening (a while ago) as I was checking out, the owner Gus made several flirtatious comments towards me. Apparently being \"funny\" is his thing, so that is probably what he was going for...but it made me feel really uncomfortable.  <br><br>Otherwise, this is a good neighborhood diner. The food is a lot better than Melrose down the street, and since The Edge closed, it is one of the few spots left in the area like this.", "pics": null}}, {"review": {"des": "Literally our go-to spot for a quick brunch or breakfast. It's within walking distance for anyone in Lake View East and you feel at home while eating there. I usually order the Hobo Skillet, mainly with corn beef hash but the vegetarian one is great as well. All the prices are affordable as well which is great to see in the neighborhood.", "pics": null}}, {"review": {"des": "You totally get the family vibes from this restaurant from the second you walk in. The employees were super personable and this restaurant has a great menu! If you're looking for a solid brunch option in Lakeview, give Stella's a try. Definitely worth it.", "pics": null}}, {"review": {"des": "Probably one of the most understated hidden gems in Chicago, this little diner is like a second home to my wife and me. The dinner and breakfast menu have some something for every taste and the prices are great. The skirt steak is one of my favorites, and their biscuits and gravy are just delicious. For dinner, the burgers are juicy and the sandwiches are fresh and filling. <br><br>The selection of deserts is where Stella's stands out from the crowd. A large selection of milkshake flavors and combinations plus pie, pudding, brownies, and sundaes makes Stella's a destination for desert lovers.", "pics": null}}, {"review": {"des": "Stella's embodies all things American diner. I've stopped in here for breakfast, lunch, dinner and just for a milkshake.<br><br>The people are always incredibly friendly and welcome you in as if you're family- hard to beat that! <br><br>The food is just what you would hope for in classic diner style. I am a big fan of their grilled cheese and fries and have sampled a few other menu items.<br><br>The garlic bread is actually surprisingly one of my favorite items here too - they make it a rather unique style and its delicious.<br><br>The real win here is the milkshake. I've had a chocolate malt and vanilla shake (more than a few times) and they don't disappoint.<br><br>Definitely recommend! The price is right, the service is amazing, and the food is just what you need.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/f_ACPNrgMWqQpjcBCAkj6w/348s.jpg", "caption": "Grilled cheese and an awesome vanilla shake"}]}}, {"review": {"des": "Yum! Well priced, great service, and delicious! We are from Texas and they had an awesome Texas dish and made an egg white omelette without complaint. Yum yum yum.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wQO9VSOEG5xcDzyKs2-5MQ/348s.jpg", "caption": "YUM! No complaints!"}]}}, {"review": {"des": "We came to Stella's for a nice weekend lunch.  Of course, we got breakfast, which wonderfully served at all times.  We were seated right away.  The place was clean and neat and smelled awesome.<br><br>I ordered the skillet special, which had chorizo in it.  I love chorizo.  Like really love it.  And the skillet was loaded with it, so I was a happy guy.  Everything tasted great, from the coffee on to the hash browns (extra crispy) to the side pancakes.  Food was fast and hot and yummy.  No complaints there.  No, not the best I have ever eaten, but the menu was nicely complete, with some cool takes on old favorites that I can't wait to try.<br><br>The real stars here are the staff, however.  The server was funny and friendly and really awesome.  But the buss boys who came by and refilled water and coffee were the best.  They didn't hang around us, but the instant we needed something, even if we didn't realize it, they were there to take care of us.  Seriously, nice job guys.<br><br>I can't wait to go back!", "pics": null}}, {"review": {"des": "One year later... have tried even more menu items and it's just as great! Staff is warm and welcoming, food is consistently delicious.", "pics": null}}, {"review": {"des": "Wow. Talk about your friendly neighborhood diner. First time here and Gus welcomed me at the door. Totally appreciated the warm welcome. For being such a big city you never expect people to be so nice & helpful. Service and food was great! When I didn't finish the fries I was asked if something was wrong. Made me smile. In all honestly the meal I had was a lot and very flavorful. The serves and busboys checked on me and refilled my drink. I  as definitely impressed and will be back. I've never been fond of diners but this one has certainly raised the bar. I will be back. Great first experience. I need to check out breakfast or brunch next time", "pics": null}}, {"review": {"des": "Stella's is home.  You can always count on a delicious meal that feels like it's been home cooked by family.  My husband and I are here most weekends for breakfast, it is always lively, clean, and the staff is friendly and familial.  Our food always comes quickly and we are never wanting for refills on water or coffee.  Almost anything that can be made in house, is made in house and you can taste the difference.  Stella's is everything you want from an old school diner and more.<br><br>Today I was feeling under the weather and went in looking for some soup.  Gus told me what he had on the menu, and when I politely declined due to food allergies he asked me what I could eat, told me to sit down, walked back into the kitchen and came back with a little cup of chicken and rice soup he just made that second.  Just for me.  He told me they keep their broth separate from the noodles for Chicken Noodle Soup and he had a few things he thought would be good with it and just threw something together for me.  If I didn't like it, no big deal - but if I did (and I SURE DID) he was happy to help.  I was already a Stella's die hard , but that just sealed the deal for me.  He went above and beyond without me even asking, treated me like family and made a life long loyalist out of me.", "pics": null}}, {"review": {"des": "We love Stella's diner. It's amazing for breakfast, if you ask for crispy hash Browns they will make them well. Everything is good, it is a clean and friendly place. The owner is usually there and the waiters are great. Entrees are abundant and the price -quality relationship is good too, specially for the location.<br>We go there really often and so far not once we have been disappointed. It's for sure a safe bet!", "pics": null}}, {"review": {"des": "Was an acceptable alternative to the Melrose Diner, but now the the Melrose has closed, lets see if Stella's rises to the opportunity and earns that 4th star. I will have to eat there soon and update this review. Meanwhile I had the best Croque Monseur at Nookies on Halsted outside of France or San Francisco recently.", "pics": null}}, {"review": {"des": "The service is very friendly and helpful and the place has a real family owned feel about it. <br><br>Lots of great breakfast options but the house pancakes are a must. You should also check out the Country Eggs Benedict which is delicious and hearty.<br><br>A great spot in the Lakeview area. Affordable too.", "pics": null}}, {"review": {"des": "It was frigid on Saturday morning and this place was busy. There's really no waiting area in the front so there were groups of people waiting for tables kinda on top of one another. They won't seat you until your entire party is there (on the weekends only) so that was a bummer. There is also only 1 men's and 1 women's restroom stall in the back. For a place that large, it would be nice to have more so the wait isn't so long.<br><br>Once we did get seated, thankfully it was towards the back half of the diner so we weren't surrounded by the other waiting patrons, our server (didn't catch his name) was very upbeat. The menu has a good number of options and breakfast specials so there's something for everyone. My eggs were scrambled a little harder than I would have liked (I asked for soft) so with the cheese on top it looked rather dry. I added hot sauce and such so it was fine. My meal came with pico, hash browns and warm tortillas on the side. Overall, I was satisfied but not overly hyped. The price was right though and I think it might be BYOB.", "pics": null}}, {"review": {"des": "Decided to give Stella's Diner another shot with my love for Sunday Brunch. Beware, they are packed to the rim on Sunday. This is typical of a lot of restaurants in Chicago during brunch but having no designated waiting area sucks. Not only for the people waiting but for the people eating or staff trying to move around. <br><br>Service was where the three stars come in. Everyone forgets at least heck on your table to see if anything is missing. Drinks and parts of our food order made it at the tail end of our meal. <br><br>The food itself was okay. You get what you pay for here. Nothing to rave about but it doesn't taste like cardboard. The skillet is the way to go here. The waffle was good but my sausage links may have been old. All in all a decent meal for the price.", "pics": null}}, {"review": {"des": "Met at the door with a friendly greeting from the owner. Family owned and worked!!  We had turkey club & fries and the country fried steak dinner.  I had chilli with my dinner. EXCELLENT!  A mix of Midwest chilli and Tex/Mex. The mashed potatoes  are Real!   The turkey in the club sandwich was off the real turkey, delicious!  All the food was made in house!  No canned gravy here!!<br><br>We wanted to try the desserts but we are way too full!!!<br><br>We are definitely coming again!!!", "pics": null}}, {"review": {"des": "Stella's is our absolute go-to. The food is always comforting and tasty, the service always friendly, and the prices very fair. <br>We've been for breakfast a handful of times. The egg and hash brown skillets are amazing, the hungry person is a favorite, and I've gotten my sugar fix a few times with their fluffy pancakes. They keep your coffee mug full! <br><br>Honestly, I've never been disappointed. <br><br>If you're looking for fancy-shmancy food, this isn't it. If you want a burger and a shake served in a familial atmosphere, you have to go to Stella's.", "pics": null}}, {"review": {"des": "I've been to Stella's a solid 15 times. It's okay if you're looking for a cheap fast breakfast but the quality just seems sub par considering the neighboring options. They have \"NO SUBSTITUTIONS\" written clearly on the menu- always a nice way to let you know they're not too accommodating so just pick something and run with it. What puzzles me is the dichotomy between the wait staff and the host staff. The wait staff are professional and friendly while the host staff, particularly the woman on the weekend mornings, leave much to be desired in the customer service department. Please note I have really only had breakfast and lunch (maybe 1-2x) so I can't speak for their milkshakes, one thing they are supposed to be known for.  If you're in the neighborhood it's worth a try if you're little pressed for time, if not try Wilde down the street.", "pics": null}}]}