{"name": "sticky-rice-chicago", "reviews": [{"review": {"des": "I had the pleasure of enjoying sticky rice with friends who lived and have been to Thailand plenty of times. Yes, I indulge in the occasional Thai plate but I'm not experienced and don't know my way around any such menu.<br><br>10 dishes later we called it quits, more so we couldn't eat any more. Mango Sticky Rice is my new jam. Green curry, tom yum soup, pad Thai, pad this, pad that.. at a certain point I didn't care what it smelled like I was eating it. <br><br>Wowzaaaa!", "pics": null}}, {"review": {"des": "This is my fav thai restaurant!!! We had ordered couple of times and the food was always on point. Will make it a regular spot for sureee.<br><br>We've tried their mussel red curry, their red snapper dish, the sweet and sour shrimp and the banana in coconut milk dessert dish and they were all great. They were definitely not stingy with the proteins in every dish. <br><br>Cant wait to try more :D woohoo", "pics": null}}, {"review": {"des": "This evening we ordered Crab Rangoon, Larb (chicken), pad woon sen, and Rama Chicken. <br><br>Crab Rangoon-under fried, wonton skin raw inside<br><br>Larb- sat in the marinade too long the Chicken had a terrible texture, bone dry, lacked flavor. <br><br>Rama Chicken- Sauce too loose/flavorless. The rice was over cooked and mushy. <br><br>PWS- ok. <br><br>Will not be ordering again. The quality of their food has steeply declined.", "pics": null}}, {"review": {"des": "Oh dear Lord in heaven, thank you for northern Thai food! This year, I discovered my love of Northern Thai and Laotian food (thanks Thip Khao and Padaek!). So, when I was in Chicago with my mom, I just knew I had to have my my try it Bc I knew she'd fall in love with the amazing flavors and freshness of everything. <br><br>Important-- This place is BYOB! Indulge.<br><br>As for the food, just amazing. We had a little feast between the two of us: northern Thai sausage, crispy rice salad with fermented pork, spicy beef larb salad, crispy pork belly with Chinese broccoli, pork spareribs in tamarind sauce, and mango with sticky rice. You guys! UGH. I would go back right now if I could. <br><br>Northern Thai sausage-- DOOO IT. Fragrant, delicious, nothing short of amazing<br><br>Crispy rice salad-- the crispiness of the rice was on point, and the lime juice and fresh herbs made everything pop<br><br>Spicy beef larb salad-- I don't think this dish can be done wrong. My mom loved this one bc honestly it's one of the best salads ever <br><br>Crispy pork belly and Chinese broccoli-- my least favorite, but still good! I would've liked bigger pieces of pork belly<br><br>Pork spareribs in tamarind sauce-- the sauce is so good, I was eating it off of a fork! Get this!<br><br>Mango sticky rice-- so good! The first person to incorporate rice into desserts is a real hero <br><br>Service was fast and did I mention the food is affordable?! We got all of that for about $60! I will be back next time I'm in the Chi.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5zateLo9GuVorCn5iK3i6A/348s.jpg", "caption": "Spare ribs with tamarind sauce"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nNjNaZ_ADkUjBzj_g5HMdw/168s.jpg", "caption": "Larb Salad with beef"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1lswXMAJLjj2YAVq-uJyvA/168s.jpg", "caption": "Crispy rice salad with fermented pork"}]}}, {"review": {"des": "Best tom yum soup in Chicago!<br>Real  authentic Thai food, spent many years in Thailand. I recommend Tum Yum Tiger Prawn soup.", "pics": null}}, {"review": {"des": "We came to Sticky Rice for lunch and were fortunate enough to find a table. With Ribfest going on just around the corner it was expected. I've been wanting to come here for awhile now and finally made it. <br><br>I started off with my usual go to Pad Kee Mao. I had asked for a little bit more spicier than usual, but I'm pretty sure they misunderstood my request because I got a dish that didn't have any spice to It whatsoever. Despite that, the dish was phenomenal. There's nothing chili powder can't fix. The dish had so many intense flavors, the beef cooked to perfection and the tomatoes and carrots added to enhance the dish and cool down the heat. You can also taste the Thai basil within every bite. I really did wish I could have more despite me already being full. My wife ordered her usual pad see ew and it also tasted delicious. Not really sure why most Thai places don't offer sticky rice with mango as a dessert, but fortunately for Sticky Rice, they did offer some sticky rice. And was a pleasant way to end your meal with. A warm delicious sweet sticky rice with slices of fresh mango!<br><br>I would say they were consistently slow throughout our meal. They didn't check up on us, I had to call and ask for the chili powder. When we were done with our entrees, they gave us our check without asking if we wanted dessert. And then to get our check finally after that seemed like forever. And then paying was another 10 minutes. The food was fantastic, if they could improve on the above, they'd get 5 Stars for sure. I'll still return without a doubt.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TzyJ4vu7cTwTZ2IQuFgkdg/168s.jpg", "caption": "Sticky Rice w/ Mango"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qFprgEmOC9cnVkD_i6G8ag/168s.jpg", "caption": "Pad Kee mao w/ beef"}]}}, {"review": {"des": "Sticky rice is a BYOB, have fun with that, we did.<br><br>We went in with a party of 8 and they were able to accommodate us fairly quickly. We came because one of my buddies is a regular. The flavor and authenticity of the food here is strong. It's always a good sign when you walk into an ethnic place and white people are in the minority. <br><br>We leveraged the fact that we were a party of 8 to order a bunch of dishes and try a little bit of everything. We had most of the appetizers and a good amount of entrees as well.<br><br>We were ravenous and also kinda (very) drunk by the time we got our food. I really enjoyed the Thai sausages. They were a little bit more starchy than most sausages but were full of spice. Despite their small size, these sausages were quite a tasty package. <br><br>I also remember loving the fish cake. It's almost in the form of a mini pancake. There was a LOT of ginger. <br><br>The kow soy was the best thing I ate here. It was creamy, spicy, sweet, and savory all at once. It was Thai tastebud euphoria.<br><br>Also, big surprise, this plate has pretty dope sticky rice.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5fwX2JLAVEkKoMlUrm1ldQ/168s.jpg", "caption": "Sausage"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iv8TX1OOVN14vHmOdF7lyw/168s.jpg", "caption": "Drunken noodles"}]}}, {"review": {"des": "Yay! Sticky Rice is just as good as I remembered it to be. I recently returned to the city after a decade hiatus (burb life and all...), and I was ready to return to some of my much loved Thai restaurants. I got the chance to stop into Sticky Rice for lunch. <br><br>We ordered two lunch specials-I ordered a Thai iced tea which was pretty big and delicious, noodles with beef, and for dessert I ordered the banana in sweet coconut milk. There seemed to be only one person working for lunch time on the weekend, and service was a bit more laid back, but I didn't have anywhere to go in a hurry. It did not bother me at all. Everything came out hot and tasty. The noodles were great and the dessert is always heavenly. I also thought portions were quite decent for the price. <br><br>I missed Sticky Rice and now that I am in the area again, I will definitely be returning.", "pics": null}}, {"review": {"des": "Really really good food. Service is sub-par but it's worth it for the food. Don't come if you're in a hurry! BYOB is always a plus. The portions are big and it is really reasonably priced. Will definitely come back.", "pics": null}}, {"review": {"des": "Of the few Thai places I've tried so far in Chicago, Sticky Rice has the most comprehensive menu and feels true to its Thai roots. Every time I dine in there's never been a wait and service is usually timely. <br><br>They make an excellent dessert sticky rice wrapped in banana leaves. I like the taro one the most, but they also have banana and mango options, which are also very good. If you come here, order dessert first! I've tried a bunch of items off their menu, from duck curries to vegetarian to whole fish, and all of them were solid.", "pics": null}}, {"review": {"des": "This cute little place has me wanting to stay in Chicago longer than the original plan. It took me about 4 years to figure out this place! Now I want to go back here all the time. The authenticity of this place is 10/10. <br><br>We got the northern platter, papaya salad, sticky rice salad, pad see iew, and desserts! And holy crap, everything was awesome. There nothing like this back home. I love the spice they added, it was perfect. <br><br>My favorite out of all is the sticky rice salad. It's crunchy and sour. The perfect combination. I need to come back and try other food! It's too good to not go back.", "pics": null}}, {"review": {"des": "In search of my go-to khao soi in Chicago/Chicagoland, I found Sticky Rice recommended on reddit. Enjoyed the flavorful broth, better than Opart Thai's, but wished the noodles were better, less overcooked. The moo tod (fried pork) lunch special had a thick, addictive crunch, like Brown's buttermilk chicken, and it came with a Thai iced tea ($8.99, Mon-Fri). We also tried their Thai iced coffee, and it was the favorite of the two xD. A great spot for casual dining, would return to try more from their extensive menu :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BQS2mimxJFZhYJywni5xOA/348s.jpg", "caption": "Thai iced tea and iced coffee. Coffee was our fave"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uBrGYve4insmgSaqGsJXDw/168s.jpg", "caption": "Fried pork lunch special"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EBbBkpMZZFsYmXQqjamguw/168s.jpg", "caption": "Fried pork was v crunchy :)"}]}}, {"review": {"des": "Wow! Easily the best Thai food I have had in Chicago. We started the meal with the Panang beef and bbq pork bao. Getting bao at Sticky Rice is an absolute must. For entrees we had the basil fried rice, pad see eew, and the panang curry. Highly recommend all 3. The panang curry was definitely my favorite entree though. To end the meal we chose the mango sticky rice - photo attached. Really wonderful and refreshing dessert. <br>I recommend making a reservation for dinner on a weekend. A reservation was very easy to make and without one I would expect to wait for a little bit.<br>Also, free parking on the streets around the restaurant.", "pics": null}}, {"review": {"des": "Now this spot is one I'll return too for sure. I'm a huge fan of ground chicken basil and this place makes it perfect! The kicker for me is the heat and if you ask for it, they will give it to you! I've been feeling it 24 hrs later too <br><br>The Thai iced tea was solid and the prices were reasonable. Parking is easy since there's free spots around. While it wasn't too busy, service was a tad bit slow but not horrible. People were nice and the food tasted great so I can't complain. Will definitely return when we are craving Thai food...which is often!", "pics": null}}, {"review": {"des": "Sticky Rice is a great local BYOB spot to experience true authentic Northern Thai Cuisine. Same day reservations are available usually. The dishes are all under 20$ and good to share in a group. The dishes are on the spicy side, so if you're like me, make sure you ask them to make it less spicy than regularly cooked. <br><br>I enjoyed the small portion of the tom yum soup with shrimp, it very good- If you are having a main this will quickly fill you up. I also ordered the duck and lychee curry that was a perfect blend of sweet and savoury with a side of basmati rice that broke down the heat of the curry. <br><br>Looking forward to coming back on my next visit.", "pics": null}}, {"review": {"des": "Conclusion - food is good, not great. I do want to give this place a second try though on their normal Thai cuisine.<br><br>I was intrigued by their offering of northern Thai food and good reviews, so we stopped here for lunch. They have an extensive menu (10 pages), from it we ordered items not typically found at most Thai places, just because. <br><br>Fried stuffed calamari - very interesting. Instead of cutting it into ring shapes then fried, the calamari that we all are familiar with, they stuffed it with ground chicken and other good things, then fried it. Think of it almost like a sausage, but with calamari as the casing. Very good flavor from the chicken stuffing and light crunchy batter. For the adventurous eaters out there, give this a try. <br><br>Thai pork salapao - basically a baozi with a Thai twist on the stuffing. I find it a bit dry on the inside, but the flavor is there. <br><br>Northern Thai combo - a good way to try some of the northern Thai dishes they offer. Highlight is the Nam prik nhum and the northern Thai sausage. Nam prik nhum is comparable to a bolognese, but with Thai seasoning. The northern Thai sausages I tasted lemongrass and curry seasonings, it was very flavorful, however dry. The dish was served with sticky rice, already delicious by itself, it was even more delicious when eaten with the nam prik nhum. <br><br>Vegetable soup - flavorful broth filled with plentiful veggies. I originally ordered it as a palate cleanser but ended up really liking it. <br><br>Thai custard - custard made with mung bean. Good overall, couldn't really taste the mung bean though.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cBp7rBAqWlKs6LwuamxDWg/348s.jpg", "caption": "Vegetable soup"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5Rwd8RGkmN8dxO508JN11A/168s.jpg", "caption": "Thai custard and Thai tea ice cream"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4ZEk_vTIWAfaQQpJg_ao2w/168s.jpg", "caption": "Vibe"}]}}, {"review": {"des": "Been here a few times. Very authentic in regards to Thai dishes. Been to Thailand and there are several items that are not on normal Thai menus. We started with shrimp dumplings, fried and pretty standard. Crab Rangoon is what you would expect. Our entrees were the kow soy(spicy) and panang curry. The curry is one of my favorites in the city. The flavor is amazing and goes great with white rice. Only wish it came with more vegetables, as it was mostly just chicken. Chicken was very tender and juicy. The kow soy was a bit of a disappointment. I think Opart Thai has a better version of this dish. I have had Sticky's beef pad se ew and fried rice on previous visits, and they are both very good. Good BYOB place.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OYkdSAk05pV9XfQckGEm3g/168s.jpg", "caption": "Kow soy"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZOPzW1Bu4y7Wsea2u5vkbA/168s.jpg", "caption": "Panang curry. One of the best in the city"}]}}, {"review": {"des": "So yummy! My family and I loved the mango sticky rice dessert so much we eat it with our meal. I had panang curry with duck and added vegetables so good! My family also ordered Red duck curry with lychee, green coconut shrimp curry was really delicious and milky and pork fried rice. Everything was SO delicious. We will definitely be back. This is my third visit and their second we always try new things and have never been disappointed.", "pics": null}}, {"review": {"des": "Food was good. They do well on most of the food. I would love to come back again until waitress asked us to pay in cash. She said credit card machine is broke down. I know she lies. But my friend took serious to check inside of her bag or maybe inside of her car. She run to outside. <br>So I observed one white woman was about to leaving. I know for sure she will pay by credit card. And she did. So I told waitress that we gonna pay by credit card as well. <br>Waitress might want to keep extra cash or avoid credit card fee. I don't know. But don't lie please.", "pics": null}}, {"review": {"des": "Ordered delivery .  Got tThe Thai boat noodle is really good . Very tasteful. Will definitely order again.", "pics": null}}, {"review": {"des": "Did you know that you could order Thai Iced Tea without the milk here, and it would taste like grass jelly? It's actually quite delicious! If you don't know what grass jelly is...Google, my friend. It might not look appetizing, but don't judge a book by its cover!<br><br>Two notable dishes to order are:<br><br>- Moo Ping: Skewered and grilled marinated pork served with spicy tamarind sauce. I love tamarind sauce! This was pretty tasty and came with three skewers, perfect number for our table.<br>- Crying Tiger: Must get this! Though this had the same dipping sauce as Moo Ping, the sauce complemented the tender meat so well.<br><br>We ordered a couple of entrées that were okay at best, and one of them wasn't good at all because the flavors were off.<br><br>The interior is bright and has an almost cafe-like, fast-casual feel to it. The tables seem to seat 2-4 people for most of them and are located on the left side while the kitchen is on the right.<br><br>It wasn't much trouble getting a table for three people at night around 8:00pm, and you can make a reservation if necessary. The service was adequate but could have been better. We had to flag down our server a couple of times for request.", "pics": null}}, {"review": {"des": "I had a quick lunch here and ordered the chicken panang curry. What I liked was that they give you a healthy size portion of chicken in the dish. The chicken itself could probably use a little more flavor but I couldn't complain too much. I had to order an extra bowl of rice to match the portion.<br><br>Thai ice tea was pretty good as well. It was not too sweet and they had the recipe just right. Overall it was pretty good. I wasn't overly impressed, I've had better thai food in the city.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nXB1iXRMXIJlE3mUiovVrw/168s.jpg", "caption": "Thai dumpling (beef)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/H7MkTpQE32CsgyulAxWQOA/168s.jpg", "caption": "Chicken panang curry"}]}}, {"review": {"des": "Ate here once with my mom and it was just decent. This was her second time here and she said it was sub-par compared to other restaurants and now I see why. This restaurant specializes more in Northern Thai cuisine. I was excited to try this restaurant, because a lot of restaurants don't carry Norther style Thai food choices. Overall the food was okay, because everything was very sweet and was missing other flavors that Thai food is associated with (sour, salty, spicy, etc)<br><br>1. Northern Style Thai Sausage is tastey and flavorful, although dry.<br>2. Fried chicken is nice and crispy. The sauce, however, was very sweet. <br>3. Pork Larb was unnaturally sweet. Didn't get the sour lime flavor that is usually associated with this dish. Also asked for a little spice, but barely tasted any. <br>4. Marinated pork satay was good. Just the right amount of sweetness and perfectly sticky. Good when paired with sticky rice. <br><br>The best thing we had, however, was the dessert. <br>I tried the durian with sticky rice. There was A LOT of durian (not for the faint of heart if you don't like the smell) which was soft and sweet. The sticky rice was at the bottom of the bowl it came in and was a healthy amount; perfectly portioned with the durian. It also came with a lot of sweet coconut milk, almost like a soup portion. <br>My mom got the banana in coconut milk. It was similar to the durian with sticky rice, but minus the sticky rice. <br><br>All in all, I wouldn't go here again for Thai food, but I appreciate what they're trying to do by specializing in Northern style cuisin. I would come back for the dessert, though, because it's hard to find decent durian to eat!", "pics": null}}, {"review": {"des": "I've only dined here once and it was good but not great. The menu is extremely large so perhaps I ordered wrong. I got the lemongrass chicken and it came out with zero vegetables. I expect Thai food to have meat and veggies all cooked up together, so I was disappointed. I did also find the chicken to be a bit on the dry side. The spring rolls were good and all of the others in my party liked their meals. <br><br>The menu says there are no substitutions, which I get especially as many dishes have sauces that are already prepared, etc. But my lemongrass chicken said it came with jasmine rice and I asked for sticky rice instead and was told no. But when my dish came out the rice was served on the side. So why wouldn't I be able to get sticky rice?? Hardly seems like an accommodation when other dishes come with sides of sticky rice. It seems very odd. I'll probably give it another try either for dine in or delivery but I'll be sure to order more wisely.", "pics": null}}, {"review": {"des": "Among the best Thai food I've had in the U.S. Get the Khao Soi and Northern Thai sausage.", "pics": null}}, {"review": {"des": "This place is absolute fire. I had the Thai sausage appetizer paired with the Tom Yum soup to start. Very flavorful; the sausage was bursting with seasons and the soup had a lime-y buzz with a strong spice kick. That shit was bangin. The palapoas are good too, had a couple of those. They're pretty much just a tastier Wow Bao. For my entree, I had the northern Thai bolognese dish with a side of sticky rice - TALK ABOUT FLAVORTOWN! Finished off the meal with the sticky rice mango dessert and the mango ice cream. That shit was so bomb I salivated. <br><br>This place is fairly priced too cause as you can see I got a shit ton of food. Between my homie and I, we had three appetizers, two soups, two entrees and two desserts for $50. And this spot is byob so it was extra lit.<br><br>The only reason this place doesn't have five stars is cause I caught ol' girl packing my leftovers with her bare hand lmao. She was just plucking all the veggies off my plate and tossing them into a box. We made eye contact and it got awkward so she stopped touching the food with her hands and grabbed a fork. Other than that, the food is bangin' and fairly cheap. I'm definitely gonna go back cause fuck it - shit was delicious.<br><br>Smash or pass? Smash this shit", "pics": null}}, {"review": {"des": "Fried rice and scallion pancakes. Very American I know, but I really enjoyed them. It's inexpensive. Easy and convenient. I believe it edges out the Thai place next door. Will be back again.", "pics": null}}, {"review": {"des": "veggie rolls were okay, not a great sauce for it, my green curry with veggies was spicy at least<br>I didn't love the sauce served with the spring rolls, would have been better to have the sauce be more of an apple or pear based sauce. The green curry was spicy, but the taste was very average at best.", "pics": null}}, {"review": {"des": "Excellent Thai food. We tried multiple dishes between the six of us and they were all great. Penang chicken and the roti were our favorites, but the bao was absolutely phenomenal.", "pics": null}}, {"review": {"des": "Came here for the lunch special which is until 4pm every weekday and has 5 preset options which include a few different northern thai dishes along with a side, rice, and thai iced tea for $9. Seems authentic enough, and if you're willing to venture out and get their specialties or northern thai dishes, you'll be rewarded with deliciously spiced meats, curries, and various other dishes. The Northern thai sausage is made-in house and is a savory and interesting curry base with a nice uplifting note from the ginger and lemongrass. Nam Prik Ong aka what they call 'Thai bolognese'? Get some sticky rice and start scooping, it's like an Asian sloppy joe and very satisfying. And for stewed meats, the Gang Hung Lay(pork in garlic ginger and chili paste) was a sharp, spicy, sweet mix that was good enough to lick the plate afterwards. Only had a few things here but flavorwise, everything hit the spot. Add onto that quick and accommodating service, a nice bright atmosphere, and affordable prices for family style dining, and you have a great place for single diners or large groups. With other dishes like garlic ribs, Crispy rice, larb, tamarind tilapia, and more, you can indulge in new exotic dishes and keep coming back for more.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/h94jKDZQuB5bjYZPRdtPTA/168s.jpg", "caption": "Lunch combo #4"}]}}, {"review": {"des": "Wow. Eating here felt like I teleported back to Chiangmai! Actually, the quality and flavor of the food here probably surpasses some of the food I ate in Thailand. This place is the real deal and I want to come back ASAP!!<br><br>We ordered:<br>- Tom Yum w/ Shrimp: I've never been a huge fan of Tom Yum at most Thai places because I always get it was too sour. Their soup here reminded me of the Tom Yum that we hand made in our cooking class by hand making the stock from lemon grass and kaffir like leaves. So fresh and fragrant!<br>- Shrimp in Blanket:'Admittedly probably not the most authentic thing but we love shrimp, so.... it was pretty delicious. Super crispy with great sauce. <br>- Kow Soy: AKA THE thing you have to eat in Chiangmai. The portion size was humongous and difficult to finish. The flavor? Just like I remembered it. Smooth and creamy curry with chewy and crunchy noodles. <br>- Gang Hung Lay: Recommended by the waiter, and my personal favorite dish of the bunch. Super tender braised pork cooked in a rich chili paste sauce. Definitely adding this to my list of favorite Thai dishes. <br><br>Definitely look no further for authentic Northern Thai food!", "pics": null}}, {"review": {"des": "This review is strictly on the Thai Boat Noodle dish. It is so good! I think, it's the best one in the area. I haven't tried other dishes because they are a bit high in comparison to other Thai restaurants around the area. If you're looking for the closest authentic Thai Boat Noodles in Chicago area, this is it!", "pics": null}}, {"review": {"des": "Worst food ever!! We ordered 3 entrees and 2 appetizers. Definitely not worth the $60.00. <br>Each dish was bland. No flavor at all. The vegetables were so hard they weren't even cooked through. The glass noodles were all literally stuck together not one came apart. <br>Never ever again", "pics": null}}, {"review": {"des": "Good Thai restaurant. They cover cuisine from the Northern region away from Central region aka around Bankok. Northern region Thai cuisine is more exotic. It's sad because they used to serve silkworms as a exotic appetizer which they do not do back 10 years ago. Most Westerners would find eating that gross, disgusting or repulsive but I came to try it out of curiosity and apprehension. Silkworms taste almost like shrimp with popcorn crunch. Wish you could bring this dish back on the menu. Also funny because there is another Thai restaurant called \"Thai Room\" so I wonder who gets the most business in Thai cuisine?", "pics": null}}, {"review": {"des": "Excellent food. Appalling service.<br><br>As a first-time diner at Sticky Rice, I was impressed by the extensiveness of the restaurant's menu, and the overall quality of its food -- much of which is vegetarian friendly, and all of which is reasonably priced. However, my experience there made me seriously question whether it's worth a return visit. <br><br>Our party arrived at 8:30, a full hour-and-a-half before the listed closing time. And while our food arrived quickly and as ordered, the restaurant staff completely ignored our table from then on. Nobody checked back to see if our food was okay, or if we wanted anything else (we did), or even to refill our water glasses -- they were too busy stacking chairs on tables, sweeping the floor and enjoying their own \"post-work\" meals. And then we sat there for a good 30 minutes after we'd finished our food, vainly trying to catch someone's eye so they could bring us the check and some to-go containers. We seriously considered just getting up and leaving without paying, since the odds seemed pretty slim that the staff would even notice or care...<br><br>Look, my wife and I have both worked in the food service industry, and we understand that kitchens usually close before their restaurants do; we also understand that employees don't like to hang around past closing time while patrons linger at their tables. But it's not like we were intentionally lingering; and we finally left at 9:45, 15 minutes before closing time. If the staff had wanted us to leave sooner, they could have simply brought us the damn check in a timely manner.<br><br>Honestly, it really doesn't take that much effort to give customers a pleasant and welcoming dining experience; I don't understand why a restaurant that puts such obvious care into its food would pay so little attention to its customer service.", "pics": null}}, {"review": {"des": "I'm disappointed. They could even get the rice right. It was undercooked and hard. The Pad Prik King which is basically sautéed green beans with minced meat in a curry sauce was also undercooked, but tolerable. I tend to like my veggies on the raw side anyway. The sauce seemed generic and canned. It's probably the same brand my family buys from the Thai grocery, but we have enough sense to add extra flavors to the mass manufactured concoction. <br>At least dessert was good. The Kowtom Mudt (banana & coconut sticky rice wrapped in banana leaf was sweet, aromatic and steamy. <br><br>I can't give this place a good review, but I will give it another chance.", "pics": null}}, {"review": {"des": "How did I not come here before?? So far it's the best Thai I've had in Chicago. <br><br>Just order a bunch of stuff you haven't had in other Thai places, you'll see what I mean. <br><br>For whoever likes Kow Soi: get it here. With beef. Awesome.", "pics": null}}, {"review": {"des": "Sooo, I called for delivery and I live 1.7 miles from their restaurant, that's 5-7 minutes drive from the restaurant. They told me they can't deliver because it's out of the area. What in the world??? They're located on Western and Irving Park, I'm literally by Foster and Western. Now tell me how that's considered out of the area??? Mind you when I called to ask for delivery, the girl told me no. So I asked if they even offer delivery because this is the first time I order from this restaurant, and she said yes, they have delivery. I'm confused. So I said to her, since you do have delivery, I want that service, please. She then passes the phone to another person who speaks a little better English and that's when they told me I'm out of the area and if I want to pick up instead. Ummm, if I was able to pick up then I wouldn't have even ask for delivery!!! The nerves.", "pics": null}}, {"review": {"des": "Spectacular, fresh Thai food- We had the fantastic salapao, yum nuer, pork larb, and nam crispy rice, and delicious mango and sticky rice for dessert. Each dish was perfectly spiced- balanced, not sweet. I wish we lived in Chicago- I would eat here every day. Lovely staff, pleasant dining room, and very reasonable prices. Please open a restaurant in New York City!", "pics": null}}, {"review": {"des": "I always pass by this place whenever driving to my boyfriend's house but never checked it out. Today,  we were craving thai food so we decided to try it out and I'm so glad we did ! This is definitely going to be one of our new thai places to order from. The thai iced tea that we got was super good and so was the food! The service was awesome as well. All the girls there were really nice and attending which is hard to come by nowadays. We will for sure be coming back !", "pics": null}}, {"review": {"des": "My husband and I are regulars here as it is not too far from our house. I think it really depends on what you get! <br><br>My recommendation: Rotee Gang Karee Chicken. <br>- delicious coconut yellow chicken curry, flavorful rice, and pieces of roti. <br><br>I've had the kow soy and it's great, though not the best I've ever had. The service is so kind though and I'd recommend trying it at least once. One of the more authentic Thai places in the city.", "pics": null}}, {"review": {"des": "So I went there last Saturday for a bday celebration.  We were contemplating whether to try this place or the one literally next door.  At this point I wished I had gone next door.  Anyway long story short, we asked for spicy pad thai and got the sweetest pad thai you have ever tasted.  I asked for shrimp and tofu, they gave me two shrimp...  :-( really???  Anyway at the end of the meal we asked to have the two plates put in to go boxes and welp they switched our boxes.  Vegan got my box and I got hers...  PS don't sit in the back it smells really bad...", "pics": null}}, {"review": {"des": "This was our favorite place for delivery. They changed delivery apps and no longer deliver to Uptown.  Bummer.", "pics": null}}, {"review": {"des": "Stopped here before a gig at the Metro for dinner, and I'm sure glad we did.  Its BYOB so feel free to grab a bottle of wine or whatever from the nearby CVS.  The menu is extensive, but I'm sure you can't go wrong with anything you order.  Our meals were delicious and memorable, and cheap!", "pics": null}}, {"review": {"des": "The food: 1/5. I tried chive dumplings and pineapple curry. Chive dumplings were incredibly greasy and I had to soak the grease with a napkin. I asked to make curry spicy, but it was unbearably sweet and had no spice to offset the pineapple. Overall, tasteless food. <br><br>The service: 3/5. Not particularly friendly, but not terrible either. <br><br>Overall: 2/5. Mediocrity at its finest.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/41OAaLBDvgDH60P7R15ekA/348s.jpg", "caption": "Pineapple curry"}]}}, {"review": {"des": "Very disappointed. Never had such a bad food in Thai place in Chicago.<br>I had a lunch combo #1. Meat very fatty and extremely salty. Pot stickers way below average and very salty.<br><br>I don't believe there was A/C on. Outside over 90 F, inside not much better.<br><br>Poor costumer service. <br><br>Sticky table and fly buzzing over my lunch did not help.<br><br>I will definitely not go back.", "pics": null}}, {"review": {"des": "We came to have lunch at this Northern Thai restaurant based on a recommendation from a good friend. During our visit, the atmosphere of this small establishment was quiet and unassuming. The décor included bright colored walls and a number of cultural artifacts. There were plenty of tables closely stacked, and enough sunlight to keep the place vibrant and well lit. <br><br>For appetizer, the Basil Pork Salapao ($1.75) and the Panang Beef Salapao ($1.75) were flat out delicious. The buns were freshly made, not too thick, and doughy enough to render a good chew. There was plenty of basil pork stuffing that came with a flagrant basil aroma. Equally addictive was the beef rendition with a sharp, complex curry flavor. I could have eaten a few more of these, and can't wait to return to try their BBQ Pork Salapao.<br><br>The Northern Thai Larb ($8.95) came with stir-fried ground pork, pork intestine, fried shallots, and Thai spicy herb serve with fresh veggies. The spicy savory profile was explosive, and nicely accompanied by a good number of fresh veggies. It was a heavier dish than expected, but the range of textures and flavors nicely contrasted our serving of Sticky Rice ($1.75).<br><br>The Gang Hung Lay ($9.50) was cooked with pork, garlic, ginger, and northern style hung lay chili paste. There was a good amount of pork cooked in a range of rich, sharp, and complex ingredients. In particular, the hung lay curry flavor was spicy and complex, and nicely embedded in the pork which was thick cut and easy to chew.<br><br>Service was patient, friendly, and attentive. Overall, I thought the dishes were authentically executed, and spicy enough that we didn't have to use the side of prik nam pla. I would be very interested in returning to try the rest of the Northern Thai dishes, including the Sausages, Spicy Noodle Salad, Ap Pla, and Kow Soy.", "pics": null}}, {"review": {"des": "For a small place like this, service needs to be top notch. They failed miserably in this area. Lucky some of the food made up for the server's piss poor attitude. <br><br>When the three of us walked in and sat down, we informed the lady it was our first time here. \"Ok\" was her response. Ok no big deal. Maybe not a talker. She watched us struggle with 1000 item menu and didn't come offer to help at all. We didn't really know what to get, and were gunna try Thai items that we usually do not get. I heard great things of their authenticity. We ordered 2 northern that sausages (1 would have been enough), large Tom Yum (small would have done), larb chicken, kai soi, pad Thai, nam prik king, and fried rice. Needless to say, she didn't tell us we ordered way too much food. And that wasn't really the problem. Hey, it was my first time here and I wanted a bit of everything. <br><br>Let me start with food. Sausage. Damn good and almost gamey. The soup. Eh. Average. Larb. Worst larb I ever ate. Not sure what the crunchy crap in there was, but it had to go. And not enough lime flavor. Kai Soi. I've had better and more authentic tasting (per someone who tried dan Thai and frequents Thailand often). Prik king. It was ok. The pad Thai. Average again. The fried rice was damn good though<br><br>So when it came to packing up leftovers, we tried to help her out by giving her 1 or 2 dishes at a time as we continued to eat other things. As there were 3 of us, we asked to pack the rice and pad Thai in 3 separate containers. She gave a pissed off look and took it back to the counter. Signaled over a coworker, and told her out outrageous request. These bitches brought the food back to our table and threw 6 boxes down and said they were busy and to do it ourself. 1) they packed up other stuff for us 3 minutes before. And 2) there were only 3 other tables occupied. Now this shit just set me off. I mean we ordered around $100 worth of food, and they couldn't pack it up for us. And to top it off, as we struggled to do it ourself, they just stood. Who do the counter and watched us as we spilled a noodle or two on the table. Again, watching us with some entitled look on their face <br><br>Never again. I don't care how many good reviews u got, I will tell anyone who asks to avoid this place like the plague. Bye.", "pics": null}}, {"review": {"des": "This is probably the best Thai food I have had in Chicago! My husband and I recently got back from Thai and we have been on a hunt for authentic northern Thai cuisine!  Let me tell you. We were not disappointed. The food was INCREDIBLE. We ordered spicy green curry, kow soy-which I recommend to everyone- and gang hung lay which is a pork speciality and we honestly could not choose a favorite.", "pics": null}}, {"review": {"des": "Lacking in flavor. The phanang curry was very sweet, lacking spice and missing veggies. I've only had it via delivery and haven't dined in. But I was so unimpressed that I don't think I be trying it.", "pics": null}}, {"review": {"des": "I am a vegetarian and this place has some pretty good food options . I ordered the Tom kha soup (coconut tom yum ) with tofu, this was the best i ever had so far. I eat a lot of tom kha around Chicago and this place knows how to add in every single ingredient the right way . I also get the coconut green curry tofu (comes in an actual coconut) it is pretty darn tasty. This place is really good and I recommend you give it a try.", "pics": null}}, {"review": {"des": "Great restaurant. Real Thai food. Nice staff. We went there for dinner last week end. Appetizers ae excellent (Satay chicken, dumplings). I had a parang curry, it was really tasty and rich in flavors. Will definitely go again.", "pics": null}}, {"review": {"des": "I haven't been to Sticky Rice in a long time and was extremely excited about an actual order of Sticky Rice to go with my soup. The container was only 1/4 filled. Pretty disappointed!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GzJ7JsnSoTls2VDBJXw6Hw/348s.jpg", "caption": "Only 1/4 filled!!! Really Sticky Rice?!!"}]}}, {"review": {"des": "I am a Thai food expert! and this is the best Thai food I have ever had in Chicago. The fried pork on rice is just simply amazing, my friend got the Red curry with chicken, and this is the bomb, you can smell the wonders of the coconut milk with all the herb and spices. You can tell how much effort they put into every single dish. Will go there again!", "pics": null}}, {"review": {"des": "Review #219 - 2016<br><br>Upon my excitement before coming to Chicago, I decided to bookmark Sticky Rice since they had so many good reviews and I saw a good list of dishes that I know I would enjoy.<br><br>We were greeted nicely when we arrived, seated right away because there were only 2 other tables there before us and given some iced water along with the menus.<br><br>Of course, being the Thai/Lao food snob that I am, my friend was more than happy to let me do the ordering.  Which I definitely did!  I pretty much over ordered because there were so many items that I wanted to try.<br><br>I ordered the Northern Thai Combo Set which consisted of some e-san sausages, which was probably the best item out of the entire combo set, pork rinds, two home-made dipping sauce to eat with the mixed veggies (which I am used to seeing them served steamed at other restaurants; however, they were not), along with a side of sticky rice.  The nam prik nhum was just ok; however, the nam prik ong was super salty.  Even when I ate it with a lot of rice, it was still too salty.<br><br>The \"nam kao tod\" which is the crispy fried rice salad was super sour.  It was drenched in a whole lot of lime juice.  Also, the fermented pork tasted old and you can tell by the color that it's not pink, but rather it was almost a white hue.<br><br>The crab papaya salad was overly sweet.  In general, the crab papaya is supposed to be very savory with a hint of fish sauce and lime juice.<br><br>The crying tiger was the most disappointing of them all.  In Thailand, the crying tiger is made with a tender steak cut and cooked medium to medium well, never over dry.  It somehow tasted more like BBQ beef versus a salad.<br><br>I guess I kind of knew in the back of my mind that the food was not going to taste anything like the Northern Thai taste because the chef is Mexican.  Not that I was being pre-judgmental or anything, but I've had a few bad experiences with Asian food that are not cooked by their respective chef.<br><br>Maybe the Northern Thai dishes are a miss because it seems like people who ordered just the regular Thai dishes were happy with the food.  Unfortunately, I will never find out since we pretty much wasted about half of the food I ordered even though we were pretty hungry & I actually left hungry. <br><br>Don't let my pictures fool you!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OFn8mBEiPDR3nJlZDg_lLQ/348s.jpg", "caption": "Too dry, wrong cut of beef & wrong dipping sauce"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HsLrnypAHcRQBtyWEYI3ww/168s.jpg", "caption": "Too sweet"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ohyL0E3t9yUezDmggGniDg/168s.jpg", "caption": "Too sour"}]}}, {"review": {"des": "Great Northern Thai food! Good service and super busy little restaurant, Som Tum Papaya Salad spicy like you would not believe! Northern sausage absolutely delicious and crispy pork with Chinese broccoli amazing! BYOB here. Friendly waitstaff.<br><br>The prices are so inexpensive and everything is great value. The menu is really extensive with loads to choose from. Can't wait to return and try lots of other menu items when we move in a couple of weeks.<br><br>Very authentic Northern Thai food!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yCq9oHj8TGaEVQxBm8E0Cg/348s.jpg", "caption": "Nam crispy rice"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GahqyEYzxUqS8OLl_ZS2bw/168s.jpg", "caption": "Papaya salad - Som Tum  &  Larb  Nau"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0wnh6kHZ8HQZHWkjdTjUQg/168s.jpg", "caption": "Northern Thai sausage with ginger and cabbage"}]}}, {"review": {"des": "Photos shared on Yelp looked awesome and as though Sticky Rice would be more attentive to detail.  Unfortunately via delivery I received a very undercooked appetizer and an entree that was marginal at best and not even made to order (I requested 1 ingredient to be omitted).  Bummer, but you might want to spend $ else where if this is their standard fare.", "pics": null}}, {"review": {"des": "As a Thai-American citizen who goes back to visit enough, I can't help but compare this to the reeeeeaaaallllll authentic dishes I've had there. With that being said:<br><br>The good - the food is all quite good and fairly priced. It's flavorful, diverse (something for everyone), and there are tons of things on the menu that are hard to find elsewhere. BYOB as well!!<br><br>The bad - it was all good but just not all the way there. All the flavors were present but muted... maybe it'd be different if I went with my parents or Thai friends, who knows?<br><br>The ugly - it smelled in the restaurant. Bathroom, fish, not sure but we considered leaving when we stepped in. Hopefully it was a one time thing. <br><br>Overall, maybe more of a take out place but until I find a better place I'll be back.", "pics": null}}, {"review": {"des": "I came here again on a late afternoon and luckily there was only another group of people there so we were seated right away. <br><br>We ordered pretty quickly the Thai noodle salad extra spicy, turmeric chicken, deep fried tamarind fish, and fried Thai chicken.  I'm not sure what's so appealing about this restaurant but my be and I always over order. It is completely unnecessary for 2 people to order 4 dishes.  It's just that everything looks so good that I can't help but want to try everything. <br><br>The fried chicken came out first, it is a dry fried chicken, so no breading, the chicken itself was already super flavorful so it didn't need that much sauce with it.  The Thai noodle salad is one of my faves here the noodles are always super fresh, and delightfully spicy . <br><br>I would definitely order the deep fried tamarind fish again, it is a huge portion for the price.  The turmeric chicken was a bit too sweet for me, but if you like sweeter foods you would definitely enjoy the turmeric chicken. Service is always friendly here, and you can tell they appreciate your business because they are so attentive.  Next time I come I will probably end up ordering different items as well, I am usually the type of person to stick to my tried and true but at this restaurant you can do no wrong trying different things.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/m9wM1qjOE2gA2mfSuT6Dsg/348s.jpg", "caption": "Dry deep fried chicken"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oI_0cMNVi8oK-CdAZCxz2w/168s.jpg", "caption": "Spicy thai noodle salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BiyGTvChhofNgUWUf59X8w/168s.jpg", "caption": "Deep fried tilapia with tamarind sauce"}]}}, {"review": {"des": "The Tom Yum really was my favorite part of the meal. The large portion is enough for 2-3 people to share. Being unable to take spice well, the northern Thai sausages really packed a punch for me. But the tom yum was flavourful and appetizing. The onions were delightfully sour and crunchy; surprisingly it didn't have the awful raw poignant slap-in-the-face flavor that crunchy onions typically comes with! <br><br>The name sake sticky rice was a great accompaniment to the various items. However the pineapple curry left me desiring more. Think I would have chosen something more complex as the flavor profile was quite basic. <br><br>Thai iced coffee is to die for. <br><br>This place even has a Thai menu. Because that's how authentic the place is! Would definitely come back to try other items!", "pics": null}}, {"review": {"des": "Delicious thai place with lots of traditional dishes not found in those American Thai restaurants. Price is also friendly，$20 pp including everything！", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bbItgSjDF375_9Z8RRVrlw/348s.jpg", "caption": "banana leaf wrapped glutinus rice"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mo00pbbzfFXBZXCeZQ8WuQ/168s.jpg", "caption": "shrimp w. rice vermicili"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4WkMe4-K4Kpx-ZhHZs7qoQ/168s.jpg", "caption": "Northern Thai Sausage combo"}]}}, {"review": {"des": "This is the GF's favorite Thai place. It is very tasty and spice levels are on point. one of the best Tum Yum soups I had from a Thai restaurant. usually grab an order of the soup to go after eating at the place. Their Pad See Ew is also on point. Not a fan of their spring rolls. Definitely had better Spring Rolls at Taley in West Loop. <br><br>Might have some of the soup today :)", "pics": null}}, {"review": {"des": "Don't understand how anyone could give this place less than a 5. I was recommended to this place by a couple Thai friends, so had high expectations going into it. And normally when there are expectations, the actual experience falls short. But, not for Sticky Rice. The menu is enormous, which was overwhelming. We flipped through pages of items, and i wanted 10 of the dishes we browsed through. We were so hungry and eager to order that i forgot to order my friend's recommendation which was the green curry in coconut...another reason to go back for sure. <br><br>We ordered:<br>Shrimp Pad Thai - just right<br>Crispy pork with green beans - the greens beans were naturally sweet and the pork was fried perfectly. This was my fav dish. I didnt even know this was a Thai dish before.<br>Tom Yum noodle soup - my other fav. <br>Papaya salad - hit the spot but how do you mess up on papaya salad? So it's fair with other places. <br>Mango sticky rice - mango was ripe and sweet but the rice was a tad too sweet <br>Thai iced tea - perfect!<br><br>Needless to say, i will certainly be going back and trying that green curry in coconut. I'm already thinking about my return even though i'm still working on the leftovers. <br><br>BYOB! <br><br>Warning: there's nothing to gripe about since everything was delightful. Service was great. We were seated right away on a Sunday night. Prices were affordable and diverse in choices.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1EgkiGv0q9zUH2PFNWZD6g/348s.jpg", "caption": "mango sticky rice - mangos were ripe and sweet. Too much condensed milk on the rice that made it overly sweet."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5hUR5QtFSzs6JWNl8YuI6w/168s.jpg", "caption": "papaya salad - refreshing with a good crunch. Just the way i like it."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fwxeSZZK1y_FhKRN2oLIaA/168s.jpg", "caption": "Tom Yum Noodle Soup - if you enjoy sour stuff, try this."}]}}, {"review": {"des": "what can i say?  i'm addicted to this place.  it's so reasonable, excellent & never crowded.  i've eaten many things here over the years, often eating all the appetizers in one sitting, the ribs being the most insane.  i'm also fond of the sausages.  they are very different in flavor from different regions of thailand. <br><br>we keep coming back because no other thai resto is much of an option.  why?  because this place is consistent.  you always know you will get excellent food at an excellent price-they have byob & great service as well.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vSVpYHhqxsRDHX1jLeyQ6A/348s.jpg", "caption": "Clockwise-tamarind spare ribs-fried stuffed calamari-steamed buns-eastern Thai sausage"}]}}, {"review": {"des": "Great Thai Food!! <br><br>Our Favorites are the:<br>-Chicken Pad Thai<br>-Chicken Pad Se Wi<br>-Crab Rangoon<br><br>You can't go wrong with these tasty morsels!!<br><br>Another great thing is that their FAST as we typically order delivery and it's cooked and delivered within 45 Mins (even at 6pm)<br><br>Only thing keeping this place from being 5 STARS is that it's inconsistent. We love their flavors and speed of service but the flavors can be a little inconsistent and trust me when I say we'd notice. There's been when weeks we can order from them 3 Days in a row :)", "pics": null}}, {"review": {"des": "One of the best Thai restaurants in Chicago. There are northern Thai food is really spot on. Make sure you ask for medium to low spicy if you are not used to the heat. Comparing the food I had in Thailand and to what they serve here there is little to no difference. Service is always polite and the restaurant is always clean. Bring some Chan beer to enjoy the full experience.", "pics": null}}, {"review": {"des": "If you like your Thai spicy and your rice sticky, you should really come here.<br><br>Since I have a low tolerance for spicy, everything was a notch or two too hottt for me.  But I loved the amount of lemongrass in everything we had:<br><br>A sampling of a yummy sausage and meat dip, fried pork skins, raw green beans, carrot sticks and cucumber - served with a little basket of sticky rice<br><br>Larb Pork - oooh spicy, and so flavorful<br><br>Shrimp with Noodles - glass noodles and shrimp in a flavorful sauce<br><br>BBQ Pork - a side of saucy pork <br><br>Sticky Rice in Banana Leaf (dessert) - lightly sweet, coconutty sticky rice mixed with bananas and raisins, steamed in a banana leaf<br><br>Coconut Pancakes (dessert) - lightly sweet & barely savory chubby little rice flour pancakes, half with corn kernels and half with green onions, so good!<br><br>They have a little outdoor seating area that was perfect on a warm night, & our server had a warm smiles & tinkly laugh, & was such a joy.<br><br>Yummy Thai, I'd definitely come back again!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/z6ka3zT3QCNL0f5doBiwyQ/168s.jpg", "caption": "Sticky Rice in Banana Leaf dessert : )"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZBwrEItLKymEEOzX-D84UQ/168s.jpg", "caption": "Coconut Pancakes dessert : )"}]}}, {"review": {"des": "More of a 3.5/5, rounded up for the price. Overall, everything was not bad, but it just didn't live up to all the good things that I'd heard about it. <br><br>Kua Kae: My least favorite of the night (although that was probably on me since I'm not a fan of green curry)-- from the menu, it sounded like this was primarily an eggplant dish, but it was more of an extremely spicy green curry with mixed vegetables and choice of meat.<br><br>Garlic spare ribs: Tender ribs topped with a delicious garlic powder-- highly recommend eating this one with rice. <br><br>Nam prik khing red snapper: My favorite of the night. The fish was cooked so that it was a little crispy, and it was topped with a spicy, slightly sweet sauce as well as a generous serving of string beans. <br><br>Kow soy: Super fragrant coconut flavors in the curry as well as a generous portion of noodles.<br><br>Sticky rice with taro: True to its namesake, this was delicious. It was basically warm sticky rice infused with pieces of taro, but it was so good I would gladly inhale another two orders of this.<br><br>Good prices, decent food, and a nice change from the traditional Thai dishes that you normally see.", "pics": null}}, {"review": {"des": "I brought my parents here for their first taste of northern Thai cuisine. We started off with the gui chai (chive filled dumplings that offer a vegetarian-friendly non-intimidating introduction) and a delicious Thai sausage. The sausage has a nice heat to it, I highly recommend it (you can order it by link). For an entree, I went for the kau kae with chicken - a slightly earthy spicy dish that I really enjoyed. My mother got a basic pad see ewe with tofu and was very happy. I was most surprised to see my dad go outside his comfort zone and get the sole fish with ginger - and then basically inhale it. Overall, a very good meal. I was especially pleased that they took our spice preferences seriously, bringing major heat when I requested my entree \"extra spicy\" and still making my mother's plenty \"hot.\" I would definitely go back or order takeout if I was in the area.", "pics": null}}, {"review": {"des": "Sticky Rice is a clean, bright, authentic, no-nonsense Northern Thai restaurant. This is absolutely NOT the place where you can expect to be waited on hand-and-foot. You get a very real-world, non-Westerner level of service here. But what else are you expectin', huh? The menu provided is beyond massive, and, at 12 or so plus, small-printed pages, their menu is a bonafide tome of both standard, pretty typical Thai cuisine like Tom Yum soup, Pad Thai, and Pad See Ew and then the adventurous and fun stuff (aka Northern Thai food).<br><br>Do yourself a dang favor and get fun! Be adventurous! Do you want the real deal? Do you want to try traditional, yet flavorful foods? Then please, for the love of food, honestly, do try the Northern Thai-centric menu. Sure. Sure. Sure. You can go safe and go the Pad Thai route (which -- truth be told -- I tend to go that way myself). But why deny yourself a potentially grand adventure? Try something different. <br><br>Let me break it down for you in a 3 Step Plan:<br><br>1. For your first dunk into the Northern Thai menu, go dip your toe lightly into the shallow end and try the Northern Thai sausage -$3 a piece. It is a mild, red curry accented pork sausage with pork skin and spicy herbs and served with slivered red cabbage, ginger, and minced cilantro. In short, it is the perfect introductory appetizer for any newbies. <br><br>2. Next, for those feeling braver, may I suggest the Nam Prik Ong -$8.95- and a side of sticky rice -$1.75. The Nam Prik Ong is a traditional Northern Thai, bit viscous, chili-based, pork and tomato dip that is served with chopped broccoli, carrots, green beans, and cabbage leaves. Sticky Rice describes it as a \"Northern Thai version of bolognese\"... And guess what??? It totally was like a Thai bolognese. Using your hands to shape a small round of sticky rice, you scoop up some of the Nam Prik Ong. And experience a totally addictive, tomato-y, porky, delicate, yet smoky whisper of spice. Not at all overwhelmingly so. Eat. This. Now.<br><br>3. When you're ready to leave the shallow end, go plunge to the deep end. Seriously, submerge yourself. And try the Nam Crispy Rice - $8.50. The Nam Crispy Rice (i.e. Naem Khao Thawt or Nam Kao Tod) is a Thai salad that consists of crumbled, crispy, curried rice croquettes, fermented pork sausage (naem), slivered pork skin, dried chilies, shallots, cilantro, shredded carrot and ginger, and peanuts scattered over a bed of red lettuce. And, man, oh, man, is it the best damn salad ever. The tang of the fermented pork sausage + the freshness of the cilantro + the soft bite of the ginger + the gentle heat of the chilies + the beautiful interplay of textures from the crispy rice croquettes and everything else = pure, unadulterated food bliss. <br><br>Once you forego the standard fare and try the fun side of Northern Thai cuisine, you won't want to go back. I promise.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OWY5puDCXPtLYerV-3yyVw/348s.jpg", "caption": "Nam Crispy Rice"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/P1-tNS3Q6SfL8YrYhcVWaQ/168s.jpg", "caption": "Nam Prik Ong with cabbage, green beans, carrots, and broccoli"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FTWvgM0Hs9aVSH4wFyMLbA/168s.jpg", "caption": "Northern Thai sausage with cabbage, cilantro, and ginger"}]}}, {"review": {"des": "I am on a mission to find the best Pad See Ewe in my hood and I would have to say Sticky Rice was pretty satisfying. I ordered online for 7:00 PM delivery and they came right at 7 with very hot food. My order consisted of Pad See Ewe with Tofu, Crab Rangoon and Fried Egg Rolls. Pad See Ewe was great but I do tend to like mine a little more saucy and sweet but best I've had in a while. The apps where great, Crab Rangoon was crispy and filled perfectly and the egg roll wasn't greasy and I loved the noodles in it, made it feel lighter.", "pics": null}}, {"review": {"des": "What a horrible experience! We ordered online from their website and received a confirmation email. After an hour of waiting, we called to see what was going on and were told that the order was out for delivery. After waiting another 30 minutes, we called again and were asked for our confirmation number. When we gave it to them they said, oh, we just received your order! This was an hour and 40 minutes after we received a confirmation email! And after someone had already told us our order was out for delivery! Obviously, we said we were canceling the order and they were hardly apologetic. Will never give them our business after this experience!", "pics": null}}, {"review": {"des": "My goodness, when my friends first told me that we were going to get \"pineapple fried rice\" at a Thai restaurant, I was thinking, \"Here goes another ultra Americanized Thai restaurant that probably also serves sushi and chow mein too.\" But it wasn't.<br><br>From the staff to the food, this restaurant screams authentic Thai cuisine. Okay, since I said that, I do have to put a * and say that the plating was very well done, better than I would have expected of a traditional thai restaurant.<br><br>I personally had the basil ground pork over rice (For $9.50 without tax+tip), which was excellent. I asked for it \"spicy hot\" which packed quite a punch, which I loved. The flavors were so similar to that I had when I was in Thailand previously and it really brought back great memories.<br><br>To add on to that, the portions were generous. I didn't expect it. I had enough for a small but hearty meal the next day. The flavors were just the same, and brought back the same joy and excitement I had the day prior.<br><br>If you're in the mood for for authentic Thai cuisine and miss having to think twice about getting it spicy, this is the place for you.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QtlRjspRXsG8Bx0CoV8UPA/348s.jpg", "caption": "Basil Ground Pork with rice. $9.50 pre-tax/tip"}]}}, {"review": {"des": "I had wanted to try Sticky Rice for quite some time. When I finally did, I was totally let down. People seem to love Sticky Rice toting it the best Thai in the city. Ehhhh, I disagree strongly.<br><br>The Chicken Pad Thai did not impress my dining partner or myself. Pad Thai is one of those staple Thai dishes that people of my translucent coloring flock for and it's a dish I feel like I can easily use to compare Thai places. With Sticky Rice's dish being subpar, it just sets the tone for the whole meal. The Chicken Pad See Ewe is one of my go tos and it was decent though not the best I've had. The dish was not as mind blowing as I had expected. The chicken curry was another mediocre dish and my partner wasn't even interested in finishing it.<br><br>Everything was fine and we ate most of it...but there are just so many better Thai spots in the city! Don't buy into the hype and try somewhere else for yummy Thai.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0injimfn2tvU_GlUMFChzQ/348s.jpg", "caption": "Curry does a body good."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IXqDnRmiXI7ZdE_Ku90Srg/168s.jpg", "caption": "Chicken Pad Thai"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Nq46P3jCI9LAePvAynaawg/168s.jpg", "caption": "Chicken Pad See Ewe"}]}}, {"review": {"des": "This is the most authentic Thai food I've found in the city.  After travelling through Thailand last year, I'm always on the hunt for a place that serves up dishes similar to what I enjoyed on the trip.  <br><br>With my first bite of the Tod Mun, I was immediately transported back to Bangkok in my mind.  The green curry was also a winner, though I wish that the tofu was more flavorful. <br><br>Add in the fact that it's BYOB and you have a winner on your hands.  Can't wait to come back!", "pics": null}}, {"review": {"des": "This place was super packed when we went. Table next to us literally a few inches away. <br><br>Service was friendly and accommodating; food was good.<br><br>I recommend their siopao, calamari and sticky rice with mango (all addicting). <br><br>Also had the red snapper fillets, crying tiger and a noodle dish. All were fine, nothing special.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0xCU0mVULCDKJS0zp_5OPw/348s.jpg", "caption": "Sausage appetizer"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/o3gMAlpEBLlb7WJ9cyaPOQ/168s.jpg", "caption": "Fish tofu soup"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/umSc0jyxcscaALre8v2rMA/168s.jpg", "caption": "OC tail soup"}]}}, {"review": {"des": "It was a pretty nice place. A lot of choice in their menu. Was easy to get a table since we went pretty late on a Saturday afternoon. Got the Red Curry with veggies and shrimp and it was pretty awesome!<br>We also got the steamed shrimp dumplings (Shu-Mai) which was really nice. Everything was hot and fresh; service was pretty quick and good. <br>We did enjoy this place a lot!", "pics": null}}, {"review": {"des": "This is our favorite Thai restaurant to come to when we visit Chicago. We like that it's unassuming and easy to get into. The food is always good, and the waitstaff is quick and friendly. It's BYOB, but we just usually fare with water. Get the sticky rice with mango for dessert. It is lovely, fresh, and light after a big meal. We will be coming back here again.", "pics": null}}, {"review": {"des": "The Tom yum was delicious!  Would love to have that again.  Service was prompt.  Our server paid attention, and quick to come over if we needed anything.  Would absolutely come back.", "pics": null}}, {"review": {"des": "This is my go to Thai restaurant since high school and I'm never disappointed with my order whether it be their noodles or entree. I came with a friend the other day and tried their lunch combo for 8.99, I cant actually remember the items for the lunch combo but I got the combo 1 - garlic spare ribs (which I had before and knew what it tastes like and just went with it), side of dumplings, rice, and it comes with Thai Iced Tea. They actually give a healthy portion so I say it was worth my money. The only thing I can complain about is that most servers don't even speak English which is hard if I'm trying to ask something from the menu and that most servers here have attitude and go behind the counter and talk in their language. Conversing w each other in their language is not a problem at all but giving the customer an attitude and talking behind the counter in your language, some would assume they're talking about the customer. Other than that, food here is good. I recommend this place and will come back again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XSbr5vIcSmkovzsSjY0AcQ/348s.jpg", "caption": "Lunch combo 1 - garlic spare ribs, white rice, dumplings, and Thai iced tea!"}]}}, {"review": {"des": "I came to this Thai restaurant as recommended by my cousin. This place is small but has adequate seating options! The noise level of this place might be due to the fact that its BYOB...We tried the Crab Rangoon, and Beef Pad Thai. I really liked the Pork pad see ewe, Chicken panang curry medium spice level, and Beef Thai fried rice with fried egg! Service was good and food came quick even though it seemed pretty busy on a Sunday night...Another thing I'd like to acknowledge is their prices are reasonable for the generous portions of their dishes;however, they ought to be more attentive to giving more than just 1 small bowl of plain rice for all the dishes we ordered...", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ALEOTHQMDHhmFZyb0uZCiA/168s.jpg", "caption": "Beef pad thai"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/X4F4FAm9lue_Z3v9kUxj5g/168s.jpg", "caption": "Pork Pad see ewe"}]}}, {"review": {"des": "The food here is definitely very flavorful and well-prepared. A lot of the sauces have an unusually good blend of spices, and the menu extends well beyond the usual assortment of Americanized Thai dishes. A lot of interesting and satisfying combinations of flavors are available and pleasantly surprising.<br><br>A lot of the dishes don't come out as hot/fresh as would really be nice, which is unfortunate.", "pics": null}}, {"review": {"des": "Our family have been here once before and honestly 3 years ago the food was decent, not so much now. There are just about 500 items on their never ending menu. Got there around 8:30pm, ordered 5 items and the food literally came out within 3 minutes! Hmmmmmm..too fast almost. The pineapple fried rice was ok, pad thai was superrrrrrrrr sweet, Crying tiger was the worst. Now I've had this Crying tiger(beef) elsewhere, and by far this one has got to be the worst,super dry no taste. The hot and sour soup was crazy salty,maybe worn down from being heated in the pot all night. We might have gotten the last of the pot. Terrible. Anyhow I told one of the server how bad the Crying tiger was, we ate 1 tiny piece from the plate. Instead of taking it off our bill or apologized,we were asked do you want us to recook it? Ohhhh no. When I came up to the counter to pay, I paid the amount listed. The cashier lady stopped me and said \"excuse me, remember you only paid for the food, you didn't tip yet. \"Are you effing kidding me? How rude! My mind has been blown away in every bad way possible. I was going to leave a tip on the table lady! Obviously she wanted it then and there. The crazy thing was when we were heading out,I looked back and the same girl came to clean our table,the very first item she grabbed was the \"tip\" that I left on the table. This is a damn joke!!! Never again people.", "pics": null}}, {"review": {"des": "This is my new favorite Thai restaurant destination close to my place.<br>Their Thai milk tea is to die for; it tastes fresh, no frills, just yummy cool assam tea with milk.<br>This place makes me want to explore all of their menu items, but their killer items, Gang Hung Lay and Nothern Thai Larb. The northern Thai sausage is spicy but leaves you wanting.<br>I have not tried any noodle or curry dishes yet, but if they are just as good as their signature dishes, then I'm completely sold on this place.<br>My only drawback? Sometimes their prep seems to be lackadaisical some days.", "pics": null}}, {"review": {"des": "Great food. Pad Thai is one of the best I've had in the area as well. Quick delivery and the food is always piping hot. Big fan.", "pics": null}}, {"review": {"des": "Went with the family on Sunday night. The Tom Kha soup is the best in Chicago. The options are too numerous to list but you can't go wrong with any of the Northern Thai dishes...", "pics": null}}, {"review": {"des": "After trying many many Thai restaurants in Chicago I finally found this place and I loved their Pad See Ew. However I have since become a vegetarian and the last two times I ordered it there appeared to be tiny bits of chicken everywhere. I called them the first time it happened and they assured me that it was tofu. However this time I did not order it with tofu and there were bits of chicken-like pieces everywhere again. Also because I didn't order with meat or tofu they added a bunch of vegetables that I didn't ask for that are not normally included in this dish such as bell pepper, carrots and those tiny gross baby corns that no one in their right mind would like. I spent a good 10 minutes picking out all the unwanted vegetables and chicken particles and it ended up being half of it. Also today when I ordered, I ordered a Thai iced coffee and I received a Thai iced tea instead which went straight into the garbage. I am officially done with this place.", "pics": null}}, {"review": {"des": "As I'm asian I know that this place is famous for Northern food of Thailand. I have been to this place so may times and their food was good, BUT they are not the best in town. I went on a busy evening weekday. It was busy, so the service was slow which I felt unhappy. Food overall is okay  as I mentioned, but Hoi-Tod dish was the worst. they made really thick breaded and you probably feel like eating all carb and I don't taste any mussels. I would't recommend to this place to friends.", "pics": null}}, {"review": {"des": "I have ordered out from Sticky Rice twice now, and I have been very satisfied each time! Their Pad Thai is very flavorful and filling, and is a dish I will keep ordering when I have the taste for it. It is always great when I am able to find a restaurant that can make quality Pad Thai.", "pics": null}}, {"review": {"des": "I'm updating my review and still am giving them two stars, but really want to give more...  What happened to you guys?  I live close so I still find myself ordering from here, but continue to be disappointed.  I just ordered again last night.  I had the sole fish with lime sauce, wonton soup and papaya salad.  The fish was okay, but much better the last time I ordered. Btw, the lime sauce was spilled all over in the delivery bag.  The wonton soup was pretty good, but the shrimp in the soup was old, not real fresh?  The papaya salad was okay, but the peanuts were stale.  Again, I want to like this place more, just can't, as I don't think they use very good raw ingredients, which is the main issue.<br><br>My other big complaint is they can't seem to consistently put out the same dish at the same spice level.  I usually order medium spicy, or 4 out 5 stars heat wise.  Sometimes the food is crazy spicy, but most of the time it's not spicy enough.  It's all over the place.  I've asked multi-times, while ordering, why is this?  The response is that they have six cooks who all cook different so she can't promise how it will come out?  That's the craziest response I've ever heard!  Train your cooks to understand and cook at the same spice level, period.  <br>I think I need to consider stop ordering from here, as it's so hit or miss on quality!", "pics": null}}, {"review": {"des": "Amazing Northern Thai food in a delightful simple setting. Awesome servers, excellent food, nice ambiance.  The mango chicken was terrific. It's served in two scooped-out halves on a mango and the blend of chicken, vegetables and fruit is well executed. One thing I did not care for: the tables are positioned entirely too close to each other in the dining area. You're literally bumping elbows (and perhaps other organs) with the people seated next door. They also have outdoor seating - which I will try when it gets above 75 degrees. Highly recommend Sticky Rice!!", "pics": null}}, {"review": {"des": "I always say that I can tell how good a Thai restaurant will be by how good their pad thai is. <br>The pad thai here is very tasty and a very decent serving size for the price. I have been to other restaurants where the price is the same, and  get half of what was served here. <br>Plus, they do not skimp on ingredients. My party ordered the pad thai with chicken and there was plenty of chicken to go around, unlike other places that only scatter about 3-4 tiny pieces for a large dish. <br><br>The spicy red curry was really spicy so if you like spice make sure you specify how spicy. Its refreshing to go to a place where they really do not kid around with their spiciness..<br><br>The bao we had was also very good. <br><br>Their menu is pretty extensive more so than other Thai restaurants, so there is definitely a lot of things to check out. <br><br>Although my review is based on the two dishes we had, they are basic thai dishes and for us, they exceeded on flavor and quality and made us want to return and check out their other dishes. Plus, as soon as you walk in, you are greeted with the exotic smells of Thai cooking.<br><br>The only reason I took of one star is that although there were more than a few waitresses, they were not exactly keen on efficiency. After we had ordered our dessert, it took a good ten minutes to get it and it was not like it was something elaborate just the mango sticky rice.. (tasty but would've been better if it was mango season..)", "pics": null}}, {"review": {"des": "Absolutely my go to Thai place.  The best advice I can give you is not to order anything off of a menu from an American type Thai place.  The Northern Thai dishes are fantastic.  Go out of your comfort zone and order something you've never had.  I usually do an love it!", "pics": null}}, {"review": {"des": "overall restaurant looks pretty run down from the outside, but the dishes inside is a true boaster. <br>ordered the stuffed calamari-5/5, with some veggie stuffing inside and fried on a skewer with fresh vegetables with a sweet & sour sauce drizzle. pad see ew/pad thai, both very flavorful noodle dishes and a class. the beef melts in your mouth which i would have not expected. notable that they had lots of veggies such as sprouts on the side to mix in. lastly got the papaya salad with medium heat as a suggestion and something i will also go back for. it tasted fresh and cool/refreshing with loads of vinaigrette flavor to cleanse the palate. prices are more than reasonable. just dont judge the place by its looks!", "pics": null}}, {"review": {"des": "Love it. Family is from Laos so this is closest you can get to Laotian style food. Love that the workers wear ethnic minority Hmong stitched aprons. I had asked one waiter but she did not know that. Makes me proud since I am Hmong. But the Laos sausage is definitely good. When you're away from the Hmong/Laos community and can't go buy them for yourself to make; these ones definitely do the job.", "pics": null}}, {"review": {"des": "The one, the only, the original, Sticky Rice! I really liked everything that we ordered. The papaya salad wasn't terribly hot. The bacon shrimp was interesting. My bowl of noodles had a decent heat and good heavy spice. I can see why there are so many reviews since this place is cheap! A lot cheaper and better tasting than their newest location, Chiang Mai on Western. <br><br>The only thing I would knock off is the smell upon walking through the door. I'm not exactly what kind of smell it is, but it didn't smell like Asian food/cooking. Please check on that!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wBG9A8UfZVVstcIUEein9Q/348s.jpg", "caption": "Thai bowl noodle soup"}]}}, {"review": {"des": "nice little thai place, we loved everything we ordered, especially the pineapple rice, it was served inside a pineapple with curry, a bit spicy but tasted awesome. for most of the dishes, you can choose your spicy level, we did medium and it is fine<br><br>we heard this place is one of the few places that serves northern thai food, so we did a few specialty items from the northern thai page, really liked the sausage and the one with pig intestine in it, it is all chopped up, so you won't really notice what it is :P<br><br>the mango sticky rice is awesome! the mango is very ripe, sweet and super soft, the sticky rice is warm and nicely done", "pics": null}}, {"review": {"des": "Great tasting thai food! So many options to choose from! Best thai restaurant i have had in a while! Coming back for more! Fast food, good service.", "pics": null}}, {"review": {"des": "There was nothing appetizing about the food! Everything is obviously precooked at this restaurant. I can only describe the meal as I didn't want to take a picture of this hot mess to avoid remembering this abysmal food. The meat was void of any tenderness or any juiciness, the vegetables looked they were cooked with the meal days prior or they used the oldest stuff on hand. I asked for extra Thai Peppers and lemon and it looked like sat in the cooler since NYE 2016. My Friend ordered a Egg Noodle dish with pork and it was basically ramen with the same described meat I had on top. I wouldn't recommend this place to my worst enemy as they would hate me more or Donald Trump as he might sue me for a bad experience.", "pics": null}}, {"review": {"des": "Came here for my birthday on the recommendation of my girlfriend. The staff was somewhat rude and inattentive. They were kind of busy so that might have had something to do with it. A roach crawled up the wall next to me, which kind of ruined the dinner.", "pics": null}}]}