{"name": "sultans-market-chicago", "reviews": [{"review": {"des": "Sultans is my favorite quick eats spot out there, hands down. I go here almost weekly for their salad bar by the pound. Not only do they have salad and every topping imaginable for their salad, but they also have a hot food side with all of your Mediterranean staples like grilled and gyro chicken, potatoes, roasted veggies, different kinds of rice, and pita and hummus. <br><br>If salad bar is not your jam, you can also order from the menu as well. They have all of your normal Mediterranean dishes that you could ask for. This place is cash only, but it's super inexpensive and definitely worth the stop to the ATM.", "pics": null}}, {"review": {"des": "Best spot for cheap and quality mediterranean food  in Chicago! My husband and I both had a dinner plate and shared a bowl of lentil soup for $22 dollars with a drink. The portions are hefty and I couldn't finish what was on my plate. Aside from the price tag and portions, everything is fresh and excellent quality. I prefer this location much more than the one on Clark. <br><br>Great place to meet up with a group because there are options for everyone. Including vegans and vegetarians!", "pics": null}}, {"review": {"des": "I rarely eat at the same place twice. I love trying new places and cuisines so ordering the same food doesn't cut it for me. I came to Sultan's Market, twice, WITHIN 3 DAYS--the first night and the last day of my trip to Chicago. I'm from LA and my Airbnb was conveniently located by the blue line in the lively Wicker Park. Sultan's was a 3 min walk from my host's place, and the Yelp reviews did not disappoint!! <br><br>The first night, I had a meat pie and a build your own salad (5.99/lb) and filled myself up for UNDER 5 BUCKS. Meat pie would've been better if it was heated, but it was still good. <br><br>The last day, I wanted to eat something light before I headed to the airport. Made my own salad again with a mix of quinoa, lentil, squid, kimchi, chicken breast, squash, sundries tomatoes, and kale -- Sounds weird but had to try every topping! <br><br>Great way to end my Chicago trip with delicious, filling, and affordable food! Give Sultan's a try if you're in town. CASH ONLYYY", "pics": null}}, {"review": {"des": "Mediterranean food GEM ! I'm so glad i got to try Sultan's Market, definitely putting this place on my favorites Mediterranean spot in Chicago. First of all, it's a cash only place so come prepared. <br> <br>The food is super fresh, flavorful AND cheap ! I wasn't sure what to order and I was handed a delicious falafel (I'm usually not a fan, but this one was fine !!) while deciding. <br><br>You have plenty of choice between chicken shawarma, lamb, kefta etc...if you don't know what to pick, just go for the meat combo dinner plate. For $8, you'll get  the meat, fresh hummus, pita bread, salad and rice. I love that you have the choice for your salad (you can choose between the Jerusalem Salad - cucumber, tomatoes. & Parsley mixed with tahini, olive oil & lemon juice or the tabuli) and for the rice (you can pick between the curry basmati rice or the lentil one .If you still don't know what to choose, just do half and half of everything. <br><br>On top of this, i got a maracuja juice (yum) and a plate to go because i couldn't eat all of it this night. Try it out if you're around, and enjoy your meal outside (they have a cute outside seating section)!", "pics": null}}, {"review": {"des": "I was craving lamb and decided to go to sultans for their lamb plate. The service was great. The young man behind the counter offered to give me half and half of the two types of rice (yellow & chic peas) and salad. This was an awesome option for my indecisive spirit. My entree also came with hummus and pita. Both rice options were delish and lamb was okay. Not as juicy as I've had it there before but it was okay. <br>There's was something off with both salads. It seemed as if they were going a little sour but I still scarfed it down. Portions were generous and I easily got two meals out of my order....", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9dmLNNlhYazR0GXh-Fg5Ow/348s.jpg", "caption": "20. Lamb Shawerma $8"}]}}, {"review": {"des": "One of the best falafel sandwiches i've had in the city.  Each falafel is soft on the inside, and crunchy on the outside.   They make it fresh and fast and top it with hummus and salad.  Just remember this place is cash only!", "pics": null}}, {"review": {"des": "Sultan's Market is  definitely my longtime Wicker Park favorite offering Middle Eastern cuisine at dirt-cheap prices--and it's BYOB. Start with hummus and baba ghanoush before moving onto hearty sandwiches loaded with falafel, shawarma, and more. There's also a stellar salad and hot bar for a fraction of what you'd pay at other places.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/63_BWZI-ltvSpWhwnPT34A/348s.jpg", "caption": "Lamb Shawarma w/ Curry Rice and a Jerusalem Salad."}]}}, {"review": {"des": "I ordered delivery at 6:58P, with an estimated arrival 60-70 minutes. I just received my delivery and it's now 9:03P. I never would have ordered from them if I knew it would take 2+ hours. I even called 70 minutes in to ask for time frame of arrival and was told the driver left. If I knew it would take so long I would have just gone there and ordered. Even though the food was ok, I was barely hungry by the time it arrived and it ruined the entire experience. I don't blame this on the driver at all and still tipped the 20%, clearly he just had too many orders. Do not order delivery from them!", "pics": null}}, {"review": {"des": "If you're gonna compare this place to Roti, do it while whispering or else (insert your favorite hipster joke here). But seriously best falafel sandwich is here. Each falafel is big, plump, soft and bright green on the inside, yet crunchy on the outside. This is the falafel I dream about...<br>This time I decided to try their salad bar, which has some highlights: red cabbage salad, buckwheat with lentils, and marinated mushrooms. Sadly, no tahini sauce available. <br>Yes, they're cash only, but there's an ATM inside so that's good.<br>Overall, this place has charisma, ambiance, good food, but seriously the cleanliness is questionable.<br>However, I'll still be back for that falafel.", "pics": null}}, {"review": {"des": "Heads up: Cash Only!!<br><br>Once you confirm you miraculously have cash on you, head to Sultan's for a fresh, filling, and inexpensive meal.  A classic pita sandwich with falafel, chicken, or lamb (shawarma) and your choice of 3 spice levels will run you only $5-6.<br><br>If you're more hungry, add starters (e.g. Spinach pie), dessert, or make your meal a combo (adds rice and hummus for $2-3 more).  They also have hot and cold bars (priced by the pound) if you want to construct your own sampler platter.<br><br>Bonus: they have 3-4 outdoor tables that are dog and bike fiendly", "pics": null}}, {"review": {"des": "Best freaking falafel!! It was so crunchy on the outside but soft on the inside like a hush puppy! <br><br>I ordered the chicken shawarma but they said it would be a 15 minute wait. I was definitely miserable after a long day but to make up for the wait they gave me a lot of food (my friend said what I got is standard for their portion size) and gave me two falafels for free on the side all for $8.70! <br><br>I had so much left over, I think I can eat three meals with just one entree. <br><br>Love how the food is very authentic! <br><br>The place is very interesting with a random buffet in the middle and ethnic essentials like the chili garlic hot sauce for sale and vimto. Love that stuff.", "pics": null}}, {"review": {"des": "Very fresh and tasty falafel. Affordable, and efficient employees that move the line along quickly. Not very fancy, but who cares when the food is this good. Good vegetarian / vegan options despite the stench of and view of tons of meat everywhere in the open kitchen / cafeteria style line.", "pics": null}}, {"review": {"des": "Ordered the chicken & lamb Shwarma for take-out from Sultan's and didn't love it. The pita was tasty and warm, but unfortunately the meats and side salads (tabouleh and Jerusalem) weren't up to par as we had hoped. <br><br>Price is right, and the hummus was tasty, but will check elsewhere next time I have a Mediterranean craving.", "pics": null}}, {"review": {"des": "Cheap, quality, and simple! Sultan's is definitely my favorite casual spot in Wicker!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UsMNNKCq4IS1r34yQZT3lg/348s.jpg", "caption": "Signs that old wicker is still alive"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/F0chNAClLijNdCa0rFHSUA/168s.jpg", "caption": "Signs that old wicker is still alive..."}]}}, {"review": {"des": "Sultan's Market is definitely my longtime WP favorite. Personal favorites include the lamb and chicken shawarma. And don't sleep on the hummus. It is so Yummy!!! There's also an outstanding salad bar - Check it!", "pics": null}}, {"review": {"des": "Omg. Everything. <br>Affordable bar with all the amazing Mediterranean food you could dream of. Good music. Laid back atmosphere (no white walls and 3 piece suits here). I want to come back for every meal.", "pics": null}}, {"review": {"des": "There's a lot of hype with this place. I dropped off my friend in Wicker Park and decided to grab something quick to go. She recommended Sultan's Market. I love Mediterranean food so I had to give it a shot. The hype is unreal based on the reviews. <br><br>First off it's cash only. If you're cash only your food better be the best in the world. Second, I have no idea what you can and cannot get as sides. They don't do a good job of explaining things. So trying to order I was already in over my head. I decided to get the Chicken Schrawma dinner plate. You have the option to choose two rices. Just stick with one. The non dark looking one. That's my opinion. You get a decent amount of food for what you pay. To be honest, the chicken was a bit dry. Was not digging it. Now I feel bad for giving only 3 stars for this place near my parent's place because their beef schrawma was whack. You get sauces in their sauce station. Hot sauce or tahini. The hot sauce....was not very spicy...it was not the typical Middle East hot sauce I was used too. <br><br>I don't know man. This place seems like a very Americanized version of Middle eastern food. The sauces were very underwhelming. All in all I want to believe the hype but I have to stand up to what I believe in. Would I go back here? Probably not because who carries around cash these days? Blah.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2ffYfXfkvj1SwTv1HN-gWg/348s.jpg", "caption": "Chicken schrawma dinner plate"}]}}, {"review": {"des": "Located a few blocks from the Damen blue line on North Avenue, Sultan's was a bit of a hidden gem for me. The salad bar looked amazing. My wife and I ordered  falafel and chicken shwarma sandwiches with a side of hummus. for under $5/6 per sandwich, it's a pretty sweet deal. Unlike other restaurants that skimp on the toppings, you get a loaded pita here with all the fixings. Will I be back?....umm absolutely. Make sure to bring an appetite because you can eat a lot while on a budget. ANother plus: they make their own hot sauce and tehini which customers can help themselves to.", "pics": null}}, {"review": {"des": "I really wanna like this place and had it bookmarked for a wild minute before my first visit. Nothing but good reviews everywhere and word of mouth is excellent but the food did little to grab me. A hop skip over to Damen and Division personally satisfies my Middle Eastern budget craves. <br><br>First visit: I tried the falafel and a meat combo platter. Sure it was decently good and usually that's fine by me but I've had better.<br><br>Second visit: kept it light and grabbed a chicken schwarma sandwich. I think I was just mad hungry cause it disappeared right away and I thought for a sec why I doubted the place. But then buyers remorse kicked in and I was just like cool. I ordered it spicy too and again the remorse had more of a kick. There were some real good crispy pieces of chicken mixed in tho if anyone else is into that.<br><br>I just don't get it. Almost everyone I rock with likes this place and I want to as well. Just don't. All I like is the people watch patio and single $ price point.<br><br>And oh yeah! I still fuckin' hate cash only spots.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9NxciPU2755pXZH5bQ32YQ/348s.jpg", "caption": "Meat Combo."}]}}, {"review": {"des": "I have really enjoyed this place for years and came back every time for the falafel sandwich. The construction is great and well balanced as opposed to other pita sandwiches I've had. Unfortunately I once saw a cockroach on the wall and tonight there was a part of a fingernail in my falafel. I'm so disgusted. I've always suspected, but now have enough evidence, that it's simply not clean enough to be serving food. The end.", "pics": null}}, {"review": {"des": "This is the kind of neighborhood restaurant that I wish existed in my little corner of the world. The food all tastes well and freshly made. Everything we've tried has been delicious. And prices are shockingly low for the quality and quantity of food. Didn't know such prices were possible in the city. Our favorite thing- a combo plate that has shawarmas, kebabs, hummus, multiple fresh salads, etc. Well more than enough for 2 people, for $10. <br><br>You can either order at the counter, or create your own plate of food from the food bar. The food bar is genius. It contains regular salad-bar-type selections, but it also has all (most?) of the food that Sultan's sells at the counter, as well as additional and unexpected items. So, you can get exactly what you want, in the proportions you want, for (I think) $6.99 per pound. While we were eating, many people came into the place, selected their food items, and carried out.<br><br>The guys behind the counter were pleasant and helpful.<br><br>If we lived in the area, we would be regulars. They would have to kick us out.<br><br>The ambience is essentially non-existent, but this is the kind of place you go to grab a quick and tasty meal, not to linger over your food and drink. Our only quibble with Sultan's was that the schawarmas weren't cut at the time of ordering from the huge meat cylinders (made of real meat, not processed spongy gyro-type meat). Instead, they were cut into strips earlier, and left to warm in an oven. As a result, they were a little dry. But still tasty. Yum.", "pics": null}}, {"review": {"des": "This is one of my friend's favorite restaurants so I was excited to see why does he like it so much. <br>I have to say that when it comes to food is not super outstanding but it's good Mediterranean cuisine and vegetarians will be happy with having a few different option - I recommend the vegetarian combo :-) <br><br>What was outstanding was super friendly staff and spacious and nice outside seating (brought my doggies along). I also like that the food is really cheap. Less than 10$ for a plate full of food :-) <br><br>This place is BYOB, make sure to bring some  or whatever else you prefer", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3uRFJLeXmOdYFWnDyarm4A/168s.jpg", "caption": "Outside seating"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/t0WH2T3xhk4ek97YZgvgQw/168s.jpg", "caption": "Outside"}]}}, {"review": {"des": "I use to always come here to get the lamb dinner and it was delicious plus you get a lot of 7 or 8 bucks but more I'm a vegetarian so I decided to try the falafel dinner and man you can't go wrong here the falafel was delicious and you get a lot. If you haven't tried it you need to go here", "pics": null}}, {"review": {"des": "I used to absolutely love this place but the last few times I have come here it really has not been up to par. Today I got a falafel (which i think the dude forgot to put the hummus in because it was dry as hell) and 2 egg and cheese pies (which very well might have been left over from yesterday from the hard crust and prolly too long in the oven from the dark brown color) I was extremely disappointed. It may be a while before I return.", "pics": null}}, {"review": {"des": "I love this place! I love the lentil soup. I love the falafel. Super clean. Friendly service. This is without a doubt the best falafel I've ever had. The food is so fresh.", "pics": null}}, {"review": {"des": "Very cool place. The food is zabihah halal. They have a very inexpensive buffet with all sorts of delicious items. Shrimp, shawarma, falafel, cheeses, vegetables. They also have my favorite Maamoul cookies for sale and some imported sodas and foods. You don't have to eat at the buffet. There's also freshly made falafel and shawarma and all sorts of delicious food. They're open late. The guy at the cash register was  ice and welcoming. Cash only.", "pics": null}}, {"review": {"des": "Delivery order took over 2hours.  Called restaurant they said it is on the way. No help. Finally arrived as I was on the phone to cancel. I was on hold for 5 min.  Worst experience will not go back.", "pics": null}}, {"review": {"des": "This might be Chicago's BEST salad bar. That may not sound impressive, but believe me, they keep their food fresh, varied, and with a cheap per lb price, you can't beat this place. Vegetarians will have a field day, and my fellow carnivores will be in heaven. Also, have I had a better falafel in the US? I don't think so. I promise you, you'll love this place. Couldn't recommend it more.", "pics": null}}, {"review": {"des": "We went out for a day of adventures in the city and this was one of the places where we stopped. I thought the food was absolutely delicious. Their hummus and sauces were so tasty. They have a salad bar that you can get food from. I'm not sure if it's a per pound situation or if it's a per container type of price. We just ordered two different platters of food. The chicken shawarma was delicious. The place itself is very cozy, and you can tell it's a very popular place with how many people were coming in and out around 1:30 pm on a Thursday! The food was a bit pricey but that seems to be normal Chicago pricing. I would definitely come back and visit the place again if we are in the city!", "pics": null}}, {"review": {"des": "Oh my God - this place is ammmmmazing. I stopped in today after I worked out across the street (ha- counter productive) and I got the veggie plate. It was SO good! Both of the rices were delicious, the falafel was the best I've ever had, and I got so much food for $7 i was insane. I ate it for lunch AND dinner today.<br><br>They were also SUPER nice and friendly and patient since it was my first time. Beware - it's cash only, so make sure you have those dollars on ya! ENJOY!", "pics": null}}, {"review": {"des": "Awesome late night spot! I would highly recommend the chicken if you're going for a meat option. If not, I hear the falafel is amazing. The lamb is the only meat I don't recommend - too dry. Hummus is to die for and so is their pita. Great bang for your buck!!!", "pics": null}}, {"review": {"des": "My significant other eats like a horse, so I'm always looking for places where you get a lot of bang for your buck. Sultan's Market is definitely that. <br><br>I had the chicken shawarma plate, a falafel, and a baklava. Everything was delicious, and seemingly authentic, although I'm no expert. I'm not usually a fan of falafel or baklava, but actually loved them both here. We were both extremely satisfied and sufficiently stuffed.<br><br>I was overwhelmed during my first visit (in a good way) by all the menu items PLUS the salad bar, but I will certainly be back soon to try, well, everything. <br><br>Note that this place is CASH ONLY.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eQq56-S5n2viQ9eeran48w/348s.jpg", "caption": "Baklava & bae"}]}}, {"review": {"des": "Came here on a Saturday morning before it became very busy. I ordered the lamb dinner and it was a huge plate! Bang for the buck. The lamb and hummus were both delicious.<br><br>In addition to ordering, there is also a salad bar at the center of this little restaurant. While the food was good, I don't think it warranted more than a 4-star because it wasn't spectacular. Just good food at a good price.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WtXBe7j6qkPAuqbKU1Z-ow/348s.jpg", "caption": "Lamb dinner"}]}}, {"review": {"des": "My fave middle eastern place in all Chicago and probably all the Midwest! Best falafel, rices(both the basmati and lentil), lentil soup, and chicken shawarma!!! I crave it constantly and luckily I moved away more than 50 feet(which I was for 3 years-danger!) because it was outta control addiction lol! Also a fun add on that's also incredibly delicious is the little round bread with cheese and egg! Anything from here you can't go wrong! Lastly, I can always get two meals out of an $8 dinner! Can't beat that price! How do they do it?", "pics": null}}, {"review": {"des": "I've heard great things, so this evening I stopped in for the first time to grab some dinner. I was amazed by how friendly the staff was! The gentleman helping me knew it was my first time there, so he asked me if I was a vegan/vegetarian and then let me try some things before buying them. They also have a great salad bar. Found my new favorite quick bite in Wicker!", "pics": null}}, {"review": {"des": "I had been told to come here for quite some time. Now having lived in the neighborhood for a couple years, finally made it. I will say, the food is delicious. The lamb that I got was a bit dried out unfortunately, but overall the rest of the food made up for it. I'll definitely be back again, keeping my fingers crossed the lamb is better, but also because I did enjoy the rest of the meal.", "pics": null}}, {"review": {"des": "I absolutely love this place! Every time I go I load up a HUGE plate from the hot/cold bar and never spend more than $15. Cash only and BYOB. <br><br>There is vegetarian and vegan food a plenty. I cannot vouch for the meat. However, I can say that on the bar, all the meat and seafood is weighed with the veggies and costs the same. There is not a lot of direction when you walk-in, but just grab a container and fill it. Everything from the bar is weighed together at the cash register. You can also order food freshly prepared from the counter in the back. The baklava is on point.", "pics": null}}, {"review": {"des": "Delicious food. Great price. Fast service. Lots vegetarian options. Charming atmosphere.", "pics": null}}, {"review": {"des": "Absolutely my favorite place to eat in Chicago. I've been going here for probably six or seven years and the food is always amazing. The salads are fresh as heck, the falafel is perfectly spiced, and the lamb is to die for. I am always stuffed after I eat here, but the food is so fresh that I feel like I could walk up and down Wicker Park all day withough getting hangry. And if I did, I would probably go to Sultan's again. I hope this place out lives me, for I don't know if I could live without it.", "pics": null}}, {"review": {"des": "Really quick, friendly service and agreeable prices. I got a spinach pie on a whim cause I was hungry and running late to a class and the guy working there threw in some extras for free  made my evening. The spinach pie is a bit different than the Greek style ones in that instead of phyllo dough it's more like a bready Dough and a little less spinach inside. Very good. Also enjoyed the falafel, they are richer than most place's.", "pics": null}}, {"review": {"des": "Delicious, cheap, authentic. I've never had anything less than an awesome food experience at sultans. It's become a staple for me", "pics": null}}, {"review": {"des": "Thank you once again for catering Surge For Water annual gala.  People loved the hummus and falafel.  It was literally gone as soon as we put it out.  <br><br>We also got the lentil rice which was a big hit! It had spiced fried onions on top of the lentil rice which had so much flavor.  <br><br>Thank you again Shadi and the Sultans Market team!", "pics": null}}, {"review": {"des": "More of a 3.5 for me, considering their cheap pricing. For my non-loving meat friends, this is their spot. The hot/cold food bar speaks to their morals, tastebuds, and wallet alike. <br><br>Unfortunately for me, I love meat and though the hummus and pita was good, that wasn't what I was there for. I got their meat combo and was impressed with how much food there was for only $8.72. Though pretty much all the meats were dry, if anything the chicken was the most moist, which was surprising.<br><br>Maybe it was an off day. I'd come back and give a schwarma a try considering all the rave reviews for that.<br><br>Shoutout for the friendly service I got too. I asked to be charged for 1 shrimp off the cold bar but was told I could just take it since it was only 1. The shrimp turned out pretty good! Though I woulda liked it warm.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TDcdivscIzfjtKE9fjqxAA/348s.jpg", "caption": "Meat combo $8.72 January 2017"}]}}, {"review": {"des": "I was craving a shawarma sandwich on a weeknight, and Sultan's Market was calling my name. The sandwich was very filling and tasty, but the lamb was a bit dry.  I have yet to find an amazing shawarma place, but I'll give Sultan's another try.", "pics": null}}, {"review": {"des": "Delicious, cheap, and fast?? better believe it, it's the only spot to get good Mediterranean food around here! The staff are super accommodating, making your meals however you want w/o charging you extra (ie curry rice in your falafel pita), food is made fresh, just make sure to bring cash! I always get the falafel and/or chicken schwarama, but their selection is huge and everything is great!", "pics": null}}, {"review": {"des": "I wanted to give Sultan's Market five stars so bad, but I'll tell you why I couldn't get myself to do it.<br><br>PROS:<br>- Ordered delivery and it arrived 30mins earlier than expected<br>- Best falafel I've ever had (and I eat a LOT of falafel)<br>- Gave us an extra lamb shawarma for free<br>- Extremely affordable!<br>- Tons of options on the menu- something for everyone<br><br>CON:<br>- The chicken shawarma had what I call 'fun chunks' in it. I'm weird about meat, so when I bite into something hard, oddly chewy, etc I get grossed out and have to stop eating it. Wish I'd ordered the falafel pita instead.<br><br>Overall, will definitely go there or order from here again, but I'll stick to falafel instead of shawarma.", "pics": null}}, {"review": {"des": "Best falafel I've tasted from NYC to San Francisco.<br>Friendly staff & great atmosphere. <br>Highly recommend.", "pics": null}}, {"review": {"des": "Amazing food for a great price. I always do the salad bar which is 5.99/lb because I can get a mix of lamb,chicken and all the delish veggies. It is cash only, but so is every dive bar in wicker. The gusl that work there are super nice too! Great tunes always playing in the background of this colorful and ornately decorated neighborhood joint. Also BYOB!", "pics": null}}, {"review": {"des": "Amazing place! I've been going here for 2+ years and their food never gets old. Affordable, tasty, and quick. Staff is very friendly. Lots of food options, especially given the buffet. I personally would rec the dinner platter, Definitely one if my favorites and they even toss in a free falafal if you dont want the pita bread.", "pics": null}}, {"review": {"des": "Sultan's Market has some things going for it:<br><br>1) It's one of the cheapest eats in Chicago.<br>2) It's in the hipster fun neighborhood of Wicker Park.<br>3) They offer many food options.<br>4) It's historic.<br>5) They make a mean spinach pie.<br>6) Plenty of seating in two rooms.<br><br>But it has a few things against them:<br><br>1) It's cash only.<br>2) Some of their food is served cold (cue the spinach pie) when it should be served hot.<br>3) The lamb falafel wasn't good.", "pics": null}}, {"review": {"des": "Bad food and service. Will not be going back. The food is below average. The grape leaves don't taste fresh at all. My friends and I all felt sick afterwards. Also, they don't accept debit cards. Bring Cash.", "pics": null}}, {"review": {"des": "The food is amazing. So good! I'm so glad his place is close by because it's a perfect way to pick up a tasty, affordable dinner when you don't feel like cooking. I usually get the lamb over the chicken but both are good.", "pics": null}}, {"review": {"des": "The portions at this place are HUGE. You definitely get bang for your buck. I eat the 2nd half of my dinner the next day for lunch usually. Another plus is they let you sample the food before you have to commit to it which is great. In terms of authenticity, the owner is actually middle eastern so the food tastes home cooked and just like it would if you went to an Arab household to eat.", "pics": null}}, {"review": {"des": "Honestly not a bad spot at all! For a low price point I can easily get two meals worth of food here and it tastes pretty darn good.  I've tried the meat combo platter which comes with three different types of meat, hummus, pita, salad, and rice.  The only complaint I have is that the meat can be really dry and overdone and everything for some reason is super salty! I seriously feel like I need to chug a bunch of water afterwards.  I haven't tried any of the per lb salad bars but they seem pretty popular with a bunch of different offerings. However it is pretty tasty and I do find myself coming back.  I probably overall prefer the falafel and grill near ramen and division if I had a choice though for around the same price. Cash only!!!!", "pics": null}}, {"review": {"des": "My absolute favorite restaurant in Chicago. Where else can I get a combo of fantastic hummus, herb potatoes, and chicken schwarma coupled with kimchi (which is an option in the salad buffet) all whilst listening to Metallica? I try to bring visiting friends to Sultan's Market and don't have qualms about dining solo every now and again.", "pics": null}}, {"review": {"des": "I have NEVER had a falafel before ever in my life. Didn't really know what it was...but when I tell you I LOVED it. I truly loved it.  I couldn't believe it was a vegetarian sandwich. And the price...only $4 for the whole sandwich. Let me tell you...if I lived in Wicker Park or Bucktown I would walk to this place daily and basically become a vegetarian lol. Because I'd eat it everyday. I also enjoyed the variety of foods options in the fray salad bar. Pretty cool place. I'll be back.", "pics": null}}, {"review": {"des": "My cousins and I went to the Sultan's market for the first time this past weekend. We've seen it before, but have never ventured inside. After viewing local restaurants on Yelp, we saw that this place had good reviews supported by over one thousand reviews. It had to be somewhat good! <br><br>Upon walking in, we realized that there was a self serve or order option. There is an employee at the front who explains the options which was pretty nice. We went with the ordering option since we were new to this place. We all ordered the combination platter which had chicken, beef (shawarma), and kebab. Additionally, it came with rice, hummus, salad, and pita. All for only 8$! That's a pretty good deal in my opinion. We also ordered a dozen falafels. This is for sure one of the best falafels I've ever had. I'd probably say top 2! They are huge - perfect crunch on the outside with fluffiness on the inside. <br><br>Service here was average! Aside from the greeter, the other employees were just there to do their job which I can't blame. This place also takes cash only! <br><br>All in all, I'd highly recommend this place. Delicious middle eastern food for a great price!", "pics": null}}, {"review": {"des": "Shawarmazing! Great atmosphere and food for an awesome value. Choose from by-the-pound meal buffet style or walk up to the counter. We got the chicken shawarma sandwich, lamb shawarma dinner, and falafels. Everything had great flavor and the portions were plentiful. Tried to get the egg and cheese bread but they were out. Will have to wait until next time. The selection of food is more than enough to get your Middle Eastern/falafel fix. Another plus side is that you can get as many or as little sides as you want, one  falafel or twenty one. No preset amount. Self-serve sauces too! Staff fits the heavy metal music mix, hard working bunch. Cash only but there is an ATM inside.<br><br>-Order up with a smile", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BGfJ6bzxfj3n8w-v_3i-3g/348s.jpg", "caption": "Lamb shawarma plate with 3 falafels. Shawarmazing!"}]}}, {"review": {"des": "There are only two reasons why Sultan's Market has rave reviews on Yelp. The food is good, and it's cheap. If I wasn't such a pig, I could have easily stretched my meal out into two, for under $10. They aren't stingy with the meat. Bread and hummus are standard with a dinner. The falafel is on steroids. I really should come here for lunch all the time. They have a lovely salad bar which dominates the front room and I have yet to try it.<br><br>If you're an environmentalist, you'll notice they recycle and they have garbage cans designated for certain kinds of waste. On the flip side, if you dine in, trays to carry your plates can be found in the front by the garbage cans. My favorite part about Sultan's is the sauce bar right by the front door. All the Tahini, Sriracha, and hot pepper sauces are there for you to take as much as you want. Complete with to-go containers.<br><br>I ordered the combination meat platter; but there are plenty of options for vegetarians, starting with that salad bar, I even think the hummus is made with water and tahini. They should really use vegetable broth. Considering the lovely prices here, I am not complaining. The food servers are great, but the register guy is counting on you to remember what the heck it was you ordered. Don't forget!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jFkVmuSAKORLy_LkWDujEg/348s.jpg", "caption": "How my order was packed up"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9SxOa7l0FXYm05xy4MGCNA/168s.jpg", "caption": "The register guy."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IS9tY8uZv3TzvLuJKUe21A/168s.jpg", "caption": "The hot foods"}]}}, {"review": {"des": "Large selection of options on self serve bar. The food was really good and the service was great. I will return again!!", "pics": null}}, {"review": {"des": "Can't go wrong with anything you order from Sultan's. I could eat the lamb shwarma pita every day.", "pics": null}}, {"review": {"des": "One of the best spots in the city. Great food, great value, and everything tasted extremely homemade and wholesome.", "pics": null}}, {"review": {"des": "Best falafel I've ever had, hands down! Humus and baba ganoush were very good as well. This tiny establishment is not fancy but the food is top notch and inexpensive too. Highly recommend.", "pics": null}}, {"review": {"des": "I was excited when I walked into this location and saw a salad bar with nothing but Middle Eastern food - I had never seen such a thing. But I ordered the Chicken Shawrma Rice plate. The chicken was very hot and spicy, which I didn't realize and didn't care for. The beverages are canned or bottled but no tea?!?! I was surprised. Also, they only take cash. The food was ok and the atmosphere was nice although the music was weird. I'd say it's ok, but the food is nothing special.", "pics": null}}, {"review": {"des": "The best Arab food that I've ever tried... the guy give us some samples to try the falafel and it was AMAZING and it's a LOT of food", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9joWptBKkz1VnGUdjZEejA/168s.jpg", "caption": "Vegetarian number 22"}]}}, {"review": {"des": "I've been coming here for the past 10 years. They have the best falafels and hummus I've ever had, the pies are amazing, the lentil soup is delicious (I like to pair it with the spinach pie), and their rice options and salads are so good. The menu items are yummy, cheap, and filling! The falafel sandwich is my usual go-to. Amazing Mediterranean spot, and it's BYOB!", "pics": null}}, {"review": {"des": "Honest review: (food is alrite) picture like a middle eastern mcdonalds wouldnt go out of my way to it but id pick it over fast food. its rite by buck town fitness club and kinda by monarch bar. I wanted to try something different and not spend a fortune. It really is a bargain. The outside will make u feel like your in the Aladdin movie its really cool. When u walk in theres a really big food bar its the type of restaurant where u order then sit down or u can get food from the food bar/ salad bar its clean nothing dirty and no over whelming odor from the food regarding the service they were nice werent really helpful didnt really give any recommendations one huge problem here is the food is cold like they really need to fix that because cold food is never good im not an animal. <br><br>Combination of meats: comes with lamb, chicken and kefta( middle eastern meatloaf of different meats) the lamb was flavorful didnt need any seasoning but it was look warm so it was dry and tuff and almost to the point of being cold. The chicken was really flavorful had alot of seasoning to it was better then the lamb. The kefta was really flavorful really moist i was really surprised since i never had this they were kinda small but worth it all in all this dish needed to be heated more next time imma just tell them to cut the meat straight off to the rotisserie for me<br><br>Chicken soup: this was actually one of the best chicken soups i ever had it was so flavorful not to salty and there was alot of vegetables and  chicken the only problem was soup was not that hot so that was very disappointing <br><br>Humus: the humus was good i liked that it wasnt bitter and it was really creamy not the best one i ever had though the best humus i ever had was at libertad <br><br>Falafel: it was one of the best falafels i ever had it was really really crunchy not greasy and not dry i wish there was more seasoning to it though and it had a dipping sauce<br><br>Baba ganuj: really plain not really flavorful wouldnt order again <br><br>Cucumber salad: this was really bitter so i wouldnt recommend it<br><br>Parsley salad: this was really good really interesting and flavorful<br><br>Green rice:  this was one of the best rice dishes i ever had it was so rich and flavorful it had lentils in it wasnt undercooked wasnt overcooked it was perfect i would come back here just for this rice", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CuUQ98ud3r2dOGaSWTY8HQ/348s.jpg", "caption": "Buffet style food"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/F6I7Tg2PCyErQqw3_9ZDLg/168s.jpg", "caption": "Current menu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6NXcShMIo1G5p6LPmUND8A/168s.jpg", "caption": "Current menu"}]}}, {"review": {"des": "Super yummy and authentic but I took two stars out cause they won't accept cards and I find that to be ridiculously unacceptable cause, hello, it's 2018! Get in a bus and follow us to the future.", "pics": null}}, {"review": {"des": "I totally fell in love with this restaurant.  The food was amazingly delicious.   The workers were very helpful.  I was impress with the many choices of dishes to pick from.  The salad bar had so much to choose from I was like I need to come here 3days in a row to be able to tastes all of my choices. When I waked I to Sultan I felting I was in Aladdin  castle  it is very cute<br><br>The only bad thing about the restaurant the HOT dishes are not hot at all.  The soup was cold too.  The hot meals should be eaten hit not cold like you had forgotten to eat and your food got cold.  NO hot food should be eaten hot.<br><br>I loved their hummus it was very light and tasty not overly powerful.  It was just perfect. The food is very inexpensive so you can have a large meal for very low cost .  I had a lot of food left over to take home", "pics": null}}, {"review": {"des": "Came here the other night and ordered the best falafel sandwich I've had in a long time. The quality of the falafels was high. They weren't overly fried or dry and the seasoning inside was on point. I've been to other places where there are so many bells and whistles with a simple falafel sandwich - sauce after sauce, etc.  The ingredients in this sandwich were simple yet fresh and flavorful; hummus, jerusalem salad, and falafel. When the quality is high, ingredients speak for themselves and you don't need gross sauces to make up for the lack of quality flavor. It was a wonderful, filling meal and for less than 10 bucks. Yes please, I will definitely be back. Also side note, was feeling the underground hip hop they were playing and overall vibe of the place.", "pics": null}}, {"review": {"des": "1200 reviews--do they need another? Yes. This is my go-to Middle Easteen restaurant, the gold standard. Get a piping hot falafel sandwich, ask for baba ganuj, hummus, Jerusalem salad and hot sauce on it. The guys here are always fast and friendly. There you have it: lunch for $5.50.  Thanks, Sultan's.", "pics": null}}, {"review": {"des": "So good and real. One of the best falafel sandwiches I've ever had. Plus this place isn't expensive!", "pics": null}}, {"review": {"des": "Best middle eastern buffet!! Fresh food daily and generous pricing! Loved the rice, falafel and hummus", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/z1mW45bm_Cp7_xb_yUj8kg/348s.jpg", "caption": "Just some of the options at the lunch buffet!!"}]}}, {"review": {"des": "Second time here and I enjoyed it just as much as I did the first time! 7 bucks for a big plate of food! Meat, rice, hummus, pita, and salad! The employees are friendly too! Keep in mind that is cash only! If you really end up there without cash, they have an atm machine there!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9XaBbOUCZrc5mM62DJ2ktQ/348s.jpg", "caption": "Lamb schwarma"}]}}, {"review": {"des": "Good food.  Delicious Food bar and my favorite is shawarma.  Anytime my family is in the city, we make sure Sultan market is our first stop.  They even have a quiet seating area with clean booths where we can sit and chat our family time away.  <br>Only drawback is waiting in long lines", "pics": null}}, {"review": {"des": "SHAWARMA ME<br><br>All I can say is wow! I love shawarma and I walked in here at 9pm, after an event where I didn't get any food to eat. I must say that the Chicken Shawarma was amazing. The place is cash only so make sure you're carrying the green or you won't be eating anything. I quickly had to switch my plastic in for some cash.<br><br>As I walked up to the counter, the guy asked what I wanted plus he said cash only.  I ordered a medium spicy chicken shawarma and before I could put my change in my pocket. On a side note I dislike change. I was given a sandwich wrapped in wax paper ready to eat. I found a nice booth and I took a few bites. As I sat there I noticed a self serve Tahini Sauce & Hot Sauce Bar. This is exactly what my sandwich needed. I loaded up a plastic cup with both sauces and when I poured it on my shawarma I was in heaven. These guys get it. I've been to other shawarma places that make you beg for sauce or hide them behind the counter. No begging necessary here because it is totally self serve. Once I loaded up my sandwich with \"the sauce\" I was in Shawarma Nirvana. These guys know how to make a killer sauce for their sandwich. <br><br>This neighborhood is all about late night drinking and this places offers an amazing sandwich to fill your drunken belly. The sandwich hit the spot on my craving for some yummy food. <br><br>I wish this review was longer but I only ordered one chicken shawarma. I then sat by myself eating it using the self service sauce bar. How can rate anything else? The sandwich rocked and is a compete 5 stars. I'm also giving myself 5 stars on self saucing the sandwich. I love the sauce. I honestly can't wait to come back here. Thanks for an amazing chicken shawarma sandwich.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pH45uHx3X-lPVG6-q14i2w/348s.jpg", "caption": "Yummy"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WPW6NJvB8o5ec1zX-QPjNA/168s.jpg", "caption": "The candy bar is huge."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Evpn0Ch6U_3hIt-UxiqLkw/168s.jpg", "caption": "Let's eat"}]}}, {"review": {"des": "Some of my friends love this spot. I liked the lentils but found the rest of the items I have tried, including the shwarma and the falafel to be on the dry side. It's a good spot for a quick lunch but I wouldn't recommend it if you are expecting great Mediterranean food.", "pics": null}}, {"review": {"des": "The best falafel I have ever had in my life. Flavorful, soft in the middle and crunchy on the outside. <br><br>Yes, this may be a short review but it's all you need to know. Oh, and it's super affordable. <br><br>Go.", "pics": null}}, {"review": {"des": "Food by the pound!  Also, delicious?  Sure, why not.  They're a solid, casual venue.<br>The buffet of Middle Eastern fare (by the lb) w/ a pretty generous chicken schwarma totally fit.", "pics": null}}, {"review": {"des": "The falafel was BOMB!! I will have to admit after my first bite I was not that impressed but once I got a bite with the falafel it blew my mind. It is so fresh, delicious and, most importantly, cheap!! I also liked the lighting fixtures inside, they were cute.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/owDg9AiHSM0d7vHohrbH6Q/348s.jpg", "caption": "Falafel"}]}}, {"review": {"des": "This place is amazing. Best buffet and I load the bowl with tons of chicken and hummus and it's always under $5 and the place is so close to home!", "pics": null}}, {"review": {"des": "This is the best falafel sandwich on the continent, period. I've been coming to this place since 2002ish.<br><br>The jerusalem salad in the sandwich changed my expectations of falafel sandwiches forever.<br><br>And it is in my top 3 Lentil soups in the US.<br><br>Better than anything is that it's one of the last refuges for a decently priced lunch. I think you can still get a sandwich for $5, which is amazing. This place will be here until the end of time. <br><br>Great Lamb schwarma as well, juicy and tasty, although I've given up lamb so you future yelpers can have one for me.<br><br>Five stars for Sultans", "pics": null}}, {"review": {"des": "I give up on this place. The employees and \"manager\" simply do not care about the product they serve. <br>Was in there for the chicken shawarma. Make sure you have a good dental plan before taking a bite. Very hard and dry. Shawarma should be moist and tender.<br>I really didn't want to yelp this but when management can't accept feedback, this is the proper way to go about it.<br>I know they are busy, but they should not take that for granted. I've seen better and busier restaurants close down. You lose customers one at a time.<br>Note to owner, straighten out the big guy behind the register or get rid of him. He will shut you down.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4Tz5buEXrsfOF1E-mPuDxg/348s.jpg", "caption": "Careful, you might chip a tooth!"}]}}, {"review": {"des": "I love coming to this place whenever I'm in Wicker Park. I always take a bento box to go with the super duper cheap, awesome, and delicious salad bar with feta cheese, eggplants, roasted zucchini, and more! Of course they have falafel, lamb, chicken, baba ganoush, hummus, you name it! This is the best Middle Eastern food I've had in Chicago. I especially love the squid and the lamb here. You put all that you want in different sized containers and they charge you by weight. <br><br>Cash only!", "pics": null}}, {"review": {"des": "The food is great, I eat here often, but you're probably wondering why I only rated it 3 stars........ Come on Sultan its 2017! People dont always carry cash and it sucks that half of the time your ATM machine is out of service.", "pics": null}}, {"review": {"des": "No matter what, this place will always be one of my go-to's. I know people might think I'm crazy for saying this, BUT it's not the best Mediterranean I've ever had... I am vegetarian though so it's not like I've sampled the whole menu. However, you can't go wrong with the cheap prices here and their portions are freaking huge. I always end up taking food home with me. <br><br>The veggie combo plate is my usual order. Both rice options are so good (lentil or curry), the falafels are huge & crispy & awesome, the hummus is good (wish it was warmer), & the tabouleh is good. I wish they served the pitas warmer too. I'm not a fan of the spinach pie or Jerusalem salad. I felt that they both needed more flavor. The vegan desserts I've had were a little disappointing & I didn't even finish the whole thing. To give them credit, it's very hard to make amazing vegan baked goods. The baked egg & cheese bread though.... omg. You must try. It's only $2 so you have nothing to lose.<br><br>What I do love about this place, aside from the previously mentioned cheap prices, is the decor & amazing staff. It's a great atmosphere and the workers are always so friendly & helpful. The outdoor seating is also a great touch! I've been coming to this place for the past two years & just realized they have a patio. I'll definitely be bringing friends here for the summer.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RY67qFA4FcfvlS6muCHkAA/348s.jpg", "caption": "Jerusalem salad (not that great) & baked egg & cheese bread. Great outdoor seating."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5RqbUIhqIbpsH2VtMGbTxQ/168s.jpg", "caption": "Inside of baked egg & cheese bread.. so perfect."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/I0C6v32w7CHkFJLFF0RuDw/168s.jpg", "caption": "Baked egg & cheese bread... AMAZING. I was full off of this alone & it's only $2."}]}}, {"review": {"des": "I love this place! The falafel sandwich is my favorite, and for $4.75, it's sooo filling! I normally get the small hummus as well because it's delicious and I love having leftovers. I got the baklava today for the first time, and it was amazing! Definitely a great spot to grab a quick meal!", "pics": null}}, {"review": {"des": "Falafel definition as seen on urban dictionary: <br><br>\"According to right-wing political commentator Bill O'Reilly, \"falafel\" is a synonym for loofah, especially when used to describe scrubbing a woman down with loofah in a sexual manner.\"<br><br>According to Katy S.:<br> <br>A Sultan's Market falafel is a delicious, crack coated, circular, chic pea filled, fried, fattening as F, orgasm-inducing, bite-sized pieces of heaven. <br><br>Now, get those falafels in a pita as a sandwich for a mere $4 and later slap some tzatziki sauce on that bitch and you will for sure being seeing Sultan himself in your wet dreams tonight. <br><br>Go. And please compliment me if these falafels change your life as they did mine.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pAXnetx-NGHThExuP0k-2A/348s.jpg", "caption": "Falafel made with crack flour, I'm convinced."}]}}, {"review": {"des": "The food here was good and affordable. We got the lamb plate. The rice and hummus had good flavor but the meet was a little chewy. We also got the falafel and they were delicious. Overall, it is a good place on a budget", "pics": null}}, {"review": {"des": "The falafel here is so damn good, and I love to just come and pig out on healthy things on the salad bar.  It is always really good and not horrendously expensive.", "pics": null}}, {"review": {"des": "It was ok. I wasn't a fan of the buffet style food. I prefer mine freshly made to order. Food was good. But I've had better. Parking was terrible and they were quite expensive. So the fact that I had to drive around for 20 minutes in this super busy area didn't make it worth it to me. A plus was the variety of authentic middle eastern candies and treats. Its like a corner store here.", "pics": null}}, {"review": {"des": "There is no better value for middle eastern cuisine in Lincoln Park for this little gem.  Dinners and the sandwiches are the way to go and ask for the sambal hot sauce to top it off for a spicy kick!  If you're going healthy, I'd suggest cut out the rice and stick with the tabbouleh instead or just go straight to the salad bar for an assortment of quinoa tabbouleh, seasoned eggplant, or some of the rotating dishes that actually could convince me to go vegan for 1 or 2 days a week!", "pics": null}}, {"review": {"des": "I love this place. The hummus and lamb is always delicious. The price is very reasonable. The only reason why i am giving it 4 out 5 stars is because although it is one of my favorite Mediterranean spots in the city i am a bit annoyed with their consistency. They used to serve a very generous amount of food. However, lately the portions are all over the place. I was used to purchasing a platter and having enough for lunch the next day but now i barely have anything left over which is a bummer. Currently seeking other Mediterranean options around my neighborhood", "pics": null}}, {"review": {"des": "Affordable, fresh, unique lunch spot!! What makes this place special is the fresh ingredients, huge salad bar, and very very very crunchy falafel!!<br><br>I love Mediterranean cuisine and theirs is pretty good. I don't think their flavors are the most authentic but their definitely  catered to the locals who want spice on the side. <br><br>I personally decided to write this review just because their falafel's are so unique. About 50% bigger than anywhere else and with a super crunchy exterior it makes them a tasty treat wether you put them in a pita or have them as a side. Could have used a bit more garlic but that's just to my taste. Luckily they have sauce on the side you can add on to your hearts delight. <br><br>I'll be back with the lil lady... you should give them a try if you haven't already.", "pics": null}}, {"review": {"des": "Dear falafel-maker guy (yeah, you, the shortish one with puffy hair), I've had a crush on you since like 2010!", "pics": null}}, {"review": {"des": "Such an awesome place for quick food on the go or hanging out with friends. I usually go later in the afternoon and it's not too busy! The people there are really nice and there is an awesome backroom/space idk what you call it ...but it's quiet and private if that's what you're in to.", "pics": null}}, {"review": {"des": "Cheap, fast, fresh, vegetarian friendly, tasty food.. Cute decor, nice salad bar. On the corner of North and Hoyne in Wicker Park. Gets pretty busy, but decent service", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zSmvmsows_NZr0-sD7idhg/348s.jpg", "caption": "Falafels, rice, tabouli and Jerusalem salads, garlic hummus, pita - delicious!"}]}}, {"review": {"des": "Great food and great people. I had the curried rice with chicken shawarma, and it was absolutely delicious and fresh. Will definitely be going back again to try other items on the menu.", "pics": null}}, {"review": {"des": "Dare I speak their praises when I love the convenience of quick take out and the outdoor seating area? Aside from that, I stand by the veggie combo (I always get extra onions with the lentil rice) and my comfort meal is the lentil soup with a spinach pie. Totally reasonably priced. Plenty of food. Most importantly, tasty and fresh!", "pics": null}}, {"review": {"des": "The Chicken Shawerma Sandwich was delicious and a great value. It was packed full of hummus, chicken, onions, tomatoes, and Jerusalem salad. I did come across some bones (or other hard bits) though.<br><br>I like the overall atmosphere and separated booths, but it is pretty dark and cramped with the salad bar being right in the middle. Another downside is that it is cash only.", "pics": null}}]}