{"name": "summer-house-santa-monica-chicago-4", "reviews": [{"review": {"des": "I love Summer House - can't get enough of it! The ambience here really does make you feel like you're in Santa Monica. It's beautiful, warm and bright inside even if it's cold and dreary outside.<br><br>But let's get to what's important: The food is awesome. The steak frites is always my first choice, but I've had the French dip as well and you just can't go wrong. Try their hummus and fresh pita for a light app... yum! <br><br>If you order the steak, it's worth every penny. They also give you a side of roasted garlic which is not only really good for you but it's AHMAAAZING!", "pics": null}}, {"review": {"des": "Love the atmosphere here. When it's cold 2/3 of the year in Chicago, it's nice to have a summery escape. That being said, the AC was blasting in here during our late November visit--so much so that the hanging plants were swaying. I get wanting to mimic the \"ocean breeze,\" but this was a bit much and we kept our coats on throughout the dinner.<br><br>Quick service to grab a drink on the Stella Barra side while we waited for our reservation at Summer House. The sparkling rose we got was amazing, but steep at $15 a glass. Wouldn't hate to see some more affordable options.<br><br>Our waiter was great. Super friendly, attentive, and full of suggestions. We got the calamari and the potatoes (at his suggestion) as our appetizer. Both were great and I particularly liked the sweet chili dipping sauce for the calamari.<br><br>I had one of the specials--scallops with pureed cauliflower--as my main. Our waiter warned me it was a smaller portion, which was fine by me, but it really was tiny. They were bay scallops rather than sea scallops (not sure if the specials menu indicated this), which I don't prefer, but the flavoring was good and I love cauliflower puree. My dish could have been a bit warmer, though. My friends got the carbonara gnocchi (which was fine, but a traditional carbonara would have been better) and steak frites (this was my favorite dish at the table, but again seemed a touch unreasonably priced for the cut of steak).<br><br>They have a rose cart that they push around to order by the glass. My friend had another wonderful glass of rose, but again the price was rather steep. <br><br>We ended the meal with a rice krispie, which they warmed for us and it was amazing. They also had huge chocolate chip cookies with rice krispie chunks baked in them up front, which looked great. Definitely want to try one. We were seated right near the cafe area so I ordered a coffee as well since I had been smelling it all throughout the meal. The coffee was great and had me feeling energized to go out after dinner.<br><br>All in all, you're paying for atmosphere. Their wine list is excellent and well-curated, but you'll pay heavily for it. I would come back for appetizers and a glass of wine, but likely wouldn't eat dinner here again.", "pics": null}}, {"review": {"des": "Is this where Chicagoans go to escape the cold and pretend they are in Cali? this place is too cute. We sat in the Vitamin D room. Also, make a reservation in advance!<br><br>Try the salmon hash brown Benedict, Mexican hash and matcha muffin", "pics": null}}, {"review": {"des": "This place is very gorgeous.  Although it was rainy in Chicago, it gave off a summer vibe on a Sunday afternoon.  It puts me in a good mood.<br><br>I got a breakfast plate that consist of hash browns, sweet potatoes, eggs and I think it was bacon.  The food is pretty good. I would come back for more but to try different things.  In my opinion, the regular fries were better than the sweet potatoes.  I am typically more of a SWEET potatoe person but it didn't win me over. <br><br>There is a bakery and drinks when you walk right in.  Its super cute!", "pics": null}}, {"review": {"des": "I haven't changed the star rating, but wanted to update my review. I was more impressed with some of the dishes this time than last time. The tuna watermelon tostadas were very unique and a great mix of flavors with some spice too! The cauliflower was a tasty appetizer, but it really was just for one person. We tried to share it with 4 people, but it only came with 5 pieces. The chicken sandwich wasn't that great. It was very plain and didn't come with any toppings really and the chicken was very dry. <br><br>I ordered English breakfast tea with my dessert. I started drinking the tea and then asked the waitress if she gave me the correct tea. At that point the waitress told me they only had two black teas (neither of which were English Breakfast). I wish I had been told this when I ordered the tea and not after I started drinking It. We were still charged for the tea in the end too. <br><br>The birthday cookie was very good and moist and came warmed up!<br><br>The kids pizza unfortunately wasn't very great for the 2 year old with us. There wasn't much taste to it and was mostly bread and not much sauce or cheese. <br><br>The latte was so very good and made properly!! <br><br>The poke was very Delicious and had a hint of spice to it for a good kick!", "pics": null}}, {"review": {"des": "Love this place!!! It's a must visit when you are in Chicago!!! The restaurant is beautiful and food is fantastic. Try the avocado toast you will not regret it!!!", "pics": null}}, {"review": {"des": "This place is so cute and trendy! Definitely an Instagram worthy restaurant. <br><br>I went here for a friend's birthday dinner and it was awesome overall! The service was fantastic and our waitress was very attentive to our big group.<br><br>The food was not outstanding but it was still very good! I heard that the brunch is better than the dinner so I'll have to come back and try that. I still really liked my food but didn't think it was anything too special. However it was very fresh and overall seemed healthy which I really like!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kCWLwHhQqgv10YkRjcxTyw/348s.jpg", "caption": "Chicken Paillard"}]}}, {"review": {"des": "This place makes some pretty amazing cocktails. I recommend The Weekender and the Ricky Bobby. <br><br>The atmosphere is excellent and during the day you can choose to be in a brightly lit space or in a more dimly lit room. When it's warm they open up the side to let in all the fresh air.<br><br>Their food is also amazing. I've had their mussels and brussels sprouts salad and both are wonderful - not too heavy, but enough to fill you. <br><br>It's a pretty busy place, especially on Friday night or the weekend so I recommend reserving a spot or getting there during a less busy time (during the weekdays).", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qktsy-6kvWoSixmQjnw4RQ/348s.jpg", "caption": "Ricky Bobby - hank's vodka, fresh grapefruit juice, lime, strawberry air. It's a popular drink and really tasty."}]}}, {"review": {"des": "I had a great brunch here while visiting friends in Chicago. The food was superb and reasonably priced. My eyes were a little bigger than my stomach as I ordered a side of hash browns on top of my meal. I ended up sharing them with the group but delicious none the less. I actually really enjoyed the side salad with my breakfast sandwich. At first, I thought it was an odd choice to pair with the meal but it was a nice and light contrast to the thick bacon and heavy sandwhich. <br><br>I do wish my mimosa had been a little cheaper. I believe it was $11 or so dollars during brunch. Not out of range for city prices but with a meal it added up quickly.", "pics": null}}, {"review": {"des": "Gorgeous place. It feels casual and chic. I went for brunch with friends and was such a good meeting spot. I had their cookie and nitro coffee which was delicious. However, their emerald kale salad was just okay tasting. Nothing special and tasted very average.", "pics": null}}, {"review": {"des": "We decided on this place last minute so of course there wasn't availability for brunch, so we made RSVPs for 3p. We arrived an hour early, checked in and they were able to seat us about 20 min early. <br><br>First off, the ambience is calming and serene. You certainly feel as though you are in SoCal for a moment. 5 stars for that alone.<br><br>We started with guac and chips which wasn't too bad but nothing special. I had the taco platter with ahi tuna which was really good although I wish they offered the salsa and verde in a larger size. My friend had the chicken sandwich and fries which she seemed to enjoy. In all, I'd like to come back and try their brunch. I probably wouldn't do lunch here again.", "pics": null}}, {"review": {"des": "Oh my Gosh, who doesn't love a good themed restaurant? I literally felt like I was in Santa Monica. The restaurant looked so classy yet hip and rustic for all you instagrammers that care about aesthetics like myself. <br><br>When you walk in there's a counter of baked goods that looks tempting and delicious, to your left there's a bar, and right around the corner is the sunroom with outdoor seating. The food was AMAZING! <br><br>As you can see I had one of their popular burgers (forgot the name) with coleslaw. <br><br>Service was great and wish they had more locations across the country! <br><br>5/5 Stars", "pics": null}}, {"review": {"des": "I was SO excited to check this place out... but unfortunately I was very disappointed with my experience. <br><br>I'll start off with the positives because I have to give credit where it's due. The place itself is gorgeous. You truly do feel like you've been transported to a beautiful, serene beach restaurant in California. I love the vibe and all of the pretty string lights and plants. The best meal my friend and I ordered was the salt and pepper calamari. Honestly the best calamari I've ever had!! It's cooked perfectly and the spicy mayo they pair with it was amazing. I would eat that plain with a spoon.<br><br>Aside from that, everything else was a let down. The guacamole was okay. Nothing special, I could have done without it. For an entree I ordered the crispy brick chicken. Again, the chicken was just okay. The potatoes were awful. 0 flavor. Even salt couldn't help them. We also ordered the sea salt chocolate chip cookie that I was so excited for, hoping their dessert would redeem the rest of the meal but no. It was so dry and overcooked. But my biggest and most important complaint was the service. <br><br>We had a female waitress who took our drink and appetizer order. It was a pretty long wait to get anything we ordered but our appetizers came before our drinks did... And it was a bus boy or something that brought our food to us. After finishing both apps still without receiving our drinks, I flagged down a random server. She told our waitress who then came over and apologized saying she forgot to put them in. Again, our dinner was brought to us by someone different than the bus boy even, another male server. And half way through our meal we wanted another drink. But our waitress was no where to be found. So I had to flag down someone else a second time! I have no idea what was going on with our waitress but she was just terrible and I hate saying that. It was the worst service I've had anywhere downtown. Such a shame too because like I said the inside is gorgeous. But terrible service always makes for an all around terrible experience. I wish I could have tipped everyone else who brought us our food and drinks because they helped us more than she did.", "pics": null}}, {"review": {"des": "I think I'm in love. My friend and I came here on a Saturday night at 9:00 pm even though our reservations were at 9:30 and we were seated immediately. The decor of this place is lovely. It really does feel like summertime when you're inside. We ordered the Brussels sprouts salad to share along with the nigiri and I got the burger with fries. The food tasted amazing. No complaints there. We also had a couple of glasses of wine and the Ricky Bobby cocktail drink. The drink was light and refreshing. Their daily special dessert of the night was pumpkin pie and it was to die for. My friend got the chocolate chip cookie with ice cream and she really enjoyed her dessert as well. Service was outstanding. I really can't find one thing to gripe about. Thoroughly enjoyed my time here and it's definitely going to be a staple of my list of Chicago restaurants!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DXMhZ87B4O3kZNCMHVH14A/348s.jpg", "caption": "Brussel sprouts salad with nigiri in the back. I'm in love with the salad"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OPFg6pRi3DOwdpINJCyZCg/168s.jpg", "caption": "Pumpkin pie daily special and fresh chocolate chip cookie with ice cream"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/f4c7SKEbEnQKY5NLXaTzUw/168s.jpg", "caption": "Burger with fries. It was juicy and cooked to perfection"}]}}, {"review": {"des": "Service went above expectations and kitchen had a rough day, but food was really good!  <br><br>So...the kitchen was slow pushing food out.  A couple of entrees were not up to par.  The server Brian was very responsive, and the manager Holly made sure that delays and kitchen issues did not overshadow the experience.  Both of them made my choice to dine here worth it!<br><br>Dining outside was strange.  It was hot outside, but the blower from the air conditioner was the only thing felt.  No complaints from me at all!<br><br>That salad with the avocado....OMG!  <br><br>The guacamole and chips...very good, smoothie!<br><br>The decor makes you feel like you're in Southern Cal. <br><br>I'll be back for more.  I left with no complaints due to a staff that made sure my choice to celebrate my birthday here was right!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EYYC7x3de4-hUagjGfb4eQ/348s.jpg", "caption": "Dining room entrance."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XZwBPI9VfUBD1dgFLJqIhQ/168s.jpg", "caption": "Organic Tomato Pomodoro with Italian Sausage."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bu-hCgFHy03XDoECzFf3mQ/168s.jpg", "caption": "Burger and shoe string fries."}]}}, {"review": {"des": "Came here for a staff day.  I had a reservation for 6 for lunch midweek and they had no problem adding 3 kids spaces!<br>Our server was really great, she had no problem coming back when we weren't ready multiple times. We used our yelp check in for free chips and guac (we never would have ordered them otherwise- $15 each yikes!) and ordered the cauliflower.  I have to admit, paying so much for such a small order, it hurts my soul a little bit.<br><br>Our meal took just a bit too long than it should, especially since 1pm lunch was not very busy. I looked over at the counter and the food, ready for delivery, was just piling up.  Our food, including the kids meal, just took a long time! <br><br>Anyway, delicious food, still not happy with pricing, but in general, worth it.  The warm cookies at the end, and the fact that we didn't feel rushed, was fantastic.", "pics": null}}, {"review": {"des": "The restaurant is absolutely beautiful and truly gives the feeling of being in Santa Monica. I love all of the natural light and decor. <br><br>I had the Wood-Grilled Chicken Sandwich (pretzel bun, havarti, honey mustard, baby arugula, tomatoes) with fries. The sandwich was simple but really well prepared and all of the ingredients worked well together. The fries were just ok.<br><br>I didn't have cocktails when I came in, but we were sitting at the bar so I was watching all of the drinks being prepared and they looked really good and unique. I definitely plan on trying next time I come in. <br><br>Lastly - I have to mention! I left my sunglasses at the bar and didn't realize until I was already on my way home to Indianapolis. I called the restaurant and they held them for me until a friend came to pick them up later in the week. I appreciate their trustworthiness!", "pics": null}}, {"review": {"des": "We tried to give this place another try in hopes of a better experience. Their cocktails are delicious which really is the only reason we consider going there. The bar smells awful, think stale beer. And the service really isn't great. <br>The avocado toast is really expensive but delicious. The side salad was brown and bitter, whoever allowed it to come out of the kitchen should me ashamed. Would you yourself eat brown iceberg lettuce?? My husbands salad was the same but his burger was good, he wished it wasn't cut in half  because it made it hard to eat and then the juices all ran out. So basically if you want a really good cocktail this is the place to go but don't sit at the bar and be careful what you order.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/s4sGwxgHA8PIjsF8tkgf2g/348s.jpg", "caption": "Not so fresh side salad, inedible"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VJQQgG2E6Ty1CApKl2ocjg/168s.jpg", "caption": "Avocado toast which was great next to a horrible brown bitter side salad"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6s-9NE3ZAwP2bGoYyWbRPw/168s.jpg", "caption": "Burger"}]}}, {"review": {"des": "Summer House is a basic girls dream.  Every I tried was delicious and extremely instagramable. My most recent trip here, I took my boyfriend for brunch and we sat at the bar while waiting for a table (they told us it would be 90 minutes).  We ordered a round of drinks and our table was ready within 20 minutes! That made us enjoy the meal and the restaurant even more.  The avocado toast, egg sandwich, bloodymary and screwdriver were all rated a 10/10 between us.  I will definitely continue to dine at Summer House Santa Monica and bring friends!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TeOPH-cq4tXmK_EKZIR5Bg/168s.jpg", "caption": "AVO TOAST!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/aiOpUR43EKqi2rguEUzzgQ/168s.jpg", "caption": "screwdriver and Bloody Mary at the bar while we wait for our table"}]}}, {"review": {"des": "I dined at Summer House for a birthday party w/a large group and had a really nice time.  The vibe here is really cool, and the dining room is nice and bright.  <br><br>I ordered the chicken katsu which was an awesome piece of fried chicken- very crispy and filling.<br><br>Would come back again!", "pics": null}}, {"review": {"des": "Have been wanting to come here for a while - their cookies are DELICIOUS so I was sure the menu was as well. All the reviews say to come for brunch, but I only had time for dinner and was craving that California feel. <br><br>First off, the reviews and pictures don't do it justice. You legitimately feel like you're in Los Angeles in an instant. The decor is precise and unique to Chicago - in my humble opinion. However, that means their clientele is awful. Be prepared to see TONS of white people crowding and pretending they're actually in LA - we were truly the only people of color dining in the restaurant which was very off putting. <br><br>Okay - the food. We ordered chips and guac (free and yummy), fish taco platter (good, but v salty), steak entree, and shrimp sashimi. The best thing I ate were the tater tots (WOO). The prices were egregious for me to not want to lick my plate. <br><br>Would maybe return for the cookies and an attempt at brunch; but honestly the kind of crowd and price makes it not worth it. Two stars simply for the truly excellent cookies, tater tots, and ambiance.", "pics": null}}, {"review": {"des": "Came here with my sister during the afternoon on a weekend and was pleasantly surprised that we didn't have to wait for a seat. The atmosphere of this restaurant feels like you're being transported to a beach restaurant in California. It's bright and airy, with a lot of light and greenery. Despite it being a large footprint, there are a lot of tables crammed together to fit the large amount of people who tend to come for brunch. Although it was crowded, I didn't mind since I didn't have to wait too long for a seat.<br><br>We ordered the kale and Brussel sprout salad, which is probably one of the best salads that I've ever had. There was no meat in this salad, but even though it was all greens there was a lot of texture and flavor in the salad that kept me wanting more. We also had the salmon burger, which was good since the salmon patty wasn't dry, but it was nothing to rave about. The fries, however, were disappointing and felt like we were eating garnish instead of actual fries. <br><br>We will definitely come back to try some of their other entrees, but will probably steer clear of the fries and try some of their baked goods instead.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zixOyagvnOqjtnMbuDS2jg/168s.jpg", "caption": "Kale and Brussel sprout salad with apples and cashews"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/X35sXUO6QsW7dQeZlGUbTA/168s.jpg", "caption": "Salmon burger with fries"}]}}, {"review": {"des": "My friend made a reservation for 4 on the weekend (10/11am). When we showed up, the decorations inside and the blessing of good weather gave a California vibe (which seems to be their intention. For those with no reservations, the wait could be long as it is a very busy restaurant. They have really delicious infused water in the waiting area!<br><br>I ordered the hash browns egg Benedict, in which the typical biscuits are replaced with hash browns. It was very delicious! I also had a cup of coffee (free refills). If you check in on yelp, you get a free order of guacamole and chips which taste amazing!<br><br>We all shared their hummus dish and that was very tasty too! One of my friends ordered the granola bowl and it was huge!!! Pretty much, all of our orders came in huge portions. I barely finished my meal. Service was great!<br><br>I would definitely come back for brunch!", "pics": null}}, {"review": {"des": "I've been to Summer House many times and have always had a pleasant experience. Both the food and service have been good - I've been happy to return. Tonight, however, was incredibly disappointing. <br><br>Half way through eating my order of Spicy Tuna Nigiri, I found a dead fly sitting underneath one of the pieces of sushi. After alerting the first staff member we saw, the waitress simply responded with \"sorry, that's one of the downfalls of having an open air restaurant.\" Excuse me?! That's not a \"downfall,\" that's disgusting. <br><br>Though the sushi was removed from the bill, the  waiter that was staffed to our table never apologized, he never even acknowledged the issue. I understand that things can happen, but this was handled very poorly. <br><br>While I've enjoyed Summer House in the past, I will not be returning any time soon.", "pics": null}}, {"review": {"des": "I love the ambience of this place - it's absolutely gorgeous and reminds me of open skies and sunny days. The bakery in front is so inviting too!<br><br>So this is a great place to hang out with friends over a slow afternoon. <br><br>I wish the food was a little better. The poke bowls were strangely unbalanced in taste, and lacking in the promised fish. There needed to be more sauce and/or a more balanced sauce, for me to come back for it.<br><br>I'd also add that the attractive looking array of cookies, while appealing, ended up being very hard to bite through. I don't mean that in a crunchy cookie way; I mean it in a hard as rock way. So, I would skip them however tempting.", "pics": null}}, {"review": {"des": "Delicious! Our waitress was awesome. She was very considerate and helpful and didn't rush us at all. I got the avocado toast and the sweet potato fries. It was very tasty and I was satisfied with my meal. The atmosphere is great and I want to go back and try other things on the menu. Also the cookies were insanely rich and chocolatey. Others in my party got the gnocchi, the spicy tuna bowl and the salmon burger. The salmon burger was delicious and had a lot of flavor too!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/z36Jvz2DWznJ4zU23GWkNQ/348s.jpg", "caption": "Pan-Seared Potato Gnocchi with shrimp"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kCvekxKgY3jNWlf567Wsyw/168s.jpg", "caption": "Spicy Hawaiian Bigeye Tuna & Avocado"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PrTPh3fQzPyDylMyt2dazA/168s.jpg", "caption": "Avocado toast and sweet potato fries"}]}}, {"review": {"des": "This restaurant is California inspired and a combination of things on the menu like sushi and guacamole. Being born and raised in California I really enjoy those things but honestly- the food here isn't good! The guacamole was aight. The pepitas in it is a nice touch and the portion is huge but overall very bland. Tasted like mashed avos. <br>I loved the warm salty tortilla chips tho. Plus factor is we got it for free since there was a yelp check in offer. <br><br>We also ordered the fried chicken dish. I didn't know that dry and unseasoned chicken was considered Californian cuisine! LOL <br>The salad that came with it was over dressed and luke warm. Not really how I like my salads. <br>We also ordered some truffle tater tots. You can't really go wrong with fried taters but the aioli that came with it had this darker yellow film on top. My boyfriend sitting across from the dish thought it was two sauces haha. Possibly from sitting under a heat lamp for sometime. Needed a little stirring. <br><br>Also ordered a side of cauliflower that had a jalapeño pesto on top. The pesto was amazing! Cauliflower was cooked nicely- a touch on the crunch side but most people prefer that. I prefer it to be softer. The downside here is that it came with 4 pieces and priced at $10+ wowsss <br><br>I get why this place is highly rated. The outdoor area is gorg and well decorated. They have a rosé cart. \"Rosé all day\" servers are attentive. But being a true Californian I'm slightly offended of their menu offerings and the food lacked in many ways. Flavor being number one.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kRKMctRLrvkCnIqbOEfdRQ/348s.jpg", "caption": "California style fried chicken. Dry and bland lol"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TUxpIeIrdi4b8p46tpJq_Q/168s.jpg", "caption": "Guacamole & Housemade Chipshass avocado, roasted corn, cotija cheese, pepitas, cilantro, charred tomato salsa - $15"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/imTzbBmlgJMtjrM1TKS-ZA/168s.jpg", "caption": "Crispy Chicken Breastlocal tomato, avocado, sweet gem salad, poppyseed-buttermilk dressing $23- don't get this"}]}}, {"review": {"des": "Ambiance: 5 stars. I can't even rave enough about how beautiful the space is. The Vitamin D room is EXACTLY what I'm planning for my wedding venue. Absolutely breathtaking. <br><br>Service: 5 stars. Our waitress was funny, sweet, and even took our girls' day picture at the end. Attentive and thoughtful service throughout. <br><br>Food: 2 stars. The downfall. Free chips and guacamole were actually the star of the show. The entrees were just such a letdown given everything else. Chicken sandwich was one part meat to three parts bread. I'm a sucker for good carbs, but this was too, too much. The mustard was too heavy and didn't balance the sandwich at all. The side salad was an after thought with browning lettuce and a couple of grape tomatoes. Nothing really special.<br><br>Would I come back? If we're talking about drinks and cookies only, of course! However, skip the food; you're not missing out on anything.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qBHLYRRp_DUFenrr-87RuQ/168s.jpg", "caption": "Wood - Grilled Chicken Sandwich with a side salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3rKmDRj-SOtMVSfik2oGCg/168s.jpg", "caption": "Free chips & guac with check-in!"}]}}, {"review": {"des": "Such a wonderful place to go for brunch! I made reservations here for my parents and I. They absolutely loved the atmosphere. It truly made you feel like you were next to the ocean. The ambience is perfect and staff are all friendly and accommodating. We started off with fresh juice. My favorite was the watermelon one. Absolutely delicious we ended up ordering a second round. For breakfast We got avocado toast as well as the yogurt and fruit which was so nicely plated! Almost too pretty to eat! Highly recommend. Also a cute cafe right when you walk in where I got a matcha latte to go!", "pics": null}}, {"review": {"des": "Came here with two of my girl friends and the atmosphere plus the interior design is amazing but the food is not worth it's price in my opinion. The drinks on the other hand is delicious but kinda strong for my taste bud. I would definitely come back and try there breakfast menu instead of dinner. <br><br>I got the grilled chicken with fries and this grapefruit drink. The presentation on this grapefruit drink was so cute and fun. Cheers!", "pics": null}}, {"review": {"des": "One word: Brad. I truly believe that service makes or breaks your restaurant experience. I went to Summer House last night for a birthday dinner (after promising myself I wouldn't go back because I had a not so great experience at Stella Barra) and it was wonderful. We had a large table and Brad ensured that all of our needs were met. He was very alert, and didn't hesitate to make sure we had a wonderful dining experience.<br><br>Food was great. I had a burger (simple I know) but other entrees ranged from the skirt steak and salmon to the four cheese tortellini. Everyone was satisfied with their dinner except the birthday girl who got the gnocchi. It was very grainy/tough and not the fluffy chewy texture gnocchi is supposed to be, she told Brad and he was extremely accommodating and replaced her meal with no problems. He also brought the birthday girl a dessert, and since we had a large group, he brought extra so it was enough to share.<br><br>Drinks were great too.<br><br>Overall, a wonderful experience. If you don't get Brad as your server, I hope you get someone just as good.", "pics": null}}, {"review": {"des": "This place is magnetic when you walk in! <br><br>The colors are calming, the smell of cookies amps up your hunger and asking if you have a reservation at noon on a Tuesday was a new experience.<br><br>The ambiance is 5 stars while everything else is super meh.<br><br>Cocktails: we ordered the Ricky Bobby, The weekender, and, Party at the Moontower. For being $15 a pop I wanted to be blown away. I ended up sending back The Weekender.... even though it sounds magical they fail to mention the use of celery juice in the description<br><br>CELERY AND I ARE ENEMIES! The flavor overpowered what should have been a delicious drink.<br><br>The burger was just aight, nothing to brag about.<br><br>All in all, I wouldn't return. I spent over $60 for a mediocre drink and some subpar food.", "pics": null}}, {"review": {"des": "I came here based on a friend's suggestion and because I really love brunch. The ambiance of this place was very light and reminded me a lot of the brunch places back home.<br><br>We ordered the classic eggs Benedict, some short rib hash, a side of candy bacon and a blueberry pancake. I was very excited to try all of this food. When i tried cutting into the Benedicts, the muffins were hard to cut because they had been burnt! I love eggs benedict, these were way too hard to eat. And as we were eating our food, the bacon was also pretty burnt. We noticed that many guests were being served burnt food. The kitchen burnt the food! The only saving grace for me was the blueberry pancakes. They were fluffy and sweet.<br><br>Service was alright. Our waitress was attentive but I was a little peeved when I got served decaf coffee (Normally people ask for decaf right?)<br><br>Overall, not the best brunch experience for me. I think I'll be more wary when I go out for brunch outside of the OC.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dODpSq8HCpzoXKUIheIEnw/348s.jpg", "caption": "The inside is full of light"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/e8pLsqtaTXbVipYai3gZVw/168s.jpg", "caption": "My burnt benedict...."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BTbkvN9T9L_AfWY6RoFxCQ/168s.jpg", "caption": "Candy Bacon"}]}}, {"review": {"des": "Went here for the first today for brunch. The ambience was really nice and the seats were cozy. The tables filled up quickly since it was lunch time, and by 12:30pm, most of it were taken. Reserving online ahead of time can help beat the crowds but unnecessary if the reservation is at 11-11:45am on a Monday.<br><br>I felt that there were limited food items to chose from the menu. But they did offer a good selection of wine, drafts, and cocktails. (I would recommend the weekender cocktail)<br><br>another thing I recommend is signing up for their email newsletter before heading there. I signed myself up thinking I would receive a free entree or something through a text, instead, I got an email with a $25off my next visit. I was able to use this offer on my first visit  the offer expires in 9/5/18. So use it and get a chance to save if on a budget!", "pics": null}}, {"review": {"des": "This place is the kind of restaurant that reminds you why going out to eat is so much fun! Walking into the place just makes you feel good! I love the openness and the upbeat vibe! The food is imaginative, and certainly nothing you'd have at home. Their Beverage program is first class.", "pics": null}}, {"review": {"des": "Cute restaurant with good food!<br><br>We were recommended the guac & chips and it was the perfect appetizer. The tuna burger and thai salad were both from their summer menu. Everything was fresh and delicious!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OYNatADRagpt933unSFY8w/168s.jpg", "caption": "Guacamole & Housemade Chips"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CXvbrvJut_uquNj9ZtI8NQ/168s.jpg", "caption": "Seared Ahi Tuna Melt"}]}}, {"review": {"des": "A bit of a mixed bag and odd experience overall. We had reservations for brunch Saturday. I was the first to arrive and went to the host. She couldn't find our name anywhere, even when looking up by phone number. I was a little scared as the wait was over an hour. Upon the others showing up, the girl who made the reservation asked the host and what do you know: found it right away! Not a huge deal but just odd that she couldn't find it when I asked but immediately found it using the same name when the others arrived.<br><br>Once seated, it was almost a full fifteen minutes before our server greeted us. She was apologetic and, again, this was fine as we weren't in a huge rush. Still, kind of a long time to be greeted.<br><br>We ordered an appetizer (Brussels---so good!) and our entrees. We also asked for another round of mimosas and Bellinis. She explained to us that while they are $5 while waiting for a table in the lobby, the Bellini is now $10 and mimosa $11 while dining. Reallllly odd and kind of almost gimmicky. <br><br>Our app arrived and we had to flag our waitress for plates. Again, not a big deal, but just another oddity of the whole experience.<br><br>Our food took nearly 30 minutes after the app which is kind of long. We all did enjoy the food, though! Amongst the table we had the burger, Mexican hash browns, and the egg white omelette. <br><br>Bottom line: great vibe but maybe a touch overpriced especially the \"got ya\" mimosas/Bellini thing. Service was poor but I'll chalk it up as just an off day. I am an avid LEY fan but this is one of the poorer experiences I've had.", "pics": null}}, {"review": {"des": "Service great, food pretty darn good. Chips and guac was huge and tasty, the cookies are bomb!", "pics": null}}, {"review": {"des": "Pros: very nice atmosphere! Super chic and airy. Has a huge sky light so nice lightening in the day time. I got the turkey burger/side salad and the sucker punch cocktail for lunch. The burger was well done and the salad was great. Only thing is I had to ask for some ranch on the side because it was a little dry without any additional dressing. The cocktail was pretty strong and tasty, no complaints. Our waitress was lovely, I wish I would have gotten her name but most of the staff including the hostess was very nice and friendly. <br><br>Cons: it's in Lincoln park so parking was a struggle. The prices were just a little bit more pricey than I expected, mainly for the drinks. <br><br>Other than that I had a great lunch there and would def go back.<br><br>Tip: check in on yelp and get a free guacamole and chips starter!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JSg926g8iQ0Y9Llxm8_Jqw/168s.jpg", "caption": "Sucker punch"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BmTg4fvDQFZQgy3w19kkOg/168s.jpg", "caption": "Double Decker Turkey Burger and side salad"}]}}, {"review": {"des": "Been wanting to come here for awhile now, had friend in from out of town and decided to check it out. The place is definitely picture worthy and the food and drinks were good. I'd come back for sure.", "pics": null}}, {"review": {"des": "Great atmosphere. Really tasty food and that dessert bar is scrumptious.  We really enjoyed being able to browse all the fabulous desserts. Always a fun people watching place too!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/E1Qk0LppLuzrYsOH84_R9g/168s.jpg", "caption": "Cool Bar!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/U6tBN95KXVnzxPBkQBOn6g/168s.jpg", "caption": "Beautiful Room and Roof!"}]}}, {"review": {"des": "Went here for dinner on a Thursday evening. The wait wasn't bad since we came in around 5 pm, but the place started packing in around 6 pm. Recommend getting a reservation since sometimes the wait can be an hour to an hour and a half. Especially during Sunday brunches! The food was good and the service was great.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Wg91Pnz50f_ICdPcG0U4Aw/168s.jpg", "caption": "Idaho Rainbow Trout (Magic Valley, ID)  Truffle tots"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6-noEuaBnyo2yKQ8LBamGg/168s.jpg", "caption": "Burger and fries"}]}}, {"review": {"des": "This place is pretty good. Nice atmosphere and service, food is good also but not very large portions. Although I realize that might be a personal opinion. <br><br>Safe place to meet people in Lincoln Park.", "pics": null}}, {"review": {"des": "This place is so cute. The inside is actually my Pinterest board IRL. The rooftop is all glass so natural light is everywhere. I came here for drinks and the drinks were good but service was a little slow given it was Saturday brunch. They have cute and delectable sweets and treats as you enter and if you can resist it you deserve a gold star.", "pics": null}}, {"review": {"des": "Summer House was on my \"to visit\" list of restaurants for years -- I finally went a month ago with some girl friends and our experience did not live up to the hype. I decided to give it a second try tonight with my fiancé and friends and we had an amazing experience! Our server was so easy and accommodating, the new smashed potatoes were the tastiest thing ever, and we loved the butternut squash soup. <br><br>We had to wait awhile to get served, and before one of us had a moment to complain about how long we had been waiting on even someone to bring us water, the manager noticed and sent free chips & guac and ceviche to our table! That was the most hospitable moment my fiancé and I have had dining in Chicago in the three years we've been here. Can't wait to come back!", "pics": null}}, {"review": {"des": "We really enjoy Summer House. In the winter, the white walls, plants, and atrium feel gives a little bit of a summery escape from the cold reality outside. In the summer, you really feel like you are doing it right, with lots of light and open windows and greenery.<br><br>It's a little pricy, but not too bad. Great food, great wine. We come here when we want to be a little fancy, but not go overboard. We don't live in Lincoln Park, but will sometimes make the trip here when the mood really strikes us. I wouldn't call this a destination, but it's one of our go-to spots when in the neighborhood or really are looking for this exact ambience.<br><br>Reservations are usually needed, but the one time we couldn't get a table we ended up sitting in the adjacent pizza bar that shares an entrance. Completely different experience but really good as well. I think they are the same ownership.", "pics": null}}, {"review": {"des": "I'm so glad we went back here - its been a few years but we live farther south - we went yesterday which just happened to be a hot sunny day so we sat in the green house area where it is so beautifully bright.  We once again - got an amazing server who took her time explaining the menu and giving us suggestions (they must have excellent training) - we both got the poke bowl - my first one - and it was very, very good.  The tuna had a great flavor as did everything else in the bowl.  We ended with a warm cookie that looked like a sugar cookie with fruity pebbles in it - and vanilla ice cream on top.  So good!  Love this place!  Need to come back soon!", "pics": null}}, {"review": {"des": "I was honestly not impressed with the food, but I'm a big atmosphere/ambience type of girl, and this place had the perfect nautical, fun feel to remind me a little of back home in Florida. The drinks were yummy and very cool with their decorations. I had one yummy appetizer (the ahi tuna and watermelon tostada) and one not so yummy (the cauliflower...I love cauliflower and was disappointed). The Brussel sprout salad was so dry and not worth It in the least. My boyfriend did really enjoy his burger! was pretty pricey for the taste to be honest", "pics": null}}, {"review": {"des": "This place was amazing! I am from Southern California and it felt like home! Super yummy fresh ingredients in an airy light green-house like atmosphere! Good service, great food. I'll be back!", "pics": null}}, {"review": {"des": "four years later...<br><br>the menu has become more impressive (IMO) and they even offer a FULL gluten-free menu. shared the GF avocado toast with my GF friend and it was delicious. without request, it came \"split\" on 2 separate plates and was a very filling appetizer. the GREEN vegi burger (yay for not being the boxed impossible or beyond burger OR black bean based) - best i've had in a long time. side of fruit was more than melons - hooray!<br>ambiance cannot be beat - whisk you away to west coast if even for a few hours for lunch. i'll take it!", "pics": null}}, {"review": {"des": "I absolutely love the interior design of the restaurant.  The ceiling is all glass and the lighting gives it a very cozy feeling.  <br><br>I have been to Summer House three times, and it's been a pleasant experience each of those times.  The first time I went we had a bit of a wait, so we had drinks in the waiting area.  We got to our table and had attentive service from start to finish.  I like that they have a cart with various wine bottles chilling in it for their wines by the glass.<br><br>We returned to Summer House last evening to celebrate my new job, and our server was very sweet.  Unfortunately, I cannot remember her name.  We started with the burrata, which was an interesting spin on it since it came with olives and I believe fennel, rather than traditional tomatoes.  For my entree I had the tuna tacos, which I ordered medium rare.  The presentation was appealing, I really liked that the tortillas are served on the side versus being assembled and brought to the table.  I really liked the cilantro rice, guacamole, and of course the tuna.  I'm not a big fan of black beans, so I left those behind.  <br><br>Lastly, I like the cookie/pastry display they have at the entrance of the restaurant.  Their cookies are very yummy, so I've stopped in once to get one to go to take home as a treat.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/27TQC74VRi4qrvGHbV8xeg/168s.jpg", "caption": "The burger, medium rare with a side of fries."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Bx5O1y91Rv7fZNJQdzclNQ/168s.jpg", "caption": "Tuna taco platter. Tortillas come on the side and the tuna is cooked to your liking. I had mine medium rare."}]}}, {"review": {"des": "I LOVED everything about this place. I got pancakes and champagne and loved every bite. We sat in the corner and the view was very cute. I felt like I was in California to be honest. I should have gotten a pastry to go, but I'm watching my figure", "pics": null}}, {"review": {"des": "Wow! From the beautiful aesthetics of the restaurant to the wonderful food, this is definitely going to become a Chicago favorite for me! They had an expansive gluten free menu which was a huge plus for me!! Their loose leaf black tea was wonderful and had a perfect blend of flavors. And the avocado toast I ordered was delicious and very filling. As with many others, I have a slight avocado obsession and they give generous amounts of avocado in their dishes!", "pics": null}}, {"review": {"des": "Very cute restaurant, and love the mood/set up. Being on a ketogenic diet, I had the ribeye and Brussel sprouts. The ribeye was super thin and mostly fat. Not worth the $36.", "pics": null}}, {"review": {"des": "A very large space for a restaurant on Halsted. They have a nice place to wait inside where you can buy cookies while you wait, but I imagine is slammed on the weekends as we had to wait for a table on Monday at 1pm. <br><br>We sat in the Vitamin D room on a warm day and it was a bit brighter than I normally like my indoor dining but it wasnt terrible<br><br>The food was incredible, fresh, and tasted wonderful. The grilled chicken sandwich was clearly very fresh and tasted like it was straight from the grill. A great place to check out in the area.", "pics": null}}, {"review": {"des": "Used the Yelp offer for free chips & guac appetizer  SO good  <br><br>Hostess said 30 mins so we grabbed drinks (quick service) and our table was ready in 10. <br><br>ORDER:<br>Appetizer: free chips & guac appetizer - amazing. Great recipe, great portion.<br>Ahi tuna & watermelon tostadas - tuna was perfect texture and ratio to it all. Similar taste to the chips & guac tho so I wouldn't order both during the same visit.<br>Butternut squash soup: amazing!!! Loved the garnish and the portion was HUGE.<br>Wood-grilled prime burger: delicious. Incredible. Perfectly cooked and fries were decadent. <br><br>Insanely fast service. Great vibe. Will go again.", "pics": null}}, {"review": {"des": "Decent choice for a weekend brunch if you are willing to wait for it. We arrived well before the usual 10am rush and still had to sit at the bar. Loved my mimosa--was a country club pour, which I appreciated for the price they run. I ordered Mexican hash brown, which was satisfying in size but seriously lacked flavor. Needed salt, lime, and salsa; came with fried tortilla strips on top which were totally useless to me and further begged for flavor. I would certainly go back to try other options but I may as well go around the corner and just get a bagel sandwich.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ObP-sD0H1l7uOCToEhpHnA/348s.jpg", "caption": "Mexican hash browns. Decent but needed salt, pepper, and salsa (i.e. lacked essential flavor)."}]}}, {"review": {"des": "I love this place great food and nice staff! Great place for a first date or just to eat and have drinks!<br>I recommend the guacamole so good!", "pics": null}}, {"review": {"des": "The atmosphere is obviously a 10 and the location is great.   The food is very good and the servers are very nice.   Some basic things were missing a little and is the only reason not a 5 star.  Missing silverware and having to ask, missing share plates, water and drink service off.   Stupid stuff I know but when you put them all together it is worth a star.   It's expensive but you already knew that and it makes sense so no reason knock off a star.", "pics": null}}, {"review": {"des": "Been here for brunch and dinner, and to be honest I prefer their brunch options.  They take reservations and promptly seat you.  The ambiance here is nice and refreshing, feels like you're getting out of the big city, and at a warm getaway.<br><br>The brunch options are plentiful.  I had eggs and omelettes, which was well flavored and good.  The drinks are a bit overpriced.  One drink cost as much as my whole meal.<br><br>Dinner, was a bit lackluster.  We shared the ahi tuna watermelon tostadas,  salmon, chicken paillard.  The ahi tuna was unique, fresh, and light.  The chicken was a bit bland and the salmon was over cooked.  Over cooked salmon and meat are \"no-no's\" for me.  Their prices are a bit high for the food you're getting.", "pics": null}}, {"review": {"des": "Amazing! Service was fantastic and food was exceptional. Will definitely be coming here again! Loved the Newport Beach decor!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/229N4jU5qM_BvDshkqnSKA/348s.jpg", "caption": "Horchata Latte."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pYJE57hKJFMWXvKhwIWViA/168s.jpg", "caption": "Avocado toast!"}]}}, {"review": {"des": "That first impression is a bitch! There are many great restaurants in Chicago. If one element is off it can ruin the entire product. I certainly understand putting beautiful women on the cover of a magazine to sell copies. And I certainly understand why they would have beautiful women at the front. The trick is to find beautiful women that aren't aloof and nasty and have a work ethic. <br><br>Great resturant concept. Pricey. Another Lettuce Entertain You winner. <br><br>Reed a fine waiter. <br><br>But the front debutantes- ugh. Vapid. Shallow. Snippy.", "pics": null}}, {"review": {"des": "Gluten free and vegan cookies!!! Need I say more? I brought a group here for a bachelorette party and we had a great time. The group commented on how healthy the dishes were while still being filling and savory. I had fish with mashed potatoes and a strawberry foam cocktail. Others tried the tacos or other fish dishes. We all enjoyed our plates and saved room for cookies! The waitress was very accommodating of allergies / dietary restrictions in our group (gluten free, dairy free, etc). The venue itself is beautiful - we were there on a sunny day, and sunshine poured into the restaurant via the skylight in the dining room we were seated in. Random observation, but the bathroom is massive. I expected to see a lot of girl's groups, which I did, but I also saw numerous men in the restaurant too. Give it a try!", "pics": null}}, {"review": {"des": "A few weekends ago, we finally headed to Summer House for Brunch. Ive been driving past the location for about two years and finally made reservations. The ambiance alone makes you feel as if youve escaped the hustle and bustle of Chicago. The restaurant has a super relaxed and airy feel. It was too cold but im certain in the Summer they are able to completely retract the roof. The cinnamon roll and cocktails were amazing. I also ordered a Salmon salad and it wasnt that good. The Salmon was marinated and seasoned to perfection. Next time, ill order something else but ill definitely be back!", "pics": null}}, {"review": {"des": "I have been wanting to go here for awhile but in the summertime it's always been too packed. After a early morning at Apple my mom and I decided to give it a try for brunch. <br><br>I wish I would had read the reviews of my peers on Yelp before going here. It was all bad!  Service was ok. I guess waiters don't give names anymore which makes it hard for me to praise in my reviews. Oh well. <br><br>On to the food. Just ok. DONT EVER ORDER THE CHICKEN! If I and read previous reviews I would had know this. My mother got the chicken and waffles. Waffle good but chicken not so much. The Bloody Mary wasn't good either. Me on the other hand had the kicked up kale which was SO good and the alcapolco omelet which has a bit of a kick! It was good. The hash-browns on the other hand don't order. They fool you Bc they are crispy on the outside but when you go in they are so mushy and gooey on the inside and not the good mushy either. Didn't even help to add hot sauce. Hot sauce makes everything great  <br><br>The venue is nice and cute I prob even better in the summer but I could skip this place nothing screamed come back. Even tho that kale drink was excellent. <br><br>Now on the the desserts. I was going to bypass those until I read how yummy they were. So the verdict is in. The desserts are on point. The service at the dessert counter was suspect but them desserts tho!!  So many options but I settled on the chocolate chip with sea salt. I don't even like chocolate that much but this cookie would make me take a trip up to Lincoln Park to have another! <br><br>If you go here go for the desserts and skip the meal you will not be disappointed.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lVOlbRaE6bWQiTx9fCczzw/348s.jpg", "caption": "Acapulco omelet with hash"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/G8xGQfy_YmH07wgO1u9oPQ/168s.jpg", "caption": "Chicken and waffles."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/w3ExAcnGXhZHA5aUukIwcg/168s.jpg", "caption": "Bloody Mary and kicked up Kale"}]}}, {"review": {"des": "Really anything by the Lettuce Entertain You group is a wow and SHSM is no exception.  I personally prefer this place for brunch (and especially in the winter) as it provides an almost immediate transportation to the light, airy Californian eateries of the West Coast.  The menu reflects that vibe, but won't leave a steadfast midwesterner hungry either.  The tacos and tostadas are amazing, love the breakfast burrito and the burger is an easy choice if you're in the mood for heavier satiation.  The shaved Brussel sprout salad is great for a lighter choice.  They also have a robust offering of cocktails in the light, summery vein and how can you not love a place with a Rosé cart?!  Enjoy the countdown to summer and a cookie from their baked goods stand on the way out.", "pics": null}}, {"review": {"des": "Good food, good service, & good atmosphere! I definitely will be coming back. I got the green veggie burger and I really liked it!", "pics": null}}, {"review": {"des": "Summer House!!! I've been coming here for YEARS. If you are a first timer to Chicago, or a local, I'm sure you've been told to come here by just about everyone. <br><br>Out of towners: you need to come here to experience the Lincoln Park area of Chicago, it's a 10 minute Uber from downtown and this is how the real Chicago locals live! Not far from the LP Zoo, lakefront, and of course Armitage shopping which is 2 ft away, some of the best boutique shopping in Chicago. <br><br>Tips:<br><br>-Unless it's a random week day at a random hour, you are not getting in here. MAKE A RESERVATION! I always do on OpenTable. A weekend here is crazy busy, tables booked fully. <br><br>-It's a Lettuce Entertain you restaurant so make sure to download the Lettuce app for reward dollars, on top of utilizing their Yelp check-in offer to get the free chips & guac (never gets old).<br><br>-Brunch/lunch are more preferred than their dinner menu, so come then. <br><br>-Do not leave without getting one of their to-die-for cookies. The rice krispy/choco chip is orgasmic. Worth every single calorie. <br><br>Review: <br>The ambiance is just Santa Monica in a nutshell. Beachy, white decor, you can't not Instagram or Snapchat here, so get ready to be a basic B. <br><br>The food (aside from the cookies) isn't top notch, however when I keep it simple, such as ordering their avo toast/beach club salad/French fries, I never complain. Also they have excellent wines and cocktails at a fair price. <br><br>Recently I think their service has gotten a little slower and less attentive, and the restaurant sometimes is messy. Last few times I've been their the table was legit sticky, but this hasn't been a consistent theme so don't let that stop you from coming in.", "pics": null}}, {"review": {"des": "We have been here several times for brunch dinner and drinks. The food is always amazing and the service is great. I love the big bright dining area. It makes it feel as if you are on vacation even in chicago winter  <br>The bakery bar up front is cool and tempts me with its gigantic cookies and pastries every time I'm there.", "pics": null}}, {"review": {"des": "Summer House was the perfect oasis on a rainy Saturday morning in May. There was about an hour wait for 4 at 11am, but we wandered around the neighborhood and chatted in the waiting area which has plenty of cozy couches and chairs.<br><br>PROS<br>+ Elegant and bright atmosphere. We didn't get seated under the giant atrium but the natural light just warms up the entire restaurant, even in the winter.<br><br>+ Creative and strong cocktails. I ordered The Weekender-- gin, matcha, and lime. It tasted almost like a spiked juice, and I was properly afternoon tipsy after just one.<br><br>+ Dessert! While you wait for a table, you won't be able to look past the oversized treats at the cookie counter. We couldn't leave without grabbing some cookies for the road.<br><br>CONS<br>+ I wasn't blown away by my brunch entree, especially considering the price. I ordered the Santa Monica omelette, which was pretty bland. The turkey inside of the omelette seemed like it was just lunch meat and the eggs could have used some herbs. Although the whole wheat toast on the side was SO GOOD. Homemade and hearty and just needed a bit of jam.", "pics": null}}, {"review": {"des": "What an incredible atmosphere and great food! Service was friendly and well presented. It was a beautiful Sunday afternoon when we dined, and the front wall was open (they are those awesome garage doors/windows). I ordered the Smoked Salmon Benedict which was on a bed of crisp hashbrowns instead of the typical English muffin... and WOW. I will never eat eggs benedict any other way. So flavorful and simple!<br><br>Also I love their rosé cart! While I didn't order a glass (they were about $14 a glass), it is an awesome idea for them to have it by the front counter for people to see and get their idea on it before sitting down.<br><br>On our way out we grabbed 2 ginormous salted chocolate chunk cookies, and holy wow. They were very sweet, but so delicious! I couldn't eat more than half of it, but it makes a perfect treat to split with a friend on the walk home.<br><br>The one criticism I have is that we made a reservation for 1pm and when we arrived, we still had to wait until 1:30 before we could be seated. <br><br>Overall, an amazing experience! I will absolutely be returning next time I visit Chicago.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2Z6GyJEhHW7seWv96s_Nug/348s.jpg", "caption": "Brussels Sprouts Salad"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EwXXLbOUs3o-Lu7FWIgBrw/168s.jpg", "caption": "Tostadas"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cHHSEIG04x8Vfv19ekv1aQ/168s.jpg", "caption": "Salmon Eggs Benedict Hashbrown"}]}}, {"review": {"des": "$$$ for portion size but food was absolutely delicious!! Brussel sprout salad abs veggie burger were out of this world. Yummy cookies the size of your head as well- which is always a good selling point!", "pics": null}}, {"review": {"des": "Alex THE Bartender. Name an alcohol and flavor, he'll make you a drink that will be your favorite. He's extremely personable and his recommendations never disappoint. Summerhouse is very lucky to have him. Looking forward to next time and making a point to sit at the bar and chat with Alex over another one of his unique creations.", "pics": null}}, {"review": {"des": "After hearing about this place and seeing multiple check inns from friends I finally decided to check it out. <br><br>First off when you walk in the Decor is like an elegant summer beach house and very welcoming. You have to make a little effort to find the host stand but it's not a big deal. <br><br>OK time for the food. I have dined in all sorts of places from taco stands to three-star Michelin restaurants so I have no biased opinion about food in general as long as it's good. The menu seems playful at first glance when you look at it.  The goal of the menu appears to cater to all sorts of ethnic backgrounds so no matter what you're in the mood for there will be something for you. From sushi to tacos to burgers, it's all there. <br><br>The problem is everything seems to be kind of mediocre compared to the American dishes.<br><br>I decided to pick dishes that will go with each other. I went for mostly sushi at first. The roll on the menu containing lobster intrigued me. It was priced around $20 giving you six pieces. When the roll arrived it was a pretty big let down. The lobster was flavorless and hard to tell if it was even real. The presentation was also lacking. In all honesty I could've gotten that same roll for about $8 at a sushi place and it probably would've been more flavorful.<br>Oh well moving on. <br>The vegetable dishes were phenomenal. So I highly recommend those. Particularly the brussels sprouts and the cauliflower. Both were bursting with flavor. <br><br>After a bit of a let down in the sushi department and A clear recognition that the chef is better suited to cook European / American style food I went with the Prime Burger. It was cooked perfectly, delicious! <br><br>Cocktails: I ordered the Fireside Old Fashion and my significant other ordered the Ricky Bobby. Both were spot on! <br><br>Final Verdict<br>DECOR - A / Drinks - A / Service - B+ / Food - B+<br><br>I think if the menu is re-concepted slightly and the sushi items are spruced up this could be a near perfect restaurant for the summer.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Bond-Q0IY-jDNNJiWV6SGw/168s.jpg", "caption": "The Main Dining Room ceiling"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rKMhPpCK67dF5XLyQbZXHg/168s.jpg", "caption": "Alaskan King crab roll & Spicy Tuna"}]}}, {"review": {"des": "Wait for the food took a while, but both taste and presentation of food is great. This place is great for breakfast as well as lunch or even brunch. Service isn't the greatest, but food is pretty good.", "pics": null}}, {"review": {"des": "So... heres the deal. The place is probably great, but I've been looking forward to trying this place out, and after finally waiting for a table it was a big letdown. Got butternut squash soup and the impossible burger. <br><br>The burger was great and the soup was ok BUT there were 6 pieces of plastic in my soup. The person thanked me for notifying them but I definitely still had to pay for my plastic-y soup. <br><br>Also check out the math they have so graciously calculated for me in the picture.  Apparently 20% of $24.42 is $12.11<br><br>$30 for a burger and soup with plastic in it? I'm fine to never return. Looks nice though.", "pics": null}}, {"review": {"des": "Our waiter was simply wonderful. Guac was excellent, all of our entrees were superb (Chicken, burger, pasta and tacos) plus the warm cookie + ice cream .... WOW!", "pics": null}}, {"review": {"des": "Love this vibrant and trendy atmosphere at this place.  Definitely makes you feel like you're close to a beach with all the bright decor and sun shining through the skylights.<br><br>I came here with a group of 12 girls for a bachelorette party.  Of course we made a res in advance and they were very accommodating about getting us one table altogether.<br><br>We shared several things amongst the group and enjoyed everything.  Some of my favorites were the fluffy blueberry pancakes, scrambled egg sandwich (from the lunch menu), avocado toast, and the smoked salmon benedict.  Most of us got bloodys and mimosas for drinks. Despite our group size everything came out in a reasonable time and the service was great.<br><br>Will definitely be back on my next trip to Chi.  Bonus tip: If you check in on yelp you'll get free gauc and chips, totally worth it!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qYs84DjL1-d8ja-L_vzm1A/348s.jpg", "caption": "Bloody Mary"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2fgI2rIMUhscarL7-D7dEg/168s.jpg", "caption": "Egg Scrambled Egg Sandwich with fries. Fries were a really good hangover cure"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/foZK7PEtDGUKRDG758NaOw/168s.jpg", "caption": "Smoked Salmon Hashbrown Benedict and Avocado Toast"}]}}, {"review": {"des": "Oh Summer House... where shall I start?<br>Let's Start with the ambience. Summer house is such a cool feeling place to be, especially on a sunny Chicago summer day.  It literally makes me feel like I'm in Santa Monica, although much to my dismay there is no Summer House Santa Monica in Santa Monica, Ca. My second favorite thing about this place is the Rosé Cart. From there I discovered the M.Lawrence Rosé, and I'm smiling just thinking about this delicious bubbly. Third perk, is that you can accrue and use Lettuce Entertain You points here and I've been able to save major cash, so I really appreciate that feature. And lastly, the food is super decent, I've never had a bad dish here, although, I've had moments where something was too salty or not hot enough but in general the food is stand up. This is one of my go-to's when I have out of town guests who've already done the touristy spots.", "pics": null}}, {"review": {"des": "This place is perfect for brunch with girlfriends, out of town guests, bachelorette brunches... etc. it's so bright and airy and the food is delicious!", "pics": null}}, {"review": {"des": "This was my 2nd visit to Summer House.  It's really a cute place and I am in love with the Vitamin D Room.  There's so much sunlight that filters in and it has this California vibe.  <br>The staff and ambience were great.<br><br>The food is just ok.   It's overpriced considering the quality of food that you're getting.  Example, the guac and chips are $15. () They definitely didn't taste extraordinary so not sure why.  I would say go for drinks and the atmosphere with friends.  It would be a great way to spend an afternoon or evening.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QWVcICrcpBm7d-U4wypv2Q/168s.jpg", "caption": "Candied bacon"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/B_3qCpCPu-bThweyaUiIoQ/168s.jpg", "caption": "Caramelized French Toast - from what I was told, they are taking this off the  menu!"}]}}, {"review": {"des": "It's a cool place to go and get a aviation cocktail. A lot of fun and the service is perfect. It's a friendly environment and definitely lives up to its name", "pics": null}}, {"review": {"des": "Summer House: I love you. That is all.<br><br>Except Yelp won't let me post this one without writing more...so I love your Old Fashioned, love your guacamole, love your chicken and polenta, love your tuna tostadas, love your cookies and the server was great (if I said I loved her, it might get weird).", "pics": null}}, {"review": {"des": "Oh this place is SO good! Make sure you check in so you get the free chips and guac. I'm not a guac expert (I'm new to the avocado scene), but this was by far the best guac I've ever had! I would definitely pay for it next time! <br><br>My husband and I both had to work the next day so we didn't order any drinks, but they looked so tasty! Definitely will get one next time. <br><br>The place is beautiful and truly gives you summer vibes. The staff were nice and not overbearing. <br><br>Now let's get to the main courses. WOW. I had the cauliflower \"steak\" (which admittedly is WAY overpriced - $20) but it was so worth it. I might try to replicate it at home but I know it'll be a disaster. My husband got the prime rib sandwich which he really enjoyed! <br><br>Can't wait to take my family here!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dx_t121P74Glq-HQSu-Qig/348s.jpg", "caption": "Chips and guac -5/5!!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HcCvKFezYHdyNO-Ik7GG3g/168s.jpg", "caption": "Cauliflower \"steak\" 4.5/5. Took away half a point because it cost $20"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/c7g433GwBwtj4mLyums7dQ/168s.jpg", "caption": "Prime rib sandwich - 5/5"}]}}, {"review": {"des": "Honestly the food is good not great for the price. It's definitely on the expensive side compared to many places around it.", "pics": null}}, {"review": {"des": "I've dined here twice prior to this visit. I probably would've given higher stars then. However, today's experience was otherwise. Suggested to go with my friend but was embarrassed after this experience!<br><br>1.  I wanted to sit near sunny area so asked for seat change to host as he was taking us to our seats. He gave us the \"ooooook whatever\" look as he took us to a different booth. Definitely was not a friendly person.<br><br>2. Food presentation is great. Taste? It's oooook. Ever had food that looks great but tastes just ok? This is the place.<br><br>3. FLIES FLIES FLIES! everywhere! I thought it was just our seating but was pretty much flying all around, even in the food loading holding area where they put food under hot lamps. I understand their door is open for open seating but something needs to happen! Be aware! You might get food that flies sat on. <br><br>4. They give a cookie w/ice cream for birthday celebration! Great! except our busboy took away our napkins. <br><br>5. They prepare condiments such as ketchup ahead of time in a tray which is placed on a shelf that's near worker's feet. There're two shelves. Some are placed on top which is between their knees and thighs and some are placed on lower shelf which is placed between ankle and knee. It may pick up all the dust from the workers' walking.<br><br>Today's server wasn't as friendly as other servers I've had in the past. Ambiance is great and trendy. <br><br>They took out tuna poke menu but still has chicken poke since I've visited. Last time, the manager came to us and said rice sold out so they need to remake it, which would be 15 min wait. So we said ok since we were hanging out. He offered us the appetizer is on them. The rice was undercooked, perhaps they rushed. After I paid the bill, I realized appetizer wasn't on them but I paid instead. I returned because of ambiance and such nice server but I will not return again.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qNHkYGNBg6Wigr50jVZDOw/348s.jpg", "caption": "Guacamole & chips"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9ZtTshMM_5h592cKOad93Q/168s.jpg", "caption": "Burrata"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/b9yXRvYo5eiBad3RcBOMDQ/168s.jpg", "caption": "LA hickory burger"}]}}, {"review": {"des": "Stopped in here recently for dinner for my mom's birthday. First off the atmosphere is amazing. It is warm, inviting, and creative. In Chicago, where the weather is not usually great, this is a fun place to go because it makes you feel like you are in a warm California city (obviously). Secondly, our server was great. She was welcoming and hilarious and offered us suggestions whenever we weren't sure. She also really understood what she was selling and was able to make suggestions surrounding the various wines available. <br><br>We couldn't decide what we wanted to eat, so we decided to just order a bunch of the appetizers to share. We started with the chips and guac - something every yelp user should get since you can get them for free! We also ordered the ahi tuna and watermelon tostadas. This was probably the best dish that we ordered. It was fresh, delicious, and not a big enough serving for three people. The dish was a little spicy and had a good kick to it that paired well with the watermelon.<br><br>In addition to these dishes, we ordered the Brussel sprouts and roasted cauliflower. Both dishes were good, but not exceptional. I personally liked the Brussel sprouts better than the cauliflower, but my family felt differently. The last dish we ordered was the burrata appetizer. It came with a delicious baguette and a olive salad. The burrata itself was amazing and fresh, but the olives added a weird flavor to it. I also might just not be a fan of olives.<br><br>Throughout the meal, my mom and I had been enjoying a few different beverages. She started with the basil gimlet, which she really enjoyed. It was a beautiful green drink with fresh lime. I started with the Ricky bobby. It was a bright pink drink that was topped with a light and airy foam. The drink itself was very easy to drink and you could taste the alcohol in it. We also enjoyed a bottle of Rose Chardonnay. It was one of their private label roses. It was delicious and very easy to drink.<br><br>To end the meal, we enjoyed some of their delicious housemade cookies. We started with the confetti cookie since it was my mom's birthday and then enjoyed the chocolate chip cookie. Both were warm and topped with melted ice cream.<br><br>Overall, I would definitely be back. This is a great place to go for a delicious summer time meal and a great light drink. It is expensive, but you are paying for the great service and atmosphere as well as the fresh food.", "pics": null}}, {"review": {"des": "I originally made a reservation for 7:30 on a Thursday night. After failing to wake up from a nap, I called the restaurant at 7:45 and asked if they would hold my table. They were super accommodating and when I arrived they new who I was and had saved our table -- and it was a great table! <br><br>Our server was the best. My mom, my sister and I all felt like we were best friends with her by the time we left. She recommended some food to us and her recommendations were great!<br><br>We ordered a bunch of appetizers to split.  First, we got the chips & guac that you get for free when you checkin. They were not superb but it was pretty good. If you like fresh and free food, then checkin and get the guac! We also ordered the tuna/watermelon dish. I personally hate anything with fish in it, but this was soooo good. It was refreshing, spicy and interesting! I wish the dish had been bigger because it was that good. We also got the burrata. The burrata came with some sort of olive dip. I wasn't sure how I was going to feel about it because I also do not like olives. But it was actually really good. Cheese in general is really good so you can't go wrong with it.  We also got the cauliflower and the brussel sprouts. The brussel sprouts were ok but the cauliflower was amazing! That's the best way to get your veggies in.<br><br>Last but not least, the chocolate chip cookies. Get them. That is all.", "pics": null}}, {"review": {"des": "Although we ate here on a chilly day, we felt like we were in California in the sunny, bright main dining room! Looking forward to sitting there when the windows/roof are open for the summer! Waitstaff was very attentive and friendly. We had reservations and were seating immediately. They even let us switch tables into the main dining room since we wanted to be in the sunlight. Ordered the avocado toast, Brussels sprouts salad and salmon burger with sweet potato fries. All were fantastic!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8jeSbLwwvZ_TldBMTU10Xw/348s.jpg", "caption": "Grilled Salmon Burger"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/H1e1KLQaJTkxaz7YM8BzUA/168s.jpg", "caption": "Avocado Toast with sweet potato fries"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FtdP3q2aKHFJphkPsXYYMQ/168s.jpg", "caption": "Brussels Sprouts Salad"}]}}, {"review": {"des": "Went here on Saturday for weekend brunch. Didn't have reservations but they able to accommodate 2 ppl on calling earlier that morning, which was awesome! We're seated in the vitamin D room which we loved! Great decor, ambience and lots of sunlight perfect for brunch. Ordered the Acapulco omelette and the short rib hash. Those 2 were okay, not the best we've had. However ordered a half order of the caramelized French toast and LOVED it! Best French toast at any brunch place. Was soft, tasteful and delicious! Highly recommend ordering it! <br>ambience 5 star, food 3 star hence overall 4 star. <br>Pics attached.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Q1w-7Vb9Ek9FhBmXS71Fmg/348s.jpg", "caption": "Best of the orders! Caramelized French toast!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LKIC-qcrnlmjy2y-Q4Fxpw/168s.jpg", "caption": "Guacamole and chips (free with Yelp check in)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zTPck1_e9lQuLkVds44vmQ/168s.jpg", "caption": "Short rib hash"}]}}, {"review": {"des": "I've been to Summer House Santa Monica now twice and I've had okay experiences each time. <br><br>I most recently went for my birthday to get a specific dish that I got last time, which was a prime rib sandwich. Once we arrived I learned the item had been removed from the menu, although it was on the menu when I made the reservation about a week in advance. <br><br>I was very upset that the dish I wanted for my birthday wasn't available, but I opted for a Chimichurri steak which came with fries. It ended up being pretty good! I also got the Ricky Bobby which is a grapefruit cocktail. It was very tart but cute for a photo. <br><br>Overall I think this restaurant is a atmosphere place VS a food place. My boyfriend has yet to like a dish he's had and my food has been good but nothing crazy. The restaurant itself is gorgeous and has a great vibe, but the food is just meh for me. Probably wouldn't go back unless it was for drinks and maybe some appetizers.", "pics": null}}, {"review": {"des": "Summer House is a great escape from the bustling city. As soon as you walk in, you immediately feel the warmth of laid back Cali vibes. The space is beautifully decorated with tons of greenery and natural light. I started out with the Ricky Bobby and was pleased- super fresh mix of grapefruit, strawberry, and lime. I split the chips & guac with a friend and ordered the roast chicken for myself. Both were excellent dishes- I felt that the flavors were a bit bland, but that's expected given this cuisine. The chicken was super savory and cooked to absolute perfection. I thought overall the experience was great for the price point and would recommend it if you're in the area. Since the food is a bit lighter fare, lunch might be a better option. Pro tip: check in on Yelp for a free chips & guac!!", "pics": null}}, {"review": {"des": "My wife and I had this place on our list of places to try for a long, long time and finally gave it a shot with some friends recently. The drinks were very tasty and the food was too, though the portions were incredibly small for the price. The burrata and tomatoes were good but for $15 my wife and I only got a couple bites each. The space itself has a very nice ambiance and it's a pretty large, their desserts looked incredible but we didn't indulge this time: I'd probably return just to sample one though.", "pics": null}}, {"review": {"des": "Finally checked out this hustling and bustling place! You will feel like you are in Santa Monica the moment you enter this airy and bright restaurant. The coastal vibe is strong throughout it. <br><br>The food was delicious and serving sizes were normal, so most will probably find them small. We shared two appetizers (burrata and brussel sprouts) and three entrees. Gnocchi were good, albeit not my favorite. The fish tacos were interesting but flavorful. Half chicken with polenta was also good, but again, not my favorite.<br><br>The service and the ambiance is the reason for checking them out; food is not.", "pics": null}}, {"review": {"des": "This bright-vibed Lincoln Park locale is a haven in the cold and gloomy Chicago winter. With their large countdown to summer, you're reminded that warmth and sun exist. In the summer, the dining area is open air to the neighborhood buzz taking advantage of the few months of good weather in the city.<br><br>While good for the vibes, the food at Summerhouse is pricey for the quantity. I find that the creativity of dishes falls flat. Every time I go I hope to be wow-ed by my plate because a place that spends so much time on their aesthetic must also spend time on the cuisine. But the food is always just OK. Nothing terrible -- salmon a little too dry, guacamole that is average. I am always wow-ed by the price, however, which is always more than I would expect given the quantity and quality.<br><br>I would still recommend this place for the ambience, though I would reserve it for out of town guests who would appreciate its vibes rather than a night where you're seeking local culinary treasures.", "pics": null}}, {"review": {"des": "The food is meh, but the decor and ambience are beautiful and absolutely worth dining here for! Lots of windows and sunlight. We went for brunch on the weekend. Be prepared for a wait, but try the baked goods they sell out front. Highly recommend the blondie; it is to die for! I'm salivating as I think about it. <br><br>For brunch, I had the short rib hash ($14.95) which is served with eggs and crispy potato. Like I mentioned above, it was pretty average. But I thoroughly enjoyed the beautiful dining space in which I ate it in. Check in on Yelp for a free order of chips and guacamole.", "pics": null}}, {"review": {"des": "Can't believe I haven't been to this restaurant before yesterdays visit ... great space , friendly service and incredible food.  Checked in on yelp and got the free guacamole and chips .. the guacamole might be the best in the city , they offer a pre fee lunch 22 buck include appetizer , meal and dessert !! Great great deal , had burrata , incredible , kale salad fresh and delicious , crispy fish tacos like I was on the beach in Cali!!! Everything is done with great thought in this restaurant .. will definitely be back , great beers on tap too!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xUemZF92GuSexPBzu6DZ_Q/168s.jpg", "caption": "Crispy fish tacos"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XZZzZcMrWYQ0HLATCb163w/168s.jpg", "caption": "Turkey burger !! Awesome"}]}}, {"review": {"des": "Ambiance = 5 stars.<br>Service = 5 stars.<br>Food = 3.5 stars.<br><br>We fell in love with this place as soon as we arrived. From all the baked goods displayed in front to the decor & natural lighting. My friend was visiting from out of town, and I couldn't have found a better spot to take her to brunch. Totally felt like we were in California (and we're both from the west coast, so that says something, right?).<br><br>I made reservations prior to her visit, which I'm glad I did because the place was packed! We were lucky enough to be seated in the \"vitamin D\" room. Perfect amount of light coming through from the glass ceilings. It most certainly has a greenhouse kind of feel. There were plants hanging from the ceiling along with string lights.<br><br>They have a pretty solid brunch menu including benedicts, omelettes, french toast, pancakes, and waffles. It's nice that they offer lunch as well, but weekends are for brunch and mimosas! So I ended up ordering the smoked salmon hash brown. It was fine, nothing really stood out. The hash brown was a bit too burnt for me. I was really impressed with their FREE check-in offer (an $11.95 value). They were very generous with the guac & chips, and it was delicious! Way better than my entree.<br><br>In summary, I'm obsessed with the vibe here. Still can't get over it. Make reservations ahead of time especially if you're coming for the weekend brunch. Don't forget to check in on Yelp for the free guac & chips. And be sure to grab something from the bakery on the way out!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JpmfsJQMLXApiAhS4oR50w/348s.jpg", "caption": "Vitamin D room"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Kt8YbVLvOj0bJg1WyDPjnQ/168s.jpg", "caption": "Smoked salmon hash brown benedict"}]}}, {"review": {"des": "Horrible Sunday Brunch. Service was completely lacking and food was cold. Would never go back.", "pics": null}}, {"review": {"des": "Ambience, vibe was fantastic! Loved how the decor transported you to California almost immediately. We checked in for the free guac and ended up ordering another because it was pretty good. I wish we had tried a variety of appetizers but the group I was with really loved the guac haha. Overall, food was mediocre. They didn't have the gnocchi so couldn't get that when we were there. Most of us just got salads because besides sandwiches/burgers there wasn't really a variety on the menu. When it came to the service, the hostess was very friendly, accommodating and nice. The waitstaff was unfortunately slow and inattentive... btw, learned from the waiter that there isn't a discount for getting a bottle of wine versus ordering it by the glass so I suggest everybody just go by the glass of their favorite!", "pics": null}}]}