{"name": "sun-wah-bar-b-que-chicago-2", "reviews": [{"review": {"des": "By far the best pecking duck place in Chicago! Also very reasonable - for about 40 you get a whole duck, with soup and stir fried rice. The soup was meh but the rice was great! It's perfect portion for 4-5 people. <br><br>Casual no frills place - but they have a good functioning bar now. A bottle of red goes well with the duck.", "pics": null}}, {"review": {"des": "I used to come here before and the food was delicious, however the cook or management must have changed because the food is definitely not as good. <br><br>The won ton noodles is supposed to have shrimp, but I didn't find any shrimp in the won ton. The broth also had no flavor, like they added too much water in the broth but didn't adjust whatever seasoning to account for the extra water. <br><br>I used to love the peking duck here, but now the duck just tastes like roast duck instead of peking duck (the skin isn't crispy). The buns also came out slightly warm, not hot like it should. <br><br>There are better places for won ton noodles and peking duck.", "pics": null}}, {"review": {"des": "I just had the duck dinner for our party of five. Call and make a reservation, you must pre-order the specialty 3-course duck dinner. I appreciate that the price of the duck dinner hasn't changed in a few years, it is still $45 for one duck and 6 bao, then duck fried rice and duck soup made from the carcass. My party also ordered a rice noodle seafood combination ($14 large size ) and a few drinks: Tsing Tao and 3 cocktails: 2 MSG (Their name!) cocktails and something else I can't recall. The cocktails were large for $10 each. Of course, the star of the show was the duck. very juicy and delicious. We ordered 6 extra bao for $3.95. However, the rice noodles were very bland and soggy, a good portion but completely unappetizing. We had to dump a ton of sauce on the noodles to eat some. <br><br>Also, the multiple waitresses was confusing. After we just ordered, different waitresses would come up and ask us if we had ordered. Overall, the meal was good for $106 before tax and tip. Come just for the duck, don't waste your time on other dishes.", "pics": null}}, {"review": {"des": "Sun Wah BBQ has made a name for itself in Chicago as THE place to get Peking duck. I've been meaning to go ever since getting back last year from a trip to China where I broke with my pescatarian diet and ate duck. <br><br>For weekends, be sure to make a reservation. We arrived on a Saturday night and the bar was packed with patrons waiting for a table. We let the hostess know we had a reservation and were seated right away. <br><br>When we made the reservation, we let them know we were interested in the Beijing Duck Dinner. For $45, you get a huge soup, a whole roasted duck carved table side, bao's and pickled daikon and carrots to make wraps with, duck fried rice and a bowl of white rice. It's a great deal!<br>We also ordered a vegetable, gai lan, which is a type of Chinese broccoli. We felt like a green was needed since everything else was on the heavier, fatty side. <br><br>All in all, a great dining experience. Loved the authenticity, reminded me of when I was a little girl eating in the Chinatown in NYC.", "pics": null}}, {"review": {"des": "The food has improved a little bit.  Rice congee with fish was pretty fresh and the stuffed eggplant was good.  Service continues to be gruff.  I think that's part of their culture, for better or worse, as they pride themselves on efficiency.  The slight improvement was very much appreciated.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XJKCmBUDnjp0xIkUzjJrWg/348s.jpg", "caption": "Fish congee"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OJ_z2POPzTfekNe-Hbzflw/168s.jpg", "caption": "Seafood with tofu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MD-FYYXG39VohezgNA51Ew/168s.jpg", "caption": "Stuffed eggplant"}]}}, {"review": {"des": "This place is amazing. Food was excellent duck fried rice was pretty good. However the duck which they carve at the table was the highlight of the dinner and the egg rolls for the appetizer were really good. Staff was ok nothing special. Place was clean prices are reasonable. I will definitely be back when in the city.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QK7ANmnzwVCR9hUeeMoG7Q/348s.jpg", "caption": "Calamari"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nHRk4wSjsPMHO2C_ZPvXzQ/168s.jpg", "caption": "Eggs rolls"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WjXJ0XUiUj5-1YNRu2ImIg/168s.jpg", "caption": "Seating area"}]}}, {"review": {"des": "Let's start with the good. The menu especially on a weekend offers options that most Chinese restaurant won't, such as Lobsters, Dungeoness Crab, and Blue Crab cooked in different ways. Today we had soft shell crab.<br> <br>They also offer Beijing (Pecking) Duck on 24 hours notice 48 on the weekend .  If you haven't had one I recommend you try it. bring a group it will feed about 4 people. Sadly nothing is ever going to compare to the one I had in Beijing, China - Now THAT was an Experience!!.   Sunwa though doesn't require a trip halfway around the world.<br><br>Nit picks, it's a large place and sometimes the food feels a little assembly line. Our Baby Bokchoy was a tad over cooked. I've eaten here several times before and I've always felt with the exception of the Beijing duck like the food was rushed. Plus it's a little pricey.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/juWp89kkOX7lAMkJwTsMmA/348s.jpg", "caption": "Baby Bokchoy Soft Shell Crab and Roast Pork"}]}}, {"review": {"des": "One of my favorite places to frequent in Chicago! I love duck and pork, their specialties, so it's the perfect restaurant for me. Even before I moved to Chicago, whenever I came to visit, my family would ask I pick some of their roast duck up to bring back to Ohio. Now that I live here, I get to indulge whenever I like--perfect! :)<br><br>Some standouts include their roast duck and pork of course! If you're dining in, get the Peking duck meal which comes with bao to put the duck in, soup, and duck fried rice. I am also a fan of their duck noodle soup!", "pics": null}}, {"review": {"des": "We had 2 Peking duck orders for $40 each duck. The meal includes fried rice and soup. With the second duck, they gave us crispy noodle instead of fried rice. Their Peking duck is really good! It's pretty worth it to come here because they don't skimp on the duck meat because they cut it in front of you. The fried rice, noodles and soup are pretty standard. One duck is enough for 4 people. We had more than enough for a table of 7.<br><br>I think the only concern about this place is that their waitresses are either too busy or less attentive. We had a really hard time tracking down our waitress for water. Also, we had to wait for a pretty long time (30 mins) for a table so make sure to make a reservation ahead of time!!", "pics": null}}, {"review": {"des": "This place has the best Peking duck in Chicago. We ordered a whole Peking duck for dinner.  It was served with a big bowl of duck soup and duck fried rice.  Everything was delicious. The duck was moist and skin was crispy.  It was perfection.  Loved it!", "pics": null}}, {"review": {"des": "Wow this place is unbelievable. First off you need to order a Peking duck. Like if youre  not into that don't come here. They carve the duck table side. They give you some amazing bao to stuff the duck in plus some soup and duck noodles. The flavor on its own is unbelievable but they also provide a great dipping sauce. I recommend assembling the duck in the bao with some veggies and some dipping sauce sauce. Then have the noodles and the soup separately. Honestly from the soup all you need is the broth it's so good. <br><br>We also started with some dumplings which were amazing. It's sort or byo. You have to purchase beer but you can bring wine just be advised theres a 10 dollar corkage fee", "pics": null}}, {"review": {"des": "Heard so much about this place and read the reviews both good and bad but I for one like to try places out for myself .<br>1. Appetizers <br>Egg rolls : great flavor and size not oily <br>Fried fish balls : big portion enough to share a must try <br><br>2. Roast duck over rice : beat duck I've tried does not have the overly gamey flavor and for the price it cannot be beat <br><br>3. Mixed meat with vegetables: after the appetizers this dish was a little much couldn't finish it but it has plenty of meat and goes great with rice  . <br><br>Overall this place is great and I seen a roasted duck cut tableside that is not on the menu and once I saw the table next to me I wish I had ordered it ! Guess I will have to make another trip to order the roasted duck that if off the menu .", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YH-gkB72LhWP98lDzjHMtA/348s.jpg", "caption": "Roast duck over rice"}]}}, {"review": {"des": "Ambiance: casual<br>Food: 5/5 <br>Service: 2/5<br><br>We were super bummed when Sun Wah was closed for a weekend but we were determined to try this place. Luckily they were open the following week and we called in advance to reserve two ducks for 10 people (FYI: even though you reserve it, they don't start preparing the duck until you order it there).<br><br>They carve the duck right in front of you in big pieces and what I love the most is that it's really moist and flavorful. Each duck comes with 4 buns but we ordered an additional 8 so everyone could have a couple. The rest of the duck was taken away to prepare duck fried rice, duck noodles and duck soup. Usually a duck comes with fried rice OR noodles but since we ordered two ducks, we received both dishes.<br><br>On top of this, we ordered shrimp and eggplant as well as Mabo tofu. The shrimp and eggplant dish was a little weird in my opinion. The eggplant wasn't cooked long enough and the shrimp was a paste in the middle, almost like a sandwich. The Mabo tofu was ok, nothing to really rave about.<br><br>One of the reviews compared Sun Wah to Hon See and said that they were equivalents, but I digress, Sun Wah was way better. I would 10/10 come here for the duck again. The only reason why I knocked off a star is the service is lacking and it was nearly impossible to get more water.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/COvkSYRuNvoauzXb3BRaSg/348s.jpg", "caption": "Duck soup"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bvfeYhoBtfGOZmkQ_J7AiA/168s.jpg", "caption": "Eggplant and shrimp-pass"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PJeyaaREXY_aasaFvqk0Mw/168s.jpg", "caption": "Duck noodles"}]}}, {"review": {"des": "Simply fantastic! Wholesome Chinese food, so tasty and succulent. The duck was awesome, perfect combination of tender meat and crispy skin. Egg noodles great! <br>The only downside is that when ordering just the roasted duck it comes without any sides. When we asked if we can order some sides like vegetables or bao, they told us that it's not possible (unless we order either the entire duck meal or duck with rice) which was sort of dissapointing.", "pics": null}}, {"review": {"des": "I came here for dinner around 6pm, the place was pretty empty.  I was expecting a long wait but glad to see lots of tables available for us.  As time went by, it started getting more and more packed, so make sure to come early. <br><br>We got the foods everyone raves about, the roasted duck was really good.  It is a little different from what I'm used to, but the flavoring and taste is still really good. I highly recommend!  The roast pork was okay, skin was crispy, meat could use a little more flavoring.  Fried rice was pretty good also.  If you come here for just one thing, the duck is the thing to get.  I would love to come back when I'm in Chicago again!", "pics": null}}, {"review": {"des": "Had the Peking Duck Dinner came with duck soup and duck fried rice.  Everything was delicious.  The fried rice was excellent the flavor was on going yumminess.....<br><br>Also had the shrimp dumpling soup.  I'm so happy and full.   <br><br>Yelp does it again!!!", "pics": null}}, {"review": {"des": "The experience of this well known institution was horrific. The food was not warm and there was even a worm that could be vividly seen on top of the wonton soup, and the staff still put it on the table to serve. Not until we pointed it our that the staff would bring it back and changed it. That said, they were not apologetic of it.<br><br>The BBQ combo was just a dish full of grilled, dated meat from leftovers from the day before - I guess it was the case since we were the first customers of the day. The chicken fried rice was dry and cold. Another horrific dish was the fried bah-cho - since they did not have snow peas and morning glory - with loads of garlic and oily, and charging that for $14.50.<br><br>All I could say that for a restaurant that being raved so much, it was disappointing and completely off my list now.", "pics": null}}, {"review": {"des": "Looking for some good quality Chinese food?  Sun Wah Bbq is the spot.  Perfect place for a large group as there is plenty of space.<br><br>They are known for their roasted duck and rightfully so.  Its carved in front of you and is just full of flavor and very tender.  Not hard and tough as some restaurants can make them to be.  Make sure you try it!<br><br>Their salt and pepper shrimp and squid is delicious as well.  These are 2 of my favorite Chinese dishes and they got the flavor right.<br><br>On a quick note, their tea, unlike other Chinese restaurants, is not complimentary.  But if you order a pot,  its bottomless.  <br><br>The service is quick and the servers are very attentive. Even with a large group!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aOausWBGjsaKltfZgISR9Q/348s.jpg", "caption": "Oysters"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-58J-lcrkzorybjmfWGngQ/168s.jpg", "caption": "Buns"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qIad2QA-cQQnnuFqTguS2A/168s.jpg", "caption": "Roasted duck"}]}}, {"review": {"des": "I live 15 minutes away from Sun Wah and yet...I haven't been here since January! I miss it sooo much because:<br><br>1.) They have amazing deals for a la carte duck, pig parts, and Hong Kong style BBQ. I usually get 1/2 lb of the duck with the different dipping sauces so I can enjoy it for 2-3 days. Yum...<br><br>2.) Their rice dishes are well-priced here. My go-to is the shrimp curry on top of rice because the sauce is so delicious with the sauteed white onion and Chinese peppers. Sigh...<br><br>3.) The people are great! Maybe its' because my family and I have been coming here for more than 15 years, but the folks here have always been so kind to me. Even when they're busy they take the time to ask me how I am as the visitors look on like,\"why is she getting special treatment?\" Well, maybe because my family has literally given Sun Wah hundreds of dollars over the years. Willingly. And, to be honest, they deserved every single penny.<br><br>4.) It's easy to get a table but I usually get take-away because I like to order a bunch of food and stretch it out over a few days. If you eat in, you can get table side service where they cut up the your order of the whole duck for you. You feel like royalty if you order this...so definitely try it sometime!<br><br>Sun Wah is my absolute favorite Chinese restaurant on the Northside and I would highly recommend it to anyone. If you're interested in going sometime, feel free to let me know so I can tag along! ;-)", "pics": null}}, {"review": {"des": "Great place to spend a birthday dinner or just hosting a get together with friends or family. The best part is they are BYOB!! Which saves you so much money instead of spending another hundred bucks for alcohol. <br><br>We we're visiting Chicago for a few days and one of my bfs friend was hosting this dinner for 12 people and we got invited to it too. They have a great duck dinner and we just ordered some other food from the menu on the side. I dragged my friend and her husband so there's more of us to dinner than planned. <br><br>We had a blast for dinner and next time I'll be back in Chicago I won't hesitate to come back in this place again if given the chance!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IVs7sq-d8id-CCbv3TFY6Q/168s.jpg", "caption": "Ginseng drink"}]}}, {"review": {"des": "Disappointing, almost miserable experience. <br><br>Overpriced, over-cooked, over-salty and overly rude service. <br><br>My parents were in town for my mother's birthday and some relatives drove in 45 minutes from the suburbs.... I feel so bad about booking this place.<br><br>Do not come here thinking that the food looks like the pictures... we ordered two non-Peking Ducks. Peking Duck should not come all mushy drenched in a pool of soy-sauced-up grease. Good Peking Duck should have crispy skin, and there shouldn't be this weird salty, soy sauce all over it. They were stingy with buns and scallion/carrot as well as a watered down hoisin sauce.... They provide a teeny plate of pan fried noodles with that same disgusting, salty, soy sauce all over it! The noodles do not look or taste like they should of expecting to get what the ones shown in the pictures on the website!<br><br>Their Chilean sea bass was nicely flavored, but super chewy.... so either a bad thawing job in a microwave or overlooked.<br><br>Their Chinese broccoli portion was stingy, as they sliced the stalks to make it look like a full portion. Again, they drenched the broccoli in some kind of salty soy sauce like the one used for the duck.<br><br>Absolutely terrible customer service here. You have to ask 4-6 times for water or tea as well as physically put your finished plates in front of them as they storm by.<br><br>Not worth the $160 bill, and definitely not worth the Uber rides. I'd recommend MingHin and Lao Sze Chuan for Chinese food (until I discover more).", "pics": null}}, {"review": {"des": "On a recent Chicago weekend I got a chance to have the Beijing Duck dinner for the second time.  The staff and owner were nice to accommodate me on a late evening.  Now I truly love the experience here, and the spacious setting that you will not find in New York City.  The Beijing Duck dinner is a great family-style meal with the wonderful duck fried rice, and wintermelon soup.  However, what earns the 5 stars is the high quality of the duck.  I find it much more difficult to find very high quality roast duck today, but am thankful that Sun Was has kept their high standards.  I look forward to my next visit here1", "pics": null}}, {"review": {"des": "This nice Chinese restaurant seems always busy.   We stopped one Friday night around 6pm and there was a 30 minute way (you can call ahead for reservations).   As you walk into the lobby you can see all the great BBQ meats hanging from the window.<br><br>We got 3 dishes.<br><br>BBQ ribs and Char siu over rice.   The dish was good and inexpensive ($8).   The flavors could be bolder and sweeter, but they were not bad.<br><br>BBQ Roast duck over rice.   The meat was not as moist as I expected and the flavor was also a bit light.<br><br>Chinese broccoli with oyster sauce.  Very well made vegetable dish. The broccoli was cooked perfectly, not too soft, not tough.  Very nice.<br><br>Staff is friendly and prompt, but very busy.  Many people around our table got the Peking Duck dish, which is not on the menu, but very popular.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ya51vVwh7LlThJTthrhrtw/348s.jpg", "caption": "BBQ on rice"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hcgAbow1xvTXWjCaj4nF6w/168s.jpg", "caption": "BBQ on rice"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dtQ0_pSnpRvLwJPt6wSgkg/168s.jpg", "caption": "Chinese broccoli"}]}}, {"review": {"des": "Really a 3.5 but I'll round up for coming in around 2pm and ordering to go. Maybe my meat was a little dried out by then.<br><br>People come here for the BBQ of course!  The duck, especially, but I've always been a huge fan of the rice with 3 meats combo.  BBQ pork, duck and chicken on top of rice and some kind of greens, gai lan.  For around $10 you get quite a bit of food and a cup of broth to wash everything down.  I was also surprised at the service.  The owner and the woman who took my order both seemed really nice.  I would love to come back and give their menu items a try.<br><br>The only con was that the pork I received was dry and did not come close to being as good as any of the other places offering Chinese bbq pork.  Again, I'd try it again.  Maybe it was bad timing.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/K4NhWbpId0eAaK5rU-fQwQ/348s.jpg", "caption": "Combo rice to go- the bbq pork was dry but still tasty"}]}}, {"review": {"des": "Aw yeah, Peking duck! I'm from the Washington, D.C. metropolitan area, where there's pretty much two restaurants that serve decent Peking duck. While out in Chicago for a work trip, I decided to try Sun Wah based off the numerous positive reviews (not to mention, a James Beard award) and a hangry desire to eat as much as possible. We made a reservation in the morning and we were able to secure a spot and the Peking duck dinner without any trouble.<br><br>When you order the duck, it comes with steamed buns, pickled radish and carrots, green onions, hoisin sauce, veggies, duck soup, and duck fried soup. It's $45 and can serve 2-3 people. We, of course, ordered the duck feast and also wanted to try the fish congee. <br><br>Almost immediately after we place our order, a server bounced over with a folding table in one hand and a large plate of the whole roasted duck balanced on the other. Even though I've seen this act a thousand times, it never gets old. The precise even slicing, the way the knife cuts so effortlessly into the skin and meat - it's like poetry in food. <br><br>Aside from the show, the next best thing about Peking duck is the DIY factor. I love piling on the duck, veggies, and sauce into my bun and taking a big bite into it. The layering of flavors from all the components is perfection. You can bet that we ordered another order of buns to take advantage of as much duck as we could that night. <br><br>The duck soup and the duck fried rice are also fantastic complements to the star of the show. I absolutely love that they serve these sides and wish that more Peking duck restaurants would do the same. The soup is loaded with leftover duck bones, winter melon, cilantro, and ginger. <br><br>This was such a satisfying meal. Every single thing we ate here was delicious. I highly recommend anyone who likes or wants to try Peking duck to give Sun Wah a chance.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cjHA7dE8bQNK0EoSeyn4bg/348s.jpg", "caption": "Sliced in front of your table"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-KWUAL78bWRQVZoEGBbPzw/168s.jpg", "caption": "Peking duck"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dgX6ZFv_1SHd2_bfj2bzEg/168s.jpg", "caption": "Duck soup"}]}}, {"review": {"des": "Took Mom for Mother's Day... She likes it here. <br>The food is okay and the service is okay as well. Not sure if these are really compliments but mom likes it so that's good enough for me to give three stars. Well. Cuz I love mom... =]", "pics": null}}, {"review": {"des": "The Peking Duck dinner is where it's at! But they now charge extra if you get extra buns. STill worth it though. Everything we got was delish. I am looking forward to being back in Chicago so I can go again!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/44W9joAApG3fwPJLCO6c5g/168s.jpg", "caption": "Yesssss. Peking Duck with buns, veggies and sauce. GLORY."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FVYy1lXT9ZDAOG8h8GuY0w/168s.jpg", "caption": "Garlic snow peas. So yum!"}]}}, {"review": {"des": "This was my first time getting Peking duck in the U.S. and surprisingly it did not disappoint. I did have some issues with the side dishes.<br><br>Peking duck - 5/5<br>Like in China, the duck gets wheeled out and sliced in front of you. Then you get to make little wraps with buns, sliced scallion and carrot, pickled radish, and duck sauce. While the buns aren't the most \"authentic\" receptacle for Peking duck, they still effectively served their purpose and tasted delicious. The duck itself was fantastic -- crispy skin, tender meat. The flavors of the fresh toppings and sweet sauce complemented the saltiness of the duck perfectly. <br><br>Duck soup - 3/5<br>The soup made with the leftover duck was so-so. It had cilantro, soybean sprouts, sigua (a melon vegetable), and not much duck flavor. While it was refreshing amidst the other salty foods, I was left craving the richness that duck should provide.<br><br>Duck fried rice - 3/5<br>This had the potential to be amazing. It looked good on presentation but turned out to be quite salty.<br><br>Stir fried pea sprouts (豆苗) - 5/5<br>Oh god yes, my favorite vegetable. Sun Wah cooked it very well, no complaints whatsoever. I would eat this every day if I could.<br><br>Overall, the most important part -- the duck -- and the pea sprouts were tasty. The side dishes were just alright.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yRBQ-9L8626fC1pVRrR6YQ/168s.jpg", "caption": "The full plate of duck, with buns. Stir fried pea tips shown in the right. Both were great!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RWAW1N4ZYMJ96uzIfN66vQ/168s.jpg", "caption": "Slicing the duck!"}]}}, {"review": {"des": "Took my wife here for lunch. Kept talking it up as I've been told by several friends to come try it out.<br>The experience however can be summed up by one line she said to me while eating...<br>\"I just hope you're not going to get diarrhea.\"<br>Dry duck<br>Dry and sour bbq pork<br>Spoiled wonton filling<br>Candy sweet soup", "pics": null}}, {"review": {"des": "Came on a Saturday afternoon with a party of 3 and we were told it would be a 45 minute wait. Sure, the place was full and bustling, but I didn't see that many people waiting so I didn't believe it. Sure enough, we were seated within 10 minutes. I guess they just want to be conservative with their time estimates. Split the Peking Duck dinner amongst us 3 hungry guys and it was a good amount. Note that it isn't on the menu (at least not that I could see) so you just have to request it.<br><br>To start off, they bring the whole duck to your table and thinly slice off all the nice outer pieces onto a plate. This juicy meat with crispy, slightly fatty skin is amazing, perfect by itself but typically eaten with the provided buns (they give you 6 but we ordered 6 more for ~$3.75), veggie accoutrements, and sweet sauce. The rest of the duck is taken to the back and converted into a large bowl of soup and medium plate of fried rice brought out later. I feel indifferent about the soup and rice; the duck slices are where it's at!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/J3_bhL7ME2u2W6fuv6X3DQ/348s.jpg", "caption": "Peking Duck"}]}}, {"review": {"des": "Love,  love,  love this place.  I've been coming to Wah Sun since the 80's! They used to be on argyle then.  You will never go wrong with their food. Their Chinese barbeque pork,  the roast duck and chicken and roasted pork are all delicious!!", "pics": null}}, {"review": {"des": "Everyone's saying it and I'm gonna say it too...<br><br>PEKING DUCK.<br><br>They sat us quickly and I took the advice of everyone here and ordered the peking duck. About one minute after our server walked away, they wheeled over a cart with a whole duck on it and cut it up in front of us, Christmas Vacation style. Not only was it juicy and flavorful, but the skin was perfectly crispy and you don't even have to worry about the bones. The duck came with a large plate of fried rice, a giant bowl of soup (which I didn't really care for), and six baos. You build the baos yourself with the duck, carrots, daikon and sauce.<br><br>Probably the best duck I've ever had. I normally come up to Argyle for Vietnamese food but I am so glad I decided to give Sun Wah a shot.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/v9ksvF18CUBxnLSqu_TqbA/348s.jpg", "caption": "Build your own bao"}]}}, {"review": {"des": "Half a block away from the Argyle Red Line station, Sun Wah is a staple in Uptown. It has a big menu like many other Chinese restaurants, but the real star here is the off-menu \"Peking Duck Feast Dinner\". Reservation with pre-order is highly recommended (phone or email) as they do go through a lot of ducks every day (our server said about 300 on that Saturday we came!). <br><br>The Peking Duck is a lot more authentic than many other places in Chinatown: the chef carves your duck table side, which is always fun to watch; after they leave you with the meat and buns to tackle down, they take the bone to make duck broth soup and duck fat fried rice. The meat is super tender, and the skin is perfectly crispy and flavorful. It is a lot of food; my boyfriend and I were so full after it and the leftovers were enough for a full lunch the next day. And all of it costs only $45! Definitely a great value.<br><br>The only reason I'm not giving it 5 stars is that it still skips a bunch of steps in a true traditional Peking Duck dinner, as I loved so very much in Beijing (like dipping the skin in sugar and letting it melt in your mouth; different kinds of buns; etc.) But very happy there's some place in Chicago doing Peking Duck as much justice as Sun Wah!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/t1jcx9nMUuPgIFD9VVqaXA/348s.jpg", "caption": "Carved Peking Duck"}]}}, {"review": {"des": "ChangsGiving Tradition...Peking Duck Feast beats Turkey any day!!!<br><br>Fifth year in a row since our daughter moved to Chicago...we'll never go back to Turkey again!", "pics": null}}, {"review": {"des": "This was my first time here. Wanted to get duck but didn't know where I could get good ones in Chicago. Sun Wah did not let me down! The duck combo was a great deal! We ordered one for two people and it was wayyyyyy too much for us, togoed it for two more meals!<br><br>Get the duck combo with the fried rice though. Did not particularly appreciate the deep fried noodles with duck.", "pics": null}}, {"review": {"des": "How have I not written a review for you Sun Wah? You make the best Peking duck dinner in Chicago, and more people need to know this!<br><br>If you haven't been here before, be sure to order the duck dinner ahead of time with your reservation. It'll save you the time of having to wait for that deliciously crispy and juicy duck that gets sliced and served table-side. From there, it gets used in a variety of dishes like fried rice and soup. You can choose rice or noodles for one of the dishes, but every single dish is fantastic.<br><br>I was not a duck person before, but Sun Wah made me a believer. If it can do that, then you know this place is doing things right in that kitchen.<br><br>Service is fine, but it's on par with other Chinatown establishments. There's plenty of tables and space to have a nice date for 2 or a large party of 12. Sun Wah is conveniently accessible via CTA, and all the wonderful goodness on Argyle.<br><br>Warning: once you have the duck dinner, you'll be thinking about it for days, weeks, if not months.", "pics": null}}, {"review": {"des": "After some deliberation, we had settled for an adventure in Argyle, a great area full of Vietnamese and Hong Kong cuisine. Honestly some of the best options available in terms of entrees and dessert so of course this was exciting. Of the tons of options available, Sun Wah BBQ ended up being the choice restaurant. <br><br>ATMOSPHERE/ARCHITECTURE: 8/10<br><br>Large open BBQ specialty restaurant on Argyle. Inside is actually really huge. It can probably seat 120 and that's a conservative estimate. It wasn't that busy on a Monday night which is to be expected. There's a nice open rotisserie in the front when you walk in so you can see where your food is cooking. I believe they sell takeout here as well. <br><br>SERVICE : 7/10<br><br>Average service. The waitress was attentive though was a bit slow. The food came out very quickly though after ordering which was a nice surprise. <br><br>FOOD: 9/10<br><br>We got several dishes, the lean pork and century egg congee, shrimp stuffed eggplant and BBQ combination. <br><br>Lean Pork and Century Egg Congee - Basic congee with some pork and egg. It came out quickly and was steaming hot. I had never tried this before and was a little uncertain. To my surprise, the century egg was very good in the dish. This was a good soup and palette cleansing dish. <br><br>Shrimp Stuffed Eggplant - After finding out about authentic Chinese eggplant dishes, I was hooked. This is the eggplant Parmesan of Asia. Sautéed and stuffed with some shrimp, the eggplant was quite tasty. The one minus here was I did not really find very much shrimp in the eggplant itself. <br><br>BBQ Combination - Various different BBQ meats including chicken, pork and duck. The duck was very good and definitely a winner here. As always, it was very bony. The pork that I did was had nice crispy skin with good flavor. The chicken was probably the weakest as it was kind of dry.<br><br>PROBABILITY OF RETURN: 8/10<br><br>They have SO many options here that I would definitely return here to try something different.<br><br>TO EAT OR NOT TO EAT: EAT! It's a great place that I feel almost everything on the menu is worth a shot.<br><br>OVERALL: 8/10", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/j9s9p5nstsFt1FVhRfQA9A/348s.jpg", "caption": "BBQ Combination"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Vp2j57ifr4ehEUVwsheZEg/168s.jpg", "caption": "Shrimp Stuffed Eggplant"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0x6Jdoj0_E53ngKfrH6cSA/168s.jpg", "caption": "Lean Pork and Century Egg Congee"}]}}, {"review": {"des": "Got to get that Peking duck dinner for $45! Say what? Seriously, this was such a great deal and the duck was juicy, flavorful, and the skin was really crisp. So what do you get for $45 you say? You get a whole duck, 6 buns, duck fried rice, and soup. <br><br>We stayed near downtown Chicago so we had to take a 20 minute Uber to get here and back. Was it worth it? Heck yea! This place came highly recommended by one of my friends who lived in Chicago and said it was the one place he had to go to whenever he was back in town. <br><br>My husband and I got here around 6:30pm on a Saturday and it was about half full. Of course we ordered the duck dinner to share and within 10-15 minutes gentleman wheeled over our duck and started slicing it in front of us which was a fun way to present our meal to us. He had told us on a busy night that he can go through 100+ orders of ducks. Crazy right?! <br><br>Taste wise I really enjoyed the duck, the skin was crisp and perfectly paired with the sauces and pickled veggies. The baos were nice and warm and tasted homemade. Yum. The duck meat itself was nice and lean which is exactly how I like it. After we were almost through with our Peking duck, they brought out our soup and duck fried rice. I love soups and this one was especially nice since it was rainy and it warmed my belly as I washed down large spoonfuls of the fried rice. The fried rice didn't have a strong duck flavor, but rather had pieces of duck in there. The flavor was good and complemented the soup well. <br><br>Overall, I would probably make the trip out here again as I really did enjoy this meal and though I could probably find something similar in the bay area, there is something about this place that I really like. Plus price point was really great especially if you have a big group of people.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/co1YFMTN6roC0MrSUBwggw/348s.jpg", "caption": "Peking duck dinner $45- the only way to go"}]}}, {"review": {"des": "Not much to add to the thousands of reviews, but I've been wanting to come here for a while, Sun Wah's been on my eating bucket list for quite some time. We came last night, Sunday at 7pm. I had made a booking for 4 and included the peking duck on the reservation (as there was no way I was missing out on the peking duck!) however when we arrived there were plenty of tables available.<br><br>I don't need to go into too much detail as everyone's already covered it, but we got the peking duck which was tableside carving of the entire duck, which came with bao to make up your little mini duck sandwhiches then they brought out duck fried rice and soup with the rest of the non carved up duck. We also ordered some Chinese broccoli, which I think added to the meal as it was good to have some veggies (and it was great that they sliced up the broccoli, rather than having the full stalks like at most Chinese restaurants where you have to try to gnaw at them because you font have any knives!) The duck skin was delicious and I really loved the rice. The soup didn't have too much flavor, but was a nice plain palate cleanser.<br><br>For all that food where we left full but not stuffed, it was only $70 (plus tip) between 4 people! Great deal!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Oy28HfQ9-jvWkHXnA6e2Og/348s.jpg", "caption": "tableside duck carving"}]}}, {"review": {"des": "Get the Peking Duck and get ready for a roller coaster ride of duck (sliced perfectly), duck soup, and duck fried rice or noodles. It was delicious and watching them carve it for you table side is a fun experience. You can BYO wine, $10 corkage fee. Really affordable too.", "pics": null}}, {"review": {"des": "I was here for a work dinner, and the food was amazing!  We had the Peking Duck dinner.  They carve the whole duck table side, and it's absolutely delicious.  It comes with buns, vegetables, and sauces.  The fried rice and soup made with duck are really good, too!  We also had crab Rangoon, shrimp lo mein, and Mongolian beef.  All of the food was excellent.  Our dinner was around 6, and by the time we were done, there was a huge wait.  I definitely want to come back!", "pics": null}}, {"review": {"des": "Overall Rating: 4.4/5 so I'm rounding up.<br><br>Taste: 4.3/5 Nom nom I love the roast duck! Just the right amount of flavor. Pairing the duck with the bao and pickled veggies makes for a great flavor combo that has me dreaming of more. The soup and fried rice are more so-so but I'm glad they were included.<br><br>Value: 4.8/5. It is $45 for the duck dinner which includes soup, fried rice, bao and veggies, and the roast duck. This is a good amount of food so make sure to bring friends (and split 4 ways it's like only $10 per person!). 4-5 people is a pretty ideal number to finish the food). We also ordered a veggie as a side just to balance our meal, but in retrospect that was unneccesary since we already had plenty to eat.<br><br>Service: 4/5. Good experience, and keep in mind Asian standards. We made a reservation for dinner and preordered the duck dinner just to be sure which I recommend if you are planning on coming! Speed of service was very fast--food came in like 10 minutes.<br><br>Ambience: 3.8/5. There's a lot of seating available and the space is very large. It is by no means fancy though-- you get the asian family cafeteria vibe.", "pics": null}}, {"review": {"des": "This is quite possibly the best Peking duck that I've eaten! It's even juicier and tastier than the ones that I've had in Asia. The price for the duck dinner is so reasonable for what you get - duck, buns, fried rice and soup. So good and worth it. The duck meat was just so juicy, tender and flavorful. We also got the stir fried bok choy and that was amazing. It had the garlicky taste that was delicious. We also loved the pork with the oh-so-crispy skin! That was so addicting.<br><br>The restaurant itself is huge and service is very quick and friendly. They're extremely helpful and let you know upfront about the little things like tea costs $3.<br><br>Overall, this is one of the most memorable meals that I've had in a long long time and one of my favorite meals in Chicago!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KHYJJrYdnUkwcRlNO7h-GQ/348s.jpg", "caption": "Duckkkk"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/M-gtBzyaCPZkaODiavkr_Q/168s.jpg", "caption": "Duck dinner"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Ial5XMweVgHsja8oYRbG-w/168s.jpg", "caption": "Pork"}]}}, {"review": {"des": "Love the table side Peking Duck!<br><br>What did I get.<br>The only thing to get is the Peking Duck dinner set. This isn't on the menu, you just ask for the peking duck dinner set and it comes with a whole peking duck, duck soup and duck fried rice. The peking duck comes with 6 buns. Once you put in the order, someone comes with a whole duck and starts to slice it right in front of you! This was great! You can see the duck steaming hot. yummmm. The rest of the duck is then taken to the back and they bring you a fried rice and also a bowl of duck soup. Now this is where I find things skeptical. I don't think my actual duck bones was used for the soup nor the fried rice...but regardless.... the illusion is there. The soup was a nice refreshing taste that compliments the roast duck. I wasn't a fan of the fried rice, it was a bit too wet for my taste. I do wish I had the choice for my duck shell... I would rather chew on the bones that have the fried rice....<br><br>Environment<br>This restaurant is right off argyle on N Broadway. Its walking distance if you get off the argyle station on the red line. The inside of the restaurant is quite big. As soon as you walk through the door you will see the barbecue section which is for those that are buying to go orders. There is plenty of seating inside.<br><br>Niceness of the staff<br>I always find asian restaurants very rushed...also with minimum explanation of the menu and friendliness. I asked for the dinner and without further questions she puts it in. No suggestions, nothing.<br><br>Dollar<br>PLEASE CHECK YOUR CHANGE IF YOU ARE PAYING CASH. The dinner was 45$ plus tax and all it came up to $50. This is decent for 2 people. I did experience an incident where I paid $100 to be changed and was only brought back $30 change... If I didn't double check then my meal would have been $70 plus tipping them. It may be a small error on their half, but make sure you check your change before you leave!<br><br>Yes?<br>It is a big far out. I stayed at the Loop downtown... But if I am in Chicago again, I would recommend going for those that haven't been just to experience the table side peking duck, because I don't have that in Orlando.<br><br>#WendyWanders #WendyandChiTown", "pics": null}}, {"review": {"des": "Ive been a customer for many years but now that the average entree price is $15 bucks I can no longer really rationalize going here, it just makes lunch unaffordable.<br><br>I know they recently got some kinda James Beard mention.... but still the prices are now too damn high.<br><br>Here is a handy hint for you, the roast ducks hanging in the window are the exact same ones they serve as Peking Duck to the suburban people who come here at night.", "pics": null}}, {"review": {"des": "I solely come here for their PEKING DUCK. Great place for big parties - birthdays, family reunion, etc.<br><br>If you order the combination duck platter, it comes with one full duck (w/ 6 baos + veggies), a big bowl of soup, and duck fried rice/noodles. It is about $50 for the combo but you can easily split that bill between 5 people and it'll be a good value. I like the fried rice more than the noodles cuz the noodles are super salty.<br><br>Pro tip: order extra baos since the combo only comes with 6 baos. <br><br>Service is a bit slow. So my suggestion is make reservation and \"pre-order\" your duck. I pre-ordered mine and we still had to wait a good 30 minutes for the food to come out.<br><br>Parking - neighborhood is free but main streets are metered parking for $2/hour (free on Sunday).<br><br>They allow you to bring wine for a corkage fee. They also have full bar so feel free to order up!<br><br>If you have a friend's birthday, ask the receptionist to give him/her the birthday gong special!", "pics": null}}, {"review": {"des": "My favorite place for duck in the city of Chicago. The duck dinner for 2 is amazing. Whole duck and comes with buns to make your own baos. Then they make a fried rice and a soup from what's left over from the duck. I also get the beef chow fun and roasted pork. My friends say I always over order when I'm there, and that's because I love everything there. I've also been there a few times and ordered the whole baby pig. Def worth a shot if you have a big enough group!", "pics": null}}, {"review": {"des": "I love duck and Sun Wah has been consistently one of the best (if not the best Chinese BBQ) place in Chicago. Most places only give you 2 courses from the duck while Sun Wah gives you 3 dishes (Peking Duck, Duck Fried Rice, & Duck Soup).", "pics": null}}, {"review": {"des": "Wow. Every time I come here I am in aw. The staff is friendly and service is very fast. Big area of diner so you don't feel cramped which is rare in Chicago. <br><br>When ever I go I get the duck. They cut it right in front of you and the bao and soup they serve it with is incredible. <br><br>I will come here again and again. I love this place", "pics": null}}, {"review": {"des": "5 stars for the quality of the duck buns, however, minus 1 star for the fact that they charged extra for additional sides. I do not understand why the sides are extra considering how the duck combo is already as expensive as it is. We were charged an extra $4.50 for a small bowl of sour Vietnamese cucumbers and an extra dollar for a few strings of carrots. Still so salty about that. Not to mention the fact that they only gave us 5 buns for one whole duck. So as a pro tip, order more buns. <br><br>As for the quality of the duck buns, pretty good for the most part. The best part was that they actually cut the BBQ duck at tableside, perfect for IG and Snapchat stories. Along with the duck/buns, the combo also comes with soup, fried rice, and some type of mushroom noodles. The purpose of the soup, rice and noodles is just to fill you up cause there are no taste to it. It's mediocre and that it's me being generous . All and all, I would only come here for the duck buns and that's about it.", "pics": null}}, {"review": {"des": "Their bbq,in HK standard,is failure. <br>The skin is not crispy. <br>The meat is not juicy. <br>The taste is count on dipping the source, instead of the meat itself.<br>If you consider their barbecue is American style,the source is not rich enough.", "pics": null}}, {"review": {"des": "If you're looking for authentic (or great) Hong Kong Style food and decent service, this is NOT the place. My family is from Hong Kong & they did not find this place to be worth the money. <br><br>We ordered about $100 worth of food, including the duck dinner, and everything was just decent. Nothing blew my mind, which was what I was expecting because of all the positive reviews. Moreover, the service is almost nonexistent. We stood by the \"host stand\" for 5 minutes waiting because there was a sign that said \"wait to be seated.\" 5 minutes later, I decided to go further in to see what is taking so long (the place was not busy) and saw a small note that said \"move to front counter to be seated.\" ...What? Well anyways, I moved forward to the next closest counter & asked a staff if I seat myself or what? The staff just stared at me and didn't answer or do anything.. I don't think she understood English. Then a server finally approached us & ask us how many etc. etc. I told her we had 6 & she didn't know what to do because apparently there were no tables available. She had a waiting list going on, but here's another thing - 4 hours before dinner I called to make a reservation and informed them I wanted a duck dinner. The person who answered told me I DIDN'T need a reservation & the duck dinner is \"first come first serve.\" Fast forward an hour at the restaurant, I realized the duck reservation was so they can prepare it ahead of time so we don't have to SIT AND WAIT AN HOUR for it to be roasted... Also, it was apparently just roasted but the skin was NOT crispy at all. In addition, we tried ordering a variety of food and the response to half of those orders were \"we don't have any.\" Excuse me??? I tried ordering ~5 dishes and they were all out. Unbelievable.<br><br>A big table that sat after us finished their meal before our duck even came out. They probably had reservation, but I made one too. The staffs need to learn to take reservations if that's how they advertise it on their website. <br><br>One more thing - My dad had to get up to call a server over almost every time we wanted to ask for something. I get that it's normal to wave a server over at a Chinese restaurant, but why do we have to get up and walk to one? We might as well serve ourselves. <br><br>Overall, one star is for the food being okay.", "pics": null}}, {"review": {"des": "Order the peking duck ahead of time and grab a reservation. For $40, you can feed 4 people with with the 3 course duck special - baos, soup, and fried rice. I would suggest ordering a side of greens (Chinese Brocooli/Bok Choy) for balance. This is one of the best deals you can get anywhere in the nation for Peking duck. And yes, it's delicious and tasty (as you would expect!).", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/F60j0tB2xzS6yqaoy8bcXw/348s.jpg", "caption": "BBQ Duck"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mDBKe5kkDKvTo1FPnRWjCg/168s.jpg", "caption": "Duck soup"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uOHaNO0Qv4at8A9qQVtJ6A/168s.jpg", "caption": "Chinese Broccoli With Oyster Sauce"}]}}, {"review": {"des": "Was Not really craving for Chinese food, but my friend Matt Lay told me you got to try there whole duck. He said it was AWESOME!!!! I didn't believe him at first. Was going to eat with my wife at Tang Lang Vietnamese Pho. So I said ok I'll try Sun Wah Barbecue. So we did order the whole duck. They came out to cut it. It looked tender and I took the slices and put in between white bun bread add the duck sauce and pickled radish and other vegetables, put it in my mouth WOW!!!! that's all I can say, so flavorful and tender delicious  the buns of bread really enhances the flavor and texture. Order a chinese beer. They took the rest of the meat and made duck friend rice. That was awesome too. I loved it so much I ordered ToGo for me and my friend Matt a whole. The only issue it did take a long time for our duck fried rice. When I go back to Chicago, I'll make sure this is my main place to go.", "pics": null}}, {"review": {"des": "OK this was a really great find. Thank you everyone for giving these reviews. This is what makes me try out these places. When I look at the reviews that you guys give it makes me go out and try it. So I had the wonton soup and I ordered the duck and rice. I had no idea that the soup was big enough for dinner. It was so good. Also the duck and rice was awesome. Prices are cheap. Parking was easier than I thought. I parked on the street. I was less than a quarter of a mile from there. It was a really good walk and I saw a lot of other restaurants that I will try out over the next few months. This is a good area to eat and just walk around after you finish. Go here people eat.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5F2WoDtHNc8jTpunIxyEIw/348s.jpg", "caption": "Spices at the table"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EPzoJS_rxgHeIXkSAXfiQQ/168s.jpg", "caption": "Outside"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/p21e02V63Fhp5nNv1NHebg/168s.jpg", "caption": "Outside"}]}}, {"review": {"des": "It's one of my favorite places to take people from out of town and new neighbors, because this place is a Chicago must. Far from the typical deep dish and the hotdog, this James Beard recipient provides you a duck dinner quick and delicious. Even without a reservation, you'd wait less than thirty minutes on the weekend. It would be a rarity if you do! Get the duck dinner plus an extra dish if there's four of you. My friend showed me the fried smelt fish (tasty and meaty for such French fry looking things) and shrimp stuffed tofu as dishes in conjunction with. And wow both were fantastic. Love the buns. Love the meat. Love the soup.", "pics": null}}, {"review": {"des": "We heard so much about the Peking duck at sun wah and finally had the opportunity to try the place last week. It's a huge restaurant, can't say that from the store front. In spite of being a week day the place was still crowded. <br>The duck was amazing, steaming hot, dinner tender and delicious. But that's about the only good thing I found in this place. We had an order of the fish balls that was ok. And I ordered the Singapore mai fun which tasted ok. <br>My problem with the place was the service. No one bothered to get our names for the table for about 10 mins after we had walked in and stood near the host table. And finally when we gave our names and waited for a bit more for a table the waitress seemed totally disinterested. Was annoyed when we asked her questions about the menu. Our food took forever to come and my noodles weren't even hot!!! We did not get our water refilled the entire evening until they came to ask us for the bill finally. <br>The only good thing about this place is the duck if you are really a big fan, I would advice you to get it to go!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/oZhMBumSjqfL3fUzoWh4wQ/348s.jpg", "caption": "Singapore Mei Fun with pork and shrimp"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jCUrxxNytq1uMFuxlw_jAg/168s.jpg", "caption": "Fried fish balls"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/q_GZEY8D5DhCELQOagbiyg/168s.jpg", "caption": "Half duck with rice"}]}}, {"review": {"des": "Came here with a group of seven and we had ordered a roast duck in advance. We also ordered the pork which was perfectly crispy as well as chicken, snow peas, and tofu with shrimp. The duck came after we had finished most of the other dishes and was split into three courses: duck with steamed buns, duck bone soup, and duck fried rice. The skin on the duck was very crispy and the soup was also delicious. The fried rice was a bit lacking in taste, and I wish it had come a bit earlier instead of after all the courses. The fact that they turned one duck into three courses, however, was great, especially for a large group. If you're going to get the duck, I'd recommend going with at least three others, especially if you'll want to try the other dishes!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/i0M5QCqKuj3Kb07xMR7_tA/348s.jpg", "caption": "Roast duck with steamed buns"}]}}, {"review": {"des": "This is the go to place for ppl who want a one stop restaurant to get all the Chinese food they desire. I personally prefer their soups and rice, but the meat (all of them) are cooked to perfection! Those who aren't familiar with The different types of Chinese cuisine, there's a video playing on multiple large screen TV narrating the differences and keeping you hungry! They also have BYOB, ugh I need to go back.", "pics": null}}, {"review": {"des": "If you love roast duck and roasted pork, this is a must go place! It's affordable and very tasty. I came here twice and I usually get the roasted duck rice plate with roasted pork. Sooo good! It's very affordable and portions are pretty generous. They have various cantonese style foods. Noodle soups, chinese bbq, lo mien, pan fried noodles, etc... You can also do family style dinners too, which I never had a chance to try yet. <br><br>This place is huge too and can fit many large families. It's not the cleanest place, but it's a Chinese place. <br><br>Parking hasn't been a problem for me the times I been here, but I imagine can be difficult at times. There's free parking around in the neighborhood and some street as well. <br><br>Make sure you check this place out!", "pics": null}}, {"review": {"des": "By far, the best Peking Duck I have ever had.  <br><br>It is not on the menu & should be ordered ahead of time on a crowded night.  <br><br>You receive duck soup, duck fried rice, and white buns to make little mini bao sandwiches out of as well as the delicous duck!  <br><br>They bring the duck out on a cart and slice it up right next to your table.<br><br>It says it is a serving for 2, but we always have leftovers, enough to have a full meal for 2!<br><br> Prices are low, food is great!!!", "pics": null}}, {"review": {"des": "I always come back for the Duck because the Duck here is about as good as it gets in Chicago. <br><br>Ambiance It is a very comfortable and it is a great place to come hang out with friends or for a date night. The place is big and doesn't feel too crowded<br><br>Staff they are always walking around and trying to make sure you have water and you don't have to wait too long before the food arrives <br><br>Food I mean sometimes there are no words to describe just how good the Duck is. I tasted the Duck which was cooked to perfection", "pics": null}}, {"review": {"des": "True Bar-B-Q Hong Kong style! I have been going here since shortly after they opened! Off the hook in all respects and a definite must try! Very reasonable, good service (thank you, Lilly, for your years of company and good food), and a grand new location.<br><br>Don't miss the duck, pan-seared Dover Sole, or the vegtable dish with the bacon!", "pics": null}}, {"review": {"des": "I love Sun Wah. I grew up eating at this place. Peking Duck is a must. It comes with so much! Soup, the Baos, fried rice. The restaurant definitely did come a long way.  whenever i dont have time to pack lunch i always run to sunwah for a bbq pork rice box. The BOMB. And also my favorite.", "pics": null}}, {"review": {"des": "This place used to be good. We came tonight and the haka tofu, Chinese broccoli and salt pepper fish we're all so salty that there were virtually inedible. We ordered chicken lo mein and got sliced chicken over fettuccine noodles!!! What?! I can't believe they served this with a straight face! The only thing that was okay was the Peking spareribs, they were drowning in sauce but still flavorful. <br><br>Go to one of the other restraunts in the area. This one has seen better days.", "pics": null}}, {"review": {"des": "fun experience, great food, ordered the duck combo and is enough for 4 people to share.", "pics": null}}, {"review": {"des": "We waited an hour for three of us on a Saturday night and only ate like 30 minutes. I couldn't tell you what we ate because my friend ordered everything but it was delicious. My review would be longer but I'm about to enter a food coma. It was delicious. Worth the wait.", "pics": null}}, {"review": {"des": "I came here on Christmas with my fiancé and we shared the Peking duck dinner.  It was fantastic!  I normally don't do duck too often given how fatty it is but if you're looking for the best duck in the city, it's here!", "pics": null}}, {"review": {"des": "5/5 for the $40 Peking Duck dinner. We preordered the dinner for LUNCH day of and made a res for 6. <br><br>Food:<br>PEKING DUCK DINNER: 5/5 - comes with roast duck, buns, sauces, condiments. The bones are made into duck soup and remaining duck into ducked fried rice. We ordered extra buns. A cook came out to carve the duck in front of us and voila roast duck served! The skin was so juicy and oily. Looooove. Duck was cooked perfectly. The duck fried rice also equally delicious. The light wintermelon duck soup was the perfect finish to wash down all the duck fatness. <br>ROAST PORK: 3/5 so dry...<br>CHINESE BROCCOLI: 4/5 standard<br><br>We walked out all happy with full stomachs. :D<br><br>Service: Quick and friendly<br>Ambiance: Large venue with ample light. Some reviews complained of cleanliness but everything was tip top to me!<br><br>Tldr; make a res and preorder the roast duck dinner and you'll walk out full and happy", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pIHI2IEWQErBreoiDYikew/168s.jpg", "caption": "Duck in the bao with all the condiments"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8a9Z8sDUI7BsxiUWbDBDUw/168s.jpg", "caption": "Peking Duck dinner"}]}}, {"review": {"des": "Get that Peking duck! I mean, why else would you go here? Just kidding. The duck is what they're known for. If you order a whole duck, someone will come to your table on a cart and cut it in front of you, cut in perfect pieces. It comes with 12 pieces of bun. I think this is how you're supposed to eat it- take a bun & open it up. Put a piece or however many pieces of duck meat. Add some green onions or picked radishes if you'd like, and top it off with sauce. And savor every bite, because you only have a few pieces of the bun. It comes with duck fried rice, so if you're into that. Save your tummy. I've tried it and didn't quite like it, but I know there are others who love it so I'll just be quiet.", "pics": null}}, {"review": {"des": "I'm writing this review because I didn't go to Sun Wah this time. I should have known better, but since I couldn't get a reservation and didn't want to wait in line for a table I decided to go to Chinatown for duck. <br><br>The duck at Sun Wah is perfection. Every time. I paid the price for straying. Sorry Sun Wah family I won't do it again. See you again next trip to Chicago!", "pics": null}}, {"review": {"des": "I've been coming to this restaurant for many years------- since they were located around the corner on Argyle Street.<br><br>The menu is extensive and will satisfy almost any taste, but they specialize in Hong Kong style BBQ.<br><br>However, the main atraction is the \"Peking duck dinner for 2\" which is not found on the menu; you have to request it<br><br>The meal starts with pickled radish and carrots. Then, The Duck is brought whole and meat is sliced at the table with great fanfare.   Rice buns, juliene carrots, green onions and hoisin sauce complement the dish. (I always order another set of buns)<br><br>The carcass is taken back to the kitchen to remove the rest of the meat to make \"duck fried rice\"; which is the next course.  The bones are then used to make soup; the final course.<br><br>It's a good value with Enough food to satisfy the biggest of appetites.<br><br>The only reason I dont give them 5 stars is because:  Service is not as cordial as it used to be and hot tea & sorbet are no longer included with the dinner. <br><br>I prefer that restaurants increase prices not reduce portions, or in this case, eliminate items from the dinner for 2. This takes some of the glamour out of the experience.", "pics": null}}, {"review": {"des": "My fav Chinese restaurant in Chicago. The pecking duck is to die for. <br>Service is nice. Has large portion.", "pics": null}}, {"review": {"des": "Cheap eats to be had here. I came here with two friends and we had a feast for very cheap. Each dish was less than $10 or so, but there was so much food on the plate. We tried a variety of meats and thought food was good overall. The duck meat is very fatty and delicious, as was the BBQ pork.<br><br>Service was okay, not the best, but you come here for the food. <br><br>We didn't try the duck because it looked too big for us but it looked really tasty.", "pics": null}}, {"review": {"des": "The food is great but one order of Duck 3 ways is enough to feed 5-6 people.   You do have to wait a little while so maybe order one other dish and make it a small.", "pics": null}}, {"review": {"des": "The duck here is pretty freaking incredible. My favorite part is the crispy skin, but the meat itself also maintains so much flavor and moisture. We order the duck dinner every time (it comes with the duck, which they carve up tableside; duck fried rice, and some duck soup with wintermelon). The dinner also comes with some buns, sauce and pickled veggies you can use to make little sandwiches. <br><br>We've ordered a few other dishes here (eggplant w/ shrimp, wonton soup, combo bbq platter, mapo tofu) and to be honest, every dish I've had here besides the roast duck itself was absolutely mediocre. However, the duck alone is worth having a meal here...so I'm sure we'll be back again!", "pics": null}}, {"review": {"des": "Does this place really need another five star review? Probably not, but they're getting it anyways. Hands down the best duck I've ever had. Good for 4 people plus leftovers.", "pics": null}}, {"review": {"des": "I went with a group of ten and my husband and I were the only first-timers.  Unfortunately the rest of the group advised that this was not quite as good as it normally was and a few things had changed.  We had a 7pm reservation on a Saturday and we had to wait only about 5 minutes to be seated once everyone arrived.  That wasn't that bad considering how packed it was in there.  However, there were several of the large tables open when we sat down so I'm not sure why it took any time at all and the bottleneck in the front hallway needed to be cleared.  But once we sat, they immediately brought water.  We had a lazy Susan in the middle of the table, which is very much needed for this type of setting.  After a few minutes, our server came and we had several bottles of wine and beer.  This was what the other eight people had always done on their visits; however, we were told that the BYO is now wine only and they couldn't have the beer.  I understand that they have their own bar but this is a change from their old rules.  Also, there is a corkage fee for each bottle (only $10) so it can add up when you have a large group.  We had pre-ordered the Peking duck, as several people at the table said it was the best duck they'd ever had.  Considering duck is my second favorite meat, I was very excited.  We ordered several other items as well and they came out very quickly.  They were not spaced out (I'm not sure if they were intending to or not) so it was extremely crowded at the table when everything arrived almost simultaneously.  Overall the service was a bit rushed but the woman was friendly.  She seemed stretched a bit thin.<br>We started with the eggrolls, which were surprisingly good.  What made them even better was the spicy soy sauce at the table.  Holy sh*t.  I want to put this stuff on my Cheerios, it's so good.  We also got the wontons, which were just okay for me.  They were nicely crisp but not very flavorful.  With the duck, you get soup, noodles, rice and buns with garnishes.  The biggest let down was the soup as I found it to be pretty much flavorless.  The rice was also not something I was a fan of.  I love fried rice, and this just was not up there with the best.  The buns and garnishes were very good and I did really like the duck.  I felt the skin was amazing (something I find few can master, myself included) and crispy and the flavor was awesome.  It was very tender, although it was overcooked.  When you make a little sandwich out of it though, that was super tasty.  In addition we got pork, stir-fry veggies and Singapore noodles.  Many at the table were fans of the pork and had gotten it before, but the piece I had was almost purely fat.  Perhaps it was just a one-off but it certainly did not make me want to go back.  I did really like the vegetables and I thought they were done very well.  They were fresh and had a nice crunch.  But the star for me was most definitely the Singapore noodles.  I always like these anywhere and these were some of the best I've ever had.  The spice level was pretty solid and I kept going back for more.  After the meal a few people said that the duck was not as good as it usually is.  However, I thought it was very good so I can see how if that was the worst it is, how people say it's the best duck they've ever had because at its best it must be a game-changer!  Go for the duck, stay for the Singapore noodles and start with the eggrolls.", "pics": null}}, {"review": {"des": "Ooo the Peking duck meal is to die for. Carved in front of you into delicious pieces, the carcass is whisked away to create an even greater dish. Just as you're fully enjoying the crispy skin and tender meat, a duck fried rice appears before you and it's even more magical than the duck itself. (Seriously I would eat that fried rice every day.) THEN! They come out with a duck soup, made with the bones of the duck! How awesome is that?? <br><br>My group ordered some other dishes that were also delicious, but this duck meal really stood out in my mind. I'll have to visit Chicago again just for it!", "pics": null}}, {"review": {"des": "Currently sitting in the restaurant writing this review because I ate so fast and filled up while the rest of my party was still finishing their meals.<br>$40 duck dinner. Comes with the baos, fried rice, and soup. Wow..<br><br>1-4 people? Get 1-2 duck dinners<br>5-8? Get 2-3.<br>9-12? You get the drift.<br><br>Make sure the first words that come out of your mouth are \"duck dinner please\" once you are seated (of course after you sneak in a \"hello, how are you\" as you remember your manners. That will get the process started efficiently. <br><br>Can't write anymore because I've caught my second wind. Time for more duck!<br><br>EDIT**** 5 minutes later<br>Still eating it as 5 stars. Just finished more fried rice and cleared out the soup. Really refreshing soup that clears the palate!", "pics": null}}, {"review": {"des": "I've been here 2 other times in the past, all possible experiences.<br><br>This time, the 4 of us came here around 5PM on a Saturday without a reservation, and we were able to order the Peking Duck dinner as well (usually you have to reserve ahead for this).<br><br>The Duck Dinner ($45) comes with duck soup, Asian buns, hoisin sauce and vegetables to eat the duck with, and either duck fried rice or duck fried noodles. This is probably enough to feed 2 to 3 people. <br><br>We also got stir-fried eggplant stuffed with shrimp ($14) which was really tasty but small, probably only came with about 10 pieces of eggplant. <br><br>Beef and Vegetables with Rice Noodles ($13) was also really delicious. The rice noodles were crispy and soaked in a thick, savory sauce and vegetables were plenty. <br><br> BBQ Pork ($11): This was also pretty good, but had a lot of bones so it was a bit difficult to eat. <br><br>I recommend getting a reservation (although be careful because they've lost my reservation in the past) and ordering the duck dinner and whatever else interests you! Everything I've had here so far has been decent.", "pics": null}}, {"review": {"des": "Many many options, good for groups of people ro share foods, specially a whole duck<br>But can also get weird in some of options. I ordered a soup with some egg which the egg seemed from a year ago, dark black, which i guessed that it was part of their cuisine but still was gross for me.", "pics": null}}, {"review": {"des": "I came here on a double date and it was pretty good. The other people I was with sort of took the lead in ordering for the table. Maybe I would have liked it a little more if I'd had more say but they come all the time so I let them take the reigns. <br><br>The Peking duck is a ton of food- you get the whole duck, a lemongrass duck soup, duck fried rice and steamed bao. I'm honestly not a big fan of duck but the Peking duck was crispy and tasted delicious with some hot chili paste on a bao. The fried rice was amazing and my favorite item on the table. The soup was okay but not all that appetizing with pieces of white duck fat floating in it. <br><br>We also ordered hot and sour soup and seafood pan fried noodles. Hot and sour soup is a little hit or miss for me and this was sort of thick so I didn't eat much. The noodles themselves were good but the seafood looked kind of dodgy. I am from Maine originally so I'm a little choosier than most but still, wasn't too fresh. <br><br>Overall I'm glad to have tried this place. A non shitty beer for $4 is worth 3 stars for sure. Our friends brought home two big containers of leftovers so it was a good value too! I don't think I'd rush back but it was fine.", "pics": null}}, {"review": {"des": "Overpriced and the quality isn't there. I guess when you're the only option for Chinese BBQ in the Northside, it's okay.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xxGYTg60DwyGoWhxpXb0gA/348s.jpg", "caption": "Their to-go menu board."}]}}, {"review": {"des": "3.5 stars<br><br>We made reservations for dinner after seeing the good reviews on the Peking duck dinner. <br><br>There were still a lot of tables available when we arrived at around 630pm on a Friday night, so we questioned whether we had needed to make the reservation. Everyone who was eating seemed to have ordered the duck dinner. That was a good sign. <br><br>The carved up duck was tender and flavorful. The soup was also a nice complement, but the fried rice was a miss. In my opinion, it tasted like soy sauce rice.<br><br>We ordered a small roast pork to try, but the meat was very dry. <br><br>Overall, it was a good dinner, but not an especially memorable one.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WN84iuCabkMjYnVeauChog/348s.jpg", "caption": "Peking duck with the buns"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RTdAhTOmRJkace4aq5VeaA/168s.jpg", "caption": "Peking duck and a small roast pork"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Gc4OztvVCvB0XaN2AURpCQ/168s.jpg", "caption": "Duck fried rice and winter melon soup"}]}}, {"review": {"des": "Peking duck is not really Peking style...it appears more consistent with the Southern China's style of cooking. Other food is good but not great. Overall okay, but not worthy for a second visit.", "pics": null}}, {"review": {"des": "Peking Duck comes with large bowl of soup and plate of fried rice. One order of baos comes in 6. We had 8 people so we order another.<br><br>Salt and pepper squid not the greatest and wasn't fried thoroughly so still chewy.<br><br>Roast pork was crispy and delightful.<br><br>I would come again for Peking duck.", "pics": null}}, {"review": {"des": "I really really really love the Beijing Duck Feast. While everything I have had here is very good, the Duck Feast is next level. Great for bigger groups. While you can BYOB here there are, in my opinion, steep cork fees. They do serve alcohol as well. I'm torn if the BYOB option is worth it. It was nice to choose your own wine to pair with the duck though. Great food and good service. Gem!", "pics": null}}, {"review": {"des": "Disclosure: This review is solely for the singular hostess that picked up the phone and was utterly rude and condescending as I talked to her over the phone tonight. I called in to find out if they took reservations and what the wait time would be like. From the jump, she seemed annoyed to even have to answer any questions and was trying to rush me off the phone. At times, at busy restaurants this is understandable as they can be quite busy at the front of the house. But I guess I made the mistake of asking a second question to clarify her confusing answers and the hostess started to laugh condescendingly and ridiculed me for asking her a question! It was the strangest experience I've had calling into a restaurant! Her behavior was completely unnecessary and strange to say the least.  Isn't part of the limited responsibilities of a hostess to pick up the phone and answer questions? Is it too much to ask of someone who works at, from the looks of it, a popular and busy establishment to be competent and not condescending to potential customers? Strange for a restaurant to hire this caliber of staff at the front of their house. Again, it was one person so she may not be representative of the other staff there but considering she's the first contact I had, I'm not keen on visiting this place tonight as I had planned. <br>In the future, I might give this place a shot again but with so much to pick from in Chicago, this particular experience can become quite a deterrent!", "pics": null}}, {"review": {"des": "Ever since I heard about this place, I've been DYING to try it out, and I'm SOO glad I finally got the chance.  So my friends and I got the full duck combo that comes with the Peking Duck and Buns, a duck soup, and duck fried rice (other people say you get to pick between noodles and fried rice but unfortunately they never asked us-- which I was a little bit upset about since I wanted to try the noodled but that's fine). The overall cost of it was $45 (people were saying $40 so I feel as if the price went up). And it easily fed three people (with a little left overs too).<br><br>Peking Duck + Buns (4.5/5)- UGH SO GOOD.  they carve the duck in front of you, and the skin was so crispy with a great proportion of fat so I loved it.  My only qualm came to the fact that they only gave you 6 buns for what is a whole Peking Duck.  Seems a little stingy in my opinion, esp because we had a lot of skin left over with no buns left to eat it and had to order rice to go with the rest of the duck meat.<br><br>Duck Soup (3/5)-- not much flavoring in the soup, can barely taste the duck flavor.<br><br>Duck Fried Rice (4/5)-- Pretty decent fried rice... nothing too special, again the duck flavor is slacking so I was slightly disappointed.  <br><br>Overall, it was a great experience though and it was fun watching the duck being prepared in front of you. I would say the service is a little bit slow, but it's fine.  Definitely would recommend everyone try once.", "pics": null}}, {"review": {"des": "Yesterday, my dad went to get some Princess Chicken, Roaster pork and BBQ pork for our Chinese New Years eve dinner. The only thing good about him going to get the roasted bbq meats there was it wasn't busy for it. Now, we know why because of no chaotic lines you would think the roasted foods would be pretty good. But no, it was less than stellar. I guess their Pek-king ( roasted) duck is great but the other stuff is just average. Disappointed about their roasted food. The chicken was okay, roasted pork the skin wasn't crispy the pork tasted very dry. Their bbq pork salty no real bbq flavor that I've come to know and love since I was born into this world. Alright, so now we learn why this place isn't packed when people are going crazy in Chinatown for roasted bbq, cause it isn't great.", "pics": null}}, {"review": {"des": "A must-try if you're in the Chicago area! While visiting Chicago, I had to try this place, because of course, I would love to see a whole duck cut up right in front of me and made into multiple dishes. <br><br>My favorite was the duck meat with the baos. I made sure to finish every bao we got because they didn't give you very many.  Glancing at the table next to us, I was a little appalled that the party next to us had left so many untouched when they were done with their meal.  T_T<br><br>My least favorite dish was the fried rice with duck. It was quite dry, making it really hard to swallow. The soup was handy to have, but it did contain lots of bones from the duck, so I wasn't a big fan of the soup either.<br><br>Downside is that this meal does come with a hefty price, but we did have leftovers for a meal the next day.  Keep in mind this specialty meal is not even on the menu (not when I was there).<br><br>Sun Wah BBQ was a quick walk from the train station.  The place was packed when we arrived, so there was a bit of a wait.  While there, I remember a homeless person kept coming in and outside of the restaurant, drawing attention to himself.  What drew even more attention was a staff member yelling at him to stay outside.  The incident made me feel a bit weird in how the situation was being handled.  Food and staff were great outside of that incident.", "pics": null}}, {"review": {"des": "PLEASE REVIEW YOUR ITEMIZED BILL ESPECIALLY IF YOU GET TAKEOUT. I HIGHLY RECOMMEND YOU TO CHECK WHAT YOU RECEIVE PRIOR TO SIGNING YOUR CHECK. <br><br>I ordered takeout from sunwah yesterday. The day before I called the restaurant to place my order and called back again to confirm the PRICE, food items I was going to receive and if I can have someone else pick up my order. The person on the phone was pleasant and gave me a total price and reassured me that someone else can pick up. <br><br>I NEVER thought they would charge me more than what they told me the day before given the great experience I had with them until yesterday. The bill ended up being a lot more. When I called to inquire, it turned out that the person who took my order the day before told me the wrong price. I told them that that can't be cause I confirmed the order and had two phone calls. Upon checking, they found out I was erroneously charged extra for sides but insisted the actual bill should be more. I asked if they would check who was the staff who placed my order and they refused to investigate. Prior to ending the conversation, I asked for a refund on the extra charge they admitted was an error but they said I have to go all the way back to the restaurant to figure it out as \"that's how their system works\". <br><br>I am utterly disappointed with (1) the restaurant for providing me with false information even after I called to confirm twice (2) the restaurant made it difficult when I asked for my money back even though they admitted that they made an error and \"accidentally\" added additional charge to my bill", "pics": null}}, {"review": {"des": "Come here and get their full duck combo ~40 dollars. Comes with fried rice or pan fried noodles (I prefer the noodles), a duck soup, and most important, the Peking Duck and buns. <br><br>Only thing that needs to be said is that this place is my favorite place for duck in the Midwest.<br><br>Absolutely phenomenal.<br><br>I've tried their other food and it's good but nothing as good as their duck. Definitely come and just get the duck", "pics": null}}, {"review": {"des": "Went with a group of four to get the Peking Duck Dinner on a Friday night. To start, a server carved the duck at our table and served it with baos. Next, they made duck fried rice out of some of the duck that remained. Finally, they took the bones to make duck soup. All three courses were great (with the duck and baos being my favorite). Definitely would go back.<br><br>Tips: Order extra baos and call 24-hours in advanced if you are trying to go", "pics": null}}, {"review": {"des": "Peking duck you are the most tastiest thing. Hands down one of the best places in Chicago to get a duck either to go or to enjoy at the restaurant. They have a variety of roasted items from pigs, chicken feet, duck, the whole works. <br><br>If you are a fan of duck and dining in I recommend buying the duck family dinner which includes the duck with about 6 steam buns, duck fried rice, and broth. They cut the duck up in front of you and put in the middle for everyone to enjoy. The down fall is the timing of how they bring food out. My mom isn't a fan of duck so she order noodles. The duck came out with it but not the duck fried rice. Now the food gets cold pretty quickly and let me just say cold duck isn't that good. <br><br>Service is on the down side too, they bring out food and then don't come back until they have to drop of the check. But overall their food is really good that I can deal with that part.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/I_qz8DI1SNtLyOL6V7UkxQ/348s.jpg", "caption": "Peking duck family dinner"}]}}, {"review": {"des": "Great place for Chinese-style BBQ. If you come here for Beijing style roast duck, you won't find it. They have Hong Kong-style duck, which means that the duck is roasted, carved tableside, and presented (with the delicious fatty skin) with the accompanying hoisin sauce, veggies, and mantou buns to wrap them in. Delicious! Make sure you ask for duck soup, too, with the bones and other meat from your bird. I've been here multiple times and every time the food has been great. Noodle dishes are good (especially beef chow fun), fried rice is amazing. Today we had 4 orders of wonton soup, which were terrific. I've also had the drunken chicken, hongsao pork (I believe it is soy sauce), and others. It's Chinese bbq at its finest. Don't come here on a diet!<br><br>The one thing is that their service is just meh. Not the worst, but there's just so many customers that it gets hectic. No worse than many other large Chinese restaurants. If you come here on a holiday, try to make reservations. Oh, and you can order carved meat to go - buy a half pound of duck to eat later over rice!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hboy3XG5MWW3vHY9B1-Big/348s.jpg", "caption": "BBQ Duck"}]}}, {"review": {"des": "What happened to this place? The duck used to be delicious and now the skin is not crispy, the duck looked like it had been steamed? to warm it? The pancakes are no longer served with the duck, now you get bao; what's up with that? The soup never was good but the fried rice used to be tasty. And charging $3 for tea? In addition to all of the health department closures and now the so-so food we're done with this place. So sad to see the second generation dumb down what formerly was exceptional. James Beard people could not have visited this place.", "pics": null}}, {"review": {"des": "Peking duck dinner was delicious!! Definitely worth it to make a reservation and pre-order the dinner. Duck was full of flavor! Steamed buns paired perfectly, fried rice was great with the duck, and the soup was very flavorful. BYOB was also appreciated.", "pics": null}}, {"review": {"des": "Service was excellent. <br>We had peking duck again. <br>It is served with soup (2 star) and fried rice (reeks of re-used oil - 1 star!). <br>The peking duck was excellent.<br>We discarded the soup and fried rice. Peking duck itself is sufficient as a full meal for 3 people.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/42XSBX_m1YQi1GqU1XRaIA/348s.jpg", "caption": "Amazing Peking duck"}]}}]}