{"name": "sunda-chicago-2", "reviews": [{"review": {"des": "Came to Sunda with a group of family members and had a great experience.<br>I actually recommend coming here with a group because there's so many great things to try, it's easy to taste a little bit of everything that way. <br><br>We were seated at the \"Chef's table\" which was super fun to be so close to the sushi chefs doing their thing. The menu is HUGE and we all ordered a bunch of appetizers to pass around the table and share. We got the spicy edamame, oxtail pot stickers, tiger shrimp tempura, crazy rice and crispy Brussel sprouts. Ugh... yum!!! Everything was absolutely delicious. I don't know what they do to their Brussel sprouts but it's magical. The tiger shrimp dish was very sweet but went well with all of the other savory dishes. The pot stickers were my fiancé's favorite and you just can't go wrong with the crazy rice. <br><br>We split some rolls for dinner including the rainbow roll (my favorite) and the crunchy pig, hidden lobster roll. Honestly, the roll with bacon on it did not work for me... I read mixed reviews about it prior to coming here and I can see why. I enjoy the unique concept of it. But of all things bacon goes great with, sushi is not one of them. I'd skip on this roll for sure and order a different one.<br><br>For dessert we shared the carrot cake, the molten chocolate cake, the coconut cheese cake and the seasonal sorbet. Might stop in here for just for dessert next time because they are SO good! Some of the best desserts I've ever had. <br>If you're looking for a restaurant for a big group of people wanting to share some wonderful food, this place is it.", "pics": null}}, {"review": {"des": "My girlfriend and I came here for a nice dinner the day before Thanksgiving. When we walked in, we couldn't help but notice the bowl of Asian candies that we ate growing up and we helped ourselves to a few going in and on the way out. <br>We ordered the salted edamame which is a staple appetizer at Asian or Asian-Fusion restaurants and that was a great starter as always. From there, we got the Kai Lan dish for some veggies. The Chinese Broccoli dish was great but definitely a twist to traditional cuisine. It was sweet and salty but very flavorful and was a good way to get our tummies ready for our big entrees.<br>For our entrees, we got the Adobo Pork Belly which was delicious and our personal favorites from the meal. Growing up, we ate Chinese dishes similar in meat and style but the flavor and saltiness of the Pork Belly dish was extravagant. It was so savory and fatty but we didn't regret eating it for a minute. If you're willing to give more traditional Asian dishes a shot, we strongly recommend this dish because it isn't very Americanized/Fusion based.<br>To round it all off, we got Honey Ginger Braised Beef Long Rib. We thoroughly enjoyed this as well. The meat was so tender it fell right off the gigantic bone it was served with. Our favorite part was the congee they served around the bone that had soaked some of the meat and its flavor and was definitely a nice twist on a traditional Chinese porridge. This dish was slightly sweet and was a fusion of Asian and more American foods.<br>Overall, an extremely satisfying meal and would strongly recommend eating here. Try not to get stuck on the noodles and rices :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SgPNutIFi4O-zXvyx40spg/168s.jpg", "caption": "Adobo Braised Pork Belly and Kai Lan veggie Dish"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/J-AnC0IRU7BVJ0U7yf95bw/168s.jpg", "caption": "Adobo Braised Pork Belly, My favorite!"}]}}, {"review": {"des": "Wow! What a great place - everything we ordered - and I mean EVERYTHING - was delicious. <br><br>The Seoul wings, shishito peppers, Brussels sprout salad, and crispy rice with spicy tuna were my favorite appetizers. I ordered the Dandan noodles as my entree, it was also really good but we had ordered so many starters that I was full by then! Pace yourself :)<br><br>I recommend a fried rice for the experience as well - it comes with a fried egg and the server mixes it for you at the table.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-f5ZnTOoitBZYjoVL-4qwQ/348s.jpg", "caption": "Duck fried rice"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vN6Ut6cZW72oEoEBa7d61Q/168s.jpg", "caption": "Seoul wings"}]}}, {"review": {"des": "One of the best meals I had in Chicago, by far.  Sunda is located in River North and offers valet parking (cash only - I think $15).  We made reservations and were seated once our entire party arrived.  There is a bar that serves delicious drinks if you're waiting on folks in your party to arrive.  <br><br>Started off with the Shishito Peppers for $12 - fried in soy sauce.  Crispy Brussels Sprouts for $17 - fried in a vinaigrette which was delicious.  The oxtail pot stickers for $18 - delicious and very juicy.  The Prime NY Strip for $42 - meat was tender and served with sprouts, carrots, spinach, cucumber, sesame soy marinade.  Crazy Rice for $28 - with a fried egg on top.  Signature Crispy Fried Rice with Spicy Tuna for $18 - very delicious, perfect crunch with the fish.  Stuffed Avocado for $18 - no crunch, just avocado filled with spicy tuna, crispy shallots,<br>japanese salsa, ponzu.  Chili Albacore Sashimi for $18 - seared chili marinated albacore tuna, crispy leeks, rayu ponzu.  Crunchy Pig, Hidden Lobster Roll for $25 - soy paper, lobster, avocado, jalapeño, sweet chili sauce, tempura crispies, bacon.  <br><br>Everything was delicious and filling.", "pics": null}}, {"review": {"des": "We came at 5pm on a Monday & there were only a handful of people dining- which I prefer. As we left though, closer to 6:30, it started filling up. Definitely one of those popular spots later in the evening, I think.<br><br>Our waitress was great- super professional and knowledgable. There were a few guys who were constantly filling our water glasses- and that's something we always appreciate & keep an eye on. <br><br>We shared Lumpia- it was very flavorful. Miso soup was good, we ordered the Sunshine sushi roll & it was super fresh with great flavor. We also shared Crazy Rice, which...be warned...is incredibly spicy. Our eyes were watering. I had to take a bite of cucumber & a sip of water after nearly every forkful! Neither of us would order that again, although the meat (chicken, shrimp & lobster) was cooked very well. <br><br>It was also our anniversary and they surprised us with chocolate cake & raspberry sauce. So nice! <br><br>Add a Bud Light & a really tasty Mojito and our meal was complete.<br><br>It was a good experience, I'm not sure we're dying to go back though. But if you haven't been, YOU should go & check it out! Good vibes.", "pics": null}}, {"review": {"des": "This restaurant is always bustling and feels like one of the liveliest places in Chicago at night (reservations strongly recommended). I'm usually not one for Asian fusion, but Sunda knows how to do it right. The uniquely delicious dishes coupled with the vibrant atmosphere and top-notch service make this one of my favorite restaurants in Chicago.<br><br>I've gotten to taste a decent amount of their menu, some good, some decent, and some spectacular. I shall highlight those in the spectacular category:<br>- Brussels sprout salad: savory and a bit sour in what I believe is a soy-based sauce. Divine!<br>- Signature crispy rice with wagyu: the wagyu melts in your mouth with well-seasoned goodness while the rice complements that with its crispiness.<br>- Miso cauliflower: accompanied by some salty chopped chilis. Prime!<br><br>A couple other notes (just pointing out things that may not be expected but that you may not mind):<br>- The spicy edamame is really salty, though that makes it a wonderful dish to munch on while waiting for your other things.<br>- Garlic crab noodles and tiger shrimp tempura and pretty basic/simple.<br>- Baked snow crab handroll is served at room temperature (like sushi). I point this out because I thought it was going to be hot. Still good though!<br><br>There are a million other dishes I want to try so can't wait until the next time I'm back here!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/grTuSBCDCsk6XLLrQVVf2Q/348s.jpg", "caption": "Signature Crispy Rice with Wagyu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5YWCG7wZU3qwaEPvqbnbqQ/168s.jpg", "caption": "Garlic Crab Noodles"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3h6CjF2ufYwro1bjE_H0qw/168s.jpg", "caption": "Baked Snow Crab Handroll"}]}}, {"review": {"des": "One of the best brunch places in Chicago. People are hesitant when I take them here because they don't know what to expect from New Asian brunch, but it's always amazing. Service is great and food is unique and delicious. <br><br>We always do the brunch kit (where they bring a bottle of champagne, fruit, and four juice mixers. I mix very little juice with my champagne and with their juices I get such a strong flavor so they always taste so good without adding too much additional sugar.<br><br>I also ordered gingerbread tea to drink which came with the cutest little honey stirrer and tasted very much like gingerbread.<br><br>Everything on the menu is so enticing and I love that it's meant to be shared because you get to try more. We were a little overambitious with our ordering, but we loved all the food so much that we still ate most of it. I really enjoyed all the dishes we ordered (listed in order of my favorites): potstickers, pork belly and duck steamed buns, crispy brussels sprouts, and Tocino on crispy rice patty.", "pics": null}}, {"review": {"des": "You can never go wrong with getting sushi from this restaurant <br>Great service<br>Lively atmosphere <br>Awesome sushi<br>Great for one person who wants to sit at bar<br>Or groups", "pics": null}}, {"review": {"des": "This was my favorite foodie stop when I was in Chicago! The restaurant is a lot bigger than what it seems from the outside. They have Valet parking outside for $15. We went on a Saturday night without reservations and we were lucky enough to pull a table because every seat in the house was full when we arrived. The ambience is enormous, noisy, and chic. There were several groups but if I were to imagine to bring a first date here it would be extremely hard to have a conversation unless you want yell at each other.<br><br>Food:<br><br>-Miso Soup (3.5/5): The miso soup here wasn't the best but everything else made up for it. It was pretty salty to me but the tofu and the green onions helped.<br><br>-Hamachi Marrow (5/5): Wow! From the breezing scent of the sea, crafting patterns of good omega fats, those handmade drops of exactly-mouthful sushi rice, and when it touches your mouth, it is like melting blended to your tongue, accompanying with the taste of the blue world as such you are swimming with those fish or in this case yellowtail. <br><br>-Unagi Foie (5/5): One word: Tasteful! My fav item. So flavorful.<br><br>-Lobster and Wagyu (3.5/5): I truly expected more from this roll. It was decent not my fav. The aioli they used tasted like wasabi to me and it put an awful taste in my mouth.<br><br>For the most part, majority of the items I ordered tasted outstanding. The sushi was so fresh that it melted in my mouth. My fav item on the menu was the Unagi Foie. I would highly recommend ordering this if you are a big unagi and Foie Gras fan. It only comes in pieces of 2 so I alone ordered 4 pieces! Highly recommend this place.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Gp8K0eUomtUUxl4IkSF3hg/348s.jpg", "caption": "Unagi Foie"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bT4rvn94JqY77jyP6f5tug/168s.jpg", "caption": "Miso Soup"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2oex3QzV-FkMFejE0O-RhA/168s.jpg", "caption": "Lychee Martini"}]}}, {"review": {"des": "Sunda is a solid option especially for group dining. It's served family style and the menu is robust with sooooo many good options. The food comes out as it's ready so it basically feels like an endless supply of food coming out on a conveyor belt. Eventually you just have to tap out and call it quits before your pants bust open!<br><br>My first experience was in the private dining room upstairs for a work event. The bartenders up there were solid and the food was delish! I didn't pick any of it out so I can't recall what it all was other than it was so good I planned another visit a few weeks later.<br><br>This last time I organized my first ladies Thursday Dinnhers club event here. I made an open table reservation easily enough. Unfortunately, I was immediately turned off when I arrived. Two guests were already there... I saw them but still went to check in because the reservation was under my name, I needed to adjust the number of seats and ask a few questions... but the lady just keep interrupting me like two people are over there, come back when the rest of your party arrives. I was like \"Yeah, pause. I see them thanks. I have questions.\" Sheesh. It seemed overly rude for no reason. Then as we were waiting, I realized that other guests were directed to the free coat check while I was there holding all my ish waiting. Maybe an oversight. Maybe not. Service matters to me so... I write about it. Our server at the table, Moises, did a good job. But on to the yummy food...<br><br>spicy edamame<br>calamansi chicken crisps<br>crispy brussel sprouts salad<br>pork belly buns<br>duck buns<br>oxtail pot stickers<br>crazy rice<br>spicy tail of two tunas roll<br>red dragon roll<br>DRINKS! I love that they have a separate whiskey menu too.<br><br>Don't worry about how many people consumed all that food. ;-)<br><br>I get that people comment on the menu prices, which is high indeed, but if you dine family style it's actually very reasonable. We definitely thought they made a mistake on the bill when it came. Including all that food and drinks and tip, we made out quite well!", "pics": null}}, {"review": {"des": "I love Asian flavors so Asian fusion food is right up my alley. <br><br>Tonight was a work dinner with about 20 colleagues. We had a reservation for 6 p.m. and had a private room in the back of the restaurant. It was really nice...private but with windows so you felt like you were still a part of the action. <br><br>Since we were a large group, we did a family-style dinner and throughout the night, they'd bring platters of food. We had everything from sushi, which was phenomenal, to panang curry, filet and mochi. The food was great. The only thing I didn't care for was the fried rice...it was missing the awesome charred flavor. <br><br>The one thing I felt was spotty was service. Lots of empty glasses and at one point I had to get up to ask for wine to be served (and that was after sitting with empty glasses for a long time). I felt like the wait staff was trying to manager our large table and others as well, and maybe that was too much.", "pics": null}}, {"review": {"des": "Dinner weekday night, not very busy. The place is incredibly large and can hold a large party. It definitely a trendy kind of restaurant. Sunda has an extensive pan asian menu. I came here to specifically get sushi. However, I was surprised and intrigued to see Filipino and Thai food too. At the end of day I still wanted sushi, so it's what I went with that night.<br><br>Sunrise Sushi - pretty good and fresh. Wasabi flavor is light and not strong.<br><br>Unagi Nigiri - It was ok, I think it could have been cooked better. Tasted a bit overdone.", "pics": null}}, {"review": {"des": "We've been here several times and always enjoy the food. It's a bit pricy as most of the dishes are small, but if you order 1-2 noodle dishes, you can bring the price down while getting more sustenance. The atmosphere is always busy and loud, but it's lively and has a trendy vibe. <br><br>Here is what we ordered this time, in order of preference<br><br>1. Escolar roll with truffle and a potato chip - this has been our favorite item every time but primarily because we love the truffle taste and it goes really well with this mild white fish. It's a bit pricey at $12 for 2 pieces but worth trying <br>2. Crispy rice with spicy tuna - we thought we ordered a rice dish when we got this but the it turned out to be sushi (see picture attached). It was light with a fun texture from the crispy rice and the jalapeño slice added a nice kick<br>3. Oxtail dumplings - these are a really good cozy appetizer <br>4. Duck fried rice - slightly sweet / tangy rice that I really enjoyed. It's also a pretty large dish, so a great way to get some sustenance!<br>5. Red dragon roll - my fiancé would put this at the top of his ranking and I think a lot of other sushi lovers would too. I don't love sushi, so to me it was good but just normal sushi. According to our severer, this is Sunda's most popular roll <br>6. Lemongrass beef lollipops - good juicy piece of meat but didn't have a ton of flavor. It's served on a stick of lemongrass, so after eating the meat you can suck on the lemongrass a bit for more flavor.<br>7. Seoul wings - these are good, but just relative to the other menu items they're not as impressive. They're very crispy and have a slight sweet taste. The 4 pieces are pretty big, so a good item to order to feel more full when primarily eating sushi!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lBkAq4O1ipuit2FZwzmCmw/348s.jpg", "caption": "Spicy tuna crispy rice - not what we expected but really good"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GIr3Gl4uFbrN72fqLA1N1A/168s.jpg", "caption": "Seoul wings"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VDS4eEsTpZ9lK4a6iRiLVQ/168s.jpg", "caption": "Oxtail dumplings"}]}}, {"review": {"des": "This River North pan-Asian spot is, as you might expect, opulent, bustling, and a little pricey. The cuisine isn't exactly envelope-pushing, but it's very trendy.<br><br>We were seated at a table in a corner by a server prep station (a little awkward, but that's what you get when you arrive an hour before your reservation time). I half-expected the food to be more style than substance, but I was very wrong. My duck fried rice was amazing-- served with a fried egg on top that is chopped and tossed by the server tableside, it was sweet, salty, and rich. Best of all, the \"crispy duck skin\" the menu promised and that all too often is soggy by the time you eat it, was indeed crispy and delicious.<br><br>I'd deduct a half star because the portions for some of my dining partners looked a little small for the price. Girlfriend's chicken arrived sizzling and was pretty good, though her side of some sort of green was a little lacking in flavor. Would come back if I was in the area and felt like a splurge.", "pics": null}}, {"review": {"des": "Sunda is a hip looking place that seems to be pretty popular and for good reason. When I walked in I was immediately greeted and seated in a surprisingly private table in the lounge area with a street view. I definitely preferred this table over the noisy main dining area. <br><br>The service was prompt and helpful in navigating the broad menu. It bugs me when a menu is too big. I feel like it should be halved so the chefs can focus on perfecting those dishes. I would say that the best bite of food I had was the Wagyu Crispy Rice. The flavor from the meat was packed with umami and the rice was the perfect vessel for the meat. My wife had the garlic crab noodles and felt that the crab was great but the dish in general was just ok. The dish portions were somewhat on the small side but I actually prefer it this way.<br><br>Overall I had a good time at Sunda and may make another visit in the future.", "pics": null}}, {"review": {"des": "Checked out Sunda for the first time a couple weeks ago and it was awesome! It was nice enough to sit on the patio so I cant speak much about the atmosphere inside the restaurant, however, I can talk about the awesome service! Our server was so knowledgable and helped us narrow down our 8 options to 4 (it was just my boyfriend and I).  We ordered grass tiger cocktails (10/10 if you like a little spice in your drink) the Brussel sprout salad (100/10), drunken noodles(6/10), and crazy rice (9/10).  You guys.  This brussel salad will have you coming back to Sunda!!! We enjoyed everything we tried but that salad was crazy addicting.  Since our visit to Sunda, I have recommended it to many others including a friend from Florida who was up here for work and brought her whole team! They had nothing but great things to say about their experience.  Can't wait to go back to Sunda!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QCZSraZCnm4w54mwwRclsA/348s.jpg", "caption": "Brussel sprout salad!!! 100/10"}]}}, {"review": {"des": "Ambiance<br>Sunda has a very cool modern Asian look and feel inside.  Lots of long tables and nice bar inside.  This place was packed when we came in.  We sat towards the back as we got a last minute reservation.    <br><br>Food<br>Oxtail pot stickers<br>-Soft meat with just enough crisp to be a pot sticker.  The sauce is not overwhelming.<br>Lemongrass beef lollipops<br>-The lollipops have a good light char to it.  The lemongrass is not overwhelming. The soy glaze is sweet and soft. <br>Pork belly steamed buns<br>-Tasty traditional bun with the pork belly in the middle.  <br>Garlic crab noodles<br>-The sauce is super creamy.  It tastes the the butter is dipped on a crab.  The blue crab is super soft and well added into the dish.<br>Crazy rice<br>-tons of seafood and meat all around inside the rice.  <br>Duck breast kimchi <br>-Soft with a little bit of a gamy taste that is cooked well.  The foie gras has a very strong taste of traditional duck liver with a small middle. I have gotten foie gras at other places where it tastes a lot different.  <br>Strawberry Cobbler<br>-Very good tasting cobbler with a hint of a fruity taste<br><br>Service<br>The customer service was very good the time we were there.  It's Asian food so things came out quick and in a timely matter.", "pics": null}}, {"review": {"des": "Agree with other reviewers - ridiculously pricey for what you get. With the bad service, it's a no-go. Felt like a loud tourist trap restaurant.<br><br>Sunda's service didn't match at all with the price point of the restaurant. The first food to arrive took almost an hour, and by then, we were starving. The appetizers arrived after the entrees, and the curry arrived with a fork. None of us had a spoon; we were given forks and knives, and the curry arrived with a serving fork. When we asked for spoons, the waiter gave our party of 3 just 1 spoon, asking us if we didn't have a spoon. For being told that it's a sharing, family-style dining restaurant, and telling the waiter that we'll be sharing everything, it was a turn-off that they didn't back up their claim. Maybe it was an off night, but it's hard to know whether this level of service is normal or irregular for Sunda because we weren't given an explanation or apology, just asked whether we received our appetizers yet when we'd only seen one item arrive of the various items ordered.<br><br>We ordered:<br><br>Lumpia ($12) - pass, around 9 pieces<br><br>Crispy wagyu ($18) - good, 4 pieces<br><br>Panang chicken ($20 extra $4 for brown rice. Found out on our receipt, had wrongly assumed that rice was included) - pass, so little chicken, 3-4 pieces. The chicken curry was served in a coconut, and while cute, not worth $24. <br><br>Inasal chicken ($28) - pass, cherry tomatoes had more flavor than the juicy, but bland chicken. The chicken skin was inedibly gross, which was a shame.<br><br>Uni nigiri ($15 for 2 pieces, extra $2 for one quail egg) - pass. The quail egg was served next to, not on top of, the uni. Could still see an impression in the uni of where the quail egg was supposed to go. Reflected a lack of respect towards the food.<br><br>\"Ridiculous\" dessert ($14) - enjoyed the caramel sauce. I'm glad our friend seemed to enjoy this too.<br><br>Luckily we had good company so the dinner wasn't a total loss. She's from out of town, and we've been having dinner with her a few times a year for almost 5 years whenever she's in Chicago for conferences. Sunda is the worst restaurant we've taken her to, unfortunately. Several times, she asked us what is up with the service here, which we've never heard from her before at other restaurants. <br><br>As a Chicagoan who's been a regular host to out-of-towners, I would not recommend bringing anyone you care about to Sunda.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XYiqaDgpp3o_WIfzoYuqiw/348s.jpg", "caption": "\"Ridiculous\" ($14) - enjoyed the caramel"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fbzOvBytDYix-D6KfsCyQA/168s.jpg", "caption": "Crispy wagyu ($18) - enjoyed"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/G-JZQsxKxQY3ZfO0jAP5wg/168s.jpg", "caption": "Lumpia ($12) - overpriced, about 9 pieces. Sauce game weak"}]}}, {"review": {"des": "Crispy brussel sprouts salad is flawless! Interior is beautiful and the staff are quick and very knowledgeable.", "pics": null}}, {"review": {"des": "Service was excellent (5/5). Food is below mediocre (2/5). Will come back for drinks, but not food!", "pics": null}}, {"review": {"des": "This if our favorite asian/sushi place in Chicago. We've become regulars here. We away sit at the bar with Nahm (sadly he transferred to the Nashville location). <br><br>We've tried just about everything on the menu. Some of the items we really like are:<br><br>Beef lollipops - these are very unique and tasty. It's steak on a stick with a lemony soy glaze. They're very tender and juicy. You also get a decent amount of them per order.<br><br>Crazy rice - the most expensive fried rice you'll ever eat but probably the best you'll ever have. The rice is thicker than most and its perfectly salted. It comes with a ton of shrimp, lobster and chicken. What bring its all together is the sauce they sauce it in. It's a tangy sauce that goes so well with the spicy sambal. I cringe when I have to pay $28 for this item but then I have a bite and i have zero regrets.<br><br>Gambler Signature sushi roll - VERY VERY SPICY. It's a spicy tuna and shrimp roll with one piece having a ghost pepper in it. Even the pieces without ghost pepper are spicy. We love spice so this is our go to roll but beware this isn't your typical spicy roll it's a much higher level of heat. <br><br>Baked Snow Crab Handroll - this is my husband favorite. It's simple and light. The crab is so tender and soft. The outside crispies are crunchy and light. they don't taste oily or heavy.<br><br>Overall, the service and food here in phenomenal. I definitely recommend checking it out at least once.", "pics": null}}, {"review": {"des": "My coworker brought me here for lunch and everything is very shareable. We started off with the rock shrimp (although I have to say I've had better rock shrimp), 2 pieces of nigiri fatty tuna ($10/piece - hefty price but delicious), pork belly steamed buns (some of the best I've ever had), crispy rice topped with spicy tuna, & a roll (Spicy \"tail of two tunas\" but I didn't love it). Meal was around $130 (we also had 2 espressos and 2 sodas). All in all, will def be back here to try other things on their very vast menu!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Oi-xO4jcr8ypfo0HlniC3Q/348s.jpg", "caption": "menu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dj1k_8E3vIQmbtkVrseyLA/168s.jpg", "caption": "steamed pork belly buns"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hBeXrSl6gpDmtSVIikVDQQ/168s.jpg", "caption": "spicy \"tail of two tunas\""}]}}, {"review": {"des": "Good experience! But nothing special. We got the Brussels sprouts salad, duck buns, and Dan Dan noodles. All were good. I got the mezcal cocktail which was nice but it was $15. Probably won't be back, but it seems like a good group dinner spot.", "pics": null}}, {"review": {"des": "Had brunch here a few weeks ago with my fiancé. Sunda is always a very guilty pleasure as we live in the neighborhood. The food is always presented well, the ambience is always upscale and the portions are big enough that I try not to think about what I'm eating calorie-wise.<br><br>I had the lunch in a Bloody Mary special, which was fun but a little over the top. My only real criticism of the place is that the Tocino Grilled Cheese doesn't live up to the reputation of this place and I'd rethink it a bit. Otherwise, it's all good!", "pics": null}}, {"review": {"des": "Atmosphere: Loud AF. Tons of people, seemed lively, but you had to really use your outside concert voice to talk to people at your table. It was packed. <br><br>Service: Snippy. Frank seemed pressed to move on to the next table. He sounded well versed but damn he was curt if you stopped his recitation of the menu. If you asked him a basic question he always had a condescending answer. I overlooked most of the sassiness (Just because you smiled doesn't mean I didn't pick up on shade) but my husband was not a happy camper watching us eat while he waited 28 minutes for his chicken. He failed to tell us the chicken took that long. So one guests just sat and watched us eat. Frank could've given us a better dinner flow of our plates knowing my husband's gluten free dish was the one that took the longest. Seemed important to him since literally the first thing out of his mouth after have you been here before? If you have ANY food restrictions tell me right now before we begin. Umm, ok. Hi! <br><br>Food: <br>Crispy Wagyu: Very nice bite and flavor. We could've eaten this all night<br><br>Drunken noodles: Noodles were perfect, flavor was good, very filling. Very Chow Fun /Pad See yew -ish. <br><br>Crazy rice: A hot mess. Over cooked (and over priced at $24)and lumped together rice. The meats were dried out yet the rice was soft....I can't even describe but don't do it. <br><br>Crab tuna: It was tuna sashimi with crab inside but the only thing I tasted was wasabi. It was overwhelming. <br><br>Baked snow crab handroll: Frank suggested we upgrade it and make it into maki style for sharing since three of us wanted to try it but it only came with two rolls. When it came out it, it was not modified(Thanks Frank!) I took a bite and the roll fell apart and passed it to the next person who gave me the stink eye. However, it was really good, nice balance of flavors and a satisfying bite. <br><br>According to my receipt we ate other plates but they weren't memorable. All in all the food was either really good or really underwhelming and the service was terrible so to pay $250 was not ideal for us. Hospitality is just not a strength here.", "pics": null}}, {"review": {"des": "so much flavor!!!!! Love this place. The food was amazingly tasty. The proportions are also HUGE. I went with my aunt and uncle and we got the Brussels Sprout salad (most popular app), the Panang Chicken Curry, and the Vegetable Curry. The chicken curry was served in a hollowed out coconut! It was slightly spicy but not too much. <br><br>The only issue I found was that it was very noisy and a little dark. Other than that the service was great!", "pics": null}}, {"review": {"des": "I travel through Chicago a lot and my husband is half Indonesian! Sunda has done an excellent job at taking traditional Southeast Asian food up a notch!<br><br>We LOVED the Brüssel Sprouts Salad, Shihito Peppers, crispy rice with Tuna, and mushroom dumplings! <br><br>The waitress name was Bree and was probably the best Waitress we have had all year! So helpful and enthusiastic!<br><br>It's a little pricey but worth it for a nice night out!", "pics": null}}, {"review": {"des": "Went for Sat brunch with brother and sister-in-law. The Yellow Label Veuve Mimosa Set was fantastic and included an entire bottle of champagne, an d four juices: orange, mango, cranberry, and an interesting grapefruit guava blend. Very good. <br><br>The food:<br>Crispy Brussels Sprouts Salad was enormous and enough for us to share and each have a good sized portion. It was so delicious we seriously considered ordering another one. <br><br>Miso Cauliflower was perhaps my favorite dish. Again, it was large enough to share so that each person had a good amount. Next time, I may order this as my main. The miso and the spices blended to give the cauliflower a rich, sweet and spicy flavor that I wanted to lap from the plate. <br><br>Spicy Tuna on Crispy Rice was quite good. They don't skimp on the tuna topping. Be warned, they add sriracha and jalapeños to the tuna mixture so just avoiding the sliced jalapeño on top won't reduce the heat of this dish. <br><br>Chili Albacore Sashimi dish was fine. I didn't love it, but it wasn't bad either. Next time I'll order the Hamachi Tataki (yellowtail) option instead. <br><br>The restaurant is large and the wait staff attentive. <br>Bathrooms are down stairs, but they do have an elevator should you need to use it. <br><br>Can't wait to go back!", "pics": null}}, {"review": {"des": "Sunda is a great (although) pricey restaurant. A lot of the food on the menu is Asian fusion, particularly Filipino and Japanese. I recommend doing the Theater prefixe menu as you can try many of their popular dishes for a set (discounted price). the oxtail pot stickers and the Brussels sprout salad are my favorite items on the menu. The portions are a bit small so I would suggest 2 dishes per person which does add up.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ygX5bNknZ6W48B4qS-NmnQ/348s.jpg", "caption": "5 Oxtail Potstickers"}]}}, {"review": {"des": "Hands-down the best thing at this restaurant was the Pancit Canton. The crispy pork belly and shrimp with egg noodles were so flavorful. <br><br>The rest of the meal was good, not great. The sushi wasn't anything different from any other sushi restaurant I've been too. More expensive but not better. And trust me when I say I visit a lot of sushi restaurants. It's a mainstay in our date night staple, and then some. <br><br>Someone at our table ordered the Grilled Salmon Be to Box and it was so spicy they couldn't eat it. The menu said nothing about spice. We asked the server and she said that was the sauce used typically. It did have a kick, especially in the back end. <br><br>The Baked Snow Crab hand roll came out looking like a very ordinary roll but cut into two pieces, not what we were expecting. It wasn't exciting like the server mentioned. The Spicy Kraken wasn't very spicy and I was disappointed in the flavors that didn't pull through, especially the seafood. The Poke Bowl wasn't any different than the typical Poke Bowl you get at any other restaurant. It's something you could've gotten from any local Poke Bowl place. <br><br>All in all the food was ok, not great. Definitely not worth the $150 we were charged for lunch. And let's be clear. I never have a problem paying for good/great food. Some people collect clothes, purses, Knick knacks, etc. I go out to eat. And Sunda was very disappointing.", "pics": null}}, {"review": {"des": "Good vibes. Came in on a Saturday night. Our food was good.  Our server was on the slow side and I could tell that she really didn't love her job...very unfortunate:(   I think having a friendlier server would have changed out dinning experience.<br><br>We did enjoyed our dinner and our drinks (gin & tonics) were just ok.<br><br>Nice atmosphere in the dining area. <br><br>Their bathrooms were clean however they are not conveniently located near the dinning area and actually requires you to concentrate as the stairwell was dark, narrow and about 10 steep stairs down.  Lots of young ladies taking selfies??? Have not really seen that before?? In the bathroom?? Very odd.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kFRfXib-6b0hB6WtyQvvPg/168s.jpg", "caption": "Chicken Pad Thai"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uRxj09unjq1i3Qcqefj6Kg/168s.jpg", "caption": "Chicken Panang"}]}}, {"review": {"des": "Recently, went here at Sunda an Asian fusion restaurant. Good food, especially the Seoul wings and tempura shrimp. Glad to have this place around!", "pics": null}}, {"review": {"des": "Four years after first trying Sunda and it's still the gold standard of delicious food in River North. <br><br>We loved nearly everything on the menu. Service was efficient and we had plenty of small plates to share. The rolls were better than even I anticipated. Great fresh seafood, well prepared.<br><br>If you're in the area, don't hesitate to book here.", "pics": null}}, {"review": {"des": "Oily, oily, oily. Come here if you're a keto fan and need some more fat in your diet.<br><br>I have both dined in and ordered delivery. Overall, the food is fine, but just not great.<br><br>Brussels Sprout Salad: 4 stars. Everything had one texture: wilted and soggy. But the flavor was wonderful, and I personally think it's even better without the dressing. If you're a Brussels sprouts fan, you're likely to enjoy this dish.<br><br>Lemongrass Beef Lollipop: 3 stars. The idea is fun, but the execution was not great. Dry, overdone slices of New York strip wrapped around a stick of lemongrass, which does little to impart flavor. These also came out lukewarm, which was a disappointment.<br><br>Drunken Noodles: 2 stars. No better than what you could get at any cheap Thai place... in fact, probably worse. <br><br>Garlic Crab Noodles: 1.5 stars. Really not appetizing at all. The crab had that un-fresh, pungent smell to it, the noodles were overcooked, and the dish needed far more garlic to impart some sense of flavor other than old crab.", "pics": null}}, {"review": {"des": "I absolutely LOVE Sunda. <br><br>I'd been wanting to come here for years, and it did not disappoint! While their gluten free menu certainly isn't as big as places like PF Chang's, I was happily surprised by the amount of options. Although fair warning: the majority was some sort of sushi or fish. I ended up ordering the chicken pad thai, and it was easily the best pad thai I've found in the city! And the portion sizes were huge -- I had to take more than half of it home, making the $17 price tag well worth it. <br><br>The restaurant itself is modern and markedly upscale, and with great service and great food, I'm honestly convinced that Sunda is the best Asian restaurant around.", "pics": null}}, {"review": {"des": "Been here 6 times in total. Three times for lunch, twice for dinner, once during restaurant week.<br><br>Their lunch is a fairly decent value but there are much better options around town. Topolobampo's Topolo in 60, Katana's lunch sets, or even spots like Xoco for a quick bite.<br><br>The food here is interesting but the menu is far too large to be done well. The moriawase (I do appreciate that they call it a moriawase, as I know some places around town would falsely describe it as an omakase to drive up the prices) was somewhat uninspired and the quality of the fish to be quite contrasting, with the two times that I've tried.<br><br>On the other hand, Escolar+Potato Chip+Shaved truffle has become something I started to love after first discovering it here. I've never had something like this before and its a delicious marriage of textures, fattiness, and flavour to an other mild dish.<br><br>An average lunch, some very middling sashimi, but at least one dish I would call amazing and has changed the way I do sushi at home.", "pics": null}}, {"review": {"des": "The food was good, but not great for the price. The wagyu bites were good, but the rice was a bit thick for the slice of meat. My favorite was probably the escolar and the crispy brussels. The escolar was melt in your mouth buttah! The brussels has a delicious lime-nuoc mum (fish sauce) dressing! Although- the uni was delicious and great presentation, but uni is my fav so I'm being biased!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uqYfX6aDrmjyz8Y2CxQ4_w/168s.jpg", "caption": "Uni!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/v1IsLPWOWKzpr98I0q_TZg/168s.jpg", "caption": "Escolar (bottom left), wagyu bites (right), crispy Brussels (top)"}]}}, {"review": {"des": "this place is amazing! If you're ever in Chicago, try this place out.<br>the crispy Brussels sprouts salad was probably my favorite thing here and I still think about it.", "pics": null}}, {"review": {"des": "TL;DR They must be focusing on their Nashville location, because service is declining. Food is on point if not smaller portions than before. I privately emailed them (below) with my concerns and was ignored, NO response. :(<br><br>Hello,<br>Last night I decided to take my husband out for his birthday with his brother and parents. My husband and I have been here twice before and had wonderful experiences. We've had excellent food and the servers seems to really know and enjoy the menu. They had made our experience at your restaurant special. <br><br>I assumed that this experience was going to be the same. It was unfortunately very far from that, and if it was our first experience here, we wouldn't have returned.  When the waitress came to our table she didn't explain the menu (My husband and I are the only ones who have been here, and even we had questions, and during our experiences the first two times, the waitress would talk about the food). I don't know if she just didn't know the menu or if she didn't think we were worth the time. She didn't explain the specials, I saw a special menu under the drink menu, but she never talked about them. She also didn't talk about the drinks, we felt rushed to order those.<br><br>My husband asked her what she thought of two menu options, and which one she recommended. She was kind of rude to him, asking why he would want to eat soup on a hot day, and explaining neither of the menu items to him.<br><br>My husband's brother has peanut allergies. She said she would go get information for him. She never did, just told him to not eat fried things, that things were fried in almond flour. She didn't help him figure out the menu. He had to play a guessing game with her, asking if he could eat something and her telling him yes or no. He felt lost, and than she said she had to leave and document his allergy. We thought was going to help him out with the menu, but never came back except to take our final order and telling us that there is a gluten and vegan menu. That  there's nothing for people with peanut allergies. I could tell my brother in law was upset and that he felt rather embarrassed about having an allergy he can't control.<br><br>We finally ordered our food. We felt rushed to pick between two sushi rolls, and the waitress didn't offer any tips or knowledge of the food (she didn't seem to know the menu). We had ordered Sunda Moriawase Sushi. Instead we were given Sashimi. We told her that we had wanted the sushi, she told us that we get more with the Sashimi anyway. We felt bad wasting and sending the food back, so we kept it. After we made that decision, she asked us at least 5 times while we were starting to eat if my husband wanted to change it out. We were very patient, but that was incredibly irritating. <br><br>At the end of our meal, she did bring out a bunch of desserts for my husband's birthday which was nice.<br><br>We still aren't happy with how our service was. How my husband's family was treated when trying to choose food. It's hard sometimes going to a new restaurant when you don't know the food and someone doesn't want to take the time to help you out. We also weren't at all happy with how the peanut allergy situation was handled. <br><br>I'm not sure if we will come back. What separated this restaurant from a lot of other asian restaurants was the care in which the food was served. Now it doesn't seem worth the price tag, and it doesn't seem like somewhere I would want to take family.", "pics": null}}, {"review": {"des": "One of my favorite restaurants in Chicago. This is a great place to take friends because the menu is large. There is something for everyone. I've been here quite a few times and my favorites include: <br><br>Crispy Brussels sprouts salad<br>Drunken Noodles<br>Crispy Rice with Tuna<br><br>Not impressed with most of the sushi- sorry.", "pics": null}}, {"review": {"des": "Came here on a Friday night. Would highly recommend crispy Brussels sprouts- it was gone before I got a chance to take a picture. We also got duck bun, pork belly, cauliflower and rainbow roll. They are all decent- above average. Exceptional ambience, great wait staff- except they took away our plates while there are still plenty of food left without asking.", "pics": null}}, {"review": {"des": "I wish we had the dinner menu, but unfortunately we came during a weird time, so instead we got the happy hour menu (3p-6p M-F) . Although the dinner menu is obviously much bigger, the happy menu wasn't too bad and the sushi was really good! Service was great as well! <br><br>Spicy \"Tail of Two Tunas\" ($13)- 5/5 This was our first dish and it really blew me away because of how soft/fresh the yellowfin tuna tasted- the fish had the 'melt in your mouth' feel. Also enjoyed the fried shallots that added texture and deliciousness to the sushi. <br><br>Red Dragon ($19)-3.5/5 This was pretty good as well, but one of the least memorable and most expensive. I'm not crazy about shrimp tempura in sushi, because it's not as flavorful as fish. This does contain spicy tuna and shrimp tempura. But there was probably too much fried stuff (tempura crispies & shrimp tempura) going on. <br><br>Yuzu Escolar ($14)- 4/5 Fish was soft and had also had that 'melt in your mouth' kinda feel to it. Definitely can taste the yuzu so it's citrusy. If you're looking for a little different/unique sushi, this would be the one to try. <br><br>Truffled Mushrooms ($15)- 3/5 Forgot that this was a sushi, but it was alright. Mushroom or any veggie sushi is meh to me. Definitely not bad, but a healthier/vegetarian option, so I don't mind.", "pics": null}}, {"review": {"des": "Such great vegan options for a non-vegan restaurant! Came with my non-vegan family and they loved everything they got, and I loved everything I got. Such a win win! I ordered the Sweet Potato Caterpillar, Miso Cauliflower, and Shiitake Edamame Dumplings, all phenomenal! Definitely want to come back and try other vegan options soon", "pics": null}}, {"review": {"des": "I have been to and reviewed the Sunda that recently opened in Nashville and was super excited to try the established Sunda here in Chicago. We went for an event during Filipino history month, so we celebrated with a Kamayan feast. They laid out what had to be a 15 yard banana leaf on an extremely long table and slowly built on top of it. They started out with a bed of rice along the entire thing. Next they added some large garlic shrimp with some colorful cauliflower and greens. They followed it up with some longanisa sausage that was possibly my favorite thing. Next they added some grilled chicken skewers and squid. In addition, they placed a fish with the head still attached. They continued the feast with some baked crab in the shell. Next came the barbecue chicken skewers, and at this point, we thought they had to be close to finishing...they weren't. They added mango and spring rolls that were SO fresh and delicious. On top of that they added a crispy pork and fried snapper. The next addition to the feast was dragonfruit and chili peppers. Finally, it was time to feast. Three friends and I tried to grab one of everything in between the three of us. Everything was so cultural and something I hadn't really tried in a similar scenario before--some stuff I enjoyed, others were interesting flavors or really fatty. Overall, I thoroughly enjoyed the experience!", "pics": null}}, {"review": {"des": "Nice place, cool decor, great service, the food was okay but I've expected something more sophisticated when it comes to a fusion rest. In addition the acoustic is  horrible. It is so loud inside that you cannot here yourself talking. The good thing is that they have a really nice gluten free menu.", "pics": null}}, {"review": {"des": "Came here for a small work event hosted in a private room upstairs. We showed up 5 minutes before our reservation at 6pm on a weekday and were told that we would have to wait until 6pm to be seated. She suggested that we wait at the bar and order drinks, so we went there in the meantime. A minute later, we noticed someone else from our party being led upstairs. When we went back to the hostess to confirm that our table was ready, she informed us that we would have to wait until our drinks were made and we'd closed out the bill at the bar before heading up. Seems like an inefficient system, and it would have saved everyone a lot more effort if we were just told to wait a minute at the front or if they allowed us to pay the bill with our dinner (since it was all on one check). <br><br>Anyway, the private room we were in upstairs was quite nice. There were a couple of hightop tables for chatting before moving to the round table for dinner (there were 10 of us). The room also had its own little bar and waitress for our party. Our waitress was super nice and attentive. Our menu was already determined, and our food was brought out to be shared family style. I think they put down 2 of every plate on our little prix fixe menu. <br><br>First off: the sushi. We got the Spicy \"Tail of Two Tunas\" ($18), the Sweet Potato Caterpillar ($16), and the Rainbow ($22). I enjoyed the sushi, but I don't think it's worth the prices.<br><br>For starters: The Asian Pear Salad ($15) was really good. The dressing was supposed to be a tofu vinaigrette, but I'm pretty surprised...all I tasted was sweet. But I love salads, so I was happy. I thought the price was ok given my willingness to pay for a salad and the large portion size. The Lemongrass Beef Lollipops ($19) were so mediocre. I heard that this is supposed to be one of their specialties but it was just tough, flavorless thin slices of beef wrapped around a stick of lemongrass. There was barely any lemongrass flavor, and the sweet soy glaze didn't help salvage the overcooked beef. I can't believe the meat was sliced new york strip steak. <br><br>For mains: The filet mignon was good, but not what you'd expect from the words filet mignon. It was served as stir fried chunks of beef. Not at all worth $40 in my opinion. If I'm spending that much money on filet mignon, I expect it to be a proper steak. Tiger shrimp tempura ($18) was pretty good. The sweetness kinda got to me halfway through, but the first few bites were enjoyable. Chicken Inasal ($28) was okay. Chicken was cooked well, but this dish was nothing special. Drunken Noodles ($22) tasted like the lo mein that you get from your local Chinese restaurant. Make of that what you will.<br><br>Dessert was mochi ice cream, which was surprisingly good. They brought out an array with coconut, green tea, chocolate, and one other that I forget (some sort of fruit). It wasn't too sweet, and the mochi was nice and chewy.<br><br>Overall, I would not come back with friends/on my own. However, I would consider Sunda again for a work event or a private dinner.", "pics": null}}, {"review": {"des": "This place would have received 5 stars from me, but I'll tell you why in just a bit.<br><br>When my husband and I arrived, we were seated right away. They brought us all the way to the back hidden in the corner so we got perfect view of the whole restaurant. <br><br>When we ordered, our waiter said it was a strong start because we ordered a lot of food. When our first two arrived, our waiter Nolan asked if we needed anything else. My husband told him that we were waiting for all our food to come out. Our waiter had looked confused because he only put in 3 out of 10 dishes. So we had to wait about 20 more minutes for the rest of our food to come out while the ones we had got cold. - 1 Star. We saw this manager come out holding a plate of corn. He saw some buddies he knew 3 tables down and started to talk to them. After about 15 minutes with the manager just standing there holding he corn, one of the food runners took it from the manager and brought it to our table. Wtf? <br><br>We ordered a whole bunch of stuff.<br><br>Food: <br><br>Oxtail Dumplings<br>Pancit Canton- Way too many vegetables! <br>Pad Thai<br>Street Corn<br>Pork Belly Adobo<br>Crazy Fried Rice- If you like spicy, you would like this!<br>Korean Fried Chicken-Best thing on the menu! <br>Beef Lollipops<br>Mochi Sampler<br>Coconut Cheesecake-Best cheesecake ever!<br><br>Everything we got was flavorful and delicious. The pork belly adobo wasn't really adobo, but its ok, it was still good. (I'm Filipina so I know authentic adobo).<br><br>-1 Star for another manager who ran into a friend The was right in front of us. This couple was having dinner so when the lady went to the bathroom, the manager took a seat and started showing his buddy naked pictures on his phone. I spoke up and said, can you look at that elsewhere. The manager looked at me and continued with his perverted self. <br><br>I didn't appreciate that one bit and I did take a photo of that manager. <br><br>Both managers bugged me. But the food was good and I I would definitely dine there again.", "pics": null}}, {"review": {"des": "Took 28 mins after reservation time to be seated, which was extremely disappointing. Kind of kills the buzz of coming to a very nice place for dinner. What's the point of making a reservation at this restaurant if they can't figure out a way to optimize reservations so that you're not waiting nearly 30 minutes?<br><br>Moving on to food. The appetizers we got were pretty solid. The cauliflower miso style was great as well. The dumplings were well made. <br><br>Then we got one of the curries, which was extremely disappointing! It was over spiced with things that didn't exactly blend well. The resulting taste made it unfortunately one of the most disappointing curries I have ever had. <br><br>I wouldn't come back given the overall experience.", "pics": null}}, {"review": {"des": "Sunda delivers bite upon bite of deliciousness.<br><br>Without knowing too much about the place ahead of time, my partner and I came here early on a Saturday night. We did not have reservations but we were able to get seating for 2 at the sushi bar. The seating area is pretty large and spacious. The decor inside is very sleek and interesting with many pieces that catches your attention.<br><br>Dishes ranked below from my favorite to something worth trying but I may not order again on a second visit:<br><br>Wagyu Signature Crispy Rice: the one bite of meat and rice is amazing; the meat is soft and tender, and the sauce really gives it all a nice flavor<br><br>Oxtail Potstickers: the oxtail dumpling are cooked to perfection; the sauce that is drizzled over the dumplings gives a nice savory flavor<br><br>Braised Pork Belly: tender, flavorful and abundant; it is a LOT of meat braised in a delicious adobo sauce; it can get a bit repetitive if you're only sharing this dish b/w 2 people, though it is a good dish round off a decent meal after many little bites<br><br>Hamachi Marrow: good but not my favorite; definitely interesting and good taste of the smokiness; I wish there was either more pieces or had a bolder flavor<br><br>I really did enjoy the food at Sunda. The bites of food were delicious. It is hard since the bites just leave wanting more. My biggest gripe is that price and quality doesn't always quite equate to what you get on the plate. For example, the Hamachi Marrow is just 2 small nigiri pieces that were okay but it is priced similar to the Wagyu Crispy Rice, which had twice as many bites and was more distinct in flavor and delicious. I definitely do want to come back here but I'd do some research ahead of time as to which dishes are really worth getting.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LJpPxgjJYh8W7-0nhJ44_Q/348s.jpg", "caption": "Delicious oxtail pot stickers."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-Y9eI1A8i_gnSo_Gw0k2tw/168s.jpg", "caption": "Braised pork belly."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AokTOMyoHsI3hPFoSXkwdA/168s.jpg", "caption": "Amazing Wagyu signature crispy rice!"}]}}, {"review": {"des": "Took me 20 minutes to find this place (an HOUR PRIOR to deciding to go here!). I wanted something light since it was late. So what better than sushi? This place was only a few blocks from the hotel but took me forever! Everywhere was packed, and this place was not excluded. I got seated right away at the bar. My server was super attentive, very helpful in finding what i wanted to have. He asked if i had any allergens, and what was i interested in that night. I got some really good suggestions. Everything came out delicious and quick. I was in and out of there pretty quick. It was a loud setting, but don't let it discourage you from trying it.", "pics": null}}, {"review": {"des": "a-ok as far as asian fusion goes. my biggest gripe is always: why must asian fusion be so expensive?! maybe i shouldn't benchmark to asian food..<br><br>anyways on to the food. there was a mix of good and bad among the items we got (you can see pictures and descriptors below).<br><br>hits: miso black cod, garlic crab noodles, and my \"ghost in the shell\" cocktail.<br>misses: steamed buns (not enough sauce to hold all the ingredients together and give it sufficient flavor), \"ridiculous\" dessert (wayyy too saccharine)<br>just ok's (aka nothing to write home about): kraken roll, crispy rice with tuna, crispy banana dessert<br><br>honestly if i was dining alone and just had my cocktail and the miso black cod, i would be so happy. but packaged together with everything else, i was left feeling like the entire meal was just.. ok.<br><br>also is it just me, or does it feel like asian fusion tries too hard to be different from its asian or contemporary american roots? <br><br>at least service was fine and food came out relatively quickly, though not necessarily appetizers first before larger plates.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eo7kkEdlyYFbj80YjapcCw/348s.jpg", "caption": "crispy banana dessert"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9lFrdGZITIlRXItuJE-fbA/168s.jpg", "caption": "\"ridiculous\" dessert"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/24FhbQBO4MqRQ2pENmH4ig/168s.jpg", "caption": "garlic crab noodles"}]}}, {"review": {"des": "Amazing Asian Fusion Restaurant! Totally recommended. I'm a huge fan of Pad Thai and now this is my favorite.<br><br>For appetizers, we ordered Edamame and Miso Soup, both great. For main course, we had Red Dragon Sushi Roll (good), Chicken Pad Thai (amazing), and Asian hot Chicken Wings (amazing).", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gLhm8fysE96GH8C-2CUwkA/348s.jpg", "caption": "Pork Wings"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ydVbCMnoUZ2r3V7lo9iweA/168s.jpg", "caption": "Miso Soup and Edamame"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sdIDjz6nCDMo9z_yk0E3Bg/168s.jpg", "caption": "Red Dragon Roll"}]}}, {"review": {"des": "Had an incredible dining experience here. From our wonderful server to the extensive sale and wine list to the delicious food. This restaurant is usually packed and for very good reasons! It can get pretty loud in there from the crowd and the music that is playing, but overall, we had a fantastic time!<br><br>We ordered the Crispy Brussel Sprouts Salad, Pork Belly Skewers, Wagyu Crispy Rice, Sunrise Roll, and the Valentine's Day special-Seoul Roll!<br><br>The Crispy Brussel Sprouts Salad was absolutely delicious! The taste of the roasted shredded Brussel Sprouts with the more acidic dressing made each bite heavenly. The combination of flavors and textures cannot be paralleled! (Must Get)<br><br>The Pork Belly Skewers are perfect for sharing! The flavors were familiar and reminded me of something my mother would make, which leads to the authenticity of the dish. The mix of lean and fatty pork Belly chunks were delicious! The cabbage slaw on the side was dressed with a tangy and light dressing which helped to cut through the savory tastes.<br><br>The Wagyu Crispy Rice was mind blowing. This was our first Wagyu experience and we couldn't have been more happy with it. The Crispy Rice underneath was sweet, some what creamy with the torched crunch on top. The Wagyu was out of this world. The tenderness of the meat along with its preparation was great! <br><br>The Sunrise Roll was fresh, creamy, light, and delicious! We could taste each ingredient used in and on the roll with each bite. Nothing was overwhelming or over powering over the other components! <br><br>The Seoul Roll, a Valentine's Day 2018, special, was more savory. The marinade on the bulgogi style Wagyu meat was very flavorful. The pickled radish inside the Roll gave a delightful crunch to each bite and really complimented the dressing of the Roll!", "pics": null}}, {"review": {"des": "Yummy shared foods and fantastic service is the way to go at Sunda. Try the calamansi chicken; it's cracklin' good. The tempura shrimp w/walnuts and the noodle crab dishes will not disappoint. The oxtail pot stickers was not too bad. And the pork belly adobo will steal the show.  You'll enjoy the freshly made to order jasmine tea. Hmmmgood! Be careful of the gambler (sushi).  There is one that will have the ghost pepper in the sauce. It's a fun and thrilling game of who's mouth will set on fire.<br><br>Our server Frank and the rest of the Sunda team were on point and didn't miss a beat. <br><br>A nice and special treat on a lovely summer evening.", "pics": null}}, {"review": {"des": "My review is very late but I came here for my birthday in March, better late than never writing a review. <br><br>Let me just tell you about the waitress/waiters, they are absolutely the nicest people I have ever met. Everyone who works here was so kind and sweet, definitely know how to treat their customers to come back lol The interior of this restaurant is beautiful and the restaurant itself is pretty spacious. <br><br>What we ordered: <br>-2 drinks (Strawberry Martini and Sapporo on draft) the strawberry martini was absolutely delicious and not too strong which was perfect.<br>-1 Gambler Sushi. (There are 6 sushi pieces and 1 of the 6 has a ghost pepper. It also comes with a poker chip for a free chef dessert for your next visit which I thought was thoughtful. Delicious beside the ghost pepper which was amazingly spicy but the waitress/waiter would get you a glass of milk if you like)<br>-Signature Spicy Tuna (not your typical spicy tuna sushi you get at a sushi restaurant. Delicious)<br>-Pad Thai (not that great)<br><br>Definitely, a restaurant to try. Will be coming back.", "pics": null}}, {"review": {"des": "Sunda is so nice inside! It feels very chic and is spread out perfectly. I LOVE their shishito peppers- an absolute MUST. I also loved that when I told our waitress it was my moms birthday, they brought out a complimentary dessert! Sunda's a great restaurant with great presentation and great food!", "pics": null}}, {"review": {"des": "Went to Sunda to celebrate my Sister in-laws Birthday. The ambience was amazing z this place is super popular and have to make reservations in advance. They have a Vegan menu and had verity of selections. We ended up ordering street corn, garden sushi rolls, fried rice and vegetable curry. We loved all the items except the vegetable curry (bit disappointing). We would definitely go again to try other items in the menu. Ohh and they got us cake on the house for the birthday. <br><br>Service was great.", "pics": null}}, {"review": {"des": "The brussel sprouts salad has me dreaming about it still!!!<br><br>I'm a fan of brussel sprouts and roast them all the time. This salad knocks every brussel sprout dish I've ever had, out of the park. We ordered one to share for our group of 4, and I had to order another one just for myself cause I didn't want to share. <br><br>Everything else was great especially the service.", "pics": null}}, {"review": {"des": "INCREDIBLE!<br>My colleagues and I came here for a celebratory dinner and it was the best choice for the large party we had. Because of the large party, we opted for the Prix Fixe menu that included family style options for 4 different sushi rolls, 2 different salads, 3 different entrees and 2 desserts.<br><br>The sushi rolls were out of this world. My personal favorite was the one with two different tuna's on it. I don't think I have ever had such a fresh experience before. I know people are normally very hungry in the beginning, but we made these all disappear almost immediately.<br><br>To follow were the salads. My personal favorite was the one with noodles and had a lemongrass dressing (I'm really helpful with remembering the names, I know). But zamn...super good.<br><br>Next up were the entrees. The filet mignon (which I'm not usually a fan of) did not disappoint! Oh my gosh I could have skipped chewing if I wanted to (which I wanted to skip chewing but my colleagues were around me). They also brought out a chicken curry that was pretty spicy but welcomed me to Flavortown, haha. Lastly, they offered a Miso Salmon. I unfortunately did not try it, but I brought leftovers home and my roommate loved it.<br><br>I can't wait to go back, and honestly, eat the same things all over again. Except this time, I won't be sharing.", "pics": null}}, {"review": {"des": "Ate here for my birthday and it was Fantastic! They event brought me out a little cupcake. Very pleased", "pics": null}}, {"review": {"des": "We always bring our out of town friends here and this place never lets us down! Big Apple friend still dreamzzz.... about the brussel sprouts salad ;)<br><br>Reservation - Must<br>Great for vegetarians and non alike", "pics": null}}, {"review": {"des": "Been here twice now and for me the food is just average! Fabulous setting and good atmosphere. Staff lean toward the snooty side and we felt rushed on both occasions here.<br><br>Brussel sprouts to begin with which are delicious. Pork belly was greasy and not so good. My wife did not really enjoy her noodles with crab which were extremely greasy. The glass of merlot was good as was the warm sake. For me this place is more hype than substance, sorry to say!", "pics": null}}, {"review": {"des": "A favorite of all. Kinda has the \"fusion thing\" going on- but done well!! The oxtail potstickers, lumpia, and sushi were all hits. <br><br>The tables felt tight and unfortunately our stay was cut short due to a very loud party seated next to us half-way through our dinner (seemed to have celebrated prior to arriving at Sunda). Certainly not the restaurant's fault but forced us to leave sooner than desired", "pics": null}}, {"review": {"des": "Absolutely amazing food. I've been here twice and I was blown away both times. Fair warning- it's not cheap, but it is worth it. A couple dishes deserve a shoutout: Brussels sprouts salad- I don't even like Brussels sprouts but this dish was superb. Pork belly buns are stellar. Tuna truffle pizza, great white and the rice with wagyu are some of the best dishes I've ever tasted. The decor is sleek and warm and the servers are great. I just went last night and honestly it was the best meal I've had in years. Highly recommend. One of my favorite restaurants of all time.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bhDLqtMbyvMJTXQjKh8O4A/348s.jpg", "caption": "Tuna Truffle Pizza"}]}}, {"review": {"des": "Oh Sunda how I love you!! I'd give more than a 5-stars rating if I could... everything from the swanky vibe to the energy of the room makes for the start of a fabulous dining experience. <br><br>The menu is Asian-Fusion culinary cuisine and everything is intended to share so have no shame in ordering up a few plates.... seriously, everything is FOODGASMIC!! Go hungry and open minded.<br><br>Our waiter was extremely professional and attentive the entire time offering up his favorite and most popular recommendations, ensured our water and drink glasses stayed full, and knew just the right pace to bring out our food without overloading our table (a pet peeve of mine) or letting empty plates sit. One of the recommended dishes was the sweet corn cobs and it's really not something I would have ordered, especially at an Asian-Fusion restaurant but oh my goodness!! DO IT!!! It was sweet, spicy and teased my tastebuds with a coconut cream drizzle that's to die for. <br><br>And then there's the edamame which again sounds like no big deal but WOW!! The seasonings used put it at the top of any edamame list bar none!<br><br>The lamb lollipops were insanely flavorful and we actually ordered two of them after the first plate disappeared too quickly they were sooo so good. <br><br>Our waiter encouraged us to enjoy a veggie dish to offset the other plates so we got the steamed vegetable soup dumplings which tasted like won ton soup. A little messy but worth it! <br><br>We also had a caterpillar role which I failed to take a picture of in my state of foodie happy-camp, but I can assure you the presentation was beautiful and the sushi quality was so good it almost melted in my mouth sans sticky rice.<br><br>As a more traditional selection, we opted for steamed pork buns. They were a level up (maybe two) from any pork bun I've ever had and were the perfect balance of sweet and savory.<br><br>If there's anything negative to say, it's that most items came as 5 to an order so it was a constant topic of who was going to eating the last one lol.<br><br>I'm already thinking about the many things we didn't order that went passing by us to other tables. Definitely coming back sooner than not boo thang:)", "pics": null}}, {"review": {"des": "I normally write Cons before Pros. So please do scroll through the review.  <br><br>Cons - <br>Very dim light. You can barely see your food that's on the table. I guess this is necessary for the ambience they created. <br><br>Pros - <br>Extremely nice ambience. Drinks were fantastic and so was the desert. Our server was very knowledgeable of the food and the other details. This was extremely helpful as we are vegetarians. <br><br>I'd definitely visit this place again but only for drinks and desert. Probably for a date night. I wouldn't recommend this place for vegetarians.", "pics": null}}, {"review": {"des": "I can't wait to go back the next time I'm in Chicago!  My group and I were slightly skeptical that this place may be a tourist trap but the food definitely delivered.  I didn't expect much from the brussel sprout salad but wow!  It stole the show and may have been the best dish of the table.  Crazy rice was also quite memorable and had just the right amount of kick. Spicy Kraken roll was yummy and definitely spicier than the crazy rice (not for those who can't handle the heat).  <br><br>VERY busy place so high recommend that you make reservations weeks in advance.  You won't regret it.", "pics": null}}, {"review": {"des": "One of my favorite restaurants in River North and we keep going back there!<br><br>I love most of their appetizers, especially recommend spring rolls and duck bun and pork belly bun.<br><br>The most recent time we got crazy fried rice and seabass. They both exceed expectations! The crazy fried rice comes with a variety of protein but magically mixed so well together to create an interesting flavor. The seabass is extremely fresh and tender and served with sliced eggplants. <br><br>Most of their sushi and rolls are also of good quality!", "pics": null}}, {"review": {"des": "Sunday night at Sunda would expect it to be a touch quiet but the place was bustling and guess that is a large part of the vibe at this super trendy upscale Asian restaurant - even as we were leaving at 9:30 people were walking in.  Sunda is dark and Sunda is loud and it is packed with all the gen X, Y, Z's and if you aren't good with those elements don't go.  If you are looking for inventive Asian cuisine you have found your Nirvana (the place not the band) even if the place will put a dent in the credit card.  So walked in and promptly seated and began to peruse the drink menu - so many choices - I went with Kirin on draft but ended up very jelly of the Glass Tiger with a serious bite of jalapeno gin and mints - great cocktail - the Mai Tai was also top notch and I think one put my wife on her back side.  We listen to our waiter (who was excellent) and treated the menu like tapas and order a bunch for the table - probably over ordered would be the word but I don't get to Chicago that often so away we went.  Will try and keep this as brief as possible:  first up the Oxtail Pot stickers - oh so thin noodles surrounding the shredded meat along with caramelized onions and a white wasabi cream - could have eaten two more orders (this would be a theme) and there was a negotiation over the final piece.  Second was more meat-centric - the Pork Belly Skewers - these were missing the layer of fat that defines pork belly but contained all the smokey goodness - combined with the slaw it was like a mini barbecue in downtown Chicago.  Next we dove into the sushi with two of their specialty rolls - the Tail of Two Tuna was very good but was overshadowed by the Lobster and Waygu - a sushi take on surf and turf was a taste explosion with the thin slice of Waygu combining with a creamy lobster filling - just a great roll.  Now we should have been slowing down - but not so much - bring on the Crispy Rice with Waygu (yep more Waygu) -- if there is a must order at Sunda I would guess the Crispy Rice is the one and topped with a strip of buttery Waygu with just a bit of sambal was fantastic - but only four pieces - need so many more pieces.  And we would have if we had not order the Tiger Shrimp Tempura (previously Rock Shrimp) - expected an Asian fried shrimp dish but got a bowl of flash fried not breaded shrimp in another creamy honey aloi with candied nuts - so ridiculously good - this must be the signature dish of Sunda (or the Crispy Rich).  Or maybe the signature dish is the Crazy Rice with  lobster, chicken, tiger shrimp, fried egg, shrimp sauce,<br>kecap manis, cucumber, sambal - so much going on here but so flippin' awesome - definitely the signature dish at Sunda - except - the Drunken Noodles - not really - they were good and my wife loved them but to me the least of a serious of great food.", "pics": null}}, {"review": {"des": "I came here for a team event with about 40 people, so we enjoyed the private dining room on the upper level.  We had a pre-selected menu that covered a few options of sushi, side dishes and dessert. The things that we had were not necessarily the ones I would have ordered if I was able to pick from the menu myself, but I was pleased with the selection and enjoyed what we had available. I don't eat sushi, so I tried the lemongrass beef, Pad Thai, and a really tender chicken (I can't remember the name of it).  We also had excellent service and timely delivery of each course for our large group. When we left, the main dining room was PACKED, so it definitely seems like a go-to spot that you should check out.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gYy2norA8WB7Zozbseo_SQ/168s.jpg", "caption": "Sushi bar"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/k_Ihjz05BSddruXV2lUzwg/168s.jpg", "caption": "Main dining area"}]}}, {"review": {"des": "Sunda is a favorite restaurant of a lot of my friends' but to me, it's yet another disappointing upscale Asian fusion restaurant. There were some delicious bites, but you are definitely paying for the ambiance. <br><br>The good<br>- Wagyu signature crispy rice: Flavor explosions!<br>- Crispy brussels sprouts: I can destroy a bowl of rice with this dish. <br>- Lemongrass beef lollipops: Pretty classic SE Asian flavors.<br><br>The meh<br>- Signature rolls: Both the tail of two tunas and the sunrise were good but honestly you can get way better sushi for a much better price elsewhere. The construction was also sloppy - fell apart upon pick up, even for a chopsticks master like myself.<br>- Oxtail pot stickers: They are pot stickers.<br>- Drinks: The cocktails are around $15 and $16, which is fair for this area. They were so weak though. I felt like I was drinking a virgin Moscow Mule.<br><br>The bad<br>Our waitress was great but the bus person was very rude. I was literally still eating food on my plate, and he came to take it away from me, because he was on a mission to switch out our plates before the main dishes would arrive. I am sorry, but I want that piece of brussels sprouts I paid $17 for. And also, he totally spilled water everywhere while refilling my friend's and did not care to apologize for it. He was just so focused on checking a box on his to-do list without considering our dining experience.<br><br>So Sunda is definitely a nada for me ever again.", "pics": null}}, {"review": {"des": "Their cocktail selection is phenomenal! I tried both and loved both. We had the wagyu crispy rice, the spicy role (with ghost pepper mind you!) and pork belly. We ordered the short rib but was told after waiting 20 min that they ran out of it. we had to replace it with the pork belly (very heavy!!) But the waiter was able to give us a small discount for the wait. Will come back to try some other dishes on the menu.", "pics": null}}, {"review": {"des": "BEST restaurant in Chicago!!! This restaurant was highly recommended to me by a NJ colleague... its reputation holds up hundreds of miles away. I am still dreaming of the deliciousness I experienced a week ago at Sunda.  The crispy brussel sprouts and shallots were a perfect flavor mix... subtle and bold.  The spicy kraken was tasty, fun, and had a spicy kick to it.  The wagyu crispy patties were so rich and tasty, I thought about it all night and ordered it the next day as a takeout lunch!!  Crazy rice was good too, the egg yolk that was mixed into the rice at the table gave it a unique savoriness.  Poke bowl was standard (would not recommend as all other options on the menu are superior).  I highly recommend this restaurant... one of the best I've ever been to!  Would consider flying to Chicago just for this!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YMvIh3vfnhKt0QKiK9d72A/348s.jpg", "caption": "Crispy Brussels Sprouts Salad... delicious!!!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SiXe0NW6cTitYHY8FlQ2xg/168s.jpg", "caption": "Pork Belly Skewers"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-2n_XbxB8isvnMWixVfJdA/168s.jpg", "caption": "Poke bowl"}]}}, {"review": {"des": "Always good vibes here. Hip music, intimate ambience, fast and friendly service, large menu with a delicious fusion of flavors, perfectly prepped plates have been consistently coming out for the 3 years I've been comming here. Hats off to the chefs and staff at Sunda. Always an A+++ experience.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/q8jG9D95-L7hCZIngmjREQ/168s.jpg", "caption": "Street corn"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JVZ3DB5oghDYs62I-bwcTg/168s.jpg", "caption": "Brussel sprout salad"}]}}, {"review": {"des": "Simple, flavorful and delicious. We left Sunda with happy bellies and a fantastic experience.<br><br>Our party of 22 were sat in the semi-private room towards the back of the restaurant. Our service was impeccable and consistent throughout the night. We opted for a pri-fixe menu which made it easier to serve our larger party and a great way to try different menu items<br><br>A few dishes we got to try (and two sushi rolls that I don't know the names of):<br>CRISPY BRUSSEL SPROUTS SALAD<br>brussels sprouts, red cabbage, carrots, chilies, fried<br>shallots, minced shrimp nuoc cham vinaigrette <br>-- a light and simple salad to start off a meal or paired with your entree<br><br>TIGER SHRIMP TEMPURA <br>candied walnuts, creamy honey aioli<br>-- similar to the walnut shrimp in Chinatown restaurants, however, lighter in \"mayo,\" crispy and delicious<br><br>PORK BELLY SKEWERS (4)<br>braised pork belly, asian slaw, sweet soy<br>-- one of my favorites of the night with it's melt in your mouth goodness<br><br>FILET MIGNON<br>shishito peppers, red onion<br>-- not sure if I'm a fan of eating filet mignon already cut up, it was super tender and flavorful<br><br>PORK ADOBO FRIED RICE<br>shredded braised pork belly, scallions, garlic, fried egg,<br>vinegar soy<br>-- WINNER of the night! Put a fried yolky egg on anthing and it makes it even better. <br><br>SIGNATURE CRISPY RICE <br>pan fried sushi rice glazed with soy sauce<br>and topped with<br><br>SPICY TUNA <br>masago, chives, sriracha, rayu, jalapeño<br>-- I would pick this over the wagyu crispy rice. Extremely fresh tuna, yum.<br><br>WAGYU<br>sambal, chives, red chili, asian pesto<br>-- tender, minced wagyu, pairs well with the crispy rice<br><br>We also enjoyed the meal with two huge bottle of sake and it was refreshing. Reminded me of the Vietnamese \"rice wine\" dish. Everyone raved about the meal and enjoyed it all. I can't wait to come back and enjoy a lovely girl's night or dinner date.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FkpLQ60yCyl_qZyaidRbSQ/168s.jpg", "caption": "Crispy rice wagyu"}]}}, {"review": {"des": "A+ service; decent food. <br><br>We came on a Friday night, with a reservation.<br><br>Great service, very attentive staff. Would serve the next course as soon as you are done the previous course. A+ on service.<br><br>Food is mainly southeast Asian inspired. We got the Brussel sprouts salad. Must get! Light and surprisingly filling. Then we got the crispy rice wagyu. Decided to get that as other reviews said they were to die for. In my opinion, you can skip. The meat was not that great. We also got the crazy rice. It was just average. It was like a bimbimbap but a little bit spicy and had a slight flavour like of Thai. For two people, those three dishes were very filling.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PSKaZgC1n9lHd5m5jZ0fsA/348s.jpg", "caption": "Wagyu crispy rice"}]}}, {"review": {"des": "This review is for the Lumpia...it was a generous portion with two sides of dipping sauce.  It appeared to have a nice portion of the filling and was traditionally wrapped.  Would order again!<br><br>FYI-The place seems smaller in person than in the pictures on Yelp.  In addition it seems like a long wait to be seated at a table and the bar area is quite limited.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XkUNdgWiwZaYLNiSu505Dg/348s.jpg", "caption": "Lumpia with two sides of dipping sauce for take out.."}]}}, {"review": {"des": "Fabulous new Asian cuisine. Try the spiced edamame - it is the best I have ever had. Great oxtail dumplings. The cauliflower salad is amazing.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JIFaGgPZAosD0DNG9bZeDQ/348s.jpg", "caption": "Spiced edamame- the best edamame I have ever had"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7kj804NKxQnt7SL0GoQW0Q/168s.jpg", "caption": "Cauliflower salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3TQ1UtCFIV7CLAyuLMgn6w/168s.jpg", "caption": "Avocado stuffed with Ahi"}]}}, {"review": {"des": "I came here on a Sunday evening to eat some sushi and I was impressed.  The sushi tasted very good, we had the red dragon, one of the lobster ones, and the panda rolls. All were delicious. I also had their miso soup and that was delicious as well.  When we walked in we were seated right away.  We never ran out of water! They would come refill it once they saw you were running low.  The service was great and so was the atmosphere. I saw they had other menu options but we mainly went there for sushi, I would highly recommend this restaurant to anyone.", "pics": null}}, {"review": {"des": "8/19/2017 - SUNDA was a no brainer when booking this trip. Lindsay Y. told me she had been dreaming about the CRISPY BRUSSELS SPROUTS with red cabbage, carrots, chilies, fried shallots, minced shrimp nuoc cham vinaigrette ($17). Now I know why, it was delicious. I kept thinking of how to recreate this at home. <br><br>We also had the TIGER SHRIMP TEMPURA withcandied walnuts, creamy honey aioli. Both dishes were plenty to share. Of course, we could not skip dessert. We ordered the MOSHI ICE CREAM SAMPLER, vanilla, red bean, green tea, strawberry, mango chocolate, caramel, raspberry sauces ($14). I could have those again and again. <br><br>Our server, ALLISON, was very busy but she managed to take good care of us.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VvSpQfmcNdlbsnHuM2_Yhw/168s.jpg", "caption": "Tiger Shrimp Tempura"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nOS-70s1HbeZ_Lmwb_7e5Q/168s.jpg", "caption": "Moshi Sampler"}]}}, {"review": {"des": "Best drinks and sushi I've had !!!!<br>The brunch server is also so polite and super funny. Definitely made the experience more pleasant.", "pics": null}}, {"review": {"des": "The actual atmosphere is very trendy, loud upbeat music, dim lights, great ambiance, and the interior decor is amazing. <br><br>Its definitely on the higher side as far as asian cuisine but for a special occasion I'd say it's worth it. The dishes are on the smaller side. We started off with the panda sushi and it was delicious! $18 for a sushi roll, so again I emphasis its on the higher side but the food is amazing. Another dish we shared was the lemongrass beef lollipops which were by far our favorite! Seasoned to perfection and very moist! We also tried the crazy rice which was another one of our faves basically just fried rice w shrimp, lobster, chicken and fried eggs but again although simple it was very delicious. Our waiter guaranteed we'd be full after eating this but, although filling, we could still have more. We also tried the baked snow crab hand roll which was just okay compared to their other food but still good. <br><br>We went for a birthday which I notified them ahead of time and they did good w providing a bday dessert that was beautiful but comparable to a dry grocery store cupcake. Didn't realized we would be charged for it but it was only $5 which is nothing compared to what you've already spent here trying to get full. Overall though amazing food, ambiance, and service just be prepared to order more than a couple dishes.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3tQjS1q9hWwjuqI6Afne8w/168s.jpg", "caption": "Lemongrass Beef Lollipops"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UUVwEyanT1AbgXwoELVXHw/168s.jpg", "caption": "Baked Snow Crab Handroll"}]}}, {"review": {"des": "Went here for my graduation dinner with my family and loves the appetizers! We had the brussel sprout salad (must try) and the edamame dumplings, which we LOVED. We got beef noodles and a bento box to share, and enjoyed it but weren't impressed. I would recommend going with several people and ordering many foods to share, as that is how the menu is set. It definitely wasn't overly pricy for the ambiance and quality of food. Overall, recommend.", "pics": null}}, {"review": {"des": "I have been here a few times. I have tried all of their salads and have to recommend Miso beats in case you are \"beets person\" like me. In case you are not, go with crispy Brussels sprouts. It's very flavorful and delicious! It was the very first thing I tried when I came here for the first time and it certainly is worth every bite of it. <br><br>As for the main courses, my most popular dishes are Miso cauliflower and their target shrimp tempura and BBQ octopus. Yum!! They have plenty of great options for pescatarians or even vegetarians. <br><br>When you come here, start with ordering two or three plates and see if you are still hungry to order more because I have definitely ordered more food than was needed when I came here. The thing is that it all sounds too good and smells heavenly. <br><br>I'm not the biggest ice cream fan, I prefer anything chocolaty and rich and ideally warm which sadly they don't offer but they have plenty of ice cream options based dessert for gelato fans and I like their creme brûlée the most. <br><br>Finally, as a beer lover who prefers local beers - I love that they have delicious Matilda from Goose Island on draft.", "pics": null}}, {"review": {"des": "Amazing!!! We had seven people sharing items, and the waitress made sure that even items that only had 4-5 pieces were served with enough so everybody could have at least one piece. <br><br>The flavors were outstanding, and we had everything from beef tenderloins, to Dan Dan noodles, to a nigiri. One of the funner things we did was order a sushi roll that had a ghost pepper seed hidden in one piece... everybody at the table at a piece while anticipating who would be bleeding from their eyes. It was awesome (probably more of a guy thing than a date thing in retrospect).<br><br>I can't wait to bring my wife in to have her experience this with me.", "pics": null}}, {"review": {"des": "I've been here countless times over the last seven years.  Overall, they have a few pretty good dishes like the brussel sprout salad.  Everything is a little pricey but not bad when it's on your company.  <br><br>They have some private rooms upstairs which are perfect for small parties.<br><br>I recently had the lobster wagyu sushi for take-out.  The roll was itself pretty delicious especially the raw slices of wagyu, but the sauce was a little spicier than I like.  <br><br>They also have an $8.88 lunch special.  I have yet to check it out.<br><br>P.S. they have a fancy build your own ramen bowl menu with ingredients that you don't normally see.  I ordered the bone marrow sea bass tonkatsu ramen.  I wasn't a fan of the broth but the ingredients were fresh.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ksHUOZyT362gx8nNyGvLtg/348s.jpg", "caption": "bone marrow sea bass tonkatsu ramen"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2F8XLhkTdO998VKuProQaw/168s.jpg", "caption": "bone marrow sea bass tonkatsu ramen & chicken miso ramen"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fmInPIuZU5vs07QtHmNvBg/168s.jpg", "caption": "Fanciest build your own ramen bowl menu!"}]}}, {"review": {"des": "As with every good food endeavor, my biggest sadness is that my stomach can only fit so much, so I have to stop at some point. <br><br>We came here before heading out to a show. We had been munching on and off all day so we thought this would be a good choice for some shared plates - it did not disappoint. The atmosphere was great - it is a large space but isn't too loud. It has a zen atmosphere dispite being a busy restaurant.<br><br>Tuna truffle nigiri - I thought truffle may be a weird addition to raw fish but I was wrong. It mixed together for a nice more subtle flavor than I expected. <br><br>Chili albacore sashimi - this was my favorite thing we got. A bit of spice, accented the other flavors. The fried leeks were a great addition for texture and flavor as well<br><br>As I said, I wish we could have tried some more small plates, but I guess we will just have to come back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Fjwt7XxyB_qTSPV9oZlnog/168s.jpg", "caption": "Truffle tuna"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BSwGhcPPiFpfpPUQXOibbA/168s.jpg", "caption": "Chili albacore sashimi"}]}}, {"review": {"des": "Sushi on Friday night! <br><br>Of course we arrived at Sunda on a Friday night with no reservation. We were given 2 options to wait for an hour and a half, or be seated immediately at the sushi bar. Of course we chose the bar. The decor is very nice. Its a rather large establishment and gets pretty loud at times. There is music playing overhead however its hard to hear with all the conversations happening. This is not the place for quiet and romantic! Our very handsome waiter Antonio arrived almost immediately to take our drink orders. Clearly, he is used to the noise level because each time he came over he would bend down to each of us when communicating. <br><br>Our party of 3 had beer and a Lychee Luxury Drop. My friend commented that the Lychee Luxury Drop was not what she expected, but she ended up drinking it anyway and even ordered another. <br><br>We were informed that dishes would come out individually as they were prepared. Which was fine. <br><br>Heres what we ordered:<br><br>Edamame: salted and warm!<br><br>Tiger Shrimp Tempura: perfect dish! Crispy shrimp covered with some sort of sweet tasty sauce. Dish has walnuts also. <br><br>7 Spice Fried Chicken: 4 HUGE wings of crispy fried chicken, covered in a sweet & spicy glaze. EXCELLENT!!<br><br>Stuffed Avocado: spicy tuna, literally wrapped in an avocado with jspanese salsa. EXCELLENT!!<br><br>Red Dragon Roll: EXCELLENT!<br><br>Summer Garden Roll: clean, fresh taste. EXCELLENT!<br><br>Food was better than expected. Extremely fresh and well-prepared. Will dedinitely be returning to Sunda, this time with reservations.", "pics": null}}, {"review": {"des": "I was really disappointed in Sunda. We were so excited to go here only to be very let down. For starters out table was shoved up against the area where all the waiters were hanging out, so you had to keep scooting your chair in as they came by. <br><br>We ordered the dumplings, the sweet potato roll, and miso cauliflower. <br><br>There was something floating in our water when we got it, thankfully it was replaced. The dumplings had a hair in one of them and to say they were good would be a massive stretch. The sweet potato roll was ok, but tasted the same as what you could pick up at whole foods. The miso cauliflower was the best thing we had and it was only average. <br><br>We are vegetarian, so these were what we thought would be our best options, but sadly we were not happy at all, especially for what you paid. Those three items and one glass of wine were almost $70. <br><br>Plenty of other places to try in Chicago that are certainly better.", "pics": null}}, {"review": {"des": "It was good to come try Sunda again after having it in Nashville. I was told this was the first one? The restaurant is very trendy and loud. It was a fun environment. The food was 7/10, maybe even 8/10. I really enjoyed the drunken noodles and spicy edamame. Service was so-so. Our waitress was clearly slammed- but she was super nice. The prices are up there but worth the experience. Will deff be back.", "pics": null}}, {"review": {"des": "The food here was amazing. The people were very nice and explained the menu. I had a pomegranate martini and it was absolutely wonderful. All I can say is try everything. You will not be disappointed", "pics": null}}, {"review": {"des": "I remember dining here at least four times while I lived in Chicago.<br>Great ambience, but the most memorable thing about this restaurant is the Brussel Sprout salad. <br>We got it on the house when it was being introduced and I was hooked.<br>Great service. Surely recommended.", "pics": null}}, {"review": {"des": "**Vegetarian Friendly**<br><br>HUGE HUGE HUGE kudos to the waitress for asking \"are there any dietary restrictions in your party?\" I've never had any waiter/waitress ask me this question. We indicated we were vegetarian (no meat, no seafood) and she immediately pointed out options which could be made to suit our needs. <br><br>Pretty extensive menu, but not as many vegetarian entrees as I expected. BUT they have so many vegetarian appetizers that you could make a full meal out of them<br><br>Had a variety of dishes, and the Crispy Brussel Sprouts was my favorite. Definitely ask for a second side of the dressing, one isn't enough for the quantity. The Manchurian Cauliflower has a great sauce, but not a dish I would order again.", "pics": null}}, {"review": {"des": "I had this two times in one day then I GrubHub ordered it the next day. Absolutely amazing! Atmosphere and food 5-Stars! <br><br>Must try the ox potstickers. Taste like a roast beef stew (that may not be the best example) but the flavor was just phenomenal. My FAV is the crispy rice with tuna on top. Heaven. <br>The tail of two Tuna roll is so so so fresh and very soft.. when you bite into it, it feels cloud like, the red dragon roll was bomb kind of a typical tempura roll but better. Then the gambler... this was wild I had a taste of the ghost pepper and actually I don't think it's safe to eat. I LOVE spicy but that ghost pepper is gnarly.", "pics": null}}, {"review": {"des": "Fantastic experience! Highly recommend adobo pork belly and oxtail dumplings! Each dish is presented simply but packed with flavor and beautiful balance of flavors.", "pics": null}}, {"review": {"des": "My boyfriend and I came here Sunday for brunch, and we were blown away by the variety of food options! There was Thai, Korean, Filipino and more! We ordered the Red Dragon Roll, Oxtail Potstickers, Pork Belly Buns, and the Adobo Braised Pork Belly. All tasted amazing but my favorite was the sushi. We for sure over ordered for two people so we could have done without the pork belly buns. The food came fairly quickly and the service was great.<br><br>And of course we browsed the dessert menu and was recommended the Ridiculous by the waitress. Such a great way to end the meal. It's sort of like a dome of vanilla ice cream with a caramelized ginger carrot cake outer layer. Spent a lot of money here but worth it. :)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/P_jZYEg_37UpaVIOD_OJng/348s.jpg", "caption": "ridiculous"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XuvpVSsc5zYIz8NEGvVkgw/168s.jpg", "caption": "adobo pork"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/t61kgNeRHWMD7FxlyQid0w/168s.jpg", "caption": "pork belly buns"}]}}, {"review": {"des": "What an amazing meal. What an amazing time!<br><br>Arrived a little bit early for our 8pm Friday reservations so we had a seat at the bar. Sunda has a long list of interesting and fun cocktails as well as long list of wines/sake/beer.  Since I love lychee, I opted for their Lychee Luxury Drop--vodka, st germain, lychee syrup and a hint of wasabi.  Fruity and tropical but with a bit of warmth for the cold Chicago night. <br><br>They texted that our table was ready (10 min early!).  We walked past the long counter/sushi station and several tables. The decor is sleek, Asian inspired and settings are good for dates as well as groups. The menu is full of Asian flavors and covers land and sea. Asian dining is family style so passing plates and sharing is encouraged. <br><br>I think we over-ordered--we were celebrating my BFF's birthday after all, so no guilt, right?  <br><br>Chef Jess came out to talk to us and brought us two specials to enjoy. <br>The starter--a salmon and lobster \"nigiri\" with jalapeno, wasabi cream, tobiko and cucumber--a perfect starter, so fresh and delicious.  The other special was 2 glasses of chilled sake which paired perfectly with our ordered dinner.  Chef Jess was very gracious and friendly and everything we ordered was a winner.  The flavors were sigh-inducing, and the presentations were beautiful. Service was stellar from host/hostess to bussers. We truly enjoyed our meal and experience. <br><br>Other items we ordered:<br>Steamed buns--scallion buns filled with pork belly and a pickled veg slaw.<br>Lumpia--Filipino pork/shrimp egg rolls<br>Tiger Shrimp Tempura--with candied walnuts and honeyed aioli<br>Kai Lan--Chinese broccoli in a garlic vinaigrette<br>Garlic Crab Noodles--house made noodles with garlic butter, crab and garlic<br>Crunchy Pig, Hidden lobster--maki made with soy paper, lobster, avocado, jalapeno, tempura crunch and bacon. <br><br>We also rec'd a complimentary dessert--a sinfully rich chocolate layer cake. <br><br>Sunda is one of those places that as soon as you have your first bite, you know you want to come back..and soon.", "pics": null}}, {"review": {"des": "We came here on a Monday night around 7 and got seated right away with reservations .<br><br>I was intrigued this place has fast service and the food was great<br><br>The crazy fried rice was done very well<br>Brussel sprout salad is a must<br>Ox tail potstickers my friends liked it<br>The fish with the truffle was great<br>The beef with the crispy rice was good <br>Pork belly  friends liked it<br>Beef with lemon grass was good <br>Hamachi tataki friends liked<br>Lumpias were done well<br>Tuna with sticky rice friends liked it <br><br>Is dfenitely will be back .<br><br>This place is great with a group of friends so you can sample everything  :)", "pics": null}}, {"review": {"des": "Our meal was delicious as usual. We had a reservation and were seated within minutes. Our server Box(?) was as nice as can be as were the other servers who provided water and brought our plates. This was actually one of the better service experiences I've had at the restaurant. I come whenever I'm in town and sometimes the wait staff is a little snotty, frankly. Not this time. We had some favs and tried a new crispy chicken. The Tiger Shrimp tempura wasn't as flavorful as I've had in the past but everything else was great : calamansi crispy chicken, beef lemongrass lollipops, signature crispy rice and pork belly fried rice (new to me but quite good). Thanks!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PFMSzIj6WcjK6uvp7Q5g7Q/348s.jpg", "caption": "Signature Crispy Rice - my absolute favorite"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ylhPrr3SZ-IjCMU7-SmfFg/168s.jpg", "caption": "Crispy Brussels Sprouts Salad - I get it every time and supposedly don't like brussels sprouts"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/n9e3Blq6QMzZ5FeX0TbSHQ/168s.jpg", "caption": "Calamansi chicken crisps - fancy fried chicken skins. Yummy"}]}}, {"review": {"des": "Loved the place so much that I had to go there twice in my week long stay in Chicago. Definitely reserve a table beforehand. Their brussel sprouts salad paired with any sushi would make for a great meal", "pics": null}}]}