{"name": "superdawg-drive-in-chicago-2", "reviews": [{"review": {"des": "Superdawg is not just one of the few drive-ins left in the Chicagoland area reminiscent of the late 1950s and early 1960s but it's also a classic stop where one can enjoy an authentic Chicago dog.<br><br>Most people would compare this to Gene & Jude's but they would be wrong in drawing that comparison. Gene & Jude's sells depression dogs while Superdawg sells Chicago-style hot dogs which are the dragged-through-the-garden jumbo dog piled high with various vegetables and neon green relish on a poppy seed bun variety. Depression dogs on the other hand features a regular-sized all-beef frank served on a plain hot dog bun--no poppy seeds here--garnished with yellow mustard, onions, hot sport peppers, maybe some relish and always served with a giant mound of fresh cut, skin-on fries, either wrapped up with the hot dog or simply piled on top. Absolutely no pickles, giant slices of tomato, cucumber, lettuce, celery seed or ketchup.<br><br>The only other place that can truly compare and sell you an honest Chicago-style hot dog would be the Dog House which opened in 1963 and has since grown in popularity and reach to be now known as  Portillo's. Both Portillo's and Superdawg serve the best Chicago-style dogs you can get and both offer you a feel-good sense of nostalgia. But it's only at Superdawg where you can really celebrate the simple joy of a hot dog while being smiled and winked at by Maurie and Flaurie.", "pics": null}}, {"review": {"des": "Superdawg.... Superdawg....Superdawg....  where do I begin.  This is a timeless classic and in my opinion the best dawg around.  Now I am partial to Superdawg because both of my parents were north siders and well this is where we used to go to.  I think it blows Gene and Judes out of the water and all the other places too.  <br><br>The hot dogs are quality hot dogs and the put just the right amount of ingredients on them.  Not ketchup though... don't ask for ketchup... just don't do it ha ha.  I always ask for everything except peppers and then add extra tomato and onion!!! This is a great combo.  The buns are unreal!!! The poppy seed hot dog bun is very underrated in the bun community, but really rock.  It adds a nice little texture to the dog and well frankly (see what I did there) they look cool.  <br><br>The fries... man these crinkle cut salted fried pieces of awesomeness ROCK.  They have just the perfect amount of salt and are browned just right.  They pack them in a little box right next to your hot dog and are really amazing.<br><br>Now the décor...This place was founded in 1948 and has been straight up rocking the hot dog game since then.  Of course you have the two hot dog icons on top of the roof almost summoning you to stop in.  You can still order from your car and have food delivered to your car. <br><br>Do yourself a favor and go here... just go....then go again and again.  Tell your friends, tell their friends, tell their friends' friends.  And remember... it's not a hot dog, it's not a red hot......It's a SUPERDAWG!!!!!!", "pics": null}}, {"review": {"des": "This is a definite place to stop and visit is you are a local, or a visitor. Superdawg has been around for quite sometime. And it is a buck list stop for all who have never been. <br><br>  I came to this location when I was in my youth and still return till the present time. So there is some history here. <br><br>  The one thing I always find myself doing, is getting a extra side order of those fries. LOL. <br><br>  But all and all. A definite place to stop. There is a reason they have been around for a long time. You will agree.", "pics": null}}, {"review": {"des": "Classic Chicago experience. Just one of those things. Pretty good dog and fries for a reasonable price. Unlike the more modern Sonic drive-in, you can't pay at the screen with your credit card. When the carhop brings your food, she'll take your card inside, run it, and bring you back a receipt to sign. She may also bring you a plastic bottle of ketchup and a real salt shaker- no packets! Press the button to let someone know you-re done, and they'll retrieve the tray and things. There are a few tables inside, too.<br>Bathrooms are accessed through an outside door behind the building.", "pics": null}}, {"review": {"des": "Honestly, I don't see what the hype is all about! Can someone please fill me in? <br><br>Yup! While in Chicago I had to make a stop at Superdawg Drive-in. Featured on the travel channel and Diners, Drive-ins, and Dives, I had to make an effort to stop and see what all the fuss was all about. <br>Superdawg offers sandwiches, sausages and fried shrimp all offered with a side of superfries! Single patties are the super burger and super cheese. The double patties are the Whopper burger and the Whopper cheesie. <br><br>Now, I get it, this place has been featured on my travel channels. The concept reminds me of Sonics....right? But the food wasn't \"blow my mind\" good! It was a simple burger with fries. However, not many restaurants won't bring your food out your window while you're sitting outside in the parking lot; so it's an American past time that has mostly vanished, except for the small number of locations in Chicago!  <br><br>HOW IT WORKS: <br>You drive your car into the drive-in, push the black button for service, wait for the operator to answer come and submit your order. The food arrives about 15 to 20 minutes later period on the driver's seat you roll your window halfway down and I'll clip your tray onto the window. After you're finished, you open the door flip switch for tray pick up and watch the service come right to you. Voila! <br><br>Now, I hear this is a good place if you want a Chicago Hot Dog. Alas, I didn't order that, but should have, right?! <br><br>This restaurant is located on a busy street with an abundance of parking; inside the restaurant is a classic. You can buy souvenirs such as T-shirts, magnets and post cards.  It's definitely not far from Downtown Chicago, so if you rented a car, this would be a place you must visit at least once! <br><br>I ordered the Whoppercheesie burger with the double patty. Just A-Okay for me. <br><br>It's definitely a blast from the past that you must do at least once when in Chicago!  <br><br>Enjoy!", "pics": null}}, {"review": {"des": "Had to check it out since it was a drive-in and we \"needed\" a Chicago hot dog. <br>Kinda messy but a food adventure in a way.  <br>It was okay, not bad but I think I still stick to just walking in and grubbing.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/trJDzW8x4rpj2ja488OtdA/348s.jpg", "caption": "Hotdog is buried."}]}}, {"review": {"des": "As a first timer, of course I had to try the infamous Superdawg! I love the presentation of the box filled with the hot dog and fries inside. The Superdawg was delicious, especially with the hot peppers and the green tomato! I wasn't too fond of the fries, it was pretty stale. I disagree with some of the comments about the high price, I think it's fairly affordable since the price of all their hot dogs, burgers, and sandwiches include fries. It's pretty consistent with other competitors. Surprisingly what really stood out for me here is the Superdawg Veggies! The fried batter gave a fantastic flavor dipped with ranch sauce! I'd like to come back and try the burger, sandwiches, and shakes. I know this is a pretty staple hot dog place within the Chicago area and I'm glad I finally got to try the Superdawg experience!", "pics": null}}, {"review": {"des": "They thank you here every chance they get.  Food box containers say HIYA From the bottom of my pure beef heart ... thanks for giving me this chance to serve you.  Cups are similar. But please whatever you do DO NOT REQUEST ketchup on your hot dog. It truly is sacrilegious. If for some reason you do request ketchup on your hot dog.....you will not get it. They will give you a bottle to put it on yourself!!  Just don't let anyone see you. And thanks to the owners for not using styrofoam containers.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mBzr3-T5ODbCT7KFh4vNHA/348s.jpg", "caption": "Just so you know the ketchup was for the fries NOT our hot dogs. As we don't do ketchup on hot dogs here!!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/X0LK0Fc6bLifBHW-XwxIRA/168s.jpg", "caption": "How cute is this??!!  My cheeseburger was formally attired in...."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CFPUQLT-s4kKCsMZSv73GA/168s.jpg", "caption": "SuperCheesie Burger"}]}}, {"review": {"des": "I first found out about Superdawg through Check, Please!, a long time ago.<br><br>Both locations are a bit out of the way for me, but one day, I saw a groupon for them and thought now-or-never. <br><br>Ordered their cheeseburger and Chicago-style hotdog, which came with fries. Enjoyed the food.<br><br>But more than the food, the main draw for me was Superdawg's uniquely retro, drive-in fast food experience where food is brought to your car and you eat it there on trays.", "pics": null}}, {"review": {"des": "I LOVE this place. The nostalgic feel is awesome. Lots of people watching and a few old and amazing cars. <br><br>It's towards the south end of the North Branch Trail, a bike trail that I use. There are always other cyclists there too. <br><br>All their food is wicked good, but their Superdawg is a must try. Buried in their fries in a Superdawg box. Their fries are soooooo good. Dog comes with everything and is always juicy and delicious. <br><br>Their burgers are like an old drive in flavor on steroids.  Love this place.", "pics": null}}, {"review": {"des": "Honestly the food here I think is just ok.  But they get an extra star for the cool/classic/nostalgia factor. Plus they are open until 1-2 AM depending on the night which makes them a solid choice for those late night cravings.<br><br>Menu consists of burgers, franks, fries, and shakes/malts, and really basically anything you would expect from a 50s type drive in.  You can eat there and they'll bring your food out on a tray otherwise take it to go, but really dining there is part of the experience.<br><br>This place is a Chicago landmark and I'd definitely make your way here if you haven't already!", "pics": null}}, {"review": {"des": "Superdawg is fantastic.  I would like to try the burgers but I cannot pass up the Superdawg if I am here.  I have tried the whoopskidog and that is very good but that is as deep into the menu as I have gotten.  In a town full of hot dogs Superdawg reigns supreme.", "pics": null}}, {"review": {"des": "This is a Chicago institution. Originally opened in 1948, Superdawg has been doing there thing for a long time, and there's a good reason for that. Although it's been renovated so it doesn't look run down, it still has he old school drive-in charm that will have many Baby Boomers reliving the glory days. The ordering is simple with a press of a button, and is promptly brought out to your car on a tray. The waitress also brings a copious amount of napkins (trust me, you'll need it) and ketchup with the tray, although I advise against using it on your Superdawg. It's the ultimate Chicago sin. <br><br>Their menu features many Chicago classics: the dawg, burgers, fries, etc. We both were drooling over the Whoopercheesies and decided to both get it. Our daughter wanted a grilled cheese and a chocolate chip cookie. All meals come with fries, but if you don't want them, you save $2.50 off the original price. Our Whoopercheesies featured two beef patties, yellow mustard, nitro relish, white onions (grilled or raw), and probably melted American cheese. The best thing about this burger is that it's simple, yet delicious. There's no need to use anything else to dress up the burger, it's perfect as it is. Don't even get me started on the fries. I swear it's fried with some beef fat because it's just so darn tasty. <br><br>In terms of Superdawg, they've been doing their thing for 70 years. Trust the fact that they know how to serve great food.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RqL01PLr8jU362wxeoW6-g/348s.jpg", "caption": "Menu"}]}}, {"review": {"des": "Superdawg is a Chicago classic and a spot that I've been wanting to hit up for some time now. We stopped in for lunch while in the area and had a tasty lunch.<br><br>This is a \"vintage\" experience where you pull your car in and are serviced by a call box and a car hop (sans roller skates though). The great part is that the parking spots are covered so you can eat in your car in the shade. Otherwise, you can eat at one of their several side tables.<br><br>We called in our order and our food arrived rather quickly given that there were only a few vacant spots. The hot dogs certainly are \"super\", they are easily the 1/4 pound size (aka Jumbo dogs), and they come in a little box with fries. If you have an average appetite then one Superdawg will be a great lunch for you, plus a drink of course. And I'm not exaggerating, I have a big appetite and was pretty hungry going there and felt content after just one dog, STUFFED after two. The only downside is the fries... they get a little soggy sharing the box with the dog. Additionally, we had a milk shake - well made and delicious!<br><br>For a fun old-school hot dog experience you should definitely stop by Superdawg, I don't think you'll be disappointed.", "pics": null}}, {"review": {"des": "Visiting Chicago for the week and had to stop in. Ordered a Superdawg with hot peppers. Bun was soggy and off putting texturally but everything else was delicious. The dog itself was flavorful and juicy.", "pics": null}}, {"review": {"des": "Like this place and have for a long time...but everyone should remember its a hot dog place and that is what they are known for. Look up on the roof and you'll see the two hot dogs - Flaurie and Maurie. Stick to hot dogs and you won't be sorry (saurie?).<br><br>Now for the hot dogs...they are very nice. The dogs have a bit of snap to the skins, the taste is special because it is a recipe they came up with,  and the dogs have a great beef taste. Condiments are the usual with the exception of the neon green relish...tastes the same but looks weird because it is so green. <br><br>You can go into the small building and order, or park in the carhop Drive-In spaces and order over the radio (they have been refurbished and work fine). Either way it is a classic old Chicago 1950s feed. They have been here for 70 years and here is hoping they stay another 70.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8u3rsxpRNGTM5nXN-o8jNw/348s.jpg", "caption": "'Nuff said"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jjf1pIvXJWr3_Dtp1E5oYg/168s.jpg", "caption": "While they sell lots of stuff, it is a hot dog palace"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EN6AVyB9n7tb7mfw0LlLKg/168s.jpg", "caption": "They were out of hot dog boxes so ours came in the hamburger box"}]}}, {"review": {"des": "This place has been on my bucket list for years, and here we are!<br>Superdawg is delicious! Premium quality wiener, and the best crunchy crinkle fries ever. The garnishes, pickle, pepper, tomato were excellent.<br>Had a pineapple malt, delicious.<br>Service was friendly and efficient, even though they seemed constantly busy.<br>Bought a few souvenirs. Logo cap, t shirts. Great quality.<br>Glad we made it here, this place is the real thing.", "pics": null}}, {"review": {"des": "Man, I come here enough where I almost tried the entire menu. <br>Hopefully, you get an idea of what to get with my ranking if it's your first time.<br>Personal rankings: <br>1. Whoopskidawg<br>2. Pineapple milkshake<br>3. Superdawgs<br>4. Burgers<br>5. Onion chips<br><br>Whoopskidawg: More people got to try this. it's basically a steak sandwich. The briny pepper and pickled tomato cut thru the rich flavors. Least tender item because it is an actual chunk of meat. Best bang for your buck here.<br><br>Pineapple milkshake, you read that right. This is sweet and creamy with small chunks of pineapple. Doesn't have the sharp notes you get when regular pineapple. Drinking sweet pineapple ice cream<br><br>Their Superdawgs is what people recognize them for. Taste very brine heavy. It comes with a pickled tomato unique addition to the hot dog.  The meat barely comes through the saltiness. However, it works in a weird way, strangely addicting. I wasn't into this before but after a few tries, I am starting to get this. Think this is more of an acquired taste.<br><br>The burger here is pretty messy but man you can really indulge in this. Each burger is adding cheese or another patty, pretty simply differences. Solids burgers that will fill you up.<br><br>Onion rings basically, heavier breaded. I wish I get more for the price. Not worth picking up unless you craving onion rings, which I do sometimes. Just feel like completing this list with 5 items instead of 4. <br><br>Every sandwich comes with fries but you can omit it to save a few bucks. I really love this place because it does many things well. It's not the best fast food place, but I keep coming back. The food is consistent, the style is retro, and food tastes unique yet simple.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Y06VY0uj3UaDY9XPZGNbIA/348s.jpg", "caption": "Whoopercheesie n fries"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bYjvv5NASqGd3kY19bEqaA/168s.jpg", "caption": "Superdawg"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iYHAfz1cdT3TWq3i_C2ufQ/168s.jpg", "caption": "Pineapple shake"}]}}, {"review": {"des": "I was in Chicago and had to stop by. I love the old school drive in and park service. You don't see too many of those anymore.<br><br>I am a true hotdog lover and pretty snobby when it comes to dogs. This place was great, I am just use to getting my Chicago dogs a little differently. This places taste is a little unique. The relish was super sweet for me and they only add one small pickled green tomato. I prefer the sliced red tomatoes for celery salt. This dog did not come with celery salt and I did not see any laying around. Overall very happy I just like mine salty and with red tomatoes.<br><br>I am glad I had the chance to check it out. Historic landmark. Check out my pics!", "pics": null}}, {"review": {"des": "This is the original (since 1948) Superdawg (not a hot dog) Is a 50's style drive in located on the corner of Milwaukee & Devon.  It's like a blast from the past.  This is a drive in style where you can either pull in park your car under the canopies & order your food from the individual menu boards.  The food is then delivered to your car.  The other option is that you can walk in to the front & order your food.  There is a narrow passage barely wide enough for 2 people to pass where you can order your food, get your number and wait.  Once you get your food there is a small seating area where you can take your food or take it to your car and eat or take it home.   There is also a small seating area outside, but much of the year it's either too hot or too cold.  <br><br>My wife and I went there.  We went on Groupon and found a $20 for $10 deal.  In keeping with what they are all about I ordered a Superdawg w/fries, you can't call it a hot dog, you must call it a Superdawg.  My wife ordered a fish sandwich on rye w/fries. The Superdawg   ($6.15 W/fries) is actually pretty good, but the crinkle cut fries were soggy and not too tasty.  The fish sandwich is $7.00 W/fries). This was actually very good. <br><br>Going to Superdawg is a novelty worth trying sometime just to go and experience it. The food is decent, but there are other hot dog places that are better and much more reasonably priced.  They built another larger Superdawg in Wheeling IL in 2010 W/the same 50's style drive in.  It's a fun place and worth checking out.  This is THE SUPERDAWG THAT WAYNE & GARTH DROVE BY IN WAYNES WORLD!!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QiNKxX9NHIiwjDEIz01w2A/348s.jpg", "caption": "Fish sandwich on rye & soggy crinkle cut fries $7.00) get a Groupon $20 for $10)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GRCM0z83uJtp2r-IAm4m0Q/168s.jpg", "caption": "Da Superdawgs wit da fries"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dN56hFL2xv53eFWl-ZMktw/168s.jpg", "caption": "Menu board"}]}}, {"review": {"des": "This is a decent hot dog/fast food stop around the Chicago area. They always have good, prompt service and I am never against eating at here. There aren't many in the area so when you do see one I would say stop in and try them out if you already haven't.", "pics": null}}, {"review": {"des": "Love this Chicago Ivón. Yummy dogs. Excellent fries. Although a bit pricey still my favorite.", "pics": null}}, {"review": {"des": "Do I even need to review Superdawg? It's hot diggity dog perfection. This is an iconic chicago landmark and you simply can't consider yourself a true Chicagoan if you've never been. Sorry. Not sorry. Your hot dog is served over a bed of fries in the cutest little retro cardboard box. It's juicy and delicious and well- perfect!", "pics": null}}, {"review": {"des": "The food is awesome; never had a bad meal!  I have been going here since I moved to the Chicago area 15 years ago.  My only irk is the ordering process inside.  The ordering / pick up area is not very big, so there is not a lot of space and you may have to wait outside.  There isn't also a lot of space to wait for your food.", "pics": null}}, {"review": {"des": "Best hot dog in Chicago!  Definitely worth the wait, and best sure to order their classic Superdawg combo.  Tasty hot dog recipe, unique combination of toppings.  The Chicago dog: hot peppers, dill pickles, picklini relish, onions, and green tomato in a poppy seed bun!<br>Crispy crinkle French fries with your order, or subtract $2.50 from your order.<br>Delicious strawberry supermalt!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cU0277RDDqYc5M2ocOs-Nw/168s.jpg", "caption": "Order from your car"}]}}, {"review": {"des": "Good! Had to visit what comes up in every hot dog food show I've ever seen.<br><br>Tried the Superdawg and a grilled cheese on rye.  Also had a supersoda with pineapple seltzer.<br><br>My drink was fantastic, my gal had a plain coke. I like that they don't flake out on the soda syrup. Coke was good.<br><br>My gal absolutely loved their fries! She loves soggy and floppy fries though. They serve crinkle cut, which are my favorite.  I'd prefer crispy fries but hey..still good.<br><br>The dogs were soggy too..buns that is. They are really crowded in their little container,  so the bun steams itself while they get it to you.  Perhaps they even steam the bun while putting it together. In any case, whole thing comes out kinda mushy. The dog itself is delicious. Perfect snap, great flavor, generous size, no complaints!<br><br>The grilled cheese was a bit boring..but plenty of cheese. And rye bread tasty, but again soggy and not toasted like I prefer. <br><br>I'll stick to superdawg and maybe try something other than fries when I come back!", "pics": null}}, {"review": {"des": "Great hot dogs and fries - great!  The only problem is the price!!! But if you haven't had these dawgs yet it's worth it.  <br><br>Tip to the owner: invest in bigger boxes for your food.  The dogs and fries are so smushed in you can barley get it out without destroying your  beautiful creation.  While delicious, it's a dirty massacre if the dawg is loaded.", "pics": null}}, {"review": {"des": "Food is always hot and consistently good!!! Service and the staff are always friendly!", "pics": null}}, {"review": {"des": "Good Chicago dog and a Chicago classic. This won't be the best dog and fries you can find, but it's solid and the place is genuinely kitschy cool even if a bit overpriced.  Plus, it's somewhere that should be on your been-there-done-that Chicago list.  Stop by and check it out.", "pics": null}}, {"review": {"des": "Super-dawg was OK. Our fries were dark brown, kind of burnt. Burger was good but not extraordinary. I didn't like that bright green relish on the burger. (I accept its presence on hotdogs but did't like it on the burger.) If we visit again I'll try their hotdog. The pineapple shake was delicious!", "pics": null}}, {"review": {"des": "Best hot dog in the world!<br><br>When I say it doesn't matter what the place looks like - it is the food that matters - this is the place I see in my head. <br><br>I wish I lived closer but alas I can only get one of these when we visit Chicago. <br><br>I always get one with everything. I love the sport peppers and the nuclear looking relish.  The green tomatoes are different and the fries seem to always be soft but I cannot complain about anything. This place is definitely a Chicago treasure.", "pics": null}}, {"review": {"des": "Was in Chicago visiting for MDW and had to stop at Superdawgs.  Last time I was in town I had a Superdawg and it was like a religious experience.  I was under the impression all dogs in Chicago were like Superdawgs.  Boy was I mistaken.  So after having a let down bc I ate a hot dog elsewhere, I had to make my way to Superdawgs.  <br>     I'm from NY and for some reason, we think we have the best hot dogs.  Let me fill you in on something.  No NY hot dog can come close to a Superdawg.  First off, they're huge!  So well flavored too!  Normally, I'd scoff at the idea of not using ketchup on my dog and loading it up with mustard, relish, onions and a pickle but damn, the combination of flavors rejoice in perfect harmony in your mouth.  And no, you DO NOT need ketchup for your Superdawg.  <br>     I also got a vanilla malt shake which was far better than any milkshake I ever had.  Wish we had one of these in NY.  Till next time Superdawg!  It was real.", "pics": null}}, {"review": {"des": "WAY-WAY too overpriced. This is insane to pay this for any HD. It is like the Starbucks $5 dollar cup of coffee. You are really paying for the gimmick of the design of this place. Dogs taste okay, however, almost $6-$7 for a dog and fries in a small box is robbing the consumer. I work hard for my $$$ and not about to give it to a business like this to help maximize their profits! It is all hype. <br>It will cost almost $50.00 to feed a family of 4 with drinks. Outrageous. Too much compo out there to get a better bargain. I'll pass! Happy hot dogging folks!", "pics": null}}, {"review": {"des": "Great burgers and hotdogs ! They also have tasty shakes ! The service is great even when the line is out the door ! <br>Best hotdog place in Chicago ! I've been going here for 38 years .. my dad used to take me here when I was 3 years old !", "pics": null}}, {"review": {"des": "Delicious food and came out super<br>Fast!! I have never had some many hot dogs since moving to Chicago land, but I must say that I have developed a new appreciation for beef dogs since moving here. Among all the places, I must say that this was the best I've had thus far.  The hot dog was all beef and the bread was dense and soft, and didn't get mushy. An unexpected surprise though were the fries which tasted so fresh!  They were crispy on the outside and soft on the inside.  <br>We opted to sit outside since I am not really a fan of food being eaten in the car. I appreciate that they have simple bar seating inside also.  <br>We used the bathroom and it was clean along with the kitchen which was visible, well organized and clean.", "pics": null}}, {"review": {"des": "This place is way overpriced for flavorless hot dogs and greasy fries.  We had a car load of people and not one was happy with their meal I gave two stars only because of the cool order at your window atmosphere .  For good food go elsewhere.", "pics": null}}, {"review": {"des": "Always the same experience with delicious and hot food served by friendly people. Superdawg is a classic!", "pics": null}}, {"review": {"des": "This is an experience I've checked off my bucket list- a Chicago style dog at one of its most famous drive-ins. I've been to Sonic before, but this is something else. Of course, this is fast food, but not fast food like you've ever had. This is an institution. Thankfully I don't live anywhere nearby, otherwise I'd be back weekly. Check it out if you're in the area.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JFAmyUrWwWvTZ2xsoDLhmg/168s.jpg", "caption": "Chicago style hot dog (100% beef)"}]}}, {"review": {"des": "There was nothing wrong here with the food it just was not for me. The service was pretty good over all. Very cool, old place. I definitely recommend trying it once or twice.", "pics": null}}, {"review": {"des": "The famous Superdawg, with the guy and gal hot dog on top of the building is a Chicago classic. It's unfortunate that the food does not hold up its merit after all of these years. The prices are way too high for this type of meal, and quite frankly, the quality of the dog is underwhelming at best. All orders come without fries except for the Superdawg, and even then the fries aren't something to write home about. <br><br>Indoor and outdoor seating, plus they have a drive in option to so you can eat in your car. I guess this a Chicago staple, so a lot of Chicagoans love to come down, but honestly even if you're a huge foodie and love a good hot dog, save the trip up here, you'll find much better options deeper in the city.", "pics": null}}, {"review": {"des": "Haven't been there in a \"dawg's age\" but it's a great experience and their food is delicious.<br><br>Truly a Chicago institution that deserves \"landmark\" status.  <br><br>Be sure to take a selfie with their big sign in the background.", "pics": null}}, {"review": {"des": "This is a great place, an institution. The hot dogs are large and delicious. The french fries are tasty. The burgers and big an juicy. The ambience is retro and fun. There really is no reason not to check this place out.", "pics": null}}, {"review": {"des": "Excellent hot dogs obviously. The vegetable tempura is amazing and I order that every time. Don't order the grilled cheese, it's not even grilled. It tasted like two pieces of bread slapped with cheese inside maybe melted in the microwave. <br>But who cares about the grilled cheese, it's super dawg just order hot dogs!", "pics": null}}, {"review": {"des": "Been going here since I was a baby and I don't think I'll ever stop coming here! Everything is wonderful the only thing I would update is getting a scanner for groupons and living social coupons so you don't need to print it ahead of time", "pics": null}}, {"review": {"des": "I just had to check this place out when I came to Chicago. I had seen it on tv before so I was really excited to try It. <br>I ordered a superdawg and a chocolate malt. The dog was excellent, the tomatoes and relish were delicious. It also came with a ton of crinkle fries. Definitely worth checking out if you are visiting the area.", "pics": null}}, {"review": {"des": "Big Shout Out to Superdawg for supporting Senn High School with a donation week.  They also helped our administration arrange for the staff of Senn to purchase food during our donation week and it was a big hit among the staff.  The ordering and pick up process were very easy for us and the cooler they allowed  us to use made sure everyone's food was hot and delicious.  Thanks again Superdawg we truly appreciate you supporting Chicago Public Schools!", "pics": null}}, {"review": {"des": "Neat concept--park your car, order through an intercom, and receive your food from a carhop.  This is handy when you have a baby in the vehicle.  It's fun for all ages!<br><br>Food is fairly standard but scratches that itch.  Hot dog is good.  Burger is good.  Polish sausage is okay if you dig their style--chopped fried onions instead of sliced (meh), barbecue sauce instead of mustard (meh) and a griddled bun (is nice, I like).  The crinkle-cut fries are crispy but unmemorable; get the onion chips instead.<br><br>A final word about their chocolate malt milkshake:  it is, simply, one of the best.  Very thick, with rich, perfectly balanced flavors.", "pics": null}}, {"review": {"des": "This is hands down the best place to get a Chicago Dog! Also the fries are so good, no extra salt or sauce needed, they have great flavor on their own.", "pics": null}}, {"review": {"des": "Well..cmon it's Superdawg...dad has taken me here since I could chew. But then again...dad had the 50s mentality of what is healthy.  If I had to eat a hot dog (which I haven't in 24 years)...this would be the place to do it...same with fries....would be nice to at least pretend to have a few healthy choices but...I get it...fabulous malts though..and how cool of a theme to have the 50s servers. No wonder dad loved it...however..dad did not like paying $6 for a hot dog...", "pics": null}}, {"review": {"des": "This place is been on television a few times and it's a staple of the neighborhood. It's an old style drive-through where you half expect Your server to arrive on rollerskates. It's a lot of fun and very unique.<br><br>That said, see if they have a Groupon available because the biggest downfall of this place is that it's a bit pricey. It knows how good it is and prices itself accordingly.", "pics": null}}, {"review": {"des": "Cool old school drive-in with decent food.  The dogs are great and the fries are definitely above average - although there aren't as many fries as you would like stuffed into the box with your hot dog.  A sneaky good menu item is the grilled cheese, which is weird because it's just cheese on a burger bun, but it works, must be the grease built up on the grill.  The burgers well below par, but you shouldn't be getting a burger at a place called Superdawg anyways.  Open late for a tasty midnight treat and just as good for lunch.", "pics": null}}, {"review": {"des": "That's a serious hot dog!!  I'd have to agree, one of the best in Chicago.  I regret waiting so long to try it.  The fries were delicious too.  Staff was super friendly (unlike so many other hotdogs stands... I never understood that).  Cool packaging with the hotdog.  I can't wait to go back to try more off the menu.", "pics": null}}, {"review": {"des": "Chicago northside iconic joint. The food is alright, nothing too special. but tad bit over priced.", "pics": null}}, {"review": {"des": "Best dawgs in town for decades! Yum Chicago staple and must visit attraction! The fries are also cooked to perfection.", "pics": null}}, {"review": {"des": "So delicious!  Nice lunch size hotdog and fries. Kept me full til dinner without being too stuffed to get back to work;)", "pics": null}}, {"review": {"des": "There is no way I am going to be in Chicago without having a Chicago hot dog.  I am aware that there are others but Superdawg was high on my list.  The reviews and history was too tempting to pass up.  You have an option to dine in, take out or eat in your car and wait for a car hop to deliver your food.  A Chicago staple with the guy and gal hotdogs on the top of the roof, Superdawg is highly worshipped by locals and tourists alike.  I orderd a Superdawg and a Whoopskidawg.  The Superdawg is a regular hotdog on a poppy seed bun while the Whoopskidawg is a polish sausage with grilled onions.  The Superdawg came with fries but you can order without fries.  You can order a small or large drink with a free refill.  Both were top notch.  If you want a bigger \"dawg\", I would recommend the Whoopskidawg.  But the Superdawg will do for most.  There are other options for those who despise hot dogs.  Don't just come for the hot dogs, come for the retro feel and look.  The menu has many choices but the taste and setup is simple.  Yes there is another location in Suburban Chicago but if you are an out of towner this is where you need to go.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uwVjfQCAHWo7HF8ws3TLOw/348s.jpg", "caption": "Superdawg"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cdoGV8-a0YvU1jENqArgSA/168s.jpg", "caption": "This tells the whole story."}]}}, {"review": {"des": "waaaaaaaaaaaaaaaaaaaaaaaaaay overpriced. nothing special. unless you grew with this and you are just nostalgic  - WHY pay so much for a mediocre hot dog. aaand they can be rude. we still bring all the out of towners here because of how it looks and their old reputation. <br><br>plus their burgers are gross.<br><br>but this is NOT where i go when i want a good hot dog. or any hot dog", "pics": null}}, {"review": {"des": "Can't afford it.  Way too expensive. A hot dog is a hot dog. Not a big fan of the atomic green glowing relish.", "pics": null}}, {"review": {"des": "The Whoopskidawg was great, Especially with it's unusual sauce.<br><br>And a pickled green tomato. Well, Actually salvaged from another of my acquaintances, And eaten.", "pics": null}}, {"review": {"des": "I Love Superdawg! Gerry & I are loyal customers for many years. Every time we eat here all of the food is Great! My favorite is the cheeseburger & I prefer grilled onions. I love how the onions are chopped in small pieces. The raw onions on a cheeseburger are also very good. Great crinkle cut fries & you do get alot of food! <br>Superdawg reminds me of a trip to the past when we had many good drive in places like this to eat at. I enjoy that you can eat in your car, inside a dining area. Also outside when the weather is nice. Very wonderful service always as well. You get that bottle of ketchup for the fries which is a big plus for me. Who wants to mess around with those small packages that are so hard to open? Any time of the year it's always a nice treat to have lunch or dinner here. <br>The Long Time hot dog couple on top of the building are Adorable! They put up with all kinds of weather too! Superdawg is a Wonderful Vintage place to eat at in Chicago. Anyone visiting Chicago should try Superdawg for sure. It is a fun place to eat at.", "pics": null}}, {"review": {"des": "What can I say, one of my favorite places for a Chicago hotdog. You can do the park your car and order, but we tend to just park on the side walk in an order they have some seating. When you walk in you can smell the yummy goodness. <br><br>You order at the counter and wait for your number to be called the shakes are not bad as well. Nostalgic with the drive in feel.", "pics": null}}, {"review": {"des": "I had nice deal off Living Social and decide to use it on this beautiful Sunday Afternoon. <br><br>Me & My son drove up north to get some grub. <br><br>Super Dawg Food Drive-Inn will take you back to the old school.<br><br>I'm happy that there are still a few places around that still has that  original look. It took me back into time from the old TV Show \"Happy Days\"<br><br>We pulled up to our station press the intercom and placed our food & soft drink order.<br><br>Not long a very nice lady came to my car window with a tray of food. She placed the tray gentle on the edge of my window. How cool? Right. <br><br>The whole thing of someone bringing you food to your car window and having a drive in feel of eating your food. <br><br>Our food came in this nice size blue box. Trust me I wasn't disappointed at all with this place. I ate one time @ Sonic and it didn't have the same appeal to me. <br><br>I guess by me being an old school head. I just love the original look and feel of it. Too many changes can ruin the brand. If it isnt broken don't try and fix it. <br><br>Wait oops I forgot to mention Super Dawgs have tables outside where you can sit outside of your car and enjoy the weather.<br><br>I will be returning again. The next time will be @night. I want to see how it will look with the lights on around this place.<br><br>Super Dawg even gave me a 20% off deal on my next visit. Great food & Great Customer Service is always a plus on my list", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zN95K7G2ViyUQ6na7jexnQ/348s.jpg", "caption": "Your Food Comes In A Nice Cute Blue Box"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Uysfj1x2fDUnq4zZMdVsKw/168s.jpg", "caption": "I Love Great Customer Service"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gCHkMsOhbQUqSVxQ7zbHjw/168s.jpg", "caption": "Hot Dog & Yummy Fries Dime Size Onion Rings"}]}}, {"review": {"des": "Great great hot dogs. Been going when I can. A true Chicago experience. No ketchup. LOL it's totally worth going to 100%. No dining inside. But they do have service that comes to your car which is awesome!", "pics": null}}, {"review": {"des": "Best hot dogs ever! Like EVER!! The pickled tomato is a bonus! This is a must go to spot when in Chicago.", "pics": null}}, {"review": {"des": "Love this place but the prices of food is expensive!! 1 hot dog is $6.00 with fries. Expensive!!", "pics": null}}, {"review": {"des": "The food was terrible! I'm sorry to say the concept is a really good idea. I would not go back", "pics": null}}, {"review": {"des": "horrible visit this time around.everyone in the back was talking and had no clue 3 people were standing at the counter waiting to order.i ordered a simple whooskidog with raw onions and everything bbc sauce on side.order came with a raw polish and literally 12 fries.went back to the counter to show the girl,no sorry or anything just tossed me a whole order of fries.finished my meal,took my garbage to the garbage can,filled over the top not a drop of room for anymore garbage,told the girl at the counter,said not one word.the whole staff looked fairly young.rwally think im done here!!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Yfu7yHYnWg5C4qXw2MnK7A/168s.jpg", "caption": "garbage overflowing.i told employee she just stared into space."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Y5ezbM_Tkpg31BV48UXjTw/168s.jpg", "caption": "order came with this many fries..horrible"}]}}, {"review": {"des": "I loved this place! We ventured out on a Friday night to Superdawg. The food was great and I loved the outside seating area. 10/10", "pics": null}}, {"review": {"des": "Superdawg has a very special place in my heart, and after reading some negative reviews I feel like I need to help clear some things up for those who've yet to try it out. <br><br>PRICE: Yes, a superdawg with fries and all the fixins' will cost you $6.15 and I suppose this outrageous price has gone up since, oh, 40 years ago? I'm sorry but when we're paying almost that much for coffee, I'm not going to die over it. Not to mention, Gene & Jude's AND Portillo's cost about the same (G&J a bit less, but their fries are questionable). If you're really hard-up, there's usually a Groupon. You're welcome local complainers. <br><br>LITERALLY HISTORY: I remember coming here as a little girl with my dad, who raved about coming here when HE was a little guy. For those who grew up in Chicago, this place carries a lot of memories, and an occasional soggy bun isn't going to ruin the spirit of this place. Especially considering the drive-in style restaurant is a dying theme. <br><br>TOURIST?: If you've never been to Chicago before, come here. Yeah Portillo's is good (all 30+ locations, so doesn't feel that special anymore), and Gene & Jude's is definitely quirky and has just as great history (but technically a bit of a longer drive if you're coming from the city, and their menu is a whole lot smaller). But regardless if you're a tourist or local - this place is a legend!", "pics": null}}, {"review": {"des": "Love the hot dogs. Burgers and chicken sandwich are great also. You have to try that green tomato", "pics": null}}, {"review": {"des": "Awesome retro environment! I was actually impressed! Really sets a chill mood for a bite to eat with some friends/family (family friendly environment).<br><br>Food was okay, I had a cheeseburger with some fries, I enjoyed it.", "pics": null}}, {"review": {"des": "Superdawg was the first meal we had in Chicago after a 4.5 hour drive in from Michigan. We came in on the recommendation of a Chicago-native who swears it's the best \"Chicago-style\" hot dog in the city. It's definitely far from the main city area and not in a scenic neighborhood at all.<br><br>But I have to admit, it was a pretty darn good hot dog. We both got their Superdawg, which is a beef hot dog served on a poppy seed bun with golden mustard, tangy piccalilli, kosher dill pickle, chopped Spanish onions, and hot pepper under a handful of Superfries.<br><br>For $5.90, I think it was a really good deal. We were both super full from the hot dog, which was juicy and tasty. Service was quick and efficient - they really have their method down pat.", "pics": null}}, {"review": {"des": "When I was little, we used to always stop at Superdawg on the way home to the suburbs from any exploring we did in the city. And I always remember loving the burgers and shakes. So it was high time to come back and see if it was as good as I remembered.<br><br>Spoiler alert: it was everything I remembered it to be. <br><br>Ordering food and eating it in the car was always a fun treat and it was fun to do it again. The Supercheesie is a delicious cheeseburger and I love all the onions and relish and hot peppers. French fries are thick crinkly cut fries that are crunchy but still soft. Vanilla shake was thick and creamy and perfection. <br><br>Overall I definitely enjoyed stopping here.", "pics": null}}, {"review": {"des": "Decent hot dog joint. Love the drive through. It has great appeal. I like how they box everything. It has a  50s style approach, which is cool. Dogs aren't Vienna. They taste like Paulina market dogs. Either way they are tasty. Don't really like the fries. All in all this is a good place for a quick meal.", "pics": null}}, {"review": {"des": "Great services and great food. It's a little tricky to get in and out of, but it's worth the wait. <br><br>Make sure you make room for a big order! And bring some music or conversation for the wait. <br><br>Highly recommend a cheese dog with cheese fries as an option if you do not want a Chicago style dog.", "pics": null}}, {"review": {"des": "What a classic place with amazing whole some food.  I love good service and hot dogs.  This place has both. Do yourself a favor and roll thru to this spot when in Chicago.  It is a really cool spot at night, and it was really packed.  There were loads of cars and it didn't affect the speed of when they got the food out and how quick they were. Let's just say they were very accommodating as we kept adding items to our order and was able to bring it out with the same type of speed.  The staff couldn't be friendlier.  A Drive-In with 5 stars?, yep!", "pics": null}}, {"review": {"des": "Food is four star hot dog stand fare. The prices are a little ridiculous. There are many hot dog stands with the same or better offerings in Chicago. What you are paying for is the tourist attraction drive-in.", "pics": null}}, {"review": {"des": "Diners, Drive-ins and Dives sent me. I'm starting to think anything that's featured on the food channel is payola. I wasn't impressed at all...the Superdawg what they are no for was ok! I found a hair in my French Fry...I'll pass. However the cherry on top was the customer service...Rude with a capital R! Basically yelled at my 13 year old nephew about ketchup. Alonso don't have multiple orders in one car...it confuses the staff. So it's a no for me.", "pics": null}}, {"review": {"des": "Giving it 5 stars because I don't like hot dogs!  But will come again here.  The dog meat is flavorful and real meet.  Loves the garnishes... pickles, pickled tomatoes, and the sport peppers. Will come again!", "pics": null}}, {"review": {"des": "My absolute favorite place in the city for city style food. The hotdogs, burgers, and fresh cut crinkle cut french fries are all amazing. They also have cool merch to buy as well. Chicago Staple.", "pics": null}}, {"review": {"des": "I wanted to give 3.5 but since that's not an option I'll go with 4. I really do love this place and we come here a lot. The drive-in is such a fun experience and they have the BEST vanilla shakes. The hot dogs are also usually very delicious. My only complaint is that sometimes their fries and onion chips have sometimes obviously been fried in oil that needs to be changed :( I went today and the onion chips were extremely greasy and a darker color than usual. And some of the fries were more like potato chips that's how crisp they were. The same thing has happened with their chicken strips, got those once and they just smelled like old oil. Doesn't really inspire much confidence so I hope they work on that but overall it is still a great place to come and eat!", "pics": null}}, {"review": {"des": "Go ANYWHERE ELSE for a hot dog. What was served in their drive thru box: Trash compactor fries and hot dog bun. Greasy fries smashed into a glob. Hot dog bun soaked from pickle juice. Both inedible and crammed together. Either serve less quantity or buy some bigger boxes, for heaven's sake. Shame on you. Super Dawg should be humiliated for serving this mess to any customer. Meat dog was good. Big deal. Meh. $6 is robbery. Shockingly unacceptable food presentation. I will never return.", "pics": null}}, {"review": {"des": "Just a few blocks away, I typically eat here two or three times a year, consider it very good with some interesting quirks (neon green relish, pickled tomatoes). And of course the place is historic with a fantastic exterior, can't say much for the walk up window but the abundance of drive in stations is quite cool and unique. I've always considered Superdawg just a little overrated from a cost  to quality perspective, but do eat here often. I had the Super Fish sandwich today, they were quite busy and the order did take a little longer than usual. I did realize that taking the meal home would result in some loss of quality but to be honest the french fries seemed a little colder than what I would expect for this type of carry home experience.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AeynmIX6QCU5Whx4RPAgMQ/348s.jpg", "caption": "Pickle & Tomato"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YfsoDoIkW6QrvSB3mctGRA/168s.jpg", "caption": "French Fries"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/peohye0LatbAphe5jZWmpw/168s.jpg", "caption": "Fish Sandwich"}]}}, {"review": {"des": "Classic spot for quick hotdogs and burgers.  Didn't disappoint on either front.  A little black cow to finish off the meal.  Must try if you have not been.", "pics": null}}, {"review": {"des": "Love both locations <br>Been going to one on Devon for years<br>Best dogs and fries in little boxes <br>It's my treat to myself when I need a boost", "pics": null}}, {"review": {"des": "Best fries in town. Supercheesie great.  They have several deals throughout the year and are very great full to veterans.", "pics": null}}, {"review": {"des": "Over rated and definitely over priced for what they surve for food, it's good and tasty but once a year treat is enough for me.", "pics": null}}, {"review": {"des": "Fact: The Chicagoland area has more hot dog locations per capita than any other place in the world!<br>Fact: Mory and Florie are the most popular mascots in Chicago. Well ok this might not be an official fact but come on, how many restaurants can you think of have a couple of popular mascots on their roof?<br>I grew up eating Chicago hot dogs. They're part of my food group. I've had more hot dogs in my day than any doctor would approve, but what do they know anyway? My favorite dog is the Superdawg! The Superdawg really is legendary. Its a bigger dog than the normal Chicago dog. I also like that it comes with a slice of green tomato which is juicy and acidic. Your Superdawg comes in the perfect little box with your fries packed with your dawg. What really makes this work is the fries are still crispy and not greasy. The bun stays soft and the whole package is just perfect. Or if you care to indulge, go for 2 packages. Another benefit to Superdawg is its a classic drive in. Not too many of those around anymore. Unconfirmed by me, but my wife says their chili is some of the best she has had anywhere. For me it's all about the Superdawg!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yseZOgH3fjrX0S1KPuhuWQ/348s.jpg", "caption": "Mory and Florie"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LzK-ofUDBhXLujQsJ4CG_g/168s.jpg", "caption": "Love this"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-huwI4HT9GUVveSFlv5ToA/168s.jpg", "caption": "Crispy fries"}]}}, {"review": {"des": "Best ever. Love the dogs. Love that they're nestled in fries. Love the little boxes they come in.  Are you kidding me? Five stars aren't enough...", "pics": null}}, {"review": {"des": "\"Soggy dog\"  this place is overrated food cramped in a box smaller then a happy meal it's just an overpriced  soggy hot dog", "pics": null}}, {"review": {"des": "Great place to sit eat and chat in your own car specially when you are super lazy after long day work. My favourite picks are obviously the burger and the fish. Never went wrong with that. <br>Great ambience and good food!", "pics": null}}, {"review": {"des": "I'm no hot dog girl. I mean, I enjoy a hot dog every now and again but you should probably read the other reviews if you are real hot dog lover. <br><br>The outside has that old school drive in feel that brings you back in time. But it's smaller than you would think. The goofy rooftop hot dogs are pic-worthy. <br><br>Your hotdog comes smooshed in a box. With all the toppings. Spilling over. The toppings just had too much going on. Way way too much. The buns were lethargic. The beef itself is actually really good. It's good beef. But the allure of beef alone doesn't make a hot dog all good. <br><br>We went. We checked the box. I'm good.", "pics": null}}, {"review": {"des": "I have been here maybe six times throughout my life and everytime I get the same thing - Superdawg with everything. There is no reason to order anything else (unless you are hungry and want extra I guess) because the Superdawg is Chicago style hot dog perfection. Worth the drive to the middle of nowhere to get one too. For real, this is no joke.", "pics": null}}, {"review": {"des": "Classic drive in style eats. Cute boxed presentation, colorful branding, and delicious flavors. A must try, especially for all you nostalgia seekers.", "pics": null}}, {"review": {"des": "Fun drive in with tasty hot dogs and fries. We got a superdawg and a whoopskidawg (polish sausage with house sauce and onions). Both were tasty and came with a bunch of crinkle fries.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bRbHXOu4yQc5YvoAPMXQEQ/168s.jpg", "caption": "Superdawg (buried under lots of fresh fries)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rphw23BVYVB9Cz84oEwDZg/168s.jpg", "caption": "Whoopskidawg polish sausage with house sauce"}]}}, {"review": {"des": "I think this place is overrated. Dogs are ok. Nothing to pay an arm and a leg for. I think it's more about the experience and the nostalgia of the place and being served in your car. Other than that, I've had better food.", "pics": null}}, {"review": {"des": "I knew this place from the foot network show and I always wanted to go to this place.<br><br>Finally after a long transit, I got here. This place was a little smaller than picture. You only can only for superdawg with different toppings. I had one with everything. But here comes a problem- once you put too much things then it made the bun fall apart. So it was a little difficult to eat.<br><br>Taste-wise, i don't really see any different from other hot dog I had before. Maybe the hot dog was a lit bigger and tasty? I am sorry but anyway I made my stop here for this Chicago style hot dog!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3IJYtk-HTpJ-4v2_2CxJNw/348s.jpg", "caption": "Superdawg with everything and you can't even see the dog!"}]}}, {"review": {"des": "Another great spot to add to my routine of places to eat when visiting Chicagoland to stuff my face with classic Chicago foods.", "pics": null}}, {"review": {"des": "Went there got tge superdawg was awsome. The right amount of toppings. My girl friend had the whoppsiesauage. Was really good.  Ate in the small dinning room", "pics": null}}, {"review": {"des": "Yum! Loved experiencing a Chicago style dog. They are super delicious and I didn't add ketchup even though I normally add heaps of it. These are really tasty. We ate at 11pm at night after a long drive and the service was prompt and friendly. They do jam the food quite tight into a small box but it still tastes the same and is the perfect serve size. I do applaud them for using small cardboard food boxes which are better for the environment.", "pics": null}}]}