{"name": "sushi-taku-chicago", "reviews": [{"review": {"des": "This is hands-down the best AYCE sushi in Chicago!<br><br>We have gone many times in the last year (usually after going to the gym to prepare for the feast) and have not been disappointed. Sushi Taku offers a large selection of appetizers, sushi rolls, nigiri, and even dessert. We have tried most items on the menu, and while I didn't necessarily love every single item, there is plenty to choose from to avoid the misses. Here are some of our favorite items.<br><br>Appetizer/Salad: chicken karage, softshell crab, seaweed salad, sashimi salad<br>Nigiri: all are very fresh and served with very little rice<br>Signature Roll: sunny roll, fire phoenix roll, sake roll<br>Dessert: you have to get a mochi ice cream! (limit one per person)<br><br>The get packed during the lunch and dinner hours so I highly suggest coming at an \"off\" time. It will also take longer for your orders to arrive during this time so just be aware. We have been pretty lucky to find free parking on the neighboring streets but there is also metered parking on Division.", "pics": null}}, {"review": {"des": "My friend took me to Sushi Taku for a Saturday lunch one day. The service here is super friendly, and tends to get a little busy throughout the day. The pace here at the restaurant tends to be on a faster pace, however, the rolls can take a while depending on how busy they are (typical). They have a fairly large selection of appetizers, nigiri, sushi rolls, and desserts. Though I felt like some of the rolls I found were a little repetitive, and very similar to each other or just drenched in sauce - that being said I haven't tried all the rolls there yet. There wasn't anything stellar or amazing about the sushi at this place, hence the minus one star. I did enjoy the food, but it's really a typical AYCE sushi place like many I have been to.  <br><br>However, the best highlight at Sushi Taku is definitely the Mochi Ice Cream - unfortunately, it's only available one per person per table. I managed to get two since my friend didn't want hers.", "pics": null}}, {"review": {"des": "I've heard so many good things about Sushi Taku and was so excited to try it. I came with my family (5 of us) for dinner on a weekend night and there were a few open tables.<br><br>We all opted for AYCE sushi (because why not?). Many of the rolls seemed to be covered in sauce which I dislike. The fish didn't seem that fresh and at the end it was just painful to keep eating (my fault since I over ordered). The best thing we probably had was the sashimi salad.", "pics": null}}, {"review": {"des": "You tryna eat or YOU TRYNA EAT? <br><br>Sushi Taku is all you can eat (AYCE) sushi, so come prepared! Whether it's hitting that hard gym session before or going for a long run, do what you must to come here hungry. They got everything from appetizers to sushi to rolls (regular and specialty) and even dessert.  Wouldn't say I'm an expert in sushi by any means, but you can tell the seafood is fresh and won't make you sick.<br><br>While I've been here a handful of times now, I gotta say I'm a fan. From a price point expect to pay $24.99 during dinner hours or weekend and $18.99 during the lunch hour on weekdays (M-F). Initially the first few visits service I found to be quite slow, but on more recent visits this has definitely been much better. Parking can be found for free in the surrounding neighborhood, but you might have to circle once or twice. Lastly, no reservations for this spot. First come first serve, so plan to come accordingly before or after the rush if you don't want to wait. <br><br>That's all I got on this one. 'Til next time, cheers!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gSY9fx8NGuPbJ2Rdxar9bQ/348s.jpg", "caption": "Specialty rolls"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6J1BrnxrXzcOHXuAGcaWrw/168s.jpg", "caption": "Soft shell crab, seaweed salad, and some fried oysters in the back for appetizers"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YMDlWFY09Gm-wTjrqinotw/168s.jpg", "caption": "Diet starts never #ayce"}]}}, {"review": {"des": "I don't think any AYCE places really deserve 5 stars. <br><br>That being said, I agree with other Yelpers that Sushi Taku is probably the best one in the city! The reason for no 5 star love from me is that how can you expect the quality of fish and sushi from an AYCE spot to compare with a standard sushi restaurant? I don't and go knowing it won't be the same. But like going to a buffet, you get more bang for your buck and leave super full always. <br><br>My favorite apps are the sashimi salad and baby octopus salad. I love fried oysters, but I don't like the ones here. They're huge and super mushy. It comes with spicy mayo sauce and that helps a little bit. My favorite rolls are spicy 2-in-1 and spicy crispy tuna. I do not like spicy food and I can handle both. In fact, I don't think are really spicy at all. Just FYI. They only have 3 dessert options, and limit you on Mochi. The fried banana is not particularly crispy so I don't recommend it. <br><br>Tonight I went around 8pm, and they close at 10. Maybe it was because it's Sunday but I got lucky and there was no wait. Last time I had to wait 45 mins which is average here. I will try this time slot again for next time. The place is clean, the service is good. Nothing spectacular, but that's ok. I will definitely be back when I want unlimited sushi.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Yth3vh7akc-VqhNAxf6wCA/348s.jpg", "caption": "4 pieces of nigiri and Angel Hair roll"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QgUJB5NuCJ_l9ijcDoHOIw/168s.jpg", "caption": "Spicy crispy tuna. Tuna is on top and inside is tempura crunch, cucumber, and one sliver of jalapeño."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bF7r0ANdrdh346Vrb0SzjA/168s.jpg", "caption": "Spicy 2-in-1 (spicy salmon and spicy tuna)"}]}}, {"review": {"des": "All you can eat sushi definitely has it's sketchy stereotype but this place was so yummy!!! It was very clean when we walked in and packed. The service was so quick and everything tasted really fresh. Great bang for your buck", "pics": null}}, {"review": {"des": "I came here with a large group on a Saturday night. We made reservations so it wasn't a problem to get seated. Note that everybody has to be there to get seated.<br><br>I didnt have a bad thing at this AYCE sushi place. I enjoyed the sashimi salad, fried oysters, jalapeno bomb, seaweed salad. All the rolls I had were good and they also had cooked ones which is good for people who don't  eat raw sushi. The rolls don't have a ton of rice so you don't feel crazy full.<br><br>They have beer, wine, and sake. BYOB on wine with a cork fee of $10. <br><br>For dessert, they have ice cream, mochi, and a tempura banana option. Save room for dessert if you can! AYCE in 90 min!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5dFDrcQKUWdtAQpLq21oqg/348s.jpg", "caption": "Sushi boat"}]}}, {"review": {"des": "Went to this All You can Eat sushi place on a Sunday.  We arrived at 2Pm, waited for 30 minutes to get a table. If you have a flexible schedule, suggest that you go on a weekday. Sunday's price is $25 all day.  Other days have lower price for lunch.  Parking can be a challenge too. Some residential area parking are restricted from 6pm to 6am.<br>Place is trendy, customers are mostly younger people.<br>Likes: <br>-soft shell crab<br>-Fried oysters <br>-free choice of mochi ice cream for the AYCE<br><br>Room for improvements:<br>-They are using avocados, which is great ingredients, but coupled with the cream cheese, it was too filling, and too fatty/rich. They can use a little cucumber to provide a good balance and texture for the rolls.<br>-Too much imitation crabs, cream cheese used on the rolls, which I tried to avoid<br>-due to the ingredients are too similar, we feel like they all tasted the same, at the end you don't have impression on what you've eaten<br>-tempura was served kinda cold, the sauce didn't have flavor<br>-grilled muscle and grilled scallop served not so hot, actually a little cold<br>-wasabi didn't taste spicy<br>-squid salad was so so<br>-don't order tea, they charge $2 each. Order their miso soup instead.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IqfCCSvY_t3JcRJPrkXOIg/168s.jpg", "caption": "All you can eat menu"}]}}, {"review": {"des": "All-you-can-eat sushi that is good quality and offers a wide selection.  I am hooked for life.<br><br>I am not usually a fan of AYCE sushi because I just cannot eat enough to make it worthwhile and the quality is always less than desired. However, Sushi Taku was so worth it.  We had a large group of 15 show up before opening on Sunday.  The staff was initially cranky about accommodating our large group but quickly warmed up after we were seated at tables together. The staff was helpful with explaining how the restaurant worked and was patient while our group slowly decided what to order. The slips of paper were tucked into the menu stand and you just mark how many of each item you wanted. Nigiri was per piece just FYI. <br><br>Let's talk about the food now. The quality of sushi surprised me. The rolls were done well and it did not seem like there was too much rice which is common of AYCE sushi restaurants.  I really enjoyed the miscellaneous items they had on the menu that were not sushi like shumai, gyoza, and baked mussels. The sashimi salad and chicken karaage were my favorites though! Shumai was disappointing However, the winner was the nigiri. We ordered platters upon platters of nigiri and the quality did not diminish with each round.  We mostly got tuna, salmon, smoked salmon, and unagi and it was all so so so good.  The cuts were generous and preparation was consistent. <br><br>Overall, my group had a great time and left with very full bellies. We are already planning our return.", "pics": null}}, {"review": {"des": "Came in on a Wednesday afternoon with my cousin to get AYCE sushi. <br>We went in and we didn't have to wait for a table and the restaurant was crowded as well. <br><br>The waitress was really attentive and she was friendly as well. I loved their appetizers and sushi. Their sushi was really fresh and although their uni wasn't part of the lunch menu it was really tasty. <br><br>I would come back again when I am back in Chicago for another round of all you can eat sushi.", "pics": null}}, {"review": {"des": "I was super skeptical about an All You Can Eat sushi place (something I just don't think sounds all that appealing) but Sushi Taku really pleasantly surprised me. <br><br>I love that Miso soup, edamame, and tempura are included in the AYCE - three of my favorite items to have before sushi rolls. Eel is my favorite sushi roll item, so I typically judge places based on those rolls, and Sushi Taku did not disappoint. The Dragon Roll was fantastic - I had two! <br><br>I don't eat nigiri or sashimi, but my friend said it was great and ordered seconds. Lunch is $18.99; Dinner and Weekends are $24.99. You can add on beer and wine as well. <br><br>I will definitely be back - I understand why this place is so crowded all the time!", "pics": null}}, {"review": {"des": "This place was pretty busy on a saturday night. the wait was about 40 minutes but it was well worth it! i love all of the appetizer choices they have. They were all delicious! My favorite was the fried calamari, sesame ball, takoyaki, and the fried gyoza.<br>The sushi menu was very easy to order, you fill out the paper and get a new one if you want to order more. They had a lot of options for nigiri and special and regular rolls. i like how some gives you the option to get half rolls.<br>The wait was a little slow, but i get it it was busy. We got mochi ice cream at the end and it was yummy. <br>I would defiantly come back if im ever in chicago again", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zHQ3M4vKR0Un-V8qJOkyDw/348s.jpg", "caption": "Nigiri :3"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pUk6O_ygv1WqzQ1B29YlQQ/168s.jpg", "caption": "They meant to put HBD"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5Fwcw8lkyoZiyxNAO5z73Q/168s.jpg", "caption": "All our appetizers:)"}]}}, {"review": {"des": "Word to the wise: if your eyes are bigger than your stomach, you'll be charged for food left over! <br><br>Sushi Taku was a poppin' all you can eat place. Very popular, servers were everywhere doing their best to accommodate so many people and orders. I think the tough part is that the space is small for the servers to maneuver and be efficient- I felt bad. <br><br>Also, it takes a little bit for their rice and tea to brew- again, likely due to space limitations for people to make all this sushi and tea. But I digress. <br><br>I did not order AYCE- I ordered the  nigiri: White tuna, yellow tail, octopus. Delicious!", "pics": null}}, {"review": {"des": "Came here because a friend recommended it for all you can eat. <br>They're in a fun neighborhood which is good because they are usually packed so while you wait you can grab a drink nearby and they'll text you when ready.<br>Nice clean restaurant. Ordering is very easy and menu has great variety.<br>Not used to seeing so many specialty rolls for AYCE sushi. Apps and most desserts are also included. Definitely my top pick whenever I want to feel like crap from too many rolls.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NaiR6-Hz689Be_To-VBe_A/168s.jpg", "caption": "You won't be disappointed. Actually, you probably will be. In yourself. When you eat too damn much."}]}}, {"review": {"des": "Awesome AYCE sushi spot in Wicker Park. I've tried a few AYCE sushi places in the city and the food tends to be pretty average but this place is incredible. For $25 per person, you can try unlimited appetizers, specialty sushi rolls, AND dessert. My favorite appetizer was the shrimp shumai (couldn't stop ordering this) and crab rangoon. All of the sushi rolls were delicious except one of the tuna rolls, I believe it was called 2 in 1. My girlfriends and I went a little crazy with the sushi but were able to finish with a little bit of difficulty. Keep in mind, they charge you for any unfinished sushi. Despite how stuffed we were, we ordered mochi ice cream for dessert and it was literally the best mochi I have ever had!<br><br>Only downside was the wait time. It was a busy Saturday evening and took over an hour to get seated. However, the wait was totally worth it and I would definitely go back. Shout out to our super nice waitress who gave us extra mochi even though the limit is one per person.", "pics": null}}, {"review": {"des": "SASHIMI-SAN<br><br>It's a nonstop sushi extravaganza at this place in Wicker Park.<br><br>After insisting that we try a new AYCE spot that wasn't Oishi Sushi (in Willowbrook), my girl found this awesome restaurant on Division St where we ate on 8/10/18.  Parking isn't easy to come by, so I'd recommend trying to find something along Walcott Ave.<br><br>Being that it was a Friday night at 7:30, the joint was packed.  We were a bit late for our reservation and lost our table, so they sat us at the sushi bar instead, which was fine.  Once seated, our server explained the house rules (thanks lady, but this ain't our first rodeo).<br><br>We began with a bottle of hot sake -- okay, two -- and perused the menu.  As with most all-you-can-eat sushi places, you mark your choices on a card but have to eat *everything* that gets ordered.  Our selections were:<br><br>for starters...<br>+ 2 miso soup + 1 house salad + 1 order of edamame<br>+ 1 order of gyoza (fried potstickers {6pc})<br><br>for a main course...<br>+ sake roll (avocado, spicy salmon {8pc})<br>+ sapporo roll (crab, cucumber, topped with tuna tempura crunch & spicy mayo {8pc})<br>+ green turtle roll (white tuna crunch topped with avocado & wasabi mayo {8pc})<br>+ spicy crispy tuna roll (cucumber and jalapeño topped with tuna, cilantro & ponzu {8pc})<br>+ salmon sashimi, shrimp and tuna nigiri {2 each}<br><br>for dessert...<br>+ tempura banana + mango mochi<br><br>All things considered, they were pretty fast in bringing out orders.  The maki rolls were delicious and the spicy crispy tuna roll packed LOTS of heat.  Starters were light, the desserts tasty, and the hot house sake priced very fairly.<br><br>Bread = 5<br>Circuses = 4.5<br><br>Service was great and the atmosphere was pumpin' with trendy music, making it lots of fun to people-watch.  All of the sushi was high quality; factoring in all the options for specialty rolls & appetizers, $25 per person is an absolute steal.<br><br>* TL;DR *<br><br>Sushi Taku is perfect for a double date, assuming everyone in your party LOVES sushi and can eat a f*ckload of it.  They offer BYOB but the corking fee is $10, so keep that in mind.  I'd definitely return again at some point, since both my girl and I can eat our weight in nigiri/sashimi/maki.<br><br>So sushi.  Belly full.  Much recommend.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WT-Ow4lBV412fPC8_UxODQ/348s.jpg", "caption": "This AYCE place on Division St (in Wicker Park) makes high quality sushi at a very affordable $25/pp!!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8Akd8US07pOv3ayCfyF4tA/168s.jpg", "caption": "Tempura banana and mango mochi for dessert!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jIY_NI2gr-ieXMXo4lBp0Q/168s.jpg", "caption": "\"Sapporo roll\" (crab, cucumber, tuna tempura crunch (top left)) and \"sake roll\" (Spicy salmon, avocado, topped with salmon (bottom right))"}]}}, {"review": {"des": "I've done my fair share of AYCE sushi spots around Chicago, but I'd have to say temper your expectations. The hype is a bit much.<br><br>Sushi Taku is always boomin' with biz even on a Wednesday night in which I saw a 30 minute wait for a table of 4. Fortunately they have a nice waitlist system in which you provide your number, and you can check your spot on the list.<br><br>If you order the nigiri or regular rolls, the fish is prepared fresh and colorful. Good sign! Unfortunately, all the rolls (nigiri, regular, signature) are made with too much rice, which take away from the experience. Seasoning of the rice itself was barely there, and the wait between orders can be LONG. Try 30-40 minutes between rounds.<br><br>Service is friendly, and the place is great to eat inside or out. It's in a trendy area, so have a walk around before and after you eat.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/H7-hhvSNVrNQrJidfMa5nQ/348s.jpg", "caption": "Regular rolls"}]}}, {"review": {"des": "Best value in AYCE sushi I've had, and trust me, it's worth the long wait.<br><br>I've eaten at Sushi Tokoro a couple times and compared to Sushi Taku, it just pales in comparison. Taku doesn't stuff their sushi with as much rice as most AYCE places. <br><br>Their rolls and appetizers are awesome, but the freshness of the raw fish is sometimes a hit or a miss. I personally thought that it was decent, but not great. <br><br>If you're a sashimi or raw fish person, you may not be a happy camper.<br><br>Service is splendid! Although it gets packed, the wait staff is very patient, kind, and attentive. <br>----------------------------------------------<br><br>Appetizers -- 4 / 5<br>Their appetizers are really good and are served in a reasonable amount of time. I loved the dynamite, gyoza and tempura. The octopus salad is also good, and I prefer it much more than their sashimi salad. I'd skip the Hamachi Kama since the one I got was burnt and reeked of charcoal, but maybe I just got a bad one. <br> <br>Rolls -- 4.5 / 5<br>I also really like their mango tango, fire dragon, and caterpillar rolls. They're tasty and the rice tastes great. Regarding the Godzilla roll, order AT YOUR OWN RISK. It's massive and my group of 8 had a difficult time finishing it. <br><br>Nigiri -- 4 / 5<br>Again, the raw fish is decent, but not terrific. I'd say that their salmon and mackerel are good, but I wasn't that impressed with the others. My go-to are the inari (tofu skin), tamago (sweet egg) and unagi (eel). <br><br>Overall, if you're a rolls and appetizers kind of person when it comes to sushi, you'll love Sushi Taku!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DoCBRg9t1uChJIoVG-ZpvA/348s.jpg", "caption": "If you order enough, it'll come in a sushi boat!"}]}}, {"review": {"des": "This was the first time I've been to an AYCE sushi place, but I still prefer some of the other sushi restaurants in the city (i.e. Lawrence Fish Market and Sushi Joon). For $24.99 per person before tax and tip ($18.99 for lunch), I question how fresh the fish are here.<br><br>You'll need to be a bit strategic on how to order if you want to get the most bang for your buck. We tried to order as much as we could handle in the first round since it takes time for them to put in and bring the order for subsequent rounds. They also charge you $0.50/piece or $1.00/piece if there is any food left over.<br><br>Nigiri is the way to go if you want to get your money's worth! For nigiri, the eel stood out the most. In addition to nigiri, I also ordered the Crazy Kani Roll just to try it out. It tasted okay and wasn't that spicy despite the chili pepper symbol next to the name on the menu. If you HAVE to order appetizers, the chicken karaage, hamachi kama, and baby octopus salad were decent. For dessert, I tried the tempura banana. It tasted heavily of bananas and wasn't crunchy at all. I would pass on this dessert.<br><br>You're able to split the check and use multiple credit cards, which was nice. It came out to $32.06/person after tax and tip. They were also able to accommodate a party of 15, but you have to all be present in order to be seated.", "pics": null}}, {"review": {"des": "Best AYCE sushi I've had in Chicago, and I used to frequent Sushi Para a lot. Try to go for earlier lunch since it's a little less busy during that time on weekdays. This place has a lot of appetizers and interesting rolls to try. Food is great. My fave apps are their sashimi salad, seaweed salad, fried calamari, sesame balls. As for the rolls, I don't usually remember the names so all of them are good to me. It's also BYOB and easy to find street parking.", "pics": null}}, {"review": {"des": "IMO - this ayce Sushi buffet offers the best appetizers selection (eg sashimi salad, Hamachi Kama, jalapeño bomb) and they offer ice cream/mochi<br><br>The Sushi selection is good as well!  My favorite from this place is their scallops nigiri.  Highly recommend you go with your friends so you could try out different rolls<br><br>Tips:  <br><br>A) they take reservation for party of 6 or more<br>B) they could make em into handrolls if you don't want to share..lol", "pics": null}}, {"review": {"des": "When I heard of another AYCE sushi spot in wicker park I was wondering what they might do differently from the other spots around, to stay competitive. I would argue they blew the competition (if there ever easy any) away! <br>Their fish tastes fresh, the appetizers are crazy delicious and the options are endless. I love their takoyaki and never miss ordering the sesame balls. <br>They even offer dessert in their AYCE option! Mochi ice cream!!! This is my new favorite AYCE sushi spot in the city!<br>I do recommend coming here with a larger group of people as their sushi rolls are massive and if you want to try a variety it's best to be with a larger group of people.", "pics": null}}, {"review": {"des": "Went for the first time last night!! Must have gotten there at the perfect time because right after being seated immediately the whole place filled up and a line out the door formed. <br><br>I usually go to Sushi Para II for all you can eat but was told about this place by a friend. Slightly more expensive than para but I have to say the overall experience was much better. The sushi is a better quality, the atmosphere/restaurant interior is much nicer, and the all you can eat menu includes appetizers, salads, sushi, and desserts! <br><br>This will be my new all you can eat place from now on!", "pics": null}}, {"review": {"des": "This is my new favorite all you can eat sushi spot! The wait time is a bit long and service is a bit slow. With that being said, the sushi was incredible. They have lots of creative Makis to choose from. We were happy with our appetizers, rolls, nigiri and dessert. If you're feeling hungry, I would recommend Sushi Taku. We got our moneys worth. The only reason I didn't give this place a fourth star is because between the appetizer and main course, we waited about an hour. If we're comparing this place to Sushi Para... I would say the sushi grade is comparable but the service is better at sushi para. Usually we're in and out of an all you can eat spot. We sat at Suhi Taku for 2 hours which is a bit longer than we would have liked.", "pics": null}}, {"review": {"des": "General: I'd like to start off saying that this place is top quality for all you can eat sushi places. In fact, the quality of this place contends with some fine/dining places that I have been too.  That being said, the wait time was fairly long for a Friday night and we ended up waiting for 1 hour and 45 minutes because of a mix with our reservations! The waiters and waitresses however are on top and the food came out in a timely manner without a lengthy wait, which made up for the long wait! <br><br>Atmosphere: Quaint, good for groups! Midsize with a bar. The wooden Japanese style lanterns on the ceiling a nice subtle touch to the restaurant <br><br>Food quality: the Nigiri was extremely fresh, especially the white tuna, which has this buttery smooth texture and melts in your mouth, and the rice ( dipped in soy sauce) adds a great savory contrast. The Dragon Roll was fantastic with tempura shrimp and eel. Super flavorful <br><br>Overall: This place is trendy among foodists on the north side of Chicago and  l cannot recommend this place more for those who are craving all you can eat Sushi.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mHDGn1criF0euPUNfFyR7Q/168s.jpg", "caption": "Sali-fornia Roll ( front ), dragon roll (back)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Yg_QorqDAvwmczq5nwvGbw/168s.jpg", "caption": "(Left to Right) smoked salmon, white tuna, salmon and tamago nigiri."}]}}, {"review": {"des": "Best all you can eat sushi spot in town! The quality of the fish is excellent, especially for an all you can eat (AYCE) place. The rice to fish ratio on their nigiris are so worth it, perfect amount of rice to a thick piece of fish!<br><br>Almost everything on their regular menu is on the AYCE sushi menu. I've been here several times and recently discovered some new rolls they added to the menu which were okay. The Sal-ifornia roll was okay, But I wouldn't get it again. The Fire Phoenix was pretty good but if you don't like wasabi then I wouldn't get it because there is wasabi mayo. <br><br>They have desserts on their AYCE menu.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qhXRED3LFdbtMCto-_Ee5A/348s.jpg", "caption": "Fire Phoenix Roll"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3DmH8ZA8HrzkuPxBlDA8Ew/168s.jpg", "caption": "Sal-ifornia Roll"}]}}, {"review": {"des": "Probably the safest bet to go with for AYCE sushi in Chicagoland. Prices are not unreasonable at $25 for dinner (Mon-Fri 4:30-10:30pm; all day Sat & Sun) and $20 for lunch (Mon-Fri 12-3:30pm). Out of all the times I've visited Sushi Taku, I would definitely plan on a 45 min - 1.5 hr wait time after putting your name down with the hostess (even for lunch on weekdays and opening). Reservations are only for larger groups (not sure on exact number). BYOB (but there is a $10 corking fee per bottle). Food quality and service isn't bad considering it is AYCE. Ambience is a bit loud between the blaring music, conversations and waitstaff bustling around. <br><br>Recommendations:<br>Apps- Soft shell crab, chicken karaage, hamachi Kama (dinner only) and fried oysters<br>Sushi- Salmon nigiri, unagi nigiri, White tuna nigiri, dragon roll, sake roll and spicy 2 in 1 roll<br>Dessert- Green Tea mochi and/or ice cream (dessert only for dinner AYCE pricing option)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/13E4QdHu-Yi0RKkEVAqqKQ/168s.jpg", "caption": "Lunch and dinner AYCE menu/options"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Pc0Ikj83E6itHoh3riRYSw/168s.jpg", "caption": "Chicken karaage"}]}}, {"review": {"des": "This place is really top notch. Came on a weekend and AYCE was $25. We were seated pretty quickly, and they have a lot of space in the restaurant. <br><br>They have a lot of appetizers you can try. The miso soup is not good, but everything else is fine. We ordered a ton of salmon nigiri and it's pretty quality. The unagi, tuna, and smoked salmon are really good, too. The sake roll is really good!! I would not recommend the godzilla roll, as it is pretty huge and fills you up too quickly. All in all, very good selection and safe to choose most of the rolls and know that they will be good.<br><br>Also very happy that they have mochi, too! The AYCE comes with one mochi per customer. You can still get unlimited banana tempura and ice cream, though. Very good!! In terms of quality, this is one of the best AYCE sushi places I've had in Chicagoland.", "pics": null}}, {"review": {"des": "After reading some of the other reviews, I do agree that the service is probably the biggest pain point for this place. However, I have only been one time and it became extremely busy about 10 minutes after we were seated. I think what people fail to realize is that AYCE sushi is a ton of work on both the chefs and the servers. And, it's not just AYCE sushi, it's AYCE apps, salads, dessert, and sushi! So all that being said, my wife, mom, and I went here for dinner before dropping my mom off at the airport. Found free parking down one of the streets. We came right around 5pm on a Saturday to try and avoid the rush because we knew it would be really busy closer to 6. We were seated immediately. Sushi and appetizer selection is expansive which is great. Wish I would have tried more apps and will definitely have to when we go back. Now the Sushi. I have lived in San Francisco for a little over 2 years, and they have very fresh sushi. However, it is $24.99 for 2 rolls, maybe three if you find a cheaper place. So I am okay paying $25 for AYCE sushi that is still pretty good. I do tend to put spicy mayo or something on it, which maybe masks the fish smell, but I thoroughly enjoyed it. And the ice cream with friend banana and one mochi ball was the best finish. So needless to say, my wife and I will be going fairly often since I have yet to find another great sushi spot in the city. Definitely try it out and try to go in with an open mind for a longer dinner and just relax and eat.", "pics": null}}, {"review": {"des": "Review # 31 out of 365<br><br>This place is incredible. For a little over $20, I get AYCE nigiri and rolls. I recommend you start with nigiri, if you are fan. I think they have at least 20 different choices. I love the usual choices, salmon, tuna, albacore, eel and egg. It's hard not to order too much. Be careful not to get to full. <br><br>They have a lot of roll choices. I think the rolls are second to the nigiri. I always order sesame balls and for dinner you can get a tuna collar. <br><br>The wait can be brutal so we try to come on off times. Lunch is cheaper if you can come and it's usually less busy. There are only canned soda and bottled ice tea if you are looking for non-alcoholic drinks. <br><br>Again reiterating if you don't eat what you order, they can charge you. We did this once and had to keep eating, never again! The wait is worth it.", "pics": null}}, {"review": {"des": "The food was outstanding. Service was great and the wait was decent for a Friday during the dinner rush. <br><br>Sushi tasted exceptional and was well prepared. BYOB is a plus as well and the pricing was fair I thought. Defs coming back in the near future.", "pics": null}}, {"review": {"des": "Went here on Saturday evening on a beautiful day in Chicago. The waiting made me feel like it was a bad idea. We waited over an hour thank goodness for technology, they text you when your table is ready. Also thank goodness for all the bars in the area within walking distance of this place drinks galore.<br><br>After finally being seated in the out door table we requested we reviewed the menu. AYCE is only goof when you have a good appetite and you can eat a lot. What sucks is that when you get the AYCE you are charged per piece of what you don't eat. You can't share with someone you are with if they don't have the AYCE. So many limitations.<br><br>My BF got the AYCE. He ordered crab ragoon, edamame, calamari and eel. Then he ordered the California roll, Mexican roll and the Philadelphia roll. I did not order AYCE because I get full fast. I ordered the Volcano roll. I have to say the food was great. The rolls are huge! <br><br>What I like most about them is the variety of items offered. If you are like me and you only eat cooked sushi they have a ton of options. And the food comes out at a decent pace.<br><br>Overall, I would recommend and I will return. If I could give them one take away is work on their customer service. Most places like this are pretty authentic so the server didn't speak a lot of English so it was hard to communicate with her.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/140xjRymb2XAlex26QFdJQ/348s.jpg", "caption": "Fried calamari"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Sn2e1he1MVQ5qEF3UsH9uA/168s.jpg", "caption": "AYCE appetizer menu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XiEjjUcEAEMYVJvQhP2Z8Q/168s.jpg", "caption": "Signature roll menu"}]}}, {"review": {"des": "Sushi Taku is probably one of my favorite restaurants I've tried in Chicago. My friends raved about this place and they were right to give it such high praises. <br><br>SERVICE:<br>The waiters/waitresses were quick on their feet and very accommodating. Our waitress was super kind and didn't charge us for one piece of sushi that my friends and I just couldn't eat anymore. She saw us suffer as we tried to finish the copious amount of sushi we ordered. <br><br>SUSHI:<br>For an AYCE place, I was pleasantly surprised about the quality of the fish. We ordered a plethora of rolls, nigiri, and appetizers and all of them were great! I usually don't like tuna nigiri but I really enjoyed the tuna nigiri here! The salmon and yellowtail nigiri were some of my favorites! We also tried some of their specialty roles and my favorite one was the sake role! <br><br>APPETIZERS:<br>We tried the baby octopus salad, spicy salmon salad, fried calamari, and yakitori. My friends and I really liked the baby octopus salad because it was very fresh and flavorful! Definitely recommend it! <br><br>PRICING:<br>We went for dinner and AYCE is $24.99. For lunch you can get AYCE for $18.99. I think the prices are very reasonable! One thing I'd be careful about is to make sure that you don't order more than you can eat because you will get charged so order wisely :)", "pics": null}}, {"review": {"des": "Oh my god, I can't believe I didn't give sushi taku a 5 star rating my first time around?! I came back here to celebrate my birthday and the end of school term and if I could go back in time, I would choose sushi taku all over again. The sheer amount of options you have at sushi taku absolutely spoils you. It's really difficult to not go overboard on appetizers because everything looks so good (and tastes even better!!). I highly recommend the takoyaki and grilled fish though, those were definite highlights. <br><br>In terms of sushi, I'm in awe of how fresh everything tasted, even into my 20th piece. I tried scallop for the first time and it certainly wasn't my last! I love love love the unagi and salmon nigiri, and they're very generous with the inari portions even though that's a bit more expensive. <br><br>You also get mochi and have the option of getting tempura banana for dessert, they truly deliver to the very last course. All for $25?! I would do it again and again and again.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KOPq2aTJnwsE0yDGT74Yww/168s.jpg", "caption": "Sashimi salad was so generous with its fish"}]}}, {"review": {"des": "I came here on a Friday night with a group of 12 friends for my birthday. We had made reservations in advance. We did have to wait about 10 minutes before our table was ready but the place was beyond packed so we didn't mind. After we were seated we ordered a few bottles of wine and everyone ordered a few items from the $25 ACYE menu. We tried a lot of things and everything was great. The sushi was fresh and didn't have too much rice. Keep in mind if you don't finish what you order they will charge you for it so order a little at a time. We ended our meal with mochi. The chocolate one was my favorite.<br><br>Will definitely be back!", "pics": null}}, {"review": {"des": "It was a packed house this sushi all you can eat place is super popular in the city. We have been hearing about their large menu and they offer all kinds of different items for soft shell crab, nigiri, signature rolls and regular rolls and dessert! They do offer a lot on their all you can eat for the price of $25.00 per person it is the normal range for this type of eating. We ordered all kinds of items I was excited to try their scallop nigiri and spicy scallop roll and it was alright. I liked the scallop nigiri more than I liked the spicy scallop rolls. I didn't really try much of their signature rolls but I did try one piece of their spider roll and I wasn't impressed with the flavor of the spider roll. I usually like my taste of spider rolls but nothing great went off in my mouth. It's just meh for me.<br><br>Service was fine our server had a lot of tables to take care of so we got a good break in between plates of sushi. When we did get our rolls there was too much rice on the rolls to the point where I felt gross eating the rice. We were glad we got to check this hip happening place out. I would be awhile until I return to dine here since I didn't find it all that amazing.", "pics": null}}, {"review": {"des": "Chicago is great at making you believe that the wait time at a food joint is directly proportional to amazing out of the world food and although I believe it to an extent, sometimes It can get a bit ridiculous. Sushi Taku is one of those places in my list that truly embodies the thought that the wait will be worth it in the end so hang on.   <br><br>Coming to my short experience, I had made a quick stop here on a weekday just in time of evening opening hours. We were basically stopping for just dessert aka Mochi because I had never eaten one before- whaaaaa?? It was amazing - I like mango more than matcha. I don't like raw fish or too much fish in general but I was also made to spontaneously try the Nigiri?? White tuna?? - that was delicious too. Also did you know that the accompaniment ginger is a palate cleanser- alright alright, I didn't! <br><br>Overall, I want to return again to try their all you can eat menu. Pretty economical as well for what Ive heard is fresh usually expensive sushi.", "pics": null}}, {"review": {"des": "Not too shabby! Came in Friday night for all you can eat sushi- we had to wait around an hour but there were plenty of bars in the area so we went to one of those while we waited. You put your name down and can check your place in line online. <br><br>It's 24.99 per person for all you can eat. They have a host of appetizers to choose from in their AYCE menu which is nice. The sushi was pretty good- not the best I've had but not bad for AYCE. They do charge $1 per piece that you can't finish so definitely order in smaller portions! They give you multiple sheets to order from so there's really no need to hoard all the sushi at the first order. <br><br>I've been here twice already and have had good experiences both times. Why not 5 Stars? It's because there's an all you can eat sushi place in Boston that will forever hold the 5 star rating in my heart (they have all you can eat sashimi!!!) I don't think any place can ever live up to that but Sushi Taku is pretty good too!", "pics": null}}, {"review": {"des": "This review is for their all-you-can-eat option which is a total steal at 18.99 for lunch and 24.99 for dinner. Dessert (mochi ice cream, fried banana, and/or regular ice cream) is included in the dinner price but not lunch. I am shocked that Sushi Taku makes a profit because the sushi was actually good, the restaurant itself was clean and modern...nothing suggests \"cheap\" sushi restaurant when you walk in.<br><br>You get to order as many times as you want, from appetizers to nigiri to specialty rolls. There is a penalty for any uneaten pieces, as is the case in other all-you-can-eat places, so be aware of that. <br><br>My group sampled a bit of almost everything. There's a nice variety of nigiri to choose from, but my favorites were the classics: tuna, white tuna, salmon, and unagi (eel). The fish was surprisingly fresh for Chicago; not the absolute most amazing but definitely comparable to other sushi restaurants in the city. Another hit was the sashimi salad which was a mix of salmon, tuna, and yellowtail on top of a bed of greens with a light drizzle of wasabi mayo and ponzu sauce. If you really want the biggest bang for your buck, that salad is the way to go. No rice or extra fillings to dilute the fish. Our group ended up re-ordering nigiri and the sashimi salad repeatedly.<br><br>The specialty rolls are pretty good too. I'd recommend the Sunny Roll if you want the focus to be on the fish, but other good ones were Fire Dragon Roll and Dragon Roll (for the unagi lovers out there) and the Spicy 2 in 1 Roll and Fire Phoenix Roll. The menu descriptions are helpful, so if something piques your interest, go for it!<br><br>As for wait times, my group of 7 got seated pretty quickly on a Thursday at lunch time. I came here once before for a weekend dinner with an even larger party (~10 people?), and we were able to call in for a reservation and get seated pretty quickly upon arrival. It seems like you can't make reservations for smaller parties though. <br><br>Overall, fantastic deal for good all-you-can-eat sushi. I'd definitely come back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wDEQ0gIukcmbFevNocoZcQ/348s.jpg", "caption": "Second round of nigiri"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/v8lPxqg9JKU8inJ3IFiLFw/168s.jpg", "caption": "Rolls (L to R: Dragon Roll, Color Dragon Roll, Sal-fornia Roll)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/v9dkDO93gHX2aVcz_JJ9bg/168s.jpg", "caption": "Unagi nigiri"}]}}, {"review": {"des": "Sushi Taku is by far my favorite sushi restaurant in Chicago. The special rolls are absolutely delicious and their AYCE sushi is such a great deal. You get to enjoy ALL the appetizers and ALL the rolls on the regular AND special menu, all for 25$. By getting 2 or 3 special rolls, you've already gotten your money's worth. You can order how many times you like and as much as you like, however, if you don't finish all your rolls, you'll be charged 1$ for a single piece of a special roll and 0.50$ for a regular roll. <br><br>The only reason why I'm giving this place 4 stars is because of their service. The hostesses are incredibly rude and you can tell they hate their job by the way they act. The service is also super slow. When you put in an order, be prepared to wait at least 30-35min for your sushi to come. However, appetizers come fairly quick. My advise would be to come here at around 6PM or earlier on weekends,  and sometimes even weekdays, because this place gets super crowded and wait times go for over an hour. Either way, this restaurant is definitely worth a try!", "pics": null}}, {"review": {"des": "Punchline: If you're not a sushi snob - and just want to stuff your face with ACYE  low quality, mediocre sushi and apps - go for it.<br>------------------------------------------------<br>For $32.06 per person after tax an tip, it's not a bad price for AYCE sushi. The folks in my party that have tried many AYCE places in the city think Sushi Taku is the best AYCE sushi the city has to offer for the price so I was pretty pumped to try it out. I personally ate 25 pieces of nigiri, 3 pieces of the rolls, 3 pc of fried oysters, 1 order of fried soft shell crab, 1 pc of chicken karaage, Hamachi collar, seafood salad and mochi ice cream. I was uncomfortably full by the end of the meal because I had to eat everything I ordered in round 1 (no round 2 for me except dessert), but I didn't enjoy the taste of any of the food items except the seaweed salad.<br>------------------------------------------------<br>None of the seafood or the apps tasted fresh. Only the seafood salad was good. The green tea and mango mochi ice cream were low quality and barely had a hint of green tea and mango flavor.<br><br>The fried apps came out piping hot, but they were over fried / cooked and the seafood inside was frozen or just old that were also overcooked. The chicken karaage had some really off taste and smell and we had to return it because we literally couldn't swallow such terrible food.<br><br>The fish/shellfish on the nigiri were dried out and lacking flavor. The fish to rice ratio was too low as well. For example, the salmon roe was extremely salty, which meant they used canned salmon roe. The mackerel was not well marinated, fishy, and the meat fell apart. The octopus was really chewy and the squid was slimy. The salmon and hamachi (yellowtail) were supposed to be buttery and melt in your mouth, but they lacked any flavor or desirable texture.<br><br>I tried the fire phoenix, fire dragon, and spicy crispy tuna rolls. Because the fish lacked flavor and the use of too many veggies and rice, the rolls were rather bland as well. They were poorly packed/rolled and crumbled when picked up. <br>------------------------------------------------<br>Despite what some reviewers say, service was good! Reservations for 13 was made easily a week in advance. 2 additional people showed up unexpectedly and the servers kindly accommodated our table. Apps and sushi came out rather quickly (about 10-15 min after we put in the order). Waters were kept filled. For a party of 15, they allowed us to use 8 credit cards.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MCiLMzlF3dMq1wMebMc-YQ/348s.jpg", "caption": "The final bill"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xoyjuPCImL76vUlzbI4jWQ/168s.jpg", "caption": "Mochi ice cream"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VCImyT9EmJznSpDOEu52qA/168s.jpg", "caption": "Chicken karage"}]}}, {"review": {"des": "Hmmmm... I'm a little shocked about my experience here because, after reading the reviews for Sushi Taku, I thought I would have absolutely loved it. It wasn't a bad time, but it wasn't mind blowing-ly amazing either. <br><br>I'm a big fan of AYCE. I've been rocking these kinda buffets since the early-2000s. I have a staple AYCE restaurant in the city that I love going to, but a friend recommended that I try out this place. I went on a late Saturday afternoon and grabbed a table pretty much right away. Side note: I did not know there was free parking around here! Am I going crazy? Are the signs and meters invisible? After a few minutes of shady disbelief, I walked inside to the restaurant without spending a dime on asphalt rent. The best part? My car was not covered in parking tickets when I retuned! Huzzah! <br><br>Ok so back to the restaurant. I love the layout of the place. It's pretty spacious. There is a waiting area that is separate from the dining area. The dining area is perfect for large or small groups. There is also a nice sized sushi bar you can grab a seat at. Everything looks pretty modern, clean, and spiffy. The loud pop music got a little bit annoying by the end, but it was tolerable. <br><br>Our server was nice, but service was a bit wonky. The rolls came out much faster than I anticipated, considering how many people were there at the time. However, the order of items being brought out was a bit odd. For instance, I ended up eating my cold mochi dessert before I had finished eating a few of the appetizers I had ordered. <br><br>I agree with some of the other reviewers that the appetizers included on the AYCE are great and possibly better than the rolls themselves. There is a huge range of salads and appetizers you can get. Some standouts for me included the baked mussels, the jalapeño bomb, and the chicken karaage. <br><br>The specialty rolls are ok. I feel that they make these rolls too big, personally. These are not one-bite sushi pieces. Also, I was disappointed in how much sauce they douse the specialty rolls in. My suspicions were that maybe the fish isn't completely up to ultimate freshness-that was confirmed by the sashimi salad I ended my meal with. Again, it's not bad fish, but it's not up to the quality of fish I've had at other restaurants, including other AYCE restaurants. It's also a bit of a downer that this isn't a BYOB restaurant-they do have beer, wine, and sake, though. <br><br>So my conclusion is that Sushi Taku is just ok. For 25 bucks a person, I expected a bit more. For now I will stick to my go-to AYCE restaurant and end up spending less money, anyway.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_XbR5oPZ1nrQ_k0vpXtl9w/348s.jpg", "caption": "Green tea mochi"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KIc4XtWg-umvznmTs0ZLWw/168s.jpg", "caption": "Sushi!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uqU3bVvpvvf_bWHW6c9yiw/168s.jpg", "caption": "Chicken karaage"}]}}, {"review": {"des": "Absolutely love this place - no wonder this place is mostly like. All you can eat sushi with essentially everything on the menu. For about $30 plus tax and tip, very well worth.<br><br>Went hear with friends I haven't seen awhile, and I can see why they chose this place. The cut and the quality is the food is up there. The service was friendly as well.<br><br>Only down side is that your whole table needs to be there, but definitely understandable.<br><br>Very looking forward to be back - an absolute must in Chicago!", "pics": null}}, {"review": {"des": "A solid 3.5 stars for food but service bumps them up to four stars. It's an all you can eat for $25. The caveat is that if there are any left overs then you are charged per piece!! <br><br>Tharn was our waitress and she was great! It was super busy, crowded, with lots of people waiting for a table on a Saturday night but she was calm and good humored! She was attentive to our table and it was really appreciated. <br><br>The crab Rangoon's were some of the best I have had. The chicken was OK. The sushi was hit or miss. The spicier ones were definitely my favorite. Everyone loved the nigiri. <br><br>The bathroom needs some attention and care given how busy they are. It's only two toilets, one single sink, and a door that will likely hit you if someone enters while you are washing you hands, so be careful!<br><br>All in all, a good experience.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/e9o8kTuLIsXtuQNFP-G2xQ/168s.jpg", "caption": "Mochi"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FYrNJmp0Q-I1h5G5dpeGTA/168s.jpg", "caption": "Red bean ice cream"}]}}, {"review": {"des": "Best AYCE sushi in Chicago. Large pool of tasty appetizers. Don't fill up on these though, get the nigiri!", "pics": null}}, {"review": {"des": "$25 ALL YOU CAN EAT SUSHI+APPS, YES YOU HEARD THAT RIGHT!! This place is incredible and I wish they had one in Florida because they offer quality sushi for a great price. I came here about 3 times and Sushi Taku never disappointed. This place also get PACKED and the space can be considered small for some, so make reservations beforehand.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ibb-Z3-NAo07Koad1enu2Q/168s.jpg", "caption": "Devoured"}]}}, {"review": {"des": "\"No spice better than an empty stomach.\" A fantastic sushi with an all you can eat option in wicker park. A vast selection with helpful picture that actually show you what you're ordering. You're allowed to byob but you will be charged 10. I believe the website says 10 per bottle but I'm not sure how it would add up to a six pack. They off inside and outdoor seating (my girlfriend and I went during the summer) during the appropriate seasons. I for one really appreciate the wide selection for the price. I usually go to sushi para or sushi sai and their options are shadowed by the menu at Sushi Taku. I mean they off fried oysters, fried soft shellcrab in the AYCE. 18.99 for lunch (11:30-3:30) and 24.99 (4:30-close) for dinner. <br><br>In summary if I find myself in the area and am craving for a ACYE, I'll be getting my sashimi on over here!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NlsPitGYJOxy3DvacZ7emA/348s.jpg", "caption": "Takoyaki, jalapeno bomb, sashimi salad,  nigiri,  and fried oysters (already eaten  )"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/b4xhMrcJfRyy6BHX73eKPg/168s.jpg", "caption": "AYCE cont menu back"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Znpq1lQmvG82Q0XXH0wA8g/168s.jpg", "caption": "AYCE menu front"}]}}, {"review": {"des": "Pretty disappointed to say the least. Not sure why I decided to try this place when I get such great quality fish back home but I was craving sushi. Big mistake on my part...<br><br>Customer service: RATING 3/5<br>We were sat fairly quickly. After being seated for more than 15 mins we felt ignored as wait staff just walked passed us. Trying to get anyone's attention was quite difficult. Even when we did they would tell us to wait on our server, I guess team work isn't their strongest suit. I literally made eye contact with a female server and waved for attention but she just looked away... Multiple times. How rude.<br><br>Once I informed the hostess we were not helped our server finally greeted us and she was sweet and apologized for the inconvenience. She continued to check on us fairly often throughout our dinner. 4/5 for her service<br><br>Food: RATING 2/5<br>All you can eat for $24.99/person<br>Apps, nigiri, specialty rolls, traditional rolls, and desserts.<br>Honestly the apps were better than the sushi. When we got our apps they were all good so I highly anticipated for the sushi to come out.<br><br>Amongst the apps we ordered, my faves were the Hamachi kama and Fried oysters. Chicken karaage, Jalapeno bombs, Steamed shumai, Chicken yakitori weren't too shabby either.<br><br>Nigiri/Rolls:<br>The fish didn't taste fresh, it had an overpowering strong fishy flavor that I had to ask for a side of ponzu to somewhat mask the fishiness. The sushi rice didn't taste very vinegary or like sushi rice at all. Most of the rolls tasted fairly basic and nothing special. I wasn't that impressed by any of it. Looked better than it tasted.", "pics": null}}, {"review": {"des": "Came here on a Thursday evening and the place was packed to the gills (pun intended) with a wait time of 30-45 minutes. We got seated within 15 min since we opted to sit outside. It was actually less crowded and noisy outside so we didn't mind. <br><br>We ordered Fire Phoenix roll, fire dragon roll and spicy 2 in 1 roll and hamachi Kama to start. Hamachi Kama came out quickly and was rather delicious so I had high hopes for the rest. However the remaining portion of our meal wasn't as impressive sadly. First of all, it took about 30 min for the rolls to finally arrive, and as expected like many other AYCE sushi, rolls had too much rice and tempura flakes and mostly cucumbers and imitation crab meat.  Rolls were rather bland and indistinguishable from another. <br><br>It did fill the need to eat myself silly once in awhile but that was about it.", "pics": null}}, {"review": {"des": "Sushi Taku is a dream come true. Finally. FINALLY is there a good quality and affordable AYCE sushi restaurant in Chicago. Ever since I first came here 3 months ago, I don't go anywhere else for sushi anymore. <br><br>The sushi here is just all so FRESH and the rice is perfectly vinegary and sweet. Here's my favorites:<br>- Nigiri (salmon, unagi, scallop*)<br>- Hand rolls** (eel avocado, salmon avocado)<br>- Special rolls*** (Sal-fornia, sunny)<br><br>*Amazed at how sweet their scallop nigiris were!!<br>**Check out my pictures to see the orgasmic rice to fish ratios. Srsly tho, heaven on earth does exist.<br>***Many of their specialty rolls have a lot of crunch and since they're pretty filling, I try to avoid those.<br><br>As for the appetizers, go for these:<br>- karaage chicken<br>- sashimi salad (you can ask for sauce on the side and it's basically sashimi!)<br>- baked mussels<br>- gyoza (cause I'm basic)<br>- shumai (cause I'm extra basic)<br><br>I'm really not sure how they're able to pull off the prices, quality, AND quantity, but I sure as hell ain't complaining.<br><br>Since sushi sometimes takes awhile to come out, I come here for weekday lunch ($19) to avoid a longer wait at dinner ($24). Yay #studentperks. However, just be wary that when you pay lunchtime prices, ice cream and mochi isn't included in the AYCE price.<br><br>Since AYCE is always a challenge for my friends and I, we've had a lot of fun times here. Sushi Taku, please never change!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/on1cSLbGBXOdVuvAjXA1Gg/348s.jpg", "caption": "Love their handrolls here too: salmon avocado, eel avocado"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Q6q385yQXRWQ7AIwR4wM3g/168s.jpg", "caption": "We love getting salmon nigiri at sushi taku! It's seriously the best."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/M0dAHsY8qbTbwACyyf_TYg/168s.jpg", "caption": "Assortment of apps. Get their chicken kaarage, shumai, and gyoza."}]}}, {"review": {"des": "Due to my friend's pronunciation and the fact that I'd never heard of this place - nor seen the spelling of Sushi Taku, I arrived expecting a fun sushi/taco hybrid. Although I didn't get to try the quirky little cousin of the sushi burrito, I did not leave disappointed. <br><br>Let me start of by saying I'm a \"Go Big or Go Home\" kind of girl when it comes to AYCE sushi, and let me tell you, ya girl went BIG. I'm talking double what I paid for (my friend and I did the math, we ate about $100 worth of food between the both of us for $25 each, plus tax and tip) so come hungry and order from an ample menu of appetizer and sushi goodness. <br><br>In regards to the sushi quality, I'd have to say I was extremely impressed by the freshness of the fish. AYCE sushi is usually synonyms with mediocre quality, but I immediately noticed the fresh taste and texture of the salmon and tuna nigiri I ordered. I was also pleased with the fish to rice ratio, didn't feel rice heavy to me at all. I recommend trying the Spicy 2 in 1 roll, a combination of spicy salmon and tuna with a nice crunch to it. <br><br>I also tried the green tea and red bean mochi, which were notably good and were also included in the dinner deal. <br><br>Sushi Taku is the best AYCE sushi option I've had so far and I'll definitely be back for more!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9oDG5nyqC9aWW8-n1Wrfzg/168s.jpg", "caption": "Spicy 2 in 1 roll and Phoenix Roll"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uxzpk3xLQxGSpzPRPu3HrA/168s.jpg", "caption": "Salmon and Tuna Nigiri + Eel and Avocado Roll"}]}}, {"review": {"des": "Sushi was delicious and service was very good as well. I'd definitely come back! My favorites were the angel hair roll & Krazy kani roll.", "pics": null}}, {"review": {"des": "Loved this place, they have some dishes you won't find at other AYCE sushi places for a similar price. <br><br>Let me first start with the one thing I didn't enjoy.  Per Yelp I thought they didn't take reservations only to have them ask my friend if we had made reservations...  Apparently they take limited reservations of parties of 6+.  At the time they didn't have any of that information on their website either.  Our party of 8 ended up splitting into two tables in lieu of a 1.5 hour wait.<br><br>Anyway, besides that hiccup, service and food were pretty decent.  They seem to have more options for appetizers than other places but they can be hit or miss.  A few seemed to be slightly undercooked, likely they were super busy churning out food.  However I do highly recommend the Hamachi app it is really good if you like grilled fish.  The rolls were huge and filled with stuffs, a number of them come with cream cheese which can get heavy after a while.  It can be difficult to try lots of different rolls if you're a smaller party as each one is so big.<br><br>Overall I enjoyed the food, ate waaay too much, and will likely be back again!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/u_LzZ1Py8Ob1K8UT_ZXLuA/348s.jpg", "caption": "Dynamite and 2 in 1 roll"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0ZTu0k3kKiLXFY7cUTg1Zg/168s.jpg", "caption": "Tofu skin, eel nigiri, volcano roll, Sapporo roll"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ozL0Xh-LbdXXng37tbFihQ/168s.jpg", "caption": "Tempura, takoyaki, chicken karaage, baked mussels"}]}}, {"review": {"des": "Called to  make a reservation for 6 around 7 . I was told that they don't do reservations to just walk and and they will seat us. We arrive and was told they can seat us but not all together and that we would need be out by 830. They were not even full there were sections available and people leaving.What kind of restaurant kicks out the customers. I spoke to the manager I even told her I was going to review her location. She then told us that they been booked since sunday. Why didnt they tell us that in the first place instead of wasting our times.<br>Everyone who wants sushi do not go to this location especially if you want to sit and enjoy your meal. I will no longer be going to this location and will forward this to all my fellow sushi goers.", "pics": null}}, {"review": {"des": "These guys make AYCE sushi a worthwhile experience, loved most of the selection here. Yellowtail, salmon nigiri were brilliant. Some of the house rolls like tornado roll were great as well", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pIVUv6PoJM_V6aX9jApDFA/348s.jpg", "caption": "AYCE sushi isn't usually the best, but Sushi Taku works hard to make it a worthwhile experience."}]}}, {"review": {"des": "Goodness gracious. I had heard great things about Sushi Taku, but I did not expect to wait over 2 hours on a Friday night. I would recommend not putting yourself through what I put myself through--standing absolutely still like a statue for two hours smooshed between other people waiting. And then stewing in your own annoyance from the lady who kept brushing her hair and arm on you. I don't wish that on anybody. <br><br>Aside from the wait, I love Sushi Taku's appetizer selection. The sashimi salad and the spiralized cucumber were refreshing. Out of all the rolls we ordered, our favorite was the Fire Dragon--it was a perfect mix of creamy, refreshing, and crunchy. I also love that mochi is a part of the AYCE menu. I'll definitely be back!", "pics": null}}, {"review": {"des": "5 stars for the hamachi collar alone. The $25 deal is amazing! The sushi here is super fresh and i love the sashimi salad. Sadly the mochi (straight up from Trader Joe's haha) is not AYCE and limit 1 per person womp womp.<br><br>One thing I noticed is that this place uses a LOT of eel sauce-- i love eel sauce so no complaints but you will be very thirsty a few hours/the day after. I'm sure you can ask them to put sauce on the side. Skip the fried oysters- they didn't taste that fresh. The waitresses were very attentive here.", "pics": null}}, {"review": {"des": "I was pleasantly surprised by the quality of the sushi. For an ayce it was pretty good. <br>My tip is to choose wisely as one order comes in 6-9 pieces. The hand rolls were also good but again it is going to fill you up. <br>Best time to go is on a weekday lunch. No line and service was pleasant and relaxed.", "pics": null}}, {"review": {"des": "AYCE sushi with excellent quality fish and huge portions of it?! MY NEW FAVORITE SUSHI RESTURANT.<br><br>RUNDOWN:<br>- All you can eat sushi: $18.99 for lunch, $23.99 for dinner per person<br>- Appetizers included in AYCE menu<br>- Dessert is ONLY included in AYCE DINNER, not lunch<br>- The fish to rice ratio is UNBELIEVABLE, and the fish is also very fresh!<br>- The service is great too, they're super attentive and switch out your plates regularly<br>- It's $1/piece if you don't finish, so order accordingly!<br><br>TIPS/RECS:<br>- Definitely gets crowded during lunch/dinner rush so try to make reservations ahead of time!<br>- You can get hand rolls of any Signature Roll or Vegetable Roll, just mark down \"HR\" next to whichever you want and the quantity<br>-- SASHIMI SALAD (so much sashimi!)<br>-- HAMACHI KAMA (grilled fish with bone in)<br>-- CRAZY KANI ROLL (my personal favorite)<br>-- COLOR DRAGON ROLL<br><br>This place will definitely give all the other AYCE sushi places a run for their money!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JkOaxyKT9GARj8z_NyU_tg/168s.jpg", "caption": "Hand rolls: Spicy salmon, eel and avocado, salmon and avocado, tuna and avocado"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/d__a1Wewh2OES_4t3nLasA/168s.jpg", "caption": "Clockwise top left: crazy Crazy Kani Roll, Color Dragon Roll, Fire Phoenix Roll"}]}}, {"review": {"des": "I'm not one to go to AYCE sushi places, but I choose this place for dinner for a bachelorette party I was helping to plan due to all the good reviews. I was able to reserve a table for 10 people on a Saturday without a problem, with plenty of advance notice, of course. Service was great and our food came out quick. Their menu is huge for AYCE and includes many appetizers, salads and desserts, along with the sushi rolls and nigiri. They are also BYOB with a corkage fee. We even brought in our own cakes (one being very inappropriate), but they did not give us any trouble about it. The space is pretty large and the tables filled up quickly that evening.<br><br>We all had an enjoyable dinner. The food isn't the best I've had, but it was decent for AYCE. I will keep this place in mind whenever, and if ever, I feel the need for another AYCE sushi dinner.", "pics": null}}, {"review": {"des": "This is a review for the AYCE lunch buffet. Great service and amazing appetizers, especially the fried chicken (karage), fried oysters, and ike and sashimi salads. The AYCE sushi selection was great. My only qualm is that the rolls including cream cheese were all too heavy on the cream cheese and filled us up quickly, so we weren't able to enjoy as many rolls as we wanted to. Our group favorites were the crispy spicy tuna roll and the 2 in 1 spicy tuna roll because they were lighter. Overall, a great value and experience for lunch! Thanks, Sushi Taku and staff!", "pics": null}}, {"review": {"des": "When your student tells you to try a new AYCE sushi place in Chicago, you can't say no to that logic. After hearing such great things about Sushi Taku, my bud and I finally made some time to venture out here to see what the hype was all about.<br><br>Fortunately, the food is good, but the wait and price keep me from really giving it more than a three. Let me explain.<br><br>We came for weekend lunch and found out from other Yelpers that they charge the dinner price ($24) all weekend long. Nowhere on the menu did it indicate such so we were a bit peeved by this. But no matter, still worth a shot!<br><br>When we arrived, all the tables were taken but we opted to sit at the bar. Instant seating! We got on our way to ordering appetizers, rolls, and nigiri, and were ready to devour this feast. The appetizers took 20 minutes to come out, and the sushi rolled out with an even longer wait. We spent nearly an hour waiting for our food that we didn't even bother for a second round.<br><br>However, here were some of the highlights:<br>- Octopus Salad/Fried Oysters/Calamari/Hamachi Collar were all great appetizers<br>- Rolls were pretty much on point! We loved most of the ones we ordered that were very unique to Sushi Taku, and they delivered. Each comes with 8-10 pieces so it can be a lot!<br>- Dessert options with mochi and ice cream<br><br>Things to avoid:<br>- The Dynamite, Mussels, and sadly Sashimi Salad were all very underwhelming appetizers<br>- Rainbow Roll that was accidentally given to us was very bland<br>- Nigiri was disappointing. Only the hamachi gave us life, and everything else was pretty low quality fish, which was upsetting as the highlight of sushi buffets are usually the nigiri<br><br>Given the low quality nigiri/sashimi and slow service, I can't justify giving Sushi Taku more than an average rating. The rolls here definitely made up for the lackluster fish, but I'd plan on checking out other sushi buffets that have fresher nigiri to satisfy my sushi cravings and my wallet.", "pics": null}}, {"review": {"des": "This is by far the best bang for your buck sushi location. $25 AYCE dinner, $19 AYCE lunch? Ordering just two rolls alone is worth it. Like, there is no reason to order singles over the AYCE option. I don't care if you are an amateur at this. Order the AYCE. Period. Order in smaller portions as they charge $1 for EACH PIECE not finished. I believe all the rolls come in 8 pieces, at least for the ones my group ordered.<br><br>For appetizers, crab rangoons came out hot with the perfect textures of a crunchy shell with a creamy filling. There was actually some crab and not all cream cheese. Eat this if you like crab rangoons. Gyoza was just right. Not too salty. Textures on point. Dumplings done right. Soup and salad don't count lol. That does not contribute to your charge quota. Though, if you are really into it, the salad dressing was full of flavor. Gingery. Delectable. First time with the hamachi kama. You can't go wrong. Already with just the right amount of fat to meat ratio, it was really good. Just try it, it is pretty expensive on its own and rare at other restaurants. Not too filling either. Simply succulent. <br><br>I can't give the best review for the rolls because that whole boat of sake nigiri was pretty much all for me. Probably not the wisest decision, even for a more seasoned group of sushi enthusiasts, but I think for the average group of 6, 1.5 boats of sushi would keep everyone full without feeling sick. Okay, but I can't stress enough the quality of the nigiri. The sake nigiri itself is one of the best you could get, on par with high end sushi joints. The hamachi surprised me as it was more moist than I had ever had in the past. So here, I would definitely order more if the rest of the group didn't order so many rolls. Especially for AYCE, I'd say that coming to this place just for the nigiri is worth it.<br><br>FYI Dinner wait times were relatively reasonable. A party of 6 around 8 pm on a Thursday night took about an hour before we could be seated. Technically, 4 should sit to a table but if you are willing to squish together (especially with smaller people) its more easy to accommodate. <br><br>I will always eat here at least once when I visit Chicago. So if you are a nigiri enthusiast, come here. You won't be disappointed.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/x29uF4cf4G9nLaHpLyC6lg/168s.jpg", "caption": "Boat 2: Way too much"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ylisFjOtOO2drCImPNmY2Q/168s.jpg", "caption": "Boat 1: 50 pieces of sake nigiri, 5 pieces of ebi, 5 pieces of hamachi downed in 10 minutes between 6 people"}]}}, {"review": {"des": "Fair price and quality that can legitimately compete with west coast seafood. I was very happily impressed with their unlimited sushi dinner !", "pics": null}}, {"review": {"des": "I don't like naming names of other restaurants but after attending another common AYCE sushi chain for years...Sushi Taku has taken the contender belt for best AYCE sushi in Chicago. I have been reluctant to state my opinion because I actually don't want too many people knowing about it but the word is spreading about their seemingly high quality sushi for AYCE prices. Their appetizers are really good too like the Kuragi? Chicken and Seaweed salad. The special rolls are very delicious and they don't pile on the rice. They offer Mochi dessert...what more can you ask for? <br>I tried goin in on the Wednesday before Thanksgiving at 2pm and the wait was a freaken hour long...WTF!! Stop telling people about this place....but go for great Sushi..", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RHoHfLV33ufFTX_KSyP2ZA/348s.jpg", "caption": "Spread"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EF9tpqwFsE1XtvWgOV4F-g/168s.jpg", "caption": "Angel hair??"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2zLlwdVhQt32GzKnCS7Lrw/168s.jpg", "caption": "Jalepeno bomb"}]}}, {"review": {"des": "My favorite sushi restaurant in Chicago. There, I said it. I went in a group of 7 so got to try a solid variety of apps, maki, and nigiri. I feel like you can't go wrong with anything you order (especially the apps and nigiri) but my favorite maki were the Spicy 2 in 1, Crazy Kani, Color Dragon, and Angel Hair. For apps, want to mention the fried shumai and sesame balls (note that these are of the smaller variety). One of my favorite parts of the nigiri (granted there are really only 2 parts) is the rice because it has the perfect amount of rice vinegar. For dessert, we all got a mochi ice cream. I got the green tea one and it was the perfect way to end the meal. Only down side is that each person is limited to one.<br><br>The service was excellent as well. Our waitress constantly checked in with us to take more orders and give us more order sheets. Every order came out reasonably quickly so we could almost continuously be stuffing our faces.<br><br>Finally, I must mention the prices for AYCE: $19 for lunch and $24 for dinner and weekends. For the quality of sushi you get, I think it's a good deal and definitely will be coming back here. A lot.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cFQWS5wkpGKj78XsyLpCLQ/168s.jpg", "caption": "Sapporo, Color Dragon"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6DosjVbDyqHXeo6z-RLwaQ/168s.jpg", "caption": "Edamame, steamed shumai"}]}}, {"review": {"des": "The best all you can eat sushi. Period. This place is amazing. The sunny roll is one of my favorite but the real star here is the nigiri. Being able to get all you can eat nigiri where there is actually a lot of fish on the rice is amazing. They even have salmon row nigiri in the all you can eat!<br><br>The sashimi salad is a must as well. Can't recommend this place enough.", "pics": null}}, {"review": {"des": "I wasn't aware that AYCE \"sushi\" was a thing...and I felt skeptical initially but the rave reviews for this place subdued any hesitations I had. The deal is $23 for dinner and on weekends, or $18 for lunch...so it's a steal either way. <br><br>Here's what we had: Miso Soup, Soft Shell Crab, Crab Rangoon, Godzilla Roll, Chicago Roll, Mango & Vanilla Mochi<br><br>As you can see, we played it pretty safe with our order...both rolls featured tempura something. Everything was good, but the rolls stood out...as they should lol. <br><br>The thing that impressed me most is that you can continue to order during your meal. Even if you're in the middle of your fifth roll, and you want to order more, that's totally acceptable. The only limitations are on mochi (1 order per person), and you will be charged for every piece of sushi you do NOT finish ($1 per piece).<br><br>They don't take reservations, so try and come at an unconventional hour!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NXur-lqmTiX-dYeNuBO1oQ/348s.jpg", "caption": "Chicago x Godzilla"}]}}, {"review": {"des": "I won't be repetitive by talking about the AYCE and the difference between lunch and dinner menu and prices. Instead, I'll dive right into the question that most sushi purists want to know. Was the sushi at this AYCE worth the hype and glowing reviews? The answer is YES! I went for lunch by myself so could only order so much since wastage is penalized and charged for. Although, you are welcome to order multiple times, so fret not over leaving hungry. I ordered a miso soup, the sashimi salad, a salmon something roll and 5 pieces of nigiri and it was all really good! I certainly didn't do it nearly enough justice but I got my fill of no frills sushi. I was surprised that the fish was very fresh with good cuts and not excess rice. I was than pleasantly surprised and look forward to going back for dinner and certainly with more people in my group.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oquMvBHmB_YTzysHcsh6Gw/168s.jpg", "caption": "ACYE Menu"}]}}, {"review": {"des": "The best all you can eat (AYCE) sushi restaurant that I've been to in Chicago.  Period.<br><br>Omg can you say FOOD COMA?!  Warning - if you are on a diet, please do not come here.  You will not get the full effect of stuffing your face and going to bed happy.<br><br>The sushi here is so fresh, beautifully prepared and served, and so many choices to choose from!!  The appetizers are THE BOMB and I can just keep eating everything on the AYCE menu until my tummy bursts out waving a white flag.  At other AYCE sushi spots - I feel like the food and how it looks is mediocre.  But here, the rolls are huge and not overly stuffed with rice.  And they make them look so pretty with the fun rainbow colors, sauces, fancy plates.  All for $25.<br><br>The servers were really attentive, kept coming back like clockwork to refill our glasses with water, and made sure we were ok or if we were ready to order some more.  My friends and I never felt like they were rushing us to hurry up like at the last sushi place we went to.  (That reminds me, I need to write a review about them.)<br><br>Plus, their dessert menu consists of mochi, red bean or green tea ice cream, and sesami balls aka buchi!  Love, love, love this place and will definitely be back and pig out again once my body recovers.", "pics": null}}, {"review": {"des": "I'll start off by saying I'm not a big fan of sushi or seafood in general. However my family was in own, and they love all things sushi, and Sushi Taku was highly recommended. It did not disappoint. The all you can eat menu is incredible with its array of offerings! I love that all the sushi was freshly prepared, and that they don't skimp on the fillings -- good ratio of seafood/veges/filling to rice. Minus 1 star because we had a food allergy in our party and the waiters weren't sure of the ingredients in the different dishes and had to ask the chef for each item we ordered", "pics": null}}, {"review": {"des": "Sushi Taku was the first AYCE sushi place I've been and I can tell you now that I didn't get my money's worth. Lol But that's more on me than on them. <br><br>Their all you can eat deal is GREAT to check it out at least once but I felt that it would have been cheaper if I had gotten out of the regular menu. <br><br>Everything was tasty, the only thing was that the sweet potato rolls weren't as crunchy as I expected. I'll definitely go back!", "pics": null}}, {"review": {"des": "For all you can eat, it's pretty freaking tasty. Usually places that are all you can eat are cheap and taste horrendous. This was not the case. FYI- they do serve alcohol but you can also BYOB for a $10 corkage fee. <br><br>The all you can eat menu is $25 for dinner & $19 for lunch. It includes appetizers, sushi, and dessert.<br><br>For appetizers we tried:<br>-Takoyaki: this is basically a fried potato with an aioli sauce. It was amazing. Great burst of flavor. <br>-Yakitori: Chicken on a stick. The meat was very tender<br>-Jalapeño Bomb: fried jalapeño with a sauce. Not bad. Could have had more flavor <br><br>Sushi: <br>-Fire Dragon Roll: shrimp tempura with cream cheese and tobiko. It was very pretty and tasty. Love tobiko!! <br>-Fire Phoenix Roll: crab, avocado, tobiko. Very fresh taste. <br>-Volcano Roll: spicy tuna, cream cheese, jalapeño, spicy mayo. Great flavor and crunch. <br>-Crazy Kani Roll: shrimp tempura, spicy crab, eel sauce. My favorite as I love the crunch from the tempura <br>-Color Dragon Roll: shrimp tempura, tobiko, eel sauce. A great combination of everything that should be in sushi. <br><br>Dessert:<br>-Mango Mochi Ice Cream: it just bursts in your mouth. Great flavor <br>-Tempura Banana: can't go wrong with fried banana right?! <br><br>Man I was stuffed by the end. Will be back.", "pics": null}}, {"review": {"des": "AYCE SUSHI? Yes. Sushi Taku is a dream come true. The all-you-can-eat deal (lunch: $18.99 and dinner/weekends: $24.99) includes unlimited appetizers, salads, specialty rolls, nigiri, and dessert. You can order as many times as you want and there is no time limit! The fish here is fresh and sushi to rice portion is on point. The nigris are the way to go, some of my favorites were the salmon, hamachi, and eel. As for the rolls, I really enjoyed the dragon and fire Phoenix. We've been here twice already and I can't say enough good things about this place. Will most certainly be back again and again!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tF4dV4MDKx-o-GOWwZtolg/348s.jpg", "caption": "Front: salmon nigiri // back: tuna, red snapper, hamachi, unagi nigri"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/--asDqLm7QDmvZFJZzxp4A/168s.jpg", "caption": "Volcano roll"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rVdYisq4e5KNAoCLJbNGCQ/168s.jpg", "caption": "Godzilla, fire Phoenix, and dragon"}]}}, {"review": {"des": "Cheapest and best sushi in the neighborhood. If you're super hungry, the all-you-can-eat is great and not too pricey. The servers are always super nice and attentive to my pup too which is always a plus. <br><br>Although when I got the all-you-can-eat at lunch hours, they wouldn't let me order any mochi and said it was not included in lunch (which is already limited to 1 at dinner). The menu does not specify that so that was a little disappointing.<br><br>Despite that.. it's definitely my new favorite sushi spot in Wicker Park. ^_^", "pics": null}}, {"review": {"des": "Sushi Taku is my new go-to place for AYCE sushi! Quality is excellent, portions are very reasonable and the sushi rolls taste fantastic.<br><br>We came as a party of two at about 7pm on a Friday. The wait for a table was apparently 45 minutes but we opted for the bar by the chefs doing the sushi making (15 min wait). The only downside to being by at the bar is that waiters/waitresses will stop by next to you to pick up orders from the chefs all the time. It may get a little crowded, but if you're just there to focus on the food, this shouldn't bother you that much.<br><br>Our table ordered the Godzilla, Crazy Kani, Rainbow, Sweet Potato, Dragon and a few salmon, sea bass & eel nigiri on the side. We also ordered a few of their appetizers. Word of advice, though the selection for non-sushi apps sound pretty good, I would recommend avoiding ordering any of these (maybe except for a light seaweed salad/miso soup) because they're not as well-made as the sushi + they fill you up real fast! <br><br>The fish was fresh & nicely cut (yess to the salmon) and all the rolls were really delicious! I didn't get to try the dessert options because we were so full but will be back next time for that ice cream, mochi & tempura banana!<br><br>This place also doesn't take reservations unless it's for a party of 6 or more people.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yeOtH3SjPdSMIecqT4k_ZA/348s.jpg", "caption": "From right to left: Godzilla, Crazy Kani, Dragon, salmon/sea bass/eel nigiri"}]}}, {"review": {"des": "Excellent sushi, good all you can eat price.<br><br>I went here on Sunday for lunch. The price for Sunday lunch is apparently the dinner price (25$). We ordered a bunch of rolls from the menu. The great thing about this place is the rice is done well and they don't make the whole dish rice with a microscopic piece of fish. Quiet the opposite they add a good amount of fish. <br><br>The only thing I'd say I dislike about this restaurant is the sauce. Everything is overpowering, and it can lead to only tasting the sauce.<br><br>Would go again. 4 stars", "pics": null}}, {"review": {"des": "This is my favorite sushi place in Chicago so far!<br><br>Parking was a little hard, but that seems to be the norm in this area. It took us about 20 minutes to find street parking.<br><br>The service was great: we were seated right away at the bar. Our waitress was always running around so after we filled out our order for the first round we flagged her down in no time.<br><br>The food was impressive! Big rolls with lots of meat and it wasn't overly padded with rice. FYI their rolls were very saucy the night we went. I don't like a lot of sauce because I like the taste of the fish; I asked for the sashimi salad with less sauce. They listened! I got a bare sashimi salad with sauce on the side. Also the waitress came and clarified anything she had questions on. I was really impressed with both the service and the quality of the food.<br><br>For only $18.99/person for lunch and $23.99/person for dinner, this place is awesome. I will definitely be coming back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SJVScE6mdK30bcgIRRcc7A/168s.jpg", "caption": "Sashimi Salad (my favorite!)"}]}}, {"review": {"des": "My bf and I eat a lot and this place definitely worth the money for AYCE! Definitely try chef recommended rolls and sashimi salad (they have pictured menu so it's easy to pick rolls and appetizers). My favorite rolls were the mango tango roll and the sushi with porched salmon (on the first picture with red roes on top). They were both refreshing.<br><br>Unfortunately I am giving 4 Star as their sashimi had bit of fishy smell and our server never put away plates that had one last sushi or bit of chicken left. A sushi actually fell on the table so we placed it on the plate and we finally got her to put it away after explaining what happened to the sushi. <br><br>Lastly, I wouldn't recommend spicy tuna roll or the grilled fish (menu that's in Japanese and starts with Ha) or karaage (Japanese style fried chicken). Spicy tuna didn't taste like tuna at all. Grilled fish was all burnt. You can tell karaage was microwaved. Otherwise all items on the menu that we tried were great compared to the price.", "pics": null}}, {"review": {"des": "The severity of their food practices really is the main reason it's rated this way but it's a doozy. I hateeeeee to do this to a place that I'll probably be coming back to but man, tonight has really been eye opening. This place is almost always packed every night and this is my umpteenth time being here but tonight we were given the sushi bar (with no choice) and it's like the Island of Lost Boys. Took us more than ten minutes and me asking two different servers to get our own server. Our AYCE menu was ready to roll by the time he came around just to ask for drinks. Then sitting at the bar, you really notice how long the sushi sits on the bar top waiting for the server to come around and pick it up. That was a big no no in my head and I prayyyy after 5 minutes (being conservative here) the plate of raw fish does not get picked up by anyone. Our server has had little presence but lucky for us, we know what the heck we want when it comes to sushi. We just need our paper picked up and food delivered, little small talk thanks (not like he offered any). <br>I've been here more than my fair share of times, when it's busy it's a clusterf***. Not to bring down the industry but my sister does this and has been for a long time, when she complains about service you know it's a problem because she's understanding. Be careful if you come when it's busy because the food might get you sick due to the sheer about of time it sits on the bar.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-hJ2gv4g_FZIvY1wy5vBrw/348s.jpg", "caption": "It's not warm...last time I burned my tongue on it...wonder how long this was sitting there"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1XE9QzYR43NLlOdIDL2H4Q/168s.jpg", "caption": "Plopped this right in front of my sister HARD as if there were more important things going on"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nGiIRVwlC1FwxDx8nTJw2w/168s.jpg", "caption": "Still counting but so far this plate of sashimi salad has been here right when we sat down....half an hour ago..."}]}}, {"review": {"des": "It took a little longer than necessary to be seated (we waited for about 15-20 minutes and then were seated at a table that had been ready the entire time). Otherwise, everything was great! Their unlimited is a great deal and they have $10 corkage for any size bottle BYO. Their special rolls are really great. We tried several and all had different favorites which I thought was cool. Definitely will be back.", "pics": null}}, {"review": {"des": "Favorite AYCE place in Chicago. Quality, quality, quality. <br><br>Everything here is so great. I have been here twice now, most recently with a group of 6. The service was very prompt and the food was excellent. We ordered several appetizers, included in the AYCE, highlights are the tempura shrimp and carb rangoons. The sushi quality is amazing for an AYCE place. They do not skimp. The mango roll was one of our favorites. <br><br>Only tip: Be careful not to load up on the apps, the sushi is worth saving room for!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/caydsJs4g8e9ay-WDavVSA/168s.jpg", "caption": "$7 house hot sake"}]}}, {"review": {"des": "Hands down the best AYCE sushi in the city!<br><br>We came on a Sunday for lunch and wasnt sure why but the AYCE was dinner pricing ($23), nevertheless, the quality was great! The selection, compared to other AYCE like Sakura, Ringo, or Sushi Para, was well worth the price!<br><br>We ordered a lot of signature rolls, and i was quite impressed with the freshness of the ingredients! Only downside was the wait, our order took a long time to make, as well as the soy sauce that was overpoweringly salty.<br><br>However now that we discovered this great spot we will definitely come back again!<br>10/10 would recommend!", "pics": null}}, {"review": {"des": "The best AYCE sushi in Chicago! I love love love that you can get a full Japanese meal from fried soft shelled crab legs, sashimi salad, nigiri and maki rolls (get the Fire Phoenix Roll), and green tea ice cream for a fixed price! It's absolutely a great deal!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OVfRNQJEuwvXpPM__V9sFg/348s.jpg", "caption": "Fire Phoenix roll is the winner. Hands down."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/R-HZiikn-YSlXYKNpA1ZDQ/168s.jpg", "caption": "Angel hair maki"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZLl_nsP4BVMXCuhy-EPm2Q/168s.jpg", "caption": "Sashimi salad, soft shelled crab legs and fried oysters were my favorites."}]}}, {"review": {"des": "Great all you can eat sushi place--much better than Volcano Sushi Cafe or any of the Sushi Paras. The sashimi salad and baby octopus salads are must tries. The signature rolls they offer are very unique and range from deep fried rolls to rolls with mangoes on top. However, avoid the chicken teriyaki roll, it was extremely bitter with burnt chicken. The sushi buffet also has the option to replace white rice with brown rice. <br><br>The appetizers came quickly, but it took over 50 minutes for the actual sushi to come. Service was also a bit slow.<br><br>This is my new go to all-you-can-eat sushi place.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1HoDFhHHCF4y51wyUPZEuw/348s.jpg", "caption": "You're allowed to order one mochi ice cream per person as part of the sushi buffet"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xgyRCVjBz0gzJxQKE7rKNQ/168s.jpg", "caption": "Sashimi salad and baby octopus salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2OQB98AIPlOXws6HgyBynw/168s.jpg", "caption": "It you order enough rolls, it comes in a boat!"}]}}, {"review": {"des": "There are some pretty hit-or-miss AYCE sushi places in the world (I've been to a few in NYC), but this is, happily, not one of them. The main differentiation of Sushi Taku is the quality of the appetizers and the nigiri. I know you're not supposed to go to AYCE places for the appetizers, but all of their apps were so unique and delicious, much better than the typical miso soup + edamame combos offered at other places. <br><br>Their nigiri has so much fresh fish, including ample amounts of eel and salmon especially. I also loved the simple sushi rolls. All of the rolls had a great fish: rice ratio and didn't try to drown you with rice overload. <br><br>I'm docking one star for some of the strange special sushi rolls, especially some of the sour/spicy ones...but stick with the classics and you've got a home run here, topped off by perfect service!<br><br>Don't forget to order mochi ice cream for dessert, but don't order the green tea mochi. The others are delicious.", "pics": null}}, {"review": {"des": "It wasn't my favorite, but it stands out.<br><br>I would come to sushi taku for the appetizers and good service. They have a good variety of appetizers that can't be turned down. <br><br>I did go ahead and get the sashimi salad because it was all the rave and I think this filled my weak stomach so much I couldn't continue with my AYCE journey. It has a wasabi dressing and large pieces of fish. Can't complain. I also like the fried oysters and soft shell crab. I don't like the miso soup (diluted). <br><br>Nigiris: scallop is small but good. Yellowtail was good but not cut with care. It still had pink underbelly. <br><br>The volcano roll is good but everything else I got was a let down because they all had tempura. Maybe it was just the day but all the tempura tastes old. Pretty unenjoyable. <br><br>The price was ok. Would I come again, myeeeeh (for sashimi salad) Got my fair share of appetizers, some rolls, and mochi", "pics": null}}, {"review": {"des": "The hype is real!<br><br>My friends and I tried this AYCE spot and were just so happy with every aspect of it! Our server was so incredibly friendly, attentive, helpful and even offered to take a photo of us with our big sushi boat! I mentioned in passing that it was my friend's birthday and she brought out a dessert for her on the house! Gosh darn sweet lady!<br><br>They have a few beers you can order, as well as wines. <br>Pro-Tip: Lagunitas is $4.50 and Sapporo is $5. Make the smart decision here. :P<br><br>On the non-sushi front, we tried the Chicken Karage which is always a favorite of mine. It  was so good, we got a second order! <br><br>My friends and I really want the sushi boat! Just know you need to order a hecka lot to get the boat. I found their sashimi to be A-OK, not the best but it wasn't bad either and had a completely acceptable level of freshness. The rolls at Sushi Taku are really where it's at though.<br><br>They didn't put an exorbitant amount of rice in their rolls and they were all nicely packed. Some of the standouts for me were the: <br>~Sweet Potato Roll - Honestly one of the best I've had and I have a sweet potato roll addiction so that's saying something. This is the only maki I found to have a tad too much rice but it was still really tasty.<br>~Chicago Roll - I put on for my city, on on for my city!!!! This was an interesting roll stuffed with asparagus and tempura white fish, topped with spicy salmon & spicy mayo plus some tempura crumbs. Loved this roll though I did not find it very spicy at all and I'm pretty weak.<br>~Spicy 2 in 1 Roll - This packed a bit more punch with spicy tuna & spicy salmon with a bit of a crunch, as well.<br><br>They have a surprising number of desserts if you can find a little space left in your belly. I had some Red Bean ice cream and loved it. Kind of funny, but they have a limit on mochi ice cream pieces, one per person! So no limit on crab or other expensive seafood - just the mochi ice cream! :P<br><br>I really enjoyed my dinner at Sushi Taku and am so happy this amazing AYCE option has come to West Town!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XpvrxcUnQd9dA_PyxOO77g/348s.jpg", "caption": "Sushi goodness!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/i8LRqH7k7OPMo3wZjCECRw/168s.jpg", "caption": "Mochi Ice cream"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qDhAsbS6PZBbXaSj_8-wGQ/168s.jpg", "caption": "Red bean ice cream"}]}}, {"review": {"des": "My first AYCE sushi restaurant experience in Chicago! This place is good, not the best, but a great experience overall. We left with our palates feeling especially catered to with the inclusion of so many different flavors from the specialty rolls and stomachs stuffed to the brim. It's $18.99 for lunch and $23.99 for dinner. My boyfriend and I booked a reservation here for a Monday night to celebrate my birthday. There was a decent number of people even for a early weekday night, and we were seated right away at a table for two. This restaurant is great for both 1-2 people and large groups (I saw a large group having a blast at a long table near the entrance). <br><br>The ambiance is typical for Wicker Park, with bright colors and a trendier, younger feel to the restaurant as well as the demographic. Service was fantastic, fast, and had all of the appetizers and specialty rolls prepared to bring out all at once. AYCE is similar to other places, except a little more special because even the appetizers, nigiri, specialty rolls, and desserts are included! Some places place restrictions on what you can order from the menu, and so this was excellent. <br><br>Appetizers<br>Takoyaki<br>I really wanted this to be amazing, mostly because I was craving it, but alas, the doughiness wasn't the best first impression. Takoyaki is a round fried ball of wheat flour with a piece of octopus inside. This wasn't crispy on the outside, and a little too mushy. It is also quite filling so I wouldn't necessarily recommend this for AYCE.<br><br>Jalapeno Poppers<br>What a surprise! This is a new addition to any Japanese menu I've seen, but it was delicious. Cooked tuna inside jalapeno shells, with sauce drizzled on it, this one wowed us, albeit left us panting for water.<br><br>Specialty Rolls<br>Fire Phoenix Roll<br>This one was a little disappointing, because we couldn't really taste the salmon on it, mostly because it was overpowered by the wasabi in the roll. The wasabi was not mentioned on the menu ingredients. Otherwise, it would have been a cooked salmon star.<br><br>Sapporo Roll<br>My personal favorite. This one was the most uniquely flavored, with spicy tuna, crab, avocado, cucumber, and tempura crunch on top. The spicy tuna was a good complement to the other rolls that we had, even if my bf wanted it to be more spicy.<br><br>Crazy Kani Roll<br>Shrimp tempura crunch all around. That was all we could taste with this roll, but we weren't made about it haha. A solid fried specialty roll.<br><br>Color Dragon Roll<br>Wowser, beats the original dragon roll by a mile. Topped with eel, tuna, avocado, tobiko, scallion, and eel sauce, there were the most extravagant of toppings that I've seen in a specialty roll. <br><br>Dessert<br>Green Tea Mochi Ice Cream<br>Since we were both so full, we ended up splitting one green tea mochi ice cream ball. Refreshing after all that sushi, but not the strongest green tea flavor that I've had. This is pretty close to the Trader Joe's version of mochi ice cream.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2fkr4CL0vF4MDd9tQEIKDg/348s.jpg", "caption": "Date night with the bf."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RW93mAsgdRh8JL3mROlWfg/168s.jpg", "caption": "Fried Takoyaki and Jalapeno Poppers."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xUgHbHyFuTvaKOE7dd8ZJg/168s.jpg", "caption": "Green Tea Mochi Ice Cream."}]}}, {"review": {"des": "Great AYCE sushi place, with reasonable prices to boot!  Came here with a friend on a Saturday night-there was a wait, so we put our name in on the app and went to grab a drink next door.  The app is nice, it shows you what place you are in line, how long you've been waiting, and the size of tables that are ahead of you in line.<br><br>We ended up being seated at the sushi bar, which I didn't mind except that it was kind of cramped (especially with AYCE!).  The deal is $24 a person, and includes appetizers, salads, soups, rolls, and dessert, so you can get pretty much anything!  And we did get a bit of everything-miso soup, salad, crab rangoon, some of the specialty rolls and some of the regular rolls.  They do charge if you have leftovers, and the specialty rolls are a full 8-12 pieces, so don't let your eyes be bigger than your stomach!  We also split a bottle of wine, which was also reasonably priced at about $25.<br><br>Our server was attentive, though there were a couple times that we were winding down with what we were eating and had to wait to put our next order in.  Not a terrible thing, as it gave us time to digest (more room for sushi!) but it was a bit noticeable.  It also is very loud in there.  But a great AYCE place with reasonable prices and lots of great options.  I will be back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3Ebmdd0Mn4ST-HUilA1uhA/348s.jpg", "caption": "Mango tango roll, color dragon roll,  salmon and yellowtail rolls"}]}}, {"review": {"des": "Great place for sushi. We did the all you can eat menu. They have a wide variety of rolls and nigiri. My boyfriend really loved their sashimi salad and we both really enjoyed their specialty rolls. The service was great our waitress Wenny was very attentive to our table. This was also our first time trying sake which was a great experience as well. Parking was a little tricky on a Saturday night as it is only street parking and most of the residential is permit only. I would recommend calling ahead for a table as their wait times were pretty long. Pricing was also fantastic for the quality. I would highly recommend this place. We will definitely be coming back!", "pics": null}}, {"review": {"des": "THIS. This is as good as it gets for sure. Loved the AYCE menu that also included appetizers! All the sushi we ordered was a good sushi to rice ratio. All delicious. Waitress was attentive, always refilling our waters. The red bean ice cream was good! Green tea one wasn't sweet but you could taste the green tea. Also mochi ice cream was a win (go with people who don't like mochi so you can have their piece ;D )<br><br>Dinner price was only $24 which I thought was a good deal. I'm down to come back but will try to get on that weekday lunch price for an even better deal at just $19!", "pics": null}}, {"review": {"des": "Best AYCE in Chicago for sure!<br>Their options for AYCE are what really set things apart. They have so many appetizers and salad options along with their specialty rolls, classic rolls, and dessert. This selection is a lot better than any other menu I have seen for AYCE. And for around the same price as other places as well! <br>The sushi itself is great, the fish to rice ratio is perfect which helps you from getting too full too fast. Keep in mind they do charge for leftovers so start slow and only order what you can eat. It is $1 for every specialty roll piece and $0.50 for every classic roll piece. <br>When I went the server only charged us $5 for $9 worth of leftovers which was great!<br>Will definitely be coming back soon.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1NsQHIHIhE4GNlCpCRpJCg/348s.jpg", "caption": "All you can eat!"}]}}, {"review": {"des": "My best friend and I always have long talks over stuffing out bellies with sushi so I was very excited to see a new AYCE sushi joint opening up in Wicker Park. <br><br>Parking - street parking in a very congested area. You may have to park a couple blocks away from this place.<br><br>Staff- very in top of service! They were there to refill out water, grab out orders, and ask how everything was. <br><br>Food- for an all you can eat sushi joint, this has to be top in that quality of food. I really enjoyed the bigger selection in appetizers and lots of special rolls option. Definitely tasty selection. I would definitely do more of the all you can eat. I  felt like the prices were little too steep if you order them just off of the menu.", "pics": null}}, {"review": {"des": "Decent menu, but I think given the way things are priced, you are better off doing the all you can eat option. You don't have to super stuffed to break even.<br><br>We came for dinner, and it's 25$/person before tax. Really liked their salad, they come in small portions, so you can try a variety of them, the baby octopus one is really good, so is the squid one (but if you order them without the all you can eat option, it's a bit pricier for that small portion).<br><br>They also have a lot of hot appetizer that you can order, and the portion is small, which is a plus for all you can eat sushi places that normally impose penalty on not finishing the food, since you can try a variety and know when to stop. The hot dishes are pretty good for all your can eat place's standard, but it definitely does not measure up to places like Kai Zan (well, it's reflected in the price).<br><br>The only downside is they don't have sashimi, but given the selection of the choices, I think it's still one of the top all you can eat sushi places you can find in Chicago.", "pics": null}}, {"review": {"des": "I love sushi and I love to eat, so when I found this AYCE sushi option, I was beyond excited. <br><br>The line gets crazy for dinner! I called on a Friday night around 6:30pm to get an update on the wait-time, which they estimated to be about 1 hour. NOTE:  They do accept call ahead seating, so I was able to put my name on the list & they texted me when the table was ready (which was only about 40 minutes later). They saved the table while I was parking the car and we were able to walk right in a get our table!<br><br>The all-you-can-eat menu is expansive with several nigiri & roll options, as well as appetizers, soups, salads and desserts. There were a lot of different Signature Rolls with my absolute favorite being the Sake Roll, which is spicy salmon/avocado roll topped with even more salmon! We got several others (Angel Hair Roll, Spicy 2 in 1 Roll & Sal-fornia Roll) that were tasty, but I would hands down ALWAYS order the Sake Roll. <br><br>We left full, pleased and definitely got more than $24.99 worth of food. It's not the world's best sushi, but for the price & AYCE, it is definitely a 5 star in my opinion. Stick to the nirgiri & rolls and you will be sure to get your money's worth!", "pics": null}}, {"review": {"des": "This is one of the best AYCE sushi I've had in Chicago for sure. We came on a Friday night, so it was extremely busy and the atmosphere was lively and full of people. I would say if you want to come on a Friday or weekend night get a group of at least 6 friends and make a reservation ahead of time. Also, the more people you have the more mouths you can feed technically so more bang for your buck. My personal favorite was yellowtail sashimi and I really enjoyed their yellowtail because it was fresh and fatty. The volcano roll was also a surprisingly savory one for me but if you're not a fan of cream cheese I would not recommend. It's BYOB (if you want) and they will charge $10 for that. I think their alcohol was pretty good in my opinion. We got a lychee sake that was delicious with the sushi. The only thing that was different was that we drank it basically like wine and not the usual sake shot. Would recommend for AYCE sushi! Come hungry and expect a wait.", "pics": null}}, {"review": {"des": "The AYCE both lunch and dinner is worth your money. Not much rice is given, which is pretty rare for AYCE sushi places. Appetizers were so good we ordered for seconds. Excellent service. I came here twice in one month and was never disappointed.<br><br>The first time I came I stayed for 3 hours trying to regretfully finish all the sushi that was ordered. Don't get me wrong. The food quality was fresh and delicious. Ordering too much was bad on my part. <br>Second time-it was all about the appetizers. <br>Bottom line: would go whenever to fulfill my sushi cravings. And to get the appetizers.", "pics": null}}, {"review": {"des": "Found my new favorite AYCE sushi restaurant! $18.99 for lunch and $23.99 for dinner. We ordered the following appetizers and sushi rolls:<br><br>Appetizers:<br>- shrimp/veggie tempura (comes with 2 shrimp, broccoli, mushroom, sweet potato, onion ring and sauce)<br>- steamed shrimp shumai (6 pcs)<br>- miso soup (has some tofu)<br>- baked mussels (2 pcs)<br>- chicken karage<br><br>Sushi:<br>- godzilla<br>- rainbow<br>- dragon<br>- sapporo (my favorite!)<br><br>What I like about the sushi rolls are that they don't add a lot of rice like other AYCE sushi places.  They truly care about your experience and orders come out fast (granted the restaurant wasn't packed).<br><br>We came during lunch so we weren't able to get the mochi ice cream all the other reviews talk about. The waitress said we can pay the 23.99 price for the dessert, but it doesn't seem like the dessert is all-you-can-eat, so we didn't think it was worth it.  However, I am going here for dinner in a couple days! :)<br><br>Update: Came here again for AYCE dinner and ordered basically the whole menu. Still so good and fast even on a busy Friday night! <br><br>Tip: if you're getting the mochi cream, don't get green tea. Tastes not like green tea but flowery!", "pics": null}}, {"review": {"des": "Wonderful all you can eat sushi!!  Best deal in town and great quality.  Dinner or lunch is great. They now have a patio too.", "pics": null}}]}