{"name": "sweet-maple-cafe-chicago", "reviews": [{"review": {"des": "Excellent friendly knowledgeable service.<br>Cute subdued decor, including personal photographs of what looks to be a Southern country general store.<br>Excellent coffee!!!<br>The husband and I like to breakfast here.<br>Excellent biscuits (ask for honey which is very traditional with biscuits of this caliber), oatmeal, plain and cheese grits, fresh fruit medley<br>Sad to say, the husband says the eggs are too often overlooked. He's our resident egg expert.<br>I think that the breakfast offerings are great.<br>I highly recommend Sweet Maple.<br>Remember, parking north and south of Taylor St is restricted to those with a residential zone permit.", "pics": null}}, {"review": {"des": "I heard about Sweet Maple Cafe from my coworker, who said his girlfriend was obsessed with their cinnamon roll pancakes. Lucky for me and my friends, when we went last Sunday, it was the last day of their cinnamon roll pancakes. The pancakes were incredible - sweet breakfast items are my favorite, but can be tricky because sometimes establishments make them way too sweet. This cinnamon roll pancake was exquisitely made and the right balance of sweet and rich, without overwhelming me. Thinking about it now, I definitely wish I had ordered more of those instead of sampled my friend's food.<br><br>I ordered the salmon croquettes, which were good, but not mindblowing. I liked their biscuit a lot, which came with the croquettes, and the potatoes on the side were also well seasoned and done. Definitely very tasty. I would go here again, but might check out their menu in advance for when their specials are intriguing.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Tsiiuf6eh0wOHgt9uOiMbw/348s.jpg", "caption": "Salmon cakes, comes with a side of potatoes, eggs, and a biscuit"}]}}, {"review": {"des": "Hands down my favorite breakfast spot ever. Their biscuits still dance in my dreams. The place is quaint but so worth the wait. Everytime Im in chicago, I have to stop atleast once.<br><br>Portions are hearty and full of southern style love. It feels like youre eating at grandmas house.", "pics": null}}, {"review": {"des": "Six years later and this place is still so good! They accommodated 7 of us and a baby quite nicely considering the place is tiny. We were able to make reservations too, which was very convenient.<br><br>I built my own omelet with ham off the bone, spicy black beans, and jalapenos. On the side I got a biscuit, cheesy f'n grits and bacon. The bacon was meh though, nothing to write home about. <br><br>Check them out though, for real. That biscuit is LIFE!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SUe3ayw70RG0NbaynN7gJQ/348s.jpg", "caption": "Build your own with cheese grits and a side of bacon."}]}}, {"review": {"des": "Brunching at Sweet Maple Cafe on a Sunday morning was quite delicious!  Seven adult and one not-so-adult diners had an 11am reservation (it seems they'll take them for larger parties!). Be careful which door you try to enter through though. Someone else was trying to enter the restaurant through the neighboring door and that wasn't really working for them. <br><br>It's cozy inside with minimal decor. Their focus is on putting out homestyle food and they've got that down pat. The crew tried a little of everything - omelets, poached eggs, cheesy grits, buttermilk pancakes, biscuits and more. The buttermilk pancakes hit the table and their fantastic aroma wowed everyone!  Pancakes were served with the butter and real maple syrup on the side. These were worth the trip. Their sweet milk biscuit was ginormous for what I thought was one serving. It was flakey and just right. The bacon was nothing to write about. Really it was just average bacon. I also had an Arnold Palmer that was served without enough ice and warm tea. That was sort of a miss. <br><br>Service was good and no one rushed us along which was appreciated. We knew people were waiting and didn't intentionally linger, but we somehow missed the check hitting the table so we were probably there a little longer than they intended. <br><br>Street parking was easy enough and free on Sundays. The cafe is easy to find which is good because I need to go back. I really want to try their chicken breakfast tacos with spicy black beans and a slice of carrot cake. Soon. I'll let you know how that goes.", "pics": null}}, {"review": {"des": "(Insert spongebob plankton meme) yes....yess....YESS!! <br>This place has it all! Good food, great service and it's wonderful inside! Yes it's a little small inside but I was surprised how they managed to fit so many people and still make it comfortable! You have to see it for yourself on what I mean lol. I had the corn beef hash, and my family had the cinnamon roll pancakes, and let me tell you...it was all amazing! The portions are big and delicious! Worth every penny, and the biscuits...roh my gawd the biscuits were so good...I bought the bag to make em myself at home, which is odd because I NEVER buy that stuff at restaurants.  Look at my pics, see for yourself, you won't be disappointed. Come on down to Maples. <br><br>Peace out! :)", "pics": null}}, {"review": {"des": "Definitely a whole in the wall kind of place. The wait here is pretty long so definitely be ready to wait or run some errands. The portions here are HUGE, definitely Texan approved lol. Our server was super attentive and nice, the food itself was great. I was super happy when they cooked my eggs scrambled easy! Usually when I go to places and say that I end up with well done eggs. Oh and their \"side of bacon\" was what seemed like a whole damn packaged of bacon.", "pics": null}}, {"review": {"des": "Came here after mass at Holy Name, and we were pleasantly surprised st how cute and comfortable the environment was! We were seated within second of entering and had ordered an omelette and skillet. Both were too much for us to finish, so we packed it to go! You could easily split an entree with someone. The potatoes were a bit too thick for my liking and not as flavorful, but overall was happy with my meal.", "pics": null}}, {"review": {"des": "Although this is my first check in, this is one of our favorite breakfast joints. We find the atmosphere to be warm and welcoming. The staff is super friendly. And the food is most delicious. There's always a crowd. We love the biscuits--get them! <br>I'm having the salmon croquettes! Can't wait!", "pics": null}}, {"review": {"des": "Outstanding. Service was friendly and quick and the food was quite good. Loved the flavor of the maple-opolis omelet (mozzarella, feta, onion, spinach, and roasted red peppers). Cinnamon roll pancakes should not be missed. Charming little cafe.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/raqdGO8vLkgQo6Nfb3GOCA/168s.jpg", "caption": "Maple-opolis omelet. Mozzarella, feta, onion, spinach, roasted red pepper. Home fries and a homemade biscuit. Very good!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TsD5JaqkF1Oz4GpX48WuHw/168s.jpg", "caption": "Cinnamon roll pancakes, outstanding."}]}}, {"review": {"des": "Had a business meeting crack of dawn and we were literally the first customers to walk in the door....I had old fashioned oatmeal with fresh fruit, others had egg white omlette, steak and eggs.<br>Old fashioned breakfast place nothing outstanding!", "pics": null}}, {"review": {"des": "Well, my day was definitely sweetened by the Sweet Maple Café; I was having a blue-kinda day, and my friend said, \"pucker up, buttercup\"...and that's how we ended up at this small little café nestled in between the UIC campus and Illinois Medical District.  This is definitely a great pick-me-up café for worn-out students and run-down residents; of course, though, it attracts many other local residents.  Coming here in mid-morning on a Thursday it was very full, and I get the feeling that this is common for the Sweet Maple Café.<br><br>The first sign that this was going to be a good experience was the delicious coffee.  I have said it before, but I will say it again: I always judge a breakfast joint by the coffee that it serves...how can you be any type of good brunch joint if the coffee is bogus?  So, question of the day...was the coffee good?  The answer is, \"yes\".  I'm not sure what coffee they are using, but I barely even needed any sugar or cream for the coffee!  I'd have had two more cups if I would have had the time.  The coffee perfectly complemented the diaz y noches scramble (scrambled eggs with grilled chicken, jalapeno peppers, cheddar and given with salsa) which came with a biscuit and home fries.  I loved the biscuit and home fries, but then again I loved the entire meal!  My friend got some sort of French toast, but mine was better...<br><br>The service here is very kind - the young women who was helping was very gracious.  She was also attentive, ensuring that our coffee was always filled and that we had enough syrup, etc.  The waitress made us feel comfortable, but then again it was already pretty cozy in here.  I thought that Sweet Maple Café looked as if Cracker Barrel and Egg Harbor had made a baby - the atmosphere combined the best of both these restaurants...that's a compliment, believe me!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Yx9yC49kQlUGUPkd9TZLNg/348s.jpg", "caption": "Dia y noche scramble"}]}}, {"review": {"des": "Delicious ...and quick! Had the sweet mapleolopis omelet..sooo much food!! Coffee is served in a cup with a saucer.. sooo cute old school!!<br>Staff is friendly and efficient.. never had to wait for more coffee!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VoTeIjr7nN4GHfluy5rQwQ/168s.jpg", "caption": "Yummm.. get in my tummy!!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KqYYTw2rxfSnrWAlecu5eA/168s.jpg", "caption": "Sweet cafe with quite a great variety of breakfast foods"}]}}, {"review": {"des": "The food here is always great!! They serve breakfast and brunch. On the weekends they have specials! My favorite dish the super yummy Salmon Cakes and French Toast. It's a small restaurant but well worth the wait when it's busy. The wait staff is ok, nothing to brag about but I will say this...I've never had to send my food back. The managers are always busy working hard to make sure the customers are accommodated. So basically as long as my food is correct, delicious and I'm treated with courteousness and respect...I'm on cloud nine. I get all of that here and I'm pretty sure you will too.", "pics": null}}, {"review": {"des": "Brought my bff here who is visiting from Houston.  He ordered the Sweet Maple Special, I had Dr. Glenn's Scramble and we shared a half order of the Cinnamon Roll Pancake, which is one pretty large pancake.  Neither one of us wanted to have the extra carbs that come with a full order of the pancakes (haha) so we decided to share.<br><br>The food was really good.  The pancake was defly my favorite.  The top of it had this crunchy, carmelized part that cinnamon rolls have.  The waitress recommended that we pour syrup on the top and I agree that I liked it that way, but my friend tried syrup on his half and loved it.  He mentioned it to our waitress but she seemed annoyed.  Lol. <br><br>A great experience and would definitely go back.  FYI- there is construction next door, but still easy access to the restaurant.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0yD_KNYd1tSwP0rEMatm3w/348s.jpg", "caption": "Half of Cinnamon Roll Pancake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/muiO5Lui0RD-e8zU0C4AZw/168s.jpg", "caption": "Sweet Maple Special w Biscuit"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8qszgyUe7L0hYj_mNlASLw/168s.jpg", "caption": "Dr. Glenn's Scramble"}]}}, {"review": {"des": "Came here for brunch for the first time today and I was not disappointed! Everyone's food around me looked so good - which made it so hard to decide. I ended up getting Dr. Glenn's Scramble which was delicious!!  The house potatoes were soo good and while I didn't get to try the biscuit, they looked delicious. I'll definitely be back again.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WIFmbVGOzhA2cIp_0LzzZQ/348s.jpg", "caption": "Dr. Glenn's Scramble"}]}}, {"review": {"des": "Love this place! Real hard to get a table on the weekend cause it gets super busy, but they do take out", "pics": null}}, {"review": {"des": "Great breakfast spot in the UIC area! Portions are big, so if you were on a date and typically share, you can't go wrong here. <br><br>We split a custom omelette with the spicy chorizo and it was great! Dump some hot sauce on there and you're bound to be awake. But the highlight was the slacker fries. The corn beef hash with onions, cheddar, bell peppers and a kick of jalepenos were the highlight and made us clean our plate so the busboy didn't have to. <br><br>Although it gets busy around the prime brunch time on a Saturday, the service was amazing and quick! They turn tables around quickly without being pushy and rushing you. Overall, we are definitely coming back!!", "pics": null}}, {"review": {"des": "A throwback breakfast and brunch joint that transports you to grandmas house if you were a kid 50 years ago. The inside feels like a large living room from another era. I love this vibe here.<br><br>Food is high quality. Breakfast portions are massive. I usually get a three egg omelette that comes with a choice of bread and side. I get the house fries (DELICIOUS) and white toast. Their hot chocolate is also a favorite of mine - probably because it comes in a tall glass with LOADS of whipped cream :D<br><br>Taking a star off because they have a strict policy of one credit card per table and for some reason you must add tip before you pay... WEIRD. Also sometimes their coffee is cold. <br><br>Sweet Maple Cafe, with just a little effort you can become a 5 star spot for me. Its not big things to change. But the choice is yours... and yours alone. For now i'm enjoying myself.<br><br>P.S. = Free Parking across the street", "pics": null}}, {"review": {"des": "The best place for buttermilk pancakes in Chicago, always served with delicious pure Vermont maple syrup! They've got an amazingly warm, buttery, and moist consistency. I even tried Wildberry to see if it was any better and the buttermilk pancakes there didn't compare at all to Sweet Maple.<br><br>The daybreaker breakfast sandwiches here are also great, especially if you get them on their amazing biscuits. <br><br>Pro-tip: if they offer you a biscuit or toast, you should always go for the biscuit, you won't regret it! If you decide to go for the grits instead of the homefries (both are solid), consider making them cheesy grits for a small up-charge.", "pics": null}}, {"review": {"des": "We went there for breakfast today and we enjoyed it. It was our first time there, so we tried a variety of things. To start, our waitress was great. Just the perfect blend of patient and helpful. I wish I had gotten her name... one of the stars I'm giving is for the service. For food alone it'd be 3 stars. When we got there, we had to wait for about 5-10 minutes, which wasn't bad at all. The restaurant itself is a small place.<br><br>Food-wise vegetarian breakfast options were somewhat limited. Pancakes are on the menu so that's the main thing. They pancakes we're good. One order comes with two pancakes. Big ones.<br><br>Also tried some breakfast tacos. They were pretty good too. I liked the seasoned black beans. We upgraded the home fries that came with the tacos to be pick a pepper fries, which was good, because otherwise we would've had way too many.<br><br>I don't know why they don't have bagels, but I some toast instead. Oh, and coffee. It was fine. The waitress kept refills coming for me and even offered me some to go.<br><br>I recommend sweet maple. Thanks for a great breakfast experience.", "pics": null}}, {"review": {"des": "There was a twenty minute wait on a Saturday morning for Brunch. The place looks cool inside. Old wooden floors, cool photos hanging on the walls, even cooler wooden chairs. The food was good too. I got the Omlete with a side of fries and a biscuit. Everything was fresh and yummy. If it wasn't far from home this place would be a place I'd frequent on Saturday mornings for brunch. Thanks sweet maple!", "pics": null}}, {"review": {"des": "Really enjoyed breakfast. I had the chorrisimo tacos and it was the perfect balance of flavor of black beans, corn, some cheese, chorizo (not too much to ramp up reflux), and some fresh pico. Really good and would get again in a heart beat.<br><br>Went with two vegetarian friends and three carnivorous friends and I was the only one to get something with meat, so lots of options for vegans and vegetarians :).", "pics": null}}, {"review": {"des": "Good food at good price<br>Not very expensive<br>But nothing special on the menu, so that was a downside I must say.", "pics": null}}, {"review": {"des": "My friend and I came here on a whim and will never regret it due to the amazing biscuits. <br>I had the French toast made with Challah bread, sausage patties, and eggs. My friend had the fried chicken biscuit sandwich. She had it with American cheese and scrambled eggs. <br>We will be back for more biscuits . <br>Also, the staff was friendly and quick. It was such a homey atmosphere. <br>P. S. You can buy the biscuit mix.", "pics": null}}, {"review": {"des": "The food was amazing!!! There isn't much of a waiting area so if the weather is inclement be ready to stand outside on busy days. Definitely worth the wait. Can't wait to come here again.", "pics": null}}, {"review": {"des": "Yummy delicious! We stopped here on our way out of Chicago and I'm so glad we did. I ordered the corned beef hash, my wife ordered the French Toast and my FIL ordered the 2 eggs breakfast with a short stack on the side. Everything was fresh, amazing and homemade! The sweet biscuits were wonderful, the French Toast was super tasty and perfectly toasted, and the corned beef was truly homemade--nothing canned! <br><br>We love to eat/buy local and avoid the chain restaurants as much as possible and we rarely regret it. Today was no exception. If you're in Chicago, stop what you're doing and go grab breakfast here!", "pics": null}}, {"review": {"des": "We absolutely loved our experience here. We went on a Sunday around 10:30 am. We were seated in about 15 min which was much shorter than anticipated. Our waitress came right over and was great. Our beverages came right out and our food followed soon. We ordered chocolate chip pancakes and the breakfast that included eggs, bacon, cheese grits and a biscuit!  Everything was delish. We will definitely be back.", "pics": null}}, {"review": {"des": "Cute spot, wish the service wasn't so terrible. The food was decent, but not worth returning after having such a terrible first experience. Our server was rude and cared more about socializing with her coworkers rather than taking care of her tables.", "pics": null}}, {"review": {"des": "I ordered the French toast with a side of bacon. The French toast was amazing, the perfect amount of sweet. The bacon was ok, but no more special than what I can make from the local grocery store brand. My only complaint was the poor service. My friend and I waited about 20 minutes for them to take our order and another 45 minutes to receive our food, and all we ordered was an egg scramble and French toast. The only time our server came to our table was to take our order and bring us our food, did not even return one time to bring us drink refills. Even when it was time to pay the bill, we were not able to flag her down, and had to ask a different server. I don't appreciate when servers expect a tip for only dropping food off and nothing else.", "pics": null}}, {"review": {"des": "Cinnamon rolled pancakes.  Oh my gosh!! These pancakes were soooo good.  You can't eat them every day but once in a while is good enough.  My coworker had the french toast and another had the biscuits and gravy.  I'm not a biscuits and gravy chick but she enjoyed it.  I tasted the french toast, it was good-not as good as those pancakes.  <br><br>I didn't have any issues with the service.", "pics": null}}, {"review": {"des": "As usual, crowded....but that's because it's good food..great owner, good service...excellent establishment", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hjY9PJe9It8tI1g3TpuerA/168s.jpg", "caption": "Interesting take on corned hash....eggs and raisin toast"}]}}, {"review": {"des": "Amazing food. And cozy little ambience. We got the scramblers which were good but my favorite parts were the potatoes and the biscuit.  Coffee was also excellent.", "pics": null}}, {"review": {"des": "I don't know how this place isn't rated higher. Seriously the best Apple Spiced pancakes I've ever had. After reading a few reviews I had to give their biscuit a try and it didn't disappoint. Amazing service too.", "pics": null}}, {"review": {"des": "Great brunch spot in little Italy! The staff is very nice and the food is amazing as well.", "pics": null}}, {"review": {"des": "Yummy brunch spot! I usually come for there cinnamon roll pancakes, but I just learned they discontinued them so I tried a few new things. I ordered apple pancakes with Texas style potatoes on the side. It was alright.", "pics": null}}, {"review": {"des": "Some of the best breakfast I have ever eaten! Highly recommend! Biscuits, sausage gravy and grits are amazing. I have to go a few times a month!", "pics": null}}, {"review": {"des": "This adorable little breakfast place just warms my heart. It has such a cozy, inviting atmosphere. All of the food tastes homemade. We had great service and plenty of coffee refills!", "pics": null}}, {"review": {"des": "I have a severe dislike for businesses who don't split checks and aren't up front about it. The food is amazing, and the staff were nice, but come on. There were 7 of us and It was hard to coordinate that many checks.", "pics": null}}, {"review": {"des": "I am a huge sweet breakfast fanatic, have been to most of the popular breakfast places in Chicago, and their cinnamon roll pancakes are the best i've had by far. I couldn't believe how delicious they were! Perfectly sweet and absolutely amazing. You don't want to miss out on these!", "pics": null}}, {"review": {"des": "Sweet Maple used to be a solid go to restaurant. <br><br>However, after today it's questionable. <br><br>The female African American waitress was very rude and unprofessional. I asked if she could take our order. She ignored me and kept walking. Then I said, \"excuse me can you please take our order? \" She turned around and said, \"that's not my table. \"<br><br>Also, the ham was very dry. I had a piece and left the rest. <br><br>I'm very disappointed in what used to be a very good place to eat.", "pics": null}}, {"review": {"des": "This place has it all-- fast and friendly service, huge portions, homemade biscuits, bottomless coffee, and reasonable prices!  We also tried the wild blueberry pancakes with Real maple syrup, and steel cut oatmeal!  Excellent value, great flavors, and homemade items make this our favorite breakfast place in downtown Chicago!  It's a real treat!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/H70P5mJE_2EZC6hW3dAFyw/348s.jpg", "caption": "Huge portions!!  Omelette, fresh biscuit, home fries!  Fantastic!!"}]}}, {"review": {"des": "This place has the BEST blueberry pancakes. They are now probably my favorite pancakes in Chicago. I recently went here with my family for brunch and this cute little spot has an equally great staff and brunch menu. No gimmicks needed. Definitely a must-visit spot in Chicago. I also had the home fries and the bacon which were super tasty. Check it out!", "pics": null}}, {"review": {"des": "My hubby and I finally got here for breakfast on a weekday after having seen lines over the weekend. We were seated quickly, and our waitress was really helpful in her suggestion for the Chorrisimo Tacos. There were a ton of great options on the menu. I was able to swap out the potatoes for grits and tried my husband's pancakes. Needless to say I overate and everything was delicious. I had the grits leftover the next day and added ham to it and it totally hit the spot. Prices were reasonable and the service was quick and friendly.", "pics": null}}, {"review": {"des": "My family and I have been coming to Sweet Maple Cafe since I was a kid. It's one of our favorite places to go to for brunch and if you're a chocolate lover (like myself) I highly recommend the hot chocolate! Whenever I go there, I always get a sweet milk biscuit and Home fries. They have large portions and they definitely give you bang for you buck. <br><br>Make sure you sign up for their breakfast club too! They'll give you a card for free breakfast during your birthday month.", "pics": null}}, {"review": {"des": "Yummy! We were at the Illinois Medical district and this was a short walk. The staff at the restaurant were great. Warm and welcoming. We had the holiday French toast and peach iced tea. Delicious. We look forward to returning to Sweet Maple Cafe", "pics": null}}, {"review": {"des": "Came here on a random Friday for brunch.  The clientele consists of 60% neighborhood locals and 40% people who work in the hospital.<br><br>I'm reading some of the other reviews with positive comments about the decor of this place, and I don't really get it.  To me it felt like an inner city cafe that was not particularly well kept.  I think they need to work on renovating the place.<br><br>The food is decent.  I think if I worked at UIC or Stroger and had ample free time in the late mornings to go for brunch, I would probably go here pretty frequently.  I got the fish and eggs which is a Friday special - the fish seemed a bit oily but the eggs and potatoes were pretty solid and I also liked that they gave us the option of cinnamon raisin toast.  My wife got the Taylor Street omelet which was a pretty standard omelet, but I liked the addition of the Italian sausage.", "pics": null}}, {"review": {"des": "Restaurant for years... I love their biscuits pancakes, waffles, hashbrowns(you must ask them for crispy otherwise I feel they're a bit under cooked... <br>The service is good.. waitstaff friendly.. the coffee taste like a good Greek diner. <br><br>THE PROBLEM IS THE WAIT... but I guess anything worth having is a worth a good wait.. enjoy!", "pics": null}}, {"review": {"des": "I was so excited to go here since it's in the same community of my school... but I was sadly disappointed. The seating was limited the service was pretty fast. The food was terrible. <br><br>The food.. I got pancakes with bacon the simplest thing you can order but somehow they messed it up. I got the not so plain butter milk pancakes, they were the most dense, flat, dry pancakes I've ever had. McDonalds pancakes (frozen) are better than them. A full order of pancakes only 2 is $8.25. I think they're over priced and totally not worth it. My BF ordered the holiday French toast and bacon he liked it.<br><br>Overall, I will never visit again and I do not recommend.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mxlMrn-SmVvU6wdeEnfVoQ/168s.jpg", "caption": "Pancakes"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AxCYI0awQyahlBBASVTODw/168s.jpg", "caption": "French Toast"}]}}, {"review": {"des": "We were looking for brunch on Yelp and stumbled upon this hidden gem. Everything about the Sweet Maple Cafe was amazing. The food was delicious and the was something for everyone. They had a lot of chicken options, which is a rare find for a breakfast place. The atmosphere was \"shabby chic\" and absolutely adorable. Our service was great. There wasn't an empty cup on the table at any point. And even though we left just 15 minutes before closing time, I didn't feel rushed by any of the staff at all. I will definitely be making Sweet Maple Cafe a regular stop on our Chicago itinerary.", "pics": null}}, {"review": {"des": "This is my favorite breakfast place in the city. It feels like something you'd come across in a tiny downtown area of a small city. It's a tiny hole in the wall and the wait can be long, but it is absolutely worth it. The waitstaff is incredibly sweet, and the food is delicious, especially the biscuits. The only thing I've had that wasn't perfect was the chocolate muffin-- it was just okay. Price is very reasonable, especially for the quality and portion size. Highly, highly recommend.", "pics": null}}, {"review": {"des": "Busy Saturday morning spot that is definitely worth waiting in line for. Food and service are top notch. Breakfast tacos were delicious and filling. Place is lively and has a friendly feel. Great for a couple or a tableful.", "pics": null}}, {"review": {"des": "Huge portions for a great value. Staff was very attentive. Coffee was always being refilled. It is a small place, so there is typically a wait, but I've never waited more than 10 minutes for a table for two, and it's totally worth the time. The biscuits are so good. There's a lot of street parking in the neighborhood. The side of bacon is about 5-6 strips! Amazing, I'm so used to 2 shriveled things on the side, I was blown away. I had to take at least half of it home, but it reheated well.", "pics": null}}, {"review": {"des": "If you are looking for some good pancakes in Chicago then you need to make your way to Sweet Maple Cafe. I am telling you these pancakes are big in size and flavor. Let pancakes be your choice of breakfast at Sweet Maple. These will bless your soul. Growing up this was a childhood favorite so I had to come back and the taste was just as good as I remember. I sampled their blueberry and sweet cinnamon roll it was so delicious. The only thing you will need after that is a bed to go to sleep in. Make sure you make your way here.", "pics": null}}, {"review": {"des": "Really sweet place to get brunch! My family and I originally planned to go to one of the Wildberry Cafe locations in the Chicago area but were deterred by the excruciatingly long, two hour waitlist. Desperate for any pancake place with enormous portions, we ran across this area, and waited for ~30 minutes for my party of 6 to be seated. Within 15 minutes of being greeted by friendly staff, we ordered and got our food. Everything tasted spectacular (enhanced by our extreme hunger) and the home fries were top notch amazing in particular. Dishes can be split into 2-3 portions, which can definitely help reduce the bill in the end. Overall, we would absolutely visit again.", "pics": null}}, {"review": {"des": "I was staying near the hospitals so this place was an easy walk the few blocks over. Upon walking towards the block, you could see several people seated outside waiting to be called for a table. I wonder what that looks like in the winter. I put our name on the list and had time to walk to the next block for coffee and back before being called. It's a small but cute place with distressed walk designs that looked like repair was needed.<br><br>I went about a week ago and it took me a while to remember what I ate here which means it wasn't mind blowing. I had Dr. Glenn's Scrambler which had scrambled eggs with ham, Cheddar, spinach, red bell peppers, and mushrooms. The ingredients were separately tasty, just seemed to need seasoning. It came with their home fries/potatoes which were really good and a biscuit. The people next to us and the server (who was really nice) went on about how great the biscuit was but I didn't like like it. I'm a fluffy and soft biscuit lover and this one was a tad too dry and crunchy for my liking. If that's your thing, you'll love it. <br><br>I've had better and I've had worse but I probably wouldn't return intentionally.", "pics": null}}, {"review": {"des": "Amazing breakfast and brunch spot! The people working there are very friendly and try to seat you as fast and as best as they can. Your party must be all present in order to be seated! This place is small and cozy so definitely try this place out on a weekday or early early on the weekend, because the weekend wait time can be as long as 2 hours!<br><br>We ordered the blueberry pancakes, Maple-Opolis Omelette, and a small freshly squeezed juice. <br><br>The pancakes were phenomenal! So airy yet dense at the same time, its inexplicable. Each bite was just so heavenly! Perfectly sweetened and delightful. We will definitely be back to try the other flavors of pancakes. <br><br>The Maple-Oplois omelette itself was filled with delicious veggies and cheeses. The house potatoes were well seasoned and crispy. The biscuit was crunchy at the edges and dense in the middle. Nothing better than a great hardy breakfast!<br><br>The small OJ was fresh and had a bit of pulp in it, which I personally like a lot. <br><br>Great place for breakfast and brunch!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mR-lJ5MCm2pX4h4HNB45JQ/348s.jpg", "caption": "Front: Maple-Opolis, Back Left: Blueberry Pancakes Back Right: Sausage and Cheese Sandwich"}]}}, {"review": {"des": "It's a small cozy breakfast/brunch spot with an inviting atmosphere. The wait can be long but the food is worth it. It's now my favorite spot to come get biscuits and gravy.", "pics": null}}, {"review": {"des": "Came around 1pm on a Tuesday with a party of 8 and was able to be seated quickly. I had the Dr. Glenn's egg scramble (~$11) which has ham, bell peppers, cheddar, spinach, and mushrooms. Tastes amazing with a little bit of tobasco sauce. Comes with home fries or grits and biscuit or toast. I had the home fries which are basically breakfast potatoes. They were cooked to a perfect balance of crispy and soft. The biscuit is huge and tastes great with the assortment of jelly they have on the table. I personally liked the blackberry jelly the most. <br><br>All in all, a very solid brunch place :)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Ca26j629jNnMEyCoMXtp2A/348s.jpg", "caption": "Dr. Glenn's egg scramble"}]}}, {"review": {"des": "Sweet maple is my grandma's kitchen .Way up in the country.The food is so good .My favs The potato skillet with bacon ,peppers.And of course the blueberry pancakes.", "pics": null}}, {"review": {"des": "I visited today with a girlfriend of mine that I haven't seen in a while. Our server was awesome and recommended the Cinnamon Roll Pancake, which was DELICIOUS! Why the 2 stars you ask??? Well, the Asian/Hispanic girl came to our table immediately after we finished our meal and said \"Is there anything else we can do for you? We have a line.\" As a paying customer, I don't need to be rushed out of the door because others are waiting. Please note that I do understand the desire to get people in and out, but it is RUDE to basically kick people out! I really don't think I will visit again simply because I cannot deal with businesses who do not value their customers!!! I really hope a manager sees this!", "pics": null}}, {"review": {"des": "Can we talk?<br><br>I absolutely love the ambience of this place.  The weathered hardwood floors, homey table settings, roughened stain walls, and the pleasant servers makes Sweet Maple Cafe feel like you're in a time machine and have been transferred back to the 50s!!! <br><br>Now...on to the food.  So good.  The pancakes are my favorite.  Breakfast is truly real at SMC!  That bacon, though!!! It's true: everything is better with bacon. <br><br>There's a bit of a wait to be seated, but that's to be expected with a place that has great food.  The wait is worth it. Enjoy!!!", "pics": null}}, {"review": {"des": "Really good food, but service.. not so much. We visited last weekend and had their buttermilk pancakes and omelettes. However, we were not able to get the satisfied service that we expected. I felt like the servers were inattentive and we had to wait for so long to get one extra syrup for the pancakes and other things that we needed during our meal. So we let it go and just ate. Maybe it's because they thought we were students and would not tip as much. They gave us the bill about 10 minutes after we received our food. We felt very rushed and left with our packed leftover food. Working as a waitress, I do know how hard to be attentive at all times when it gets busy, but there were times that they definitely could've checked on us..at least once, other than raising my hand high to get them to notice us. Hopefully next time we visit(?), they will give us better service because we want to be treated like other respected customers.", "pics": null}}, {"review": {"des": "Great breakfast spot near Rush hospital area/little Italy.  After taking my grams to an appt at the hospital we were looking for a nice breakfast spot.  Thankfully my fellow yelpers didn't steer me wrong.  This place is a gem, the only reason they didn't get the full 5 stars are the prices, a bit high for breakfast in my opinion but aside from the pricing I really loved this place and so did gram (and she is a hard sell :)  The menu has a great variety and even though I was dying to order the special cinnamon roll pancakes I went for the sweet maple signature, two eggs, sausage patty, home fries, and biscuit.   The portions are huge and everything was fresh and flavorful, I will definitely be back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/28zVU5mlivYhyKJ2aK-cLA/348s.jpg", "caption": "2 eggs over medium, home fries, biscuit and sausage patties, so look good!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7nsHiov6Puyo8wIEDqAHTg/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YmMhkumjjFMP-vg4MYcGNQ/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "I enjoy the food at sweet maple. I had the salmon croquette special but I don't think I would get it again. There are many other places in the city with better salon croquettes. The waitress was very nice and my eggs were cooked perfectly. Also loved the biscuits!! They are a must try. I also had a taste of my friend's cinnamon roll pancakes. They were great but i that the topping was layered between the pancakes. The bottom ones were very dry since the topping was only on top.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FZlxjVV5NNEaH1CxKaoEoQ/348s.jpg", "caption": "Salmon croquette special"}]}}, {"review": {"des": "Specials today included the cinnamon roll pancakes and salmon croquettes!  I ordered the biscuit today - it's delicious! This place remains a staple in the mix of breakfast go-to's in Chicago. The staff is always friendly and kind.", "pics": null}}, {"review": {"des": "I Love their breakfast!! Pancakes,  French Toast,  Biscuits,  Cheese Grits,  Potatoes!!! All Delicious!! <br>I love that it's a Black Owned establishment and the food is outstanding!  I have yet to come in for lunch,  but I will soon!!!  It's a small space,  but it's cozy and authentic,  very much so southern style decor! <br>I Love It!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/o5hnf-mbjElORT9T06HzeQ/348s.jpg", "caption": "French Toast!  Homemade Syrup!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ADMLX4mKffSbsNQ2GPSJPw/168s.jpg", "caption": "Pancakes,  Bacon French Toast"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/04rjn8HVuxheJh8N_UEmQA/168s.jpg", "caption": "Hot Chocolate"}]}}, {"review": {"des": "Nice little breakfast joint in what I call my neighborhood now. I have been there a couple of times and feel the service is extremely friendly. The menu is greAt. I have really enjoyed their omelets which are served with their signature buttermilk biscuit (delicious). I don't have much of a sweet tooth but I tried their choc chip pancake and it was great!", "pics": null}}, {"review": {"des": "Was headed to the Lagunitas Brewery with a friend on Friday and stopped in at Sweet Maple on Taylor street for some brunch. This place isn't very big, but has a lot of that old-school charm to it. We got a table after about a 5 minute wait. I imagine it gets very crowded on the weekends.<br><br>Their menu has a nice mix of sweet and savory options as well as lunch fare. Be sure to check the board for daily specials and fresh bakery items too! My friend got the 18th street scramble and I went with the special of the day, cinnamon roll pancakes. They tasted great (hard to screw up cinnamon roll pancakes am I right?) and were super filling. I recommend putting a little butter on it to soften the texture up.<br><br>On par with that old school charm I mentioned, prices are VERY reasonable. Our total including tip was $32. Great food, low prices and friendly staff...all signs point to a 5 star review for this Little Italy brunch classic!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OJ8Uv361wJAEPFu2CgHx4w/348s.jpg", "caption": "Daily special: cinnamon roll pancakes...ohhhh yeah"}]}}, {"review": {"des": "Disappointed with the food that I got today. My Turkey sausages were so hard to cut and super dry. The French toast tasted like it was frozen and reheated in the microwave because the crust was solid as a rock and only a little bit of the bread was actually soft & edible. The waitress spilled coffee on our table, didn't greet us, forgot my syrup, & didn't really bother to check on us. Too bad she sucks at customer service because I'm a great tipper and she missed out on it. Anyways, I lived in NC for 4 years so I've had real country style food and this place doesn't even compare or satisfy the itch of when I'm craving country style food. Save your $ and take it somewhere else where they will value you.", "pics": null}}, {"review": {"des": "Cute little spot. The wait for two people was not bad on a Saturday late morning. Good amount of street parking too. <br><br>I ordered the egg and cheeser with Swiss cheese, scrambled egg and bacon on the biscuit. It was decent, but nothing that stood out to me. The highlight of the meal was our Monterrey potatoes. They were delicious! The best part about them is that the bacon chunks that come on it are a good size. I would definitely order those again, but would try something else on the menu for the main course. <br><br>Tables around us that ordered French toast and pancakes looked amazing... & sweeter options for breakfast don't typically appeal to me, but the looks of it alone would probably force me to order one of those items when I go back. <br><br>I was satisfied with our service-our server was good, but it seemed that some tables around us had issues with even getting drinks started. It is such a small place and there seemed to be plenty of staff so I don't think being inattentive is justifiable. It felt like there was a lot of unnecessary chaos around us, but yet I still had a personal, positive experience with service. <br><br>Be aware though That their new credit card terminal doesn't allow you to split the check-they only can accept one credit card per table...so if you plan on splitting the bill, come with cash.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Vq-KRt7GRExl6PiCIjUHMQ/168s.jpg", "caption": "Monterrey potatoes"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/z8UIk0ltlrBYgUxomS_2gA/168s.jpg", "caption": "FYI"}]}}, {"review": {"des": "Great little place, awesome food, great atmosphere. The cinnamon roll pancakes are amazing.", "pics": null}}, {"review": {"des": "Wonderful customer service, awesome food! Love it! Highly recommended to family and friends! Get here early!", "pics": null}}, {"review": {"des": "Best biscuit I've ever had in my life (the sweet milk biscuit, NOT the cornmeal biscuit). Everything else was pretty standard breakfast fare; order a sandwich or something biscuit-based", "pics": null}}, {"review": {"des": "Long wait, but it was our fault for choosing a wknd visit. <br><br>Staff were friendly. The food was delicious. We had French toast that was dipped in some type of custard (so good).They tasted like a cross between birthday cake, a vanilla wafer and Christmas. <br><br>Fried potatoes were made just right. The blueberry pancakes had really fresh blueberries that popped as I chewed. We also had the slacker fries (potatoes with corned beef hash, jalapeño, bacon & cheddar cheese). We loved everything but the hot chocolate. <br>The whipped cream was good, but the drink was too watery and luke-warm. <br><br>Overall I would visit again just for the French toast alone.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/v7qD8l6Lc91qT0wzoWOEVA/348s.jpg", "caption": "Home Fries and Bacon"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VudW11CfB9CY0_EhAJc0Lg/168s.jpg", "caption": "OMG. the French Toast and Slacker Fries"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7hzNFW5Ft1mWtFU7P4J2CA/168s.jpg", "caption": "Blueberry Pancake with real syrup."}]}}, {"review": {"des": "Good classic American food with Southern charm, friendly staff, and tasty specials.  One of our regular spots", "pics": null}}, {"review": {"des": "Small little gem hiding on Taylor street.  If you're in the area please go here!  Everything on the menu is delicious and their staff are willing to help you if you cannot make up your mind. Delicious pancakes!", "pics": null}}, {"review": {"des": "Cute and cozy breakfast/brunch spot. The service was really wonderful and the food was delicious. The biscuit is the standout for me. I ordered an egg scramble which was super filling.", "pics": null}}, {"review": {"des": "The corned beef hash was definitely the best I've ever had. Cinnamon roll pancakes also were amazing. I'd definitely recommend this place. Get there early though, it's very small and busy.", "pics": null}}, {"review": {"des": "Poor service, I would not recommend eating here. They prefer to keep empty two tops as opposed to making a four top. Also, the service was quite rude.<br><br>The food is very sub-par. I wished for a shortened lifespan after eating there. Cardboard and styrofoam come to mind. A typical Taylor street restaurant, lacking.", "pics": null}}, {"review": {"des": "Ugh so damn good eggs melt in your mouth. We did have to wait a little bit but it's worth it!", "pics": null}}, {"review": {"des": "We were not impressed.  I had Dr. Glenn's scramble with a side of grits.  Boyfriend had just the eggs side. The grits were the star of the table.  I ordered one of the famous biscuits but was wholly unimpressed by the overwhelming presence of cornmeal in them.  My eggs were a lackluster a mix of thick cut ham and lean lunch meat sliced ham,the red peppers were fresh and the mushrooms mehh.  I think the topping on this disaster cake was the bit of hair lodged in my butter and the 10 minutes I waited for a new pat.  I won't be back.  Thanks for playing.", "pics": null}}, {"review": {"des": "Only giving two stars because my girlfriend liked it and she wouldn't allow me to give none. <br><br>I ordered an omelette but it seemed like I just ordered veggies wrapped in an egg crepe. I also ordered buttermilk pancakes but that tasted like a protein bar.", "pics": null}}, {"review": {"des": "There is a gravel parking lot across the street from the cafe that is free to park in...you don't need to pay.  It was fast and Delicious!!!", "pics": null}}, {"review": {"des": "The food is really good here. It is a small place so expect a wait if you plan on coming around 9 or 10 am. The prices are reasonable. They have Fish and Eggs on Friday. That's what I got. I really enjoyed it. I'll be back to try something sweet soon. Overall, it's a nice small place for breakfast and/or brunch.", "pics": null}}, {"review": {"des": "Really liked this place, definitely worth the wait. Their pancakes were amazing as was everything else. Recommend checking out their daily specials and ask if there's something else you want. They seemed very helpful and willing to customize.", "pics": null}}, {"review": {"des": "I went here for the first time a few weeks ago in search of a new breakfast place to try. I hear there is usually a little bit of a wait, but we got in right away! The food is delicious! I loved their biscuits! They give you a lot of food for a good price. I will return!", "pics": null}}, {"review": {"des": "The kind of place where the server greets you with, \"coffee?\", no good morning or welcome. Our server, Maira,  wasn't very friendly and never checked up on us so we had to flag her down to tell her there was a hair in our food but by then it took so long and we weren't going to wait for fresh food. she didn't apologize or bring the manager. There was another server there and I wish  we had sat in her section.  I enjoyed the diced potatoes but that was about it.  I was really excited to come here with my friend but felt embarrassed that I even brought them, definitely won't be back.", "pics": null}}, {"review": {"des": "Really enjoyed the food. The biscuits were fresh and the  grits were great.  The place is small so be prepared to possibly sit by the door. We didn't have to wait long however we went on a Monday around noon.<br>The only bad thing was when we received the check,  the total that was hand written on the check was not accurate. The total that was handwritten was $3 more than the actual amount. I informed the waiter and she corrected the mistake but that just seemed a little bit sketchy to me. I would return to this place because the food was delicious but make sure you add up your items and compare it with what the waitress brings to you.", "pics": null}}, {"review": {"des": "I just came from Sweet Maple Cafe the breakfast was delicious the service was the bomb Oh my God you have to come I would advise everyone to come before 9 if you want to get seated quickly try there Sweet Maple breakfast and the pancakes they are to die for", "pics": null}}, {"review": {"des": "I like this Cafe because it was such a cute, American breakfast place. The place was small and crowded, but I came at 12pm on a Thursday and no wait! <br>I got the Chocolate Chip pancake and it was super fluffy and delicious! I'm not sure this is a place that I would come back to, but it's pretty good! <br>The ambience was nice and very American!<br><br>I gave it a 3 stars because the food wasn't anything spectacular, the atmosphere was nice tho!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4IPUK71hX17IK3LDI2eIlg/348s.jpg", "caption": "Chocolate Chip Pancake!"}]}}, {"review": {"des": "18th street scramble - 5/5 - great tasting chorizo with peppers and queso fresco<br><br>Biscuits with sausage gravy - 5/5 - it's more like sausage with gravy in it. So much sausage! Got it with eggs over medium on top which was a fanatic way of doing it. <br><br>Monterey Home Fries - 5/5 - big strips of bacon! cheese, jalapeño, peppers<br><br>Sausage patties were so juicy and bone in ham was the best ham side. <br><br>That Carolina is going places!", "pics": null}}, {"review": {"des": "Oh my goodness. This place is a gem. I love love loved every bite. I ordered a custom omelet with Italian sausage, spinach, potatoes and mozzarella cheese. It came with a biscuit that tasted like a cornbread-biscuit hybrid and some potatoes. Delicious. <br><br>Coffee hit the spot. Refills were on point. <br><br>I came in and was waiting for friends. Tables were available working 20 minutes. Honestly the service is excellent. <br><br>I only come to Chicago about once a month. I will definitely be bringing other friends here.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/q7abyyj8SLA3edOgcj_isQ/348s.jpg", "caption": "Omelet with potatoes."}]}}, {"review": {"des": "I had been meaning to go to Sweet Maple for a while but didn't have the chance till very recently. <br><br>The ambience was great, it had this retro look to it which gave it a lot of character. We were quickly seated and our waitress helped quite a bit with recommendations.<br><br>I had the Cinnamon Roll Pancakes which were fantastic. I was a little afraid that they might be too sweet bit they weren't. I also had a lemoande with freshly squeezed lemons and strawberries and a hint of coconut. I can't rememeber what it was called but it was fantastic.<br><br>Overall I loved the food, the ambeince and the service, the only reason the place loses a star for me is because they could only take one credit card per table, which is something I always find extremely inconvenient especially if the restaurant is in an area with so many students.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FoGK8B1UwMJ_fRb1UZANJw/168s.jpg", "caption": "Cinnamon Roll Pancakes"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/p4EQnB8au8x6Vc5VgzmQKw/168s.jpg", "caption": "Fresh Strawberry Lemonade with Coconut"}]}}, {"review": {"des": "Delicious brunch spot. The food was full of flavor and satisfying. Could use some sprucing up however I get the \"vibe\" they are going for. Country feel of being in an old house.  We each ordered the toss up, to our liking along w the chocolate chip pancakes. So yummy! The service wasn't the greatest, she was very forgetful and seemed annoyed from the moment we sat. Expect to wait for a table although it is worth the wait.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CAqSCiSDV9o5l_kCXWJkxQ/348s.jpg", "caption": "The toss up!"}]}}, {"review": {"des": "I'm really having difficulty understanding the appeal to this restaurant.  I've tried it a few times and there is nothing special about the food.  People wait in line to eat here, it's a nice little place and kept clean.  I thought the service was fine, they are fast moving and getting people in and out.<br><br>The biscuits are very dry.  The pancakes aren't fluffy and on the dry side.  The scrambled eggs are very \"flat\" meaning there is hardly any water or milk added if any at all.   The corned beef hash is just their home fries (potatoes diced into tiny cubes and fried until crispy) with diced corned beef sliced into tiny cubes - it is not a wet corned beef hash, it is dry.  I thought it was an error the first time but that's apparently how it's made.<br><br>I also noticed that this is supposed to be a \"southern\" breakfast/brunch spot.  Other than grits, can someone explain to me how this is a southern restaurant?  Because some of the specials are breakfast TACOS and Italian style.  Nothing on the menu screams \"southern cooking\" to me.  If you want to know what southern breakfast is like, go check out Wishbone in West Loop.", "pics": null}}, {"review": {"des": "Service was slow and they didn't appear to be busy.  I had people around me arrive after me and received food before I did. Sever was not all that attentive and food was okay. Pancakes seemed slightly under done. When I was done with my meal it took a while to get a to go container as well as the check. Not to mention when I was finishing off my orange juice I noticed at the bottom of the glass that there was a fruit fly in it. Definitely will not be back.", "pics": null}}, {"review": {"des": "Visit Sweet Maple cafe for a no-frills, absolutely delicious brunch and breakfast experience. The place is a little crowded on weekends (as is any brunch restaurant worth its salt) and waiting times can range from 10-30 minutes depending upon the size of your group.<br><br>The servers are brisk and competent without being too chatty (which is honestly how I prefer it to be; I do NOT look good attempting to make small talk while stuffing my face with scrambled eggs). The menu does not overwhelm, and I've never had to wait beyond 10 minutes to get my order, even on a Sunday.<br><br>I love their scrambled eggs, served with a side of grits or home fries and toast or biscuit. Everything is well seasoned, cooked to order and not too greasy. The food is also well portioned, albeit a little pricey. I'm not a fan of coffee, so i stick to the freshly squeezed orange juice which could do with the addition of a little more pulp. Their chocolate chip pancakes are fluffy and they're generous with the chocolate chips, which is all I really want from chocolate chip pancakes.<br><br>Docking off a star because they don't serve waffles and that really disappoints my inner Leslie Knope! Also, they only accept one card per table, which is old-fashioned at best, and inconvenient at worst.", "pics": null}}, {"review": {"des": "Early morning breakfast right around opening on Saturday - no wait! We were seated right away. Delightful and quick service.<br><br>Taylor street omelet - I enjoyed it! It's a pretty basic omelet but tasty nonetheless. The home fries were killer and even better with the hot sauce. The biscuit was the only thing I was unimpressed with - it's big but doesn't have the buttery, flaky goodness that you want to taste in a biscuit. <br><br>Lemon raspberry pancake - I like that you can get a 1/2 order (1 big pancake) instead of the full (2 big pancakes) just for a little taste. 1 pancake was enough to share between 3 people who wanted a little bit of sweet next to our main savory dishes. <br><br>Cute little cafe and a rewarding brunch after a long week!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/W7jMnpuPcu3afb7gOxXXxA/168s.jpg", "caption": "Lemon raspberry pancake (1/2 order)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YOW31rj1A_r_BMcYwfUwMg/168s.jpg", "caption": "Taylor st. omelette"}]}}, {"review": {"des": "SO flippin' good!!!<br><br>Be prepared for a wait, as the place is a little small and very popular. If you get there by 10, the wait should be no longer than 20 min, and there are chairs outside.<br><br>*** It's a 15 min walk from the Racine stop on the blue line  OR there is a FREE gravel lot across the street ***<br><br>Choosing something to eat here is tough, as there is so many perfect choices. I ended up ordering the Carmen G scramble- eggs w your choice of cheese, bacon, spinach, mushrooms, home fries and a biscuit and was sooooooooo happy with my choice. The portion size was big, but not huge to where I couldn't finish it. The home fries were nice and crispy, not overly greasy, and the biscuit was a huge square of carby heaven! YUM. I could go for the same meal again right now. Two of our other companions ordered a half order of pancakes- aka one pancake. It was the size of the entire plate! They had to quarter it to eat it and could barely finish it. I was impressed!<br><br>They stayed on top of coffee refills the entire meal too. With tax, our meal/drinks was about $15 per person, which I didn't think was too exorbitant. I will be back!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NvBRbZri4MTAMqNBC-BJUg/348s.jpg", "caption": "Carmen g scramble, home fries, biscuit and my guy's side order of cheddar grits"}]}}]}