{"name": "sweet-mandy-bs-chicago", "reviews": [{"review": {"des": "Sweet Mandy B's is my go-to for cakes.  I've ordered at least ten birthday cakes from this place, and they have always looked beautiful and tasted wonderful.  The prices are very fair compared to other similar bakeries.<br><br>My most recent visit was to pick up a birthday cake for my mama.  I ordered a yellow cake with strawberry icing; it was in line with what I've come to except from Sweet Mandy B's.  My only quibble is that there is far too much icing for my tastes but seriously we just scraped most of it off and kept eating.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Iz20DpSWGVaTFHgIAaoX-A/348s.jpg", "caption": "Birthday cake"}]}}, {"review": {"des": "Yummy!!!!! This place scored well with me! Believe the yelp reviews!<br>Parking is tough, we parked down the block and walked over. There was a line of mom's with strollers and kids so I'm assuming after school (around 2pm) is prime time?<br><br>We jumped in line and basically what you see in the glass window is what you get. I really wanted cheesecake for my boo but the only kind they had was turtle. But he saw the key lime pie and was like screw cheesecake! I decided on a red velvet cupcake and coffee. <br><br>We paid and took our treats downtown to our hotel. I sat them both in the fridge and didn't touch them until about 3 hours later. I intended to taste my cupcake and ended up devouring it! It was delicious! So moist and not overly sweet. The icing was perfect. He decided to eat his key lime pie around midnight. He loved it and said it was real pie and not that green stuff that people pass off as key lime pie. <br><br>Thanks so much for a sweet weekend!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/olsxXyre9rcSBHE4zA0gcA/168s.jpg", "caption": "Red velvet cupcake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8Y7apt5kqWDuHK41dw1BwQ/168s.jpg", "caption": "Key lime Pie"}]}}, {"review": {"des": "The desserts are delicious, the best old fashioned sweets in the city. My only complaint is the cake slices are often times old, so I would avoid those.<br><br>The service is consistently unpleasant. I popped in on a Saturday and I was the only person in line. This lady shouted at me, \"are you ready.\" I said distinctly may I please have a frosted brownie and she cuts me off halfway and said anything else. I said no thank you, making zero eye contact she puts out her hand for my CC (doesn't tell me the price). I hand it to her and in her hast and unnecessary rush grabs my CC and it flys across the room!  I laughed because she was so unnecessarily dramatic. You are not saving lives, just pies. Desserts are an indulgence and people going to eat them are usually happy. Maybe mimic your customers a bit.", "pics": null}}, {"review": {"des": "In the words of my husband, it was good... but not life changing in the way we hoped. We stopped in tonight after dinner in the West Loop. We both wanted dessert and coffee; many other places we were considering closed earlier than Sweet Mandy B's. <br><br>I ordered the lemon cupcake. My husband liked it - I didn't feel like the lemon flavor was strong enough. I want to be smacked in the face with citrus whe I have a lemon cupcake. This was subtle and balanced -- everything I am not. <br><br>My husband ordered the ranger cookie, which he devoured. He was less pleased with the bar he ordered, some award winning dessert that's a foundation of Rice Krispie treat with peanut butter frosting and chocolate fudge. It was too sweet for both of us and, sadly, went mostly uneaten.<br><br>The staff were kind and patient in answering questions and making recommendations. They were also quick to jump in during a rush and start managing the line. <br><br>I would come back and try their pies or even another cupcake flavor.", "pics": null}}, {"review": {"des": "I was doing so good with not eating sugar too.<br><br>Flew into Chicago last week and met my husband here, who came early for a business trip.  His coworker (who lives locally) took him to Sweet Mandy B's, saying that it's a favorite of his mom's.  He recommended the peanut butter rice krispy treats, but they were out the day they visited.<br><br>So my husband got a chocolate mousse cake slice and a flourless chocolate cake.  Well, when I arrived, there was half of the flourless chocolate cake in the fridge.  I took a bite and oh my goodness, it was fabulous.  Definitely rich and decadent but not overly sweet as some cakes can be.  Nursed the cake for the next couple of days (trying not to appear like a pig and eat it too quickly).  <br><br>Husband wanted to take me there so we went last night.  Cute little place.  A lot of temptations.  We pretty much bought everything that looked good.  The red velvet cupcake was great; cream cheese frosting was spot on, though it was a little sweet and gave me a bit of a sugar headache afterwards.  Lemon cheesecake was great.  Husband devoured the chocolate mousse cake the first night (I thought it tasted way too sweet).  <br><br>Flourless chocolate cake is probably my favorite here.  <br><br>Wonderful place to check out for special events/occasions or if you're visiting Chicago.  So glad we don't have this place closer to us or we'd be in a lot of trouble (calorie-wise).  :P", "pics": null}}, {"review": {"des": "It's hard to go to Lincoln Park and not make a pit stop here. I love this place. From their perfect desserts to their cutesy sitting area to the friendly staff, I really enjoy this place. Everything I've tried at sweet Mandy B's has been great though my favorites are the peanut butter Rice Krispie treat, the cupcakes, magic bar, and the chocolate chip cookie. Solid dessert spot!", "pics": null}}, {"review": {"des": "I can't believe I forgot to write a review for this delightful little spot!  I am SO glad we stopped here while we were visiting a friend in Chicago.  This place was a HUGE hit with my little one!  It was quiet here when we arrived mid-morning on a Wednesday.<br><br>This place is just too cute inside - and there a plenty of sweet treats to choose from!  The decor is the perfect background to enjoy a mid-afternoon snack or delicious dessert!<br><br>My daughter of course opted for a beautiful sugar cookie.  She finished it in no-time flat and I'm assuming it was as delicious as it looked.  We also sampled the toffee cake, a few cupcakes and a magic bar.  I thought the portions for the price were quite large, and our group could hardly finish the desserts we selected.<br><br>My favorite was probably the toffee cake but the cupcakes were a close second.  Once we were done my daughter wanted to \"thank the cookie makers\" so we walked up to the counter to say our \"goodbyes\" and the ladies back there were so sweet and kind to my daughter.  It was such an overall great experience.  Absolutely check out this lovely little sweet shop, you won't be disappointed!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2VawK-SDNA-oCqd_LU5TtA/348s.jpg", "caption": "Super cute dining area!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ts3lN-B6h27Zp_l0632mMA/168s.jpg", "caption": "Dining area"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PK_CFM00z8rszNmhpM2NHA/168s.jpg", "caption": "Cookie!"}]}}, {"review": {"des": "They serve THEE BEST!!! Carrot cake cupcake ever! Trust me, I've had my fair share of them. I'm picky when it comes to my cupcakes; tSweet Mandy Bs has the perfect icing to cupcake ratio that's so decadent and the texture and flavors unfold in your mouth, I love that they put pecans on top too. Anything you get here will be amazing, it's a must try.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OAsFGfJU93sIzv1YlRH8gQ/348s.jpg", "caption": "Carrot cake cupcake"}]}}, {"review": {"des": "I'm giving them a 4.5. There chocolate flourless cakes are to die for, I mean OMG delicious. Prob the best I've ever had, EVER! <br><br>We got a dozen assorted cupcakes, some were amazing like the carrot and then some were a bit dry like the chocolate but maybe that was a fluke because I was so impressed with all there treats and the chocolate flourless cakes... did I mention those. Drool", "pics": null}}, {"review": {"des": "I've heard a lot of great things about the desserts (especially cupcakes) from here and I was so excited to eat my sweet treat. The colors both inside and out are very cute and attractive. I couldn't get over how cluttered/messy the place looked though. I ordered a peanut butter chocolate cupcake and a slice of the banana cream pie to share. Both were delicious, I have to say the pie was probably the best I've ever had.", "pics": null}}, {"review": {"des": "Quite possibly the world's best red velvet cupcakes!! Perfectly moist and the cream cheese frosting is unbelievably good! The red velvet cake as well as the carrot cake are fantastic! Highly recommend this place for their quality desserts!", "pics": null}}, {"review": {"des": "LOVE LOVE LOVE THIS PLACE. <br>I heard about it through a spoon article of most instagramable desserts (my two favorite things) and I knew I had to go. Finally last weekend I had some extra time to kill and went. It's like stepping into a candy shop. Smells amazing and the decor is all pastel themed. We were lucky to have gone when it was sunny so it looked ~angelic~<br>You order your food and if you're lucky there's space in the back adjacent room to sit which has the cutest sign(pretty sure that's why its so instagramable) <br>As for the food itself, the name isn't misleading. We got the Just Dough it cookie sandwich with eggless cookie dough. Dont expect to come here and not consume nearly a weeks worth of calories from sugar alone. Probably not the go to coffee and dessert shop but it's worth it for an occasionally trip out. <br>5/5 will return when I'm out of this sugar coma.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ysTV6zZRmju80dxeexsy7g/168s.jpg", "caption": "Cutest sign"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Dq39s3KguuV_Cw2CnrMIew/168s.jpg", "caption": "Just dough it (with eggless cookiedough)"}]}}, {"review": {"des": "Great cupcakes , cookies and pastries.   They have gotten pricy so we don't get stuff very often. Cakes are fresh and I am in love with the snickerdoodle cupcake and cookies.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Tj0L8a9Bd7vNw_Jvf_I2qQ/168s.jpg", "caption": "Three bucks for a cupcake?"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0f1VlArT57vJLTn_iYf6ug/168s.jpg", "caption": "Snickerdoodle and lemon cupcakes"}]}}, {"review": {"des": "If I'm near Sweet Mandy B's, I go. If I'm not near Sweet Mandy B's, I think about going. So many excellent options, including stabdbys like the PB Rice Krispie Bar and Ranger Cookie, to seasonal offerings. An absolute must!", "pics": null}}, {"review": {"des": "I was little torn about this place. They seem to be putting incredible baked goods that should leave an impression in theory. However, there's just something that's lacking.<br><br>I had the cookie dough sandwich, like mind-blown. It's cookie dough sandwiched between two cookies. Whaaaaaaat!?!?! Talk about heaven, however, wasn't too impressed with the cookie batter or the cookie. Could have been sooo much more!", "pics": null}}, {"review": {"des": "Always loved this place for cupcakes, but only just ordered my first cake for my sister's baby shower this past weekend. It wasn't too pricey, compared to other bakeries in the area, it was delicious, AND it was beautiful! I received so many compliments on the cake for both the aesthetic quality and the taste! We chose white cake with strawberry preserve filling, and vanilla buttercream. I'll probably try raspberry next time, as strawberry is on the sweeter side, but still delicious!", "pics": null}}, {"review": {"des": "Have had multiple small samplings of dessert here but finally went myself. The place is cute and staff was friendly. They have a lot of options in cakes, cupcakes and other desserts you can get day of. <br><br>I've had the sugar cookie covered in buttercream as well as the rice Krispy treat. Everything is executed well. Just recently we tried the vanilla cake with vanilla buttercream. My only qualm is how sweet the buttercream is. You will get a stomach ache within 5 bites it's overwhelming. The cake was well balanced but the icing was so powerful it kind of overrode everything and there is a LOT of it and it's very thick. So overall yummy but personally not something I'd keep going back for.", "pics": null}}, {"review": {"des": "I think Mandy's is a SOLID bakeshop but based on the few items I tried, I don't know if I would make a trek again just to try it<br><br>Take your time browsing the many options on display then hop in line to order<br>---double chocolate chip oatmeal cookie: good flavor but kind of hard/dry, I prefer a bit more chew<br>---red velvet cupcake: moist!<br>---peanut butter brownie: dry and overly sweet <br>---iced coffee: ehh<br><br>HOWEVER the pies and cake slices looked tempting and I didn't get a chance to try those- so my review may have been different", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CPlXlcBmZYno7MEr_9GKxg/168s.jpg", "caption": "Double chocolate chip oatmeal cookie"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bAD6gXTHqmMwKdYZyRbOVg/168s.jpg", "caption": "Red velvet cupcake"}]}}, {"review": {"des": "Had a delicious red velvet cake made for my 50th. Was so delicious and moist. Leftovers were great too.", "pics": null}}, {"review": {"des": "Cute pastel colored bakery. It is very popular, which means crowded, even on a miserably cold weeknight. And most of the customers were parents with lots of kids. Maybe it was a field trip? It was very loud. Their birthday cupcake was nice. The cake was moist.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0-o7al53hulcq16YEpgRKg/348s.jpg", "caption": "Pastel colors"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BdgOJVESfRHWZ9P-ceMcXA/168s.jpg", "caption": "Pastel confetti"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7YQk8JUUSgGfjKH3NTgwpw/168s.jpg", "caption": "Confetti"}]}}, {"review": {"des": "Really cute inside, but I wouldn't suggest getting the normal cakes. I came here upon recommendation, and it looked like the place was wildly popular for their cupcakes and cookies and other treats. I was looking to get a birthday cake for my grandma though so we got a chocolate cake with vanilla buttercream. There was nothing special about it though, as it was the same quality of a cake from jewel or something or the sort. Would like to try a cupcake from here though!", "pics": null}}, {"review": {"des": "Cookie Monster cupcake FTW!! I decided to stop by Sweet Mandy B's on my day trip driving through Chicago, and I was NOT disappointed. It seemed like they still had everything available at 4:30pm on a Sunday. Look for the sign hanging next to the register area to start standing in line there. They have sooooo many different goodies to choose from: cookies, cakes, pies, cupcakes, as well as this super unique sounding cookie dough topped brownie.  There was a short line at the time, but it moved quickly. I tried:<br><br>-Cookie Monster Cupcake (Yellow Cupcake w/Chocolate Chip Cookie Baked on Bottom, $3.25, <a href=\"https://www.yelp.com/user_local_photos?select=qKvHBdaQpjK6yhdBy2UsTw&userid=76vIFZcC7owykCBjMfGVXg\">yelp.com/user_local_phot…</a>, <a href=\"https://www.yelp.com/user_local_photos?select=8kAyGOnXC3_ZhFB46BJ07A&userid=76vIFZcC7owykCBjMfGVXg\">yelp.com/user_local_phot…</a>, <a href=\"https://www.yelp.com/user_local_photos?select=wRC4Qs_U6wQkb8ThYqg_Aw&userid=76vIFZcC7owykCBjMfGVXg\">yelp.com/user_local_phot…</a>): SUPER DELICIOUS!! The cookie on the bottom was still nice and chewy, and I loved the different flavors in this \"cupcake\". A must try!!<br>-Confetti Cookie ($2.50, <a href=\"https://www.yelp.com/user_local_photos?select=1bTV10TuAizO1yAs9iOi8g&userid=76vIFZcC7owykCBjMfGVXg\">yelp.com/user_local_phot…</a>): Yum- I love all confetti desserts, so this cookie was perfect for me. It still had a nice chew to it, and wasn't too sweet- recommended for confetti dessert lovers!<br><br>My only complaints are that I wish they had a board which showed all the different items they have (so you don't have to look in the first display case, then the second display case), and that they list the prices for each item. I also wish they had smaller pieces of their cookie dough topped brownie- I really wanted to try this but the piece was GIGANTIC, and I knew I wouldn't be able to finish it. I will definitely be back here the next time I'm in Chicago, especially to try their pies, which looked delicious! There was plenty of free street parking available when I came on a Sunday.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wRC4Qs_U6wQkb8ThYqg_Aw/348s.jpg", "caption": "Inside Look: Cookie Monster Cupcake (Yellow Cupcake w/Chocolate Chip Cookie Baked on Bottom, $3.25)- 5/5 stars. GET THIS!!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8kAyGOnXC3_ZhFB46BJ07A/168s.jpg", "caption": "Inside Look: Cookie Monster Cupcake (Yellow Cupcake w/Chocolate Chip Cookie Baked on Bottom, $3.25)- 5/5 stars. GET THIS!!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qKvHBdaQpjK6yhdBy2UsTw/168s.jpg", "caption": "Cookie Monster Cupcake (Yellow Cupcake w/Chocolate Chip Cookie Baked on Bottom, $3.25)- 5/5 stars. GET THIS!!"}]}}, {"review": {"des": "Stopped in here with some girlfriends on a Sunday afternoon - short line of 5 to 8 ppl that moved quickly. <br><br>Cupcakes- not worth it. I tried the double chocolate and red velvet cupcakes and the icing was too sweet and the cake batter too dry. Molly's remains my absolute favorite and I dare say Sprinkles or Magnolias has better cupcakes. <br><br>Cookies- completely different story. I'm not a big cookie fan but when I tried a sample that they had out WOW I got myself two whole cookies! The sugar cookie with sprinkles was my favorite but the snickerdoodle was wonderful as well. Will be back for more!!<br><br>Lemon bar- too tart and too soft. Didn't hold up well. <br><br>Raspberry bar- much better but also on the sweeter side. <br><br>Pumpkin cake bread pudding- omg this was delicious! Soft and creamy... kind of like pumpkin pie filling meets tres leches!? <br><br>Prices were actually very reasonable! Overall it was great!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zTSIO20tf6ppav5noTXCOw/348s.jpg", "caption": "Reasonable prices. Don't get the cupcakes, go for the cookies!!!"}]}}, {"review": {"des": "We've been coming here for over a decade and their treats are out of this world!  But the last handful of times we've been there, the workers have been borderline rude.  My kids get so excited to go and the workers seem annoyed that you're there.  Hoping this changes.", "pics": null}}, {"review": {"des": "Huge selection and cute little bakery! <br>This place has great tarts and cookies. Although this is my first try and with 10minutes to closing, I was greeted very nicely and wasnt in any rush to kick me out (how nice) <br>Got the macaroons, pistachio, strawberry and chocolate. I feel though, that its not the best but ok not bad.<br>I also got one tart, I think its the butter tart that has raspberry on top. Perfect sweet and butter and texture. The rest of the dessert looks really good too! Definitely come to this place for tarts!", "pics": null}}, {"review": {"des": "After dinner was around the area for some sweet. Came across this little bakery by Webster and Racine. There are choices of cookies,brownies, cupcakes and pies. I am a sweet tooth person and love some unique dessert where I never seen before plus the names is unique. These are the two things I look into when I get my sweet. I would recommend people to stop by and try out their sweet.", "pics": null}}, {"review": {"des": "I've been waiting to try this place for so long, and it was worth the wait!! We came about 30 min before closing (around 8:30pm) and were pleasantly surprised to find that they still had a variety of baked goods left to choose from. We were also excited for the cute and instagrammable atmosphere. <br><br>We ended up choosing the chocolate toffee pudding cake, which they heated up for us. It was massive and really delicious. The cake was really rich and moist, and the toffee coating made the dish. <br><br>I'm giving it 4 stars because there wasn't enough of the toffee for the cake (and it was pretty boring without), and I wish the toffee flavor had been a bit stronger. But overall, I would be really excited to come back!!", "pics": null}}, {"review": {"des": "Ummm, YUM. <br>This is a stop you must make if you find yourself in need of cupcakes, cookie sandwiches, and/or banana pudding! I've tasted a chocolate cake from here, super good - but I think cupcakes are the way to go! Super moist and fluffy with buttercream frosting to top off your sugar fix.<br>I've been here twice now, even when it's packed they get you through the line quickly!<br>Try as many cupcakes as you can, but I like the cookie monster one the best!", "pics": null}}, {"review": {"des": "Came back this year for a cake and was not happy. The cake was not aligned properly so slices were uneven and the layers were falling apart. The cake itself was so sweet it was inedible and one guest said it tasted like frozen cake you get at the grocery store. The decoration was beautiful, but if you spend 40$+ on a cake it needs to do more than just look pretty.<br><br>The bakery did refund the price of the cake in the end, but I will not be back for more.", "pics": null}}, {"review": {"des": "Where to begin? Everything I've had here is so good! Their cakes are great for special occasions [or just because]. <br><br>Cupcakes: Cookie Monster and Snickerdoodle for sure!...I'm not a big cupcake person, but every one that I've tried has been nothing short of delicious. The fluffy moistness of the cupcakes with their not overly sweet frosting...probably some of my favorite cupcakes!<br><br>Pies: Banana Cream Pie (have yet to try the others). But if you like the one from Baker's Square, this is better! The crust is a bit crispier and firmer than that Baker Square's and the filling is not too sweet. Almost as if the only sweetness is from the bananas themselves. <br><br>Cookies: Standard chocolate chip is thinner than your average cookie, crispy, buttery and freaking delic! Double chocolate chip oatmeal is also good...big thick, slightly fluffy oatmeal chocolate chip cookie with chocolate drizzled on top of it (better warm and topped with ice cream!). <br><br>Flourless Chocolate Cake- fluffy, decadent and ever so slightly moist cake with molten chocolate in the center. It just melts in to creamy goodness when it gets in your mouth. Great warmed up and would be even better with vanilla ice cream. <br><br>Seriously can't go wrong with anything here!", "pics": null}}, {"review": {"des": "Cute interior decoration. The yellow vanilla cupcake is moist but the frosting is a little too sweet for me.", "pics": null}}, {"review": {"des": "I picked up a cake here for a celebration, and got myself a cookie dough sandwich + turtle cookie-thingy. OHHHH MY GODDD you guys it was all so so good.<br><br>The cake was perfect, and I was lucky enough to walk in at 6 pm and they had one ready to go. I didn't have a full menu of choices thanks to my procrastination, but if I ever need another cake I will definitely call them in advance because the cake got rave reviews.<br><br>The cookie dough cookie was unreal. Two chocolate chip cookies with a soft and extremely generous portion of cookie dough sandwiched in the middle. I asked for a frosting topping and they happily complied. My inner fat kid was crying with joy.<br><br>Then I tried the turtle cookie. Nuts covered in caramel, with a layer of dark chocolate on top. HOLY JEEZ THIS WAS GOOD.<br><br>Just come on in. I can't imagine a better spot to break every new year's resolution you ever had.", "pics": null}}, {"review": {"des": "Didn't stay for long but the interior was really cute and the red velvet cake was soft, rich, and amazing. Will definitely be back again!", "pics": null}}, {"review": {"des": "I know they are known for their cupcakes here, but don't let that fool you from thinking you can't get a wedding cake, too. <br><br>My husband and I weren't going to have a wedding cake initially, but ended up with some extra money in our budget, so naturally we needed to spend it on cake. Sweet Mandy B's was a natural choice as we had had their tasty desserts before. <br><br>The entire process was great. We set up our tasting (it's free!), and upon arrival were treated to sampling every cupcake flavor they had. We decided on devil's food, yellow cake, and funfetti as our flavors, and were so happy with how everything turned out. <br><br>We were planning from out of state as we live in Texas, but got married in Chicago. Once again, a seamless process. We put down our deposit, gave them our cake toppers the week of the wedding, and finished our payment. <br><br>I definitely recommend them for a wedding. I didn't have to worry about anything, the cake showed up on time, looked amazing, and the team even dropped a congratulations card into our card box the day of. How sweet is that?", "pics": null}}, {"review": {"des": "Every celebration seems to lead our family to Sweet Mandy B's.  As you can see from the picture the amount of detail that goes into their cakes demonstrates the care they have our special occasions.  The handwork of the decorations is both inside and out.  <br>The cake you see is buttercream on the outside and whipped cream on the inside.  My advice to Chicagoans is do not settle for anything less than you deserve.", "pics": null}}, {"review": {"des": "Sweet Mandy B's is a cute bakery creating old fashioned baked goodies. They are cranking out cookies, cupcakes, pies, cakes, everything you can imagine a sweet grandma might bake, but a thousand times better. I can understand all the rage about them now. Their cinnamon buns, to die for! I can't remember the last time I've had a cinnamon bun where I can taste every ingredient in it so distinctly, and not just get a big bite of overwhelming sweetness. <br><br>They understand the struggle of making that decision to not buy one of everything in the store. The ladies at the counter made me feel welcomed and gave me the time and space to ooo and ahhh at everything. I will definitely be back for more!", "pics": null}}, {"review": {"des": "I would highly recommend the vanilla cupcake here. It's by far the best cupcake in Chicago, and you can't go wrong with the iced cookie - an original treat you can't find elsewhere in the city. The atmosphere is colorful and welcoming, and Floriole is right down the street if you want to hit two phenomenal dessert spots in one trip (who wouldn't?!).", "pics": null}}, {"review": {"des": "Come here hungry and easy to eat lots of sugar! Lots of options, friendly staff that would help 3-4 people at a time and not keep you waiting to check out. <br><br>Fast help and check out. Around a good neighborhood too.<br><br>Visit here to get some delicious homemade desserts, the best of Chicago! Get a to go box, in order to eat and try all of the desserts that you want.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Nk1LftJC_F2a0weOgvJIFg/168s.jpg", "caption": "Ranger cookie-chocolate and coconut oatmeal cookie. 8/10"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2SmIzGvwkLlkvUCp3Yf4iw/168s.jpg", "caption": "Layer bar with pecans, chips, chocolate coating lots of coconut and graham cracker on bottom, needed more of the graham crackers but good!"}]}}, {"review": {"des": "I am obsessed with this bakery. It is so cute and has so many options to choose from. I got a raspberry bar and a chocolate chip chip cookie... both were so good. <br><br>I also decided to get my birthday cake from here too. I thought the cake was very good but it's almost too heavy and dense. I like my cakes lighter and fluffier. <br><br>Overall this place is great though and I couldn't live anywhere close by because I would become obese.", "pics": null}}, {"review": {"des": "All I can say is this place should be a definite stop for all visits to Chicago!<br>We got the cupcakes <br>Unreal how good they were!!", "pics": null}}, {"review": {"des": "Amazing lemon raspberry cheesecake! The girl that waited on us was very sweet and helpful in guiding our decision to a delicious dessert. Definitely would come back!<br><br>Took our desserts to go, which was nice to have as an option. They were packaged neatly in a plastic container.", "pics": null}}, {"review": {"des": "My friend and I were walking around Lincoln Park and happened to stumble upon sweet Mandy b's! Everything about this bakery is so cute, from the cakes to the interior decorations. The atmosphere was very warm and inviting, and I was tempted to buy more baked goods than I actually needed because everything is so pretty. I got the rice pudding which turned out to be a great decision - the texture was perfectly balanced and the slight hint of cinnamon enhanced the sweetness of the pudding, without making it overwhelming. If I lived closer to sweet Mandy b's, I'd be a regular!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7aAaa0NHmj9r4dW31Jrw9w/168s.jpg", "caption": "Interiors were pastel themed and very cute"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/npDFDYlVEPK9u9O8aj0trw/168s.jpg", "caption": "The cakes are all so pretty!"}]}}, {"review": {"des": "There are plenty of interesting treats at Sweet Mandy B's, but none of the sent me to heaven in spite of the sugar coma.<br><br>Banana cupcake: this was a bit dry and lacking in banana flavor, in my opinion. But a decent cupcake.<br><br>Cabinet pudding: the my warmed it up for me but, again, it was very dry for a bread pudding. I would have loved a sauce to drizzle over it to give it some more moisture.<br><br>Chocolate peanut butter rice crispy treat: holy sweetness. This was über gooey--lots of marshmallow, butter, and peanut butter in this thing. It was far too sweet for my liking, and I threw it away after a couple of bites.<br><br>It's impossible to get a seat in here, and the layout was poorly designed for a bakery.", "pics": null}}, {"review": {"des": "This place is super cute and bright and full of amazing smells all around. The selection here is very simple and classic. Nothing too out of the ordinary. Sweet and buttery baked goods that please the masses. That is certainly not a bad thing. If you're going to have a cookie, have a cookie! Okay, so maybe they DO have something a little out of the ordinary: two chocolate chip cookies with edible cookie dough in the middle. But I swear that's as crazy as it gets! <br><br>Their vanilla cake with chocolate buttercream frosting was basic and so yummy. It really hits the spot when you're craving something sweet. <br><br>All their cookies are great--chocolate chip, m&m, ranger, and of course the frosted sugar cookie. <br><br>Decent prices and a great spot to grab something yummy!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zHcJkwqIUnra0hyPuWaTQw/348s.jpg", "caption": "Cookie dough sandwich!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DG7vjntNzMrZAdLRGwmYyw/168s.jpg", "caption": "Vanilla cake with chocolate buttercream frosting. Best served room temp/slightly warm (thank me later)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iTRSz8CqJex57xPGEhWAzw/168s.jpg", "caption": "Raspberry square. Absolutely loved the sweet and tangy goodness."}]}}, {"review": {"des": "Sweet Mandy B's is one of my favorite bakeries in Chicago. They have an awesome variety of baked goods to pick from, but they don't always carry the same items all of the time. Some of the standards (red velvet cake, cupcakes, chocolate chip cookies, etc) are carried all of the time. Some items are only carried for a limited time or seasonally.  Most recently, I had a bread pudding type creation from Sweet Mandy's that was out of this world. It had bread, caramel, walnuts, cinnamon, apples, and a few other ingredients. <br><br>Sweet Mandy's is split into two sections.  The back section has tables and chairs available if you want to eat your sweets right away.  The pastel coloring on the walls gives this place a charming and cozy type feel.  The prices are similar to most other bakeries in nicer neighborhoods like Lincoln Park (example: about $5 for a slice of pie).", "pics": null}}, {"review": {"des": "I have not tried their cakes/sweets but still wanted to leave a review because of the good customer service I received. I called for a last minute custom birthday cake order and the young woman that assisted me was really polite and they were able to accommodate me on short notice and she was able to answer all of the questions I had. <br><br>The reason it's a 4 and not a 5 is because I ended up having to find another place since this bakery does not do fondant - they specialize in buttercream (which is perfectly fine but would've been awesome to have the option). Additionally they didn't have a marble cake option which seemed odd to me because, isn't it just vanilla and chocolate swirled?<br><br>So it didn't work out this time. But based on my interaction and the menu online, I still plan to stop by sometime and grab a cupcake or two :-)", "pics": null}}, {"review": {"des": "Super cute place in Lincoln Park to stop in for a delicious treat. It was so hard to choose what to get, but I opted for the banana cupcake with chocolate frosting. It was amazing--moist and perfect, without being cloyingly sweet. A couple weeks later and I am still thinking about it. I'll be back here next time I'm in Chicago.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JqRPdGShEMYdFclDC3Fnhw/348s.jpg", "caption": "The way bananas should be eaten..."}]}}, {"review": {"des": "Super cute bakery! Located near campus. We tried the vanilla with chocolate cupcake, the confetti cupcake and rice crispy cream. The cupcakes were moist and fresh. Don't get me wrong I enjoyed my dessert. Is it worth going way across town for them? Prob not, but if you are in the area please do stop!", "pics": null}}, {"review": {"des": "I've tried this place a few times now and walked in today and got the banana caramel bread pudding and omg I'm in heaven!! It's the best thing I've eaten in a long long time! Also got their berry and nectarine pie and it was delicious! Not too sweet just right!! Can't  wait to try more things. While their cupcakes are great I prefer their other offerings!", "pics": null}}, {"review": {"des": "I ordered two cakes within the last week and a half. Must say I'm disappointed with the customer service of the unpleasant staff and the too dense and over rich cakes. On both occasions, staff was rude. Simply not good of either. <br>I bought a cake for my sisters birthday and I was embarrassed. Everyone said how awful it was! Seriously?! It was disgusting. 40.00 wasted and not to mention in the garbage! <br>Costco or Mariano's could have done better. <br><br>Please go somewhere else for a cake!! <br><br>I've been going to bittersweet for the last 10 years. I wanted to try something different but I won't be coming back here! <br>Back to my happy Bittersweet!", "pics": null}}, {"review": {"des": "wow we had the everything but the kitchen sink chars cake and the over the top banana cake muffin. <br><br>The cheese cake was really rich with a bunch of salty toppings.  <br><br>The banana muffin was awesome and not too sweet nice.", "pics": null}}, {"review": {"des": "I love this little shop!! It's full of all sorts of cakes, pies, cookies and smells glorious. My personal favorite is the lemon cupcake: it's light and moist with just the right amount of lemony. I hope to try one of their pies or cakes one day - they look delicious! Service is always friendly and fast. Parking can be a challenge. Enjoy!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/F_G4OShPyMzppYu_fDG-9g/348s.jpg", "caption": "I LOVE the lemon cupcake!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PkG6DJLk6vtBSgyYF893Ow/168s.jpg", "caption": "Perfect lemon cupcake. Yum!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gMUNioPHLl4XAhbSAj2ooA/168s.jpg", "caption": "Pies look so good!"}]}}, {"review": {"des": "Sweet Mandy B's is a place you want to gather up your girlfriends and head out to. <br><br>The DECOR is all pastel colors based, with the biggest, sunniest windows imaginable.<br><br>As for the TREATS, Sweet Mandy B's earns a badge for truly offering something for everyone. Cupcakes in 15 different flavors? You got it! Cookies in 10? Of course! Top that off with fresh cake slices, Rice Krispie treats, different types of bars, bread pudding.... phew! The list goes on forever. <br><br>There is typically a long line, but SERVICE is efficient. Plus, you might benefit from a couple extra seconds to scope out the treats you're going to get yourself. Throw in a free sample or two, and they have very happy customers. <br><br>PRICES are competitive with other bakeries. Approximately $4 cupcakes, $5 cake slices, $3 cookies, etc. Don't expect something cheap, but you also won't be breaking bank. <br><br>I love Sweet Mandy B's and will continue to go again and again :)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/A0iG4SoFh2jQIP99bIPrRw/348s.jpg", "caption": "Red velvet cupcake & Cookie Monster cupcake."}]}}, {"review": {"des": "My girlfriend has been wanting to go here for a while and I can see why! This place is definitely aesthetically pleasing and the cookies are to die for!!! It can get pretty crowded, so plan on a wait. Parking is kind of tough, but the surrounding neighborhood is worth walking around.", "pics": null}}, {"review": {"des": "I LOVE Sweet Mandy B's! I always pop in after getting my hair done nearby and have to stop myself from buying zillions of calories worth of sugar. <br><br>I am partial to their 'mistake' cupcakes that are imperfect in some way and are sold at a discounted price-- they call them Wanna-B's. The offerings always vary but I've tried numerous flavors. The banana ones (either with chocolate or vanilla frosting) are my favorites and I buy them at all full price too because they are just that good!<br><br>I've also had their magic cookie bars and a Neopolitan cheesecake that was truly sinful. The only thing I tried here that didn't blow my mind was the classic fudge brownie. It was more cake like in texture which isn't my personal preference. Otherwise, this place is top notch. I highly recommend coming in here for a sweet treat.", "pics": null}}, {"review": {"des": "Sweet mandy B's is our favorite bakery in the city, so it was a no brainer to have them do our wedding cake and desserts. The cake came out perfect and delicious and our late night cupcakes were a huge hit! It was so easy and straightforward working with them and the day of delivery was seamless!", "pics": null}}, {"review": {"des": "If you have a sweet tooth this is the place to go. Sweet Mandy B's has an assortment of sweet treats. You can't go wrong with their cookies, the chocolate chip cookies are definitely one of the best or the oatmeal raisin. The banana bread is delicious and very moist, and so is their chocolate fudge brownie. Prices are also reasonable.", "pics": null}}, {"review": {"des": "My family and I absolutely LOVE this place! It's our \"go to\" when we have a sweet tooth. My only complaint would be the customer service. I came in recently and the person waiting on me wasn't nice. After I paid she just push the bag to me and walked away. She didn't say, \"Thank you\" or even \"Have a nice day.\" It wasn't even busy, I was the only customer there. So unfortunate for such a great dessert spot!", "pics": null}}, {"review": {"des": "I picked up a banana cream pie to take to my parents for Thanksgiving and it was excellent. We wandered in at like 8pm and the place was spinning with customers and perky staff.  They are an obvious popular choice in the neighborhood. I will certainly return for their pies.", "pics": null}}, {"review": {"des": "I dropped by Sweet Mandy B's to pick up a birthday cake for my wife, as she has raved about desserts from here at prior engagements. I picked up a large buttercream, vanilla / chocolate cake and was certainly a great choice, as our entire family had nothing but great things to say! Not overly sweet, with great consistency of moisture and fluffiness, if that makes sense. They also provide complimentary messaging on the cake itself, which was a nice plus. We will definitely be returning for desserts in the future!<br><br>Best,<br>Charlie", "pics": null}}, {"review": {"des": "Delicious key lime pie - one of the best I have had. You can tell that they make the pies with real key lime and not juice concentrates. The crust was great, I would go back just for the slice of key lime pie. <br><br>They had some really ridiculous looking bakery goods - we tried the cookie dough: cookie dough sandwiched between two chocolate chip cookies. Each bite was probably about 150 calories, but very worth it!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/J9gWhehcoJJ6fVVO9BpK7g/348s.jpg", "caption": "Just dough cookies. Cookie dough in between two chocolate chip cookies"}]}}, {"review": {"des": "Baby shower cake (lemon cake, whipped cream and fresh raspberries for filling)<br><br>This cake was so good!!!! I was cutting it while my bf handed it out and all I could hear was \"omg... this is delicious!\" \"This is so good!\" Over and over!!! I was nervous because we always have tres leches cake at our parties or something more simple like a yellow w a fruit filling but really tres leches is the one. I'll add that when I picked it up I got myself a cinnamon roll and omg it was literally the best cinnamon roll I have ever had. Super soft and chewy! So delicious!! <br><br>As far as ordering the cake I emailed back and forth with no problem on Mon/Tues and then called to place the order Tuesday to have ready that Saturday. The price was good compared to other bakeries I called and the staff was easy to work with.", "pics": null}}, {"review": {"des": "Just two things you need to know about Sweet Mandy B's:<br><br>1) I have tried many things and have yet to come across anything I didn't consider less than amazing.<br><br>2) Their buttercream frosting is so good that, after trying it, my good friend who does not support the institution of marriage loudly proclaimed that this was what she wanted on her wedding cake.<br><br>They can get a little crowded at times, so I recommend placing an order ahead of time via phone, or at least having an idea of what you want to get, as the display cases can be quite overwhelming on your first visit.", "pics": null}}, {"review": {"des": "Within walking distance of Pequods so walk of that pizza and then cram a cupcake in your mouth. Or coconut cream pie, like I did. Not as much coconut flavor as I'd like, but the pudding was so good and the crust perfection.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OAxgYxHozGjjPtYRg7w-TQ/168s.jpg", "caption": "Coconut cream pie"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/564ESJXEaxfYN5_Pr9yOyA/168s.jpg", "caption": "Hard to say no"}]}}, {"review": {"des": "There is no place better than Sweet Mandy B's. From their doubly doozies to their cupcakes, you cannot go wrong. And this trip we discovered the frosted rice crispy treats! Whaaaaat?!? Yes, rice crispy treats with buttercream frosting. Dreamy. I love it all. Their buttercream is fabulous. I will look forward to our next trip to Chicago so I can get a tasty treat from Sweet Mandy B's!", "pics": null}}, {"review": {"des": "I could understand the draw of sweet Mandy B's confectionary creations but for me it was over the top sweet. The cookie sandwiches are just way too sweet and the other items i had were heavy on the sugar. If you have a need for some super sweet treats this is the spot to go but maybe my sweet tooth isn't up to the job.", "pics": null}}, {"review": {"des": "Ordered a cake for my boyfriend's graduation party. They were super accommodating to my short notice and the cake was delicious! Will definitely use them again!", "pics": null}}, {"review": {"des": "I now understand all the hype about this place! <br><br>I wasn't expecting so many different types of desserts- I was a little overwhelmed by how many options I now had. <br><br>We stuck to cupcakes (red velvet, lemon) and they didn't last more than 2 days in the house. The cupcakes were decadent, but light and fluffy. The frosting wasn't too sweet. <br><br>If we lived closer, we would be back here all the time. As we live all the way out by O'Hare, this is a nice treat.", "pics": null}}, {"review": {"des": "Hands down the best cakes and cupcakes in Chicago. Wonderful birthday cake for my kids today. Thank you!", "pics": null}}, {"review": {"des": "So good! We have gotten a fair amount of cakes from here for special occasions, including a New York cake for my wedding rehearsal dinner and a Frida Kahlo cake for my moms birthday. <br><br>They not only do an amazing job decorating, the cakes are always delicious! <br><br>We just started coming here about 6 months ago and I am so happy we found Sweet Mandy B's!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/seHQO46uc449VTsEaEPseQ/348s.jpg", "caption": "Frida cake!"}]}}, {"review": {"des": "this is one of my favorite spots in the city. not just because they have PERFECT cinnamon rolls, or because Sherrie is an angel, or because the colors... i could go on and on. this place has it all. treats and sweets! it's always buzzing with a busy kitchen, a friendly staff, and a long ass line! they are super popular and if you haven't ever heard of this place then EXCUSE ME BUT WHO TF ARE YOU?!?!?! get you hiney down to this place immeadiately and OBVIOUSLY get the cinnamon roll.", "pics": null}}, {"review": {"des": "Hands down- their cakes are fabulous!!!!!! You can make your own. The frosting is so unbelievably fresh, smooth and creamy. It's so good!  The one in my pic has Oreo topping with a chocolate cake.", "pics": null}}, {"review": {"des": "Stopped in on a breezy Sunday afternoon and the place was packed with squealing children- there were samples (Rice Krispie bites with peanut butter cream and chocolate on top) so I tolerated it. I got a red velvet cupcake, the cream cheese frosting was not too sweet and had that perfect crispness on top. The cake itself was moist, which is more than I can say for Molly's sometimes, but it wasn't the best red velvet I've ever had. I'll definitely be back to sample everything else and then of course feel guilty about it.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FaD4Ad9jOyUDTq883WnaVw/348s.jpg", "caption": "Red velvet cupcake. Not pictured: a million children."}]}}, {"review": {"des": "As a connoisseur of all things sweet (reigning duchess of Molly's, Firecakes, and Stan's, a regular at Vanille, Goddess & the Baker, the list goes on), I can confidently say that Mandy's has the best desserts in Chicago. <br><br>There are so many options; this is not just a cupcake place - although the cupcakes are divine. Among my (many) favorites are the iced confetti Rice Krispie treats, the sweetie pie (a cookie, not a pie) and the simple but delicious vanilla cupcake with buttercream icing (never, ever dry). <br><br>Pro tip: Keep tabs on their Instagram account because there are amazing and creative new treats on the reg. Holidays, Cubs games, sunny days...basically every week Mandy's has a promotional dessert that you will regret not eating. It will haunt you! <br><br>If it didn't take me 20 minutes to walk to Mandy's I'd probably weight about 20 more pounds. Not kidding.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FY4fHaHPhdIEV7JN-PPA1A/348s.jpg", "caption": "Delicious Lemon cupcake"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XW7e67N7FyveZE1D8iHwOA/168s.jpg", "caption": "Almost too cute to eat...almost."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VIM1bymRbFRk-zCb_W27OQ/168s.jpg", "caption": "M&M Caramel Apple. Tart and sweet."}]}}, {"review": {"des": "I have always been a fan of Sweet Mandy B's for a long time now, however, they came to the rescue when I almost had a wedding cake fallout.  So big THANK YOU to Sweet Mandy B's!!  <br><br>I had a bakery that was a required vendor through my venue but when we went to the cake tasting there, they all tasted terrible.  I was not about to have my guests eat some really bad cake.  So I worked it out with my venue and they were open to having us have an outside vendor for our cake in our package.  I immediately wanted Sweet Mandy B's.  I went into the shop, last minute, not knowing I should have made an appointment, yet they were super helpful and let me take home the samples to try them out and help us decide the flavor since we had such a tight timeline.  We went in the next day and made our order for our confetti wedding cakes.  The day of, the cakes turned out super delicious and all our guests were raving about it!  <br><br>Go to Sweet Mandy B's not only for your occasional sweet tooth but if you have any events or weddings you need cakes from.  They worked with us last minute, made it possible for us, and also worked with our budget and found us options that worked within our price range.  Thank you Sweet Mandy B's!  Check this place out!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uwQkcPY1MJ1LbH5DLW4K0A/348s.jpg", "caption": "Flowers: AEG Photographers: Chasing Stills"}]}}, {"review": {"des": "I've had wonderful cookies and I've had wonderful cupcakes, but it's rare that you find both under the same roof - which is exactly what you find at Sweet Mandy B's. <br><br>Star 1: How were the service and atmosphere?<br><br>Sweet Mandy B's hosts a fantastic crew in what is a brilliant atmosphere, with quaint seating and plenty of glass that separates treats from tykes alike. I'm going to warn you know - you're going to be overwhelmed. What do you even get? Cookies? Cupcakes? Full Cakes? Just get it all. Star Granted. <br><br>Star 2: How were the portions relative to the cost?<br><br>So I went a bit overboard here:<br><br>- Snickerdoodle: $2.50<br>- Chocolate Chip: $2.50<br>- Snickerdoodle Cupcake: $2.95<br>- Chocolate Peanut Butter Cupcake: $2.95<br><br>The cookies? Huge. The cupcakes? Brilliant, and everything was reasonably priced. Star Granted. <br><br>Stars 3 and 4: How was the food?<br><br>These cookies weren't the best I've ever had, but they were damn good; and even if you held a gun to my head I wouldn't be able to choose between the two. <br><br>Now, the cupcakes, on the other hand, were very much some of the best I've ever had. The snickerdoodle tasted like I was eating a snickerdoodle, which is exactly what a cupcake do. The exact same scenario repeated itself with the chocolate peanut butter, which tasted exactly like a reese's peanut butter cup. Dual Stars Granted. <br><br>Star 5: Would you eat here every day if you could?<br><br>Without a doubt. Star Granted.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qu6eAClxVsSy4qPVfpXu1g/348s.jpg", "caption": "Snickerdoodle Cupcake: $2.95"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JHJ9cFuGcniogPnVOT9oew/168s.jpg", "caption": "Chocolate Chip: $2.50"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZSR5C2zeBigMd1VpKzwRow/168s.jpg", "caption": "Snickerdoodle: $2.50"}]}}, {"review": {"des": "Wanted a cake made from my memory of a favorite childhood cake (the Lemon Tango cake, from the now-defunct Groman's Bakery in Bethlehem Pennsylvania, back in the 1960s).  Three bakeries said they couldn't do it before I tried Sweet Mandy B's. Their price was very reasonable, and the cake was ready six days later.<br><br>It's not quite the same -- they had to substitute lemon curd for the clear lemon gel filling I recall, and the new cake is heavier and less fluffy than the original.  But it looks very similar -- just the way I described it! -- and is it ever delicious.  The lemon curd filling gives it a tang that may surpass the original.<br><br>(And by the way, street parking is free, and not nearly as congested as you might think.  I had good luck twice, anyway.)<br><br>I applaud their dedication and attention to detail, and I recommend this bakery.", "pics": null}}, {"review": {"des": "Giving this place 4* instead of 5 for the service. While the birthday cake (layer of yellow, devil's food, and snickerdoodle) I ordered for my friend came out great, I was really put off by the lady who answered the phone. She was VERY impatient while I tried to describe to her what I wanted on the cake and the types of flavors in the cake. The service was just plain rude. If I didn't love the cakes from Sweet Many B's, I would've gone elsewhere. Prices are super reasonable and overall the cake was great, but beware that the customer service is definitely lacking.", "pics": null}}, {"review": {"des": "Delicious, sugary fantasy! This place is my favorite bakery in all of Chicago. The buttercream frosting GIVES ME LIFE! I've had many sugar cookies and they are consistently high quality, chewy with the perfect combination of soft-baked and firmness. The cupcakes are decadent but not overwhelmingly sweet. And the multi-layer cakes are perfect for birthdays and all celebrations. I just cannot get enough of Sweet Mandy B's and I mean that whole-heartedly. Cannot wait for my birthday in a few weeks because I will be celebrating with Sweet Mandy B's treats!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nvTACAGkHl8qacipx5ZWqQ/348s.jpg", "caption": "Traditional sugar cookie, purple with yellow cupcake, and a white with white \"wanna-be\" aka imperfect cupcake. All of it tasted PERFECT. $8"}]}}, {"review": {"des": "This place should be called OVERLY sweet mandy B's. Standard American fare with cupcakes, cake, cookies, pie, brownies, rice crispy treats. I appreciate sweet desserts and love pies but the banana cream pie here was just alright, nothing spectacular. I also had a brownie and that was actually better than the pie! This is a great place to come if you just want plain sugar.<br><br>The decor in this place is adorable but it can get very buy so it's sometimes hard to grab seating here. Not coming back any time soon...", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0myWub1WcLKrhK3DQaDbPA/168s.jpg", "caption": "so many options!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bKa4ht18vdikG_TU0bFg_w/168s.jpg", "caption": "Banana cream pie -- meh..."}]}}, {"review": {"des": "I have been going to Sweet Mandy B's for almost 20 years. I have always raved about their vanilla cupcakes to everyone who visits. I'm not a frosting person and I absolutely love their frosting on the cupcakes. So why am I giving one star on this review? Yesterday was the third time that I've been so extremely disappointed in the cupcakes that I just have to write this review. Each of these three times I purchased about six cupcakes, only to be seriously disappointed in them after getting them home and eating one. Yesterday I purchased six so that I could give a few of them away to neighbors as thank you gifts. Unfortunately I gave away the cupcakes before I had actually eaten one that I kept for myself. These cupcakes could not have been fresh. The cake was so crumbly and dry. I actually went to my neighbors to apologize for the cupcakes because they were not good at all. The neighbors agreed. I fell in love with these cupcakes because of how moist they usually are, but the last three times they have been dry and honestly...uneatable. If I'm paying close to $25 for cupcakes, they seriously need to be good. So the fact that I've paid this amount of money multiple times for extremely sub-par cupcakes only compounds my disappointment.<br><br>On top of this, the woman who waited on me was very curt and after ringing me up and asking if I wanted a receipt (no), she just pushed the bag towards me and turned her back to do other things. How about a \"thank you\"? There was no one else in line.", "pics": null}}, {"review": {"des": "The cupcakes here are decent but don't be mistaken....they are no Mollys. I came here to see what the hype was about and felt it wasn't all it's cracked up to be but has huge potential. The shop is definitely cute but a little small. I found the flavor offerings to be pretty basic in comparison to most cupcake places around Chicago. However, they have this little carmel banana bread thing that is easily one of the best things in life. I would come back time and time again for that alone. I'm still a hue fan of Mollys as they offer more exquisite flavors and center filled cupcakes (peach cobbler and Blueberry cheesecake...etc.) and also let you make your own. While this isn't a bad place for cupcakes, I've had better. If you're looking for basic run of the mill cupcakes that are a little better than what you make at home, come here. If you wanna be impressed, go to Mollys!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/A34SlAgUPvkLd0JqZbfqpg/168s.jpg", "caption": "Some delicious carmel banana bread thingy mabob"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/N0_dgdLicndL1TJceyC3ew/168s.jpg", "caption": "Banana, confetti and snickerdoodle"}]}}, {"review": {"des": "Some people dream of a big fancy cake on their wedding day. My husband and I are not those people. We figured we'd just skip the cake cutting and serve everybody sheet cake from Cosco out of the back kitchen.  Then about 3 weeks before our wedding, we were celebrating a coworker's birthday my office and I experienced SMB's  \"blueberry pancake\"  cake w/ maple frosting for the first time. I was smitten. Turns out, Sweet Mandy B's does sheet cake too and it's SUPER reasonably priced! I don't think a single one of our wedding guests noticed that we didn't \"cut the cake\" ....but they damn sure noticed the cake. 3 weeks later and we still have people raving to about us how delicious it was!!! Highly recommend. 10/10. 5 gold stars. All the yummy :)", "pics": null}}, {"review": {"des": "I skipped out on getting a jewel cake for a friend's birthday and decided to grab a great quality cake from Sweet Mandy B's. The cake itself is what I expected however I am so disappointed in the writing on it. It ruined the aesthetic of the cake. It is off center and sloppy-looking. I will say the writing was free and I did OK the thicker icing thinking it will look like a nice solid E. I expected better craftsmanship from a bakery specializing in cakes and cupcakes.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Juan80LigM6HoXOxJcIMaA/348s.jpg", "caption": "Not very happy with the writing on my cake."}]}}, {"review": {"des": "This place is great! Lots of sweets to choose from and plenty of staff members to man the large crowds during busier times of the year. <br><br>The line on Christmas Eve had at least 30 people but it moved pretty quickly. I was assisted and checked out in about 20 minutes because there were at least ten staff members behind the counter.  <br><br>The flourless chocolate cake (GF) was rich but absolutely amazing! Before I could finalize my purchase, the gentleman helping me recommended a few more items and yes I bought them too. The only problem is, they were apparently inhaled by others before I could try any of them. <br><br>Seriously good stuff.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_lS-R7T9aespAahJHNl_zw/348s.jpg", "caption": "White Chocolate Peppermint Cheesecake"}]}}, {"review": {"des": "Finding 3 choices is not too shabby.  To me, OLD FASHIONED means very synthetic or very basic depending on the decade.  A pound of sugar is poured into one serving of whatever.  Good pricing.<br><br>PETE's COCONUT CLOUD COOKIES -- unique.  Covers the table with crumbs from every single bite.  A macaroon in a meringue.  Bit chewy.<br><br>RED VELVET CUPCAKE -- I prefer the cream cheese icing.  Flat Butter Cream icing.  Not much taste to the cupcake.<br><br>TEA -- Rishi brand.<br><br>VENUE -- pastel colors are adorable.  Plenty of seating.  Love the filtered water spout.  Cluttered.", "pics": null}}, {"review": {"des": "This place is great. The cupcakes are so moist. The place smells wonderful and the staff is so friendly.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dAmgwmeAM_qXcId-nQJGLg/348s.jpg", "caption": "CUPCAKES!!!!!"}]}}, {"review": {"des": "Cutest little bakery in the city.<br><br>So much choices there's something for everyone with a sweet tooth.<br><br>I got my hands on a chocolate topped rice krispy and chocolate chip cookie.<br><br>Great photo ops with the wall!", "pics": null}}, {"review": {"des": "Wow - what a disappointment. Are they riding off their reputation? Ordered lemon cupcakes for my son's birthday celebration and when we ate them they were dry like they were a day old. The reason I drove across town in traffic was to enjoy the soft pillow like cupcake topped with sweetness. This was my last Sweet Mandy B experience. Reputation is not only earned but must continue to meet the standard of freshness in which it was built. I did not get the benefit of my $19 bargain hopefully the next consumer will.", "pics": null}}, {"review": {"des": "No idea why this place is so highly rated. Everything here was disgustingly sweet. We got the sweetie pie (cookie sandwich), lemon cheesecake, apricot blueberry pie, and the oatmeal raisin cookie and they were all so sweet we didn't finish any of them. We also tried the strawberry muffin which hardly tasted like strawberry at all. I was so disappointed with this place and upset after purchasing so many things and having none of them be good.", "pics": null}}, {"review": {"des": "The ginger molasses cookies are my absolute favorite.  Their buttercream is perfection.  The vegan cupcakes are also fantastic!", "pics": null}}, {"review": {"des": "Omg awesome bakery!! I read a bunch of reviews on here and this place lived up to the hype! Everything I got was wonderful. And I got a lot! For $33 I got a 6 inch 2 layer cake (ordered ahead), a cabinet pudding, a double iced sugar cookie, a single iced sugar cookie, and a molasses iced cookie. <br><br>The birthday cake was ok, the cabinet pudding was heavenly moist, and the iced molasses was salty sweet in the best way. I'll be back!", "pics": null}}, {"review": {"des": "Had an amazing chocolate chip cupcake. This place is magical!! I stopped by just as a nearby school was letting out, it was crazy-fun to see all the excited kids picking out treats (not so fun, were the crying kids who couldn't have all the treats they wanted). <br>Great place to get delicious baked goods. Also, they provide milk!", "pics": null}}, {"review": {"des": "We loved the cakes they did for our twin 1-year old birthdays!  They did a great job and nailed the covers of the books as cake decoration.  Also, the cakes were delicious.  People asked for seconds :)  Thanks Sweet Mandy B's!", "pics": null}}, {"review": {"des": "Best desserts in Chicago. Hands down.<br><br>The shop is a pastel heaven. That smells exactly like what you'd expect. Pure bliss. They have everything from brownies, whoopies pies, whole cakes, cupcake, cookies, and much more.<br><br>My favorites are sugar cookie with butter creme frosting on them and recently tried the confetti rice Krispy treat and wow, wow, wow! Perfect! <br><br>Never a long line. And parking is pretty easy.<br><br>And that's all I have to say about that. <br>Jackée", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aCLHwDPTQb1bSkCZ8WCV9g/348s.jpg", "caption": "My favorite! Sugar cookies with butter creme frosting. Confetti rice Krispy treat. Yum!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/C75_agNf01xc1pVbjf0r8w/168s.jpg", "caption": "Logo."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Jg7rqsDuNGC_Prryn-sIcQ/168s.jpg", "caption": "Cookies."}]}}, {"review": {"des": "This is place super cute and everything is fresh.  They are not being ironic by having \"sweet\" in the name. Everything has an abundance of sugar in it.  I've started ordering my cakes elsewhere because I want to taste the ingredients , not just sugar.  I hope they add more European style desserts!", "pics": null}}, {"review": {"des": "Amazing frosting! If you want to be in a sugar coma come here! I got a sugar cookie sandwich and a cupcake and they were both ridiculously good", "pics": null}}, {"review": {"des": "Had to take away one star only because I'm now a vegan and there were only two options  chocolate or vanilla. As I stood there dazing at the variety of options for my family, I was given a very limited option which I opted for the chocolate. With such creativity with recipes, I sure do hope there are more options for plant-based eaters like myself. <br>Now for the dairy eaters, my husband devoured the Cookie Monster. He stated it had a great balance and was not overly sweet. My daughter really enjoyed her strawberry cupcake while my boys ate their confetti and M&M cookies. I will be making a trip back for my vegan cupcake but I do hope the varieties for nondairy consumers increase in the near future.", "pics": null}}, {"review": {"des": "After months of wanting to check this place out, I finally made it here! I loved the cute decor of this bakery! I picked the carrot cupcake with cream cheese frosting, since this was rated as one of the best ones by timeout Chicago. It was topped with pecans and was very good. I also got the banana caramel cabinet bread pudding. I liked this one better than the cupcake. Since it was my first time there, the person at the counter was also very helpful in suggesting their other popular items. <br>Overall, nice bakery but I probabaly need to be back to try some more flavors to really fall in love with this place. Molly's cupcakes are still my favorite and Magnolia's banana pudding still beats this one. But I will definitely come back to try their rice krispy treat. Also, from what I gather from other reviews, I think they have different special flavors and items everyday. So worth going back to see some more items up there.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/t20xKvndyHNXw8CDvYqA9w/168s.jpg", "caption": "Banana caramel cabinet bread pudding"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MWX2KiEFRb58J-gupYG9ng/168s.jpg", "caption": "Carrot cupcake with cream cheese frosting"}]}}, {"review": {"des": "Love this place!! My sweet tooth is always craving their cupcakes and cookies!! Literally to die for omgs definitely go here", "pics": null}}]}