{"name": "swift-and-sons-chicago", "reviews": [{"review": {"des": "We had an amazing dinner here for our anniversary and they offered some unique touches that I have not seen at other steakhouses in Chicago. First off, the atmosphere is unique and mixed in some elements from classic steakhouses as well as new trendy restaurants. The interior was beautiful, and this may seem standard to some people, but the chairs were incredibly comfortable which I appreciated. We split a wedge salad for an appetizer, and I would say that was the only disappointment of the meal. If your a classic wedge salad and blue cheese fan, you'll be sad to see the vinaigrette and scarce amount of blue cheese. We split the beef Wellington for our entree and it was fantastic. Very rich, cooked perfectly medium rare, and something you really don't see on any other place's menu. They offer a of of \"showy\" touches that are fun to order and would seem to target expense accounts as well. Examples include tableside drinks, including the champagne flight that we indulged in, and the beef Wellington is cut tableside which makes everyone around you jealous. It was our anniversary, and they came around to take a picture which they returned with a fun card when we got the check. <br><br>Overall a fantastic and unique steakhouse experience in Chicago, which is hard to master given the vast number of options in our great city. 5 stars all the way!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6MfVIvX6f0_DQdJNBUPJZA/348s.jpg", "caption": "Some expensive drink options!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4a-dpDlk_dZ7sJLGOD0fdw/168s.jpg", "caption": "Beef Wellington - to die for"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jt0dLMd3T-zBFtec-WNCaQ/168s.jpg", "caption": "Complimentary Table bread"}]}}, {"review": {"des": "One of the most memorable birthday dinners at Swift & Sons. Lukewarm beef wellington. Lukewarm sides. Room temperature \"warmed\" cake. And they demonstrated excellence in enhancing the celebratory ambiance by presenting two complimentary chocolates for a party of three. So, the possible outcomes are that the birthday guest:<br>1. Consumes both chocolates and looks like a selfish pig.<br>2. Takes one chocolate and lets the other two guests each eat 1/2 the second chocolate.<br>3. Takes one chocolate, a second guest enjoys the second chocolate, and the third guest stares at chocolate eating pigs.<br>4. Takes no chocolate, and selflessly lets guests two and three each enjoy one chocolate.<br><br>Can you believe how much time I spent writing about two bloody free chocolates at Swift & Sons. I'm sure they are thinking now - let's not give any more chocolates to these ungrateful loozurs. Well at least they succeeded in creating a memorable moment for my *special day.*<br><br>And they sat us at the infamous \"guest celebration booth\" adjacent to the bar. Awesome.<br><br>The other disappointment thanks to all these reviews which elevated my expectations was that we missed out on the champagne Swift & Sons has apparently graced many other birthday tables. MY big important day! All ruined. Boo hoo! :(<br><br>By the way, we proceeded with chocolate scenario three. I was a greedy bastard and didn't share with our third member.", "pics": null}}, {"review": {"des": "I've been here for mother's day, a birthday and an anniversary. This is not a cheap restaurant to go to, but the food is great.<br><br>I'd give it a 5 star if it wasn't for the service. Our first experience, we were treated like crap. Waiter was only present to take your order and describe food, definitely not one to make you feel welcome. If we needed anything, we would have to wait for the waiter to pass by which didn't happen often. Sure the waiter could be busy on mothers day but come on,  you should plan for busy days and not have one waiter for a certain area. Food was just okay during brunch, but I wasn't blown away.<br><br>We shared our first experience and the manager reached out to us and invited us to come again and there would be some surprises on our next visit. So on our second experience we came in a group of 10, they definitely made up for it. The food for dinner was definitely better. The waiter was more present and the manager even came to the table to see how things are going. We even got a free magic show.<br><br>We waited for another year to have another dinner at this place. We made reservations and requested for a quiet booth seating. Instead, we were seated in a booth right next to the bar where people stand, walk, talk and wait to be seated. So we requested to be seated somewhere else that's quiet. They seated us just a little bit further from the bar, the place where they seat people who just came in without a reservation.  At that time, I was in a good mood so f*** it. I chose to be positive. Our waiter was ok and the food was great.<br><br>I definitely recommend the beef wellington. I would come back just for that. It was sooooo good! I'm usually not a fan of medium rare beef but this one changed my perspective on it and now I just want it cooked that way. This and their oysters are the main reason why I give it 3 stars. When you're paying a lot of money for a meal, service should be top notch. There are other restaurants that do an excellent job!", "pics": null}}, {"review": {"des": "We came here for dinner with my boyfriend's parents who were in town.The feel and decor immediately draw you in! I could hear the lively chatter throughout the dining room, a few large groups and a few couples scattered around the room. <br><br>I ordered the filet mignon and my boyfriend decided on the bone in ribeye. The filet mignon was the perfect size, it was cooked to my ideal temperature and the taste was great. However, my boyfriend was not a fan of his ribeye. He asked for his steak medium-rare and they brought it out overcooked. He was not satisfied. <br><br>My boyfriend's parents ordered the Beef Wellington (2 person dish). I unfortunately did not get to have a taste of it, but the shared comments led me to believe that the satisfaction was not there.<br><br>The two sides we ordered were the mashed potato and creamed corn. The creamed corn was pretty magnificent. I especially love how they layered the cornbread to blend perfectly with the creamed corn! This dish was great! A must try!<br><br>The mashed potato was okay. Nothing incredible and I probably would never order it again. Also, the sides are large enough for tables! Two sides fed 4 of us, no problem. <br><br>Service was pretty great! Our waiter was efficient, quick and polite.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GPvd2KhFOxZQpZCxNYy6zA/348s.jpg", "caption": "Filet Mignon"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5pKluRIFSwI-ri-lq0Xksg/168s.jpg", "caption": "Beef Wellington"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/z9OY26j2EGsGhJCz2GHCmg/168s.jpg", "caption": "Mashed Potato"}]}}, {"review": {"des": "One of the best steak experiences ever and an excellent choice for my son's birthday dinner. Everything was cooked to perfection and our server was knowledgeable not only about the menu but also the history of the location, which was once an old meat processing plant. Normally I would subtract a star for the pricing but we've paid more for much less. Not cheap, but worth it.", "pics": null}}, {"review": {"des": "Great food, ambiance and service. Special kudos to Mike the magic man. His tricks left our minds blown.", "pics": null}}, {"review": {"des": "Not that Swift & Sons needs another glowing review, but here it is. The food was excellent, but what's really motivating me to write this was the outstanding service we received all night. We went for my dad's birthday and from the moment we sat down (cushy comfy booth) and received menus (\"Happy Birthday Bruce!\" printed at the top) we felt special. <br><br>I don't remember our server's name and I'm sad about that, but I am simply terrible with names. He bantered with my sometimes weirdo parents and never acted like what they were saying was unusual- even when my dad gave him the recipe for his special rye Manhattan for the bartender to make. When I talked my dad into the mac & cheese side instead of the baked potato our lovely server brought him the potato as well and said, \"dads never get what they want!\" He was just wonderful. I really hope my dad tipped him well.<br><br>And then obviously the food was awesome. Venison pate, spicy shrimp, oysters, all flavorful and beautifully done. My mom and I split the Beef Wellington for two - I haven't had Wellington in years and it was perfectly cooked with flaky pastry and a cute little foie gras hat inside. Divine. I'm also glad that we ended up getting that potato because it was delicious. AND I'm glad I bullied them into the mac & cheese because that was ALSO delicious.<br><br>Other really wonderful little perks of this place are the tableside services - cocktail cart, tableside Wellington, and the chocolate cart. They really bring you back to a slightly fancier time before everyone just wanted to wear jeans to dinner and share small plates. We like fancy.<br><br>Thank you Swift & Sons, for making my dad's birthday wonderful and damn I wish I could remember that server's name. He's doing a great job.", "pics": null}}, {"review": {"des": "Great birthday dinner!! Brittney and the staff went out of their way to make sure my family and I were 100% satisfied with our meal. The salads were FABULOUS,,, the steaks were FABULOUS, the sides were FABULOUS! I appreciate the effort they took in making sure my birthday dinner was perfection.", "pics": null}}, {"review": {"des": "I thought I wasn't a steak fan until Swift & Sons changed my mind! My mind was blown away by this crispy outside succulent inside piece of fillet mignon covered with blue cheese crust. Every thing was so good the oyster, hamachi crudo, and the chocolate covered caramel which was complimentary. I will certainly go back!", "pics": null}}, {"review": {"des": "We celebrated my friend's birthday here, and it was a wonderful experience start to finish! I love the look and feel of the dining room. Go and see for yourself. There seemed to be many groups but also others on dates or double dates. Any occasion is perfect for a night at a gorgeous steakhouse :) We were brought to our table and noticed that the menus wished my friend happy birthday which I think was so thoughtful! My friends love steak more than I, but I still loved eating here because aside from the delicious meat, the appetizers and side dishes were excellent. <br><br>My favorites:<br>-Heirloom Tomato & Burrata Salad with red onion, parsley, and balsamic.<br>-Watermelon with prosciutto, French feta, and candied walnuts.<br>-Roasted Mushrooms with porcini aioli. Favorite mushroom dish in the city! If you love mushrooms, you must order this!<br>-Pimento Mac & Cheese with piquillo pepper and ham. SO good!<br>-Deep Dish Cookie with vanilla ice cream. Who doesn't like a warm, freshly baked cookie topped with ice cream?!<br><br>Other aspects of Swift & Sons that I feel are special is the cocktail cart that can prepare you a drink table side if you'd like, the sweets cart, and the option to have a magician come to your table and perform some of their magic tricks. Without a doubt, one of Chicago's best steakhouses. Highly recommend!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SmQUFV4ct0IJYP3x6jd3HQ/348s.jpg", "caption": "Hamachi crudo with plum-kaffir lime ponzu, and nasturtium."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DOVrFITZXAjC7O8cukw7tg/168s.jpg", "caption": "Deep dish cookie from the dessert menu and all the treats from the sweets cart. Yummy!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UQWsehNJhI74PYirFzv9yQ/168s.jpg", "caption": "Bone-in ribeye."}]}}, {"review": {"des": "I came here for a private event, and it did not disappoint! Delicious food, beautiful space, efficient service. I can't wait to try it again with access to the full menu", "pics": null}}, {"review": {"des": "Okay as I've been to a plethora of nice steakhouses in the city I was really excited to try this one and left pretty disappointed. I had made the reservation like 2 months in advance for a prime time on a Saturday night. I had written in the open table requesting a nice table. When we arrived we were seated right away AT THE BAR. The bar area in my opinion is not a nice table and usually it's a place where walk ins are taken. I saw a girl take another couple to the more formal dining room space and ask \"oh are you guys celebrating something.\" Unfortunately and to their inconsistency, no one asked us if we were celebrating something. And we were, we were celebrating my husbands promotion which is why we chose what we felt a more upscale restaurant to celebrate it in. <br><br>Honestly, I wish I had said something but I was shocked that when you make a reservation way in advance you got seated at the bar so I was trying to convince us that it won't be so bad. No candle lit like it was at other tables, in 20 minutes the bar got so crowded our own server had trouble a few times getting to us. <br><br>Honestly when you're ordering a $105 entree beef Wellington I didn't want to eat it at the bar. Our server brought it over but he couldn't even cut it right away as people kept coming past us so I felt like we missed out on the presentation aspect of the meal. <br><br>They get two stars as I did love their one spicy shrimp appetizer and our server was actually very nice so no complaints to him. I just think management as a whole dropped the ball on taking care of people and their requests. When you're spending $250 on a meal, I think you want to feel a little special. I could have chosen to spend a lot less money elsewhere that evening without any reservation. <br><br>Then came the dessert bar cart, again our poor server had trouble bringing it in Bc by that point the bar was just overly crowded and super loud I should add. I had trouble seeing everything Bc our server was trying to be respectful for the people jamming behind him and he didn't want to run the cart into them. <br><br>Overall, this is a supposed to be a nice establishment but I didn't feel that we had that nice experience. I think had we sat in the actual dining room our entire experience would have been much better. Very sad to me, as it was meant to be a special dinner and it didn't feel that way at all.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/H16I1uM-slRxTvdhhi0WeA/348s.jpg", "caption": "Beef Beef Wellington"}]}}, {"review": {"des": "We went here to celebrate my birthday and overall it was enjoyable. The atmosphere is nice, dimly lit, decor is stylish. My cocktail was awesome - Gin & Jam. The service was impeccable, very attentive. Our food was pretty tasty as well. Only negative was the crab cake had bits of shell in it and that kind of ruined it for me. Also the butter had chunks of sea salt which were a bit too much. Other than that the steak my husband ordered melted in your mouth and the green beans were divine. At the end of the night we chose the angel food cake and they brought it out with a candle and happy birthday message on it which was a nice touch. All in all a great place and I'll definitely go back.", "pics": null}}, {"review": {"des": "Tip: Arrive between 3-5pm if you're going Monday to Friday to take advantage of the $1 oysters happy hour! <br><br>We made reservations for 6:30 but we made sure to arrive for happy hour so we got there around 5:30. A lot of people don't know that the bar inside Swift & Sons offers the same Happy Hour deals as the Cold Storage bar and it's less crowded! We initially ordered a dozen oysters and those went down so good we ended up ordering another dozen. The oysters were so fresh and so sweet. It was an amazing deal considering you get 1/2 dozen for $18 on the regular menu. They also had $3 beers as part of their happy hour so we were able to get Stella's for $3. After we had our fill of oysters, we got seated at our table for dinner. The server was very informative and told us a brief history of the Swift & Sons and their cold storage. <br><br>We ended up ordering the French Onion soup purely based on the pictures we've seen from the restaurant. It was a big bowl with a huge piece of bread so it got really filling. For main course, I ordered the bone-in filet medium rare and my brother got the bone-in ribeye. We also got orders of bone marrow with chimichurri sauce and bordelaise sauce on the side. For our side dishes, we got the roasted mushrooms, asparagus and fries. The roasted mushrooms are where it's at and i can't even begin to describe it. You'll have to experience it for yourself to know. They also give you 3 other sauces on the side with steak and they were horseradish, bearnaise, and steak sauce. The horseradish paired well with my steak and gave it a little bit of a bite. The server suggested eating the bone marrow with the leaner cut of meat to really amplify the flavor. He was right! It's so good! <br><br>This ended up being too much food especially after all the oysters and that french onion soup so we took the leftovers home. Most things don't reheat well but this meal manages to seem better the second time around. Definitely recommend this place and bringing my sister here to celebrate her birthday!", "pics": null}}, {"review": {"des": "This place is a delicious and trendy steakhouse. We went here and had a great time. When you go in, everything is tinted in a warm hue and buzzy. <br><br>We started with a dozen oysters and a lobster Thai style bisque. I received the wrong soup, a cold corn crab soup. Once we let the waiter know, it was quickly replaced and my soup was delicious. The floor manager stopped by the table and made sure it was ok and if we had any issues to let him know. That was a nice touch. The steaks we ordered were strip steaks. Let me say, unless you're a big steak eater or super hungry, a couple can share one of the larger steaks and a couple sides and be plenty full. The steak was delicious and cooked perfectly. I'm not sure how they do it, but the steak was well seasoned even in the center even though it was so thick. For the side, I ordered the green and yellow beans Provençal. They were tasty but not as delicious as the roasted fingerling potatoes my sister ordered. It had so much unami and creamy center! We also got the rock shrimp which was tasty, crispy and a bit sweet.<br><br>The cocktails were on point. I didn't want to to get one of their fancy cocktails but figured even a regular cocktail would be made well. They are serious about their steaks and cocktails. <br><br>This place would definitely be a great place for a celebration, a fancy night out, or just want a change. I recommend a reservation since it's fairly popular. The service is excellent.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pZ_5DqMn-IWnWOoh_AwmRw/348s.jpg", "caption": "Strip steak, medium rare. Perfectly cooked and well seasoned!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qR3n1P4jvXEXkx9fMB9ddQ/168s.jpg", "caption": "Cold corn soup"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/u0a5wOL3bRPdwcX8QLUTug/168s.jpg", "caption": "Green Beans \"Provencal\""}]}}, {"review": {"des": "Now this is a steakhouse! If you trying to choose between the many upscale steakhouses Chicago has to offer, GO HERE!!! Great ambiance, great food, and great service. <br><br>If it's you first time going, and you're in the mood for steak, definitely get the beef Wellington (to share with someone else). It's $105 but split between two, that's pretty much what you'd pay for a single nice piece of steak. My husband and mom couldn't believe how amazing it was. \"The best steak I've ever had-melts in your mouth like butter\" per my husband. The roasted mushrooms on the side were oh so good too. I got a wedge salad which was out of this world and beautifully presented. I also got a crab cake, which to be honest I didn't really like (and is my only bone to pick)-had the oddest texture and pretty much tasted like crab mixed with cold slaw.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kWYH3GAX3TmcGnkNuGBA9A/348s.jpg", "caption": "Wedge Salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tslvB6X3Yph5EaMX10E1UQ/168s.jpg", "caption": "Roasted Beets"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/H10m2BryYjEB5vSYOZw5pA/168s.jpg", "caption": "Crab Cake"}]}}, {"review": {"des": "Awesome steak joint located in the west loop right next to the google building. To open a restaurant in this bustling area, you have to step your game up. <br><br>Enter Swift & Sons<br><br>The Service = Impeccable<br>The Interior = Beautiful<br>The Food = Amazing<br><br>On this splurge feast we had the Smith & Sons cold seafood platter, wedge salad, lobster bisque, and way too many other things to list. <br><br>For my main attraction, a perfectly seasoned and well cooked bone in rib eye topped with a beautifully seared slice of foie gras aka beautifully tasty animal butter. <br><br>Since I am not much of a sweet tooth, I decided to have an after dinner drink prepared table side. It was called The Henley. <br><br>The entire dining experience was one to remember.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JCadaERN0kBoyvxwVUOKyg/348s.jpg", "caption": "Lobster Bisque"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Jw6oOXYDa9qGAjvUE3v0Gg/168s.jpg", "caption": "Savages attacking the seafood platter"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Th-tU195Cm5zZFw8ezlR-g/168s.jpg", "caption": "The Henley made table side and a coco nib to end the meal"}]}}, {"review": {"des": "I got scallops at a steakhouse bc I don't eat steak. They were good. Friends liked their steak. The sides were good. Drinks were well made.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eiIXqcpt961E6wPXrDw5wQ/168s.jpg", "caption": "Roasted Diver Scallops"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_371lWqBhfVN8Y-BLwqD2g/168s.jpg", "caption": "Time flies"}]}}, {"review": {"des": "My friends and I came here about a month ago to celebrate our return back to Chicago (this place is new since we moved away 5 years ago). It was happening for sure, and provided a nice venue for such an occasion.<br><br>They are known for the Beef Wellington, which is for two. So my friend and I decided to split that. It was quite filling and savory! But first, we started off with cocktails and ordered a number of appetizers for the table to share. We also got a number of sides to share as well.<br><br>Overall, dinner was a very nice experience. I would definitely come back. Being a steakhouse, there were a few steaks that I wanted to check out in a next visit.<br><br>Sorry for the short review; next time I will need to make sure I follow-up more promptly after a visit!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/J-lNA5dxWOero3Dt9C-I9A/348s.jpg", "caption": "Dessert"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ET3gO-NSv6sS7_s-geMdWQ/168s.jpg", "caption": "Beef Wellington"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CAgroFbXuMwUIx8u9t_GmA/168s.jpg", "caption": "Crispy Brussels Sprouts"}]}}, {"review": {"des": "Made reservations for a Saturday night family dinner and had high expectations for a Boka venue.  Despite having reservations I waited past my time and had to be the one to ask about when I would be seated.  During this wait time in the lobby no one offered to take our coats.  Then one of the hosts asked me twice for my name, despite having already greeted me when I arrived and tell me that I had to wait.<br><br>Once seated with my family the food was impeccable.  I expect nothing less from Chris P.  Must order the lobster bisque, wagyu Bolognese, crab cake, ny strip, kc steak and beef wellington.  unfortunately, our server had six tables in our area and his support team of two were not attentive.  I asked twice for coffee refills, twice for more wine from the $91 bottle we ordered, and our server's \"check ins\" with us were few and far between.  For a place that cost us $440 without tip for 3 people, I expected a lot more.  At least a table cloth!  Which I noticed were reserved for the tables of 6 or more and were grey.<br><br>Further, our server was expected to explain all the desserts and chocolate trolley which he did not know.  Someone at our table had a nut allergy and he was unaware of any items containing nuts.  At a real Chicago steakhouse they ask before the meal even begins about any food allergies.  <br><br>I would not come back at all due to the poor greeting, service and lack of attention.  I would do carry out.", "pics": null}}, {"review": {"des": "I really have nothing bad to say about this restaurant. My only criticism is actually that the Yelp page has $$ for cost and I think it's legitimately $$$$. For an entree and a drink you would be hard pressed to eat for less than $60. <br><br>That said, food and service were top quality. My brother and I started our meal with our waiter's whiskey suggestion and it went really well with the pierogi appetizer. The cabbage within the pierogi gave it a delicious tangy flavor and the sauce was good enough I was scrapping it off the plate to smother it on my pierogi. <br><br>We had the \"old fashioned\" beverage cart come by and make us a couple of Torontos. If you're going soon I recommend this. The experience of having a knowledgable mixologist come by and talk you through making the beverage. Really cool. <br><br>I had the S&S onion soup and it was exactly what you want in a French onion soup. The burnt-on cheese is reason you order something like this an was delivered!<br><br>Last, we both ordered the 8oz filets and they came out with a perfect cook. I judge a steak based on the question \"Could I do this at home?\"  In this case answer was probably not. This was a quality cut of meat and it's hard to get a crust like that on a steak while delivering a medium cook.", "pics": null}}, {"review": {"des": "This is more of a solid 3.65 star, not quite a 4.   The hostess' were all a mess, server never introduced himself.  It is kind of a fancy but lacking service location.  <br><br>Steak was great, we had the ribeye.  The oysters were on point and the Caesar may have been the best I've ever had.  The bread was ok and the bar lacked attention, phones and each other were more interesting then waiting patrons and people with questions. <br><br>All together not worth the cost with out the true service experience.", "pics": null}}, {"review": {"des": "Beautiful decor. Over priced food. <br><br>If you love steak you will like this place... unfortunately, I'm indifferent towards steak so this restaurant didn't do much for me. Please note that no sides come with the steak so you will have to order them separate. <br><br>Food: <br>Scallops - They were ok. Spread out on a plate with no sauce or intrigue. <br>Goat cheese gnocchi- I thought I was going to love this!! It was ok tasting .. not enough goat cheese <br>Crispy rock shrimp- Delicious ! The best thing I ate all night. Perfectly crispy with a zap of chili flavor. I loved it. <br>Ice cream sundae- It was good... I usually enjoy eccentric pairings of food. In this case ice cream and popcorn, but it didn't do it for me. <br>Filet mignon- My boyfriend said it was juicy and flavorful but he's had better. It came with a variety of sauces that I used to dip my scallops in. I appreciated and needed this sauce!<br><br>Ambiance- Beautiful. Has a prohibition vibe to it. I felt like a rich man from the 1920s at a business dinner. <br><br>Service- Our waiter was highly knowledgeable and impressive. <br><br>I am a dessert girl and was excited about the dessert cart. What a nice touch! <br><br>Overall, this isn't the place for me. It's not worth the price. But if you love steak and are willing to pay a lot of money for it I highly recommend!", "pics": null}}, {"review": {"des": "A hip steak house with an awesome decor, great food & fantastic cocktails.  Our hamachi appetizer was perfectly executed and our steaks were cooked spot on.  Will definitely plan my next special evening here.", "pics": null}}, {"review": {"des": "I expected more for dropping $100 a person.<br><br>My halibut was just okay, I think I make it better at home.  The side of  Asian flavored broccoli tasted like it had a sriracha sauce on it and I dislike sriracha.  The crispy potatoes were kind of bland.  I kept wanting to salt my food but there were no salt and pepper shakers.  The one bite of steak I tasted was stringy and chewy and I had to spit it out into a napkin.  The complimentary birthday surprise for the husband was a real winner!  It was a warm chocolate chip cookie with ice cream.  It had lots of gooey chocolate and was not too sweet, which is what I would have expected. It is something I would have never ordered on my own, fearing it would be.  I ordered peanut butter ice cream because none of the boring desserts appealed to me.  It was darn good I must say, especially with a taste of that warm cookie.  Drinks were adequate yet forgettable.", "pics": null}}, {"review": {"des": "As much as I wanted to give Swift & Sons 5 stars, I'll tell you why I didn't.<br><br>The GOOD: . The wait staff was professional, friendly, and attentive without being overbearing. We had to wait 30 minutes for our steaks, so they brought us two complimentary salads that were delicious. The Caesar salad was phenomenal for being so simple and the tomato burrata salad held its own, too. I ordered an 8oz filet mignon medium and it was perfection. It cut like butter and every bite was better than the last. I would pay $50 for it again. The one good side we had were the whipped sweet potatoes; they were divine (and so smooth!). Don't even get me started on the bread! I can't vouch for the drinks, but everyone at the table had multiple Gin + Jam's, which they all (4 people) said was delicious.<br><br>The BAD: The sides we ordered were the roasted cauliflower, spicy flowering broccoli, mashed potato and whipped sweet potato. The spicy flowering broccoli was nothing to write home about - I took one bite and that was enough. While the mashed potatoes were good, they were boring. Don't waste your time ordering either of those.<br><br>The UGLY: The roasted cauliflower just wasn't good, straight up. It was tangy and gross. No one enjoyed that dish. The only side I would recommend of the four we had would be the whipped sweet potatoes.<br><br>Overall, I'll definitely go back to Swift & Sons, but next time I'll try the fingerling potatoes and creamed spinach instead.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9hnyProElzs2fLmvoS0ydQ/168s.jpg", "caption": "Gin + Jam"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1Lfg6EhpOInzpkjaBWLDHw/168s.jpg", "caption": "8oz filet Filet Mignon medium"}]}}, {"review": {"des": "The food: 4.5/5. I tried several things on the menu. The small seafood tower had great shrimp and oysters, but I wasn't a huge fan of the smoked mussels as they were a little too greasy for my taste. For appetizers, we tried the tomato burrata salad, which was fantastic and spicy shrimp of some kind, which was also enjoyable but a little greasy, again. For our mains, we found that a 48oz porterhouse and three sides was more than plenty for 7 ladies. Everything was delicious, including things from the dessert cart they brought after dinner. <br><br>The service: 5/5. Top notch service. The timing was great, I had some special requests that were accommodated. The ambiance was your classic steak house, but less stuffy. <br><br>Overall: 5/5. A must go for steak aficionados.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xV5KPYtYMVKewyqD1OKTkg/348s.jpg", "caption": "A piece of the 48oz porterhouse. Sides: mashed potatoes, Brussels sprouts, cauliflower"}]}}, {"review": {"des": "Great service and great steak!<br><br>We came here for a birthday celebration.  The ambience was nice; however since we booked with OpenTable, we got a crappy location for our table (towards the end by the bathroom and some exit doors).  Boo for that! Service was as expected in a nice steakhouse.<br><br>The waiter informed us that they have a special for the night, and there was only 2 servings of it available for the night... an A5 Miyazaki Wagyu flight.  I've always wanted to try A5 Miyazaki Wagyu and couldn't resist. We ordered it!<br><br>There were 3 steaks in the flight... one was a strip loin.. the next was was a rib cap... and the last (AND THE BEST) was a filet... OMG that FILET...  i normally don't like filet because it's not fatty at all... but this was the most marbled filet i've ever seen (the brought out the raw product to the table so we could see it!) -- and we ordered them all medium rare... omg.. that FILET totally melted in my mouth like butter... it was honestly the BEST STEAK I'VE EVER HAD.  I love marbling, and this one was PERFECTION!<br><br>Anyway, we had a great night tasting the different meats, and we also had a great appetizer (some shrimp appetizer, -- soo good -) but anyway thanks for introducing me to A5 Miyazaki filet, Swift and Sons!", "pics": null}}, {"review": {"des": "We had a perfect experience at swift and sons. were celebrating my husband's birthday, it was our first time at this restaurant, and everything exceeded our expectations. <br><br>Some highlights: <br>-their old fashioned cart menu. They have a full list and they bring the cart to the table and walk you through each step and ingredient. <br>-seasonal duck ravioli was insane good.<br>-loup de mar fish entree was divine <br>-New York strip was one of the best steaks we've had in the city <br><br>Last but not least, the service was outstanding. We'll be back.", "pics": null}}, {"review": {"des": "Two words: Beef Wellington. It will change your life and ruin all other Wellingtons after it! The crust is so delicate and the mushroom stuffing so flavorful. And the portion is perfect for two, especially with all the pharmaceutical-grade Martini's and apps you'll be having with it!", "pics": null}}, {"review": {"des": "I've been wanting to try this place for a while now and made reservations on a whim. The dining room was beautiful and modern.. and then they seated us in what seemed to be an attached private dining room. It felt secluded since we were the only ones in there, with no background music and poor lighting. Booo.<br><br>Anyway, I had a glass of pinot noir and my fiance ordered an old weller antique old fashioned, which was made tableside. The whole presentation was entertaining and even educational. We had the green & white asparagus, crispy fingerling potatoes, roasted mushrooms, roasted diver scallops and the new york strip steak. They provide a nice variety of complimentary breads and butter. I was excited to try their new asparagus dish that I've seen on instagram, but I found the flavors a little too muted. The crispy fingerling potatoes weren't really crispy, but still tasty and a good portion. The roasted mushroom side was huge, enough for 4 people to share. The roasted diver scallops were prepared nicely. The new york strip was good, but not amazing. We had the deep dish cookie for dessert and it was super sweet. They took note that we were celebrating my fiance's birthday and they brought us a couple truffles with a candle, it was a nice gesture.<br><br>Overall, dinner was fine, but I've had better. There is no shortage of great steakhouses downtown.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QMm9NktT8QinwIJUBu08uw/348s.jpg", "caption": "crispy fingerling potatoes"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-yisgqDyvnpxxEq7tNJ1BQ/168s.jpg", "caption": "deep dish cookie"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zSVmxpQbb3QMdUzR_cUziA/168s.jpg", "caption": "birthday truffles"}]}}, {"review": {"des": "Flipping freakin fantastic. <br><br>Came here a few weeks ago for a late night dinner and had just the most wonderful meal. We came for a post-show meal with a 10:30p reservation. Despite the late hour, there were still several parties still seated when we arrived. <br><br>FOOD: We ordered half a dozen oysters to start, the beef wellington for 2, and a side of roasted mushrooms. Everything was cooked to perfection. The beef wellington (the first time I've had it) was definitely worth the splurge, and such a fun experience! They cut it tableside for you. The mushrooms were also great, and came with an aioli that was rich ad flavorful. It was a perfect amount of food for 2 people splurging on a nice meal. And of course, we couldn't resist dessert! Ordered the S&S Sundae which I HIGHLY recommend! Now I've had ice cream, and I've had ice cream, and this was ICE CREAM. Everything was of the highest quality and (as always) the perfect size for 2 people. <br><br>SERVICE: Maybe it was because it was late at night, but I have no doubt that we would have been treated just as well at any time of day. Our server (Michael I believe) was attentive throughout and did a great job of asking if we wanted more drinks, etc... Our waters were always refilled, and our food came at the perfect pace. <br><br>ATMOSPHERE: Well the space is gorgeous. We had a lovely round booth that was large and comfortable. It's a great space for corporate meals, special dinners, or even just drinks. You'll feel first class here! <br><br>Overall, I would definitely come back, and am already looking forward to my next meal here!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YGTyMlOamPT6vPzHIxtlaA/348s.jpg", "caption": "S&S Sundae. HIGHLY RECOMMEND, I would come back here just for this. And it comes with an adorable cow cookie!"}]}}, {"review": {"des": "Came in without expectations, and left with a pretty unmemorable experience.<br><br>The ambiance is very traditional--very \"steakhouse\". Classy feel. The servers were very attentive and brought the food out in the timely manner.<br><br>Crab cake (3/5): good, because I love crab cakes, but it was pretty average. Nothing special<br>Chicken Liver Mousse (5/5): I actually really liked this; loved how the pear jelly really went well with the liver flavor<br>American wagyu (3/5): for a steakhouse, this should have been the highlight. However, the steak was not seasoned well and I think the foie gras on the top was a little over-cooked.<br>Brussel sprouts (3/5): good seasoning, but overcooked. they were not really crispy anymore, but rather brown and a little too burnt<br><br>Overall, I would probably not come back to Swift and Sons. May be back for the appetizers and drinks, but definitely not the steak.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QPRLRHN0aluXhD536_CiEA/348s.jpg", "caption": "American wagyu with four gras on top"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iY2WcgAjEYxF6fm64ItStg/168s.jpg", "caption": "Chicken liver mousse with pear"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JehVa0rt3Uv-2_0Zm0aa3g/168s.jpg", "caption": "Crab cake appetizer"}]}}, {"review": {"des": "Swift & Sons is located in the best area of the city and is inside the Google building. <br><br>The Fulton Market District has just exploded with amazing dining options and Swift & Sons is one of the prime gems. Lots of cool stuff happening here.<br><br>I've been to S&S a few times for happy hour and checked out Cold Storage in the front. Great happy hour specials and both have big fun bars. <br><br>The dining experience at S&S is unparalleled. The service was impeccable and the cuisine is creative and flavorful. This is a steak house, but there is so much more here. Lots of creatively goes into the flavor profile in the appetizers, sides, and main entrees. <br><br>The oysters were fresh and have all the right flavors, and my lobster was cooked to perfection. I can't wait to go back and try the other options, or will I just get the same thing again because it was so spot on...?", "pics": null}}, {"review": {"des": "Swift & Sons is a cut above in Fulton Market. Anything from the floor tiles to the retro decorations displayed a level of creativity with good old-­fashioned, irresistible predictability. The vast space, formerly a meatpacking facility, has been re-imagined as a stylized office with plenty of brass and wood. The wait staff are charmingly dressed in gray suit jackets and equipped with leather-bound notepads for scribbles.<br><br>The restaurant's savory, pastry and service elements come together in one superb dish, and that's the beef Wellington. Sized for two, this classic wraps 12 ounces of medium-rare tenderloin in foie gras, mushroom duxelles and spinach, all encased in a magnificent, golden pastry shell. Served on a thick cutting board, sliced delicately, and served table side, this is the kind of presentation and ritual that makes guests at nearby tables rethink their choices. I've never had a better version of this dish, primarily because I have yet to find another Chicagoan restaurant to serve it. But regardless, I've now found the one and only. The precise execution was evident from the rosy tenderloin to the crispy layers of pastry. I am in love!<br><br>Some of the other items that we had pales in comparison but they excelled as stand-alones. We had the squash agnolotti, Brussels sprouts, carrot cake, macaron with pumpkin and chocolate, and birthday chocolate truffles. The squash agnolotti was light-heartedly paired with duck confit, pumpkin seeds, and mint. It is a good choice to keep appetizers light if you're in for a heavy red-meat dinner. The carrot cake is truly a one-of-a-kind. Within the delicacy was cream cheese Bavarian, praline crumble, and bourbon pecan ice cream. Not quite the old-school 1940s confection, but this modern approach is to applause for. The praline crumble, similar to a peanut brittle, and the alcohol-infused ice cream were strong forces that did not overpower the cake itself.   <br><br>With all that said, S&S is an unmistakably solid birthday choice or for any other occasions. I was impressed and I look forward to a return to discover more!", "pics": null}}, {"review": {"des": "Solid experience! The filet was good and the mushroom side was super yummy! I loved the champagne that I got and next to the filet, my favorite part of the experience was the chocolate trolley! I got 4 things and they were all so yummy!! I went back and we got the bone in filet. Good again. Rock shrimp was super yummy. Pierogi was good.", "pics": null}}, {"review": {"des": "I made a reservation for my boyfriend and I at 8:30 for his birthday. We were told that they were behind and that it would be only a few minutes wait...ya fast forward 30 minutes and we finally get seated at 9:15.<br><br>I wanted the old fashioned cart for my boyfriend but they switch to martini cart (wish they would've told me bc then we would've had drinks at the bar). <br><br>To eat we started with Steak Tartare - OMG this was SO good, they gave us some tasted garlic bread with it too. Perfect!<br><br>After that we had the Beef Wellington (you have to share this with 1 other person), I read that this was a must-have and holy crap were they right! This dish was the best thing I've ever had! The meat was so tender, the foie gras melted in your mouth and the spinach complemented the whole thing while the pastry was flaky and cooked just right. We were so happy with this decision, you HAVE to get this dish! <br><br>We also ordered a side of the mushrooms - again, seriously these were the best! <br><br>We were so full that we decided to skip dessert but they surprised us with 2 perfectly bite sized truffles that just melted in your mouth and went great with the bottle of red Syrah we got.<br><br>Overall, this was such an amazing experience, but having to wait for half an hour to an hour for our table while having a reservation is ridiculous and this place is too good for this to be happening.", "pics": null}}, {"review": {"des": "Excellent food and service!! A bit pricey but well worth it. Another great place from the BOKA group.", "pics": null}}, {"review": {"des": "Omg, where do I even begin? Dinner last night was nothing short of magical. My bf and I were celebrating our anniversary and my birthday, and when we got to the table there was a rose pedal heart and a card! It's a really gorgeous interior, and very big. Eric, the manager, personally came to our table and poured us a glass of champagne to start. Our server, Michelle, was completely on point. She knew when to give us time to peruse the menu and talk, but was always there when we needed her. She was great at answering questions and giving suggestions. <br><br>We started with the shrimp cocktail- it was great. The cocktail sauce was spicy and gave it a great flavor. We also shared the French onion soup, which was so cheesy and delicious. For our main course, we had the beef Wellington to share. I was a little hesitant about the Foie Gras, because I'm a picky eater, but it complimented the beef nicely and would have been easy to avoid if I hadn't liked it. We also got the mashed potatoes, and I don't know how they make them so creamy but they were fantastic. <br><br>One of my favorite parts of the night was the magician- he was incredible! I have no idea how anyone can be so good at slight of hand without actually being a wizard, but it was a really cool addition to the night. <br><br>Eric came to our table multiple times to make sure we were having a great experience (which we were), and really made sure the night was special. <br><br>I left full, happy, and so impressed. Way to go, S&S!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yzUv-BonoC97H2f6EBOTGQ/168s.jpg", "caption": "Beef Wellington cooked perfectly medium rare"}]}}, {"review": {"des": "Cool venue, great bar, terrific service and the food was outstanding...except for the steak.  Sorry to say it because I really liked this place but the NY strip I ordered was just plain tough.  It was cooked perfectly and the mushroom side dish was excellent but it was just one tough piece of meat.  Not sure I'd order steak at this steakhouse again.", "pics": null}}, {"review": {"des": "There are a lot of steakhouses in Chicago with great atmosphere, and there are some with great steaks, and there are fewer still with great side dishes. Swift & Sons is one of the rare places that offers all three, along with excellent service and fair prices.<br><br>We started with the big eye tuna crudo and the crispy rock shrimp. The crudo was melt in your mouth delicious, but a very small serving. The rock shrimp was a huge portion, as generous as the tuna was stingy. The crispy coating held up to the slightly spicy sauce; an excellent dish.<br><br>A Caesar salad split three ways was a nice palate cleanser, but it was just okay, and the croutons were fairly indestructible.<br><br>We shared a 38-ounce tomahawk rib eye (the smallest size!) three ways. That's a lot of steak, but it was so delicious, with its charred crust and tender marbling, that there wasn't a scrap left. <br><br>We also had a side of Lobster Thermador, which was very good, but not a traditional Thermador, more like a half lobster tail with some butter-based sauce.<br><br>The creamed spinach was also very good; rather than being minced it used the whole leaves, but was definitely more creamed than sauteed.<br><br>A popular dessert option is the chocolate trolley, with an assortment of small bites for $3 each. I opted instead for the very interesting white coffee ice cream, which was indeed white, and very nicely flavored.<br><br>Wine selections are extensive, thoughtful, and fairly priced. Our server was extremely familiar with the wine list, so that we didn't even need the sommelier.<br><br>Both server and busser were friendly and attentive.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7NAPl-73tWOwKPX_flg2Yw/348s.jpg", "caption": "Chocolate trolley"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1m2cOdO2V4fvnGtndIqf1g/168s.jpg", "caption": "Tomahawk"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FyjL79AqvRQLKaiCIK1TNw/168s.jpg", "caption": "Interior"}]}}, {"review": {"des": "Food and service are both outstanding! Menu has some changes, some stuffs been taken off the menu. Strongly recommended 180 dry aged 5A Wagyu steak and Wellington steak", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zsWHylts6Ne0-W9YdSZ5dA/168s.jpg", "caption": "180 day dry aged 5A Wagyu Steak- really nice flavored, crispy outside"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SyuJws2XMDYTKZ1TfXUfag/168s.jpg", "caption": "Extra Foie gras"}]}}, {"review": {"des": "Special circumstances. Beautiful Day. Remarkable customer service. Oh, and an outstanding meal.<br><br>A few weeks ago, my fiance and I were planning a destination wedding for the summer of 2019 when her mother's health quickly began to diminish. We wanted her mother to be able to celebrate with us so we frantically scoped out a way to plan a wedding at a private venue in Chicago within 9 days. After reaching out to several sites we were excited to hear back from Swift & Sons within a few hours of our inquiry and learn of their availability for our preferred date. Not only was the response prompt and thorough but it also conveyed a kindness and empathy for our situation. <br>Since we were already huge fans of Swift & Sons we quickly reserved the private rooms and began planning all the specifics with Kathryn and Brian who handle their private events.  These two individuals were OUTSTANDING at every turn of the process.  They accommodated us for a quick pre-visit the next day and gave us options on how we could set-up the venue for the ceremony, seating arrangements for dinner, coordinate a cocktail hour during pictures, design a menu/bar list, time-table, dance floor, Audio/Visual, flower delivery, cake delivery (which the waved the standard fees), pre-reservation staging, handicap accessibility, and on-and-on........Kathryn, Brian, and the whole team at S&S were wonderful to work with the entire way through.  <br>The day of the ceremony & celebration went off without a single hitch and everything turned out beautifully.  The food was outstanding - we enjoyed filets and salmon for entrees.  Chinese Brocolli and Mashed Potatoes as sides, and the arugula salad to start.  We also had cocktail shrimp with a great cocktail sauce, veal meatballs, and burrata for appetizers during the cocktail portion.  Several people declared the filet as \"the best they've ever had\". <br>I was so happy to marry my bride.  I was ecstatic that her mother could walk her down the aisle. And I was so proud to have our close family and friends there to help us celebrate.  It was all made possible by the good people at Swift & Sons who did everything in their power to make sure our day was special.  Their staff even joined our small celebration on the dance floor for an impromptu conga line, which was great.  I look forward to celebrating our 1st anniversary at S&S.....and our 50th.", "pics": null}}, {"review": {"des": "My boyfriend surprised me with reservations here last night for my birthday and holy moly this place did not disappoint. I'm not picky when it comes to steakhouses, but this place's service (on top of the delicious food) was what really brought it home for me. <br><br>Our waiter, Humberto, was extremely knowledgeable and gave us an overview of some of the favorites on the menu. He was incredibly attentive and made sure we were never without enough water, the table was always clean, etc. When I couldn't make a decision about sides and a dessert (welcome to my life) he brought me samples of what I didn't order so I was still able to try it! So sweet. <br><br>For appetizers we ordered the shrimp cocktail and the pappardelle. The shrimp cocktail was excellent! The pappardelle I could've done without - the lamb and olive sauce was great, but the pasta itself a bit too thick for my taste.<br><br>Main courses were the New York strip for me and the 8 oz filet mignon for my boyfriend. Both VERY good - and I had leftovers that I can't wait to have for dinner tonight. The real winner in my opinion though was the roasted mushroom side with aioli - UNREAL. Probably the best side I've ever had at a steakhouse! The boyfriend also had yummy fries that were crispy and came with aioli as well. <br><br>For dessert we had the hazelnut raspberry tart and I picked a few items from their chocolate trolley - each item was only $3 and SO decadent and flavorful. I chose a few, among which was a whiskey/caramel chocolate truffle. Safe to say I felt like I was going to be full for a week after this meal. <br><br>Thank you, Humberto and Swift & Sons for an unforgettable birthday meal! I will definitely be back!", "pics": null}}, {"review": {"des": "Great restaurant which should satisfy all!  This place rocks!  Excellent service and menu items.  Great appetizers as well.  I will return to enjoy more of their menu items.  <br><br>Fulton Market District is booming and this establishment is the upscale steak & seafood dining option made for those who are seeking an excellent high end meal.", "pics": null}}, {"review": {"des": "Located in the west loop neighborhood, Swift & Sons may just seem like one of many popular restaurants. However, walking in, it's not like any restaurant I've seen. It's sort of set up like an old-school lounge, or almost like a library.<br><br>The menu is pretty traditional for a steakhouse -- soups and salads, entrees, and of course steaks. Our waiter was super knowledgeable and really friendly. He explained that instead of ordering one steak, we could order smaller pieces of different cuts so that we could all share and try out all of the options! We didn't opt for this, but it's good to know that the kitchen is so accommodating!<br><br>We started off with the Charcuterie Plate, which was not like any other charcuterie I've had. There were 4 types of liver, cooked in a whole bunch of ways, but no matter how they tried, it was still liver. Silly me for expecting pieces of sliced deli meat and cheese. Needless to say, this dish wasn't for us.<br><br>For my main entree, I ordered the 16oz New York Strip. It was perfectly cooked, and there wasn't too much fat or salt. Just great meat. My girlfriend got the filet mignon and it was also perfectly cooked. Usually, I can't tell the difference between different cuts of meat, but the two were different, in a good way! I'd say that is just a testament to the quality of the meat that is being served here! We got the mashed sweet potatoes and brussel sprouts as our sides, and both were excellent. The potatoes were so smooth and creamy without being heavy, and the brussel sprouts were really well cooked, albeit a little bit oily and salty. Two sides for the 4 of us was a good amount!<br><br>We ended the night with the earl grey creme brulee and the apple crumb cake. The kitchen also sent out a free pumpkin cheesecake for my girlfriend's birthday!! So sweet (pun intended) and all were fantastic!!<br><br>The $$$$ on Yelp is definitely accurate, but the prices are not out of line by any means for a classy steakhouse like this. The service and ambiance was great, and the food was even better! I would certainly recommend making a reservation for your next special occasion!", "pics": null}}, {"review": {"des": "Their appetizers were great. But the 5oz American Wagu steak I ordered was very disappointing. Cooked medium rare, the meat was hard to chew. I have had much better steak at other steakhouses at same price point.", "pics": null}}, {"review": {"des": "My husband and I had my birthday dinner here a few weeks ago. The ambiance is wonderful, the staff is very friendly and accommodating. The food is fantastic. The portions are a little small, but besides that I would come back. They have valet or street parking, if you do a little bit of searching.", "pics": null}}, {"review": {"des": "Heaven for heathens.  Come and meat your maker.  Steak is the showstopper here, we had three different cuts between four of us including the 48 oz beast and the kc strip plus the bone in filet.  All gorgeous but the beast was best.  Fluffy mashed potatoes had my cholesterol count praying for mercy, settled by the sautéed mushrooms.  And to top it off the sundae.  For two.  Believe it.  In a meat town, this meat masters.  Don't miss it.", "pics": null}}, {"review": {"des": "We had a wonderful evening. It was my boyfriend's birthday in July. From the moment we walked in they had noted that it was a special celebration. We had complementary champagne to start your evening. Great menu, amazing food and generous portions.", "pics": null}}, {"review": {"des": "Swift & Sons is one of the swankiest establishments I've ever been in.  I don't frequent $$$$ restaurant often, but when a few reps decide we need to have an epic steak dinner you don't say no.  <br><br>From the entry way to the back of the dining room - everything is impeccable.  Decor - was stunning, sans a few minor infractions* - curved banquettes, leather chairs, dark wood, warm lighting.  The main dining room has this mad-men meets the Jetsons vibe that I don't think you'd understand unless you visit, I just can't explain it!  It was really interesting though.<br><br>Table service was top notch.  $$$$ = four different waiters who are all hovering over your table all the time.  This certainly isn't a bad thing.  Want more bordelaise, they got you.<br><br>The food was very good.  My 8oz filet mignon was cooked exactly how I asked and was so flavorful.  I didn't need that bordelaise but the sauce was so darn good I couldn't stop.  The combo of the steak + sauce was amazing.  Also amazing - the mashed potatoes.  They melt-in-your-mouth and must be ordered.  <br><br>The table also enjoyed a roundup of desserts and all were yummy in their own right - Peaches & Cream Tart, S&S Sundae (pb& chocolate ice creams, brownie, hot fudge, whipped cream...) and the Deep Dish Cookie.  My favorite was the DDC for sure.  Warm cookie with melty vanilla ice cream?  SO. GOOD.<br><br>My main gripe, besides a few choice interior design decisions, with S&S is the the $$$$ for the amount of food you get.  Had I not been with reps who were treating me to dinner I would neverrrrrrr have been able to afford this spot.  I know I know, you're paying for service, blah blah blah.  But the service can be amazing - if I'm broke when I leave, and possibly still hungry, then was it worth it?  That deep dish cookie, for example, was tiny!  For $9 I think only 4 out of 8 people got to try it, and that's just sad. <br><br>*I'm an interior designer - I'm always looking at the decor.", "pics": null}}, {"review": {"des": "The food is amazing however the deserts are absolutely substandard. <br><br>The rum cake when we asked to order it tonight the waiter actually said... \"I'd recommend the Sundae\". We pressed forward and ordered the rum cake. Big mistake. Huge. <br><br>Then we ordered flourless cakes to go to surprised the family. It had to of been the smallest slice of a cake I have ever seen. <br><br>Maybe they made it extra skinny because we were taking it to go... by it is 1/4\" wide by 3\" Long. <br><br>Ugh. Come for dinner. Hope for the magician. DO NOT DO DESERT.", "pics": null}}, {"review": {"des": "Very solid steakhouse. They have not \"overdone\" it. We had the hamachi crudo, lobster bisque, beet salad, and shrimp cocktail for appetizers. For the entrees, we split the seabass and the porterhouse and had the Brussels sprouts, spinach, bok Choi, and mashed potatoes. Everyone in the group liked a different side more than the others. The steak was cooked perfectly, and the NYS portion was one of the best NYS I've had. <br><br>For dessert, we shared the chocolate tart, apple crumble, and deep dish cookie(s). The cookie was far and away the best of the three!<br><br>I highly recommend to those who are visiting the area.", "pics": null}}, {"review": {"des": "We had reservations and still had to wait over an hour.  Later reservations sat before us <br>Then they sat us right by the bar <br>Dont come here", "pics": null}}, {"review": {"des": "The place was very nice. It was packed even on a cold Wednesday night. It's a place where you can dress up to be fancy, but won't feel out of place if you didn't. Service was very good and friendly. I celebrated my friend's birthday here, and they gave us free bubbles for the occasion. We also ordered their champagne battle David and Golithe for $35. That consisted a glass of Dom Perignon and a glass of another champagne that I forgot the name of. <br><br>Food wise, it was pretty good. I've never been much of an onion soup kind of girl as the one's I've had were either way too salty or just cheese overkill. However, S&S changed my mind about onion soup. Theirs is just perfect. Their oysters from both east coast and west were both super sweet and fresh. I've got to go back there during happy hour for more of them oysters. We also ordered their crab cake, and that was just meh. We also ordered the beef Wellington that everyone has been raving about, and it was very tender and rich. We had brussel sprouts for our side, and that was just okay. We tried the chocolate trolley for dessert, and picked a passion fruit macaron and a chocolate espresso tart. The tart was nothing special, but the passion fruit macaroni was very good. Overall, we had a very nice meal and a good time.", "pics": null}}, {"review": {"des": "I enjoyed my time here. The atmosphere is amazing. It feels like an old school office with super awesome desk decor and lighting. The steaks and sides were just ok.  The mashed potatoes were a little too runny for my liking but that is a personal preference. The Brussels sprouts were very good and tangy. The steak was just ok for me. My test is if the steak is good without sauces and I preferred this steak with sauce. Which should not be the case. I will for sure go back for drinks but maybe not for a steak.", "pics": null}}, {"review": {"des": "Must order the 20 oz ribeye! The wedge salad to start was a good choice. Brought in our own wines for $35 corkage-<br>Would come back for the steak alone.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/x-IIR9dQ2RznVHJnNdtDIw/348s.jpg", "caption": "Deep Dish Cookie"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/x8R0_rpM8TFQIgsqBhWs6w/168s.jpg", "caption": "S&s Onion Soup"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pzn0Pkd0QbDfu9gAio5xDQ/168s.jpg", "caption": "Wedge Salad"}]}}, {"review": {"des": "I've been to S&S about four or five times now, and I just don't feel the food is commensurate with the prices. <br><br>I tend to judge steakhouses (fairly or not) by everything that isn't steak on the menu, especially the sides. I trust that if you are a steakhouse of this caliber, your proteins are going to be well-prepared and high quality. But, both of the times I've have steaks at S&S there have been issues, once over done, the other the meat was tough(!). On my most recent trip, I had a burger, and it was fine, but not something I'd want to return there to eat again. <br><br>Service and decor are both tops. <br><br>TL;DR If someone else is paying, great, but I don't think I will be back on my own dime.", "pics": null}}, {"review": {"des": "BIG fan! ‍ I ordered The Godfather Part II to start, which came along with the drink cart experience with every element of the drink broken down and explained. We shared the potato pierogis to start and had lobster bisque to myself. Both were delicious. I ordered the 8oz filet with bordelaise and mashed potatoes and Brussel sprouts to share. The steak was cooked perfectly and bordelaise was a great match. Sides did not disappoint either. <br><br>A+ atmosphere and a very dedicated staff. Overall, 5 star experience!", "pics": null}}, {"review": {"des": "Enjoyed an evening here on Sunday night with my boyfriend. He was on a business trip and I was visiting him, as it was both our first times in Chicago. We made a reservation and arrived a little early. They were very accommodating and seated us. The restaurant is beautiful, and quite big, so you can definitely have larger groups if you want. The round booth seating for groups of 2-3 is very intimate, and we were seated there. <br><br>Brittany was our server, and she was wonderful, as were the other members of the waitstaff. Very polite, detail oriented, and attentive. As soon as I took a few sips of water it was refilled. The table was wiped down between each course. It was fantastic service. Despite the fact that Brittany was juggling multiple tables, she did not seem rushed, pressured, or stressed, and we felt as if we were her only table that night.<br><br>The main reason we went to Swift and Sons was to try the Japanese A5 Waygu. My boyfriend and I are both huge foodies, and it has been something we've wanted to try. We bit the bullet and decided to splurge and enjoy ourselves.<br><br>We ordered the pea agnoloti, arugula salad, summer vegetable vol-au-vent, Japanese A5 waygu steak, oxtail marmalade, grilled bok choy, and roasted mushrooms. <br><br>The pea agnoloti and arugula salads were perfect summer starters- very fresh, light, and tasty. I've never had anything like the pea agnoloti so I felt like it was a very unique dish, but the arugula salad is definitely something you can make at home. <br><br>The summer vegetable vol-au-vent was better than I imagined. The pastry was light, buttery, but not greasy. The sauce was very light but flavorful. Loved this contrast to the steak. <br><br>Now for the waygu- I'm sure that any place that can afford to have A5 waygu on their menu will cook it well. This beaut was so perfect. We did not even use sauce to enjoy it. The waygu melts in your mouth. If you're a steak eater and really appreciate quality meat, I highly recommend trying it. <br><br>The oxtail marmalade was very rich, and it was nice to eat with some of the vegetables from the vol-au-vent. Next time, I would probably skip the sauce because as I said- steak needed none of it. <br><br>The sides we got were both flavorful and delicious. Obviously the star of the meal was the waygu, but we were impressed by the grilled bok choy. As a Korean American who grew up eating a lot of authentic Japanese, Korean, and Chinese food, I was hesitant about the grilled bok choy as it is cooked with raspberries. The flavors really worked and I thoroughly enjoyed it.<br><br>Personally, I think you could skip dessert at this place. We got the rum cake and the chocolate trolley. Although it was nice ending the meal with some sweetness, I would go to Jeni's or Bombobar next time.", "pics": null}}, {"review": {"des": "Made reservations for my friends<br>Bday dinner and I am so very glad I did. Food was amazing and the service was excellent. They really made you feel as though you were a part of their big, happy family at the restaurant and that made it so much fun! Steaks are next level amazingness!!!", "pics": null}}, {"review": {"des": "Really great ambiance and impeccable service- I'm a huge fan of Cold Storage and anything the Boka group does- there are so many steak houses in Chicago but Swift and Sons doesn't disappoint- <br><br>They offer the cold platter (can be ordered by the person) and offers a variety of shellfish with three sauces (one for the oysters, one for the crabs and one for anything you want- their cocktail sauce) <br><br>I'm a huge fan of onion soup and was excited to see their version on the menu- my favorite being from a small restaurant in Paris (nothing will meet that standard) but I really enjoyed their version- it wasn't overly salty and the cheese melted well- <br><br>Their tomato and burrata appetizer was done simply but well- when you have great ingredients you don't need to mask it with anything- the tomatoes were very sweet and were paired really well with their soft burrata- very airy that it tasted like whipped cheese <br><br>I wasn't a huge fan of their celery root pasta appetizer- the flavors didn't do anything for me but my sister and bf enjoyed it- so just a personal preference- I thought it was bland and almost tasted pasty (crayons) <br><br>We got their 48oz rib eye special of the night to share- so much meat- done medium rare- the meat just melts in your mouth- and for $135- it was a great deal! Also enjoyed their steak sauce (more like balsamic) <br><br>I always get Brussel sprouts as a side- with a little lemon twist to the sprouts it was a really great combination of charred and lemon- <br><br>Mushrooms- a mix of wild mushrooms- good flavors <br><br>For their dessert- I got a single scoop of their roasted banana sorbet (hit the flavor jackpot) and a single scoop of coconut lime sorbet- light and airy- perfect end<br><br>We also got their cheesecake- I'm so used to the artificial cheesecake flavor that this cheesecake was a great surprise- this is what real cheesecake should taste like- not overly sweet and you can taste the layers of the graham cracker crust, the cheese and the fresh strawberries on top- <br><br>Overall- I enjoyed the large but cozy atmosphere-I'll have to come back and try their specialty (Wellington dish)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GzS7lbOhV1Rbb_MqphZpPw/348s.jpg", "caption": "Cheesecake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZkZHgaVFQHjAfIEreTqZkQ/168s.jpg", "caption": "Fries"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jpBg1XQa1o7yyvAImr5KRg/168s.jpg", "caption": "48 oz rib eye"}]}}, {"review": {"des": "Oh my... this was an unexpected delight. The shrimp cocktail is ahhhhmazing! Service is great, atmosphere is hip!", "pics": null}}, {"review": {"des": "Yum!<br>My husband and I came here on a date night. Our waitress was very well trained. She was able to answer questions we had about the wine and of course our steak. The steak was so good! I ordered a ribeye, it was very juicy and flavorful. My husband thought that his steak was a little charred, but I loved mine!<br>The restaurant has a great atmosphere. I have already recommended Swift and Sons to other friends looking for a good steak! <br>I will be back!", "pics": null}}, {"review": {"des": "Wow. Just wow. Enjoyed a sampling of appetizers while at dinner with a large group. The green and white asparagus, oysters, shrimp, and pierogi were delicious, and the sampling's were just enough to whet our appetite. But the steaks!!  Debbie had the surf and turf, and they substituted filet for the cap steak upon request.  The filet was flavorful and tender enough to cut with a fork.  The lobster was nice, but maybe a little too much sauce. I had the bone-in filet and it was superb!  Easily the best I've had. Tender, flavorful, and perfectly prepared. On a side note (!), the sweet potatoes are to die for!  Not too sweet, but delicious enough to be a desert. Service was very attentive and engaging. A very enjoyable evening!", "pics": null}}, {"review": {"des": "This is one of my favorite restaurants in the city, not just for the food but for the service and ambiance! <br><br>We were there last night for a very special occasion and the group i was with let the restaurant know about why we were there (My 10 year cancer survivor day) and Swift & Sons made it that much more special! Everything from the staff coming up to me wishing me their best to the deserts that came out with special messages to me regarding my special day... I could t have asked for a better evening while spending it with my people! I just want to thank the restaurant for caring about us soo much and about our experience! Means a lot to me! Additionally two of the problem with us were vegetarian/vegans and the chef prepares something special for them both (which wasn't on the menu). Again, this is above and beyond and made the experience that much better for my friends as well! <br><br>Thank you soo much, we will have S&S in our hearts forever and it is in our \"Go to\" spots from here on out!", "pics": null}}, {"review": {"des": "So good. Great service, on point. Relaxed atmosphere.  Adorable dessert cart. Rock shrimp has a little kick and crunch. They split the French onion soup for my husband and I 2 little coffee cups. Split the bone in ribeye too. Good fries. Couldn't taste the egg on the deviled baked potato, but still delicious. Bathrooms have lotion and stuff if needed too. Cool vibe. Bar stools have backs which is comfortable. Perfect date night without the kiddos. :)", "pics": null}}, {"review": {"des": "After passing a number of places for a number of reasons, the night brought us here. I couldn't think of a better place to end up for really good drinks, great bartenders, and a bar to catch up with friends. I had a spicy drink that was spot on. Trying other's drinks, all were super. The bartender was witty and fun and knew his $h!t. Overall it was a really nice experience.", "pics": null}}, {"review": {"des": "Have you ever perused a menu for days leading up to your visit and as the day of your visit draws closer and closer, you just get more and more excited? That's how it was for me with Swift and Sons.<br><br>Fun fact. S&S is just one of several restaurants owned/managed by the Boka Restaurant Group. When I first visited Perennial Virant last year, I was so impressed by their decor and cuisine, that I made a point to visit all of the restaurants under BRG. So far I have loved all but one I've visited (PV, each of the Goats, and Momotaro loved, GT Fish and Oyster, disliked). S&S obviously I loved.<br><br>Location: S&S is located in the Fulton Market Disctrict; home to countless iconic restaurants in Chicago's culinary scene. Upon arrival, diners are greeted by an extremely flamboyant yellow moniker and an overwhelming feeling of badassery.<br><br>Decor: has anyone seen Tom Ford's \"A Single Man\"? This steakhouse gives me that type of vibe. The design aesthetic could be classified as mid-century, and while that may be true, I feel as if the decor is a little bit more grandiose. Dimly lit, huge/plush leather seating, high quality dinnerware and serveware. It reeks of class.<br><br>Service: Perfect. From the moment we stepped into the door, to the point we left. The hostesses were very warm and inviting. The biggest star of the night was Brittany. She was my waiter and a darned good one. Very thorough in explaining all of the dishes and offering recommendations. She made sure our glasses stayed filled, and she even went so far as to gift me a Caesar salad to my surprise. <br><br>Food: My stomach just made the most disrespectful sound when I started thinking of the food here.<br><br>Bread for the table: A couple of variations - I was a fan of all. <br><br>Caesar Salad : Y'all. So fresh. So crisp. The perfect amount of dressing. Housemade croutons. And an abundance of fresh parmesan. One of the best salads I've ever had, and it was so simplistic in its nature.<br><br>Crispy Brussels Sprouts: Although I felt mine were a little too fried (soggy) the flavor was extraordinary. Love the lime and soy sauce component of the dish. Very well rounded.<br><br>Mashed Potatoes: I've certainly had better being that I'm from the south. The bowl was emptied because I love potatoes, but there wasn't anything mind blowing about them.<br><br>20oz Bone-In Ribeye: Heavenly. Divine. A+mazing. As a self-proclaimed steak snob, I declare that S&S has one of the better steaks I've had. So flavorful that I didn't even need to complimentary sauces. The biggest indication that these cooks know what they are doing, is when I cut the steak and little to no juice escaped. This ensured every bite was just as flavorful as the last.<br><br>Bone Marrow: Hearty. Garlicky. An added touch of flavor to accompany the steak.<br><br>Chocolates: In all honesty, I was rather let down by the chocolate selections the night we visited. The malted chocolate mousse was the better of the two, very light and sweet. The chocolate tartlet was very bitter (too dark) and the raspberry didn't offset that at all. <br><br>4.5 stars across the board thanks to the service, steak, marrow, and salad. Half star lost because neither of my side dishes or desserts wowed me.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iJgbUiAVJBAmmIyME7hWOw/348s.jpg", "caption": "Dry martini straight up with a twist"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hlvj1iQR48lpQIH0rVgirg/168s.jpg", "caption": "20oz Bone-in ribeye and bone marrow"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/evepM3HVD-GdmK-sIL2xYg/168s.jpg", "caption": "Crispy Brussels sprouts"}]}}, {"review": {"des": "When you go to a place like this, you expect the best, and Swift & Sons did not disappoint. Our server was on top of everything, and i actually thought he was the manager for the first few minutes, until i realized that the servers were really just that attentive. <br><br>The decor was stylish and classy, the service was excellent, the meal was prepared and presented perfectly. Which, if it wasn't top notch, you would definitely dock some stars. It's not that hard to cook a steak properly, you go to a place like this for the ambiance, service, food quality, etc and they delivered on all fronts.", "pics": null}}, {"review": {"des": "Food is OK. There are much better steak places in the city.  My main issue is the service.  It is like being in a Turkish carpet store where they try and push you to buy more.", "pics": null}}, {"review": {"des": "The last time we had true Japanese Wagyu, we were in Hiroshima. And I am happy to report the steak we had here was \"the best Japanese Wagyu in America\" and easily the *second* best steak we have ever had- only because nothing can beat \"that one steak from Japan.\" We also had the steak tartare, the New York strip, and a couple of drinks. The waitstaff was very attentive and everything else was fantastic- but nothing compares to that A5 Japanese Wagyu. It's worth every penny. We will be back when we want to reminisce about our visit to Hiroshima.", "pics": null}}, {"review": {"des": "I made reservations at Swift & Sons to celebrate some big news. The customer service that this restaurant provides is top notch. They are knowledgeable about their food and drinks, they are attentive, the atmosphere is on point, AND the food is excellent. I highly recommend the beef wellington!<br><br>This is one of those places you just keep coming back to!<br><br>Thank you Swift & Sons for helping us celebrate the right way!", "pics": null}}, {"review": {"des": "It's a more modern, hip vibe of a steakhouse. What you would expect in this new fancy hot neighborhood. We came here for my birthday, just two of us. Grabbed some drinks at the bar as we waited for our table.<br><br>Overall service was really good and I liked the ambience. We got a great booth seat.<br><br>I'm a big lover of steak (it's borderline unhealthy) and how a steakhouse cooks its steaks to order plays the ultimate card for how I rate them.<br><br>Swift over cooked my husband's steak completely and at these prices, it's not okay. A steakhouse should cook their $$$$ meat perfectly, as requested. And if they don't, they should check and remedy the situation; guests don't like having to point this out. A medium rare order should not arrive medium well.<br><br>So as special as this night was with great service and good ambience, this steakhouse needs to work on getting the basics sorted out first.", "pics": null}}, {"review": {"des": "An outstanding - but expensive - experience.  If you have cocktails and wine, you should be prepared to spend $100 per person. <br><br>I have only minor criticisms and if Yelp had .5 points available my review would be 4.5.  <br><br>They offer traditional and well made cocktails.  The only odd thing was they offered a long list of gins - but not Beefeater.  <br><br>For starters, we enjoyed the tomato and burrata and the wedge salads.  The tomatoes were perfectly ripe and sweet but the burrata could have been just a bit creamier.  We did wonder if that burrata was a bit old.  The wedge was excellent with a dressing that was lighter and more oil and acid based, rather than creamy.  Crab cakes were excellent - lots of crab in good sized chunks and very little breading - but they were barely and slightly over salted.  <br><br>The bone-in filet was excellent and our favorite entree.  With filet you often have to concede flavor in exchange for tenderness.  Not here.  The aging and the presence of that bone impart great beefy flavor.  One of us added a perfectly seared and generous sized fois gras as an accompaniment and this also added decadence to that filet.  <br><br>The New York strip was also excellent.  The rib eye cap and lobster thermidor combination was a treat.  Very few places offer this cut of steak - which is that tasty darker portion on the outside of the prime rib.  <br><br>The cheeseburger is terrific too - nice loose packed patty with a great char which resulted in a juicy and beefy experience.  <br><br>They also give more than just a nod to seafood for those who are not fond of steak.  The lobster served with the rib cap, a hamachi crudo appetizer, and scallops were all perfectly fresh and well prepared.  <br><br>The side dishes and sauces were excellent.  Bernaise sauce, bordelaise, and house steak sauces were all perfectly balanced and executed.  Outstanding creamed spinach and grilled asparagus.  If I had to criticise, the french fries were only just a tad limp and dark - indicating that their oil could be just a bit hotter and cleaner.  <br><br>Service was perfect.  The waiter even changed out a cocktail for free when one of our party indicated a preference for someone else's cocktail order.<br><br>A great place for a special night out.", "pics": null}}, {"review": {"des": "my date took me here last friday for my birthday dinner and i absolutely loved it! we were seated right away. our server was very nice and attentive he even recommended some items off the menu to us,everything was top notched. i got the snake river wagyu and my date had the surf and turf we also ordered the roasted mushrooms it was delicious! the truffle sauce on the mushrooms was to die for. <br><br>highly recommend this place to anybody thats looking for great service.", "pics": null}}, {"review": {"des": "very good experience<br><br>great service<br><br>excellent side dishes<br><br>steak was dead on <br><br>will go back", "pics": null}}, {"review": {"des": "Old school charm, great service and good food! The place has a unique vibe, it's sort of like a library and dining hall meets steakhouse. All The staff has classic steakhouse attire. One of the coolest things to do is get a drink from the old fashioned cart. You get an amazing explanation as the perfectly clear ice cube is made tableside. You feel welcomed the entire time as the staff is very nice and attentive. The crispy shrimp appetizer melts in your mouth along with the skillet cookie! I got the beef wellington for two with foie gras. It's not as amazing as people make it out to be but nonetheless a top tier dish with great presentation! Absolutely a solid spot to splurge at!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oHlI53zXu_ONxCLufj5s_A/348s.jpg", "caption": "Old Fashioned Cart: Crystal clear use ball made from freshly carved ice using a Mccallan device"}]}}, {"review": {"des": "I came here recently to celebrate my husband's birthday. Overall we had a great experience- the service, ambiance and food were all top notch. The space is huge with plenty of bars and more dining areas than I expected. We started at the bar for a drink and appetizer and then had a really nice meal. It's super expensive so I'll likely try out another spot for my next special occasion since there are so many amazing restaurants in Chicago!<br><br>What we ordered:<br><br>Table side Cocktails: My husband ordered one of these- it was a version of a Manhattan I think. He said it was amazing and worth every penny since it was for a birthday celebration. The entire preparation was fun and informative to watch for me too<br><br>Half Dozen Oysters: These were ok, nothing special. I liked that they were served with vinegar chips and a bunch of different hot sauces<br><br>Crispy Rock Shrimp: satisfying, had a nice crunch and spicy kick<br><br>Caesar Salad: classic, simple- nothing special<br><br>8 oz filet w/ Blue Cheese crust: good, cooked perfectly but really nothing too special<br><br>8oz filet w/Oxtail Marmalade: The marmalade was super yummy- I think I could've eaten spoonfuls of that alone!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7GaqcQ9KPNw_MZ3aLaeWYw/348s.jpg", "caption": "Birthday Truffles"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EYFUL_0fUXUZvLe6OkQi7Q/168s.jpg", "caption": "Half dozen oysters"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eYYfUiyzml0shMGZKmnHOw/168s.jpg", "caption": "Crispy Rock Shrimp"}]}}, {"review": {"des": "Came to S&S yesterday to celebrate my boyfriend's b-day. We made a reservation for 9:15 pm and came in just in time. We were checked in and asked to go grab a cocktail at the bar while our table was being prepared. Well.. we waited for 35 minutes until I went to the reception and asked for our table. 10 minutes more and we finally got one.<br>Other than that, we really loved the place. I don't remember the name of our server but he was very friendly, didn't put too much pressure on us and recommended amazing cocktails.<br>We ordered some foie gras to start with, then I had a Lamb Grill and my bf had a Ribeye steak with a side of mushrooms. His meal was amazing, while my lamb was a bit burnt but still good. Then we got a dessert (creme brulee) and a little surprise treat for him  (thanks for that!)<br><br>Though a bit pricy (which is fair for such a restaurant) I would definitely recommend to visit this place!", "pics": null}}, {"review": {"des": "Our party of four elected to have dinner at Swift and Sons.  We arrived early and had a drink in the bar.  The drinks were well made but service was very slow.<br><br>We were seated at a comfortable table with plenty of room.  It took a few minutes for the waiter to arrive and take drink orders.  When we decided to order appetizers and entrees, the waiter could not be found.  We finally had to ask another waiter for assistance.  Our waiter finally appeared and offered a weak excuse about being tied up with an order.<br><br>The food was well prepared.  I had the Mediterranean Lamb and it was outstanding.  The pierogi appetizers were outstanding.  The salad was average and seemed to lack flavor.<br><br>We took a cab to the restaurant do I do not know about parking.  <br><br>All in all, I give this place 3 stars.  Good food but slow service.  One thumb up and one thumb sideways for service.", "pics": null}}, {"review": {"des": "$18 for a mini martini?  Overpriced. Spend your money elsewhere:  steaks are good but no better than many other places. In a trendy area and taking advantage of it.  Waiter was busy elsewhere. Never felt any attention", "pics": null}}, {"review": {"des": "It took alot of thinking before I left this review.<br><br>I made a Dec. 29th reservation to Swift & Sons after choosing it over a few other iconic Chicago steakhouses. I wanted to give my father a memorable experience for his 71st birthday. I had been here once previously, had the most amazing dinner and was hoping to duplicate the experience.<br><br>I wish had chosen one of the other steakhouses.<br><br>Firstly, let me say the service does deserve 4.5 stars. We felt very taken care of. Great recommendations on wine and food. Even the special details of acknowledging my father's birthday did not go missed.<br><br>My biggest concern was one of our steaks. When you are selecting a Chicago steakhouse with 50-100 dollar steaks... and the steak is cooked wrong it's a big concern. Not only does it affect the individual dinner, but the whole table as they try to share their food, try to eat slow as to not make the person with the miscooked steak feel rushed when 12-20 minutes later their meal arrives. <br><br>I understand it's a trendy busy restaurant. My family has been in the restaurant business for 45+ years. After slipping my card to the waiter, to avoid any family bill squabbling, I discover we were charged for the wrongfully cooked steak. 4 steaks bought, 3 steaks eaten. Not even a $66 ribeye bone I could give to my dog.<br><br>I signed the check, I wanted to bring this up immediately, but my father's smile while blowing out a candle on his lackluster chocolate tart broke my heart. I couldn't make a this an ordeal on his birthday.<br><br>I can't foresee me going to Swift & Sons again, I do feel taken advantaged of by the situation. Something I have never felt at Chicago Cut or Gibson's. I wish the server would have pulled me aside to explain the check, only blemish in service in my humble opinion.<br><br>It's sad to say to restaurant that wants to hold themselves to a gold standard in Chicago, but watch your cook times on your steaks.", "pics": null}}, {"review": {"des": "Since my first review, I've dined here more than a dozen times. The reason I haven't revised it until now is that there aren't enough superlatives to explain my cumulative experience at Swift & Sons.<br><br>As impressive as Chicago's restaurant scene is, few restaurants come close to the excellence and consistency of Swift & Sons. I have had the \"best\" meal of my life here many times over and have watched friends and family walk out of the place with the swagger of someone who is in on a big, juicy, slightly-charred secret. Make no mistake, the restaurant is larger-than-life. The only real secret is that even when you order the cheap bottle of wine, you're still important.<br><br>My friend from high school had his birthday coming up a few days after he was scheduled to leave Chicago. Our waitress silently noted this along with his not residing in the city when she checked his ID. At the end of our dinner, he was served a birthday dessert. He studied hospitality in school he still talks about how he has never seen anything like that.<br><br>Sometimes it's the simple gestures, and other times we revel in the complex. I believe that Swift & Sons blends both brilliantly with a style--and warmth--that cannot be found elsewhere in Chicago. Perhaps anywhere.", "pics": null}}, {"review": {"des": "This is the email I sent to them after our dinner. I got no response within 18 hours, so I'm posting it here. <br><br>In brief: out of fries (or not?), mediocre service, disgusting nose piercings, excellent meat<br><br>Verdict: if you want to pay $100 and up and get punished for it, please book a table immediately. <br><br>Dear manager,<br><br>\"We are out of french fries\" said the waiter. A steak restaurant without french fries cannot claim to be a steak restaurant worth mentioning. The only way to top this off is when the neighboring table gets served an extra large portion of french fries 20 minutes later. We had ordered at the same time.<br><br>Today's dining experience wasn't that great.<br><br>It also wasn't helped by the person who seated us. Her commitment to customer disservice was remarkable. Once we got to our assigned table, I asked whether we could have the empty round table nearby instead of the elongated one. With 5 people, one always ends up sitting on the end by herself. We were told that there was a party of 6 coming in and it would be reset and we couldn't have it. Fine, accepted. In order to receive the message however, she made us get up from the initial table, walk back through the restaurant and stay by the bar in the back and wait for her to return with the decision whether we could have the round table or not. I asked her whether we could just remain at our elongated table while she went to check. She said it was the rule to return to the bar. The entire restaurant turned and stared at us. They were as perplexed as we were and it made us look real silly. I guess it disturbed everyone. The round table remained empty for the entire evening as did other round tables. It was never reset to suit a party of 6.<br><br>The steak was fabulous. But you're not worth another visit if everything else is so disjointed and becomes an altogether punishing experience.<br><br>Thanks,", "pics": null}}, {"review": {"des": "West Loop lover right here and blown away at how this place can get away with the pricing of menu items. Ribeye is $95 and a beef Wellington is $105??? How the heck is this justified? My boyfriend and I ordered lighter (pork chop, scallops, and French onion soup... but several drinks) and we felt the server was disappointment we didn't order more food to make our bill higher in price. The moment we said \"pork chop\" the waiter didn't come back to our table but had his busser serve us and re-heat the pork (beware it comes out rare...just wrong). The French onion soup was delicious but I felt HORRIBLE the next 24 hours. It's extremely salty. I loved the vibe but was confused by the music selection. I just feel like it's weird to listen to pop 80s at a nicer, 4\"$\" symbol Restaurant. If you want a good meal that is consistent w this menu. Go to Gibson's.", "pics": null}}, {"review": {"des": "My friends and I aren't huge red meat eaters so we didn't order any steaks, but Swift & Sons has a lot of other great options. Our experience here last night was great! Our waiter was so friendly. He gave us 2 complimentary side caesar salads, and gave us free truffles because we were celebrating my friend's engagement. <br><br>We started with the crispy rock shrimp, chopped steak tartare, and the roasted oysters. The crispy rock shrimp is honestly my favorite dish there. It's lightly breaded and smothered in a delicious chili sauce. This is a must try. We also ordered the lobster bisque and tomato & burrata salad. Both were incredibly tasteful. The tomatoes were so fresh and came from a local farm. I really think the best way to go is to order several appetizers/starters to share as a table. <br><br>For our main dishes we ordered the mushroom \"Wellington\" and grilled cornish game hen with a side of crispy brussels sprouts. I was a bit disappointed because my game hen was super dry. My friend's was perfectly cooked though. It was hit or miss. The mushroom wellington will definitely be my go to the next time I'm here.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sByZffIueziw7Zv8THAPhA/168s.jpg", "caption": "the amazing crispy rock shrimp."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/R3OEajKS6p6nOpKK1J1KwA/168s.jpg", "caption": "roasted oysters."}]}}, {"review": {"des": "The best steaks  in Chicago. The Ribeye here is just incredibly flavored, a perfect balance of marbling and flavor that is unrivaled. My wife gets the burger and is always surprised that she doesn't need to add anything on it. It comes with caramelized onions and just melts in your mouth. <br><br>Sides could use some improvement as I find they try to put creative spins on traditional staples that just seen a bit overpowering at times. <br><br>My wife and I really enjoy the entire experience here. Bartenders listen to likes / dislikes and are quick to make sure you've got a drink you love. They offer a magician experience which is also really interesting, unique and entertaining. <br><br>Overall just a great place for a date night and currently are #1 fav restaurant in Chicago.", "pics": null}}, {"review": {"des": "I really love this steakhouse after having been here 3 times.  The food is excellent all around. This review, however, is based on the service this past time. <br><br>We went to celebrate a good friend's promotion a week or two ago on a Saturday night with a reservation for 8:15.  We arrived a little early and were told us they were running about 15 mins behind.  We appreciated the heads up and proceeded to just grab a drink at the bar.  At about 8:35 (20 mins past reservation), we're all there waiting and decide to go ask the hostess what our status is.  She apologizes profusely and says that they are waiting for the table to finish up and that checks are going around and it should be ready soon.  She also says, they will comp us some appetizers for the delay.  <br><br>We totally get it and continue waiting.  8:50 rolls around.  We ask again what the status is.  Hostess informs us that they are cleaning off the table now and that we will be seated imminently.  9:05 rolls around.  We are utterly pissed and have been told nothing....(the apology from 8:35 is now totally inadequate).  We are getting ready to just leave since we are starving.  As we leave bar to exit restaurant, a hostess finds us to seat us and we decide to just go ahead and eat there.  <br><br>The waitress comes by and says \"thanks for your patience.\"  I'm sorry but after 50 mins, at this kind of restaurant, there needs to be an \"I'm extremely sorry that your seating took so long, it's been a crazy night and I know they said you'd be comp'd some appetizers, so here's what we're going to do to make things right and ensure you have a great experience with us\".  Not thanks for your patience.<br><br>The food itself was, again, delicious.  We were happy we were able to have a nice dinner.  But the service (pre-seating and upon seating) was ATROCIOUS.  I'm not saying I'm not going back there again, the food is quite good!  However, if we have another experience like this last one, good food or not, I would not go back.", "pics": null}}, {"review": {"des": "I absolutely love this place! The service is second to none and it's situated in a really architectually cool building that has been nicely renovated for this restaurant. The steaks are magnificent and cooked to perfection. I cannot urge anyone more to spring for the table-side magic show -- it did not disappoint!", "pics": null}}, {"review": {"des": "If you and looking for food and service that is both overrated and overpriced.m, look no further: also a fantastic place to encounter rampant and blatant sexism from all staff, defended at senior management level. Be prepared to overspend whilst being objectified", "pics": null}}, {"review": {"des": "Made a last-minute reservation here for Wednesday night, after friends suggested it for good oysters (it'd been on my list for a splurge-worthy occasion). We arrived, were immediately taken to our table and greeted by our waiter, whose name I've sadly forgotten, and he was fantastic. After he and my dad traded stories about living in Texas, he broke down the drink and apps menu for us, including recommendations. The drinks were good, but the main star of this show were the oysters. We did 1/2 a dozen and I could've eaten a dozen by myself. They were the freshest I've ever had. The goat cheese cappelletti was also tasty, but I'd probably forego it next time to save room for the entree. <br><br>We each ordered steaks--me, the 8 oz filet, my dad, the 18 oz dry-aged Kansas City strip. Both were fantastic. We chose the asparagus and the au gratin potatoes as our sides. When, not if, I return, I'll forego the potatoes, though they were tasty, for the fingerlings or the mushrooms, as both sounded delicious. <br><br>For dessert, we split the deep dish cookie with vanilla bean ice cream. Unlike other places, it was perfectly portioned, and I wanted to lick the dish. <br><br>Highly recommend this for a night out, special occasion, or just because you wanna treat yourself to quality food and excellent service.", "pics": null}}, {"review": {"des": "To start off the food was great! But, the service was over kill (honestly just put a damper on the entire dinner). <br><br>I honestly think the food was phenomenal. I ordered the Crispy skin striped bass with a side of fingerling potatoes. OMG DELICIOUS!!! I typically would NOT have ordered a fish and for sure would have gone for a steak but 2 days after Thanksgiving meat was just not happening. I also had the Gin and Jam cocktail- delicious. <br><br>Now that I talked about how yummers the food was, I just really need to rant about the service. I understand that this is a nice restaurant, but have you ever heard of service over-kill. And Im not being dramatic OVER KILL!!!! I was my 2 friends and we were attempting to chat it up. And literally ever 2-3 minutes the bus boy was coming over. I cant even count how many times one of us had to pause and then restart the story. The waiter was over to take our order and that was it, but the bus boy (great fellow) holy moses. We would take a sip of our water and then he would appear out of nowhere to refill it. I appreciate your concern for my hydration but CALM DOWN!!! We literally could not make it past one sip before our water was refilled. Then he would come by and try to get all the plates out of the (poor empty plates that were just sitting there) he had to ask us to pass them and hand him this and hand him that. And I was just on the verge of screaming we're fine the empty plate in the corner Is not bother us. He then came over and tried to take our drinks with stuff still in the glass. <br><br>I can understand if the restaurant was busy and they were trying to rush us out but the restaurant was dead. I would have liked to stay for an additional drink but by that point I was done, DONE, I was ready to leave and continue my night elsewhere... <br><br>Like I said the food and drinks were great, but my friends and I could seriously not have a normal conversation because someone was at our table the whole night.", "pics": null}}, {"review": {"des": "Came here on a Sunday at 5PM. It was not super busy but able to accept walk-ins. To start we had the crab cake and the oysters which were delicious. I had the filet mignonette and it was cooked perfectly and very lean. The BF also had NY strip 16oz which was delicious! A little fattier than my filet but very juicy! For our sides we ordered the loaded potatoes and the creamed spinach. Both amazing options! Our waiter was really nice and helpful at  explaining the entire menu. There are cart options for drinks and even a dessert cart. We had a chocolate ganache dessert cake and a carrot cake. I think I would order the chocolate dessert again and again! Intimate environment- great for dates and corporate events!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kWWOMyYEs9heCdH2VoKJ3w/348s.jpg", "caption": "Menu and environment"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kOHWQtL3j6twXH7sMuPVSg/168s.jpg", "caption": "Chocolate dessert from the cart!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0UtGXvR0mLfD09ArrPE9lg/168s.jpg", "caption": "Inside the restaurant"}]}}, {"review": {"des": "If you are looking for the traditional old fashioned steak house, that has a modern crisp and clean feel, this is your stop.   Great food and drink.  And nothing disappoints.  Our server, Adam, was fantastic - thanks for the experience. We will be back. <br><br>We started with a cocktail when we sat. My business colleague wasn't sure which wine to try, so without asking, they brought a couple of tastes out for him to try. <br><br>We started with their Oysters that had meat tartare on the top.  Very different, but good flavor. It builds and is very good. I loved that they mixed both east and west coast oysters.<br><br>For dinner, we had the bone-in ribeye. Holy cow was it awesome. Melted in my mouth, great flavor, cooked to a perfect medium-rare.  We also had the Brussel Sprouts and the King Crab Soufflé. Both were perfect size to share and were soooo good. <br><br>We wrapped up with their Chocolate Trolley. OMG - if you like chocolate, you have to try their banana and bourbon truffles. All of it was wonderful. <br><br>I will be back. This was a higher end experience that didn't disappoint.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zrzjxkToiZ8KSqj4CUkg5Q/168s.jpg", "caption": "White Truffle Risotto. Perfect."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9vnyvOCz6HkVf6SBlMNyJw/168s.jpg", "caption": "A 7.10.93, similar to an Old Fashion served in a smiley glass, ice cube formed from a block, all table side.  Guess who's a happy guy!"}]}}, {"review": {"des": "Chicago is known for its meat and this is definitely one steakhouse you should never miss. Steaks are always well seasoned and mouthwatering. Bone in ribeye is one that will never disappoint. Lots of other tasty dishes and their cocktails range from creative to exotic. Located in Chicago's up and coming West Loop neighborhood this house is always full so resos are recommended.", "pics": null}}, {"review": {"des": "I've known about this restaurant group for a long time and have been to almost all of the restaurants in their portfolio... except this one.  Nestled in the bottom of The Google Building, don't judge it from the outside!  Something about all of Boka's places just sets them a couple steps above.. I mean they do it RIGHT.  Walking inside you have a hostess stand and Cold Storage is to the left and Swift is to the right, there is a bar upstairs and downstairs/ DARK INSIDE!!  The inside is gorgeous, think dark woods and dark brown leather swiveling bar stools as well as industrial lighting & exposed concrete.  It's actually a lot bigger than I expected inside, great place for any occasion!  Impeccable wine list with a huge price range and some of the best Bordeaux I've ever had just by the glass.  No, I'm not putting prices/ don't even look!  Great menu of about ten appetizers, shellfish, half a dozen soups & salads, main dishes and finally prime steaks.  They feature 8 prime steaks varying from Bone-In Filet to Australian Wagyu to a Dry Aged KC Strip!  They also have a couple large format meat offerings such as a 48oz Porterhouse and a Slagel Farms meat puppet dry aged 90 days.  Featured items include the famed Beef Wellington and Surf & Turf.  Then they have the sides and large offering of sauces.  Had a bone in filet and it was outstanding, cooked a perfect MR!  Sides were also outstanding and the trio of sauces that come with the steak are great.  I never put sauce on steak but you have to make an exception..horseradish sauce is so good!  Dessert and a double espresso to finish it off with perfect execution, not one mistake during my visit.  Not much more to say here except I can't wait to go back.. bring your wallet!", "pics": null}}, {"review": {"des": "Yep.<br>There was not one thing about this dining experince that wasn't first class (except 16 buck valet parking). Our \"Host\" who was more like our guide on adventures in cholesterol, was funny, charming and knowledgeable.  <br>We knew we were getting the Beef Wellington coming in, since this was our anniversary,  and that's what we had at our wedding,  but we were guided thru the appetizers , sides and wine selections by our waiter. The sparkling wine reminded me of Taittinger and we were comped for a round by the manager who also  brought us a serving of off-the-menu chocolates. Do I even have to tell you how awesome they we're?<br><br>We started with the Lobster bisque, which was insanely rich and smooth. Iike liquid Lobster<br> I had a very nice canoe-cut marrow bone, with  toasted baguette points. <br>Dinner was the aforementioned Wellington, perfect medium rare, with a crust that when doused with the wine sauce, got gobbled up completely. Seriously- you HAVE to try this. <br>I had a nice chunk of fois gras along with some potato puree (listed as \"mashed\", but not really) and some broccolini which was supposed to be chili and garlic infused,  but turned out to be quite mild. Still.nice though  <br>As it happened, our assistant waiter (I can't bring myself to call him a \"busboy\" due to his incredible presence)  came by with the chocolate trolley of doom. They offer several other house made desserts by their \"award winning dessert chef\" but we decided to go hard after the chocolate. We had a three buck sample of all six items and were impressed by each one. <br><br>I have to say again that this 2 year old steak house really has its act together in every possible way. <br><br>I can't recommend this place enough. Simply perfect.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OSy90CYxFcLM9kdPicusDQ/348s.jpg", "caption": "Why yes, we Did hit the choco trolley.."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZsQ7g5nL7dOhkjTBeOfG7A/168s.jpg", "caption": "Manager brought it. What a dude!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/I9Ni4R3A5cDFscTNY2ACLA/168s.jpg", "caption": "Same stuff with waiter- provided lighting."}]}}, {"review": {"des": "Decor is gorgeous! Service spectacular! Food just meh.<br><br>The food wasn't bad, but for the price it was just average. I had a $17 beet and goat cheese salad that had very little taste. My friends also said that their salads were just oK. $55-$70 steaks not as flavorful and high quality as expected. The $15 cheesecake tasted like it came from Jewel and was the size of a beverage coaster.<br><br>S&S was fun to try, but for the cost I would prefer to spend my money at another iconic Chicago steakhouse.", "pics": null}}, {"review": {"des": "We had dinner reservations at Swift & Sons for 3 couples prior to going to the Black Hawks game on Saturday night. My wife and I decided to move to a vegan (plant based) diet for the new year. She e-mailed ahead and heard back right away from Jennifer Scott, who was so helpful and accommodating. When we arrived the waiter was already aware of our dietary restrictions and assured us the chef had prepared a wonderful vegan entrée for us. We had an amazing arugula salad with the feta removed and some bread with olive oil (made without butter - ask for this in lieu of the normal bread basket). Our entrée was a very tasty mushroom risotto and spicy chili broccolini on the side. Huge thanks to the staff at Swift & Sons for making our dinner out with friends such a wonderful experience.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1xHl64J34pWPBzAMPAS33A/348s.jpg", "caption": "Vegan mushroom Risotto with spicy chili flowering broccoli - Call ahead and they can work with your dietary needs!"}]}}]}