{"name": "taco-joint-chicago", "reviews": [{"review": {"des": "Great taco spot!<br><br>Stopped in here for a quick bite and sat at the bar. The service was super, super fast and the bartenders were very friendly. <br><br>We ordered the chips and guac, tortilla soup, and two tacos. The tacos are priced between $3-$4 and were very flavorful! LOVED the tortilla soup :)<br><br>I'd like to come back here for happy hour when they have beer & margarita specials and $2 selected tacos.", "pics": null}}, {"review": {"des": "Come here for the amazing food and stay for the ... more amazing food.<br><br>Best tacos I've had in a long time!! I was craving tamales for sooo long before I came here and theirs definitely hit the spot. Ugh, just. so. good. My fiancé and I made a reservation here and the only reason I'm not giving 5 stars is because they sat us in a hallway basically... I mean it's set up that way. There's a table top attached to the wall with small stools but it's a verrrry crowded area. Especially when the place is busy and all the servers are rushing past you to deliver food in the back dining area every 2 seconds. Makes for a really loud and rushed dining experience. <br><br>But anyways, we ordered the traditional guacamole which was excellent. And the hand rolled chicken tamales. Which I'm sure you can tell by now were excellent as well. For dinner I ordered the chicken tinga and Baja taco. BEST fish taco I've had in the city!! And trust me, if there's a fish taco on the menu, I'm ordering it. So I've had many. My fiancé ordered the ceviche taco which I tried and was blown away. I've never heard of a ceviche taco but it was outstanding. Such a blast of flavors. Our server seemed very busy but was always checking on us. The food comes out insanely fast too. <br><br>I would come here again but I would have to call and ask to reserve an actual table... Sitting in that hallway was just awful but the food and speedy service made up for it.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LJwwUhYQOwkdF7xluZgiLA/168s.jpg", "caption": "Chicken tinga & Baja fish taco."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yEgkPPQAbg4csq1R8XhQdg/168s.jpg", "caption": "hand rolled chicken tamales"}]}}, {"review": {"des": "The best tacos I've had in a long time. I recommend the pulled chicken and pulled pork. Careful with the pork one though because it's spicy, which I adore. Definitely try their sweet corn because...yum. Also their desserts are divine. We ended the night with a Tres Leche iced coffee. Was it as delicious as it sounds? Oh yes. <br><br>Definitely coming back here!", "pics": null}}, {"review": {"des": "We were seated right away, our waitress was nice, service was good and food was delicious but this was the first time in my life that I left Mexican restaurant feeling hungry. Usually I get so stuffed I am rolling out not walking out of the place. The portion sizes at Taco Joint were microscopic. And it comes form someone who usually eats her regular size entree as two meals. Very disappointing. I am a foodie and love great Mexican food but I will not be back to this place.", "pics": null}}, {"review": {"des": "We've been here twice. The first time was with a groupon. We had ordered a queso fundido, several tacos, 2 margaritas, and a dessert that I'm unable to remember. I do remember that we enjoyed everything and that the margaritas were strong xD The chile relleno taco especially haunted me with how amazing it was; I've tried it at other restaurants, but they weren't as good.<br><br>Had to come back for that cheese-filled chile taco, but unfortunately they didn't have it. Still enjoyed the tacos we ordered. Noise levels can get loud during busy hours.", "pics": null}}, {"review": {"des": "Feeling hot, hot, hot, after a visit to the Taco Joint! For me, the tastes were a little too hot, but to be fair, I don't normally like spicy food.<br><br>We were seated on a Friday night with 4 people and no reservation. Clearly, a reservation is recommended, especially after 6 pm.<br><br>We ordered a bottle of the passion-mango margaritas, chips and dip trio and an assortment of tacos. The queso with corn?  Outstanding! <br><br>I had the ceviche and cochinita (pork) tacos. The pork taco, even minus the habanero sauce was much too spicy for my low heat tolerance. The ceviche taco was tasty, but also a little spicy and soggy in the shell. I almost would have preferred the ceviche in as bowl with chips.<br><br>Great guac and roasted tomato salsa, but again, the salsa was too hot for me. Overall, a good meal and yummy margaritas, but not for my timid taste buds. Great location on Halsted and friendly servers.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6EWSzkvVYgAlJUv-wk1g4A/168s.jpg", "caption": "Mango passion fruit margaritas."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8u_yxOMswqTyrkwzmS2fXA/168s.jpg", "caption": "Chips and trio of dips."}]}}, {"review": {"des": "Delicious.  That's how I'll start this review right off the bat.  The Barbacoa Chilaquiles is succulent, braised beef barbacoa combined with Chilaquiles, black bean salsa, queso fresca and crema.  <br><br>The platter is presented with the mound of meat in the middle, serving as the peak atop tortilla chips moistened by a tasty tomatillo sauce, with black bean salsa flirting around the  perimeter, and topped with a fresh cheese and a mild cream.  The end result is scrumptious. <br><br>Long after the dish is gone, I'm trying my best   to scrap the remains of the combination of sauces that contributed to the success of this awesome entree.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Zit0GnY4ZDYiKOS2iIBHjQ/348s.jpg", "caption": "My entree choice: Barbacoa Chilaquiles"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-gNgFyFTv9XHmntDSBefkA/168s.jpg", "caption": "Fun print on the wall illustrating a donkey for a brewing company."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MrEyrIqLLKsn65LTjBszfg/168s.jpg", "caption": "Lunch at Taco Joint"}]}}, {"review": {"des": "I don't understand the hype about this place. The decor was going for the distressed hole-in-the-wall Mexican cantina, but honestly, it just looked dirty. I know it wasn't dirty, but it looked and felt grimy. The guac which was $7, was small and half of it was tomatoes. Definitely overpriced and not worth it. The baja taco was the only saving grace. Tasted good, but not so much that I would go back.", "pics": null}}, {"review": {"des": "We went here after getting horrible customer service across the street. Awesome food and margaritas", "pics": null}}, {"review": {"des": "This place is awesome. They have beautiful and tasty margaritas that are authentic tasting vs a sick sweet triple sec and s&s mix. Tacos are street style and their chips are thick hearty tortilla style. I get the tortilla soup and sweet peppers because they're to die for. Place is chill with good sound and lighting levels. Will be back a bunch as they're right down the street", "pics": null}}, {"review": {"des": "This is one of our go to taco places mainly because the tacos are al a carte and you arent committed to a meal full of the same kind of taco. Raja and baja are my favorite. Skip the elotes, the guac is okayyyy.  The tamales here are also very good. Its one tamale in half so it seems like its 2.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/smZsH17k4l-6G8tX9sCS8w/168s.jpg", "caption": "Elotes"}]}}, {"review": {"des": "Creative tacos! Delicious salsa. Worth checking out!! Key lime pie is dope. Friendly service. Good daily specials. Couple bucks more than everyday Mexican, but worth every penny.", "pics": null}}, {"review": {"des": "Always a great bite. <br><br>Seriously whether it's the beginning or end of the taco, it is always better than the last bite.<br><br>I tend to get 3 tacos which fills me up! Give the guacamole a go too.<br><br>The margaritas are also awesome.<br><br>Cheers!", "pics": null}}, {"review": {"des": "Taco Joint has very inventive Mexican Street food. Don't expect to have a gigantic burrito but be prepared to be impressed.<br><br>Service is as good as the food. We've been there many times, this last time we visited with a very good friend from Mexico. She is a very good cook and very knowledgeable about Mexican cuisine. She gave Taco Joint the seal of approval.", "pics": null}}, {"review": {"des": "Third visit - nah this place is not a five star after all. There is a lot of hit and miss. The tortilla soup wasn't good.", "pics": null}}, {"review": {"des": "Stopped in here before the Pearl Jam concert.   Oh my gosh! the food was delicious.  We ordered the Mexican street corn along with the tacos.  The street corn was amazing make sure you order enough for everyone. I am a person who loves her heat in food as I spent a lot of time in Sichuan learning to cook and eat and I enjoyed the tacos however the beef brisket taco was just a little too much heat, needs to be cut with some creme or sour cream. As my stomach was not liking me too much after eating it.   But definitely try the other tacos as they have some great flavor.  Lastly we had the margaritas since it was Monday and the special was $6 margaritas.   They were well worth every penny. Tasty with just the right amount of tequila. Overall I would say the food and drinks we great and the prices would be hard to beat in Chicago.", "pics": null}}, {"review": {"des": "My boyfriend and I came for their happy hour! : ) Weekdays from 4-6pm. Their al pastor, barbacoa, and cochinita are $2 each. They also have discounted margaritas and such. Their interior is what you'd expect -- a bit rustic, different colors. <br><br>The start wasn't all that great. I had to get up and ask for our order to be taken. After that, though, it was alright. <br><br>SIDES:<br>Street corn - $4.50 - 3/5<br>It comes with 3 small pieces of corn. For a sit down restaurant, it was a decent price. My problem with it was I've had better on the street. This lacked flavor. It was okay, but not particularly yummy or delish. I was disappointed, but it satisfied my craving. I wouldn't get it again, though.<br><br>Blistered Sweet Peppers - $3 - 5/5<br>This was soooo good! There are 5 mini sweet peppers & a decent amount of green beans. It was a bit salty, but I liked that. It was citrusy, too, and blistered to perfection! I really, really enjoyed this. I'm going to get my own next time. I would definitely recommend! Adds a really great fresh touch to the meaty tacos.<br><br>TACOS:<br>Al Pastor - $2 - 1/5<br>Regular $3.50. I wouldn't get again. It was too one dimensional to me. Just sweetness. And the grilled pineapple didn't help that. It's supposed to have a tangy tomatillo salsa, but I didn't get the tangy bit of it. It was okay to try, so now I know, but I would skip this one.<br><br>Chicken Tinga - $3.50 - 2.5/5<br>Again, not my favorite, and I wouldn't get again. The meat ate a bit dry, but there was a nice touch of freshness to it. The avocado salsa was pretty good. I've just had better, so I wouldn't settle for mediocre.<br><br>Cochinita - $2 - 4/5<br>Regular $3.50. This was pretty bomb. The flavor of the pork really came out, and the pickled red onions definitely made this dish! The first bite I had was okay, but the second bite with the red onions.. oh boy! It just works. Would get again.<br><br>Barbacoa - $2 - 5/5<br>Regular $3.50. This was my favorite taco. I loved the onion, cilantro, and the salsa that was on top! All of the flavors and freshness melded well together. Definitely recommend to try!<br><br>Overall, this was decent and the happy hour makes it worth it. Do I think they tacos are worth $3.50? No. I'd pay $2.50 max for them, so thank goodness for Weekdays from 4-6?! LOL. This place is worth checking out during happy hour if you're in the mood for some tacos and you're already in the area. :)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iHvrDrSGSy1m-eEHRh7BAg/348s.jpg", "caption": "Tacos"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Pm8vHaaRWjqeXK7ILJyfiw/168s.jpg", "caption": "Elote.. ehh"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qW5MKtYIv-x2sjqKIQX9CA/168s.jpg", "caption": "Blistered peppers. So good!"}]}}, {"review": {"des": "We love this place because the food is always great.<br>Went with a friend who is Mexican and a great cook & she gave it 100% thumbs-up.<br>We had several tacos, but don't miss out on Rajas, Conchinita & the steak fajitas;  they were outstanding. Our great experience was completed by our server, German P. This is one the best waiter/server experiences we've encountered. Not only was he very professional but very sensitive to his guest's needs. There were 3 of us and my spouse was sitting at the other end. German realized that he could not hear and made it a point to go over & make sure he was included in the discussions. Thanks German!!", "pics": null}}, {"review": {"des": "One sentence for you: AMAZING RELIABLE AND DELICIOUS catering spreads, every time! These guys have helped me feed hundreds of peeps from all over the country. They are rock stars of flavor and service. Thanks heaps Taco Joint!", "pics": null}}, {"review": {"des": "While visiting we stopped in for a quick bite. I tried to make changes to a taco and was told I could only take things off, not add. So glad the bartender told me to trust him, the taco was outstanding! Also, some of the best queso I've had in awhile. If I lived nearby, I'd be a regular.", "pics": null}}, {"review": {"des": "Decent. 2 of my 3 tacos were not great. The Baja felt like frozen fish sticks from the grocery store and had no flavor. The Barbacoa reminded me of sloppy joes. The Al Pastor chicken taco was the good one. <br><br>Rice taste like frozen, microwaveable rice. Beans were good as was the chips and guacamole, salsa etc. <br><br>Good drink specials. <br><br>If you want really good tacos--look elsewhere. If you want a convenient place to LP that serves tacos, this is it.", "pics": null}}, {"review": {"des": "I've seen this place several times throughout the year, and finally stopped in to grab a bite. Me and the girlfriend stopped by during happy hour (4-6 PM on weekdays) and I have to say I really enjoyed it. The place is located on Halsted nearby a bunch of restaurants, and can be located by their funky sign. The inside is pretty dimly lit, but has a cool décor. The bar area was packed, but the dining area was empty (the place is kinda awkward with the bar being separated from a back dining area by a long narrow passage). We were seated prompted and after a couple minutes of waiting had to tell the hostess that we were ready to order (we were wondering if they forgot about us because of how isolated we were from anyone else). After that the service was prompt and really friendly.<br><br>Now onto the food:<br><br>Street Corn 3/5: This was a pretty staple dish. It came with 3 pieces of corn on a stick with mayo, cheese and chile. It wasn't anything spectacular and I've had better elsewhere but if you're craving elote, you won't be disappointed.<br><br>Blistered Pepper 4.5/5: they have this on the taco section as an \"add on\" but it's more of an appetizer to me. It was fweaking delicious. You get about 5 grilled mini peppers that are salted and spicy with a twist of lime. It also came with green beans so you had a variety of veggies to munch on. I really enjoyed having a fresh side to eat with my tacos. Next time I'm going to skip the street corn and grab two of these!<br><br>Tacos : During happy hour you can get three of their tacos for $2 each (barbacoa, cochinita and al pastor). Overall the tacos were what you would get from a good street vendor. I personally enjoy something like velvet taco more, but during happy hour these prices are hard to beat. The ratings below are based off their prices for happy hour. I really wouldn't come here when they don't have a deal.<br><br>Cochinita Taco 4.5/5: This was definitely my favorite taco of the four I tried.  The meat was seasoned very well and it had a hot sauce flavor that gave it a kick. It also came with pickled red onions on top which went well with the taco as a whole. If you like a little spicy try this taco!<br><br>Barbacoa Taco 4/5: This was a really good shredded beef taco. It was soaked in the marinade and salsa, so each bite was extremely enjoyable. It came with onion and cilantro on top which gave it a little freshness to cut all the richness.<br><br>Chicken Tinga Taco 3.5/5: This was the only taco I tried that wasn't on the happy hour list. It was a pretty good taco that was quite fresh compared to the rest. The avocado salsa and cabbage really made this taco have a crisp freshness that was a good break from the richness of the other tacos.<br><br>Al Pastor Taco 3/5:  This was my least favorite, but I think it's due to my personal preference. The meat of the taco was sweet with a little kick to it. With the pineapple on top I personally didn't enjoy how sweet it was, however the flavors were good. I would say if you like Al Pastor tacos, try this one. However for me, I'll pass next time.<br><br>Drinks:<br><br>Blood Orange Margarita 3.5/5: It was sugary and had a strong blood orange flavor which was pretty nice. The drink definitely was on the stronger side, however it was pretty full of ice. Overall for the happy hour price of 6 dollars I can't complain. However I rather get 3 more tacos than this next time :D .<br><br>Overall the place is a decent restaurant to come for their amazing happy hour deals. Like I said previously, I probably would go somewhere else during times where they don't have the deals. However, if you are nearby around happy hour, stop by for some good tacos!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/NMCka9fms8cRom6d2IlbTA/348s.jpg", "caption": "Blistered peppers (so good)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/W-RvkRkKcBJqLnxf2QmltQ/168s.jpg", "caption": "Street corn (elote)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CvQggmjM3X8A_2jpwWbG1Q/168s.jpg", "caption": "Tacos!  From top left clockwise: Barbacoa, Al Pastor, Cochinita, Chicken Tinga."}]}}, {"review": {"des": "SOOO GOOD! Always passed this place but never went in. Best hole in the wall joint we have been. Super cute little vibe with delicious tacos! Really good portions too- lots of meat!! Definitely coming back for the deals!", "pics": null}}, {"review": {"des": "Call me fatty boom batty. I was not expecting the explosion of flavors from the tacos. My wife and I made in time within a few minutes of happy hour to almost end. The waitress got to us before it was over. That's a plus considering it was at the very tail end. She told us right away what the deal was.<br><br>We ordered frozen fruit margaritas (pink guava and passion-mango). <br><br>$2 tacos for happy hour - al pastor with pineapple and barbacoa.. so flavorful and moist. These tacos were on point. My wife got the ceviche and cochinita tacos. She said they were oh so good with the  face lol. <br><br>We ordered the chips & dip - 3 dipping items (rojo salsa, street corn queso dip, and guacamole) with unlimited chips. The queso dip was so good and creamy. <br><br>I got a chicken tamale. It has a nice kick to it with each bite, but flavorful. <br><br>Waitress & hostess was great. Food came out within minutes of ordering. <br><br>Im sure on weekends it would be packed, but on a Monday night.. not so much. <br><br>Love chill atmosphere and the 90s hip hop (Neptune's, old skool Kanye, Lupe Fiasco, Talib Kweli & oops.. Daft Punk is playing right now.)", "pics": null}}, {"review": {"des": "Very authentic Mexican and good eats! Delicious Cochinita and Al Pastor. Chips and guacamole were great, but chips could be warmer. Overall a great meal!", "pics": null}}, {"review": {"des": "Tried the Taco Joint and it was good times. The food was good and so was my half price passion mango margarita... thanks half priced drink  Wednesday's!! 2 tacos (Barbacoa & steak), drink, & chips and guacamole", "pics": null}}, {"review": {"des": "As my family is Mexican, this place was...not? The taste wasn't bad but it wasn't the taste I'm accustomed to. The price was also rather outrageous compared to what I'm used to. The tacos were either $3.75 or $4 each, when in my hometown I'm used to paying around $2, but I guess that might have to be due to the area we are in. Overall, it's okay.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oLKO4BHmfr_6Va23XQxocA/348s.jpg", "caption": "Taco Dinner Plate (one Al Pastor Taco & one Steak Fajita Taco)"}]}}, {"review": {"des": "Some of the best tacos I've had in a very long time. They definitely got creative with them but yet without losing the basics and the attention to quality. Service was impeccable so definitely coming back!<br><br>Highly recommend the Pastor and Barbacoa Tacos!", "pics": null}}, {"review": {"des": "Went during happy hour (4-6, not sure which days). I got the TJ maragarita ($6) and one of each of the tacos on the happy hour deal (cochinita, al pastor, and barbacoa, $2 each). They were pretty sizable tacos for only $2, usually you get dinky 4 inch nothing tacos at that price. The al pastor was the best, the other two were beyond my spice threshold, but still good. The bartender was very friendly and personable. I would definitely recommend this place to others.", "pics": null}}, {"review": {"des": "I was around the area and googled different restaurants. Taco joint caught my eye because of the previous reviews and the menu. Well, do not hesitate to go. The food is DELICIOUS! We were taken care of right away, even though it was packed. Our food did not take long to come. I was very impressed with the tacos of barbacoa and al pastor. The flavors were wonderful and let's just say my taste buds were VERY VERY HAPPY! This is a must try location. Also, the staff is very attentive and friendly. I will definitely be back.", "pics": null}}, {"review": {"des": "I've been here twice at two very different times: Once on a weekday around 3 pm, where I sat at the bar to drink a margarita and read, and then on a Saturday night at 8 pm for a date, and both were very enjoyable experiences. If you're ever looking for a good, low-key weekday happy hour, Taco Joint has fantastic prices, unique drinks (my favorite is the Sangria Punch), and their food is SO GOOD. And if you're looking for a date spot on the weekend, make sure you're dating someone who likes tacos and bring them here (also........ just make sure you're dating someone who likes tacos, because that's a great personality trait). It's a good date spot because the whole place is candlelit and the prices really are not bad at all. Also, TACOS. I like tacos. Bye!!!", "pics": null}}, {"review": {"des": "I think I have gone to every location in the city of Chicago. Always the best service, mouth watering food, and always a good time!", "pics": null}}, {"review": {"des": "Another favorite. Good food and drinks. Grab a quick bite at the bar or sit in the back!!", "pics": null}}, {"review": {"des": "One bit and I just found my favorite taco spot! Well worth the trip!! I got the steak, Al Pastor and the chicken tingy!! Oh yeah forgot the eloe corn!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pX0C8ZhI9ZF1f_TGv3SuMw/348s.jpg", "caption": "Sorry couldn't wait to get home started eating early!"}]}}, {"review": {"des": "Somewhat ~Vegetarian friendly~<br><br>Had an early dinner with a friend last night.<br><br>We shared:<br>- Griddled Cheese and Peppers gotta<br>- Taco Dinner, Rajas tacos with street corn and rice<br><br>The torts was really tasty! Had a little bit of a kick, but tasted incredible. The Rajas tacos and street corn were also very good. The rice was okay, nothing noteworthy.<br><br>I really liked the vibe of the restaurant, they were playing fun music and it seemed like it would be a great place for happy hour.<br><br>No complaints, and I'd probably visit again if I wanted to have a casual but fun dinner.", "pics": null}}, {"review": {"des": "Came in for a quick lunch before a performance in the area. What a charming place, nice waiter, and great food! You can order individual tacos and mix and match, but they also have combinations, among other things.<br>I had a ceviche taco and a steak one. My friend had three ceviche tacos. They were great, well seasoned, light. We also had guacamole with chips, which was outstanding.  Fully recommend this place. Next time I'm in Chicago I'll definitely stop by again!", "pics": null}}, {"review": {"des": "We tried this spot out because of a great Groupon deal. I love getting me some boozy brunch on Saturday's with my friends, and this was our next place to try. The menu was promising, and the location and place itself was of the perfect atmosphere. However, I think we all came to a consensus about our experience- not worth a second Groupon. <br><br>I was debating between the chorizo and eggs and steak and eggs; the chorizo looked more full in description with a variety of ingredients so I chose this dish. However, I was so disappointed when the dish came out! Unless you order the steak and eggs, you are absolutely getting jyped. Not only is the presentation of the steak and eggs 10x more beautiful on a Spanish plate, it's also double the size. The chorizo and eggs looked like cafeteria food and tasted similarity as well. I did try some of the steak and eggs, and it looked better than it tasted. <br><br>The drinks were bottomless so that was an excellent deal, but the drinks were way too sugary and not very tasty. They also ran out of some of the drinks early on. Different than your typical mimosas, but after my first two I really couldn't stomach all the sugary juices.<br><br>Our waitress had a tough crowd so I understand her being frustrated and stressed with the big group of us. But I will say we all didn't like the service very much:/. Hopefully others don't have the same experience! I don't think I'll be tempted to visit again though.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jmxgnBu4sQGXgx_fdhSXsw/348s.jpg", "caption": "Chorizo and eggs"}]}}, {"review": {"des": "Menu is very basic, tacos are decent. Everything is over priced for atmosphere and value. With all of the incredible options in the city, these come closer to Chipotle than more authentic venues. They even charge you for chips and salsa like Chipotle. If you come to set at the bar and have a taco with your beer, I guess this would do. For dinner? Pass....", "pics": null}}, {"review": {"des": "A couple bites in, my boyfriend who's Mexican said \"Maybe if I was white I would like this?\" But I'm white and I didn't like it either. <br><br>I've picked up food from here twice, and I've been genuinely confused about how terrible the food is. Like, how can you screw up corn on the cob? HOW? It was coated in something like parmesan cheese but not parmesan that was just clumpy and flavorless and kept making me feel like I had cotton in my mouth. The only good tacos of the five types we tried were the steak fajita ones. And even then, they weren't something to really come back for. <br><br>There are some rave reviews for this place, but I just don't get it. Maybe tequila has something to do with the great dining-in experiences? My boyfriend's final summary: \"If you want real Mexican, you're better off with an elote man on the corner.\" Or like, anywhere else.", "pics": null}}, {"review": {"des": "Great food and service. Left Stella's after waiting 15 minutes at our table without being recognized.", "pics": null}}, {"review": {"des": "Get. The. Donuts. They are the for real business! This place is very chill and yummy, great for an relaxing summer meal!", "pics": null}}, {"review": {"des": "One of my favorite places. Boujee tacos as I sometimes have to refer to them. These tacos are not you typical hole in the wall tacos. They are far better, but not so gentrified that they don't carry authentic Mexican flavors. Menu changes slightly on occasion which is nice because it keeps things exciting. Great hostess and good server. We always get the street corn and melted cheese. Skip the taco dinner and just get tacos. Ceviche, Asada, and Posole are a must try.", "pics": null}}, {"review": {"des": "Was pretty pleased with my first experience at Taco Joint. We had a 15 minute wait at 7pm on a Friday night which was not bad at all. The service was very friendly and prompt which I appreciate for it having been so busy! I ordered the battered shrimp taco, baja taco, and the cheese and shrooms taco. Loved the first two, but didn't care for the mushroom taco, mainly because I'm not a huge mushroom person in the first place. Tacos were fairly priced, and the food came out in about 10-15 minutes which is super speedy. I was a little disappointed that the chips and salsa cost money ($3) and that the guac seemed a little expensive (7.5 for one or 12.5 for two), otherwise I would have gotten some. Only other complaint is that it is EXTREMELY loud in here. Would not recommend for a date or trying to catch up with a close friend. Overall though I'd definitely come back!", "pics": null}}, {"review": {"des": "BEST taco place I have found in Chicago thus far. Perfect for taco Tuesday or any other day of the week. Fab service, fab food, fab deals: what more could you want?! I definitely recommend getting the trio guac they were all so good & fresh. We got a steak and fish taco. Both were AMAZING. The carne asada was sooo juicy & perfectly cooked.", "pics": null}}, {"review": {"des": "After driving past this place for months, I finally decided to stop in. The ambiance is cozy and cool, and my friend and I loved the 90's/00's throwback playlist going! Our server was friendly and got us waters and menus right away. I definitely recommend starting with the guacamole- some of the best I've had. I ordered the ceviche taco and the al pastor taco. The ceviche was outstanding- so flavorful, fresh and citrusy. The al pastor had a nice balance of sweet and smoky, but was a bit spicier than I anticipated. All in all, great meal and reasonably priced.", "pics": null}}, {"review": {"des": "Love this place!<br><br>This is my first review for Taco Joint but I've been here multiple times. This location is a small, cozy little spot in Lincoln Park that's great for small groups or a date night. Expect a wait during peak hours, or make a reservation ahead of time.<br><br>On my most recent visit my friend and I started with $5 house margaritas (a Monday special) and the rojo guacamole. Their margaritas are great, and there's usually a bunch of flavors to choose from. Guacamole was a very generous portion and had a nice pizzazz to it. Taco-wise it's hard to go wrong with any of their options. Everything I've ever had was delicious. This time I ordered a barbacoa (beef), a cochinta (pork) and a Mr. Taco (steak). Their tacos always come out blazing fast so you can always order more if you're still hungry.<br><br>Service has always been good here but our server Rachel was especially sweet and did a great job taking care of us. The Lincoln Park Taco Joint is one of my favorite restaurants in Chicago! I can't wait to come back again!", "pics": null}}, {"review": {"des": "Taco Joint is all you could hope for in a neighborhood Mexican restaurant. The portions are big, the prices are small, and the food is always delicious.  The Baja fish tacos are my favorite. The guac is always on point, and the queso fundido is very good if you want something bad for you.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/glKVky5F6hS_PLlmvSqWUQ/348s.jpg", "caption": "Guac and tacos"}]}}, {"review": {"des": "A cool intimate Mexican restaurant with great food and a a great ambience.  I've enjoyed all veggie tacos & fish tacos, as well as the guacamole.  Everything is delicious!  Mango margaritas on the rocks are my personal favorite.  This is a great spot to come with friends or just to sit at the bar by yourself.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dgMqnc67vBPwG8NCG8ATBg/348s.jpg", "caption": "Corona with lime"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ua6oO4qdT3PKM-p8B-N_7g/168s.jpg", "caption": "Fish taco"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LLFq0RcjaxCSxGze73GVBg/168s.jpg", "caption": "Rajas taco"}]}}, {"review": {"des": "Absolutely terrible tacos <br><br>Postmated this and the tacos were cold and gross <br><br>so we gave it a second chance and actually went to the restaurant <br>And it was the same cold tacos the corn tasted super gross <br><br>I'm a hugh Mexican food lover tacos are my favorite <br>So when I found this place was so excited read the \"great\" reviews about this place and decided to try it <br><br>And was just so upset never will return tacos have a  very bad almost rotten taste to them", "pics": null}}, {"review": {"des": "I came here for lunch with a friend of mine this afternoon. I must say these are some of the tastiest pulled pork tacos I ever had! Spicy and full of flavor! I also had the braised beef taco which was amazing! The fish taco was not bad in my opinion but my friend stated that it was too \"meaty\" for her...yeah I'm trying to figure out what that means! The guacamole was fresh and tasty with plenty of salt...sometimes restaurants will leave that out altogether. Anyhoo it was a great lunch spot and I can imagine the type of crowds that would visit on a  Saturday night! Move over Big Star...Taco Joint is on point! Oh, don't forget to try the strawberry sangria, cute and refreshing.", "pics": null}}, {"review": {"des": "The el pastor and ceviche tacos were goood!! Margaritas were very nice as well, very surprised how good this place was, would definitely recommend and come back!!", "pics": null}}, {"review": {"des": "Tacos are fantastic! Came here late at around 10pm and we were seated promptly. It's a cozy space so I can see it getting packed. Lighting was dark, ambiance was chill.<br><br>I am very picky about my tacos (I like them fresh and flavorful). Taco Joint surprisingly met my taco standards. Each taco packed a punch and they were reasonably priced. The TJ margarita was good as well. I'd like to come back to try more of their food options. They also seem to have some great happy hour deals. <br><br>Attentive and friendly staff, quick service on a late night, and flavorful food. Highly recommend!", "pics": null}}, {"review": {"des": "Awesome tacos and a great environment. Love the corn shells the tacos come on and happy hour makes it even better when they're only $2. Also has a fitting drink selection of tequilas, margs, and Mexican beers. <br><br>I have eaten in the restaurant and Uber eats, both have been delicious. 3 tacos is a decent serving but if you're really hungry I'd do 4 or 5", "pics": null}}, {"review": {"des": "Tip: Unlike the River North location, the Lincoln Park location doesn't take reservations, but they're on NoWait, so you can put your name in and track your spot in line pretty conveniently so you don't have to wait as long as if you just show up and try to get a table.<br><br>Overall, good and plentiful margaritas that you can get in a giant jug if you're in the mood for a fun start to the night.  Tacos are small, so get a few of them.  The tacos on the menu don't say whether they come in hard or soft shell, so if that matters to you, be sure to ask your server which is which.  The ceviche taco is my personal favorite.  The white fish has a bright citrus punch with lemon serrano vinaigrette and fresh avocado, cucumber, and pico de gallo to add to the brightness.  <br><br>The restaurant itself is narrow and very noisy, so I wouldn't recommend going there if you're looking for an intimate date spot or a quiet night out.  But overall, the servers have always been good at remembering orders even with everyone ordering lots of different tacos and getting them out pretty quickly.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KBgP51j_R0l0Oc2zNRJPDg/348s.jpg", "caption": "A jug of margaritas? Yes, please!"}]}}, {"review": {"des": "We came here after walking around in the area and were craving a nice margarita and some tacos. Needless to say our craving was satisfied! We ordered many appetizers and different assortments of tacos. My favorite was the fish tacos, loved the slaw on it and it was very fresh tasting. I make it an effort to try new restaurants as we have so many in Chicago but I always want to come back here.<br>The restaurant is quaint so naturally its a bit noisy and very dimly lit when you get to the seated section in the back. Other than that it has been a great experience each time.", "pics": null}}, {"review": {"des": "Came here with a Groupon for brunch and bottomless drinks for 2 but we had a group of 3, so we just purchased another brunch bottomless deal for an additional $32.<br><br>I was worried about getting enough drinks to get our monies worth after reading the reviews but luckily, my group felt like we were able to order enough drinks (11 total)<br><br>We sat at 11:20AM and ordered our first round of drinks and entrees within 5 minutes. We were told that there's no colectivo coffee or breakfast burrito or chorizo and eggs available because their machine wasn't working for the coffee and not sure about the 2 entrees.. this also seemed like a running problem.. if y'all can't handle the brunch crowd - why even put a groupon on? Our waitress told us straight up that the bartender was already backed up (seems like a default saying as to make us not question why the drinks were taking so long). I inquired about being able to order 2 drinks at a time since I didn't want to have to wait for my second one but was told legally, they weren't able to... kinda fishy, not sure what that has to do with legality.. made me want to come back at a non bottomless drink time and order 2 drinks to see if they would give it to me... somehow I'm doubtful I'd get the same legality spiel. It was not the greatest start but luckily it got better.<br><br>When we received our first round of drinks (20 minutes later at 11:40AM), our waitress took our 2nd order right away which was nice of her to do. <br><br>Our food came 40 minutes after we placed the order around noon.. which I don't understand why it took so long and I think we were still at our 2nd round at that point. Timing, it sucked to have to wait 40 minutes for food but at least we got 2 rounds in. <br><br>Anyway, food was okay. I got the steak and eggs (realized after that I wasn't even asked how I wanted my eggs) and it definitely wasn't a normal steak and eggs like I was expecting.. the steak itself was like thin strips of beef (hardly steak..) and received my eggs sunny side up. <br><br>Anyhow, for the price paid, I wouldn't have gone back. <br><br>Things to note:<br>*There was an additional $8 for \"Groupon tax\" <br>*Steak and eggs for brunch menu wasn't at all a \"Steak\" but more just beef<br>*Bottomless drinks included only the TJ and Fruit margaritas", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/r3r-RxV4a-MMhRTGOJT4Wg/348s.jpg", "caption": "receipt"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8IBUgYs7K4rClsbPMkL0TQ/168s.jpg", "caption": "taco platter"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jA8fTYT4WcHhxSAHCRAq2w/168s.jpg", "caption": "chillequelles"}]}}, {"review": {"des": "This is a great place for happy hour! It looks tiny from the outside, but the restaurant extends backwards and has cool ambiance/decor. I've been here a couple times and have tried the guac & chips and the baja, chicken tinga, and al pastor tacos-- all were good! Maybe not the best tacos I've ever had, but very tasty. The hibiscus-prickly pear margarita is also really good.<br><br>Based on others' reviews, I don't think I'd come here for a \"real meal,\" but it's a great place to grab drinks and a few tacos for about $10!", "pics": null}}, {"review": {"des": "There is only one taco joint you will ever need to go to and it's the Taco Joint on Halsted. I don't even like tacos but these little honnies are tasty as fuck. Combine that with good company, legit mescal and on par service and you got yourself some good times!", "pics": null}}, {"review": {"des": "Came here on a Saturday night, and the place was pretty busy.  We put our name in and waited about 40 minutes for a text to say our table was ready.  <br><br>The food and service was amazing and totally worth the wait.  We couldn't decided between the quac and queso fundido, so we decided to just get both. It turned out to be a great decision because they were both really good. The tacos are pretty small, but they are very good. The tortillas are handmade, and you can really taste the difference. Overall its as good as anything you can get at big star, just be careful because some can be pretty spicy.<br><br>Extra points because our awesome waiter remembered an order of 7 different tacos and 2 different apps without writing anything down.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZjTnfhgamHsQcRoM3EB0Vw/348s.jpg", "caption": "Saturday night special.  $6 modelo and tequila shot. Credit: Shannoninthecity.com"}]}}, {"review": {"des": "We're new to Chicago and have been in search of a Mexican restaurant that rivals any of our Texas favs...this is NOT it. Started with the salsa trio (salsa, queso and guacamole) which cost $12 - cause apparently chips and salsa aren't complimentary. Salsa tasted like ketchup, queso with street corn tasted like powdered cheese with frozen corn in it, guacamole was bland. Next up was the tortilla soup which was vegetarian...as a pescatarian I appreciated that is wasn't made with chicken stock.  Closed with the fish tacos which were the best of the worst...tiny for $4 each. We won't be back to the Taco Joint...it's not the taste we were after.", "pics": null}}, {"review": {"des": "Every time I've gotten delivery of them, the tacos arrive in a wet mush and the tortillas fall apart. They use a single tortilla on their tacos. This has happened with the Cochinita, the Steak Fajita and especially the Chicken Tinga tacos. If you want to eat what ends up being a puree taco, this is your place.", "pics": null}}, {"review": {"des": "2 stars for service + 4 stars for food and ambiance = 3 stars<br><br>I've been to the River North location for bottomless deals before and the staff and food have always been awesome. My friend had a Groupon and so 5 of us headed there last Saturday. <br><br>The wait was long (~1.5 hrs.), but that was to be expected and the hostess informed us that we could not be seated unless the whole party was there - understandable. Note: they do not take reservations for brunch. <br><br>Once seated, we ordered drinks and then the waitress came by and said they were out of the TJ margaritas. Totally fine, we ordered another set of drinks and the food. After about 10 minutes our food showed up and there was still no sign of our drinks. We were seated for over a half hour they finally arrived. For a bottomless deal with a 2 hour maximum, that was kinda disappointing. <br><br>The waitress did comp our guacamole, but I would advise staffing a few more people for the brunch shift.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/txBGnVsERFWr7yUl1B3qKA/348s.jpg", "caption": "A palmoa (squirt and tequila) and the last of my al pastor tacos."}]}}, {"review": {"des": "I still love Taco Joint, but it has fallen out of my favor over the past few years as it has become more popular. Which is fine - I get it. The tacos are still good and cheap, as are the margaritas. I believe they take reservations now, which is great because it is always packed! Expect a wait if you don't have a reservation, and get a seat by the bar if you can, but otherwise there isn't much room.", "pics": null}}, {"review": {"des": "One margarita, two margaritas... Stopped by since we had a Groupon for the weekend brunch with bottomless drinks for two. Got there right as they opened and there was a decent amount of people already there. Who doesn't love a boozy Sunday brunch, right?<br><br>Before we even ordered, our waiter informed us that they were out of two of the brunch entrees (the breakfast burritos & the chorizo 'n eggs) and they weren't serving two of the bottomless drinks (colectivo coffee & paloma) or the coconut lime margarita (even though it's under the fruit margaritas on the menu). This actually wasn't a issue for me since I wasn't planning on ordering those items but my bf was a bit bummed.<br><br>The service was slow from the start and just went downhill. It seemed like our waiter was the only one running around taking orders, so we sympathized with him. When he finally came around, he ended up only taking our drink orders first. I got the mango passion margarita and my bf opted for the blood orange. <br><br>He came back about 15 minutes later and suggested for us to get an appetizer to share while we sip on our drinks so we decided on the traditional and rojo guacamole. They were both delicious, but I ended up liking the rojo one a little more.<br><br>At this point, we've been here for at least half an hour and had to wave down the waiter to take our entree order (not sure if he forgot or what, since the table who came after us got an appetizer as well and their food already came out). I decided on the TJ taco platter, which comes with 3 tacos: your choice of meat, Mexican rice, & chipotle black beans. It was pretty good, definitely reminded me of Mexican street tacos.<br><br>However, the main reason why I'm giving this place 3 stars is because we finished our drinks before we even got our food and it took 45 minutes to get the round and by that time, we had already finished our meal. The waiter kept on trying to reassure us by saying that all the drink orders were backed up, which was understandable since it was busy. But the table next to us asked for another drink way after we did and still got two other rounds before we even got the first one we originally asked for. So it was pretty obvious that our order might have been forgotten (after asking twice about where our drinks were) and there were plenty of rounds margaritas/drinks coming out to every table but ours. Not only that but my bf decided to switch to a corona. I mean, how hard is it to open a beer and serve it? Unfortunately, when our drinks did come out, the waiter brought me the wrong flavored margarita but I was over it and told him it was fine and ended up drinking that one.<br><br>Sadly, I had really high hopes for this place based on their Yelp reviews. \"Bottomless\" drinks turned into only two drinks. Might have just been an off day. Good thing we didn't have to pay the full brunch price ($32 per person), otherwise I wouldn't even think twice about giving this place another chance.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/l1KBlt2IptObP07LJjKLAg/348s.jpg", "caption": "TJ taco platter: baja, al pastor, cochinita"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/q82KtwFuyIwVu7AoNlPJOg/168s.jpg", "caption": "TJ taco platter: barbacoa, cochinita, al pastor"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/f-gsyhDzKzHHxA7vsUXRkw/168s.jpg", "caption": "Traditional & rojo guacamole"}]}}, {"review": {"des": "Service was fast and food was really good! The corn queso was the best! Barbocoa Taco was soooo good and juicy, lil more spicy that I'd anticipated but I was pleased. I'd go back.", "pics": null}}, {"review": {"des": "Taco Joint is a great go to for consistently good tacos in the  Lincoln Park area. I have been coming to this restaurant since 2012 and keep coming back because they are great for small groups and 1 on 1 dining. <br><br>Things I love <br>+Drink selection and their margaritas<br>+Attentive service and front of house staff. Even if there is a long wait, you feel like the staff takes care of you<br>+TACO selection, and trying different \"tacos of the day\"<br>+ getting enough food (bang for your buck!)<br>+GET THE GUAC TRIO :)<br><br>Things that could be better<br>-They used to have plantain chips and homemade tortilla chips with the salsa and guacamole :( the new ones aren't very good. <br>-The cocktails are pretty expensive ($10/each) so I usually only get 1. <br>-They should stick to tacos on the menu. I have noticed they are adding more selections like tortas and more appetizers, I hope they stay true to what they do best...fun, fresh tacos.", "pics": null}}, {"review": {"des": "Guillermo the bartender was great. Awesome $2 happy hour tacos and $6 happy hour margaritas on Monday!!! The margaritas weren't too sweet and you have a choice of flavors even on the happy hour prices. Highly recommend.", "pics": null}}, {"review": {"des": "I wanted to like this place but my experience was so incredibly average. My boyfriend and I came in for lunch on Wednesday around 2. We chose to sit at the bar, which we quickly realized had the oddest set up as the TV was directly to the right of everyone. Anyway, we were greeted by an apathetic bartender who spent most of her time on her phone and eating what I assume was her lunch. We both ordered Mexican beers as they were only $5, but my Pacifico tasted off. We were going to order the guac trio but we're told that they didn't offer that option anymore and that each flavor was $8 individually. Slightly disappointed, we went w/ the traditional guac. It came out fast but was extremely underwhelming and the chips were very stale.<br><br>I ordered the Al Pastor, Chicken Tinga, and Angry Bird Pulled Chicken tacos. Pastor was good, Tinga lacked flavor, and the Angry Bird had so much going on that the corn tortilla instantly ripped when I tried to pick it up. My boyfriend got the steak torta and said it was one of the best torta's he'd ever had for only being $8. Something to be said of a taco place that has better sandwiches than tacos....<br><br>Overall I give it 3 stars because the tacos weren't expensive for what I got and my boyfriend still can't stop thinking about his sandwich. HOWEVER, I will note that this place didn't have hot sauce?!?! I asked the bartender for some and she said the only option they had was a housemate salsa-like sauce. Tried it. Wasn't great. 3 stars at best.", "pics": null}}, {"review": {"des": "Never place a delivery order either directly or through Grubhub! It took 2 hours!!!! And yet the food wasn't here and I had to cancel. Placed order 7:12 pm and canceled at 9:15 with no showing up of the order", "pics": null}}, {"review": {"des": "My family likes this place a lot. I got the chicken chilaquiles which was on their brunch that they serve till 3 PM on Saturdays and it was fantastic<br><br>My kids got Barbacoa tacos which they liked a lot and my wife got a ceviche Taco which she liked as well.  <br><br>It has a cool atmosphere inside - kind of like a dive bar but in a good way.  <br><br>At the end of the day it is still a taco place not fine dining but definitely beat our expectations and we will come here again", "pics": null}}, {"review": {"des": "I left San Diego 5 long months ago and moved to Boston.  I miss tacos so much.  So much.  Soooo much.  <br><br>When my friend with good taste suggested Taco Joint for dinner, I was only slightly skeptical.  I was pleased that my skepticism was unnecessary.  Everything was great.<br><br>I had the grapefruit margarita, which was perfectly sour and tasty.  I started with the guac, which tasted fresh and there was more than I was anticipating.  On the bartender's suggestion, I had the carne asada taco and then the San Diegan still living deep inside me ordered the blackened fish taco.  Both were great.  Flavorful and so tacoy.  <br><br>Plus, Jose, our bartender, was awesome, had great suggestions, and the service was quick.<br><br>I will totally go back.", "pics": null}}, {"review": {"des": "Cozy little spot with delicious food! I was in the area and came here on a whim, having been recommended this place in the past. We were seated quickly, and I felt like the entire time we were here, service was quick and enjoyable.<br><br>I ordered the el pastor, blackened fish (the Friday special), and carne asada tacos. All were flavorful and delicious. The steak tasted smoky, a departure from what you'd normally expect from a taco, but still delicious. We got guac and chips for the table (the chips are bottomless, by the way!), and had the fruta and traditional guac. The fruta had a sweet taste to it, which I felt complimented the rest of the meal nicely. The traditional was a little more bland, but it didn't bother me too much.<br><br>Service was great -- one of the servers brought my friend the wrong taco for part of his order, and when we asked our waitress about it, she just brought us an additional taco, free of charge. <br><br>The food isn't super cheap, but it's not super expensive either. Great little joint in Chicago; worth a try!", "pics": null}}, {"review": {"des": "God damn, best margarita ever! You know how people ask if you could eat one food for the rest of your life, what would you pick? Most people pick cheese. I'd pick Taco Joint chile mango margarita. <br><br>Tacos were also legit, atmosphere great. In truth I'd give this place a 4.5 stars, but as that is not an option I rounded up.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-2pVRKJN0jEHbrpeZziFVQ/348s.jpg", "caption": "The billet"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/z7LzCXcoIRB7ZMdullSY2A/168s.jpg", "caption": "!!!!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/L5Z7wCgIAPMHeSw7zHYEbw/168s.jpg", "caption": "Our next door neighbor's dessert looked yummy."}]}}, {"review": {"des": "A great place for yummy tacos and a good margarita. They have some great vegetarian options and daily specials. The tortilla soup and tamales are also good. The only thing I've tried that wasn't great were the ceviche tacos, kind of mushy. The atmosphere is fun and lively but they do get packed on the weekends so be prepared to wait.", "pics": null}}, {"review": {"des": "Mexican Street Fare can't possibly get any better than this. The beef taco is made with high quality braised beef, roasted red jalapeño and the chicken taco is made with tomatillo salsa, onion, cilantro and grilled pineapple both are mouthwatering. Service is fast and friendly. The bartender takes great pride in his job and it shows in the drinks he makes. Lots of tequila and mezcal to choose from.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Yy8VQrizJr5Vo63dCUmcAw/348s.jpg", "caption": "Beef and Chicken Tacos"}]}}, {"review": {"des": "Really good tacos, and I can appreciate the shell. It's done almost paper thin, and crispy to the bite. Holds really well.<br><br>favorites were the ceviche and the carne asada. The ceviche comes in an innovative taro taco and is a very refreshing, filling taco to have. The carne Asada had more bolder, almost tropical flavors with a nice chunk of pineapple on top. <br><br>I like you can get one order of taco each, some places give you two tacos with one order. I'd definitely come again and I also like to order them via a delivery service (I.e Postmates)", "pics": null}}, {"review": {"des": "Great taco selection! We really enjoyed the food and the atmosphere here. We each got three tacos and split tamales and it was more than enough food. The margarita I tried was really fresh as well! We ended up sitting at the bar to avoid waiting and it was very comfortable to dine there. I would go back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JD1AR-rLHloql222azWqLQ/348s.jpg", "caption": "Rice and beans to share"}]}}, {"review": {"des": "My rating is on overall experience with taste and service. <br><br>Food is 4/5 just because the flavors are really unique and tasty. I never ever complain about having too much meat but taco joint really put too much meat in my taco for such a small tortilla! Had the time Tuesday which offers 3 tacos for $7. Pretty great deal for al pastor, barbacoa, & cochinita (chicken, beef & pull pork). All three tacos had its own unique taste which was great. The chicken taco stand out the most because it had a sweet tangy pineapple mix into it. We also tried some street food like the corn and it was amazing! We also had guacamole which was not traditional and I wish we got the traditional but our waiter recommend the other one and I was not a fan. The chips that we use to dip was very unique. At first it was a hard acquire taste but you get use to it.  <br><br>Service however was more like 3/5. The food came out really quickly which was good because we were so hungry. But we weren't too fond with our waiter. We overheard a conversation that made us really uncomfortable. A customer was asking for condiments like hot sauces and etc and the response he gave to the other guest was not really polite. He basically tried to convince the guest to not use any additional sauces with the taco because the spices were seasoned to 'perfection' but everyone's taste bud is different so he had no right to make that decision for them and in the end, they didn't even get any sauces. <br><br>I mean I would come back because the food is really amazing but their customer service might need more work!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RSz1pf-UowbvWYWs78b7Zw/348s.jpg", "caption": "Chips & guac"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/O7V6USaS0UTGuji9FW_HiA/168s.jpg", "caption": "Corn"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WPGka05U24Ja-qo8bT_aow/168s.jpg", "caption": "Time Tuesday"}]}}, {"review": {"des": "Taco Joint to the rescue! Had a quick Saturday dining experience here after Summer House was unable to seat us well after our reservation time. Staff knew of our time crunch and were extremely warm and accommodating. Six of us left well fed/happy, out the door in 40 minutes, and able to make our show. Baja ($3.5), carne asada ($4), and ceviche ($3.5) tacos were all great choices. <br><br>What's not to like...tacos? good, tequila? good, hospitality? good.", "pics": null}}, {"review": {"des": "Really like the food here. Great service,including wiping down the high chair with disinfecting wipes.Appreciated that! <br>Great drinks and nice waiter.  My only complaint is its way too DARK in the restaurant, cant even see what you are eating.  Told my neighbor I just ate there and she said I like that place but it's too dark in there!", "pics": null}}, {"review": {"des": "Pretty decent! Their tacos are pretty alright, but their happy hour ups the meh to a YEAH! Not exactly \"down home Mexican\" food but pretty affordable, and way better than any of the other \"HEY COME IN WE'RE A COOL BAR ATMOSPHERE WITH MEXICAN FOOD\" attempts I see floudering around this city. They clearly make the cuisine as much of a priority as their vibe which I dig. Good work, TJ!", "pics": null}}, {"review": {"des": "I've been eyeing Taco Joint for a while and finally made it in this past weekend with some friends. We only had to wait about 20 minutes for a table, and grabbed some drinks at the bar while we did. They don't have the most expansive bar, but my drink was strong and cold, so I can't complain. We started with the guac and chips, which was fresh and tasty. It could have used a few more chips with it but really, do you ever have enough chips? I got the steak fajita, bbq carnitas, and baja tacos. They were all a great size. I will say that everything was SPICY. I like spice and these were like woooo. Not in a bad way though, just be aware. The fish was crispy and the spicy sauce on it was great. I really enjoyed the BBQ play on the carnitas too, though the BBQ sauce was just a tad heavy. My husband got the flautas and I snuck a bunch off his plate. They were also pretty darn spicy, but nice and crispy and flavorful. This wasn't the most life-changing restaurant experience but our food came out fast, our drinks were replenished, and we were in and out without any fuss. This is a great place to stop into if you want some decent Mexican but don't want to deal with the crowds at Big Star.", "pics": null}}, {"review": {"des": "Taco joint is the perfect place to grab drinks with friends, especially now that they extended the space. <br><br>After a few visits I'd say the service is semi slow but usually really great! The drink menu is excellent and you can't go wrong with a house margarita. <br><br>The guacamole is worth the extra cost, especially the spicer one. <br><br>I'd say 2 maybe 3 of the tacos are really good but the rest are just blah compared to some of the other spots in the city. <br><br>Overall I'd recommend it for a group but not a date since it can get loud and def get the guac, pork tacos, and Margarita.", "pics": null}}, {"review": {"des": "Not the best tacos I've had, but I really liked their creativity! It was smart of them to serve ceviche taco in a hard taco shell while everything else I had were served in the soft tortilla. The baja (fried fish) taco tasted fine, but the fish wasn't crispy - the batter was soggy. Mushroom & cheese taco was my least favorite, only because the texture was mushy. I think it would've been better if they melted the cheese to get rid of the mushy texture. We had rice and beans for sides, and the the bottom of the bowl of the rice was hardened - stuck onto the bowl... tasted like microwave precooked rice. I advise to avoid the rice, definitely not worth $3.50.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bt9g87aF2jkd4325Wf5blA/168s.jpg", "caption": "A lot of food for a tiny table."}]}}, {"review": {"des": "So in an effort to fake out the filter that says my review is too short... Well you get it.....<br>Do you like tacos? Just go here. You can thank me when you get some free time.<br>Do you like tacos? Just go here. You can thank me when you get some free time.<br>Do you like tacos? Just go here. You can thank me when you get some free time.<br>Do you like tacos? Just go here. You can thank me when you get some free time.Do you like tacos? Just go here. You can thank me when you get some free time.<br>Do you like tacos? Just go here. You can thank me when you get some free time.Do you like tacos? Just go here. You can thank me when you get some free time.<br>Do you like tacos? Just go here. You can thank me when you get some free time.Do you like tacos? Just go here. You can thank me when you get some free time.<br>Do you like tacos? Just go here. You can thank me when you get some free time.<br><br>Sometimes you just need to find a loophole.", "pics": null}}, {"review": {"des": "Stopped in here for a drink after eating lunch across the street. The front is cramped and the back of the restaurant is dark and depressing.<br><br>We sat at the bar where there was some natural light seeping in. Had their paloma margarita which has both tequila and mezcal. It was good but too sweet.<br><br>Nice bartender.", "pics": null}}, {"review": {"des": "Well, I know I will never order from this place again. 2nd time they have arbitrarily chosen to close for the evening in the middle of an order. Restaurant delivers online until 8:30 but really they stop delivery whenever the hell they want to---7, 7:30...whatever.<br><br>For mediocre tacos at best, I have no desire to spend any additional money here", "pics": null}}, {"review": {"des": "I have to give this place some credit.<br>The tacos were good. Must order the habanero sauce with them.<br>The service unfortunately could use some work. My drinks came after I finished my food, and to top it off both drinks I received were the wrong ones. Overall the place has good food and good drinks but service could do a little better.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dra6cze4g2U9f55pYeFvMg/348s.jpg", "caption": "$5 shot and beer"}]}}, {"review": {"des": "I usually avoid Americanized taco spots but Taco Joint is delicious across the board. I love the elote/street corn and have had several of their tacos. The margaritas are delicious too! The price point makes sense for the quality of the food.", "pics": null}}, {"review": {"des": "So underwhelming and average. Waiter was nice and had suggestions. Food was tiny and over priced. Nothing was disgusting but nothing was really good either. White washed Tacos. May as well go to Chili's lol", "pics": null}}, {"review": {"des": "Best tacos I've had in awhile. It's not authentic. If you like that real Mexican tacos then this is not the spot for you. This taco joint hit the spot and I will definitely be coming back for there happy hours. The waiters/waitress are such sweet and kind.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qFp7ht-huH9SareZvQWLcQ/348s.jpg", "caption": "Left to right: carnitas, chicken, steak"}]}}, {"review": {"des": "Love the ambiance and the music choice is fabulous! Street corn is perfect for real street corn. Passion fruit margarita was phenomenal although it is in a rather small glass. Barbacoa and one of the chicken tacos was fabulous.", "pics": null}}, {"review": {"des": "Being a transplant from Texas, I would kill for some good Mexican food on most days, and cinco de mayo is no exception!<br><br>I had seen Taco Joint while browsing Yelp, but just hadn't made it in yet. We were looking for Cinco de Mayo specials, and my friend works nearby so we decided to give it a shot! (of tequila, that is)<br><br>I was surprised how small the place was, but loved the cozy atmosphere. The only downside to the coziness would be the long wait...but our friends arrived 30 mins before us, so we only ended up waiting 20 mins or so. There is a bar right inside the door, so I could see myself enjoying the wait another time with a margarita or two. <br><br>I started with a frozen margarita. I could go on and on about frozen margaritas vs \"blended\" margaritas, but I'll spare you. The story here is that I'm sure it's actually blended, but it didn't disappoint! A little thick for the skinny straw, and a little light on flavor (see: blended). Otherwise, enjoyable.<br><br>One of the specials for Cinco was a $25 bottle of margarita! Our server said it was nearly 5 drinks (there were four of us), but really I think it came out to just over four, not quite 4.5. Either way, it was a good deal and delicious!! The bottle was the \"on the rocks\" version - definitely recommend this over frozen if you like the flavor.<br><br>As for food - we all ordered various things. We started with the queso fundito and guacamole tradicionale. Both very good! The queso comes with tortillas yumm. For tacos, I had the chicken Tinga and barbacoa, and also tried the cochinita and al pastor. Loved everything, especially the spicy barbacoa and the pineapple in the al pastor. <br><br>Oh, we also finished with CHURRO DONUT HOLES! <br><br>If I could live on Margaritas and Mexican food, I would. Taco Joint did not disappoint! Happy Cinco De Mayo!<br><br>PS - great happy hour specials!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/l4X8gCCzL8_fLVSzBJRcRA/168s.jpg", "caption": "Tacos: Tinga and barbacoa, apps: queso fundito and Guac tradicionale"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-EysFOKx4nOWQ8mpy206FQ/168s.jpg", "caption": "Bottle = almost 5 margaritas! Cinco de mayo special $25 bottle"}]}}, {"review": {"des": "Yay tacos!  This restaurant is on the busy intersection of Halstead and Armitage and is a convenient spot to grab a quick bite or some apps and margaritas. <br><br>I sat at the bar while I waited to meet my friend and had a skinny margarita and traditional guacamole and chips.  The margarita was made with fresh lime juice and was perfectly balanced.  The guac was good, but nothing to write home about. <br><br>Once my friend and her 5 year old son arrived we sat at a table in the back.  There aren't a lot of tables so they fill up quick.  We called ahead to put our name on the list and had a minimal wait once our whole party arrived. <br><br>It was so loud in the back we had to yell to talk to each other, but our waitress was prompt and efficient and everything came out timely and tasty. <br><br>Ceviche Taco - small chunks of white fish marinated in citrus<br>Decent but minimal flavor and tasted fresh, the homemade corn tortilla was good but broke apart quickly so I added the fish to the salad. <br><br>Taco Joint Salad - romaine lettuce, black beans, roasted corn, red onion, lemon-serrano dressing <br>This was mostly romain lettuce with a few black beans and corn kernels tossed on top, not  the hearty salad it had potential to be.  The dressing was much too sweet and lacked the spicy kick I was hoping for. <br><br>My friends child got a cheese quesadilla that looked cooked to perfection with brown cheese oozing from the sides.  <br><br>Everyone loved the traditional guac and chips. <br><br>Overall a good experience, I would stop in for a drink and guac and sit at the bar again but wouldn't sit at the tables for dinner.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kO30dVsA_-1BrDkpj-lRMg/348s.jpg", "caption": "Ceviche Taco"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1E4uoPZTKV_yHr8iQ7jARA/168s.jpg", "caption": "Skinny Margarita"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DBB4s5PK6fk9-LGgXDUqAA/168s.jpg", "caption": "Traditional Guac & Chips"}]}}, {"review": {"des": "Love trio guacamole sampler appetizer. Tried pretty much every taco on the menu! Delicious margaritas! Recommended for date nights as well as friends gathering and family dinners. They offer happy hour and daily deals.", "pics": null}}, {"review": {"des": "I'm convinced there are two kinds of people in the world: those who love Taco Joint and those who've never been there. Until one week ago, I was among the latter. I visited on a friend's recommendation, and was wowed. Seriously, the tacos I had (chicken tinga, mole-q carnitas, and pozole) were amazing, the TJ margarita was delicious, and one of the owners, Carlos, even stopped by to welcome me. Not to mention Fabi took great care of me the whole time. Five stars!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EELgDFqTYe7W1cHBH5Th3Q/348s.jpg", "caption": "Greeted by owner Carlos"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/u96gnpoJ9H24iV9Y_QMNMA/168s.jpg", "caption": "Tacos: chicken tinga, mole-q carnita, and pozole"}]}}, {"review": {"des": "God I love this place!! Their tacos are so unique and tasty. I don't expect much from an al pastor taco even though they're my favorite because I've just had so many, but they were so juicy and flavorful here!! Their taco of the week when I was here on Friday was this battered shrimp one that was incredible.<br>I ordered a margarita that basically tasted like a mangonada and just like a real one, it had a strong taste at first but once I got used to it I loved it. I loved this place so much I want to come back for my birthday. Overall, it just had great food and great drinks.", "pics": null}}, {"review": {"des": "Went here for lunch with coworkers during the week. Not crowded. Good service and pretty fast. Good guacamole. The cochinita and al pastor tacos were good--not great. (I do have taco pros in the family, though.) The mole/carnitas taco was okay. The tortillas got really cold because the plates are metal...", "pics": null}}, {"review": {"des": "This is an awesome place! My friends and I went for tacos and they were absolutely tasty! I loved their mango passion margarita! Only downside is it's not suitable for kids/babies, as there's no changing station in the bathroom. The place is also is a little noisy, with everybody trying to talk over the other groups present. But all in all, I'd def visit again, with only adults this time. Great hangout spot for friends!", "pics": null}}, {"review": {"des": "Food isn't consistent. Third time here. Was great the first time. Al pastor was great the first time but terrible today. Street corn was also great the first time but dry and under seasoned today.", "pics": null}}]}