{"name": "takito-kitchen-chicago", "reviews": [{"review": {"des": "Verdict: A must try; Taco Tuesday, happy hour til 7<br><br>Atmosphere / decor - 5<br>Service - 5<br>Food - 5<br>Location - 5<br>Value - 5 (on taco Tuesday during happy hour)<br><br>Overall 5<br><br>I love this place! It's great for artisan tacos and everything is gluten free. The margaritas are half off during happy hour and all day Thursday. I've tried all but the seasonal and classic margaritas and they're all good (I get them skinny which is no simple syrup added). The cucumber is refreshing, the pineapple is tropical, the tamarindo is tasty, and the fuego is delightfully spicy. <br><br>As for the tacos, here's my personal verdict. <br>Fish tacos- AMAZING<br>Shrimp - Good but not my favorite <br>Steak - Tasty (not fatty)<br>Pork belly- Delicious, a little fatty<br>Lamb- Tasty as is (not as good without cheese)<br>Beef barbacoa - YES, my favorite<br>Mushroom - Tasty (the tomatoes add a nice flavor)<br><br>This is definitely a place I've started to frequent and definitely recommend. They also have a sister bar in west loop.", "pics": null}}, {"review": {"des": "Atmosphere: cute decoration and spacious dining space. their bar is open and faces the dining space, which is kinda neat. <br><br>Food: love love love their tacos!! probably because they have the both lamb taco and pork belly, which are my favorite type of meat. The lamb taco is more like a lamb sausage though, but you can still taste the gamy and earthy taste of lamb. Pork belly ones have a thin slice of pork belly in it and some crispy asian noodle type of thingy on top, which gives the taco a variety of texture in one bite:D The price is lower than velvet taco for sure, but you need to order minimum two with the same filling. Better to go with a group so that you can multiple. <br><br>Service: friendly and attentive. loved it.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DiLfLDSpAiMcN4tS7lP4qQ/168s.jpg", "caption": "Salsa with chips"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ywicLvesiQ-gkxn1LnlYDA/168s.jpg", "caption": "Up: pork belly taco Lower: lamb taco"}]}}, {"review": {"des": "My best friend and myself went here on a Sunday afternoon for brunch. <br>The good part - the complimentary cinnamon toast crunch is really good and the bottomless mimosas were amazing especially for the price. You're not left waiting for a refill once you've finished a glass.<br>The free shrimp ceviche we got for checking in was great also <br>The ok part - I got the French toast (pretty good) and while the preserves were something different for me, I wish they would've had syrup to go along with it. I also ordered a side of chorizo sausage and didn't care for it.<br>The bad part - my friend ordered the chilaquiles and they came out on the colder side. They remade her food but this time when it came back it was really bland. She didn't eat most of her food.<br>Overall an ok place with great mimosas if nothing else.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rPTrYUmphkLYoOH7WQ6idA/168s.jpg", "caption": "Daily Menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0W9IHxVMWwJsa-7HrHptSw/168s.jpg", "caption": "Brunch Menu"}]}}, {"review": {"des": "Takito, recently added to the shortlist for brunch. I love the contemporary industrial interior with the intimate-casual feel. <br><br>We enjoyed the avocado pine nut purée which was pleasantly spicy. The coffee-braised beef tacos were delicious! Everything we had was well presented and well prepared. <br><br>Great service received!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zwSr0I6OqsEC1KYCeN-O0A/348s.jpg", "caption": "Inside"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GPoopu4ORfbSG1halptIzQ/168s.jpg", "caption": "Breakfast tacos w/ coffee braised beef"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Bq5uYRxHBCuBBQKGPoKMgw/168s.jpg", "caption": "Cucumber margarita"}]}}, {"review": {"des": "I've had tacos here in the past and they are good. The margarita list has a great variety. Tonight I had the lychee margarita and my friend had the serrano pineapple margarita. We shared the hearts of palm salad and it was awesome! <br><br>Cute patio with light strands hung up to set the ambiance. Great date spot.", "pics": null}}, {"review": {"des": "$10 Weekend Bottomless Mimosas until 2:00pm: COUNT ME IN! This place is lively. At first encounter, the place is narrow and casual. Once the Host seats you, you'll see that majority of the noise level comes from people deep in conversation. Weekend Brunch is until 2:30pm, and worth it!!<br><br>We ordered the chips and salsa (sadly, the chips were stale and the spicy salsa was just mild), the Pork Belly Slope ($8.5 sunny side up egg, corn masa cake, flavorful salsa, queso- had a lot of filler, but the pork belly was still very flavorful), and the Chilaquiles ($7.5 amish chicken, salsa, queso fresco, scrambled eggs, side of house potatoes- lots of different textures, right amount of flavor). The tacos here are very popular, as well. <br><br>We found this place via A la Card. The prices here are still reasonable. Will return for the tacos, $10 weekend bottomless mimosas, and quality service!!", "pics": null}}, {"review": {"des": "Absolutely amazing! The tacos are unique and phenomenal, they're the best I've had anywhere in the city. The chips and salsas are also amazing! The mimosa brunch deal is especially fun ($10 bottomless) and the servers aren't shy about refills. This is definitely one of my favorite restaurants in Chicago", "pics": null}}, {"review": {"des": "VALERIE was our great server; taking care of my beautiful dog and me. Very attentive and fun. In fact we often walk by the restaurant and she talks to us, until finally we sat at the patio for a visit.<br><br>lovely patio.<br><br>delicious food.  had four tacos and some kinda pistachio salsa and chips. All delicious.  Astro loved his skirt steak and pork belly too.<br><br>Will return.", "pics": null}}, {"review": {"des": "Went here on a Tuesday night for their $3 tacos. It wasn't busy so no need to make reservations.<br><br>I got the coffee rubbed barbacoa, fish, and chicken al pastor. The chicken al pastor was okay. I like it better with steak or beef. It was juicy though. The fish was pretty okay. The barbacoa was my favorite. It had a lot of flavor. It was cooked well.<br><br>I liked how you can order a la carte. The service was pretty good. They're kind of slow but they're attentive.<br><br>I got the tamarindo margarita for $12. It wasn't that great. I couldn't really taste the flavor and it was watered down. <br><br>Everything was just okay. I would probably go across the street for their $2 tacos next time lol", "pics": null}}, {"review": {"des": "Takito Kitchen is good enough if you live close but it's not worth making a special trip for. <br><br>We stopped in for taco Tuesday ($3 taco specials), they had plenty of seating available, seasonal margaritas and friendly servers.  The menu is very nut heavy but our server was helpful with helping me figure out which dishes could be altered to remove the nuts.  We settled on Avocado rice without pine nuts (my favorite dish of the night), chicken al pastor tacos, skirt steak tacos, and lamb merguez (this one has pistachios cooked into the meat, but I hear its delicious).  <br><br>Check it out if you're in the area or have large group since its easy to order family style!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QcXfS3B309CFt8LmOT331g/348s.jpg", "caption": "Avocado Rice"}]}}, {"review": {"des": "Yo, the dinner menu is 100% GLUTEN FREE! Not sure why people are claiming to get sick. I ate like an obese Denise last night. It was SO GOOD! It's not super expensive, but it's not cheap, either. But, it's totally worth every penny I spent. For two people, the bill was 93 bucks and some change. That was for five margaritas, one specialty cocktail, two shared plates, and two skirt steak tacos. So fricken worth it! The skirt steak tacos were awesome, the margaritas were insane. The music was fantastic. I will absolutely be back. Allergy warning: the breakfast/brunch menu DOES have food that is not GF. Dinner is all GF. Apps, salads, tacos, etc. GF GF GF! Have at it, my celiac friends!", "pics": null}}, {"review": {"des": "Came here for dinner on New Years Eve and it did not disappoint. What I loved about this place is the way their menu is set up. It's ideal for having a but with your honey or a friend. With lots of shared plates that are about the size on generous appetizers and tacos ordered in pairs, you can be sure to get just the right amount of food to satisfy. I thought I prices were pretty reasonable as well. The dishes were creative and fresh tasting.  Lots of good options for meat eaters and vegetarians alike!<br><br>Don't forget to try one of their amazing drinks! The ambiance inside is great. It's a small place with tables running along one side and one sided bar across the other giving it a cozy feel. Fair warning though, don't sit too close to the door during the winter or you may get an unpleasant blast of cool air!", "pics": null}}, {"review": {"des": "NOT GLUTEN FREE ANYMORE. If you're celiac or have a serious gluten sensitivity, stay away. Unfortunately the new management has made some changes to their brunch menu that have caused cross contamination to become an issue at what was once my favorite taco place in Chicago. <br><br>My celiac friend and I both got glutened at Takito more than 5 weeks ago. I have left 2 emails, 1 phone message, and an instagram message inquiring about the issue and trying to figure out what happened, very kindly. I also spoke with the manager over 3 weeks ago and he assured me everything was gluten free and he'd get back to me and did not (at which point I called back and attempted to reach out more).<br><br>It's one thing to say you're 100% gluten free, and another thing to keep a safe cooking environment that is free from gluten/cross contamination. Takito, please stop lying to your patrons, this is dangerous practice! Either take the gluten out of your kitchen, make special arrangements for Celiacs and alert them to order specially, or STOP saying you're 100% gluten free.<br><br>After this issue I learned of 5 other Celiacs who got sick there since the new management change. I learned they are serving French toast, using flour tortillas, AND frying non-gluten free items in their fryer. This is a recipe for disaster. Unfortunately, I won't be returning until I am confident they have resolved this!", "pics": null}}, {"review": {"des": "My friends and I had the chicken tacos, fish tacos, pineapple habanero salsa and shrimp ceviche. The Tacos were good and so was the salas. I also had the pineapple habanero margarita which I didn't taste a trace of pineapple. The service wasn't the best. The server had the nerve to touch one of my chips to point out it had a lot of salt and I should eat that one. (Weird) her attitude wasn't the best but the food was good. I won't be returning.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1ZzU4jCDFZk58Wjk7mePSQ/168s.jpg", "caption": "Habanero salsa and chips"}]}}, {"review": {"des": "Celiac? This is your place. 99% gluten free kitchen with the exception of Sunday brunch...they serve french toast but practice safe handling. Otherwise, the menu is 100% gluten free and their margaritas pair just as need be with their mexican/latin american fare.<br><br>We dined here on a Friday night at 5:30pm - place was nearly empty. By the time we left at 7:30 it was a full house. Our group shared every taco on their menu, plus their salsa special that evening. I had their tamarindo cilantro margarita - WOW! And the way they salt the glass is simply brilliant. My favorite taco was the pork belly, the lamb was a close second. Their tortilla chips are salty, big bite delicious!<br><br>Booth seating, plus high and low-top tables with wood seating. Their alcohol is shelved as a bar but fully exposed along the walk way. Large, fun murals entertain and their bathroom 'labels' are controversial; clean bathrooms and overall clean establishment. Wait staff was timely and friendly.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GHdarbQcv2oh_sA8zrrXDA/168s.jpg", "caption": "lamb merguez"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/x6gC0bbVi3h__j3KGNl16w/168s.jpg", "caption": "pork belly taco"}]}}, {"review": {"des": "Pro-tip: check in on yelp for a free shared plate. We got the queso. Interesting take on queso, it had pine nuts and mushrooms. <br><br>Pro-tip 2: tequila Thursday! Half off margaritas all night. So a small is $6 and a large is $12. I tried the tamarindo margarita which was probably my least favorite of the night. Also had the pineapple Serrano which was rly good. The seasonal flavors- coconut and strawberry mint - were also rly good. The other seasonal flavor lychee was just ok. Decently strong! <br><br>For the tacos, I got the lamb one and the pork belly one. The lamb was labeled as the manager's favorite and the pork belly was labeled as staff's favorite. I'll have to come back to try the fish taco which is labeled as the most popular. I think the $4 price tag is a bit steep per taco but at least they were good. <br><br>Overall, a good experience. I'll have to come back for the $10 bottomless mimosas on the weekend!", "pics": null}}, {"review": {"des": "A friend of mine had her birthday brunch here and it was wonderful. A bit crowded as she had about 50 people, but the staff at Takito was great and made sure our endless mimosas were truly endless! We did pre-order some dishes so that they had enough ingredients in stock and we didn't have to wait too long for our food, which was a great idea with such a large party.<br><br>I tried their french toast, pork belly sope, and chicken chilaquiles. The seasonal preserves and cinnamon whipped cream was the perfect combo for the french toast although it was a bit tough. The chicken chilaquiles was a generous portion packing a lot of flavors. My favorite was definitely the pork belly sope. The pork belly simply melt in your mouth paired well with the corn masa cake, egg and salsa. <br><br>I know my friend had an easy time working with them and they were accommodating with her. It was a great way to kick off her birthday!", "pics": null}}, {"review": {"des": "Best taco joint/pub in Chicago!!! Great selection of flavorful tacos and salsa. Always very fresh. They even make their own tortillas and chips as well as hot sauce. Their menu changes a bit every few months. I love love love their beef barbacoa as well as the lamb sausage tacos. Their fish tacos  incrusted with coconut won't disappoint you. Friendly staff. Jason is our favorite waiter and general manager Jaime is awesome and super attentive. Highly recommend this restaurant. Can't wait to go back.", "pics": null}}, {"review": {"des": "Came here for taco Tuesday - tacos $3 each! We ended up getting margaritas, shared plates, tacos, and dessert, but i wasn't too impressed by any. The shrimp ceviche was the best item, but had a lot of arugula which overpowered it a bit. The margs didn't have much flavor too them, and the tacos were mediocre - although they were out of the pork belly which is their house favorite. Server was friendly but the kitchen was a bit slow. Not a bad place overall, but definitely wouldn't say it's my favorite taco joint in the city", "pics": null}}, {"review": {"des": "I met two of my girlfriends at this joint on a Tuesday afternoon. Gorgeous little place, it's small but very pretty. There is a patio outside but we decided to sit inside, in the back were they have a space  that natural light shines through. <br><br>Anyways, the food was so freaking good, I was actually surprised. I expected it to be some fancy Mexican fusion joint that I would think was overpriced. It was a little pricey but it was worth it. I believe we all tried the hibiscus water which was tasty and different. Make sure you get a side of regular water with that.<br><br>Again, because of the bomb friends I have, we're able to order the whole menu (pretty much) and share. We ordered chips and salsas, three sisters polenta, avocado rice and three or four types of tacos. Crispy Fish tacos, Chicken Al Pastor tacos, Coffee Braised Beef Barbacoa tacos and Lamb Merguez. My favorite, the beef barbacoa and fish tacos. The hibiscus tortilla that came with it was so different and SO SO good!<br><br>Service? Meh, a little pushy and annoying. We just got our food, can I f'n taste it before you ask how it is? Thanks. <br><br>No doubt I will be going back if I'm in the area, I might even make a random trip out there.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zFBg4YBZ6rxk556f3K9pEw/168s.jpg", "caption": "Closer look at fish tacos."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/t2Q2memXqYWbi3HGXhvejA/168s.jpg", "caption": "Fish tacos."}]}}, {"review": {"des": "Takito is known for their tacos, but don't pass up this awesome salad. So much freshness in this salad. It was light and tasty with the tartness from the citrus ingredients pairing well with the creaminess of the avocado.  The hearts of palm were quite different for protein as you don't see them on menus every day. I have no problem recommending this salad!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9h3qq9aq3gg3xPSc22ntwA/348s.jpg", "caption": "Hearts of Palm Salad // jicama escabeche, avocado greens, lime vinaigrette, fennel mandarin oranges, sunflower seeds"}]}}, {"review": {"des": "Super awesome tacos and margaritas.  We had a large group and asked the waiter for recommendations. He said he can just order for us and he totally nailed it.  We had a wide range of tacos and all of them were awesome.  The fat margaritas got us ready for a night out and the free chips were top notch as well, rounding out an excellent experience.", "pics": null}}, {"review": {"des": "Tacos are good on any day that ends in the letter Y. Not your average taco joint and I found the tacos a little dry, but they were good.", "pics": null}}, {"review": {"des": "Very Unique Tacos. The hibiscus corn tortilla on the fish and chicken tacos was amazing it's self. With the taste of pineapple. The steak taco as well was cooked to perfection with a big slice of avocado. I'm a meat eater so Steak was my favorite one. Definitely coming back. Also with a great waitress Terasita made the experience that much better. Also Taco Tuesday just $3", "pics": null}}, {"review": {"des": "Had a birthday dinner here with family and was well taken care of. The best part of our experience was the customer service. The staff all had a smile and seemed to enjoy their time. Our food came out timely, well-presented, and was flavorful. Favorite dishes were the lamb merguez and the barbacoa. The price was a little higher for tacos but the service and experience covered it.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nd5OzCpxgD-RY6C3UH2AJQ/168s.jpg", "caption": "Pork Belly Taco"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZrSfCs4-7wIOQXJWkG33qg/168s.jpg", "caption": "Coffee Braised Beef Barbacoa and Lamb Merguez"}]}}, {"review": {"des": "Hidden gem for a no-frills Sunday brunch! <br><br>Bottomless mimosas for 10 bucks with friendly, attentive service in a lively retro warehouse vibe. We had the chicken omelet which was delicious with spiced cheese and a healthy amount of meat. Breakfast tacos could use a sauce to moisten the dish but the chorizo omelet was unusual with delightful flavorful. Our server was informative and offered spot on recommendations with a bit of history on South American dishes. Light fixtures and decorations were a bit dusty but if you are into a good deal for good food it will not matter. There is an open kitchen for transparency and the bathrooms were clean and smelled nice. They do charge for hot sauce and the plates are only large enough for a single belly but if you don't care about the extras, you are getting a bargain. Music was the perfect volume for inspiring a \"Sunday funday\" spirit without drowning out conversation. Looks like they have great specials on tacos and margaritas throughout the week. If you are young and hip with hungry tastebuds looking for a spot that is reasonable in an expensive city, you should come here.", "pics": null}}, {"review": {"des": "We def will be back however the hostess(2/14/18) need training on accommodations. The food was fresh and gluten-free. We had fried chicken tacos, pork belly and fish tacos. They were all delicious.<br><br>Joey was a fantastic server. Variety of music in the background which was enjoyable. They have great weekday specials. Be back to try their margaritas and other food items.<br>The owner was personable, introduce himself and asked which taco we enjoyed the most.", "pics": null}}, {"review": {"des": "This place converted me into a taco lover. It used to be just a meh thing for me (mostly because they seem so unhealthy - but these ones aren't greasy) and don't get me wrong I'm not a taco novice (I'm from San Diego before moving to Chicago). My favorite is the fish taco! With a hint of coconut and crunch of the fish it is full of flavor and punch. The meat is always substantial, you get a big slab of juicy pork belly (not just fat ;)). Remember that Tuesday's are $3 for all tacos and Thursday's are $6 margaritas (always made of fresh ingredients).", "pics": null}}, {"review": {"des": "Nothing can beat $10 unlimited mimosas until 2pm on the weekends! My favorite brunch dish here is the chilaquiles! It's so filling", "pics": null}}, {"review": {"des": "My girlfriends and I stopped by over the weekend and we were pleasantly surprised! Everything was delicious from the mushroom tacos, crispy fish tacos, corn and avocado rice! Double bonus- we ordered a pitcher of margaritas and we were able to get several glasses a piece! I removed one star because service wasn't the greatest, we had to flag our server down a few times. I'm certainly planning to head back when I've an opportunity.", "pics": null}}, {"review": {"des": "Loved this place... we were there last Saturday at 5pm and had a great experience.  <br>Service was top notch, every employee was friendly and waitress was awesome!!<br>Owner was in the building and was extremely friendly.<br>Food....  wow!  Tacos are awesome! Tried all but mushroom taco, no favorite... all were great!<br>Drinks.... also just as good, I had micheladas and they were some of the best I've had.  Wife had 3 margaritas, she tried pineapple, cucumber, and fire margarita!<br>Will definitely be back real soon", "pics": null}}, {"review": {"des": "I had heard great reviews about this place but do not agree at all. I was there last night around 7pm for some apps and margaritas, the place was not packed-half full. Our service was extremely slow. Food came cold. Ceviche was dry. We waited more than once over 15 minutes for our margaritas. I feel like I was also over charged for them. I asked to bump up to Don Julio and somehow was charged $30 for a margarita. The worst part is that the waiter didn't even explain that it would be such a huge charge. Instead, when it came time for the check he said \"let me explain the check\". That's just shady. I do not recommend this place at all.", "pics": null}}, {"review": {"des": "Every time I have been to Takito, the experience compounds on itself and just keeps getting better. I am obsessed with the polenta and the bottomless mimosas. An absolute must order every single time. <br><br>Other necessities that are great for sharing:<br>Shrimp Ceviche<br>Sopes<br>Esquites<br>The pineapple habanero salsa with the escabeche<br>Fish Tacos<br><br>Pretty much anything you order here is going to be a grand slam. Everything is gluten free which is great for my Coeliac friends to not worry about cross contamination.<br><br>I do suggest making a reservation especially on the weekends. The last time I was there, this Saturday 21 April, the owner very graciously gave us some starting mimosas as we were waiting, and before our meal was up, the restaurant ran out of champagne. This was probably just a sign from the universe to chill a litte, but our wonderful server Marlon took the mimosas off the bill. The people at Takito really care about making their customers happy, and I adore coming here.", "pics": null}}, {"review": {"des": "Went on a Saturday night for drinks and food. Party of 3, we were able to get a table right away around 7:30. If you like tequila/margs, I definitely recommend the pineapple serrano margarita (I had a few ). Tacos were good, you have to order a minimum of two of a kind for them to make it. Biggest complaint would be about service. We had two people attending to us, which was confusing. Our first server never asked if we wanted food. We weren't in a rush, but after not being able to get his attention for about 45 minutes (he at one point told us \"just a moment\" and never came back), we placed an order with a different waitress. It wasn't even that busy. Not sure if he realized he had been neglecting us or if this was just to be nice, but he dropped by our table a little before we asked for the check and gave us a round of free tequila shots. If we were on a stricter agenda, I would have had a bigger issue with the service. But overall good spot and reasonably priced, would probably come back.", "pics": null}}, {"review": {"des": "What can I say- best servers ever. They get slammed so be patient. I dream about the fish tacos (I always order extra coconut custard on the side so I can add more). Please bring back that hibiscus ghost pepper salsa!! Your other ones are good but it was the best!<br><br>Oh and the cowboy coffee", "pics": null}}, {"review": {"des": "Such a fun restaurant for a large group!! The music is on point and Carlos is a phenomenal waiter attending to all of our requests. Highly recommend!!", "pics": null}}, {"review": {"des": "Trendy, tasty, but teenie weenie portions.  Everything Ala cart, baby sized tortillas, minimum order of two pair of the same kind ($3.50 - $5.00 apiece).  Can't they just say, $9.00 for two tiny tacos? I guess that doesn't sound as good.<br><br>Tepid water served in \"trendy\" bottles.  No free anything. Asked for hot sauce and there was an additional charge for it on the bill! Don't come hungry.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9i2d_i-J6t3wclFs2NI7ow/348s.jpg", "caption": "Trendy, tasty teenie weenie portions."}]}}, {"review": {"des": "The best tacos place in the neighborhood! I've been to other popular taco places in Wicker Park, but have to say Takito is the best! Their lamb tacos, steak tacos are fantastic. Strongly recommended", "pics": null}}, {"review": {"des": "Honest review: not my fav. I think antique taco was better then takito kitchen. I wouldnt come again because there are better tacos then this place. Bien truchas is still the best though, In regards to flavors/appetizers/ambiance/service/desserts. <br>the service was amaizing!! Our waiter was so nice and polite and full of energy! One of the best waiters i ever had she needs a promotion. The best dishes were: lamb merguez taco/ pork belly taco/crab taco/steak taco. If anybody has any good taco suggestions tell me n ill try <br><br>Hearts of palm salad $7: its a good salad not the best not the worst. The hearts of palm were really tasty, but there wasnt alot of it. I liked the oranges that added sweatness to counteract the bitter greens. I liked the nuts which added crunchy hate jus a one note salad. The pickled jicima needed to be pickled longer more vinegar would have helped. I didnt like the dressing jus tasted like vinegar.<br><br>Three sisters polenta $8: this was okay not my fav. I like my polenta to be supper creamy and rich this wasnt. I like my polenta really cheesy this one just had chunks of cheese. The bacon in this was way to crunchy like it was supper hard so when u bit it, it felt weird and unpleasant. I liked the addition of the pickled peppers just put more to add more spice and acidity. The frozen corn a cool idea for crunch. I wouldnt order this again. N the chips were meh to thin n not that flavorful <br><br>Different tortilla flavors: i thought putting cool ingredients in the taco dough themselves was a good idea, but i tasted the tortilla by it self and it didnt taste like anything like it was labled as just tasted like a plain tortilla. I think if they put more of the ingredient in the tortilla maybe you could taste it so that was a fail.<br><br>Fried chicken taco $3: this was probably the worst taco of the night. The batter was way to hard like to the point where it would hurt ur teeth. There was no seasoning on the chicken was very bland. There was no wow factor<br><br>King crab taco $5: if u love butter and crab u will love this!! I liked the addition of the tomato to cut through the richnesss. Only complaint put more crab plz <br><br>Shrimp taco 4$: didnt like these. The shrimp were really tiny and really overcooked. There was no wow factor was really disappointed <br><br>Steak taco $4: really good would order this again. The steak was cooked beutifully and was seasoned well. The chimiruri cut through the richness of the steak. The beans were really smokey and flavorful. Only complaint is theres a strong rosemary flavor try not to put so much it is overbearing<br><br>Fish taco 4: not my fav. I didnt like the flavor of the fish it was really bland. theres suppose to be a sweet coconut flavor really didnt taste that. All i tasted was a bland slaw wouldnt ordet this again<br><br>Coffee braised beef barbacoa $4: this was alright. The meat was tender and flavorful you could taste the coffee but there was nothing special about it honestly wouldnt order again<br><br>Pork belly taco 4$: this one was really good and rich i would order this again. I loves the combination of the pinapple and the salty pork belly so good. Only complaint fry the pork belly plz <br><br>Lamb merguez 4$: best taco of the night. The lamb was so flavorful like omg i wish i ordered more. I liked the addition of cheeze makes it even better would order this again.<br><br>Flan $5: i usually dont like flan but this was really good. The flan had a cinnamon flavor to it not just one note with vanilla. I loved the crunchy graham cracker on top plz put more! The sauces were really good too i would order this again", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_ZkmFbUw_hovvNFZDjU3NA/348s.jpg", "caption": "Cranberry margarita $12 not my fav"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ljKceL8u11E1_G-brukzkw/168s.jpg", "caption": "Pork belly taco (left) coffee braided beef barbacoa (right)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/981yRCCBnEweYr7dQ5Z6cw/168s.jpg", "caption": "Heart of palm salad $7"}]}}, {"review": {"des": "This is the best place in the city for bottomless mimosas, hands down. The food here is delicious and made freshly. If you are coming to brunch, I highly recommend the breakfast tacos. Our waitress, Val, was hospitable and gave us excellent recommendations. We will be back and cannot wait!", "pics": null}}, {"review": {"des": "Everything from the staff service and atmosphere was fantastic. I highly recommend stopping in. My new favorite brunch spot!!", "pics": null}}, {"review": {"des": "I've been to Takito twice now, once for dinner and once for lunch. Both times I thoroughly enjoyed my meal, but the service was a little slower than I usually prefer. Especially at lunch, it seemed like they needed another server working. Our server was very nice and doing a good job, but she could have used some back up!<br><br>The bacon polenta is a must order- my gosh is it delicious. It has pieces of corn and crispy bacon inside and it's incredibly creamy. The tacos are all good- my favorites are the Barbacoa and Fish! The food definitely deserves 5 stars!<br><br>***Review update***<br>My boyfriend and I came in again for lunch this past weekend and we're blown away with amazing food and service. Takito got a new chef, so some of the tacos have a coastal inspired flair now, and oh my gosh we're they delicious. King Crab tacos.....ABSOLUTE MUST!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uu-0MNiTS2KSso1bHbKymg/348s.jpg", "caption": "3 words: KING CRAB TACOS!"}]}}, {"review": {"des": "Tacos were on point here. Had the pork belly and the coffee braised barbacoa tacos which were both exquisitely delicious. The pork belly was by far the best. It was so flavorful. The tortilla was freshly made. Would recommend the queso fundido also. Very friendly and helpful service/waiter. She gave good recommendations. Not too bad happy hour deals too.", "pics": null}}, {"review": {"des": "Delicious, decently priced for the area, and great gluten free options. Mimosas are only $5 or $10 for bottomless! The only downside is that it gets pretty loud on the weekend. They have 2 highchairs so we get there right at 11 am on the weekend so we can snag one for our daughter. There are also some bench seats that work for little kids.", "pics": null}}, {"review": {"des": "First off this is not your average taqueria. This is a more modern upgrade take on the average taqueria that is sweeping across trendy areas in  Mexico. I experienced this trend on a recent trip to the Guadalajara region. I loved the location, which is a re-purposed auto car wash. Keep this in mind as you walk in and quickly notice the narrowness of the layout. Bartenders are concocting drinks with their back to you because of the lack of space. Needless to say, the place has character. Right off the back, I loved the layout. As for the food and drinks, they were both spot on delicious for a reasonable price. I enjoyed their take on traditional style taqueria food. The group I was with began with the corn esquites which was a nice version of Mexican street food elotes. Instead of boiling the corn, they grilled it. The grilling slightly carmelized the sugars inside of the sweet corn where it was charred. We also had the shrimp ceviche which was delicious with plenty of arugula. We then moved on to the tacos. We had the al pastor, fish and lamb merguez. All of them I am glad to report were delicious. The latter one was the most interesting because lamb merguez is not considered a traditional filling for tacos. I happen to be a fan of lamb merguez, and hey why not? A tortilla is basicly a flat bread. What can bread be filled with? Well actually the sky is the limit, which is why Korean tacos were a top food trend a few years back. Korean staples in tortillas? Why not? Back to the merguez taco, it was delicious served with a small amount of goats cheese. <br>How were the drinks? Even if you choose not to eat here, it is still worth coming to have their delicious cocktails, such as the calienta a fuego, cucumber margarita, and the mezcalychee. If by chance you still have room in your stomach, after the tacos, order the delicious flan. I am a huge fan of egg based desserts like flan, creme brulee, or crema catalana. When I first laid eyes on the small portion of flan I thought to myself, that's it. But looks can be deceiving because it was very rich and delicious.", "pics": null}}, {"review": {"des": "Here is what went down Saturday night. Wr came in during street fest and sat at \"the bar\"  which is more like \"the counter\" in some very uncomfortable metal stools. The avocado app was very tasty l have to recognize, however the tacos we order: fish and steak where cold, super small, the tortilla was rubbery and overall l can honestly say were pretty terrible \"tacos\" if you can even call them that. They were aweful!  The matgatita l had was simply okay.  I really would have talk to a manager had it not been the place was crowded to due to fest. <br>Indeed very disappointed. <br>Skip it. Nothing special here. Sorry.", "pics": null}}, {"review": {"des": "The coffee braised tacos are to die for & they have the best hot sauce I've ever had! This is the cutest little place to meet up for a quick dinner & drinks. I met a friend from Bumble bff here and it was the perfect spot to chat with someone new.", "pics": null}}, {"review": {"des": "DELICIOUS!!! We saw a review on a local tv show and always ready to try new taco places so we checked out.  <br><br>This was a great choice, im big on customer service and we were greeted with smiling faces on an extremely hot day.  The owner saw us asking questions to the hostess and jumped right in with recommendations.  He and the hostess were very descriptive and made it easy for us to choose to add on sides.<br><br>The tacos had soo much flavor.   My hubby had the delicious fish taco & I had the chicken in the hibicious infused tortilla.  They were both tasty but the fish taco was the best.  It was like a party on my tongue.<br><br>We came from hyde park and would drive there again just for the fish tacos", "pics": null}}, {"review": {"des": "Takito Kitchen was a perfect meet up with two friends, especially for one who had just returned from Paris and was craving some spicy food.  We came here on a weeknight, and it was a pretty chill vibe.  There is a teeny tiny patio, but we chose to stay inside.  They do take reservations, so get those OpenTable points!<br><br>The food was outstanding.  For only three people, we ordered a ton of food.  You absolutely must try the polenta, the trio of salsas and chips, and of course tacos!  Skip the avocado rice - it was good but save that stomach real estate for something else.<br><br>Crispy fish tacos with toasted coconut on handmade hibiscus tortillas.<br><br>The end.<br><br>OK, I'll tell you more, but that's all you really need to know about Takito Kitchen.  Those tacos were to die for.  I really enjoyed the braised beef tacos too.  Order everything and SHARE!  I mostly prefer to do my own thing when dining out, but TK is ideal for sharing.<br><br>We found the service to be a little bit annoying and uninformed.  Our waitress was overly pushy about ordering appetizers, even though we didn't hesitate to order a bunch of things from the start.  I asked if they could make a virgin mojito and was told, \"last I checked, we didn't have all the ingredients.\"  Mojitos ARE on the menu, so it's not as if I pulled the drink order out of my ass.  She then encouraged me to try the hibiscus agua fresca.  It was great, but there was just no initiative to walk a few steps and tell me whether or not they had any mint.  There was no follow up until my friend asked her again and - voila! - there was my virgin mojito.  <br><br>Get the fish tacos.", "pics": null}}, {"review": {"des": "Just okay. I wouldn't do it over again.<br>My group tried every taco on the menu and the only good one was the lamb and second favorite for the coffee beef. The rest were just flavorless and boring. <br>They did make a mean cucumber margarita, though! The drinks in general were praised well but the food, not so much.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mTQR9r0cUfdn9F4cMBQatA/348s.jpg", "caption": "Cucumber margarita"}]}}, {"review": {"des": "This was a pretty cool find.  We were walking down Division Street and popped into the patio of this place.  We were really just stopping to grab a small bite and drink a couple drinks as we made our way down the road.  Good thing we stopped in.  It was a great find.  They do tacos and they do them well.  We had both the skirt steak tacos and the fish tacos.  The fish tacos were the best fish tacos that I have even had.  I don't like fish either.  So if you don't like fish, you should still try these tacos.  They were great.  Chips and salsa was awesome too.  They have several choices of salsa.  Get the hottest one if you like hot salsas.  It's not crazy hot, but it is tasty.", "pics": null}}, {"review": {"des": "I'll start this review with the precedent that I have had many amazing Tuesday evenings and the staff that works on Tuesdays is amazing. However this evening I showed up at 10:30pm on cinco de mayo to 3/4 empty restaurant asking if we could place an order only to be told that the kitchen had shut down. What Mexican place shuts down 30 mins early on cinco de mayo?!? <br><br>Update: <br><br>This owner is obviously delusional.<br><br>Firstly, A girl was working the front door - so no sir you weren't working the door on May 5th at 10:30pm. <br><br>Secondly, your response reinforces the sentiment of my review and paints a very clear picture of the type of restaurant owner you are. Perhaps instead of accusing a customer of lying, you figure out what went wrong on the night in question. <br><br>Facts are facts. Now you can spew all the alternative facts you want but my friend and I did indeed show up at 10:30. Your hostess asked<br>the kitchen if they were still serving, and the kitchen said no.", "pics": null}}, {"review": {"des": "I came here on 10/22/16 to help my Diva friend celebrate her birthday with a group of family/friends.  I was fashionably late (it was a little challenge trying to find parking due to the Cubs being in the playoffs and a bar nearby).  When I got there, I joined the group.  I was very interested to see what the Cucumber Margarita tasted like.  I must say it was better than what I hoped for - so refreshing and just a great flavor and with the unique salt on the rim, I just loved it.  We had some large tortilla chips on the table with different dippings to pair with that were delicious also.<br><br>After awhile, we ordered our food.  I ordered the Crispy Fish Tacos.  3 came in the order but you can order 4 also.  My tacos were only okay to me but grant it, this was based on my taste preference - it had a little \"kick\" to them with a slaw dressing on them.<br><br>I enjoyed myself while there with good conversation and environment.  The manager came by  and she was very nice.  The establishment came with a birthday dessert for the birthday girl and sang to her which was nice.<br><br>As we were preparing to leave, the manager surprised us with bringing all of us glasses of champagne to celebrate which was sweet because we were celebrating with my friends birthday but also the Cubbies won the game to advance to the World Series that night also.  Win-win!  Most champagne I don't like because it's never sweet enough but theirs was absolutely DELICIOUS!<br><br>We thanked them for such a great night of service to make the both the birthday girl and the group feel special.  Note that we also were each given a card to return for a free drink which was pure LOVE because I want another one of those Cucumber Margaritas!!!<br><br>A few days later, I called them to ask about the champagne they served.  I actually got to talk to the manager who was there that night.  I complimented her on the service we were given and I enjoyed speaking to her.  She thanked me for taking the time to call to inquire and to share the compliments as she told me that it's important for their restaurant to know that people are having a GOOD time.  That stuck so positively with me.  It was also great because I thought they are only open for dinner but she informed me that they have an awesome brunch so I promised her I will be back to experience that and because I am true to my word, I will be back REAL soon!  Thank you Takito, you've impressed me greatly and have scored an \"A\" in my book!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xi39orP7Ttn7QO6Mkh0mHQ/348s.jpg", "caption": "Eye catching wall art."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/i926Kq74vywGxyl-YA4iaw/168s.jpg", "caption": "Cool light fixtures!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jafBDYpbpAvfL82mfrTSmw/168s.jpg", "caption": "Crunchy Fish Tacos"}]}}, {"review": {"des": "Great place <br>The only downside is that waitress took too long for a simple drink. The Bloody Mary was amazing as well as the margaritas. I will be visiting again", "pics": null}}, {"review": {"des": "Amazing brunch! Request to have Valerie as your waitress cause she's not only the best waitress in the game but also the nicest coolest girl in the greater Chi area.<br><br>Mimosas are baller and made with fresh OJ, bloodies are and I quote \"the best bloody I've had\"--my friend Claire. <br><br>Also get the corn dip thing.", "pics": null}}, {"review": {"des": "We fortuitously stumbled upon this place for lunch as we were passing through Chicago and the first place we saw on Yelp was closed for lunch!  Great, clean atmosphere (I appreciate clean mirrors, especially when used as decor)!  The waiter, Marion, was very friendly and authentic, and gave such compelling recommendations of his favorites that we went with them!  The highlight of our lunch was the hearts of palm avocado salad...perfection of flavors, color, and textures!  We also enjoyed the pork belly tacos as well as the coffee roasted beef tacos, again great flavors and just the right amount of accompanying ingredients!  Will have to find an excuse to stop back through Chicago!", "pics": null}}, {"review": {"des": "Amazing for brunch. We went on Easter Sunday with a reservation and they weren't too busy, they let us stay a whole 3 hours and kept our $10 bottomless mimosas going the entire time! Our server was v friendly, the food was delicious, and the mimosas were a great time. Will most definitely be back.", "pics": null}}, {"review": {"des": "Im an authentic taco lover, give me old school and watch me chow down. BUT THIS on some other level right here! Modern take on a classic.. that works. The fish tacos and barbacoa have enough flavor to knock out any heavyweight. Modern look with a modern take! Yup 5/5", "pics": null}}, {"review": {"des": "My boyfriend Nick and I saw this lovely taco place on Chicagos Best and decided since we would be in the area, we just had to try it. Our experience was one that we have been thinking and talking about ever since. <br><br>We had a reservation but we beat the rush so we were seated the moment we walked in. I usually order a margarita just about everywhere I go, so when I saw the tamarindo margarita the young version of myself jumped for joy. It reminded me of how much I loved the tamarindo Jaritos soda growing up. Nick ordered the Paloma and we tried each other's drinks and were both really pleased with the quality of them. No syrupy pre made margarita taste and both were extremely refreshing. <br><br>To start we ordered the \"All Three Salsas\" with chips. The flavors were interesting in all 3 but we found that 2 of them (Hibiscus Ghost Pepper and the seasonal salsa) were on the not very spicy side which for Ghost pepper was surprising for us. Meanwhile we both favored the Tomatillo Pistachio salsa because it had the most flavor and spice that we were craving! The chips they give you are nice and big too. You break them up and there are plenty for two people. <br><br>Now for the best part: TACOS! <br>We ordered 4 kinds and in total received 8 tacos (2 of each kind)<br> <br>Crispy fish- Homemade hibiscus tortilla added a very nice floral flavor to the taco. We thought this was one of the better fried fish tacos we've had in this area. I really enjoyed the cabbage slaw that came on it. The lime elevated the flavors as well. <br><br>Grilled Brunkow Cheese- This one was interesting, in a good way. The Brunkow cheese shines and successfully takes the place of a protein. As someone who eats meat, I thoroughly enjoyed this taco! <br><br>Skirt Steak Taco- A simple steak taco that has been elevated by the addition of freeze dried corn and Chimichurri sauce. Adding a squeeze of lime made it that much better. <br><br>Lamb Merguez- Personally the lamb was my favorite. The combination of the jicama, tomatillo salsa, and the Brunkow cheese creates the most flavorful bite and makes you wish you had ordered another. This taco truly demonstrates their fresh take on Mexican cuisine. <br><br>At the end of our meal we decided to indulge and get dessert. We had 2 choices and ordered the most unique one: Mexican Chocolate Ganache. This dessert is made with Abuelita chocolate, brandy cherries and coffee crema. It was an exciting experience to be eating a dessert with flavors like coffee and brandy that still managed to remind me so much of my childhood. It was definitely a nostalgic and unique experience that will have me coming back for more. <br><br>Thank you for an unforgettable meal!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lsyEDzpl0nnSK1Zhtnq_ug/348s.jpg", "caption": "Mexican Chocolate Ganache. Unique and nostalgic dessert!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/55TO6h_k7unYYV8QoxmMPg/168s.jpg", "caption": "BEST: Lamb Merguez Taco. So much flavor"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JXYl9zJQK4B5VeqI5HpEiQ/168s.jpg", "caption": "Skirt Steak Taco. Almost ate the whole thing before snapping a pic!"}]}}, {"review": {"des": "Checked out Takito Kitchen for Friday date night 2 weeks ago.  It was a beautiful night to sit outside and we were able to snag the end of a communal table with room for a high chair at the end.  Thankfully, another couple with their baby boy sat at the other end, so we were able to commiserate together about the trials of dining out with babies.  <br><br>Hubby and I both started with a Takito Margarita.  It was refreshing and a reasonable portion.  We split the Hearts of Palm Salad, which was okay.   For tacos, we each ordered the 3 taco option. Unfortunately, you aren't able to mix and match tacos unless it's Taco Tuesday, so you have to commit to one flavor and cross your fingers.  I tried the Crispy Fish; the fish was great, but the tacos had peppers which were too spicy for me.  The coconut custard slaw was surprisingly tasty.  Hubby had the Coffee Braised Beef, which was okay, but a little dry.  After ordering, we decided to add an order of the chips and 3 salsas, which arrived mid-meal.  The chips were good, but the salsa were just okay.<br><br>Service was great!  The hostess and our server were friendly and accommodating toward our toddler.  We may have to come back for Taco Tuesday or Fried Chicken Wednesdays to try out the Fried Chicken taco.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HdeA1E-qOsz4HlCWW7cRnQ/348s.jpg", "caption": "Crispy Fish Tacos"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EfB6Q0tO7ESiT6O2NGdCBA/168s.jpg", "caption": "Coffee Braised Beef Tacos"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1gO-IrByC8x5JGcw_UI1uA/168s.jpg", "caption": "Hearts of Palm Salad"}]}}, {"review": {"des": "THIS PLACE IS AMAZING.<br><br>They have an awesome brunch deal ($10 bottomless mimosa) that I have taken advantage of more times than I would like to admit. The tacos come on a handmade tortilla, and you really can taste the quality of the ingredients. Not only is the brunch stellar, but the weekly specials are also great- like $3 tacos on Tuesdays.  <br><br>If margaritas are your thing definitely try the spicy pineapple concoction. But beware- they are DANGEROUS. <br><br>Takito Kitchen is all around great!", "pics": null}}, {"review": {"des": "Came with a friend for Taco Tuesday - $3 each (usually $3.75), but you have to order at least two of the same kind so it works out to $6 for 2 tacos vs $7.50 for 2 tacos without the special. They also had a happy hour going til 7 that included all of their margs priced at $6 (usually $10-12). We naturally started with 2 of the classic margaritas and pureed avocado appetizer. Some may not like the texture of guacamole being so smooth, but I was a fan! And I also liked that it had a little spice to it, but not too much. I'm still wondering how they get those chips into that crazy shape <br>Anyway, my friend and I opted to go splitsies and try a bunch of different tacos - is there any other way really? We got the pork belly, chicken al pastor, and crispy fish. By far, we both agreed the pork belly was our favorite. Outstanding! If I could do it again, I'd still get the avocado appetizer but try their seasonal margarita instead of the classic, get the pork belly tacos but skip the crispy fish and try a specialty taco instead. Maybe next time!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/we9xKMrO8qYDSDI6aOT_0w/348s.jpg", "caption": "Tacos on tacos!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wsXo_xBSLjPpQadKtbJmVQ/168s.jpg", "caption": "Classic marg"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mNBL2679DlTwvthaknJAZQ/168s.jpg", "caption": "Avocado puree appetizer - yum!"}]}}, {"review": {"des": "I'm rewriting this review after last night's service. My rating doesn't change because regardless of the managers apology and comped bill the food was not good. <br><br>I don't understand why only 1 of the 2 tacos I ordered came out as well as the service being so slow. <br><br>I understand it was a busy night. But it took way to long to get 4 veggie tacos. The table next to us got their appetizers and entrees before we got anything. We were seated at the table by the door and watched people wait and leave since the service was too slow to accommodate. <br><br>Our waitress was apologetic for the wait only after j told her it took to long. Overall I really don't like the food. It's not worth the hassle.", "pics": null}}, {"review": {"des": "Food was delicious! Great and super friendly service. Great vibes and ambience. Very well priced and portions are big!", "pics": null}}, {"review": {"des": "After having tried their stellar Three Sister Polenta earlier in the year, I just had to come back to try the rest of their menu.<br><br>On this visit, we had<br><br>(1) Pork belly tostada paired with ghost salsa and Oaxaca cheese. Great presentation and solid mixture of sunny side egg and marinated pork belly.<br><br>(2) Pine nut guacamole and chips. Your standard guac and chips. This was the most underwhelming as the stock picture really built up my expectation for artisan grade chips. <br><br>(3) Crispy fish tacos enclosed in a purple hibiscus tortilla and garnished with coconut cabbage slaw and toasted coconut crumbles. This was a winner. Love the mixture of crispy fish filet with the subtle hints of coconut juice. The carrots and cabbage added for a great balance of veggies.<br><br>(4) Coffee braised beef tacos. The braised beef was less marinated in coffee than it was of other sauce. Was it me or is it a bit hard to taste the coffee? Otherwise every bite was a mouthful of beef. Very filling~<br><br>Overall, the servers and manager at Takito Kitchen were very accommodating, and it was much appreciated when the waitress allowed us to pick two types of tacos rather than ordering four of the same thing. I recommend the Crispy Fish and Three Sister Polenta!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wNy3QdxBAYbbqT-M6VrmDw/348s.jpg", "caption": "1/2 order of Coffee braised Beef tacos + 1/2 order of Crispy Fish tacos."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bAySmoYvUP44IXFUEUBA6A/168s.jpg", "caption": "Mexican Coca Cola in a glass bottle."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JSKtSAc9VZeouSOlYxmbFg/168s.jpg", "caption": "Half orders of Crispy fish tacos + Coffee brewed beef tacos"}]}}, {"review": {"des": "Great food, great drinks and great service. Atmosphere is very inviting . Visited during happy hour, staff was very friendly and pleasant. Highly recommend this restaurant .<br>Make sure you try the fish and lamb tacos.", "pics": null}}, {"review": {"des": "We came here to celebrate our Christmas holidays together as a family it is very hard to be all together in one place. My son Michelangelo had been wanting to come here for such a long time.  We made it before with some lousy friends but did not make it inside they think lalos is a good taco place AGH.!?!<br>Finally make it here.   I was so happy we came to eat here as a family.   We came here with my one year old grand daughter and would you believe it they made her a chicken soup it is not even on the menu.   Was my grand daughter for ever happy to have hew dish.   We loved very single thing we order.   My son order practically everything from the menu.   I loved every single little taco  I tasted.  I think we also had polenta but it was delicious.   The margaritas out of this  world SALUD! Yum.   Our servers were so cordial and so happy to wait on us.  <br>I really loved the food and the great service my favorite place.   Will be coming back soon", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/halT-UWJUpYGBH_DhNMp0Q/348s.jpg", "caption": "Can't wait for my special order of chicken made specially for me"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XkPLiWlsVy7r5BtU2U5fZA/168s.jpg", "caption": "Salud"}]}}, {"review": {"des": "This place is stellar! I met up with a friend who I hadn't seen in 20 years, and although it was hard to pay more attention to the meal than to our conversation, Takito Kitchen competed fiercely for our attention. First up, I had a Mezcal Mule and we shared a trio of housemade salsas with housemade chips. The mule was expertly blended--not too sweet, refreshing and gingery. The salsas had a reasonable amount of heat but plenty of flavor to accompany the crunchy, salty chips. Then we shared two each of their lamb, fish, and pork belly tacos. Each taco looked beautiful on the plate and had wonderful contrasts of texture and flavor. Fresh ingredients and attention to detail really shine in these delicious bites.  And the bill was very reasonable for the Chicago area--around $30 each for a cocktail, chips and salsas, and 3 tacos each, including tax and tip. Definitely go!", "pics": null}}, {"review": {"des": "$10 bottomless mimosas + the best pork belly I've ever had + the most educated server (go Marlin) = the perfect brunch spot!!!!", "pics": null}}, {"review": {"des": "The food was honestly mediocre. Only giving it a higher rating because of the service. I dined here with several friends because they were throwing me a surprise party. The staff was so helpful and polite. As for the tacos, I tried the fried chicken and the skirt steak. Fried chicken was the best one, but takes forever to come out. We waited too long but given that our party was larger number it was somewhat understandable. I honestly don't think i'll be back but if you want exceptional service and some OK tacos then definitely hit up this restaurant!", "pics": null}}, {"review": {"des": "I was there Friday night with my husband and some friends.  It was delicious. I love that it's Mexican tapas and the real bonus was that everything on the menu is gluten free except the massa crackers.  I say  The creamy polenta was amazing.", "pics": null}}, {"review": {"des": "This is definitely a bang for you buck brunch. $10 bottomless mimosas and very reasonable priced food. The pork belly sope was pretty good and I enjoyed the three sisters polenta. My friend got the chilaquiles with chicken confit. I would skip that. No flavor and was an extra $3. Make sure you check in when you come so you can get a free shared plate. I would come back for the cheap mimosas but ive had better brunch food.", "pics": null}}, {"review": {"des": "This is my new favorite brunch spot. $10 bottomless mimosa brunch on the weekend...are you kidding me?? Amazing. We got a cowboy coffee which is coffee with heavy cream with cinnamon - delish! Our waitress, Valerie, was the absolute best. Our mimosa glasses were never empty - she was so personable and made our experience so fantastic: ask for her!!<br><br>I got the French toast which was $7.50 and was so delicious - not too sweet. Stayed here for hours and love the atmosphere.<br><br>Come here and ask for valerie!!!!!", "pics": null}}, {"review": {"des": "Best bottomless brunch in the city! Had a lot of fun sitting on the patio. The breakfast potatoes were great too!", "pics": null}}, {"review": {"des": "We just had a a great meal at Takito! The tacos were unique and beyond tasty. The service was lovely and the Owner, Mario introduced himself to our family and gave our kids a little special treat at the end of the meal. We had a wonderful experience and will definitely be going back and bringing our friends!", "pics": null}}, {"review": {"des": "Love the service and bottomless mimosas are amazing here with fast refills lol I would recommend this place for a nice date or a start of to a Sunday funday!", "pics": null}}, {"review": {"des": "This was a nice place with a eclectic feel. The chair seats are high and the staff appeared nice.  I didn't see any low seating areas. I went on a Saturday night with a group of 6. The place wasn't too crowded and the food was good. The drinks were nice and strong. I recommend the basic margarita. The restrooms were clean. This is a nice date night location or a hang out spot. They have specials on Sunday bottomless mimosas and happy hour during the week.", "pics": null}}, {"review": {"des": "Great for brunch! Very affordable with top of the line service. Highly recommend the avocado purée!", "pics": null}}, {"review": {"des": "Fun fun place with great drinks and even greater food ! Definite regular haunt ~ those tacos are the best I have had since San Diego - and the service was thumbs up!", "pics": null}}, {"review": {"des": "First time here! Joseph our waiter was welcoming from the beginning! He recommended awesome menu items and he really went above and beyond to make my husband's birthday extra special!!!! We loved everything on the menu and the tamarind cilantro margarita was so awesome!!! Will definitely come back!!!", "pics": null}}, {"review": {"des": "Delicious!!!! Absolutely love it! The Pork Belly was by far my favorite and the spicy margarita was a must try. The service was fantastic and the place has a great vibe and perfect for groups.", "pics": null}}, {"review": {"des": "Don't go to big star or antique taco, be original and pick takito. This place has incredible tacos across the board and great veggie options if you're looking for that.<br><br>Trust them for any recommendations that they have. Cristina was extremely knowledgeable about the menu and a pleasure to have as a server. Will be back soon!", "pics": null}}, {"review": {"des": "My GF and I were looking for a good mimosa place for brunch. We came across this gem and it was Awesome! Our server, Valerie, was SOO nice, knowledgeable and pretty funny. She really made our experience!  All the employees were really down to earth and helpful. The food, was Amazing as well. Valerie recommended the Chilaquiles with coffee rubber beef and the French toast were simply excellent. So nice to see a Mexican twist on brunch. We loved it and can't wait to go back! Hats off to you guys!", "pics": null}}, {"review": {"des": "I love this place, their tacos are better and consistent than big star. However, I want just regular  beer and some chips and guac (not avocado puree).", "pics": null}}, {"review": {"des": "I LOVE this place for brunch. Bottomless mimosas for $10? Yes, please. Bottomless mimosas that never even get below half full because the service is so prompt? Even better.<br><br>The food servings are also quite generous, and for very cheap. On a recent visit, friends and I each got our own entrees and then split the chilaquiles with coffee braised beef, and no one could finish the food. They also kept bringing us fresh cinnamon sugar chips, which none of us could refuse.", "pics": null}}, {"review": {"des": "I'm sad to have to give a bad review because I've had good experiences in the past, but dinner tonight was incredibly disappointing. I brought my sister to dinner for her birthday, promising her a delicious meal. Once we sat down, our server barely looked at us. After we got our drinks, it took a half an hour to get our appetizers, another twenty minutes just to order our tacos, and a full hour to actually get them. I tried to get our server's attention but she wouldn't look our direction at any point. We eventually just asked for the check and she gave us an excuse about \"the system\" and had to get our tacos to go. We were late for her birthday party because we were waiting for so long for tacos. Takito used to be a favorite but this experience definitely changed my opinion.", "pics": null}}, {"review": {"des": "Tacos aren't nearly as good as other local options and the prices aren't in line with the quality of food. Overall I found it to be mediocre at best. Nothing that offended me about the place, just nothing to make me want to return.", "pics": null}}, {"review": {"des": "Service was fantastic. Portion size and quality of food was impressive. Would definitely recommend for a brunch or lunch stop.", "pics": null}}, {"review": {"des": "Best chilaquiles I've ever had!!! Amazing food, amazing service, amazing flavor!!! I was left speechless!! You have to try this place. We will definitely be back again!", "pics": null}}, {"review": {"des": "Great flaming Margaritas. Salsas and sides are delicious.  Tacos give Big Star some competition.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Qpb602FX13BZTa0cK3uHjQ/348s.jpg", "caption": "Flaming margarita!"}]}}, {"review": {"des": "Highly recommend giving this place a try - probably the bets fish tacos I have ever had. Mario was an absolute delight on the phone to get me in on Cinco de Mayo. Cucumber Marg was, again, one of the best. My boyfriend and I still dream about the tacos...<br><br>Friendly staff, cute atmosphere. Try it out!", "pics": null}}, {"review": {"des": "* UPDATE - this is a new updated review. We finally made it back here to give it another try. This time things were amazing like they had been earlier! The food, service and experience put us all in a great mood. Our server was super friendly and attentive making sure things were filled/removed when needed and checked in with us a number of times. We ordered  a variety of salsas, roasted asparagus as a shared plate and 4 different kinds of tacos (including the Wednesday fried chicken special) and all of them were delicious!! I had the seasonal watermelon margarita and it hit the spot! <br>My only regret was that we ate so much we had no room for dessert!", "pics": null}}, {"review": {"des": "Customer service: When we first walked in the restaurant was pretty empty. Before even placing an order we asked if we can split the check as there were 3 families. The waitress said no. That's odd since most places do it no problem. Some places even after the order is placed as one. When this was brought up to the manager he stated that their system cannot handle it. When we mentioned that if we were at separate tables they would be able to do it he said yes but we would not have received the same experience...whatever that even means. Someone from the party asked if he can explain that and the manager got upset and said \"I'm not going to argue. You want to argue\" and proceeded to walk away. Even IF we were in the wrong, managers should try to make the situation a little better. At least admit it is an inconvenience (our bill was over 250 for 9 adults and a child) rather than walk away from us. Mind you this convo with the manager was after the \"experience\" which was unpleasant to become with. Our food took over 45 minutes to come. The last thing to arrive was a simple cheese quesadilla for a 3 year old. The waitress did not tell us that she was not sure if the quesadilla can be made until after all of our food arrived. She said the chef went downstairs looking for the cheese. This was AFTER the order was placed and we had waited almost an hour for our food. They knew this was for a child. The waitress herself was sweet though and was trying her best to help out.<br><br>Food: some tasty some not. One person commented that the beans in the taco tasted like it came straight from the can. The salad was good. The price for the tacos is too expensive considering how small they are and they do not come with rice and beans. Menu is rather small. WARNING: if you ask for hot sauce they will charge you $1.50. <br><br>Drinks: asked if they had sangria. Waitress wasn't sure and asked the \"bartender.\" He said yes. We received red wine with what tasted like orange juice splashed in there. We asked for a different drink and they did switch it out for the lyche margarita which was absolutely delicious. If we didn't have such a bad experience I'd go back there just for that.", "pics": null}}, {"review": {"des": "Takito Kitchen is a cute little sit down taco place on Division that *GASP* actually celebrates Taco Tuesday and *GASP* has outdoor seating and *GASP* allows dogs! Unfortunately the Taco Tuesday special isn't the greatest in the world ($3 tacos) and half off already pricey margs. But it's not the worst either!<br><br>My friend brought her pup so we sat outside on this gorgeous patio.We made a reservation, but you probably don't have to. We were recommended to try the crispy fish taco, but we also got an order of the Pork Belly.<br><br>Inital thoughts? The pork belly was pretty good! It was seasoned well, had potatoes on it - we forgot to ask for extra cheese but that's on us, not the establishment. Solid pork belly tacos. The fish... were only ok. They fell pray to too much slaw as most Chicago fish tacos do.<br><br>Despite the slightly above average taco experience, we would go back to sit outside, drink half priced margs (MAKE IT A DOUBLE, trust us) and eat \"pretty good\" tacos.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4kJWgGfQa_BAfow69EWYtg/348s.jpg", "caption": "Pomegranate margarita (ok), crispy fish tacos (in the back) and pork belly tacos (in the front)"}]}}, {"review": {"des": "The food here is wonderful, definitely go for the fried chicken tacos if they are the special that day. The design of the restaurant is really cool and unique. The service and staff is top notch. The owner is a really great guy and when he heard it was my wife's birthday, he had the kitchen make her a pineapple upside down cake! Love this place and cannot wait to go back.", "pics": null}}, {"review": {"des": "Nice atmosphere. Our waiter was fantastic. Expansive drink menu. This is a very hipster taco spot and I wasn't impressed with the tacos. We ordered the lamb and pork belly. Pork belly was flat tasting to me and my tacos had a lot of fat on the meat. The lamb was good but it was like a lamb link and slice of cheese. Was better than pork belly but not overly inpressed. At end got the mexican ganache for desert which was delicious, rich and explosive with flavor. Would return for drinks and this. I'm not a huge fan of hipster tacos as a disclaimer.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/paEZ39W-HBauJE9jlYQdgw/348s.jpg", "caption": "Mexican ganache deserts - delicious!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hn4f_6HnlN8uAnl2sC9-kQ/168s.jpg", "caption": "Lamb taco"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4mCG1fOp16bFC6dOXbKmbA/168s.jpg", "caption": "Pork belly taco"}]}}, {"review": {"des": "I love Bar Takito, so I decided to come check out Takito Kitchen's patio on a beautiful evening before Bar Takito's patio opened. The patio is small with only 4-5 tables out there, but there is plenty of seating indoors. <br><br>The kitchen is visible from most areas of the dining room, which is how I learned that they make their tortillas fresh from dough right before your eyes! And you can definitely taste that freshness in each bite! <br><br>I tried the combo of three salsa, which were all tasty with my favorite being the delicious ghost pepper salsa. The name is misleading because it's not spicy but full of rich flavors! The Crab Ceviche was ok, although I was not a fan of the masa crackers it's served with. I much prefer the ceviche at Bar Takito, unfortunately. The Pork Belly Tacos were really delicious and definitely my favorite of the foods I tried while I was there.<br><br>They also have some great margarita options with spicy, sweet or smokey varieties for whatever strikes your fancy! I prefer the ambiance and drink selection at Bar Takito, but this is also a great place to dine and have a drink!", "pics": null}}, {"review": {"des": "Awesome place, the food was delicious, ambience simple lovely and really excellent service.<br>I've used Yelp for years but this place treated me and my girlfriend extra special, I had to drop a review. <br>We ordered grilled pulpo, it was quite delicious, 6 tacos each of which was served with a rather exquisite garnish, finally to top it off, the owner offered us some flan dessert which really sealed the deal for me. Highly recommend this place for a special dining experience.", "pics": null}}, {"review": {"des": "Delicious tacos and tasty drinks. Service was pretty terrible for it being completely empty with numerous waitstaff. We waited quite a long time to order and were given complementary drinks for it.", "pics": null}}, {"review": {"des": "This is my favorite brunch spot! We have the best service every time (Joey where ya at). I've never felt pressured to leave and they have amazing brunch deals.", "pics": null}}]}