{"name": "tandoor-char-house-chicago", "reviews": [{"review": {"des": "My favorite Indian restaurant in Chicago by far!!<br><br>The owners are so nice and you can tell they put a lot of heart into their restaurant. Love everything on their menu but I can never not order the vegetable samosa, tikka masala, and extra servings of achar.", "pics": null}}, {"review": {"des": "I got tandoor delivered through Postmates and it was delicious. I ordered the Chana Masala with rice and garlic naan. The main dish was very flavorful and the rice was perfect. I loved the naan but it was a bit thicker and larger then others I have had 1 is plenty of your sharing. I'm sure it is all even been when eaten on site! <br><br>Definitely recommend!", "pics": null}}, {"review": {"des": "The best nihari I've had in the US, and I don't even love nihari that much! Tandoor Char House also has great namesake products - the variety of tandoori chicken options are all amazing. We order this for delivery an embarrassing amount!<br><br>I'd recommend sticking with the grilled options. Or if you're adventurous, try the nihari! I've gotten other saucy items like butter chicken, and haven't found those to be as good as the grilled meats.", "pics": null}}, {"review": {"des": "Ordered this from grubhub and I was very impressed. The food was fresh and flavored really well. I got the lamb biryani (spicy) and nihari also spicy. Both of the dishes were prepared very spicy so it was perfect for us. If you're not a big spicy food person than order mild or medium. The food arrived within an hour. The only negative was we didn't receive our garlic naan. Grubhub had coupons for a free garlic naan with $20 purchase. I'm sure it was an oversight and we didn't even call the place to or grubhub because it wasn't worth them making another trip back. Overall really good and we will be ordering again.", "pics": null}}, {"review": {"des": "This place was on my list for some time and we finally got a chance to dine here with friends. We all liked the food, the service from the owner was attentive and of course being with good friends always makes for a good experience. <br><br>Of the dishes I'd recommend the tandoor items - we had chicken and lamb, both good. The samosas were delicious and you have to get the naan basket. Other stuff was good, too. <br><br>Will be back for sure.", "pics": null}}, {"review": {"des": "The most phenomenal customer service, the most phenomenal atmosphere and most importantly the food was beyond amazing. I had their rib eye steak. It's by far the best steak I've ever had. Will most defenetly be back.", "pics": null}}, {"review": {"des": "I was hoping the food to be more authentic and unfortunately it was not. We came here with our non-Pakistani friends and they enjoyed the food, especially the chicken tikka masala. For me it was just another average curry. We asked for medium spice level but it was more on the mild side. <br><br>The restaurant itself is quite small so make sure to make a reservation especially on the weekends. Service was excellent and if you check into Yelp, you get a free order of chaat fries. These were delicious. Had they brought out the fries before our food rather than after, I would have finished the entire basket. <br><br>Overall, not a bad place for Indian/Pakistani food if you don't feel like driving all the way to Devon street.", "pics": null}}, {"review": {"des": "Amazing food and service! <br><br>We were originally going to get delivery but I'm glad we went to the actual place because it was such a good experience. We got the chaat fries, mutter paneer tikka masala, and chicken biryani to share and they were all amazing. The chaat fries were perfectly crisp and curly, the curry had a really good, smooth flavor (with unlimited rice!), and the biryani was a HUGE pile of rice with amazing spices layered in - biryani was definitely big enough for two people to share as one dish. <br><br>Our servers were also so great - they were always coming to check in on us and were super friendly and generous. Really great, cozy atmosphere! <br><br>And the mango cheesecake definitely is reason enough to stop by - super fluffy, light, perfect balance of sweet and tart. One of our servers (who I think may be the owner?) said he developed the recipe with one of the chefs and it's made in house.", "pics": null}}, {"review": {"des": "Holy innovative ideas!<br>What a spectacular menu!<br>Love the service and the owners<br>Wonderful people<br>Talented chefs and execute perfection time after time!!!", "pics": null}}, {"review": {"des": "Really exceptional service, above all else. Food was okay - had some misgivings about the rice which was too dry and the beef which was a little stringy, but the kindness of the manager and our waiter blew us away!<br><br>Garlic Naan didn't really have that garlic taste in my opinion, but the chutneys (the yogurt and tamarind chutneys in particular) were amazingly flavorful and the huge basket of seasoned chaat fries (which were like crispy yet flavorful cajun curly fries with extra spices) was a definitely plus. <br><br>Entrees come with salad, rice, and chutneys - and combined with the free chaat fries, you'll definitely leave this place feeling really full. <br><br>Manager was super nice and came out repeatedly to ask us how we were, and even threw in extra chutney and complimentary naan in our take home leftovers!! Oh yes, also environment is super romantic and service is relatively quick compared to other grill places - all our food came out hot and fresh!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GGjU5TCVuwitaVK186g5Nw/348s.jpg", "caption": "Me being pretty happy about all this food"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0zCktFGVzbdur1FZ6KEP4Q/168s.jpg", "caption": "Tandoori chicken bati, came out sizzing on a plate!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UHTbzyM-wEpidSnt8nPeog/168s.jpg", "caption": "The beef nehari- be warned...this one is pretty spicy!!!"}]}}, {"review": {"des": "One of the best services I've had in a while. The wait staff replaced our jug of water 4 times and it didn't even reach the bottom. When we finished one sauce they gave us a second but in a larger size because they knew we liked it. <br><br>Complementary salads and free rice yes please and the food was amazing. We got the tandoori grill mix platter which was yummy and the waiter recommend the wings for the starter so we got that and my gosh it basically melted in my mouth. Great food and service, will come back soon.", "pics": null}}, {"review": {"des": "The food was very good, standard Indian fare. There was not a true \"butter chicken\" like most Indian restaurants have to cater to my sad American tastes lol but the Tikka Masala was delicious, naan was awesome, and service was IMPECCABLE. It's a small venue, but very nice looking inside.", "pics": null}}, {"review": {"des": "Forewarning, I am by no means an Indian food expert or claim to be, but I do love Indian food based on my US only Indian food knowledge.  I've lived in Chicago for 4 years now and have had alot of what I would consider very, very average tikka masala, and this was the first place I tried that I thought, this is it! My go to Indian food joint in this city.  I only had the tikka masala, rice, and garlic naan, but all were great.  I will be trying more items from here in the future.", "pics": null}}, {"review": {"des": "Overall i was very impressed. The one thing a good Pakistani restaurant needs is a BBQ menu, and ideally a platter and these guys have got it. They do it justice and bring it out on a sizzler. <br><br>While their curries were not incredible, their naans, lassi, chicken tikka and especially achaar were top quality.<br><br>Still looking for a restaurant that can compare to the food of my homeland. But this isn't a bad effort. <br><br>Great location, wonderful staff, well priced, generous portions. TRY THE MANGO CHEESECAKE.", "pics": null}}, {"review": {"des": "Amazing place to eat. <br>Great service. <br>Very accommodating. <br>Mix grill tandoori is a very good choice for two. <br>Garlic naan is the best thing ever. <br>Shish kabob needs a bit more seasoning. <br>Chicken was phenomenal, very clean and tasty. <br>Owners are awesome and very sweet.", "pics": null}}, {"review": {"des": "I came here on a date and we were seated immediately by a friendly waiter. The ambiance in the restaurant is super cool and it wasn't too loud or too quiet. Great place for a date! It is also BYOB. Our waiter, Dan was so friendly and attentive. Right away he asked what he could get us and explained certain things on the menu. Once we ordered he came with complimentary salads and brought a bunch of different sauces on the side. He explained each sauce to us. I ordered the chicken kabob wrap and Dan asked if I wanted that or the tandoori chicken wrap because the kabob meat was a lot like beef. I thought this was SO NICE because I do not like beef at all! Very thankful he made a different suggestion. My boyfriend got the lamb kabob wrap and both of us thought our meals were delicious. Also dan volunteered to bring us their house made sauce which was DELICIOUS. We will definitely be back, great food and great service!", "pics": null}}, {"review": {"des": "Their lamb biryani is TO DIE FOR. Since I order it almost once every week they've started giving me free desserts! Which are scrumptious. Imagine having biryani delivered on a Saturday night only to find their yummy gulab jamun on the top! Tandoor is by far the best Indian/Pakistani restaurant in Chicago and I should know since I've had biryani at almost every nook and cranny in Chicago searching for the one. Their staff is also super nice! Fivee stars and beyonddd", "pics": null}}, {"review": {"des": "This was a GREAT experience. <br>i wanted to try something a bit different. i mad a reservation for last Saturday night, 11/17/18. we arrived and were sat almost exactly at our reserved time. while we waited we met and spoke with one of the owners. <br>He was extremely welcoming. he said his brother would be waiting on us and would help us with menu item.<br>there were 4 of us. we ordered somosa's and curly fries (these came with different dipping sauces. we were explained what each one was. we were also served an indian version of kim chi. very good...but very spicy!<br>my wife and i split the grilled combo...REALLY GOOD! my son had a vegetarian dish. we also ordered the assorted nan, so good.  we had 2 deserts. one was the mango cheescake. the better desert was the indian version of warm donuts in a sugar sauce. OMG!!! so delicious. <br>As noted the place is BYOB. the will bring wine glasses as well as beer mugs. the service was outstanding. constantly bring water and filling our glasses. <br>to sum it up....we felt like we were in someone's home, as a guest. while we live in Deerfield, this will be a place we return to and bring others to experience what hospitality should be like! we have already told several friends  <br>thanks for a great dining experience. the place is intimate, make a reservation. enjoy great food and caring service at tandoor char house", "pics": null}}, {"review": {"des": "I ordered from here last night via UberEats.  I had the chicken tikka masala and it did not disappoint.  I had the garlic naan to dip in the sauce and was in hog heaven.  It's super rich so probably something you only want to do once in a while.  If you're in the mood for Indian and don't want to go all the way up to Devon, I'd definitely order from here.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wTGUJY-tVgqL0NTvPAChEA/348s.jpg", "caption": "Chicken tikka masala garlic ma'am and achar"}]}}, {"review": {"des": "The filet mignon was out of this world- and the best part, it's Zabihah Halal!<br>The steak sauce was a nice touch too.<br>I would definitely bring my friends here again.", "pics": null}}, {"review": {"des": "What a delightful surprise this place was! I took my boyfriend here last weekend since he had never had Indian food before (!!!!). I had never been here before, but the reviews looked great, and I love a nice cozy atmosphere in Lincoln Park. Funnily enough, I lived across the street for 9 months a few years ago, but I never made it over!<br><br>The owner (or who I think was the owner) sat us and was super friendly. Water came out promptly, and the service was quick and friendly. We got the chaat fries to start (free with Yelp check-in). SO good. If you love curly fries (specifically Arby's curly fries), then you're in for a treat. These were moderately dusted with a great mix of Indian spices. Really flavorful and delicious. Next up, we ordered the Chicken Pakora, which basically tasted like a \"guilt-free\" chicken tender. The chickpea batter was delicious!<br><br>I ordered the Chicken Tikka Masala, and my boyfriend got the Tandoor Char Burger from the Fusion section of the menu. I basically face palmed when he decided to order a BURGER at an Indian restaurant, but the owner said to rest assured that this was a good choice as the burger there was one pound of beef mixed with Indian spices. As it turns out, this was one of the best burgers my boyfriend has had in a while. It also came with the Chaat fries and a salad. To top it off, we ordered the Garlic Naan, which was also amazing. <br><br>Overall, the food was fantastic. We walked away stuffed to the brim with only a $50 tab. Service was awesome, and I would come back for that alone. Next time we won't forget that it's BYOB too!", "pics": null}}, {"review": {"des": "Great service. Good food, cozy atmosphere. <br>Very flavorful food. <br>We ordered lamb karahi and garlic, paneer cheese naan.. <br>got free chat fries. <br>Welcome salad.", "pics": null}}, {"review": {"des": "This is the best indian food I have had in Chicago!<br>The service is brilliant and food is so tasty and fresh and hot.. loved the paneer makhani and chicken butter masala... chaat fries are awesome too.. and the naan is superb...", "pics": null}}, {"review": {"des": "Love love love this place.   You can smell the amazing aromas as you drive by.  The service is great and the food is even better. You definitely must come here with a friend or two to share as the portions are plentiful.  I have been here Multiple time and the service and food is consistently the same that is why I really love this place and highly recommend it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YvlTLboduRTHgFWJxC9zvg/348s.jpg", "caption": "Briyani Vegetarian Biryani"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RcjQ4r966mK7YzwFXoF9fA/168s.jpg", "caption": "Naan Bread"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cFeoacj27uVyP5R3SODErw/168s.jpg", "caption": "Chutney"}]}}, {"review": {"des": "Excellent food and BYOB! Huge portions that are great for sharing and we always end up with plenty of leftovers for the next day. I'm a little more basic with my choices but the chicken tiki masala has the BEST sauce I've ever tried. It's almost addictive with a perfectly creamy texture. We've had the tandoor mix grill and each item has its own individual flavoring of spices. To start they bring out salad and choices of chutney. The spiciest chutney is amazing! I'm not the best with spicy (I know, I know) but I will suffer through the heat because the carrot mixture is excellent. We don't live in the neighborhood but will make a special trip for Tandoor.", "pics": null}}, {"review": {"des": "Damn good indian food, but lacking on the garlic naan.  Got an order delivered with chicken biriyani and matar paneer tikka masala and garlic naan. The chicken in the biriyani was super flavorful (big kabob chunks) and the curry was rich and delicious. The garlic naan was very large, but also very tough and almost leathery upon arrival. Not huge on flavor, either. I opted for more rice instead. I will say that the spice level for mild was more like medium at most indian places (doesn't matter for me bc I can tolerate a lot of spice), but just be aware of that.", "pics": null}}, {"review": {"des": "Food was mediocre. You can find way better Indian food anywhere on Devon for half the price of this place. I have no idea why it's highly rated on line. Their Cajun chicken was really good. Everything else we ordered was just dry and tasteless. Even their nihari was just average it's supposed to be their house special. We ordered a bunch of other chicken dishes- whole tandoor chicken was ok nothing special at all and tandoori chicken wrap was super dry.", "pics": null}}, {"review": {"des": "This place was phenomenal! My husband came here for a Friday date night immediately after work. We got the chaat fries using the yelp check in to start. Those were delicious with the spices on them. We got the assorted naan basket, which included regular, garlic, and cheese. These were all amazing. So so good. I could survive off of these alone. They also brought out four different dips which were just as tasty. For my entree I got the vegetable tandoori. This had potatoes, onions, and peppers. It was seasoned very nicely and also came with rice and a masala sauce. This all again was great! There was so much food. I had leftovers that was for another entire meal. The service was impeccable as well. Our server John was great. I could go on and on. I hope to get food from here again!", "pics": null}}, {"review": {"des": "I've had Indian food 3x this weekend already and I've only gone out to eat 4x. Don't ask why; I love it and I don't need to make up excuses for anyone. <br><br>My friend and I arrived at 6:30pm on Friday night and the restaurant was fairly quiet. Once 7:30pm rolled around, it was packed. The space is small so I would recommend making a reservation if you're hoping to be seated right away. <br><br>It's BYOB. They will provide your table with an ice bucket for your wine, beer, etc. <br><br>The chaat fries are delicious. They are curly fries covered in spices. The chicken tikka Marsala is very flavorful. It comes with a separate plate of rice. <br><br>Street parking is available but if you're a millennial you'll use Uber anyways.", "pics": null}}, {"review": {"des": "Love this place!<br>Very fancy Indian restaurant with really tasty food. I'm not gonna lie, their garlic naan was perfectó! We ordered the tandoor mixed grill platter, chaat fries, tandoori chicken tikka masala(amazing), boneless chicken biryani, <br>chocolate fudge cake, and a strawberry lassi. <br>Everything was perfectly done except the strawberry lassi.... I just wasn't a fan of it.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bkvh6-owpO9o19CdAVMo-g/348s.jpg", "caption": "Our bill for 2 adults and a child."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/A6_Nupj5luTSRl9wTS8Jnw/168s.jpg", "caption": "The amazing garlic naan!"}]}}, {"review": {"des": "Stopped here randomly after shopping at home depot on a Tuesday. Ordered the Beef Nehari and extra naan to go.<br>The beef was phenomenal and the flavor of the sauce was SO good and spicy! The naan was large and came with plenty of sauces. We split the meal and were satisfied after.", "pics": null}}, {"review": {"des": "Not only was the food amazing, but the owner and waitstaff could not have been nicer. Fries are one of the best in Chicago in my opinion (and I eat a lot of fries). We had the Tandoor mix platter between two people and it was a ton of food, all of the meat options and sauces were amazing. Can't go wrong with garlic naan. And complementary salad and rice with every meal. Wish I took pictures. <br><br>I have never written a yelp review but I had to for Tandoor! So excited to have this place in my neighborhood.", "pics": null}}, {"review": {"des": "I've travelled the world and have had my fair share of Indian and Pakistani cuisine. Yet nothing has compared to Tandoor. This place even beat out most of the places I went to in India. The naan is perfect (I recommend the platter... perfect combination of the most popular types). The chicken pakora was perfect as well as the common tiki masala(my favorite... don't judge).<br><br>The owners are always there and make you feel right at home. They literally take care of any issue. One of my friends is vegan and the owner made sure no meat touched any of the utensils used to make their meal.<br><br>I'm becoming a regular and I'm proud of it.", "pics": null}}, {"review": {"des": "I dined here 4/17 for day 2 of my Birthday week (New Monday) and had regrets on not going somewhere on Devon Avenue.<br><br>We arrived a little after 5pm and were the 1st table in. The restaurant is a converted house so the small dining room floor creaks warmly with personality. There are a total of 9 tables and we were seated in the corner against the kitchen wall. I noticed right away a pungent sewer smell but couldn't locate its origin....until I went to the restroom downstairs. The restroom was physically clean, but that smell was way overpowering and one of the worst bathroom odors I have come across at a restaurant. I noticed others mentioned the odor in their reviews from a while back, so it probably won't ever go away or get fixed. The fact that it made its way up to the dining room didn't help, so I was relieved when our food arrived, so it could at least be masked. The food came out really fast, so we had to have it packed up as we ate in order to make room on our small table. <br><br>The Aloo Masala was bland and lukewarm, very dense and shaped like it came out of a muffin pan. The best part was the side of bright and creamy tikka masala sauce. It was so tasty I took an order home.<br><br>The Chaat fries reminded me of generic fries in both texture and flavor. Super salty with a blah spice blend. Not very exciting.<br><br>The vegetarian samosa (2 per order) were large and very dense with a weird aftertaste we realized was in the deep fried dough, so we shared just 1.<br><br>I LOVED the Paratha-we ordered original and aloo, and they were so buttery, light, and crisp, with just the right amount of potatoes and peas. There were 3 pieces per order and I could've eaten just that dipped in the tikka masala sauce and would have left Happy.<br><br>My guest enjoyed the keema naan, but the spiced ground beef was so sparse that it kept falling out.<br><br>We both received small salads. <br><br>Our order of chana masala very spicy (as we requested) but the spice blend was overpowered by WAY too much salt. The dish smelled good, but was sludgy and not silky at all. Yellow rice was well seasoned.<br><br>The lamb karahi faired better, but with very little lamb compared to the abundance of onions, tomatoes, and chillies, it was just alright. Same yummy yellow rice.<br><br>My Favorite dish was the shrimp biryani.  Everything about this dish was top notch! The shrimp was roasted perfectly with a smokey exterior and the rice was flavored beautifully with the blend of spices, onions and tomatoes. The green chilies added heat that didn't smother the dish, and it was just as delightful to finish the next day for lunch.<br><br>Complementary sides of achar, raita, cilantro chutney, and tamarind chutney were offered, but didn't add much to enhance the flavor of anything.<br><br>The service was pleasant, but the limited menu, overuse of salt, and <br>sewage smell will keep me from coming back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KA923b8FGVE_zsWXFqetzg/348s.jpg", "caption": "One of the chutneys- too salty to even finish (and it was in a very small ramekin)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4Hmw14KEph1vKH2KYC04KA/168s.jpg", "caption": "The other 1/2 of the 28% I enjoyed- the Delicious shrimp biryana :)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PO-OulHBJQUsbODFgkMkMQ/168s.jpg", "caption": "The light yellow rice was fluffy and seasoned nicely"}]}}, {"review": {"des": "I bookmarked this place on yelp, just because it had a strong 4 star rating. Who can say no to awesome Indian cuisine? I do love some authentic Indian curry for sure.<br><br>Enter Tandoor Char house. I ended up getting take out here, since it was already 8pm at the time of the transaction and didn't feel like dining in the restaurant. Upon entering, the music was a little bit loud, like you were in a club or something. The room was dark enough to induce some mood enhancement, but it wasn't for me. Nothing wrong with that, but that's how it was on a Thursday night. I ended up getting the lamb tikka masala with 2 orders of the garlic naan. I found out that this place was kind of pricey, although the food itself was delicious. Good Indian cuisine tends to be quite spends. I guess I waited for a good 20 minutes or so, as they were making numerous phone orders that were already sitting in the front of the restaurant waiting to get picked up. <br><br>For me, the thought of epic authentic Indian cuisine in the heart of Chicago has been found and the fact that this place has a solid positively great yelp rating, I knew I had to give it a shot. Plus, it was a relatively short walk from my hotel on W Surf Street anyway. The overall experience here at the Tandoor Char House - even though it was a take out adventure, was pretty good and decent. I felt like the wait was a little too long, but in the end, it was worth the wait for sure. The Tandoor Char House is located at 2652 N Halstead Street, in heart of Chicago's Lakeview / Lincoln Park area. They accept major credit cards, which is always a good thing. There are a handful of street parking here, although it's extremely limited. For anyone who doesn't have a car, the train option is the better way to go, although you would need to walk a bit afterwards. The brown and purple lines come near here, stopping at Diversy station. The Orange line also is nearby on Roosevelt, but it's a longer walk. Whatever you want to do, get here for tasty and delicious treat or meal. <br><br>For the most part though, the lamb tikka masala was very good and spicy. I wished I had asked for utensils, but I had to improvise when I got back to the hotel to eat. The garlic naan was good and served as a spoon to eat up with the rice and the malasa. For the price paid, it was an expensive proposition but worth the expense, as I usually don't eat this good daily. Lol the bill was about $24 with tax. The service was good and average, as I only did a take out service. If I was ever in Chicago again, I would consider coming back here and trying to dine in next time. Maybe they won't have the loud music. Probably I just happened to be there and they had the club music on then. Or I'm just getting old. Ha. Authentic it is, it would be a travesty not to come here. <br><br>4.0 stars for the food. 3.5 stars for the overall vibe and service. Take out is like that.<br><br>Support local!<br><br>B", "pics": null}}, {"review": {"des": "Amazing. Finding a good Indian restaurant, I believe is kinda hard to find. The restaurant was a bit small but as soon as we walked in, we were seated. Granted there were only two of us and the people behind us had to wait about 2 hours. <br><br>I went with a very basic choice, the chicken tikka masala. Man oh man, the amount of food they bring you is crazy. We got free chaat fries with the Yelp check in. The fries were full of flavor, maybe a little too salty for my taste but still great. The meals comes with a complimentary house salad, rice and three chutneys. The three different chutneys were yogurt, tamarind, and a spicy house blend. My favorite was the house blend. We also decided to order garlic naan because you can never go wrong with naan. The amount of food that we had was crazy. <br><br>The service was exceptional. The environment was great. Overall, will definitely be coming back and bringing my friends. Ohh also good to note is that this restaurant is BYOB.", "pics": null}}, {"review": {"des": "This place was so good! A pleasant surprise for sure. Finally a restaurant with good Indian/Pakistani food, good prices, nice ambience and great service! Now I don't have to go all the way to Devon which is great. We got the lamb biryani. It had so much meat, no bone which is what I've become used to which was great. Chicken Makhani was good as always. We got free chaat fries for checking in that we're great. Grilled combo was great too! Def want to come back", "pics": null}}, {"review": {"des": "This is uniquely an Indian restaurant with a Pakistani twist. The restaurant is small but cozy and the atmosphere is comfortable and friendly. The food here is definitely authentic and delicious and meets the standards of any critical Indian connoisseur. <br><br>The vegetables pakoras are a little different in terms of how they are traditionally prepared but it's good non the less. The tandoori chicken that comes on a sizzling plate is so flavorful and aromatic that you will want to order a second one. The assorted naan basket is a nice way to try the various naan breads such as garlic, cheese, and plain. This place does not short change you on chutneys, including the homemade pickles for condiments. You want more, just ask. <br><br>Another plus for this establishment is you can bring your own wine or alcoholic beverages as it is a BYOB. The staff is more than happy to keep to keep your drinks chilled. Speaking of the staff, they are all really friendly, jovial, and professional. We had a good time here and enjoyed every single dish.", "pics": null}}, {"review": {"des": "Very tasty!  This is not an authentic-feeling Indian/Pakistani restaurant, but the food is pretty good considering.  Definitely give it a go.... but sometimes you may be the only guests here.", "pics": null}}, {"review": {"des": "Love it here! Will definitely be back. Small place so I recommend making a reservation. It definitely fills up on the weekend. We got a bunch of different dishes to share. A few chicken dishes, a lentil dish and garlic naan and cheese naan. Everything was delicious and well priced. The owner is very generous, friendly and welcoming. I am already planning my next visit!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TcIFQG_U8235NOgkfx1hDg/348s.jpg", "caption": "Chicken tikka masala"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YEuTCR2YpYCuoywX4m8Whw/168s.jpg", "caption": "Daal and rice"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zpfpMYPh8spnoPkifKI1-g/168s.jpg", "caption": "Daal"}]}}, {"review": {"des": "I ordered food with postmates and I was really happy with all the food! Really tasty! Love Pakistani food!<br><br>We ordered: Frontier chicken, Okra, Beef Samosa, Gilman Jamun.<br><br>All of it was delicious!!!!! I definitely recommend this place!", "pics": null}}, {"review": {"des": "This is my go to place for Desi and Desi fusion food! The owners are 2 brothers who are always so hospitable. Everything on the menu is great! The mango cheesecake is definitely something you cant leave without trying. <br>Recommend: chat fries, nihari with garlic naan,  chicken tikka masala, penne pasta, tamarind wings, the burger, mixed platter.", "pics": null}}, {"review": {"des": "This place is AMAZING!!! Want to enjoy some super authentic Pakistani food, family owned and ran by two brothers who are the nicest guys EVER!?!?!<br>This is your place!!! We had an extremely large group come for a birthday party.  A party of 20 can be overwhelming for a small place that seats about 30-35 tops. But this place effortlessly accommodated our reservation and did so without making us feel like we were hassle with all of our requests, not to mention accommodating a myriad of dietary restrictions from meat eaters, to vegetarian/ vegan and gluten free.  They seems happy to do it all and  went above and beyond making sure we had the best experience ever, and we did. We will definitely be going back with a much smaller group and this place will absolutely be apart of our regular restaurant rotations. Great food, with authentic old family recipes, small family owned business , and Superb service with a friendly staff.  FIVE STARS ALL AROUND!!!! Thank you!!!!!!!", "pics": null}}, {"review": {"des": "The staff were unprofessional and the owner was so rude! I was very unhappy about their treatment. I wish I never went there. The owner thinks just because he owns the restaurant that he can treat anyone any which way he'd like, being an owner of a restaurant does not give you any right to treat people badly if anything you should be extra diligent on treating people right and giving the best service.", "pics": null}}, {"review": {"des": "This is my second time visiting Tandoor Char House. The place is quite small and cozy. BYOB is a plus ($5 corking fee).<br><br>Overall we are very satisfied with our meal. The meal starts off with a complimentary salad and all of the chutneys listed on the menu. We also got the free fries from the yelp! check-in (recommend if you are very hungry, the order is large). After sometime our order came out all at once.<br><br>It was A LOT of food so leftovers were plenty. We ordered the tandoor mixed grill platter (yummy a little dry) and the lamb karhai which I totally loved. So good with the unlimited yellow rice. Can't forget the garlic naan! I have leftovers for days after this meal.<br><br>The service is very accommodation and kind. They great you with joy and serve you with joy as well. Sometimes you might wait a bit but you can just sip on your wine and enjoy the company you are eating with. <br><br>Will be returning next time I have a craving for indian food!", "pics": null}}, {"review": {"des": "Ordered delivery from here the other night, and I had a good experience dining at the restaurant in the past. Food came relatively fast as it was on Uber Eats (which is always the fastest in case you're wondering). Ordered the chicken tikka masala and palak paneer for entrees. Tikka masala felt more authentic as it lacked butter and cream and was heavier on tomatoes. Chicken was well cooked. Palak also lacked the same pure green spinach consistency Im used to seeing at American Indian restaurants. However, the samosa and garlic naan were the bomb. The rice was also very good. <br><br>High quality Indian food, but a little less craveable than the Indian food I'm used to.", "pics": null}}, {"review": {"des": "The foods pretty good, the mango cheesecake and the chaat fries are to die for, but the service is unbelievable. I've been coming here for years and they're always so kind and helpful. Seriously the owner has never not stopped by my table. He's great.", "pics": null}}, {"review": {"des": "As usual, absolutely fantastic food.<br><br>I was going through my reviews here for Tandoor and realize I never wrote down what kept me coming back from when they opened.<br><br>Tried it about 2 months or so after they opened.  Dropped in to try it out.  I recall the place was fairly empty.  The menu was nothing like what it is now.  My wife is a vegetarian so we were a little surprised by the limited vegetarian options (Keep in mind, this is like 7 years ago or so.  Now, they have a host of vegetarian options).<br><br>My wife asked the server who seemed fairly new to see if they could possibly make a tandoori paneer since she is a vegetarian.  The server said that unfortunately they wouldn't be able to make it since it wasn't an item on the menu.<br><br>The owner (I can't remember if it was Fahim or Faraz at the time) was standing some 30 feet away and observing till the server sadly said they couldn't make the paneer tikka.  He came right over and took over and said something to the following effect:<br><br>\"I'm so sorry maam.  We serve Indian food and I realize now that paneer tikka is something we should have on the menu.  I'm so sorry that we don't.  If you don't mind, I'd like to make it for you but respectfully keep in mind that it may not taste as you would normally want it to since it's not been marinated.\"<br><br>I knew then that this place is going to rock.  Hadn't tried the food at that point but knew that this is a place that will be willing to take constructive criticism and really make a fantastic restaurant out of it with amazing food and service.  <br><br>Had to add this to the review.<br><br>For those of you that eat steaks, try one here.  You will not regret it.  Where else in the US will you get a steak marinated in Indian spices?", "pics": null}}, {"review": {"des": "Who would have thought that some of the best steak I've eaten was at an Indian restaurant??<br><br>TIP: You HAVE to make reservations on the weekend and you have to get Chaat fries.<br>  <br>Tandoor Char House is fantastic. Fantastic food and fantastic staff.<br>The menu offers classic indian dishes with a couple fusion twists (steak, fajitas and penne pasta), but everything I've had (Chicken Tikka Masala, Chicken Saag, Ribeye Steak) has been delicious! A lovely halal restaurant full of surprises.<br><br>My only qualm is how cramped and small the venue is. Sometimes where we've been seated causes us to get constantly knocked by staff as they exit the kitchen or by nearby diners - unavoidable, but sadly distracts from my tantalizing meal!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kphvmgW4xa_jjjhIHsQeAg/348s.jpg", "caption": "Look at how shiny that naan looks... *Drool*"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mEwTpzDiGuWcLGfw9WAA-g/168s.jpg", "caption": "Chicken tikka masala, I know I'm basic but it's so good"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ARWoeLNtZHD6Oxb_Il1MVw/168s.jpg", "caption": "Rib eye steak - I know it's crazy to order this at an Indian restaurant but it's mind blowingly delicious and affordable AND halal!"}]}}, {"review": {"des": "The foods good but place is too expensive compared to the taste of the food. Its whatever def wouldnt go here too much", "pics": null}}, {"review": {"des": "First time here and I'll definitely return. I got take out but I'm sure that the service is phenomenal too. <br>I ordered the palak paneer (medium -they have mild, medium, or spicy), an order of naan, and the chaat fries (curly fries with Indian spices). The palak paneer was accompanied by rice and a side salad and of course the traditional sauces ($12). <br>The palak paneer is so delicious and the chaat fries are wonderfully addicting. Absolutely recommend this place to anyone who likes Indian food. Good sized portions without skimping on quality.", "pics": null}}, {"review": {"des": "Amazing! I've been here twice now and each time the owner(?) has greeted us personally, taking time to tell us about the menu and recommendations. The first time I was here was with some friends and parents of friends and we ordered a mix of vegetarian and non veg - not a bad word was said. The samosas and tandoori paneer was delicious with of course the mix of chutneys and achar made by the owner's mother fresh weekly! (Reminds me of my dad's pickle...yum!) <br><br>The second time I was with visiting friends who let me go all vegetarian with the ordering and didn't regret it for a second! We got free chaat fries with a Yelp check in which were absolutely amazing crispy flavorful curly fries, followed by a complimentary (!) house salad which helped freshen us up before the main course. We had biryani, tandoori paneer (of course), baigan masala, and okra. The baigan and paneer were our favorite and the spice level (we said spicy) was on point with the taita from the chutneys for a bunch of Indians :) The maybe one thing to know is that the biryani is a little potato heavy, but we inhaled the leftovers happily the next day for lunch. <br><br>All in all great meal for ~$15-20 per person with lunch the next day! Oh and don't forget it's BYOB!", "pics": null}}, {"review": {"des": "Great food! My grubhub messed up, I called Tandoor and they made a fresh order no charge and sent it over. <br><br>The food is so good, I got the chicken tikka massala and the khabob salad. Everything was so fresh and great flavor. Reminds me of the quality of Indian food in London! Definitely will order again", "pics": null}}, {"review": {"des": "I've been twice and both times have been wonderful. The staff is so accommodating. It's BYOB and the corking fee is $5 FYI. They sauces are amazing they come with the meals. The only downfall is that it is not he biggest place. I've never had a problem getting a table . <br><br>We got a vegetarian pastry and chicken roll to share and then I got the paneer wrap. Everything was delicious. I wish I took pictures of it all! I'll definitely be back!", "pics": null}}, {"review": {"des": "I'm not sure if this is really \"authentic\" or not.  I'm not an authority on such things.  But for a guy who loves flavor over heat these guys served me the best piece of lamb (as part of a three meat platter) I remember ever having, cooked and spiced to perfection.<br><br>Keep it up!", "pics": null}}, {"review": {"des": "Amazing ! Coming from Miami I was pleasantly surprised with the vast variety of Indian spots in town. Picked this place because of the reviews and locals seemed to love it. Boy they were not wrong. First the ambience is quite nice, very intimate and the service is outstanding. We had the char fries with the yelp check in and it was one of the greatest apps I've had in a while. We ordered a lot of food but they had interesting choices as starters like ceviche and tamarin wings. They gave out complimentary salad and I was craving veggies this whole trip - I was glad it was so delicious. I even ate my boyfriend's plate as well. We order beef nahir and chicken tikka masala. My boyfriend got the beef nahir and it was good it came with yellow basmati rice it was different he usually goes with the Tandoori Chicken but wanted to try something new. I had the chicken tikka masala and it was good but different from what I have tasted before. This was a bit sweeter than I expected but still nice. We also ordered a naan basket, expecting it to be 4 slices of naan (max) but we got a basket -huge one filled with delicious naan. Best naan hands down so but so good! The place is priced well especially for the amount of food you get. For next time I definitely want to try the bbq options they offer. Great place! Don't miss out on your next trip to Chicago.", "pics": null}}, {"review": {"des": "Some of the best Indian food that I have found in the city. I have tried the Chicken Tiki Masala, the Chicken Boti and the Chicken Biriyani. All are delicious, and served in such generous portions that I usually have it for dinner back to back nights. Can't recommend this spot enough.", "pics": null}}, {"review": {"des": "Food was okay, but probably not the best choice if you're wanting authentic Indian cuisine. The menu was disappointing; limited traditional curry selections and weird fusion additions (fajitas???). Service was great, and portion sizes were decent, but we just weren't wowed with the tikka masala and saag that we ordered. Plus even though we asked for mild spice level, the tikka was very spicy.", "pics": null}}, {"review": {"des": "OK so the low rating isn't so much for the food.  The food was good.  I ordered the Chaat Fries, the Chili Chicken Biryani, and the Beef Nehari.<br><br>I was craving Indian and ordered for delivery at 6:50pm because Yelp/Grubhub was promising delivery between 7:35-7:45. At 7:50 I contacted Grubhub and they said the delivery was right around the corner and should be there by 8:05.  They apologized for the delay and sent me a $5 coupon.<br><br>At 8:15 I contacted the restaurant directly and they said their driver had a few deliveries but was right around the corner.  They also asked me for an apartment number.  My address in Yelp/Grubhub defaults to the building (hi rise) address without an apartment number and I always have to correct it to add an apartment number.  <br><br>At 8:20 the food finally arrives.  Sure enough, there was no apartment number printed on the delivery ticket.  The Chaat Fries are (no surprise) cold and there's no good way to reheat fries.  But by this time of night who wants to start eating anyway.  <br><br>I've learned my lesson.  This is the second time in as many weeks where Grubhub has taken forever to get an order to me from a restaurant that's within walking distance.  Next time I'll walk and get it myself, or maybe try Uber eats or something.  In the food delivery service there's a hell of a difference between 40 minutes and an hour and a half.  It's complete BS to promise what you have no chance of delivering.", "pics": null}}, {"review": {"des": "Amazing food and a great atmosphere. Our waiter was amazing and you can tell he is passionate about his business. Loved the whole experience, definitely will be going back.", "pics": null}}, {"review": {"des": "I was delivered by the power of UberEATS and cleansed by the lamb karahi. <br><br>Lamb karahi was sparse of lamb. If lamb karahi is devoid of abundance of lamb can it truly be called lamb karahi? Only if you believe in the power of the lamb, faithful eaters.<br><br>What really got my gosht was that the entire bottom of my garlic naan was burnt. But because my spirit is crying for salvation and I'm having a cheat meal on my low carb diet, I ate half before snapping a sanctimonious testimonial to bear witness Tandoori Char's shame... Or is it actually mine? Let us share the shame, brothers and sisters of the Yelp!<br><br>Count your blessings: I ate here so that you may not. Biryani be with you, my children. Naanelujah!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ba9i8lbSgbGcscjELCJZ7w/348s.jpg", "caption": "Do you believe that the power of the burnt naan can save your soul? Naanelujah!"}]}}, {"review": {"des": "Ordered dal and kadhai chicken from tandoor house and was extremely disappointed to say the least. It was super greasy and lacked salt. The naan was fine. Will think again before ordering", "pics": null}}, {"review": {"des": "Definitely the best Pakistani food I've tried in America. Food is always fresh and piping hot, and perfectly marinated every time.  But even better than the amazing food is the service.  Faraz, Fahim, and the staff will treat you like family.  <br><br>I especially recommend the chicken tikka, chicken biryani, vegetable somosa, falooda kulfi, and gulab jamun.  Everyone has different tastes though so try out a variety of dishes with a group of friends and have a great time!", "pics": null}}, {"review": {"des": "Fantastic experience all around. The owner/one of the higher ups was who waited on us, and he was very friendly and personable the entire time. The food was prepared well and plentiful, and tasted amazing. The beef Nehari was very tender and had great spice to it. Their Naan was delicious, and the rice fragrant. It was a very enjoyable first time there. Thanks Tandoor!", "pics": null}}, {"review": {"des": "Honestly not a fan of Indian in the first place but that's not fair to judge a restaurant by. I was excited to try good Indian food according to some of the reviews. <br><br>BUT...<br><br>I ended up not eating here because the entire restaurant smelled like sewage. It was disgusting. The owner ought to fix this issue. I couldn't last in that place  for more than five minutes. I was mortified.", "pics": null}}, {"review": {"des": "AMMMMMMMMMMMMMMMMMMMAZING!!! I absolutely love coming to this restaurant with my boyfriend, friends and family! Its also BYOB! Doesn't get any better for authentic, Pakistani food! The owners are amazing (they are family owned) and they definitely have always gone above and beyond with service. Definitely try the nehari, chaath masala and the mango cheesecake ~ worth EVERY, SINGLE, BITE!! We will continue to come back!!!!!", "pics": null}}, {"review": {"des": "Not bad. Not great. The menu seemed sort of small compared to an average Indian restaurant. The service deserves the 5 stars but the food itself is a maybe a 3-3.5 at most. It might be my fault for ordering things \"medium\" spicy but hat shouldn't sacrifice flavor. The beef samosas and naan were they only things I really liked. Would I come back? Probably not, but it's not bc it was bad. It was just meh.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rf0wg2wm1_Wcruu6WWRY6w/348s.jpg", "caption": "Chicken karhai, basmati rice, chicken tikka masala, okra"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nqPzshQkLyiCSvIAN0Xezg/168s.jpg", "caption": "Free Chat fries if you check in!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FAYdu2ujUJKaEIEh5p1hbw/168s.jpg", "caption": "Beef samosa"}]}}, {"review": {"des": "This was by far the worst food I've ever had from this place <br><br>The samosa was old and I gagged from the smell it tasted as if the keema was spoiled<br><br>The paratha was burned<br><br>The tandoor chickens were small tasteless on a bed of rice that tasted so bad<br><br>The seek kabab was dry and tasteless<br><br>The chutneys were watered down<br><br>And their mango cheesecake the slices just keep getting smaller<br><br>I paid 70 dollars for all this food <br> the owner offered to remake the food for free and refund the money for the previous order <br>The owner did try to make it right by offering to remake the food <br><br>This place was once the reason why I came to chicago", "pics": null}}, {"review": {"des": "Service was exellent. Absolutly everybody on staff (or that i saw anyway) were working at their best to provide the upmost hospitality to each and every table. My girlfriend and i got to the restauraunt a bit late since we had trouble finding it due to the fact we were out of town, but they didnt even bat an eye when we came through the doors (even though it was close to closing time ) . <br>We began the journey elighting our taste buds with their fresh complimentary salad, did you hear me say COMPLIMENTARY! & with a quick succesful check in you can also be eating the bomb Char Fries!<br>Now on to the entrees !! My basic girlfriend got<br> the chicken tikka masala but WHAT A HIT. Can never go wrong with basics especially when walking around through the city of Chigaco all day. Along with our assorted Naan basket, we also enjoyed the spicy beef Nahari, which had me gasping for water (mentally milk) since the first bite. <br>Amazing experience and I highly reccomend it to anyone locally or passing through <br><br>-MR", "pics": null}}, {"review": {"des": "I came here because of the Yelp reviews but I regret going to this restaurant. First of all, I ordered takeout, which took more than half an hour to arrive. Secondly I checked in to redeem my free fries, and the owner looked really upset and said we do not honor that offer for takeout. Really? I don't see that written anywhere. Anyway, the food is way too salty. I can barely finish my Chana masala. I don't understand why they need to add so much salt to their dishes. Their fries are unbearably salty. I cannot finish my meal whatsoever. I think there are much better places out there, with better customer service where the owner actually greets you and doesn't look so stressed out.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Usk3WIWF3w0CTBeRxujmvg/348s.jpg", "caption": "Because we need more salty sauces to dip the salty fries in."}]}}, {"review": {"des": "Really great food!!  And the service was amazing, our waiter Johnny was very attentive and super nice!  Maybe one of the best Indian foods we've ever eaten but unfortunately we live in Florida and ate there while vacationing up there in Chicago.  Highly recommend this restaurant!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xuAh3Kh9Q79xXrQE8Fx4VA/348s.jpg", "caption": "The inside, very clean!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4lgTgVMCpGcdn-zvQ7LgTQ/168s.jpg", "caption": "Just delicious food!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IbYGvaaPLkbZij0nHdTCVw/168s.jpg", "caption": "Veggie tikka masala, delish!!"}]}}, {"review": {"des": "If you only eat Zabiha, add a star. <br><br>After living in Lakeview for over a year, I finally gave this place a chance. We ordered the tandoori beef botis and some chaat masala fries to go. The fries alone are worth a star!  The kabobs were fine, nothing memorable. <br><br>In all fairness, I didn't try any of their \"fusion\" food, but if you only eat zabiha meat then I can see the appeal of steak or fajitas from a Pakistani restaurant.  <br><br>Overall, if you don't feel like driving to Devon for Pakistani food, this is a great option!  It's clean, the food is fresh and the customer service is good.", "pics": null}}, {"review": {"des": "I have had really good Indian food in London but this place surpasses anything I have tried. Not just great food but great personal service. Fahim is so personable you feel like a guest in his home. <br>Highly recommended especially the lamb. <br>Oh, ask for the home made desert. Unbelievable!", "pics": null}}, {"review": {"des": "Great spot. Byob and delicious Indian food. <br>The menu has fusion elements, some jalapeño spice with the Curry's and sauces. The service is good, the the portions are large and the food is tasty. The Beef Nahari is incredible. Thinks spicy beef stew filled with great spices and tender meat. The masala is a must, I always get the fish masala. And the biryanis are fantastic. <br>In and out for roughly 20$ a head. Can't beat this spot for good Indian food in Lincoln Park/Lake View.", "pics": null}}, {"review": {"des": "Great food, friendly staff! The chicken tikka masala is on point, and the achar is hands down the best in the city.", "pics": null}}, {"review": {"des": "LOVE tandoor char house! I've been here a few times and each time it's been a great dining experience! This is cute, small restaurant that gets busy so make sure to make reservations ahead of time. The staff is consistently very friendly and personable. During my most recent visit we ordered the chaat fries for starters which are great. For the main course we got the tandoori chicken boti which is delicious! The meat is so tender and flavorful. They also give you a small salad for starters which is not that great. We also got the palak paneer from the vegatarian menu which was really good!! Highly recommend! The flavor is just so perfect and different from the ones I've had in the past. Make sure to get to garlic naan as a side - so delicious! They also give you small bowls of green chutney, Raita, and achaar on the side. And to top it all off we got their signature mango cheesecake for desert which is just heavenly! It's topped with pistachio - really doesn't get better than that. Best cheesecake I've had! If you haven't yet definitely check out tandoor char house - you won't be disappointed!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sbkdg1dKZfS2v4ufgA2z5A/168s.jpg", "caption": "Mango cheesecake!!!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0IxQptkqWOlgannqg3aHkw/168s.jpg", "caption": "Tandoori chicken boti"}]}}, {"review": {"des": "A great atmosphere and ambiance. Staff was friendly as well. Food was delicious and most importantly made to order. Menu has great options. Definitely go check it out if you haven't already! The owner, Faheem bhai won't let you down.", "pics": null}}, {"review": {"des": "Honestly the only thing I liked here were their wings in tamarind sauce, despite me asking them to make my food spicy they gave me pretty bland tasting food. Not much flavored. And since it was a take out I couldn't make any changes. Maybe next time I mention extra spicy.", "pics": null}}, {"review": {"des": "Been there a few times, usually a good spot for Indian food but, was very disappointed by last visit where the food served wasn't fresh. The rice tasted like days old and the curry didn't taste any better. Wish they valued making food fresh and not carry forward a few days old.", "pics": null}}, {"review": {"des": "We frequently order delivery from here. The food is excellent and the delivery is prompt. The chicken boti is ridonculous and the achar chutney is perfect.", "pics": null}}, {"review": {"des": "Very slow service just to make a few items and the worst customer service and from the owner no less. Part of a nice restaurant atmosphere is pleasant and polite treatment by staff and owner alike.", "pics": null}}, {"review": {"des": "I have eaten here three times and today was going to be the fourth time. After I ordered I was going downstairs to wash my hands and on the stairs I saw a HUGE RAT. Not a mouse, a big Rat with no hair on the tail. I'm dead serious. I was so shocked. The rat was probably 8 inches long from head to end of tail. I had to leave without eating the meal.<br><br>Only reason this is not 1 star is because previously I have eaten here and the food was good. I can't go back here anymore.", "pics": null}}, {"review": {"des": "The environment here was excellent. It was very comfortable and relaxed, but not too formal. The owner was incredibly kind and kept checking on our table. He really made us feel welcome. <br><br>The food was incredible. I had the chicken tikka masala and it was excellent. The flavors and spice were perfect. A couple of my friends ordered the steak and they absolutely raved at the flavor. <br><br>I'd absolutely come back again.", "pics": null}}, {"review": {"des": "Yum! This place is laid back really intimately - you enter and the seating is up a half flight of stairs. There might be more seating downstairs but it was closed the night we went. The staff was friendly, the owner is helpful, and the food was pretty darn delicious. Prices were pretty average. The four of us got 2 appetizers, 2 naans, 2 entrees, a rice, 4 beers (it's BYOB so go get your own beer - we were too lazy in 0 degree temps outside), with each person paying $16 for the meal and $6 for a beer, so about $25pp total.<br><br>We got veggie samosas, veggie pakora, naan (extra crispy), chicken tikka masala, saag paneer. <br><br>Veggie samosas (2 in an order) were pretty good - perfectly fried it was filled with potatoes and peas, could've used a little more spice, but it was creamy and crunchy, all at the same time. Perfect textures! The pakora was delicious, cooked just right, and the chutneys and pickled veggies they gave to pair with it all were AMAZING, especially the house veggies that the owner said was his great grandma's recipe.<br><br>The naan, ordered extra crispy by our friend, was OMG delicious. So fluffy and yet still had a bite/crunch to it - it was amazing. Best naan I've ever had at any Indian restaurant, and I've been to my fair share throughout the nation. <br><br>The chicken tikka masala was good - creamy, fewer pieces of chicken than I would've expected, but had the creamy tang that tikka masala is known for. The saag paneer was the star though, if you like spinach and paneer, this was definitely one of the best ones I've had. It was deeper in flavor than the normal saag, seemed to have other types of ingredients in there that added some depth and complexity to the dish. All in all, it was a great dinner, truly comforting in the middle of the Chicago winter.", "pics": null}}, {"review": {"des": "Excellent food quality. The taste is perfect. The owners are very friendly and accommodating.", "pics": null}}, {"review": {"des": "Amazing restaurant and fantastic owner. My boyfriend & I dine here for dinner fairly frequently. The food is fantastic and you can't beat the quaint atmosphere or the price. Last night I hosted a birthday party dinner reservation for 23 people and I cannot say enough nice things to fit in the review. The owner personally ensured we had a great night. The service was fantastic and we had so much food & fun! We will continue to come back and continue to bring people back. Make a reservation because the place fills up quick. Great work, Tandoor! Thanks for a great birthday and always a great meal!", "pics": null}}, {"review": {"des": "Great place for BBQ. LOVED the grilled items and deserts. Docked one star because the gravy items left something to be desired.", "pics": null}}, {"review": {"des": "Great food. We ordered delivery and it took a little under an hour. The chili chicken biryani and lamb saag were both delicious. I highly recommend.", "pics": null}}, {"review": {"des": "The food that comes out of this kitchen takes you places, go when you're patient. Every dish is a twist on what your tastebuds are used to from that Indian place down the street. The fermented veggie chutney, achar, is out of this world. And if you go and don't try the house special charred Boti I'm sure you'll enjoy your meal but you'll be missing out. We finished our meal with pistachio topped rose ice cream and it cooled our palates perfectly after the spice filled meal, but the blueberry lassi also does the trick!", "pics": null}}, {"review": {"des": "Worst service ever. Delivery was over an hour late. Every time I called they said they were 5-7min away - false. Because hey we're late, everything was cold and soggy. Don't waste your time. Go to Rangoli.", "pics": null}}, {"review": {"des": "Alright, this may not be the most orthodox Indian restaurant, but it is by far my favorite in the city. Also, its on Uber Eats making it even easier to order on a regular basis. The dishes are different and the variety provides great selection in vegetarian and nonvegetarian dishes! Everything is seasoned and flavored to perfection and you cannot not have the chaat fries. Easily the best appetizer.<br><br>The GM/owner also always comes by tables and talks to the guests. It's a really great vibe and just a great dinner or meal.", "pics": null}}, {"review": {"des": "I'm not as adventurous when it comes to Indian food as Hubby, who loves trying out new dishes, so I judge my experience by how good the Chicken Tikka Masala is, which is my go-to Indian dish.  And the mango lassi.  Their version was nice a creamy, with chunky pieces of meat; however, the sauce drowned out the meat, and there were only 5 pieces total.  Hubby had the standard Mango Lassi, which was on the warmer side, while I tried the Strawberry Lassi, which was nice and cold and out of this world refreshing and delicious.  The Garlic Naan was good.  I was disappointed with the Gulab Jamun, which were two huge pieces that were cold, when I'm used to smaller servings, usually 3 smaller balls that are nice a warm with a warm syrup.  Service was good, I just wish I had more meat in my entree to go with my otherwise awesome lassi.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rm5AeFrjn-bF8zgCtheRuQ/168s.jpg", "caption": "Chicken Tikka Masala"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2BqcRmqY1TNy0fePHWEbzA/168s.jpg", "caption": "Gulab Jamun"}]}}, {"review": {"des": "Not spicy enough. <br><br>Whenever you think of Indian food you always think of how spicy this will be. <br>It's not the case here. <br><br>We got 3 different dishes( chicken tikka masala, lamb curry, and chili chicken biryani) <br>With an appetizer of papadum. <br><br>The papadum was soooo good. Naan was ok. <br>The lamb and the chicken tikka were a bit salty but still good.<br>The chicken chili was really bad and barely had any chicken in it. <br><br>Service was pretty good as well. <br><br>Overall:<br>Atmosphere: 7<br>Service: 9<br>Food: 6", "pics": null}}, {"review": {"des": "This is one of the most flavorless food I have tasted and yet the price is ridiculous! I was craving desi food so bad yesterday but was too sick to make it at home and this place was the withIn delivery! I tried to like it but the rice was bland and not cooked properly, there was no masala on the chicken. The daal omg the daal wasn't even salted! So mad at myself I should've just suffered thru the dizziness and made my own food. So many better places that don't charge soo for chicken and rice on Devon street! Sooo disappointed, you can do so much better tandoor char house! I believe in you! If u r going to charge that much might as well make it a party in our mouths!", "pics": null}}, {"review": {"des": "Sadly, my second visit did not live up to the first. <br><br>The food this day was meh - at best.<br><br>And I made the mistake of using the restroom. Turned my stomach.", "pics": null}}, {"review": {"des": "Good:<br>- The food! <br>Bad:<br>- As soon as you walk in you are hit with a pungent smell of urine<br>- Bathrooms smell like the poop of a thousand cats  <br>- Music was too loud to make conversation comfortably<br><br>The management really needs to do something about controlling the odors in this place, we enjoyed the food but we would never come back until the weird smells are sorted out", "pics": null}}, {"review": {"des": "I've dined in and gotten delivery from Tandoor many times. It's probably one of the better off-Devon Indian restaurants. But after my most recent experience, I won't be back. I recently placed a delivery order for two entrees and chicken wings. Shortly after, I received a call from the restaurant informing that they were out of chicken wings. No big deal. They even included a complementary piece of cheesecake as a consolation, which was a nice surprise. However, when we received our order, we were missing an entire entree. I called the restaurant and they said they'd send another driver with the missing entree ASAP. It took more than half an hour to receive the missing entree. By that time, my entree was cold because I didn't want to eat my dinner while my hungry boyfriend looked on. The restaurant said they'd refund us for the missing entree. They didn't. Very poor customer service.", "pics": null}}, {"review": {"des": "Have ordered delivery and takeout several times. Always really great and have never disappointed. We normally get the Chicken Kabobs and the sauces that come with are super good! This place is for sure worth trying!", "pics": null}}, {"review": {"des": "I HAVE FINALLY FOUND THE BEST INDIAN FOOD IN CHICAGO. I went with a group of 12, and the service was amazing. The waiters passion for the menu items was contagious (shout out to the off the menu tandoori chicken tacos). The restaurant is BYOB and our server brought us ice and glasses right away. coming back here regularly. Thank you for restoring my faith in Chicago's Indian food", "pics": null}}, {"review": {"des": "Food not as good. Got the Chicken tikka Masala which is their most recommended dish, and still was not good at all. The chili chicken biryani was a disaster. The naan's were as thick as two of them combined and lastly, the order came late.", "pics": null}}]}