{"name": "tango-sur-chicago", "reviews": [{"review": {"des": "One of Chicago's great BYOB places. Very popular place for dates and get-togethers. Feels like you went to a fancy restaurant until you see the low bill. <br><br>Lots of great dishes but steak is their specialty. Gets very busy, they usually only take soft reservations. But they have a small back room where you can drink wine while you wait.", "pics": null}}, {"review": {"des": "Short story: decent food and fair price for a steakhouse, but overall ambience and experience was less than satisfactory.<br><br>Long story: I put my party of 4 on the list (they don't take online reservations/calls) and was told the wait would be about an hour or so, but we actually ended up waiting over 2 hours. They also don't seem to be using any sort of electronic system for keeping track of people, just a pen and notepad, so when we asked how much longer the wait would be, they seemed a little disorganized and didn't know what to tell us. <br><br>The place itself is rather small and crowded, so there's barely room to walk or even stand while waiting for the bathroom. Also it's extremely dark; our table was lit by just one candle (which I guess is supposed to add some kind of romantic vibe but the only vibe I was getting was frustration since I couldn't read the menu).<br><br>With all the people sitting so close together, it's terribly loud and I found myself almost having to scream at my friends 2 feet away from me so that they could hear me.<br><br>As for the food itself, I LOVED the empanadas. I got the sweet beef and ham & cheese and both were extremely satisfying. I had the churrasco for my entree and it was average. Wasn't bad but wasn't the best steak I've ever had. BTW, it's BYOB.<br><br>Can't complain about the service -- our waiter was very helpful and checked on us a few times. Despite the place being so busy, food came out pretty quickly.<br><br>Not too high on my list of steakhouses.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bZ6QFYwThisL9NyAa4g9mA/168s.jpg", "caption": "Churrasco"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WlPczaBBUG3dLCEtfzGapg/168s.jpg", "caption": "Sweet beef and Ham and Cheese Empanadas"}]}}, {"review": {"des": "I absolutely love this place best place ever in lakeview. BYOB is a plus.<br>Meat is always great I love the empanadas and the churrasco those are my favorites but everything is pretty much great. Please try them!! Always great times and great food. <br>Better than a lot of the steakhouses in Chicago!", "pics": null}}, {"review": {"des": "We came here on a Friday night which were knew would be busy so at 8pm we put our names down since they don't take phone reservations. We went to a few shops nearby and then went to the spanish tapas place a few doors down. We sat down with drinks and a large tapas outside. It was better than waiting around and eyeing everyone's food. After an hour and half we got our table.  <br><br>We sat down inside in a room of 2 other birthday party groups.  It was very dark and so loud, we had to yell while eating.  I got the costeleta the bone in rib eye which was amazing and made even more amazing with the chimichurri sauce. I knew the restaurant still had people waiting for a table but it was annoying after a few bites that they were reaching for my plate asking if I wanted a to go container. After the second time I felt like I had to guard my plate.  <br><br>The ambiance is not ideal but the food makes up for it.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/umq7YvUw5IDG5TLUd4XnfA/348s.jpg", "caption": "No reservations on Friday and wait is long"}]}}, {"review": {"des": "We were around the neighborhood for a game and my boyfriend and I were looking for a place to eat during the rain delay. We came across this place through Yelp! Based on the great reviews and it was different from our usual meal choices. So we gave it a shot. <br><br>Tango Sur is an Argentinean/Latin American steakhouse. We walked in around 6:30pm on a Tuesday and immediately got seated. This place is BYOB. The ambiance very soothing with dim lights and candle lights. Who doesn't like a candle light dinner every once in a while, right? And maybe it was good that you don't see how much you eat do you don't feel guilty on the spot  when you are really having a good meal. <br><br>We were planning to have something light and small, so we wouldn't end up with leftovers, we were heading to a baseball game afterwards. We ordered a few appetizers and an entree as our full meal to split. <br><br>The appetizers:<br>We got an safe order of a dish that were familiar with the empanadas, one of each - chicken, beef and ham and cheese. They were all good, nothing that outshined other cultures versions of Empanada. Personally, I always enjoy the rolled up portion of the dough of any empanada <br><br>Next was the prosciutto served with hearts of palm and golf sauce. That was something I've haven't seen or tried before so we gave it a go. That dish was really good, just simple, clean flavor. The saltiness of the prosciutto together with the mild sweetness of the heart of palm was very delightful, top it off with the golf sauce (almost remind me of mayo) compliments the dish well. I highly recommend to try this. <br><br>And lastly their Matambre, an Argentine specialty, it was veal rolled in with some type of vegetables that was served cold accompanied by this olive oil pesto sauce. Another one to try out because it was also good. <br><br>The appetizer portions for me was not small, if you order one it is decent but 3? A little too much.  (My BF was intending just to have the appetizers for his meal) I have to stop eating them because I ordered an entree still. <br><br>For our entree, I picked their beef fillet with mashed potatoes.  I figured it'll be small and we did ordered 3 appetizers which almost filled me up. When the plate arrived,  the fillet entree had 2 about 6oz (or more?) steaks and a heaping size of mashed potatoes. We chucked because we didn't expect it to be 2 giant fillets! It came with a side of that pesto/olive oil sauce and salad - lettuce, tomatoes and onions and vinegar and olive oil for dressing, nothing fancy, plain and simple.<br><br>Simple presentation, 2 meats, big green pile of mashed potatoes and a steak knife. Green mashed potatoes? Yes, you read that right! Their mashed potatoes was combined with spinach but still taste like regular mashed and it was so creamy and delicious. The meat itself was perfectly cooked to my liking and it was so tender, juicy and very flavorful. It also goes well with that pesto/olive oil sauce it was served with. We cleaned off that plate. And we were very pleased with out meal. <br><br>Tango Sur is a very exellent steakhouse and very reasonably priced. Our bill was under $100 including tip! Good service, Max was our server that night and he was very friendly. <br><br>So if your looking for a steakhouse but don't want a fancy-schmancy place, Tango Sur is perfect! If you like to have some drinks during your meal don't forget to BYOB. If you do, there is a liquor store just a couple of doors down. <br><br>We are looking forward to come back and try their other meat offerings and planning to bring a group with us next time. They have a good size dining area.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Q0CoK9fxjoNWQoin17tLiQ/348s.jpg", "caption": "El Filet. Served on top of red onion wine sauce with spinach mashed potatoes. Very delicious meal!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iEf65KMa1vnlUOZmSzeCJw/168s.jpg", "caption": "Empanadas."}]}}, {"review": {"des": "Argentina beef!<br>The first time I try this cuisine! It's amazing!<br>Small black tables and flowers ! i enjoy eating outside! The sun goes down ! It still can warm me. Always pursuit that kind of feeling! Wants to catch the tail of the summer is not the easy thing! Fall has already come! And winter is coming!<br>EL FILET is a Good choice! Soooo  Yummmy succulency beef! Always deserves 5 star! No doubt!", "pics": null}}, {"review": {"des": "Love that this place is BYOB!! Everything we ordered was amazing. Short rib and green mashed potatoes, the empanadas, cheese dip, and ravioli were all delicious. The short rib just melted in my mouth", "pics": null}}, {"review": {"des": "I have mixed feelings about this place. <br><br>Some points taken off for a few things- large space but cramped and packed. Really, really noisy and also really dark. Can barely see the menu or even the food you're eating. I had to use my phone light to just look at what meat was what when it came out.<br><br>As for the food, it's not bad. Appetizer, got the Provoleta which I'd give a 3.5/5- as a cheese lover this was amazing but it's really really heavy and not something I can fully indulge in.<br><br>Entree- split the Parrillada Para Uno with my boyfriend. I'll tell you now- it's a lot of meat and you don't need to order the para dos for two people. The steak itself is very good and so are the ribs. They're both tender, flavorful, and cooked well (4.5/5 for both). But it's the other stuff on the plate that I'm taking stars off for too. The blood sausage was just dry and gross tasting to me. The sweetbread was too chewy. The other sausage was pretty gritty tasting- the rest of the plate I'd give a 2.5/5- it just wasn't good.<br><br>This place is good for the steak and short ribs and if you're splitting the para uno, the price isn't bad for a steakhouse. But I'm not particularly inclined to come back because of the overall experience I had here.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jyf2EymQEc23fxwmY4bpXQ/348s.jpg", "caption": "Parrillada Para Uno- sausage, blood sausage, sweet bread, short ribs"}]}}, {"review": {"des": "I have been coming here for a few years now. Tango Sur never disappoints! I really should change it up, but I always resort back to the El Filet with spinach mashed potatoes! To die for!!! Just recently, I took my boyfriend for his birthday. We both had the El Filet with a few empanadas to start. A few months prior, we had gone to an empanadas place in the suburbs, and they were dry and disgusting. Having never had them before, I thought that's what they were supposed to taste like. However, my boyfriend talked me into trying Tango Surs' empanadas and I am so glad that I did. I do not like cheese, so it was great to have some options without the cheese. <br><br>While for the main entree, I have only had the filet, it's worth the price. Very good! You get two filets on the larger side and a large amount of mashed potatoes.<br><br>If you are looking for a place for an anniversary dinner, GNO, or just a great steakhouse, check this place out!", "pics": null}}, {"review": {"des": "Had a triple date here. My BF comes here all he time and I had never been so we decided to go. <br>We had a party of 6 and tango doesn't take reservations. We arrived there around 6 and we were seated immediately on their patio. It was the first day of fall and the air was a little crisp. They had little heaters on the patio which worked great! In fact, we had to request for it to be turned town. <br>Each couple brought 2 bottles of wine and the servers were ready with glasses and openers pretty soon after we were seated. <br>For appetizers we each got one beef empanada. I his was the servers recommendation and it was okay. Not extraordinary, didn't hate it and I'd probably get it again. We also got an order of Provoleta to share. They brought warm dinner rolls to dip in the Provoleta. This dish was also mediocre. If you're a cheese lover you'll love this but I hated how quickly it got cold and hard. It was difficult to portion/serve. Also I thought that it could use a little more of he red bell peppers. The ratio was off. <br>For our main course we each got the Parrillada Para Dos because that's the ginger to do around there. Especially when it's your first time! For the 6 of us 2 orders of the Parrillada Para Dos would have been sufficient. We had a ton left over. Th salad which comes with the Para Dos is pretty standard... lettuce, tomato, onion, oil, and vinegar. The meat portion of the entree was great. It comes with all these different meat options, sausage, steak, short rib, flap meat etc.  It came out sizzling and cooked to medium perfection! <br>Oh, we also got a Flan on the House! <br>Glad I tried their star dish and I'm looking forward to trying some of their other stuff.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EvVkiiBeasBYjLSL1o-CPA/348s.jpg", "caption": "Flan (on the house)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5W4H86UGLI6ksNlxHfx_LA/168s.jpg", "caption": "Provoleta"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YZc_bvQx5A-EAZ2FiSWgzw/168s.jpg", "caption": "Regular Mash"}]}}, {"review": {"des": "Delicious! Loved everything. Fairly priced. Staff definitely very good at what they do! One of the best steak restaurants in the city! Best part is it's BYOB. P.S. that meal feed me for a freakin week.", "pics": null}}, {"review": {"des": "Was told this was one of the best places to go get an Argentinian steak. The wait is always long whenever we pass by so naturally I was excited to try it! The restaurant itself is bigger than it looks from the outside. There are two dining areas. Although there is a decent amount of seating, the wait can still be gruesome. We waited for an hour or so. There's a sister restaurant next door that you can grab drinks or small plates while you wait. You can purchase beer and wine here to bring to Tango Sur because it's BYOB. <br><br>Once you make it through the wait, inside the restaurant is super dark and barely lit by table side candles. So reading the menu may be difficult. I finally ordered a medium steak, but the steak itself was super dry (more like well done). Which normally I do not request to take back an order, but at this point I couldn't even cut through the steak I ordered. The waiter was very reluctant to take the order back and even tried to convince us that my steak was medium as I requested and not well done. <br><br>Maybe we went on an off day? Who knows. Maybe I'll be willing to go again.", "pics": null}}, {"review": {"des": "Literally the most amazing and under rated steakhouse. Came here for a birthday party for my friend and I was blown away by the food. We started with the empanadas which were pretty good. The shining star was the steak with the spinach mashed potatoes. So delicious and you get SO much food for 30 dollars: 2 large pieces of steak and a lot of potatoes. The meat is seasoned so well which is rare in a lot of steaks. Simply divine! <br><br>I recommend sharing the filet between two people because there's too much food for one person. Just keep in mind there's a 8 dollar sharing fee. <br><br>Highly recommend!", "pics": null}}, {"review": {"des": "Wow - one of the best filets I've had in Chicago! Came here with my wife, her mother and her brother, and Tango Sur did not disappoint! BYOB with a very cozy and quaint feel (might be cramped for some, but we loved the intimate vibe!). Authentic Brazilian menu - we started out with three kinds of empanadas - the beef, chicken, and spinach and cheese. TO. DIE. FOR. Then, we all split two orders of the filets which come with 2 8 oz cuts that absolutely blew our expectations (and taste buds) away! The creamy spinach mashed potatoes were top notch. We also had the asparagus, which were cooked to perfection and coated in a rich glaze and lemon juice. Can't wait to come back!", "pics": null}}, {"review": {"des": "Great experience, and probably one of my go-to places to bring guests or have special occasions in Chicago. While a steakhouse, this place is still incredibly affordable, has a great patio for outdoor dining in the summer, and is also BYOB to boot. And they know it...I've never seen a restaurant get the ice bath to cool my wine so quickly in my life.<br><br>Onto food, They do have platters for one, but they really specialize in their large format grills, which are labeled on the menu as 'for two'. This is a misnomer...they quantity of meat is actually closer to for 3-4, especially if you get some extra sides. We tried the Parrillada for two, along with El Filet, and both were fantastic. The Parillada on it's own would have been enough, and my favorites on the board were the short rib and the blood sausage. The meats are all well-cooked to their cut(El Filet appropriately Medium Rare, short ribs appropriately medium, etc.), and the we got spinach mashed potatoes and vesuvio potatoes which went great. Even my mom, who doesn't eat that much meat, devoured it all. On top of this we started with some empanadas, which were deliciously crispy with juicy and flavorful fillings all around. Those alone are good enough to buy a few and take home.<br><br>Excellent service, excellent food, and BYOB makes this an easy recommendation. You're obviously not getting $200-quality steak, but you're getting a tasty meal in a great atmosphere good for both dates and celebrations.", "pics": null}}, {"review": {"des": "Love love love this place!!!<br>Reservations: Friday night is pretty busy, reservations are usually filled by mid weekday. But don't worry, we didn't get a reservation either. We walked in and put our name there. They have a cute and cozy waiting room at the back of the dining area, with candles and wine glasses. Yea b/c its BYOB, you can start sipping your wine at the waiting area and chat with your friends:) time passes by pretty easily. It probably took 15-20mins before you are seated.<br><br>Food: we ordered para dos: a combination of tons of meat. BUT if you are not an adventurous eater, probably best to stick to their entree menu to order the meat you want. Becuase para dos comes with not only short ribs and steak, but also sweetbread (lamb thymus) and blood sausage... i loved them, but my friend didn't touch any of those...<br>Their desserts are the best: i love their vanilla flan (the dark coffee liqueur gives it a bitter after taste tho. Be aware of that if u r not a fan of bitter taste). <br><br>Service: super friendly and attentive servers! <br><br>Will come back to try their entrees. Who doesn't like a BYOB steakhouse?", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/oubY0nuCpO5n24l07lQDhw/348s.jpg", "caption": "Para dos: short rib, steak, sweetbread and blood sausage"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WHuYDpuslP1MToIxRwe4QQ/168s.jpg", "caption": "Flan"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RI-EW0jB7zsyW8zvymfbEg/168s.jpg", "caption": "Peach cake"}]}}, {"review": {"des": "Dined in at Tango Sur on a Saturday evening. It was a good experience I enjoyed the byob aspect since there was a Jewel and CVS down the street. I was impressed by the outdoor seating they also accommodated guess with seat lamps due to the temperature dropping so dramatically. When we got there there was a wait because we didn't make reservations, also we were waiting on one other person.<br><br>Finally we were seated they put our drinks on ice and opened bottles with a bottle opener. The menu was not the easiest to read due to the format but nonetheless we figured it out. We tired a couple empanadas chicken and spinach and cheese. The chicken empanadas were exceptional their chimmichurri was superb. I ordered the Lomo which is a 10oz filet with marsala wine sauce and mash potatoes. My boyfriend ordered a bone in steak with spinach mash he liked his food the steak was tender and flavorful. My friend ordered the chicken she liked her food too. <br><br>The ambiance was nice and the food came out pretty fast. The server wasn't very friendly or attentive but maybe because they were busy. Nonetheless I recommend and I would go back eventually.", "pics": null}}, {"review": {"des": "Probably my favorite date night/special occasion spot in Chicago. The staff at this Argentinian restaurant has a dedication to easy going service, and, of course, a steak done right. The best part? The menu items won't break the bank. It's BYOB, so feel free to bring a bottle of wine, but get there early to land a table because crowds pack the house quite often.", "pics": null}}, {"review": {"des": "As a restaurant that states they're open until 11:30 we walked in and stood for ten minutes without being addressed by anyone. I've eaten here multiple times, however when I want to come an hour before they close I'm treated as if I've never existed. I would like to congratulate the owners and staff on making me realize that the higher prices if the downtown steakhouses are worth the extra money in order to be treated like you matter.", "pics": null}}, {"review": {"des": "The best piece of meat I have had in years. The El Filet Mignon and Spinach mash potatoes!!!!!!!!!!!!!!<br><br>I could be a non-paid (maybe just paid in these plates of steak) to sing off every rooftop to get people to experience this divine Argentinian meal! I swear if you are a meat lover, get this (hoping that the chef is still the same when I went in 2015)!! <br><br>Romantic, dimly lit, that god damn bread they bring out, watch out, as it'll straight up fill you up. And chimchurri dip. It was delightful! <br><br>I tell my husband that's the one meal I would fly in the U.S. for. Besides Au Cheval single cheeseburger with that runny egg. But no, Tango Sur stole my heart from the minute I had my first bite! <br><br>My plate was steaming hot and my colleagues wished they got mine! <br><br>Those damn spinach mashed potatoes got me like, derpy drooling face. This meal blew my mind and that chimchurri sauce holy sh**! It's amazing, BYOB, expect to wait outside for a spot. My mouth died and went to heaven! It was phenomenal! The bread was great! We went here for a work trip from LA, and my coworker and colleagues went and had dinner one night! It's worth every stinking penny I have! I can't wait to go back! Thank me later!", "pics": null}}, {"review": {"des": "Overall it was good. I am in love with Folklore and I belive, that they are sister restaurants. Atmosphere is pretty much the same. Cute patio, service all over the place but hey.. they are busy. <br>This was my first time trying empanadas, beef and spinch-cheese and they were ok. Taste is familiar so for me, it was good. <br>I ordered chorizo as well but they forgot it. It's happening. <br>We had strip steak and filet and they were just ok. Filet, was better than in Folklore. Flan was good too. <br>Food is ok just like service. Maybe I am in Asia phase sooo it is hard to impress me:) <br>We will come back.", "pics": null}}, {"review": {"des": "Excellent service, outstanding food, and great prices. You can BYOB which makes this place even more awesome! Went there last night for a birthday party with 13 people. Had the filet. It's actually 2 filets so you'll have leftovers. The empanadas were fantastic and the flan was to die for. I highly recommend this place - especially for a large group", "pics": null}}, {"review": {"des": "In a city filled with great steakhouses, this has got to be close to the top, for its value, flavors! <br><br>So no reservations here, you will have to come early, put your name down and wait. Our wait was about 45 mins for a table of 4 on a Thursday night. I recommend going next door to \"Bodega Sur\" which is a wine shop/bar cafe. You can grab some drinks and pick up some booze, as Tango is BYOB!<br><br>The place is pretty dark. I mean it's like they forgot to pay the electric bill, if one gust of wind comes in, it would be pitch black in there, because its lit by candles. But I guess that sets the mood. Seating is tight.<br><br>Get the empanadas, skip the provoleta, its just melted cheese. All the steaks were amazing, well seasoned, cooked perfectly and had so much flavor. I think the best one was the Bone in Ribeye. Me being different, tried the \"Parrillada Para uno\". I chose this because it came with alot of diff meats, although most of them were salty, really fatty and not that great. Compared to my friends entrees the Para Uno deff seemed like cheaper cuts of meats. Not a big fan of sweetbread (pancreas or thymus) the texture is just weird. Overall apps, entrees, and 2 cakes for dessert  came out to around $40 for a group of 4  which is a straight bargain for a place like this. Bring some wine and you will not be disappointed!", "pics": null}}, {"review": {"des": "Very yummy! Hummus and vegetarian empanadas were a hit with our vegetarian friends. Was not thrilled to be charged for a refill on lemonade for my 3 year old. Waitress informed me about charge after she gave my child the refill.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Vk9uoPgbo2IEG1kRTI3pzQ/348s.jpg", "caption": "Hummus with pita"}]}}, {"review": {"des": "Tango Sur was recommended to me by a friend who has spent significant time living in Chicago. \"If you want downtown steak for half the price, go to Tango Sur.\" Because we canceled our other steakhouse reservation, we figured we might as well give Tango Sur a try. It was also a plus that this place is BYOB.<br><br>When we arrived at the location it was a nondescript restaurant near the corner. They also had a sister restaurant adjacent to the location.<br><br>Don't let the location fool you, the service and food were definitely A+! Our waiter sat our party of four in the corner of the dimly-lit restaurant and was always on top of our orders/water/experience. We ordered a Parrillada Para Uno, Filet with Spinach Mashed Potatoes (recommended by the waiter), and started with a seafood salad. <br><br>We were worried that we didn't order enough food, but the Parrillada Para Uno, was huge! I think it should be more of a dish for two people with normal appetites to split. From the assorted platter, my favorite was the short ribs and the sausage. It also had beef sweetbread and blood sausages for those who like more adventurous meats! <br><br>The filet was definitely the best thing we ate here. The Argentinian-style steak was juicy and tender with the juices dripping to the bottom of the plate. I really enjoyed the garlic sauce they served the meats with. It was a fresh flavoring verse the classic salt and pepper in American steaks. The Spinach Mashed Potatoes were just as good as a side as the steak was! I wish I could have ordered more mashed potatoes.<br><br>Tango Sur is definitely a location to visit each time I come to Chicago!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9zZyI1dn4Ge59H6lTQSbzw/168s.jpg", "caption": "Parrillada Para Uno"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qo-oCBBlhhujUyr1u1MLIQ/168s.jpg", "caption": "El Filet and Mashed Potatoes!"}]}}, {"review": {"des": "Eggplant parmesan kind of changed my life!  It was surprisingly to find such a good eggplant parmesan at a steak place, but trust me on this...it is incredible. <br><br>The atmosphere is perfect for a date night or romantic group setting...great prices and killer service - our wine was uncorked within minutes. I will be back for dessert!", "pics": null}}, {"review": {"des": "Great date night spot. Lots of beautiful people ( wait staff is hot) <br>The food is middle of the road for Argentinian cuisine. I've had better but the ambiance makes up for it. The standout dish I had was the morcilla ( blood sausage) I am a morcilla fiend and they def prepared and seasoned this sausage to perfection. Have returned many times just to order this dish. The crowd seem to be a mix of locals, many of whom are Spanish speaking. Def seems like you're not in Chicago but in a restaurant in Argentina. I would def  recommend this joint. Also check out the corner store they have attached to the restaurant. They sell empanadas, sausages breads and deli meats. Must try", "pics": null}}, {"review": {"des": "So delicious! I had the el filet and my husband had the T-Bone. My dish was so tender. I took it home and even reheated it was still so good. My friends had the lomo rellenio that had mushrooms and that was fire too... Also it's so nice that it's BYOB.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-w55Qm_ZGvVACsY6A9CTRg/168s.jpg", "caption": "El El Filet"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8SbO10xQ7nQl_10GJaRUIA/168s.jpg", "caption": "T-Bone"}]}}, {"review": {"des": "We dined here with reservations for a group of eight. It was a full-house, 2 hour waiting list, communal table seating along with two and four-top tables. Overall it feels cozy because everyone is packed in like a sardine, dim-lit, and...music? Huh. Barely there!<br><br>Nothing on their menu is marked for allergies, including gluten free. I called ahead of time. They said 90% of the menu is gluten free - \"all of the steaks and lots of sides.\" Two of the sides were gluten free. I had steak and sweet potatoes. Their mashed potatoes were confirmed to have gluten. <br><br>It's BYOB.<br><br>The bathrooms were clean, coat rack which reduces tripping over peoples things. Like I said, it's close quarters! Staff is fabulous - kind and expedient. My water glass was consistently filled.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bk8JL3StNvXbvmM-NvDZEw/168s.jpg", "caption": "sautéed veggies"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wK27XPsg_ezSGbEJq_GIbQ/168s.jpg", "caption": "sweet potatoes and the rib eye"}]}}, {"review": {"des": "If you love meat, this is your place! They only take reservations for groups of 6 or more, so be prepared for a wait especially if it's a weekend evening. <br><br>I've dined here a few times and on my most recent experience, the hubby and I ordered the tongue starter (only ok, I didn't know it was going to be served cold), split the filet steak with spinach mashed potatoes (delicious!), side of sweetbreads (so yummy), french fries (perfectly fried) as well as blood sausage. Everything besides the tongue starter was outstanding. Furthermore, everything is well priced so it wasn't a super expensive meal which would be the case if you dined at any of the downtown steak restaurants.", "pics": null}}, {"review": {"des": "I loved every moment of being in this restaurant. The staff is extremely friendly and works in sync. The guy at the front is a little uptight it's seems but he has a pretty important job so I let it slide. We got seated practically right away and servers came over and opened our wine for us and chilled it (BYOB). Our empanada appetizers came out after about 20 minutes and they were delicious. Our water was constantly refreshed and checked on by our waiter. It took a little while for our entree to come out but it was definitely worth it. I've lived in Argentina and though the flavors were different the food made me nostalgic and tasted great. The portion sizes are very big and some friends actually split a meal and were still full. I got Milanesa this time but when I come back I got to get that asado. It looks so good from afar. Loved the atmosphere also.", "pics": null}}, {"review": {"des": "Went here for a birthday dinner with my best friend on a Monday. We made a reservation and were sat immediately but the place was pretty much full the whole time so I'd definitely recommend calling ahead even for a weekday. As I understand it they DO NOT take reservations on weekends.<br><br>I was incredibly hungover after too much bday celebrating the night before so I ate a beef empanada to hold me over until the entrees arrived. I'm not sure if it was the hangover but it was the best empanada ever and cheap too! <br><br>We both had the filet which is also served with spinach mashed potatoes. This is probably the most glorious steak I've ever had- tender, perfectly cooked and reasonably priced too! We both ended up taking home some leftovers and those tasted great too! They also gave me a birthday flan which was so sweet of them. I was stuffed so I only tried a couple bites but the dulce de leche sauce was fab. <br><br>This is an amazing place, the service isn't super personable but they move fast and won't keep you waiting for anything. Its super dark, kind of sexy! They're also BYOB which is amazing. I can't remember if they charge a corkage or not.", "pics": null}}, {"review": {"des": "I've been going to Tango Sur for years and the experience have been amazing. <br><br>The place is pretty small and it gets packed pretty fast. I do suggest getting their a little right after they open to ensure that you will have a table. The lighting is pretty dark since they use candles at each table. <br><br>The food is amazing! Their steaks have a lot of flavor and big portions. I always have leftovers for the following day. The potatoes have great flavor and I've also tried their steamed veggies which were good as well. My friends/family love that Tango Sur is BYOB. No corkage fee either.<br><br>I suggest everyone to try this place out because you won't be disappointed.", "pics": null}}, {"review": {"des": "THE GOOD:<br>Empanadas and Bife Ancho (just a regular rib-eye, nothing fancy) were delicious!! Flavor profile was good, chimichurri sauce was a little on the oily side in ratio to the herbs. I HIGHLY RECOMMEND the empanadas, all of them. You could order one of each and it'll fill you up for low cost. I'll try the different desserts next time. <br><br>THE BAD:<br>Everyone on my table ordered different entrees that consisted of veal, stuffed prime steaks, and so on. Not sure about the quality.. and each one was cooked to medium. Not sure that I would order their entrees again.", "pics": null}}, {"review": {"des": "This is probably one of the best Latin American restaurants I've been to in Chicago on top of being one of the best steakhouses I've been too- and relatively a very affordable one too! I would have loved to try the dessert but had to leave to catch a concert. While there are very few restaurants that I visit more than once, I will definitely keep this one in my back pocket the next time I have guests to impress or have a carnivorous craving. My boyfriend and I are practically meat eaters. And this place did not disappoint. <br><br>We came on a Saturday night hoping to beat the dinner rush but were caught in the middle of it. The waiter quoted us a wait time of 45 minutes and while we were debating between ourselves whether to wait it out or not, we were called to be seated- less than a 10 minute wait- what luck!<br><br>The décor here is rather plain- and very home-like. It just comes across as romantic since it is nearly entirely candle lit. Service is very professional. Attentive without being overbearing. <br><br>There is a bit of a lengthy wait for the food BUT I think it's appropriate for a popular steakhouse. Bring wine because it's BYOB. Also, bring company that you like because you'll be spending some quality time with them while you wait on your entrees. <br><br>DON'T touch the warm bread they bring to your table! It's a trap. The rest of the meal is worth waiting for.<br><br>For our appetizer we ordered a sweet beef and chicken empanada. We made our waiter's eyes bulge a little when we told him we also wanted to order the vacio and a rib eye steak. Since technically, that was enough to feed 4+ people. But we're foodies and not opposed to leftovers.<br><br>Now for the food:<br>-Chicken Empanada (4.5/5)<br>The edges of the crust were a little thick but the rest of the dough was perfect. The filling was very meaty and incredibly tender. Worth it. Comes with a garlic-y sauce. Slather it all over your empanada for a 5/5 empanada.<br><br>-Beef Empanada (3/5)<br>A good empanada but the beef was a little too sweet (hence the name I guess...) which threw off the savory meal a bit.<br><br>-Ribeye steak- medium rare (5/5)<br>I have nothing but respect for a restaurant that knows how to not only pick a good cut of meat but also cook it to as desired. Nice and fatty. Light seasoning on the steak and some soft well-seasoned potato wedges on the side. <br><br>-Vacio - medium (4.5/5)<br>I was between this and the lomo relleno. The waiter described the difference between the two with this one being more flavorful and the other being more tender. This could have fed 3+ people. I wasn't a fan of the sweet potatoes that came with it. They didn't add anything to the dish. They were cut too large and were way too soft. Regular potatoes would have been better. The meat itself was cooked a tiny bit beyond medium- understandable because it was a huge slab of meat, but was still very good. I think the flavor would have gotten a little monotonous had it been eaten all in one sitting. Like with the empanadas, it came with that delicious garlic-y sauce which also pairs perfectly with the meat.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gfj7y4i_HSavN9x3_xoLvw/348s.jpg", "caption": "Ribeye steak"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WQDXkKq_Mpq60bl-XwFT5g/168s.jpg", "caption": "Vacio"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4mo_sVSHPLyf8LEwOG0B9A/168s.jpg", "caption": "Empanadas-delicious! Try the chicken!"}]}}, {"review": {"des": "We came here around 6 on a Friday night. The restaurant was busy but there were still plenty of tables open. I walked in and waited at the front for about five minutes for the host, who was nowhere to be seen. Side note: there is nowhere to wait and it is very unclear where you are supposed to wait at all for the host. Finally the host showed up and I asked for a table for 2 (again, I saw plenty of open tables). He asked if my whole party was there and I responded that the other member of my party would be in shortly (he was parking outside). He asked how long he would be and I said about a minute. He rudely responded, \"yeah...I really need your whole party here before I can seat you.\" I'm not sure why he asked the first question then, but whatever. <br><br>The both of us walked in together exactly one minute later and we waited to be seated. Again we waited for over 5 minutes without seeing the host. So we went to the back of the front room and asked other members of the wait staff if we can be seated. They responded that we needed to go back to the front and get the host (he still wasn't around). Finally he showed back up and sat us in the crowded back area. The restaurant is extremely cramped and dark. I get they want to fit a lot of tables in a small space but it is extremely claustrophobic and I bumped into multiple people on the way to our table. We waited forever for our waiter and finally gave up and left.<br><br>I will never go back here. I recommend going to one of the many other dining options in this area and skipping Tango Sur, especially if you want decent service.", "pics": null}}, {"review": {"des": "First of all, get a group bigger than 6 and make a reservation. Guy in the front seem like a bouncer. If your name wasn't on the list or called, you're not allowed through the gates. The line got long after the first seating, I remember hearing them say it was a 2 hour wait. <br><br>Nice romantic setting. Very dark inside but also very loud. I would not suggest bringing kids here. It's more of an adult setting. <br><br>Come with a huge appetite or be prepared to share. Servings are HUGE! My husband and I ordered the Para Dos (medium rare) which is meant for 2. I think it can really feed 4 or at least 3. Meat was delicious,  juicy and tender. It was perfectly seasoned. We had so much food left, we had no room for dessert.", "pics": null}}, {"review": {"des": "I came here with a few friends and left extremely impressed with the place. The place was packed with customers and it seemed everyone was enjoying their food. I liked how there were candles on every table, although the place was a bit too dark in my opinion. <br><br>I ordered the T-bone steak that came with mashed potatoes and sauce. The steak was cooked perfectly and the seasoning was spot on. I had some difficulty cutting it at first especially in the dark, but my friend helped me out. The mashed potatoes were fantastic, they had a lot of flavor and depth. I'd highly recommend the T-bone steak!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yvhVv_YmhJLxBZi4UZTUnQ/348s.jpg", "caption": "T-Bone steak medium rare with mashed potatoes"}]}}, {"review": {"des": "Love tango sur and the fact that it is still BYOB! We usually go during the week before 7pm to avoid the line. They have a good selection of Argentinian steak with their chimichurri sauce that they are known for. We always start off with the empanadas (my favorite are the spinach and cheese) but they also have ham and cheese, meat, or chicken. The portions of their meals are quite big and you can easily make 2 meals out of one. I had the bife vesuvio which was a fillet filled with spinach and vesuvio potatoes on the side. It was on their special menu so not sure if it will be around forever but it should! Everyone in my group enjoyed their meal and since it is BYOB you can bring your own wine to pair with your meat. Service was attentive and we always had our water glass full so not much to complain about there. <br><br>The only thing I am not a fan of is how dark and cold this place can be during winter!! I almost ate with my coat on but opted for getting hot coffee instead to warm me up a bit! I guess it can be romantic to have a candlelit dinner if you take your significant other but I would rather have more light.", "pics": null}}, {"review": {"des": "I've been to Tango Sur twice and it has been amazing both times. Their outdoor seating is very small but quaint. We started out with the Provoleta which is their melted cheese with roasted red peppers and it is such a good starter for 3-4 people. For our mean we got the filet mignon (medium rare) with spinach mashed potatoes. Definitely a shareable item and it's currently my favorite. The salmon is cooked in an orange wine sauce and served with (to my group's excitement) more mashed potatoes. We were way too full for dessert unfortunately but we're still thinking about this meal.", "pics": null}}, {"review": {"des": "Bring a gym towel because Tango Sur can and will give you the meat sweats. What an amazing experience and my first Argentinian steakhouse. Tango Sur was amazing for three main reasons:<br><br>1. Ambiance <br>2. Food<br>3. BYOB<br><br>Starting with ambiance, there's no lights in the restaurant, everything is candle lit. Makes for a great date and great conversation. It's not a quiet place necessarily, there's a lot of social groups, but you can still have an intimate conversation. <br><br>The food was amazing, I had the Filet, which was two large filet chops cooked to perfection. Brought one chop home for leftovers and it was amazing the next day. <br><br>It's BYOB so you can save money on booze and spend a little more than usual on the food. <br><br>Pro Tip - try at least two different empanadas, they are l delicious!", "pics": null}}, {"review": {"des": "A nice neighborhood, Argentinian steak place. No liquor license, so BYOB-bring your own booze.<br><br>You come here for the ambiance and life of this place. The servers and busboys are both busy and friendly. <br><br>Good service and a lot of menu items to choose from. The epanadas with different fillings were a great start. Also, the ribeye and sirloin steaks were great entrees. They are a bit thin, however, so maybe consider ordering medium rare, if you normally order medium.", "pics": null}}, {"review": {"des": "Made a reservation 2 days in advance and had to wait an hour after our reservation to be seated. Food was okay but the service was terrible, should learn how to run a restaurant. Would NOT recommend.", "pics": null}}, {"review": {"des": "Mostly love this place, we get the el filet. Knocked a star off bc last tome we went our meal tasted terrible but we've had mostly great experiences so hoping that was a fluke! I do wish it were slightly less dark and noisy inside but that's part of the ambience there", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9yj4KK0gGHzedty4-0Xu_g/348s.jpg", "caption": "The main menu, the el filet is our go to!"}]}}, {"review": {"des": "So delicious!!!! I've been here 3 times with different groups of people and everyone enjoys their food. It's a romantic atmosphere so it's great for a date but beware, YOU HAVE TO MAKE A RESERVATION!! one time I came without one and didn't get a call for a table for 2 hours (there was no special holiday going on, it was just a typical Friday). That's how great this place it! I definitely recommend them for larger group dinners. It's a little cramped but there's something for everyone on the menu and from what my friends who've hosted events tell me there's a lot included in the price per person. I recommend the Vacio dinner and the empanadas are delicious!!", "pics": null}}, {"review": {"des": "This was the best breast of chicken I've had in my entire life. It was juicy and full of lemony flavor. Honestly I've never had a better seasoned piece of chicken that was everything BUT dry and dull", "pics": null}}, {"review": {"des": "Seriously my favorite steak restaurant in Chicago and one of my overall favorite restaurants. They are BYOB and have a bodega next door with beer and wine choices. I love the cute and romantic atmosphere in there with candles on every table, although sometimes it feels a little bit too dark. Many nights they have a live guitar player playing relaxing and beautiful music. <br><br>I love to get the empanadas and the el filet steak which comes with spinach mashed potatoes. The steak is enough for two people to share and is amazing. The best part is that this place really isn't too expensive for a steak restaurant. Always great service here too.", "pics": null}}, {"review": {"des": "This is one of my favorite Argentinian steakhouses and apparently it's everyone else's too, because the wait can be super long. However, the staff is always friendly and quick to get people in and out in a timely manner. <br><br>It's BYOB, which is a plus. They provide a bucket of ice. Everything on the menu is delicious. I especially like the empanadas. I could probably eat ten of those and leave happy. The stars of the show are the meats, of course, which are always perfectly cooked and packed with amazing flavors. On my most recent visit, I tried the pork chop. It came with a veggie medley and a sauce that I've yet to replicate at home. <br><br>Portions are huge so you probably won't have room for dessert, but you should still get it anyway :)", "pics": null}}, {"review": {"des": "We have been wanting to try Tango Sur for the past year or so, we have heard such good things about it!<br><br>We decided to go during the week and it was busy for a weeknight. We waited for 15 minutes or so...<br>Yes, its dark<br>Yes, its crowded<br>but the food is so worth it.<br><br>We got a few empanadas to try as an appetizer, which came with chimichurri sauce (SO GOOD)<br>Then we both ordered our own steaks and I probably only ate 1/3 of it.<br><br>We did get dessert & they come with a plate of different options.<br>Everything was so good & so worth it!!!<br><br>Cant wait to come back!", "pics": null}}, {"review": {"des": "Tango Sur has redeemed itself! This used to be my fav restaurant for many years. Then I had a few bad experiences and soured on it. I have returned a few times over the past year and it was very good again each visit. Yay! Great ambiance (love the music), food and service. Empanadas are the best in Chicago surely in the US. I need to visit Argentina to know if they are up to par there. The peach cake desert is highly recommended. In the summer,the patio seating is nice. On the Southport Corridor and close to the Southport brown line stop.", "pics": null}}, {"review": {"des": "I have been wanting to visit Tango Sur for so long, so I used my birthday as an opportunity to dine here. I was so sad that we didn't have such a great experience though. Upon arriving, we had to wait about 15 minutes even though we had a reservation. After finally seating, we ordered some appetizers and opened our bottle of wine that we brought- love the BYOB option! <br><br>We tried a spinach and cheese empanada and eggplant empanada, which were both delicious. We also shared the seafood salad, which was very light and refreshing. Our main course, however, took FOREVER....we had to ask the waiter where our food was it took over an hour! Finally when the food came, I immediately regretted getting the Lomo rare. It was basically like eating raw chewy beef. The other steak dishes were very deliciously cooked and seasoned though.<br><br>We also brought an ice cream cake for my birthday that we had the restaurant store in the freezer. However, the waiter brought it out and left it sitting at the counter without giving it to us. By the time he brought it over, my cake had melted! I was devastated. We ate whatever ice cream soup was left and couldn't take it home. When the check arrived, we were also appalled that we were given a sharing fee! We were never warned of this, nor did the waiter even split our dishes or anything. Luckily, the manager took this charge off after we complained, but nevertheless I was left with a bad taste in my mouth...", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PhNfZIGs3YnWTWHxQdh1zg/168s.jpg", "caption": "Lomo"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/beD72PQzO8WdkjmTNIXx6w/168s.jpg", "caption": "Seafood salad"}]}}, {"review": {"des": "One of my favorite steak places outside of downtown area and without the downtown price.  It's BYOB which makes it awesome.  The empanadas were to die for.  Their chimichurri sauce is the best.  I've been here several times and ordered different cuts of steak and all of them have been delicious, well seasoned and good cuts.  Portions are big (the el filet is actually 2 filets).  My only complaint is the wait - we came before 6:30pm on Saturday and waited nearly 2 hours.  It was jam packed.  They will take your name down and text you if your table is ready.  It's dark and romantic inside but super loud, not a good place for conversation.  If you forgot to bring a bottle, just go down a couple stores to Bodega Sur, great wine selection.  Be ready to wait a while and be ready to eat a lot of meat!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/T9O2Nd2Tf4hrBIXxtnsi9Q/168s.jpg", "caption": "El filet, actually comes with 2 filets"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rvu8yXP5YzL5xIqpDqcKpQ/168s.jpg", "caption": "I think this was the Churasco"}]}}, {"review": {"des": "The food was really good. Unfortunately, the server wasn't. He was not attentive and kind of stand offish. My child and a friend was with me. I'm sorry they had to experience this disconnect. Enough of that though. On to the food... Those chefs are fantastic. My chicken and riveted steak was succulent, flavorful and tender tasty lol. It's a shame because I wanted to give this place 4 1/2 stars. Service is everything to me. I felt like an outsider.", "pics": null}}, {"review": {"des": "I had such good time with my friends, so thank you so much Tango sur, foods are sooo yummy", "pics": null}}, {"review": {"des": "The seating arrangement in the first room is horrible. You have to walk to the back of the room to get to the host. Why? Also, the servers continuously bumped into the back of my chair. I was right by the door. <br><br>They should make this first room into a bar with few tables.  <br><br>My filet tasted like pork and I hate pork. Maybe something else on the menu is better, IDK. Don't want to go back.", "pics": null}}, {"review": {"des": "Sad to say nothing spectacular about Tango Sur, as it was really hyped up by friends of ours as one of their favorite places.<br><br>We met there on a Friday night in January or February, and I was pregnant, but not like SUPER pregnant.  The restaurant was PACKED, and I understand they get really busy and don't take reservations, but that should not be an excuse to have far too many tables in the space.  We were crammed into a 4 top which should've been a 2 top in the corner of the room, I had to belly check several seated patrons just to get to the table.<br><br>We started with the Provoleta and an eggplant appetizer that was on special.  It was alright, nothing I remember distinctly.<br><br>I had El Filet for dinner, and was advised by our friends to order one degree *more done* than normal, because they have a tendency to undercook their meat.  So, I ordered it medium... and they were right... not only was it not medium, it wasn't even rare.  It was BLUE.  I ate around it, and brought the leftovers home.  The spinach mashed potatoes were bland and weird.<br><br>One of my friends also ordered a steak, and his came very well done, even though he also ordered it medium.  When he sent it back, the server argued with him about it... which was the last straw for me.<br><br>I'm glad we got to see our friends, but I won't be coming back to Tango Sur.", "pics": null}}, {"review": {"des": "The food: 4/5. We tried empanadas and half a chicken. Empanadas were good, not too heavy although the dough was a little thick for my taste. The chicken was a little dry, but the sauce was delicious. <br><br>The service: 4/5. The service was very friendly, but a little slow. <br><br>Overall: 4/5. Come to get your meat fix.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HiGP6VVaw_Hm03weEYnqzw/348s.jpg", "caption": "Half a chicken"}]}}, {"review": {"des": "Sat outside on a beautiful Chicago evening for a double date. BYOB which helps keep the tab low. The filet was cooked perfectly (medium) and was perfectly juicy and tender. Very kind server. The spinach mashed potatoes were the best I've ever had. Empanadas are a great starter!!", "pics": null}}, {"review": {"des": "We started with the cheese app (idk what it's called) it was great. It's basically melts cheese but the bread and cheese combo is so damn good. I had the el filet and the sauce,steak, and potatoes were incredible! So juicy and melt in your mouth good. I will note that I got Vesouvio potatoes I stare of the spinach mash (which I regret) but they were still pretty great. Two other people got some other types of steak and they were also both incredibly good. All the of the meat just melts in your mouth. Service was pretty good.<br><br>We came on a Sunday at like 530 and got seated right away. I was floored by that. Usually the wait is forever idk what came together in the heavens but it worked. <br><br>I would absolutely recommend this place. Also BYOB", "pics": null}}, {"review": {"des": "Family friends from Argentina originally recommended Tango Sur and I did not have the opportunity to visit the location until recently. Reading through the restaurant description, we were enticed to go after finding out it was also BYOB.<br><br>We made reservations for eight people to go on a weeknight at 7:30PM. When we showed up the place was almost empty, there was only a couple other tables that were being served. The ambiance consisted of tables covered with white cloth and the dim lighting coming from candles. The waiter immediately sat us down on the table prepared for us.<br><br>I ordered the ham & cheese empanadas and a Parrillada Para Dos. The empanada, which is essentially a ham & cheese stuffed pocket was so good that I had to order one more. A few minutes later, the Parrillada showed up and we were overwhelmed by the amount of food. I personally enjoyed the sweetbread and short rib the most, but the dish included other cuts of meat, including blood sausage. We ordered the meat medium rare and it was cooked to our standard, the meat was tender and flavorful. <br><br>For a steakhouse, it is by far one of the most economical ones I have been to. They offer a good amount of food for a great price. This is one of my favorite places to go if I am feeling like eating steak and would highly recommend to friends and family.", "pics": null}}, {"review": {"des": "Awesome Argentinian steakhouse in Lakeview! And they're BYOB!<br><br>My fiancee took me here for my bday last Friday night. They don't take reservations for small groups so we got there early (between 6 and 6:30) and didn't have to wait. The restaurant is very dark and very cozy. Perfect date night spot!<br><br>We started with the Provoleta, which was this delicious, gooey mess of cheese and peppers. The staff kept the bread coming too which was great. Fiancee got the Ravioles with spinach filling and I went with the Bife de Chorizo. My steak was pretty good and came with some really tasty vesuvio potatoes and a side salad. All that for only $25!!<br><br>Can't quite go 5 stars (meat could have been a little better) but it's hard not to love a fun, BYOB, affordable steak house away from downtown like Tango Sur!", "pics": null}}, {"review": {"des": "I came to Tango Sur on a Saturday night for a friend's birthday. Luckily we had reservations at 10PM. I was amazed how crowded the restaurant was at this time! The place was packed. I would highly recommend making reservations if you plan to try Tango Sur.<br><br>The Wait/Interior: Even with reservations, we had to wait a bit to be seated. The tables are packed in together and a little cramped. It's lit by candlelight so it's fairly dim.<br><br>The Service: Once we were seated, a waiter helped us right away. He went over the menu and gave us recommendations. I thought the service was good throughout the meal.<br><br>The Food (Appetizers/Starters): They brought us bread to start - I thought the bread had a good flavor and was crispy. It was nice, but easy to fill up on so pace yourself.<br><br>We tried a variety of empanadas, but my favorite was the spinach and cheese with the herb-olive oil sauce they brought out. It had more of a depth of flavor than the meat empanadas, which got a little one note after a while. <br><br>We also tried the provolone cheese and red peppers appetizer (Provoleta). While it was good, I didn't feel like it was anything unique.<br><br>Pro Tip: Alcohol is BYOB<br><br>The Food (Entree): For the main course, I split the Vacio. It was huge! Be ready to eat if you get the 2 person serving. It was delicious - the meat was cooked exactly as we asked. It was tender, juicy, and flavorful; as full as I was, I still ate more than I thought I could because it tasted so good. It also comes with big pieces of cooked sweet potatoes. They had absorbed some of the flavor from the meat and were well seasoned. Overall I enjoyed the dish very much! I would highly recommend and will definitely be back to eat it again.<br><br>Even though the wait at Tango Sur is daunting, I would say that it's worth it for the food. Give it a try next time you're in Lakeview :)", "pics": null}}, {"review": {"des": "There is only one right way to eat a fillet- with greed in your heart and with a smile. I'd definitely comeback here. I'd recommend ordering the empanadas as well. <br><br>Pros: The customer service was awesome. It's BYOB. <br><br>Cons: \"The 4 hour wait\" totally understandable. It's slightly noisy.", "pics": null}}, {"review": {"des": "Overall: Despite its flaws, Tango Sur is a great option for a smaller steakhouse with some Argentinian flavor.<br><br>The good: The steak is phenomenal, I loved every bite and couldn't finish the large portions. The steak was tender and the potatoes were seasoned perfectly. The empanadas and antipasto apps were also delicious. I tasted everyone else's meals as well, and they were all great. The vibe is rustic, casual, and welcoming. And, of course, BYOB.<br><br>The bad: The service was not up to expectations. Our waiter didn't really have app recommendations. After ordering apps, he took a long time to come back to take our main order, and then our bill took a considerable amount of time. Live guitar music was a good idea, but it was far too loud (electronic hookup) and the guy wasn't fantastic.<br><br>Atmosphere: 8/10<br>Service: 7/10<br>Food: 9/10", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/I0u4dRWL6MbApFk1svjW5w/348s.jpg", "caption": "Vaxcio steak"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vuTMcwA4rv40fmnlzKbKDg/168s.jpg", "caption": "Antipasto"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YNkUVbfxSMDMAvuy2Tvkxg/168s.jpg", "caption": "Empanadas"}]}}, {"review": {"des": "Visiting from out of town, we chose to sit inside rather than outside during the early evening. The candlelight ambiance was not quite expected, but soothing and came to be a nice touch. The waitstaff was friendly and helpful when needed. Our waiter provided outstanding service. Noticing that the had Guarana on the drinks menu, I struck up a conversation with him about Brazil and our shared love of the drink. While we took longer to order than most diners, the staff was very patient with a family that had two children. <br>The short ribs were amazing and I discovered that the vesuvio potatoes are a new favorite. <br><br>I have only the highest praise of this establishment. I recommend it to anyone.", "pics": null}}, {"review": {"des": "I visited here recently for my birthday and everything about it was excellent.  Service was great and I knew it had to be good because it was slammed on a weekday.  Our server was knowledgeable and friendly.  So much that he brought a surprise dessert to our table after overhearing it was my birthday.  BYOB makes the experience quite affordable given the quality of the food.  I got the bife ancho and it did not disappoint.  My mouth is still watering thinking about it!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XJfhNKegLfU3blDPXkixpw/348s.jpg", "caption": "This is the Bife Ancho.  My mouth is watering looking at this"}]}}, {"review": {"des": "Everything here was amazing . We started with the beef empanadas and also tried spinach and cheese . The beef were very good , spinach and cheese was also good but we prefer meat over vegetarian. After agonizing over the menu for a while, we asked the waiter what is the most popular and he had said el filet, and a chicken / potato dish. We ended up both getting the filet and it did not disappoint. Medium rare he had mentioned would be a little bloody, but I didn't think it was too rare by any means . The mashed potatoes were amazing as well.<br><br>This place is BYOB, and for 3 empanandas and 2 entrees our total was under $75. Can't beat it ! Would be fun for a group or couple. The lighting was dim but the music was upbeat . Definitely a must go !", "pics": null}}, {"review": {"des": "My aunt and uncle came to visit from Hawaii and are \"big fans of Latin cuisine\". Those were their exact words lol. I took them here and they had an amazing time! They loved the food, atmosphere, and that it's BYOB. Everything we ordered was delicious and cooked perfectly. We also got the flan for dessert and I'm drooling just thinking about it. Definitely recommend. Also, ask for Alfredo as your waiter. He's perfect!", "pics": null}}, {"review": {"des": "Although the food and the ambiance are great, anyone who has been to Tango Sur before knows they always over book their reservations and you could be waiting an hour past your reservation time to finally be sat. With that said, my family and I went to Tango Sur this past weekend to celebrate my dad's 60th birthday and I made the reservation early knowing how Tango Sur operates. <br><br>We got sat at our reservation time and ordered a few appetizers. We felt like it had taken awhile for the server to come back and take our order but having worked in the restaurant industry before we try to be understanding knowing things happen and one can get very busy. We ordered about an hour after being sat and everything ran smooth from there; we ate, sang happy birthday and paid. <br><br>After we paid, we sat a little longer to finish our bottle of wine. By this time it's a little after 9pm. As we're sitting there a, what I would call, \"less than a woman\" came up to us and harassed us and made a scene. She told us that she had a party of 20 waiting outside and that the people who worked for Tango Sur told her that we were asked to leave multiple times but we refused to leave and that we needed to leave! She said there was a time limit on the table and said that they had a reservation at 9pm and they were waiting on our table because it was her husband's birthday! Like she was entitled or something! By this time you can only imagine that my family and I were appalled by this \"less than a woman's\" behavior. We could not believe we were experiencing this and told her that we were celebrating my dad's 60th birthday and that we would leave when we were finished. At this point, we were also were wondering where the management was. <br><br>We were NEVER asked to leave. In fact, the server had opened our last bottle of wine 10 minutes prior to this ignorance coming up to us. Also, a few minutes after she stomped back outside because she was so mad that we wouldn't leave when she demanded us to, the manager came around the corner. I told him what had just gone on and how disturbed we were after experiencing this woman's outburst and ignorant entitlement. He proceeded to say sorry and said there was a party waiting and if we could finish up they would appreciate it. We were beyond irritated and disappointed by this time that we just wanted to leave. <br><br>As leaving, you have to pass everyone that's waiting to be sat, so I knew we were going to have to pass this woman and her party thinking they're entitled and privileged so I thought to myself, I'm going to try to smooth things over and tell her we didn't know there was a time limit on the table and we apologized. After I told her that, she proceeded to yell at me saying \"no! You shouldn't have taken 3 hours!!\" At that point I had enough of her crap and had some words for her. We had walked away down the sidewalk a little but had to wait for more people from our group to catch up to us. As her party walked in and got sat, one guy from their party stayed outside to stare down my brother and taunt him. Then started walking toward my brother like he was going to fight him!! I had to  try and push the guy away, mind you people were on the patio of Tango Sur, eating dinner outside having to witness this ridiculousness. Luckily it didn't go any further than that. <br><br>Needless to say, the whole experience that we had with this \"less than a woman\", at the end, ruined our evening and the celebration for my dad's birthday. <br><br>Tango Sur did nothing and basically just watched this all happen. The fact that she was able to come in and harass us is just unacceptable! All we got was a sorry and yes please hurry up and leave, which is ridiculous too! And if they do have a \"time limit\" on their tables they should say that and not talk crap and tell lies about us saying we were asked multiple times to leave and refused to leave (if that was even true). It is very disheartening and truly shows that the people and management who work for Tango Sur don't know how to run a business. It's really sad because we were having a great night and enjoyed our meals but that ruined it all and we will never go back.", "pics": null}}, {"review": {"des": "Service was very slow. We sat for over an hour before someone even took our appetizer orders. It was also so loud you couldn't hear the person in front of you. It was also so dark in the restaurant I couldn't see my menu and could barely see the food i was eating. Finally, for a restaurant that is that busy and charges that much for food, they should be able to afford to paint their walls. There was more patching on the wall than paint. But, I'm willing to look past all of this if the food was worth it, but..<br><br>We ordered empanadas for apps and they were very good. I also enjoyed my steak, though it was a bit tough. However, I almost got up and left when they brought me my side salad. Shredded lettuce, one whole tomato slice laid on top, and two slices of white onion. The dressing was oil and white vinegar. They literally brought me toppings for a burger. This was borderline offensive because of how much we were paying to eat here. Make a real salad, Tango Sur. Come on.", "pics": null}}, {"review": {"des": "I cant believe I havent wrote a review for Tango Sur yet! I have been here at least 10 times!<br>Every birthday party, anniversary, engagements have been happening here!!! The atmosphere is amazing! Great for date night although it get a little loud sometimes! <br>Food is very good! I mean really really good! The portions are huge! Two people can easily consume one plate! Wow!! I always go with Churrasco but this time got Beef Vesuvio with cheese and spinach! Omg! <br>The empanadas are the best!!! I would say best in the city! Hands down!<br>And its BYOB!!!!! You cant beat that!!!", "pics": null}}, {"review": {"des": "I had to come back.  I had to!  My friend and I order different appetizers this time, Russian salad, marinated eggplant & veal/vegetable, all were absolutely delicious.  We opted the same Parrillada Para Dos for our main course because it tasted fabulous during our last visit.  Patrons were still walking in around 8:30 p.m. on a very frigid January evening.  This place must be doing something right!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VSo44JkXUHRJaW_eqwhD_Q/348s.jpg", "caption": "Flan"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/V_P7MR7eaeZTwmPR1mVQuQ/168s.jpg", "caption": "\"Waffle cake\""}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BBbDNz9_NfPMCLKnMux0OQ/168s.jpg", "caption": "Parrillada Para Dos"}]}}, {"review": {"des": "The el filet, spinach mashed potatoes, and the empanadas were fantastic, amazing, and worthy of all the praise that is being heaped upon this place .  The churasco wasn't very good.  The salads involved so little effort on the part of Tango Sur that it was a little weird, some unhappy tomato slices on a bed of nice greens.<br>Also the portions are large.  The filet was shockingly big for the price.  When I come back the el filet can be split between two people and get some more empanadas.", "pics": null}}, {"review": {"des": "Been here a second time and does not disappoint! The food, specially the steak selections are outstanding!! The ambiance and service are awesome too.  I like the fact the waiter recognized us as Latino and asked if he could talk in Spanish...so we ordered in Spanish...the experience was very authentic given the restaurant type.  The empanadas and chimichurri were amazing.  It is still BYOB!!", "pics": null}}, {"review": {"des": "I had this place bookmarked for literally years and just always ended up choosing somewhere else to try while living in Chicago. On our most recent visit to town, I was super surprised my friend suggested it for a little catch up dinner.<br><br>This is definitely a date place, very intimate small tables, and they squish quite a few in the small space they have. The entire place is practically only lit by candle and very dark, but I guess if you wanted to take someone on a nice first date but feel self conscious about being a sloppy meat eater, this spot definitely sets the right ambiance for that...<br><br>The 4 of is split two of the meals for 2, which for $40 included a (pretty sad excuse for a) salad and an assortment of meats serves on this little tabletop presentation. It's not grilled tableside or anything like the menu may seem to suggest, but really a sterno to keep your food warm, and it looks pretty cute.<br><br>The meal was a good deal! The meats were cooked and seasoned well, and it was a lot of food for the price. The richness definitely hits very hard and very fast - plenty of food for people <br><br>We also split 2 empanadas to try, and I definitely would eat more of those next time. Based on what I tried, I liked the food, esp for the price and BYOB, but I'll probably branch out a little more next time from the set meal.", "pics": null}}, {"review": {"des": "The flavors, sauces, and spices were fantastic however the cuts of meat were subpar. I had a sampler of different meats/sausage. Most were tough and gristly. This place is overrated. BYOB helped. Not really happy with the experience!", "pics": null}}, {"review": {"des": "If I were to take someone on a date in Chicago, Tango Sur would probably be the perfect spot. This romantic and hip restaurant is located in Lakeview, near Wrigley Ville, so it is one of the most beautiful neighborhoods in Chicago.<br><br>One of the most appealing things of the restaurant is that it is BYOB, without any cost for bottle-opening. <br><br>I've been here twice. The first time I had the mozarella salad, which is a delicious and fresh dish, perfectly paired with a red wine.<br><br>The second time I came here, I had the Eggplant Parmiggiana. This dish is one of the most delicious I've ever had, and I've eaten lots of eggplant parmiggiana around the world. <br><br>The service is very good, people are very kind. Definitely a must-go restaurant in Chicago.", "pics": null}}, {"review": {"des": "I thought this place was too hyped up to be honest. Now, keep in mind, I'm not a huge meat eater. My friends seemed to love the place. I thought the interior was pretty nice and the bathroom with the collage was executed well. It was neatly done. However, I think the cutains on the side entrance and windows could have been more elegant. We were there for an early dinner and the lighting was much too dark. It may be great for a romantic date, but it was only three o'clock and the dark lighting was putting me to sleep. <br>I ordered three empanadas and I don't have any complaints. They were filling and pretty yummy. I asked for one chicken one beef and one ham and cheese. Unfortunately, they just gave me two beef and one ham and cheese. However, I liked the beef one a lot, so no big deal. My boyfriend ordered the surprema. Which was chicken with ham and cheese...I thought there was going to have pasta with it, I was wrong. I thought it was a tad bland. The steak was made medium and it was great. The flan, which I typically am not crazy about, I loved it!! It had this amazing carmel drizzle on top. It was divine. I'd go back for the empanadas and flan!", "pics": null}}, {"review": {"des": "Pros:<br>- It's cheap steak... but you also are getting what you pay for (select or D-grade)<br>- Huge portions... (but do you really want huge portions of tough, chewy meat?)<br><br>Cons:<br>- Low quality meat<br>- Super hard bread. They don't make or give butter cubes. They give you a couple cheap, plastic butter packets<br>- VERY dim lights and dark walls. It's unintentionally like eating in the dark... but if you're into that kind of experiential eating, this might be a pro for you<br>- Rude bus/water boy<br><br>-----<br><br>Is Tango Sur cheaper than downtown steakhouses? Yes. Is Tango Sur's quality of meat that much lesser? Yes. It's tough and chewy meat.<br><br>We got the highest end ribeye they offer, and it was tough and chewy meat. Think like select or D-grade. It was passable and cooked well, but you can't hide the quality of meat. I'd rather pay $20-30 more for prime or choice cuts... and more pleasant service.<br><br>If cost is more important to you or you are not in love with steak, then by all means, go here. But if you don't mind paying $20-30 more, then just go downtown to the original Morton's, The Firehouse, Lawry's, or wherever you prefer that serves prime, tender meat.<br><br>But some people really like this place. Some of my friends have raved about it. We finally tried it, but it's just not a true steakhouse to us. I recommend you give it a whirl at least once and see what you think for yourselves, though. It's cheap enough that if you dislike it, you didn't lose much.", "pics": null}}, {"review": {"des": "I was able to check this place out a few weeks ago for dinner for a friend's bachelorette party. It was great because it was BYOB so we brought bottles of wine and some beer. I don't even think they have a corking fee! The place itself is super dark - intimate and romantic if you're on a date; but otherwise, it's kind of annoying. I had to use to flashlight on my phone to read the menu properly. <br><br>To start, we ordered some empanadas. I had the spinach and cheese one and it was delicious! I loved the chimichurri sauce that came with it! The people at the table that tried the other fillings also enjoyed theirs! I ordered the eggplant dish \"with the delicious tomato sauce\" - it literally says that on the menu. The dish did NOT disappoint- the sauce was AMAZING and the dish overall was delicious! <br><br>Apparently, we had the table for 2 hours? We were reminded of that a few times. However, by the time we ordered and got our food, there was no way we would be done by the time our table had to be emptied. Luckily, they didn't kick us out or anything and allowed us to finish our meals. <br><br>Our table had plates of butter on it and other tables had bread baskets so I asked if we could get some bread. One of the guys came and placed a basket of TWO rolls on our table... our table had 8 people.<br><br>Overall, the food was great.. the atmosphere was intimate... the space was too dark for my liking.. and the service was ok. Love that it's BYOB!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UDyscdCxuW7-21xXIVGMqg/168s.jpg", "caption": "Eggplant (Berenjena)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WaLToYZiQ82VGqEMZReupQ/168s.jpg", "caption": "Empanadas"}]}}, {"review": {"des": "Omg!! I'd have to say easily one of my top 5 favorite restaurants in the city! The ambiance is dim, lively, and fun- perfect for a romantic date but also w a group of friends (ya, kinda contradicting statement but it works?!) I've ordered pretty much everything on the menu, the red meats are great, but my all time favorite are the sweet breads, all empanadas, and the pechuga de pollo! The portions are huge here and it's BYOB. I feel like for a steak house, it's very reasonable in terms of price, and the food quality is a 5/5. I can't wait to go back!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CGntdvrXNdaXC61Pg9dj5A/348s.jpg", "caption": "Pechuga de pollo! Mmmm"}]}}, {"review": {"des": "Many local Argentinians have recommended this place to me and said that it is the best in the city. It also just so happened that on the way to Jeni's, our uber driver also recommended it to us. I went in with friends, as a group of four. <br><br>We ordered the Medio Pollo al Limon and Lomo Relleno. The amount of food we anticipated was not even close to the amount that we got. We thought what we ordered would be a good amount of the four of us. The amount that we got could feed a small village. The Medio Pollo al Limon could have fed at least me and 2 other girlfriends. The lemon and chicken combination was delicious. It had just the right amount of tangyness that was present but still enjoyable. The Lomo Relleno was a tad overwhelming. The meat was cooked so perfectly. It was tender and flavor was present wherever your teeth sunk in. However, I must say that it was a bit too salty, and the mushrooms that were included in were extremely salty. We only finished half of the Lomo Relleno, and I took about a quarter of it home and ended up splitting it into 4 meals (I could only eat so much of it each meal). <br><br>This is definitely somewhere I would refer to as romantic. The lights are extremely dim and for the most part don't light your table. Candles brighten up your table, but can be sensitive for some eyes. At Tango Sur, the amount of food definitely matches up with the price you pay, if not more. Make sure you're super hungry, or that you're coming with a big group!", "pics": null}}, {"review": {"des": "Did not have a reservation but was able to get a table on a Saturday night. <br>Portions are enormous and prices are super reasonable. Will definitely return", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JMUBu2JrPra9R5vhYN2Tyg/168s.jpg", "caption": "Ribeye"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_HuSgnn8aPRJr0zds0LsgA/168s.jpg", "caption": "Churrasco"}]}}, {"review": {"des": "Whether it is their amazing steaks, the atmosphere, or that you BYOB Tango Sur, is popular for a reason. They do not allow call aheads. Someone else mentioned a reservation, though I was not aware they accepted them. So either try a reservation or make sure you have the time to wait (and we wanted two hours on a Saturday night) because it is worth it. The staff is not good at estimating how long the wait will be. I suspect that this is due to diners lingering after the meal after having succeeded in scoring a table. The staff does not rush diners out the door either. There are several bars in the immediate area that are good so as long as you plan ahead and are not immediately hungry, this is a good option. You can also go buy a bottle of wine at their sister restaurant next door. <br><br>The patio is pleasant and the interior is dark, lite primarily by candles. It's a romantic and cozy atmosphere, though it can get a bit loud. The service is friendly, though a bit slow (again, make sure you have enough time as to not feel rushed). While Tango is a steak place they do offer other options. One in our group was not a red meat eater and ordered the half chicken. I was impressed how well they did chicken. Perfectly roasted and seasoned. My steak was amazing and cooked exactly to order. It came with mashed potatoes, and this is where I was disappointed. If you are going to do a great steak do not ignore the side. Others ordered sweet potatoes, steak fries and asparagus and all of these sides were very good. So stay away from the mashed and you'll be satisfied.", "pics": null}}, {"review": {"des": "Love this place. The spinach potatoes are so good I wish I had the recipe. But then it would b hard not to eat the whole bowl! I had the filet and actually think the dish could be split because they give you two filets and quite a lot of potato. And this is after I've already exercised no self control around the bread starter. been meaning to come back.<br><br>They were playing electro tango when I went which was cool. It's dark and moody here, good place to take a date.", "pics": null}}, {"review": {"des": "Tango Sur is a steakhouse with a Latin American flair. I love the concept and the setting, and wanted so badly to love Tango Sur as a whole. But when I reflect on the experience, it just doesn't deserve more than 3 stars (although I'll eventually give it another try and reconsider).<br><br>The setting is unique. It's romantic, but not uppity. Dark and cozy, it's the perfect venue for a date or dinner with close friends. I visited with my parents and boyfriend for my mom's birthday. Although they don't formally take reservations, they were quick to accomodate and were able to put us on the waiting list in advance. When a table opened, we were seated right away.<br><br>The menu is expansive but inviting. Since I'd filled up on hors d'oeuvre at home, I oped for salmon as a lighter option. The description sounded delicious: seared & baked salmon filets with an orange cream sauce. Citrus always pairs well with salmon, but this time it was orange overload. This dish would have benefited from a light drizzle, but my salmon was swimming in this sauce that tasted reminiscent of orange chicken. The boys both ordered T-bone steaks. They weren't the best steaks in the world, but then again filet minot is my cut of choice. My mom ordered a salad and was underwhelmed with the options (albeit, who orders salad at a steak house?). <br><br>Although the service upfront was accommodating, it would have been much improved had we received more visits from our waiter and from the server assigned to refilling water glasses.<br><br>I'll leave you, fellow yelpers, with a final piece of advice. Be cautioned that it's BYOB, and I highly recommend you bring a bottle of wine to accompany the food.", "pics": null}}, {"review": {"des": "Good luck making reservations for 2 people because they dont take reservations for less than 6 people. They said to walkin and first come first serve but when we did..the white people in front of us were told 15 mins and we were told 2 hours. Is it because im not white. We drove 45 mins to be told  that and to try the restuarant next door because its the same owner. I think that if i wanted to try another restaurant i wouldnt have come here in the first place...rude. anyway i am 7 months pregnant and not about to wait 2 hours. Ive been here before food is ok, not to die for but i  was craving steak and because of this i will never come back ever. Little racist.", "pics": null}}, {"review": {"des": "Food: we ordered the filet and green mash and the flavors were good. It came with a salad which isn't an accurate description of the dish, it was essentially leftover burger toppings (lettuce, onions, tomato) and was not enjoyable at all. Also BEWARE!!!! this was a big dish so I split it with my fiancé and was charged an $8 sharing fee!! This fee is listed at the end of menu where the logo usually is, but no food items. This was extremely shady and disappointing. Definitely took away from the experience. <br>Sweet beef empanada was delicious. <br><br>Service/ambiance: average", "pics": null}}, {"review": {"des": "I came here about 6 months ago and just never wrote the review. A friend and I ordered the parilla & the filet w/spinach mashed potatoes. I'd never had them before until here and they were good. My steak was a little too well done. I wasn't a fan of the various sausage meats they served. Some were too well done, or not done enough. I just didn't  enjoy it as much as I hope. Then they're byob so we didn't have liquor. It kind of ruined our girls lunch. Oh well. Their service wasn't that grand either. Everyone was watching us like we were something they've never seen before. I felt uncomfortable w/them stalking my body parts. <br><br>I may give a 2nd chance 1 year. Lol", "pics": null}}, {"review": {"des": "Seriously just the best place! The chimichurri sauce from here is amazing! If you don't get enough, then sell it by the pound next door in the market. <br><br>One quirk, but I like it is that you bring your own wine. There isn't a corkage fee, it's just how it's done here.", "pics": null}}, {"review": {"des": "Amazing is the only word. Best Latin steak house in the city. The El filet is the perfect meal with the spinach mashed potatoes.  Great place to bring friends or family. Book at table in advance, there is usually a wait.", "pics": null}}, {"review": {"des": "Great ambience. BYOB. I came here for a birthday party and it was the perfect vibe.", "pics": null}}, {"review": {"des": "Advice for everyone, don't come in on weekends, we waited for two hours even they said about one hour, at the end we left, who knows how long we would stay outside. It would be nice if they said there is no place that night. We wouldn't be outside on rain! There is no rating for this place, for sure I'm not coming there again!", "pics": null}}, {"review": {"des": "Checked in at 8.36pm Saturday night for a party of two. We were told an hour wait. We were seated a bit after 10pm; I stopped checking the time. Our waiter was nice. That's about it. We asked for an ice bucket about 2 or 3 times before we received one. We asked him to explain the beef sweet bread...I still dont know what it is. I ordered the 160z Tbone medium. The sauce was delicious. The steak was cooked well past medium. My husband 16 oz. Rib eye was also overcooked served with plain hard sweet potatoes. The atmosphere was dark and sexy as to be expected from an Argentinean steakhouse. I wouldn't plan to go back but wouldn't mind stopping by if there was no wait time and I was in the area.", "pics": null}}, {"review": {"des": "They lie about how long it will take to get you seated. Literally got there when they told us to come (9PM) and we had to wait an extra half hour basically. They have some poor white dude making excuses why he can't let people in. My girlfriend called probably 5-10 times and we finally got seated. Keep calling you'll get seated.<br><br>Chicken empanadas was bomb. Got the flat steak which was bomb as well. Could have used a little more seasoning but overall food was good. We brought a bottle of wine so that was clutch.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Qb5paxnNuQ_V-qQhkOYoLA/348s.jpg", "caption": "Flat steak for one"}]}}, {"review": {"des": "Came here for vday. Let's just say food is pretty good the portions are big but the \"sharing fee\" they threw on the bill at the end of dinner was bull crap! <br>We had a couple appetizers and I wasn't feeling hungry so my date orders an entree which I take a couple bites of . There was no warning or mention or sign anywhere of this so called sharing fee which is $8. This was the downer of a nice vday", "pics": null}}, {"review": {"des": "Oh my god.  This is definitely one of my new favorite restaurants ever in Chicago.  I went recently for a friend's birthday after having had it recommended to me by multiple co-workers and it did NOT disappoint!<br><br>Tango Sur has a beautiful romantic South American vibe without seeming pretentious or kitschy.  They have tall candles on every table that make for perfect cozy mood lighting and an intimate environment.<br><br>It's definitely a hot spot and we had to wait a bit for our reservation, but they have a little area in the back where you can wait and even open your wine up and have a small glass. Highly recommend making a reservation though, especially if you're coming at peak times - I have no idea how long we would have waited without our resi.<br><br>Tango Sur is BYOB which makes it even more awesome.  You can bring a nice bottle of wine to enjoy with your meal at a fraction of what the price would be at an equivalent nice steakhouse.<br><br>Now, the food. Oh my gosh.  Everything was so scrumptious and we pretty much went in blind.  It's an Argentinian steakhouse, and the portions are huge - so each steak dish is pretty perfect to share.  My group of 6 got a handful of appetizers and two steaks and had plenty of food.  We got the proscuitto and melon and the provaletta as appetizers, and the waiter made a mistake and put in an order for the antipasti as well, which we got for free! All three were absolutely delicious.  All the cured meats and cheeses were perfect, and the provaletta - basically a big pan of melted provolone cheese with peppers - was phenominal.  We also shared a few of the empanadas which were crunchy, flavorful, and perfect as well.  Then for the steaks.  We got the filet and the sirloin, both of which came with salads and potatoes. The filet was soo tender and juicy and the spinach mashed potatoes on the side were fantastic.  The sirloin was huge and so tasty as well - with these roasted potato slices that were heavenly.<br><br>I can't say enough good things about my experience at Tango Sur.  The service was great as well, the ambiance was exactly what we were looking for and really made my friend's birthday a special night.  I will certainly be back for future dates, girls nights, birthdays, etc. Highly highly recommend for any and all occasions.  Just go!", "pics": null}}, {"review": {"des": "Very unexpectedly cute restaurant. I've been looking to go here for serveral years. We came at 5pm the minute they opened. There were already 4 tables seated and one table ahead of us. By 5:30 there was a wait. Wow I can't say I've seen any restaurant get so packed within the first half and hour. We ordered the 16 oz. Strip ateak and the limon chicken. They were both cooked excellently. So very moist and flavorful. The vesuvio potatoes while tasty were a bit on the mushy side. The bread was hard not very fresh and the salad that comes with the meal. Just skip it. It's butter lettuce, 2 slices of non colored tomatoes amd a heaping of onions. The srvice is really where this place lost a star to me. The server was very in- attentive and we couldn't help but to notice our exact food came out 15 minutes or so later than the couple next to us who ordered the same exact thing but came in at least 20 minutes later. Not cool.  So better server, no salad, and no vesuvio potatoes and the place would be excellent.", "pics": null}}, {"review": {"des": "This is one of my go to places! Their food is amazing. I always usually get the filet, but recently tried their pasta. Never would have thought pasta from an Argentinian steak house would be so good! My favorite of their Empanadas are sweet beef, and ham and cheese! Can't forget the best part, they are BYOB!", "pics": null}}, {"review": {"des": "The food was great, the service was fast. The servers were friendly and knowledgeable. Nice atmosphere, outdoor seating. BYOB!", "pics": null}}]}