{"name": "tank-noodle-chicago", "reviews": [{"review": {"des": "Tank Noodle is one of the key fixtures of Argyle street. Even when the rest of the street is quieter or not as busy, Tank noodle seems to be alway crowded. <br><br>The menu is fairly typical for a Vietnamese restaurant - a huge range of phos with beef, chicken, seafood and veg options. They also have rice noodle dishes, as well as banh mi and boba/smoothies. And a few conventional options like pad thai. For a pho place, pricing for the bowls was a little steep ($12-17 per bowl).<br><br>Service is a little chaotic, and you generally have to flag people down. The interior is very large, and a lot of tables end up being shared or communal if you have a small party getting seated at a large table, expect to have the other half of your table filled up. <br><br>The pho itself is decent. It's a fairly standard bowl I'd expect at one of these places. The broth came out hot and flavorful, and the noodles were firm but separated at the bottom of the bowl. Portions for the XL vs the L are mostly just on the broth and noodles - didn't feel like you got a ton more meat. A bit of a pet peeve was the tendon was very firm and hard, not melt in your mouth if it was cooked long enough. <br><br>Overall Tank noodle is ok to me. It's a bit confusing given the prices and the pho how it manages to be constantly crowded when there are a lot of solid establishments next door that are really good or better.", "pics": null}}, {"review": {"des": "Chicken Soup<br><br>How do you have slow service in an empty restaurant? Although walking into the door you get ambushed by the staff to take a seat. I will have to say maybe it was off day for the staff otherwise I wasn't quite impressed. I asked my soup to be wrapped up, instead of taking it pour the contents of a large bowl into a awkward container without spilling it all over the table... good with that.", "pics": null}}, {"review": {"des": "If I could rate these people 0 stars I would,let me start off by saying your customer service is by far the worst I have encountered. My husband and I decided to order the tank pho soup for carry out, only to pay $30.00 because they sure do make sure to charge for everything they can,which is ok right? If you receive EVERYTHING, the \"person who makes sure\" the orders are complete spent 10 minutes arguing with my husband that our order was complete and everything was in the bag. We paid for extra meatballs to receive one cold meatball cut in 4, our bag was dreanched<br> in blood from the meat so disgusting, I had to sit here and cook everything all over again because <br>Everything was so cold. The person was soo rude and  unprofessional, don't spend your <br>Money here people try another <br>FRESH place in uptown.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fc4PHiNTEiWY-1TLsPspGQ/168s.jpg", "caption": "Our meat was raw dripping in blood."}]}}, {"review": {"des": "Satisfying Vietnamese food anytime every time! They have a wide range of Vietnamese food on the menu and authentic in taste too.<br><br>The Pho here has wonderful broth with generous portion. Besides the Pho, there are other great selections to explore as well.<br><br>The Sizzling Crepe is a delicious appetizer that has an egg crepe, filled with sizzled pork and lots of veggies. You can then match it with the yummy and refreshing sauce provided. <br><br>The grilled pork chop rice with ground pork's egg yolk topping is another favorite of our's. First off the Vietnamese broken rice is excellent. Then the wonderfully seasoned pork chop and grounded pork with egg matched with the refreshing acidic, salty and sweet sauce is a beautiful match.", "pics": null}}, {"review": {"des": "I'm not a huge pho connoisseur so I've had a limited supply in my lifetime but I really enjoyed the bowl I had at Tank.  It's simple but flavorful and the best part is all the fix ins.  A great and cheap lunch can be found at Tank noodle!", "pics": null}}, {"review": {"des": "Stopped in Tank Noodle for some pho. There was many options on the menu outside of pho (e.g., sandwiches, other soups, etc.). I got the #43 option, which had flank steak and didn't include the tripe or the meatballs - as I don't like as much. Overall, it was really good. In addition, we tried the pork egg rolls to start. Service was good, however they had hip hop / rap music playing pretty loud throughout the restaurant making it a little hard to hear. <br><br>I haven't been myself but there are many other pho options in the area that are right nearby if you don't like this option!", "pics": null}}, {"review": {"des": "This place is overrated pho real. I had bookmarked this place a while back due to all the positive reviews on yelp. Came here on a cold Friday night and it was poppin and there was a 15 minute wait so I thought it was going to be the best phoking thing to ever enter my mouth and I was highly disappointed. I got the pho with brisket and the brisket was wayyyy over cooked and chewy. My friend got the bun bo hue and said his meat was chewy as well. The broth was mehhh. I also got the avocado bubble tea and that was their saving grace. Probably the best avocado bubble tea I have ever tasted to be honest.  Will I be coming back here? Nahhh I'm good love, enjoy. Too many other options in the hood for me to try.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pCGRsX-yWvZdizdTYRxb-g/348s.jpg", "caption": "Pho brisket with bun bo hue in the back. Thumbs down for both"}]}}, {"review": {"des": "I ordered the Hot and Spicy Anchovy Noodle Soup (bún mm) and honestly I wish I would have ordered something else. I wasn't taken aback from the anchovy flavor and scent - I was expecting it, but rather the amount of oil and the lack of vegetables that were included. Where is the eggplant and the various greens? Where is the cracking pork? This isn't remotely close to bún mm. Also, the broth tasted salty - mainly - without any other note. It should be favored with a bit of tamarind paste (sour) and sugar (sweet). The flavor profile tasted like a generic broth seasoned with a stock cube if that makes any sense. My parents said the duck noodles with bamboo shoots was normally really excellent but the bamboo tasted bad today (sour and old). <br><br>Also half way through my meal and old man (wearing a staff shirt) started talking to us out of the blue about his income (he said he made $X amount of tip working from 8:30am until close and that was barely enough to pay his rent) none of us asked him to talk to us to begin with so that was interesting. He proceeded to stand next to the table watching us eat soooooo...............", "pics": null}}, {"review": {"des": "Not the best phoking bowl of noodles I've ever had, but one of the heartiest meals I've ever had.<br><br>Came here for a cheap, full meal that could hold me over for the rest of the day and my friend suggested that I visit Little Viet Nam for some delicious Viet eats. I immediately came across Tank Noodle as a huge corner restaurant that looked inviting, and seeing that I wasn't familiar with the area, pho sounded good to my stomach. <br><br>I'm not sure what standard pricing for pho is in Chicago; I got a #43 bowl (beef, well-done flank, skirts flank) and felt that $11 was very pricey for a regular-sized bowl, but the quality was there. The beef and noodles came in filling portons and I didn't eat for another 9-10 hours. It may have aIso been the sweet and bold-flavoring Vietnamese Coffee ($5) pick-me-up that went well (although I was pushing for bloated at this point) and cooled down the nice bowl of hot noodles that did it for me. I came here on a Saturday afternoon and wasn't really expecting to be able to find a seat, but it's a hustle-and-bustle kind of busy place with a mix of Viet families and non-Viet crowds. And they take credit cards, which is a plus!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Lt2JSdEFm-HzTPILG_9qDg/348s.jpg", "caption": "#43 with Du Monde Coffee"}]}}, {"review": {"des": "Great place with authentic Vietnamese food! I tried the fresh and fried spring rolls... both taste like back in Vietnam. You can also get pork or shrimp in them. Same goes for the bahn xeo. For those that do not know what this is be sure to try it. It is a giant omlette stuffed with bean sprouts, meat, and then you wrao it in lettuce and fresh herbs. The only thing was their smoothies with tapioca were very frozen, icy, and too sweet. Will definitely be coming back. Large menus as well with tons of options for every type of eater. Be sure to come early as it can get crowded.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6BK7LxU1j--hdtC74IMG0A/168s.jpg", "caption": "Bah xeo"}]}}, {"review": {"des": "This Tank Noodle restaurant is in Viet Town of Chicago and we went as result of a friend's recommendation.  We arrived around 8:30pm on a Sunday and they were packed.  There were 3 other parties in front of us, so we stood waiting to be seated.<br><br>A few minutes later, an employee came by and ushered us to a table for 2.  We sat for a long while before an older gentleman noticed no one had come by to take our order.  He waved at one of the employees and another older man came by to take our order.<br><br>I ordered a Bun Mam & Soda Chanh and my son got a Pho & Sinh To Sau Rieng.  I wanted Nuoc Mia but they saod they didn't have Sugar Cane Juice that day.  While we were waiting for our food, a lady employee was walking around to each customer table, telling everyone they close at 9pm and asked if they were ready to pay.  We got our food a bit after 8:50pm and rushed to swallow.  Surprisingly, a group walked in the door right before 9pm and they were still served.  <br><br>The Pho and Bun Mam were both decent, but we've definitely had better in Houston.  The broth was not flavorful enough; the lime soda was madd with old lime.  At least the smoothie was good.  We quickly ate, paid and left.  Don't think I've ever paid over $40 for 2 people at a Viet eatery.  It was a pricey meal for average Vietnamese food.", "pics": null}}, {"review": {"des": "Came here on a Sunday morning. Wasn't busy at 9:30. I had the curry soup with chicken and Chris had the combo congee. <br><br>The curry soup was quite thick. Could have been the potatoes? It reminded me of a yellow curry--savory, a taste of peanuts, potatoes, noddles, and chicken. It was tasty and a large portion. <br><br>For the congee, there was so much going on! It was tasty. I prefer the kind that is more like porridge--the rice has been cooked down to make a thicker soup. The congee here has a clear broth and very discernible rice grains. Great taste. <br><br>The hot tea is very tasty!<br><br>Overall, it was good. I want to try the pho now, so we'll have to go back :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/me9qK32TqSM8iKaXKCSfjA/348s.jpg", "caption": "Combo congee"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/h-Lh2SR6urAHaZjLSrm1LA/168s.jpg", "caption": "Curry soup"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YC564JJ0d7lmXKX77l9j2Q/168s.jpg", "caption": "Tea and soup setup"}]}}, {"review": {"des": "REQUIRED PIT STOP IN CHICAGO. My Hubs and I absolutely love this place! Anytime we are in the area, we have to stop for their pho, spring rolls, banh mis and some EDM. Haha, OK sometimes its traditional Asian music, but still...;) The broth is always on point--light but flavorful and loaded. Their drinks are all fresh--my personal faves are the sugar cane drink and Thai iced tea. They are always busy but have quick service so a good turnaround time. We love Tanks!!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cuL_Qh9oDEF6tIULGaeOMw/348s.jpg", "caption": "Spring Rolls with Shrimp (7B), Large Combo Pho (40) and Thai Iced Tea--it was a perfect day to eat outside!"}]}}, {"review": {"des": "Our party came here through the CTA. I would imagine parking would be difficult here as there is no parking lot and only street parking. This place tends to be very busy. So busy that at times, they would use their largest round table and put two party to eat there together. I usually do not mine, but it can be awkward when sharing the sauces, utensils, and napkins. The food was good. Its one of the better places to get pho around the Chicago area. They do have two option sizes for the people who want to eat a large bowl. Otherwise, this is a typical vietnamese restaurant. You pay at the cashier and you indicate which table you were at by numbers. Numbers are labelled on the table. If it wasn't so far from where I live, I would come here often for my pho fix.", "pics": null}}, {"review": {"des": "Was visiting from Los Angeles and we knew we had to stop here. Very good pho! Soup flavor was just right, not too heavy. Enjoyed seeing a family ran business very busy with lots of customers!!! Will be back here again :)<br><br>I remember reading the reviews to get a sense of the food here. Samuel W's review was stupid disrespectful. What does this kid know about authentic Vietnamese cuisine being from Wisconsin?!?! The problem with yelp is that you would never tell the owners your honest opinion about the \"FOOD\" in person cause your a bitch but you feel inclined to run back home to your computer screen and write nasty comments that it's not authentic food or that it's not what you thought it would be. FUCK U SAMUEL U POS!<br><br>This place is authentic as it gets. Enjoy the pho and if you never tried pho before, ask questions. Learn about it. TANKS BABY!!!!!", "pics": null}}, {"review": {"des": "Love the pho...and other stuff! And there's a lot of other stuff! Too much to choose from I'd venture to say. <br><br>We had this, hold the tripe (I wouldn't mind it; guest didn't want):<br><br>#39 COMBINATION WITH SLICED BEEF (X LARGE)<br>Well done brisket, well done Flank, Soft Tendon, Bible Tripe, Meat Ball<br><br>#83 COMBINATION VERMICELLI<br>Rice Vermicelli Combination with Grilled Sliced Marinated Beef, Large Size Shrimp, Grilled Pork Egg Roll, Mixed Vegetables, Peanut<br><br>These are two giant dishes that'll leave you gut busted shared with another. I also had the lime ice drink which was basically a fresh limeade. Very refreshing. I haven't had any other pho in the area and asked my guest who had why Tank is so preeminent. She tells me the broth is best. I like the broth too and all the tasty beef and tendon and meatballs and such in the soup. The stringy white vermicelli noodles are tops too.<br><br>They're a member of Spring Rewards too, bonus! Accrue $150 in spending here and get $10 credited back to your card after your next $25 purchase.", "pics": null}}, {"review": {"des": "I've been to Tank Noodle a couple of times now. It seems to be the go to spot for pho for most of my friends who live in the city.<br><br>I've always walked in and the wait is never bad. The most I've waited for a table is 10 or 15 minutes. The servers are fairly attentive or are floating around and it's easy to grab their attention.<br><br>I usually get the #43 - Sliced Beef, Well Adobe Flank, Skirts Flank ($10.95). They give you a lot of noodles and the portion of meat is decent. I can't ever finish my bowl. The flavor of the broth is pretty good. Can't go wrong with adding some cilantro and hoisin :)<br><br>I've tried the Fresh Spring Roll with Pork and Shrimp ($4.95) before - it was just okay to me. This is one of my favorite things to eat so I was a little disappointed. If you're debating on this appetizer, I'd pass.<br><br>The Vietnamese coffee ($5) here is really good! It's pretty strong so I usually let the ice melt some before drinking it. The sweetness of the condensed milk is really nice and I love it ice cold.<br><br>I'm a fan of Tank Noodle - prices are reasonable and the food is pretty good.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BE0j4mcz-nFyylQu8-YezA/168s.jpg", "caption": "Vietnamese coffee - strong and delicious!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kcXUrhWIqUMceFx3gqn5kA/168s.jpg", "caption": "Spring Roll with Pork and Shrimp + Sliced Beef, Well Done Flank, Skirts Flank Pho + Vietnamese Coffee"}]}}, {"review": {"des": "If you've been to Argyle before, then you probably stopped here. Almost certainly. This is the titular popular destination for people looking for pho and the general recommendation that is given is Tank Noodle. I've had the pho here before awhile back, so I wanted to get something else here. Tank is the more mainstream pho restaurant in Argyle, but there are several others as well. I recommend you explore around and see which suits your preferences.<br><br>ATMOSPHERE/ARCHITECTURE: 7/10<br><br>Open, bustling restaurant with enough seating for 50+ people. The decor is about average with nothing all too stunning.<br><br>SERVICE : 6/10<br><br>We were seated quickly after we got here and our orders were taken and brought out in a timely and reasonable manner. However, my major service complaint is that they only split checks into 2 parts no matter how many people there are. What even is the reasoning behind this? I have never ever run into this situation before and I have been to many restaurants both in Chicago and many other locations as well. A little disappointing.<br><br>FOOD: 8/10<br><br>Their menu is literally insane. It is a list nearly 200 items deep. I got dizzy just flipping through it. That's one way to keep customers coming back. Have so many items that they have to come back to try more things.<br><br>Hu Tieu Xao Do Bien (Crispy Seafood Noodle) - This I had done with crispy noodles and it had come nice light flavor with shrimp and some fishballs in it. It was a tad more wet than desired but still good. <br><br>Com Thit Nuong Lap Xuong (Rice with Grilled Pork and Chinese Sausage) - This was a stellar dish. The grilled pork was done in a very authentic Vietnamese fashion and seasoning, tasting just like the one that my mother would make. The combination with the Chinese sausage is difficult to beat as well. This was a winning dish.<br><br>VALUE: 7/10<br><br>The value here is about average. I think the prices are fair for what you get.<br><br>PROBABILITY OF RETURN: 7/10<br><br>It's pretty likely I'd come back here to try some more dishes. I need to whittle my way somehow at that massive menu. <br><br>TO EAT OR NOT TO EAT: I would recommend coming here at least once if you happen to find yourself in Argyle.<br><br>OVERALL: 7/10", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_WBO6U1bwlK1Pj65SYYntg/348s.jpg", "caption": "Com Thit Nuong Lap Xuong (Rice with Grilled Pork and Chinese Sausage)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2wdJm7e0Cudvz-gxJo5UfA/168s.jpg", "caption": "Hu Tieu Xao Do Bien (Seafood Crispy Noodles)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/y5Fu9nvBwlMWdjqhrBk1Ww/168s.jpg", "caption": "Com Thit Nuong Lap Xuong (Rice with Grilled Pork and Chinese Sausage)"}]}}, {"review": {"des": "Have driven by here thousands of times.  It's always packed so I'd back burnered it.  Well that's a shame because this place is great. The beef was marinated perfectly - the vegetables crunchy the broth so excellent. I'll definitely be back. Good service - great food. I'm sold. Atmosphere is good- busy cafeteria style.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/09zTS28pKxaY87S4vTBz4g/168s.jpg", "caption": "Beef and shrimp number 84"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MmgENKSs77iy-lG55mLZmA/168s.jpg", "caption": "Beef noodle. Tank bowl"}]}}, {"review": {"des": "We were lucky enough to come around 10am on a Saturday before the rush of patrons made it to Tank Noodle. Gotta love a family run establishment that has ruling the Viet food scene for years. Affordable, hearty, and fast. Great at all hours of the day and plenty of leftovers for later", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Qqb4UD9r6oEY8sA0NzaUuw/168s.jpg", "caption": "#83 COMBINATION VERMICELLI"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mrmbuL6R3fXinE0wb5Ql8w/168s.jpg", "caption": "#39 COMBINATION WITH SLICED BEEF (X LARGE)"}]}}, {"review": {"des": "Just came here yesterday for a quick bubble tea spot. Their avocado bubble tea is amazing!! Also comes with fruit slices inside, which included water melon and cantaloupe. So delicious!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/t45eHCKDIun7deAUxv5woA/168s.jpg", "caption": "My favorite avocado bubble tea!!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CoAnGX7vHXLjCmi1NrNK9Q/168s.jpg", "caption": "Curry chicken! Yum!!"}]}}, {"review": {"des": "I was feeling kind of sick, so naturally I craved some good ole asian soup. I don't usually get pho, but I've heard great things about this place and needed to see what the rave was about. Though I didn't even order pho- I ordered a spicy version which I loved! Bun bo hue was a delicious spicier choice of noodles, spicy broth, and tasty meats. As with all the portions here, this was huge. I wasn't able to finish the noodles, but the broth and meat were easily downed. The spring rolls were also a good tasty appetizer. BYOB in the restaurant as well!", "pics": null}}, {"review": {"des": "In an area that is absolutely swarming with very good Asian restaurants, we all agreed this was the best one we visited on our recent stay in Chicago. Tank Noodle is a busy place (large parties should make a reservation). It's busy, loud, bustling, etc. So if you want a relaxed dining experience, this is not necessarily it. But if you want an amazing meal, eat here.<br><br>We ordered an extra large bowl of pho, a round of eggrolls for the table, fried egg noodles with shrimp and egg noodles with pork. My husband says the egg noodles with shrimp was the best version of that dish he's ever had. He liked it so much he said it was better than the pork (which is something he never would say normally). Everything was excellent, and the crowd we were with (some of whom had never had pho before) were totally blown away.<br><br>I also appreciated that the girl who waited on us had good suggestions, steered us in the right direction and honored our request for speedy service. We were in and out lickety split. We will definitely stop back next time we're in this part of Chicago.", "pics": null}}, {"review": {"des": "Parking can be a hassle but the food is worth it! I'd recommend the ultimate pho and the Vietnamese shrimp spring roll with the white skin. This place can get really packed and can result in you sharing a table with another party. Drinks are quite expensive at $5 each but can't complain when it's up to you to order it or not. <br><br>I'd come here for pho anytime.", "pics": null}}, {"review": {"des": "Overall: In a crowded neighborhood in terms of cuisine, Tank still manages to don out fantastic pho and a vast selection street foods.<br><br>The good: The pho here is delicious and a perfect meal for a cold Chicago night. A few buddies and I came here, split some spring rolls, and all got the beef/flank/skirt steak bowls. The rolls were fat and plentiful and had a nice balance of basil, lettuce, and protein. The pho was fantastic, as the broth had a nice kick to it and the meat was tender and cooked to perfection. The noodles, veggies, etc. were per the norm. Absolutely huge menu.<br><br>The not-so-good: There were two lines because of two places to enter the restaurant, which caused confusion. Maybe it's by design, but it seemed to delay seating. While everything was great, nothing mind-blowing. <br><br>Atmosphere: 8/10<br>Service: 8.5/10<br>Food: 8.5/10", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xGES3HUPYdN8m-wKcs4BOg/168s.jpg", "caption": "#43 - beef, flank, and skirt steak"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/07FCmGUBhlZB39zU_xNL4w/168s.jpg", "caption": "Variety of spring rolls"}]}}, {"review": {"des": "Phenomenal authentic food!<br><br>You'll find an abundance of sauces and herbs/veggies at your table for topping your bowl like fresh mint leaves, cilantro, basil, lime slices, and sweet and sour fish sauce. <br><br>We had the shrimp spring rolls for our appetizer and they were enormous and stuffed with vermicelli, bib lettuce, fresh mint leaves, chives, and bean sprouts. <br><br>The taro chicken curry soup was delicious-spice wise it was one of the best curries I've had with generous amounts of chicken meat, tender taro cubes,vermicelli noodles, fresh onion, and the right amount of heat. <br><br>The combination pho with beef brisket, flank, tendons, tripe, and meatballs was also delicious-it was ordered by half our table. <br><br>Seating is quick and staff are attentive-but this place is crazy busy so be prepared to flag down your waiter for the bill. The menu is immense and everything comes out quick and masterfully plated.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6-SYDXL0II8hUmsWWP4Upg/348s.jpg", "caption": "Chicken Taro Curry"}]}}, {"review": {"des": "Tank Noodle lives up to its reputation as the best pho in Chicago! It's a far trek for me, but whenever I'm in the area I make sure to stop by. Every time I've been here, there's been a short wait to get seated, but I've never had to wait for too long, and the service is fast given how busy it is. All of the pho options that I've tried have been delicious--the steak is sliced very thin, the flank meat is nice and tender, the tendon falls apart in your mouth, etc. The broth is good and not too salty. Portion sizes are reasonable too, plenty of noodles and soup.", "pics": null}}, {"review": {"des": "Cold weather always gets me craving hot soup, so naturally Pho came immediately to my mind. As part of my try new places to eat initiative, I decided to give Tank Noodle a try instead of The Noodle, my usual place for Pho/Vietnamese food in Chinatown. <br><br>Their menu is huge! A little overwhelming if you don't come with an idea of what to eat. Instead of Pho we ordered #93 and #96 under the authentic Vietnamese noodle soup section and appetizer #12.  The highlight of our meal ended up being the #12 Vietnamese sizzling crepe appetizer, as I found both noodle soups lack depth of flavor in their broth, but honestly still very satisfying. <br><br>#12 Vietnamese sizzling crepe - HUGE. Plenty of herbs and veggies to accompany the thin crispy omelette creation stuffed with bean sprout, shrimp, and pork. Fantastic with the sauce it comes with. It is messy to eat though, so abandon your table manners and eat with your hands, it is that good! <br><br>#93 Hot & spicy \"Hue\" rice noodle soup - soup was definitely spicy, however that was all I tasted in addition to the lime I squeezed in. It also contained a disappointing amount of exotic parts, only a small piece of pig feet and rest are beef slices. <br><br>#96 Duck vermicelli soup with bamboo - soup was overwhelmingly taken over by the flavor of bamboo. Duck itself was just okay, delicious though when eaten with the bamboo and dipped in the sauce it comes with. <br><br>Overall, I left with a satisfied tummy, totally willing to come again to give their Pho a try. However, their price is more than I am used to seeing for Vietnamese food of the same quality and taste.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aEwotDp8p8F753GIKa0Ciw/348s.jpg", "caption": "#93 Hot & spicy \"hue\" traditional rice noodle soup. Recommend."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WiET7uRT3P-vQrf4lz-5CA/168s.jpg", "caption": "#96 duck vermicelli rice noodle soup w/ bamboo. Just okay."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VFV2oBUTR7JCycet9TCRzA/168s.jpg", "caption": "#12 Vietnamese sizzling crepe. Recommend."}]}}, {"review": {"des": "When you get tired of Peking Duck at Sun Wah (Warning: this may never happen), walk down half a block to Tank Noodle and try some great pho. Yes, Tank Noodle has the overwhelming firepower to dominate the pho battlefield. <br><br>I've tried the pho, banh mi sandwiches, spring rolls, beef wrapped in rice paper, and it's all delicious. But the beef pho is what brings me every time. OK, there are several dubious beef parts in the soup, but hey, it's all beef so I don't ask too many questions between slurps. <br><br>The atmosphere is a cross between a frat party and Union Station during rush hour. Everyone's having a good time but it can get very hectic. <br><br>I love this place but I usually run over to Ba Le across the street for their desserts in the refrigerator cases. That's no criticism of Tank Noodle's brilliant execution on the pho battlefield, because pho is their strategic objective and they win decisively every time.", "pics": null}}, {"review": {"des": "Moved from California to Chicago and finally found my go to spot for delicious Vietnamese food! So many dishes to choose from! From Hot noodle soups on a cold or rainy day or fresh wraps on a hot day! Prepare to wait for a table or a seat because this place is always busy! But well worth it, plus Staffs are really sweet and attentive!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0unIfWVXFcNbsVS-CKZ_Eg/348s.jpg", "caption": "Always busy!"}]}}, {"review": {"des": "Absolutely revealing in the explosion of flavors, textures and fresh ingredients in Vietnamese food. A feeling u get from home cook foods but my kitchen certainly cannot replicate these yummy grilled pork chops, pork skins with egg yolks, delicious broken rice, and yummylicious pho!", "pics": null}}, {"review": {"des": "Hot soup after a long day of exploring! Broth was good. And serving size was expected! A+", "pics": null}}, {"review": {"des": "I came here for carryout and ordered the half portion of the papaya salad. It was $11 with tax for a pretty small portion. It was good but I wish there was more payaya and less pork. This is argyle not downtown.<br><br>I came here on a Sunday around 5 and it was busy but my order only took 15 min. If you are looking for cheap eats or for a good portion size skip this place. There are many other better Viet places in the hood.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/a7gWwRDAyk0KSeOYLX3tHQ/348s.jpg", "caption": "Half portion of payaya salad for $11 with tax. Too small for the price."}]}}, {"review": {"des": "If you're chasing quality, this is a waste of your time. <br><br>I grew up in a small rural Wisconsin town with a strong Hmong Community. One of my fondest memories from high school is going to the annual Hmong culture show, and enjoying some delightfully well made Pho. My first Pho had a delightfully strong broth, was full of flavor, and yet was as light of a meal as can be. <br><br>Tank Noodle doesn't do this memory of Pho justice. In fact, it doesn't do Pho justice at all. HaiSous, Pho Lily, and several other Argyle restaurants create a much more delicious Pho than Tank Noodle. I'm actually mildly perplexed on why this restaurant is so popular. <br><br>The problem with Tank Noodle is that their food just isn't cohesive. With such a large menu, its absolutely impossible for them to specialize well enough in anything to distinguish themselves. The broth in my Pho tasted like someone had simply dumped half a bouillon cube into water, and the Banh Mi was unable to make an impression either. Somehow, Tank Noodle managed to mess up a basic pork chop, turning my girlfriend's piece of meat into a rendition of a pig crossing the Sahara Desert.<br><br>If you want authentic Vietnamese, this is not the place for you.", "pics": null}}, {"review": {"des": "I've been going here for The past four years and it never disappoints.  the food is always consistent and the portions are large. It is the most bang for your buck type of meal.", "pics": null}}, {"review": {"des": "My friend and I walked in here cause from what we could see, it was the most crowded Vietnamese restaurant in Argyle. They also had a decent amount of vegetarian option.<br><br>We ordered the fresh Vietnamese spring rolls and a curry noodle. The fresh Vietnamese spring rolls were very satisfying, with the perfect amount of mint leaves and tofu. Honestly, its a dish thats really not that hard to mess up.<br><br>The curry noodle, on the other hand, to me just tasted extremely weird. It had this sweetness I wasn't very fond of. It was huge, yes, but somehow I didn't feel like it was not worth $11. Something about it was off, and very off putting. <br><br>Maybe I ordered the wrong dish but I didn't get why the place was as crowded as it was.", "pics": null}}, {"review": {"des": "Inconsistent.  First time we went, this place was legit tasty and authentic.  Second time, the pho was bland and diluted.   Thought we hit gold but it's just fools gold.  Place gets busy so prepare to wait during peak time.", "pics": null}}, {"review": {"des": "Tank noodle has been bookmarked for a while. I decided to try the pho. It was a good, filling meal, but as other reviewers have noted the flavor was not that rich. Still, I was satisfied, enjoyed the general bustle and will definitely come back to try the Vietnamese crepes and some of the pork dishes. They run an efficient and organized operation, and I don't think you can go too wrong grabbing a meal here.", "pics": null}}, {"review": {"des": "This restaurant has modern vibes, and while the menu is extensive the quality of food is still great and authentic.<br><br>Although pho is a Viet classic, their best items are actually other Viet street foods. <br><br>Their bubble teas are also on point and they have some different flavors like banana green tea and thai iced tea.", "pics": null}}, {"review": {"des": "Every time I go to Tank I always want to try something new but I always go back to the beef pho. The portion sizes are huge and the noodles are chewy yet tender. But my favorite part is the delicious broth that warms me up on a cold, rainy day. Tank is usually very busy, but the wait time is not bad.", "pics": null}}, {"review": {"des": "Delicious, soul rejuvenating pho. Came here with my cohort tonight and everything was delicious. It was one of my friend's first time having Vietnamese food, and I was delighted to introduce him to not just pho, but a sampling of other nomalicious delights. He ordered a big bowl of pho, and after a deep inhale, just jumped in and ate it all up. \"I feel like it's a very involved, busy process but I'm loving how it tastes!\" Ah, seeing him enjoy his first bowl made my food taste even better. I ordered my goto- everything!- and it felt like like happiness in a bowl. Also order the pork chop with egg and the catfish in a clay pot. My friends love it, and we all left full and happy. Five stars!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7NhWJ6fTGbQ9m6HDufrTMA/168s.jpg", "caption": "Pork chop!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DUTXPfaOLdpHbZk1DHucwQ/168s.jpg", "caption": "Catfish!"}]}}, {"review": {"des": "3.5 stars for overall quality of dishes. I've been here several times throughout the years and there has been an inconsistent trend. Sometimes it's really delicious and other times mediocre. I think it depends on who the cooks are. <br><br>If it's your first time visiting don't be intimidated by the menu. You will be flipping through pages and pages wondering what to get but the servers are helpful in guiding and knowledgeable when bombarded with questions. This place offers everything! Pho, congee, hot pot, noodles, rice, seafood, chicken, pork, duck, vegetarian options, fresh squeezed juices and smoothies, banh mi, and deserts. <br><br>I wouldn't  hesitant to try either the Coconut Curry Soup or the Pork Chop. Both are very delicious. <br><br>#92 Coconut Curry Soup: one of the absolute best broths I have ever tasted. It's rich and creamy with a dash of  curry love. If you try it on an off day, it's still satisfying. It comes with onions, cilantro, bean sprouts, mint, noddles, taro, and your choice of tofu or chicken. Try to eat it all before it cools down! It's so hard for me to try other things on the menu bc I keep coming back for this. A haven during winter! <br><br>Pokchop: omg delectable on a good day. Comes with clear broth soup, served over white rice, noodles, salad, cucumbers, and an egg crepe. There are several ways for this dish to be cooked and options can be found under \"Gourmet Rice Dishes.\" <br><br>Pork Fried Spring Rolls: consistently flavorless. The most recent time we ordered this, they were burnt. Go for the Shrimp Fried Spring Rolls or Fresh Spring Rolls instead. <br><br>Overall, a really great place to try Vietnamese food. I can only hope you visit on a good day and get lucky with great cooks!! I gleam in envy at the large parties who are cooking up spreads using the hot pot! Def need to give the hot pot a try!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/szjQ-KgfKSil6hubMOU7Jg/348s.jpg", "caption": "Pork Chop and Coconut Curry Soup!"}]}}, {"review": {"des": "Hands down, best pho I've had in the Chicago area. This may not be the best pho in the US, but it's pretty close. I've been to some of the other smaller restaurants in Argyle as well, and this restaurant had the best service during my group friend dinner. From the bbq pork fried rice to the egg rolls and spring rolls appetizers, all of my friends were impressed with the food quality and portions. I will be coming back here and referring anyone looking for authentic Vietnamese food here.", "pics": null}}, {"review": {"des": "I wasnt blown away with this place. I got the wrong bubble tea (ordered mango and got cantaloupe/strawberry...whatever but wasnt the best Ive had). They were out of like 3 things on the menu. Never got drink refills. Dish we shared was soft noodles with veggies and chicken. Lacked flavor and noodles were flavorless and had an overcooked texture. The business also appeared dingy. Doubt Ill be back, not impressed with first experience.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XndU1w2AUQd7rPICJIQWTA/168s.jpg", "caption": "Spring rolls-beef/shrimp-pass"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Tvz3Ad7sLk7JTQd0D67gOg/168s.jpg", "caption": "Bubble tea...not sure what kind"}]}}, {"review": {"des": "Stopped here before getting on the road back to Michigan.   Busy place but we managed to get a table for 6 and were sat quickly.  Super friendly service,  was able to place order quickly.   Food was brought out just a few minutes later fresh and packed with flavor.  Friends ordered some pho,  I ordered some chicken fried rice, (Uber driver couldn't drive with a crap stomach already was questionable) never the less it was your usual fried rice and it hit the spot.  Would love to stop back when I'm in town again and order some pho!", "pics": null}}, {"review": {"des": "Honest review: not my fav nothing separates this place than ur neighborhood Vietnamese restaurant. The place is big but on weekends make a reservation gets crowded but it's completely empty on weekdays would recommend going then. The service is ur typical Chinese restaurant service a million servers but no where in sight n no help dont refill water or explain anything so if u never had Vietnamese food ur screwed. The food i had pho alot now n what i look for in the broth is complexity it should taste like its been cooking for a couple of days not just taste like star anise n cloves. Then it should have a star anise n clove aromatic flavor rather have the first then this but if it has both then ill pay whatever for it. The broth here lacks complexity i think to many people just hear this is the best n just assume it is. Another issue with the broth is it was a lil sweet n needed salt badly was disappointed. I wouldnt come back cause i had better feel if they shortened the menu the food would be better how can u make over 200 dishes all taste good?? still looking for the best pho any suggestions let me know <br><br>Spring roll $4:95 this was good not great ive had better. I likes that it has noodles in it think it makes the spring roll better texturally. The ingredients inside were good not funky. The sauce was the issue it was ok it should be the perfect balance of sweet n salty it was to sweet for me.<br><br>Grilled pork chop ban mi 5:95$ good not great i loved how fresh it was n it had alot of veggies. My issue was the pork was nothing special. The meat has to be very hot n it wasnt was like lukewarm kinda. N it wasnt that flavorful<br><br>Shrimp pho $9:95 ive had better pho honestly it was lacking depth n was sweet which was unappealing noodles were overcooked<br><br>Bun bo hue $10:95 the only thing this had going for it is thst it was spicy it needed salt badly n was lacking complexity n didnt like how the noodles were really overcooked", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qS1Aweu6vQ8Yzu-LAoltKg/348s.jpg", "caption": "Menu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wREPSvzv2y5FLYC9Sast3w/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KPBiFASqNcL3aw4uGCIt9A/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "Authentic Vietnamese restaurant- quick and easy to dine in- right off of the Argyle stop on the red line- easy to get to if you're taking public transportation. I love that they open super early so when you're in the mood for some refreshing Pho early in the morning you can go there for breakfast! <br><br>They offer variety of other noodle dishes such as Vietnamese egg noodles with different combinations (seafood, BBQ bacon, dumplings, etc) or rice dishes, congee, etc <br><br>I also love all of their condiments right on the table (sriracha, hot pepper sauce, sweet hoisin sauce, fresh jalapeño slices jarred in vinegar). <br><br>Come here for some authentic- no frills Vietnamese cuisine and then stop at one of the bakeries down the street for dessert! (Cookies, pastries, hot buns, etc)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/k6A16YWiwBh6PkLtPhgGDQ/348s.jpg", "caption": "Beef and meatball pho (#48)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tR6WWDjKXRnqhv0B4jhorA/168s.jpg", "caption": "Egg noodles with BBQ bacon"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fjLEPnhALBEkz1EO4IFEfw/168s.jpg", "caption": "Vietnamese shrimp spring roll"}]}}, {"review": {"des": "Came here for around 1pm for brunch and was seated almost immediately because we didn't mind sharing a table. It was a little confusing because there were two entrances with two lines. I was pleasantly surprised to find out that they now have outdoor seating available too.<br><br>I got the XL pho.. it's about 1.5 times bigger than the regular size. I can rely on Tank to get decent pho. Definitely better than a lot of other places that I've been too. It can be a little salty though.<br><br>I was disappointed with the service. Our waitress did not seem to be in the mood. She even forgot the bean sprout, basil, jalepeno, and lime that comes out with the pho. We probably wouldn't have gotten it if we did not notice.<br><br>Otherwise, good experience. It was the fastest I've ever been seated and served at Tank.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NSaHJVGts-Zs0sq2_rlT0w/168s.jpg", "caption": "Shrimp spring rolls"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zbWQjFODFzTzssKuAActJQ/168s.jpg", "caption": "XL pho"}]}}, {"review": {"des": "Pretty good pho here, and service is so quick and friendly. I ordered the sliced beef pho. I felt that the broth needed something more but overall it was good. I also ordered the taro bubble tea, yum. It's a little more pricey than some other places I've eaten at, and the bubble tea costs $5. The menu is pretty big. Everyone at my table enjoyed their food. You can never go wrong with pho.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/P2kxQ4gAd_g7TSessneVsw/348s.jpg", "caption": "Sliced beef pho & taro bubble tea"}]}}, {"review": {"des": "The best in the Chi-town. K. the end. <br><br>Just kidding. It is really good tho. <br>Especially during freezing cold winter time in Chicago, all I want to do is go up to Tank Noodles for a nice warm bowl of pho. <br>The portion is very generous, which is my style :) <br>But they got a bigger size for few extra bucks. <br>I feel like the bigger size can feed two people but I have seen people who devour into their bowl with no problem. <br><br>Menu Reommendation:<br>1. EVERY NOODLES SOUP <br>2. Omelet <br><br>Bathroom rating: ehh. Dirty.. (2 out of 5)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tSH_JyhksYd8lA7ULhThYQ/168s.jpg", "caption": "Look at this meaty bowl"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Q7f2e0Fgu0irAHmAI77x3Q/168s.jpg", "caption": "Omelet is so good"}]}}, {"review": {"des": "Wasn't a fan of the broth here used for the Pho, tasted somewhat artificial or light. Nothing wrong with the noodle bowl, but flavors felt a bit off. Same thing goes for the fresh rolls. The filling was bland and flavorless and had to rely on sauce for everything. I get that it's mostly raw veggies, but the shrimp and pork tasted almost non-existent. Would only stop by if convenient in the future, as lots of other options for Vietnamese in the area.", "pics": null}}, {"review": {"des": "Went there at around 2:00 PM on a Saturday. It was busy but we were seated promptly. And that is where any contact with the servers ended. We were only two people, and we watched others be seated and served, no servers making eye contact, no water-- nothing. Finally left after thirty minutes, but not before being mowed out of the way by a child delivering pho garnishes. Will never go back or order from them.", "pics": null}}, {"review": {"des": "Great broth flavor, which is a must when it comes to Pho. It does get really busy so if your okay with sharing tables it's a good place to go. They tend to split a big table which is nice so you don't have to wait too long. Plus you get to mingle with people. <br><br>Never had a bad meal here, I always get the pho with everything, spring rolls, if I'm not in a mood for soup I get the pork chop with egg and Chinese sausage. The smoothies are good too they are made with fresh fruit.", "pics": null}}, {"review": {"des": "Went for the first time 2 nights ago. Loved the rice dishes and the Bahn mi. The pho was whatever. I prefer \"cleaner\" broths. It's still good but just not my style. The pork chop dish was amazing. With they gave a little more of the pork skin. They did the typical.. load it up with rice... trick. I prefer other pho places in the area but always see a gang of people inside so I decided to try.", "pics": null}}, {"review": {"des": "Another great visit to Tank Noodle on the coldest New Year's Day in Chicago history. It was busy (per usual)! And the opening door let in the Hawk with each new customer. But the #43 standard Beef Pho warmed our bones and stomachs. <br><br>It was very delicious, and service was great- thanks, Tank!", "pics": null}}, {"review": {"des": "From the moment I saw the waiters wearing 'Tank you very much' shirts, I knew that this restaurant meant business. It wouldn't be afraid to get down and dirty in delivering to my mouth serious eats. <br><br>The shrimp spring rolls were a visitation from a minor deity. The pho had several thousand ingredients. The stand-out ingredient, of course, was the bean sprout. <br><br>Chair hardness rating: adequately soft. Restaurant temperature rating: slightly cold, but that's the best environment to be having pho.", "pics": null}}, {"review": {"des": "The food here was actually fine. The pho was good and had depth of flavor, and plenty of customization options. The bahn mi was actually great, and super cheap! Where I had to dock stars were because of the service. First they took forever to take our order, and followed it up by giving us the wrong dish. Then they brought out part of the correct order, and didn't bring out the rest till almost 30 minutes later. Our water was also not refilled this entire time. I don't know if this is the norm or this was a one off experience - the staff seemed very inattentive throughout our meal.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cGeN9mYK4ChnG_XabBaa6w/348s.jpg", "caption": "Vietnamese Hot Du Monde Coffee with Condensed Milk"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FRWQJEUKOtIOB-4xjKA3sQ/168s.jpg", "caption": "Bahn mi"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/txO5iWCDDCWprkmqxiYuGQ/168s.jpg", "caption": "Pho"}]}}, {"review": {"des": ".When I walked in to the restaurant I noticed that the music was loud of which the lyrics I couldn't comprehend (obviously!) since it was a different language.... <br><br>Asked the waiter on popular items on the menu  (because the menu is comparable to size of a book) but it seemed like he had language problem.... after struggling for a minute I let it go and ordered veggie spring roll and Veggie Pho <br><br>The Veggie Spring Roll was 60% Tofu (GMO alert!)- being the health freak im, I don't eat tofu unless it says organic.... so obviously this was NOT a hit!!!<br><br>Veggie Pho- broth was whatever... it was full of broccoli which I'm not a big fan of ....<br>and 70% was noodles- equivalent to my 2 weeks worth of gym effort ....so I didn't eat all of it .... the broth was very bland overall was tasteless !!! <br><br>decor is outdated and needs renovation !!!!", "pics": null}}, {"review": {"des": "I've ordered delivery from tank noodle 3 times in the last couple of months. Everytime, I order pho and and shrimp spring rolls.<br><br>The pho broth is really delicious, however, it is not the best I have ever had. For delivery, I really appreciate that Tank Noodle packages everything separately so that you can assemble when you're eating it at home. For example, they package the raw beef in a small plastic bag so that you can heat up the broth (if needed) and place it in whenever you're ready. The veggies are also placed in a separate bag.<br><br>The shrimp spring rolls are fantastic, but I do not like the sauce as much. It is a tangy hot sauce + hoison + fish sauce combo, and I prefer peanut sauces more.", "pics": null}}, {"review": {"des": "Ate here this afternoon for take out.  We had the pho and spring rolls. Both were really good. The ingredients for both items seemed fresh. Recommend.", "pics": null}}, {"review": {"des": "I've been going to tank for over 5 years.  Originally, I went for the pho which by all accounts is very good!  The pho broth is the right amount of savory and they always give a great amount of the fixings to go with it (sprouts, lime, basil, jalapeño).  But one thing I've realized about pho, it's hard to have a favorite that satisfies the palette of every pho aficionado.  Some like a little more grease, some like a little more star anise, some like a little more celery flavor.  This one is just universally good all around and while not my personal favorite, it's hits all the bases.<br><br>This is a five star review because this place not only does justice to the pho, but just about everything else I've had on the menu.  From the spring rolls to the fried egg rolls to the papaya salad to the sizzling crepe, it's all delicious and fresh!<br><br>I love their rice dishes, especially the pork chop and the soup that comes with it.  And their broken rice is ON point!  Delightfully moist and just a little crunch to it, just perfect.  <br><br>Just order my number here, almost the entire wait staff has the whole menu of 200+ items memorized! This place has stood the test of time and for good reason.  If you're new to Vietnamese and want to try out a place and know you left having some good food, go here.  If you just want some good Vietnamese food and don't know what you want, go here.  If you're super particular about a bahn mi or pho flavor, go here but maybe search other places on argyle too to find one that hits all your flavor notes.  <br><br>Did I say go here?  Yeah, it's time.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Uuq-OLeYtV129FeuO2C6SA/168s.jpg", "caption": "Pork chop and rice, not pictured is the soup it comes with.  All delish"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VE1tbt0oPidP3se8wh1Jpg/168s.jpg", "caption": "Chinese watercress (Kong xin cai) stir fried in garlic....you can't get this at a Vietnamese place!  Well you can here!"}]}}, {"review": {"des": "5 stars for amazing service! My friends loved the pho and vermicelli they ordered. The iced coffee I ordered was very strong but very delicious. I got a banh mi. Sadly, there were strands of tough rice noodle-like things, which I didn't really enjoy... but the service definitely made up for it. The servers were nice and the man I assume is the owner checked on us often. He also made sure that we were safe to head back since it was pouring outside. So nice!", "pics": null}}, {"review": {"des": "First time trying Tank noodle, cannot say I'm disappointed. The fam is happy and so am I!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/C4NIr11ZbIe1OWJN2uy4pw/168s.jpg", "caption": "Chicken curry"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sHoSmZXtciu6wxDOL61UGw/168s.jpg", "caption": "Duck & Bamboo noodles"}]}}, {"review": {"des": "So, to be honest, I ate here maybe 4 years ago when I was still living in Chicago. To this day, I have yet to find a Pho place with broth as absolutely delicious as Tank Noodle. A few places have come close, but nothing beats their broth flavor, especially when accompanied by a chilly Chicago winter!", "pics": null}}, {"review": {"des": "Amazing! <br><br>My friend and i tried the mi xao, banh xeo, banh mi, and vietnamese coffee.  Everything tasted so authentic and fresh. I wish the banh xeo came with the rice paper though. I wasnt sure how to eat it.<br><br>The menu was lengthy and overwhelming, but I definitely want to go back and try 100 more different things!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TLfxaoRt7bDviNokrZ2X7w/348s.jpg", "caption": "Banh Mi and Mi Xao"}]}}, {"review": {"des": "I've been coming here for at least 15 years. They remember me and continue to be nice and friendly unlike Sun Wah. They have no deviated from their menu and it tastes the same as I remember. <br><br>I always get their number 40 combination Pho, it never disappoints. It's refreshing and smacks you right in the face with the aromatics. Their avocado smoothie is the best, not overly sweet, just right. <br><br>I love that this family-run business appreciates you patronizing thief establishment. This is why I always go back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RzKnbaoiWcNNZ7JWukZojg/348s.jpg", "caption": "Yeeeah boy!!! Avocado smoothie to top off my meal.. Expensive but worth it!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jsZnk_qgIr1tQbtnfUdC3A/168s.jpg", "caption": "#40... I'll let you know"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AxI4qhm6fGxLNesBlWDHyQ/168s.jpg", "caption": "The Pho accompaniments"}]}}, {"review": {"des": "TIP: Ask for your sliced raw steak on the side if you order Pho and cook it yourself in the broth. This prevents your steak from getting tough and overcooked when servers bring it out.<br><br>DON'T SKIP: Goi Cuon (spring roll with shrimp and pork) - I don't know why this is not the same across all restaurants given the simplicity of this appetizer, but Tank makes the best Goi Cuon and I always cater these spring rolls for my house parties. A lot of places spring rolls are wrapped poorly and rip, or it only gives you option of shrimp, pork, or veggie only, but not both shrimp and pork. <br><br>-----------------------------------------------------------------------------------------<br><br>Since 1990's, I've tried almost all the pho restaurants in Argyle, Lincolnwood, and Chinatown and I keep coming back to Tank Noodle because it's the best in Chicagoland that I've had, but also one of the most expensive. Because of its high-turn over of tables/customers, the vegetables and sliced beef are always very fresh and the soup is always piping hot. However, the broth is inconsistent. Sometimes is very oily, sometimes its well skimmed. Sometimes, its too bit saltier or its thin on the beef flavor. I really like beef tendon, and this is always inconsistent too... under cooked inedible, perfect, or over cooked to a melty-sticky mess. Other restaurants might beat Tank in one aspect or two on broth or tendon, but the beef and added veggies are never as fresh as Tank's.<br><br>On one rare occasion, I strayed from the Pho menu and ordered the #65 Vietnamese's Beef Stew Egg Noodles Soup which had anise (a flavor I normally don't enjoy), cinnamon, carrot, onion, cilantro, green onion, basil leaves. Despite detesting anise, it worked really well in this dish and was not overwhelming! It was deceptively spicy looking, but wasn't spicy at all -- I wish I was spicy though. It broth and noodles were very tasty, but the beef was a little on the dry side. Despite the beef being overcooked, I liked the flavor combo and this experience will encourage me to try things other than pho. <br><br>Avocado smoothies (with little added sugar requested) is to die for. Mmmmmm... <br><br>This is the most friendly and fast service place in Argyle. It is BYOB and very English friendly.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/b5RDwRsYHPC8NGioiGxGIg/348s.jpg", "caption": "#65"}]}}, {"review": {"des": "Tank is my favorite spot for Pho. Yes I know it's the glorified tourist attraction and not a hole in the wall but I've been to those holes and they're nothing noticeably different than Tank. Tank is solid and I am never disappointed when I eat here. The Bun Bo Hue is also the best in Chicago. Service is friendly. Place is clean. People watching is enjoyable. What's more to ask for? <br><br>#RefereEats<br>\"I call it like I eat it.\"", "pics": null}}, {"review": {"des": "I'll eat pho all year round, on those rainy cold afternoons and even hot summer days. It's definitely a comfort food for me. And obviously the best hangover food. I've only been here twice but it hit the spot both times. I would probably come more often if I lived closer.<br><br>After our half an hour journey on the red line, we were ready for some pho. They do have plenty of other options on their menu including bánh mì, congee, egg noodles, rice dishes, and more. But I got my usual pho order, pho tai (#47), or \"sliced beef\", and we decided to try out the pork egg rolls.<br><br>One of the best things about going to pho (besides how delicious it is) is how quick it comes out. Not sure if we were super hungry but it seem like it took a bit longer than we're used to. Back home, it would take no longer than 10 minutes for our pho to come out. Here, we didn't even received our appetizers yet and it wasn't very busy. Anyways, when our egg rolls arrived I was a bit underwhelmed. They were tasty but small (especially for $2.50 a piece). But as for the pho, it did not disappoint. The sliced beef was great. Better quality than other places.<br><br>It's most certainly hard to find good pho in Chicago but Tank's will do!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0KIJ64gkMLq9p4Yw5p-Hsw/168s.jpg", "caption": "#47 sliced beef pho"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Fh3vBk7DTquOfQwMSzRlew/168s.jpg", "caption": "Fried pork egg roll"}]}}, {"review": {"des": "I've been here several times. Usually the wait isn't terrible (15 minutes) and the service is very fast. Most times my pho arrives within 5 minutes of ordering!! <br>The broth here is delicious and the pho is served with plenty of bean sprouts, lime and mint leaves. There is sriracha and spicy chili hot sauce at the table. And if that's not enough, there are some jalapeños that are sure to help you reach your desired heat level! <br><br>Staff is always super friendly. <br>During busy times it can be awkward standing by the entrance, as there is a lot of hot soup moving around. <br>Perfect winter food. Never disappoints.", "pics": null}}, {"review": {"des": "I dream about the pho here - it is hearty, light, and delicious, all at once. The service is on point, and the atmosphere speaks to me. Everyone is just looking for the right bowl of soup to get them through the day.", "pics": null}}, {"review": {"des": "If you can outsmart the crowds that seem to come at all hours of the day, then this place is a great spot for Viet eats! I've tried more dishes here than I can say, and while most people will come for the Pho and Bun, to me the real winner here is the Com Tam. <br><br>Why? The Pho broth (beef, I haven't tried the chicken yet) is a bit lacking in flavor. The Bun is actually great, nothing to complain about there and the variety of herbs and veggies they offer for both are plentiful. But I hardly ever come across true Com Tam, the broken rice, and the grilled pork they make here is juicy, flavorful, and not too oily!", "pics": null}}, {"review": {"des": "Amazing Pho! <br><br>On a cold day there is nothing better than a light stock with noodles, quality ingredients, and fresh herbs. <br><br>We were sat immediately upon arrival and ordered some apps. We ordered the spring rolls and spring egg rolls; they were phenomenal. For dinner we ordered the pho with combination beef. It was my first time tasting tripe which was perfectly cooked and added an earthy flavor along with the mint. <br><br>Parking is available on Broadway, the main street. <br><br>The restaurant is BYOB and it also offers vegetarian and gluten free options as well. <br><br>I will be back.", "pics": null}}, {"review": {"des": "Wife and I got here by pure chance, leaving the metro in the heart of Viet town and basically stumbled upon it. First, the restaurant is so pleasant to be in, so open and bright. Second, the food was amazing! I had the meatball mi and my wife had the skirt steak pho. It was so succulent, rich, and flavorful. It wasn't overpowering, it was just right. Such an enjoyment, definitely worth the trip, and will definitely come back!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XH5ec7OH1d1TavSPlc2Pzw/348s.jpg", "caption": "Egg noodles and broth with meatballs."}]}}, {"review": {"des": "I decided to come here based on the hype it receives online, and I am only in town for a short while so chose this place. This review is for the pho.<br><br>The thing I noticed about any good bowl of pho is the flavor of the broth. It was great even though it wasn't the most flavorful I've had and I'll tell you why. Lots of pho places have a tendency to mask their soups with too much MSG to add flavor. It's an inevitable ingredient, but I felt like this place had a fresher tasting broth that didn't leave me with grimy residue in my mouth or a headache afterwards. To me that's important because there's a lot to do in this city, and I wanted something that gave me energy instead of making me feel tired. I also noticed the meat they use is very good quality. The tai meat is extremely soft and not tough and chewy. They also give you a bunch of vegetables on the side and lime to add to your pho. High quality ingredients make for a natural tasting bowl of pho.<br><br>Overall a good pho restaurant! I would like to try some of their other dishes too if I am ever in the area.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UVgl0V4gaSPfRq7FWzeSFg/348s.jpg", "caption": "Fresh bowl of pho mmm"}]}}, {"review": {"des": "I was really disappointed in Tank Noodle. I came here after I ran the Chicago half marathon, and I was really looking forward to it since so many people had praised their food. This was actually one of the worst experiences I've had on Argyle (I come here often). As soon as I walked in, I noticed a very pungent odor that strangely resembled bad breath. I was startled, but thought maybe it was someone close by and that it would pass. After we were seated, I noticed the smell getting worse and worse. I then thought that maybe it was my partner, but then he seemed to be noticing the smell too. Turned out it was the dirty dish cart that one of the workers was pushing around. It smelled AWFUL. I seriously had to hold my breath whenever they walked past us. We would have left, but still wanted to try the food, so we ordered spring rolls, pho (the combination bowl) and a vermicelli bowl. I wasn't particularly impressed by any of the things we ordered. The pho and verimicelli were fine, but nothing spectacular. The spring rolls were mediocre and tough. We were so happy when we finally left and were in fresh air, and we both decided we would prefer to go to one of the many other places on Arglye to get Vietnamese food in the future.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2WGUI0t--yQijCrP-fCLaA/168s.jpg", "caption": "Verimicelli bowl"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/O0LDNf16BkSBXEZpnyg30A/168s.jpg", "caption": "Pho and verimicelli bowls were only ok"}]}}, {"review": {"des": "Very friendly staff.  Wait was not too long (10 min).  Food was hot and delicious.  Prices are reasonable.", "pics": null}}, {"review": {"des": "One of the best pho in Chicago, definitely one of the most well known, can be a bit crowded due to its fame. The soup base of pho and bun bo are both good, the crepe is great too. Also loved the smoothies here, a lot of Asian flavours.", "pics": null}}, {"review": {"des": "I tried this for my first time when visiting a friend in Chicago. We ordered delivery. I had the Pho Dac Biet. First off, I was very pleased with the abundant amount of fresh basil, bean sprouts, jalapenos and lime that came with the order. After re-heating the broth on the stovetop and adding it to our noodles and meat, it tasted as good as if we were seated at the restaurant. I was pleased with the broth flavor. It was not over salty or watered down. The fresh basil and bean sprouts makes a difference when added to the soup. Did not need to add any sriracha or hoisin sauce to my soup at all. Moderately priced, but good quality. I'm happy with my pho.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/u7fxVWkRfySWcO4ziHFo-g/348s.jpg", "caption": "Delicious"}]}}, {"review": {"des": "As an Asian person originally from the Bay Area, I can tell you that this place is the real deal. This menu is big and beautiful and I encourage you to try everything they have to offer. <br>Some of my favorite dishes are <br>#93 Bun Bo Hue<br>#122 Yang Chow Fried Rice <br>#135 Stirfried Rice Noodles, ask for CRISPY<br>Their claypots are great too.", "pics": null}}, {"review": {"des": "\"Tis the season for pho\". With the first snowfall today, nothing is better than a big bowl of pho. Always friendly service and you get your food rather quickly. It's hard to pass up fresh spring rolls with shrimp, so I always start my meal with them.  Then my pho arrived and I could not be happier. A side plate of fresh bean sprouts, lime wedges, fresh thai basil, and jalepenos that you can use to individualize your bowl of pho, a touch of hoisin and rooster sauce, and voila! Comfort.  I added an iced Vietnamese coffee to go, and let me tell you, if you need a caffeine kick to last you 12 hours, this stuff is like rocket fuel, albeit, deliciously creamy and sweet..", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WTvMlzDQT3GKV7VBBVV5ow/348s.jpg", "caption": "Fresh Thai basil, lime, jalepenos, bean sprouts"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tNKt_xIJSJHNQRQ-c14R0Q/168s.jpg", "caption": "Vietnamese iced coffee. This will definitely give you a jolt of caffeine"}]}}, {"review": {"des": "Tank Noodle requires no additional positive, rave reviews but I have to say that the vegetarian curry noodle soup is so so so good. I love the taro in it! Good amount of tofu also and the coconut flavor isn't the strongest note here. So savory and perfect. <br><br>It took until my third time getting the vegetarian curry noodle soup to figure out that I should not attempt eating the whole, enormous bowl if I plan on moving or staying awake for the rest of the day.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sRSVuiQ1PqN3IrfyC5ParA/348s.jpg", "caption": "Vegetarian curry noodle soup."}]}}, {"review": {"des": "My favorite Pho in Chicago. It's dependable and delicious.<br><br>Tank Noodle is huge which is great for a lone meal or if you're bringing a whole group of people. I've never had to wait long for a table and they move fast there. My favorite is the oxtail pho. The broth is flavorful without too much salt or MSG. The meat is cooked well and plentiful. Their portions are fairly large so I am always more than happy with a small.<br><br>A great place that worth the trip to Uptown for.", "pics": null}}, {"review": {"des": "Came here tonight with the fiancée to celebrate my first day of work and it was delicious! One bowl of noodle soup can easily feed two people! I asked for extra veggies for my shrimp egg noodle soup. Fiancée got lemongrass chicken. We shared the shrimp and pork spring rolls and omg the best I've ever had! Highly recommend", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5GMNWfZPHWBYJx0dll8k6Q/348s.jpg", "caption": "Shrimp and pork spring roll - best ever"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3aMUowvs569dmOKdhnciWQ/168s.jpg", "caption": "Soup veggies"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TnANYUSUDUxv2zur2-ydBw/168s.jpg", "caption": "Shrimp egg noodle plus extra veggies"}]}}, {"review": {"des": "Man.....Tank Noodle is a great place to eat. The atmosphere was welcoming, the owner made sure everything was perfectly cooked, and the green Bob tea is to die for. Best bet that I will be back again and thank you for the great food Tank Noodle.", "pics": null}}, {"review": {"des": "Build your own pho.  Hearty bowls larger than my head and lazy susans with all the fixins!<br><br>This is the place to go if you are looking for a warm your soul kind of meal.  The service is family friendly with tables always packed.  The menu is elaborate but there is always someone around to ask for help. <br><br>With ample parking and the brown line steps away it is a for sure stop to make if you are craving pho.  The neighborhood has a great feel and it's definitely worth taking an adventure up north once in a while.", "pics": null}}, {"review": {"des": "The best pho I've had in Chicago so far!! <br><br>Located in the middle of uptown is a small area congregated with Vietnamese and other Asian populations. Tank Noodle is definitely the best pho place in the area, if not Chicago. <br><br>We came in around 7 pm and there was a 15 minute wait for tables. All the waiters and waitresses are very Vietnamese. The menus are mostly in Vietnamese as well.  <br><br>We ordered the pork and shrimp spring roll and two bowls of regular house pho. Food came out in about 10 minutes. <br><br>The pork and shrimp roll tasted exceptionally fresh. The mint leaves inside were a great touch. The pho was served in a huge portion, and Tank Noodles is very very generous with the meat and vegetables. You can always ask for more if you want. Remember to throw in the vegetables in the soul first to cook them. Out of the meats, the best was the tendon. They were super soft and flavorful. <br><br>Overall, one of the best pho in Chicago. Will frequent.", "pics": null}}, {"review": {"des": "Ok. Is this place clean?! No. Hell no. And I dont and can not give five stars. Three stars are for food because we tried this place by recommendation from Vietnam lady. We also tried two times before and I just wanted to try a real thing. I think that this is the best Vietnam food. But, simply it is not my cup of tea. We had fresh spring shrimp roll. Sliced beef pho, cat fish simmered in clay pot and chicken curry coconut soup. I can eat it by some chance. But I will not especially for it.", "pics": null}}, {"review": {"des": "Always love their pho - really good and consistent flavors. Super fast and sweet service. Also, love the thai iced tea smoothie with tapioca they use real tea leaves and not powder.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VViM694NRR7dMzhJ7_Cb1g/168s.jpg", "caption": "Pho with Beef Slice and Meatballs.. Love! ♡"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/R1eD3dlASzvrkH2FUd6P6A/168s.jpg", "caption": "Anytime I'm in Argyle I need TANK's Thai Iced Tea Smoothie!! Authentic - not powder!"}]}}, {"review": {"des": "Use to be my go-to place for Vietnamese food, but haven't been back in a few months after getting food poisoning after dining here.  I wanted to introduce my friends to Vietnamese food, so we went here since it's well known and BYOB (pros).  I had a large bowl of Pho, and I started to feel ill within a few hours.  I was nauseous, and things noone ever want to experienced happend from all ends (didn't even realize this was possible).  It ran its course throughout the night, but I had to go to urgent care the next day to get fluids, because it was hard to keep down fluids.<br><br>I get that one carries the risk of getting some type of food bourne illness when eating rare meats (Tai), but this has never happened before - not at a Vietnamese restaurant, steak restaurant, sushi, or even when I eat raw oysters.  This could have been one of those isolated incidents, but I assume this was due to poor food handling.  I haven't been back, because not only do I have an aversion to this place due to that incident, but also there are so many other good Vietnamese restaurants in the area.<br><br>Pros:<br>-Large Food selection<br>-Portions are large<br>-BYOB<br><br>Cons:<br>-Food Poisoning<br>-Quality of food<br>-Prices going up as it gets popular<br><br>Neutral:<br>-They sometimes blast some Nicki Minaj and other rap music while I've dined there.  I like the music, but does it go with the ambiance and Vietnamese restaurant vibe, not quite sure how I feel about it.", "pics": null}}, {"review": {"des": "If I'm not getting my home-cooked pho from my parents, I typically go to Tank Noodle. I typically get their ox tail soup, which is basically pho but a bit more rich (fatty ) and tastes phenomenal!! Their broth is pretty consistent and the portions are pretty good!! I'm also a huge fan of bun bo hue, I order this as well! It's hard to find good bun bo hue- I typically like it more savory than sweet and Tank Noodle makes it perfectly. The only reason I'm not giving TN 5 stars is because there was one time where the BBH I ordered tasted a bit watery, I was surprised bc I've been Going here for years and never have any complaints! Still a great restaurant!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/D2zOv0bR8Rw2wgGwWJrUvg/348s.jpg", "caption": "Bun Bo Hue"}]}}, {"review": {"des": "Amazing Vietnamese food. The vermicelli was out of this world! Seriously may have been the best grilled pork I've ever had. The pho had a super flavorful broth and the portions are huge! The chicken in the curry sauce was extremely tender, it melted in your mouth. Service was quick and the prices were very reasonable. If you're looking for outstanding Vietnamese this is the place to go.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iwTZWPZrQgTJiujjhVqHzA/348s.jpg", "caption": "Beef broth pho"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6QqgxLYn3qjZPjH9v-GMPg/168s.jpg", "caption": "Grilled Lori vermicelli noodles"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nyhiNgHsSORtY4uTfL5g4g/168s.jpg", "caption": "Curry chicken"}]}}, {"review": {"des": "Great neighbor place. Kind of a strange atmosphere and on our first visit we were very confused at the seating arrangements. However the food is great, and they have a huge menu!", "pics": null}}, {"review": {"des": "Yes.  Enormous bowls of soup, or stew, or pho, not sure which one it is I usually get.  <br><br>Tables offers an assortment of herbs, spices, and sauces for you to either a) accentuate the flavors of your enormous bowl of soup, or stew, or pho or b) completely ruin your soup/stew/pho bowl, because you, maybe a first-timer to this kind of soup stuff, have no idea what you're putting in your bowl.  So kindly ask your server for guidance before you potentially ruin what could be a satisfying, life long romance with Tank Noodle.<br><br>Vietnamese iced coffee is pretty strong, I get the shakes from it, maybe it's my pancreas.  Spring rolls with shrimp are good.  If I were a social person, I might make friends here too.  Seems like everyone gets along.  Maybe it's the big communal tables...I think that's like, a European thing?  Communal tables.", "pics": null}}, {"review": {"des": "I been to this place couple days ago...love love love their Pho! The broth is very tasty and the noodle are great. I order the duck Pho they give a good amount of meat and noodle. The portion was great able to finish the whole bowl and drink half of the broth. Perfect weather for Pho. I would definitely come back here and bring my friend!", "pics": null}}, {"review": {"des": "After searching for parking, we finally found a spot a couple blocks away. Walked in and we were seated right away. Ordered our food, and received some of the best pho that I have ever had!! The broth was so delicious, and they didn't skimp out in the meat. Will definitely be back for more!!", "pics": null}}, {"review": {"des": "I went to Tank Noodle for the first time based on the rave reviews and recommendations of my friends. The food is amazing, and I continue to go back because of the great quality.  I understand some visitors to Chicago might think this place is \"expensive\". However, for Chicago prices, these can't be beat. The prices compared to the taste and portions is pretty great. You can get a really great meal for $10-20. It's GREAT.<br><br>The menu is extensive, and to me, it's overwhelming, but everything I've tried is good every single time! The vibe of the place is busy, and home-y, not the kind of lux vibe you might get from a downtown restaurant like Ramen-san. I much prefer Tank Noodle because of the price and the chill, casual feel. Tank Noodle is where I take family and friends, but Ramen-san is where I would take a client or have a business dinner.<br><br>If you're looking to impress someone with your savvy of authentic restaurants, this is the place for you.", "pics": null}}, {"review": {"des": "Rating: 3.5 Stars<br><br>This is a great place to get pho at. The price is very reasonable and you get a gigantic bowl! I feel like the quality of the pho can vary a little too much between visits, but overall the experience is usually great. <br><br>Since the restaurant seats so many, even during peak hours, getting a seat is typically instantaneous or with a very short wait. The other items are pretty average for Vietnamese food and are good for what they are, but don't particularly stand out.<br><br>Definitely stop by if you're craving a bowl of pho and want to get it quickly. It's right by the Argyle red line stop and worth a try.", "pics": null}}, {"review": {"des": "Nothing like a bowl of noodle soup on a cold day...<br><br>Pho is solid with a multitude of customizable protein options... Flank steak is always good, the skirt steak was a little too sinewy for me, but the flavors are on point.  I throw in all the fixings and the flavors are always so fresh and light.  <br><br>Also had the shrimp spring rolls which were standard fare, I always amp up the dipping sauce with a little siracha and end up adding the leftover sauce to my pho...yum", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cgyExhoAVoD2JYmjL7_QwA/168s.jpg", "caption": "#43"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kUHrHAdEROSdY7-K-zN5pw/168s.jpg", "caption": "Shrimp spring roll"}]}}, {"review": {"des": "When I first came here 5 years ago, the food was decent. I came back thinking it got better because of the 4 stars reviews in Yelp. Nope. Now I am just overpaying for bland Vietnamese food. Not only that, the food came out as if it were scooped up, dumped on my plate, and then served.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3d23uIsq_PlEFOkN1S3C2g/348s.jpg", "caption": "$13 for this? Rice w/shaken beef."}]}}]}