{"name": "tanta-chicago", "reviews": [{"review": {"des": "As a Peruvian, I was so excited to see a Gaston Acurio restaurant near my hotel. It lived up to all the hype and expectations. As a Peruvian, it's incredibly hard to find authentic and delicious food outside of my hometown or major cities. This place knocks it Out of the park. <br><br>Chicken empanada: delicious and moist, great with a Peruvian beer. <br><br>Causa clasica: fresh and flavorful, could have used a little more huancaina sauce. King grab totally the way to go. Avocado is a sauce and tomatoes aren't overwhelming.<br><br>We ate a few more dishes I can't quite remember but I had zero complaints. Every flavor and texture profile was hit.", "pics": null}}, {"review": {"des": "We went on a Sunday this summer. I really wanted to sit outside, but wasn't sure if it'd be warm enough, so I dressed extra warm & was still unsure. Thankfully the area upstairs was a bit sheltered on the sides, so it was warm enough! Yay!<br>My husband was running behind, so I waited in the small waiting area downstairs.<br>So many things I wanted to try on the menu! I was most excited for their margarita with the rocoto ice. It's called \"el chingon\". By far my favorite margarita ever! We usually make spicy margaritas at home, or I request them spicy when out, but this rocoto is ammaaazing! The more it melts, the spicier your drink gets! My husband had the same, & a beer.<br>For appetizers we tried the ceviche Classico & el pobre. Both were delicious!<br>For entrees we had the verdura nikei side dish with sudado & plancha marina. Everything was delicious! I'd recommend the plancha marina over the sudado, but the sudado was good.<br>Service was pretty good to start, felt we were waiting more than we hoped to a few times, but overall good.<br>The only reason they don't get 5 stars, was because when you leave, you begin to notice all the salt you ate! Delicious, but a bit too highly salted. If you can request less salt, do so! I will try it next time & hopefully update to 5.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5AsBxqcoEMFdqpThIct13Q/348s.jpg", "caption": "Verdura nikei"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DISljFGBgsXDaZLgury9GA/168s.jpg", "caption": "El chingon"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/T383HTiaWvqp5xaoMPotpg/168s.jpg", "caption": "Plancha marina"}]}}, {"review": {"des": "Tanta is our fave 10 spots in Chicago. <br>I like here everything. Atmosphere, drinks, appetizers.. everything. <br>And we have been here sooo many times that finally it deserves review. <br>I rarely give five stars but for my Tanta it would be even 10 if it could.<br>I recommend brunch for easy bites or some casual meetings.. and save room for dinner time. <br>Just name it from meni we tried it, yes even the beef ..<br>Ceviche perfection. Skewers perfectly seasoned..Octopus ahhh, amazing.. Lamb leg in creamy palenta.. NY steak, fried fish, amish chicken, fried rice..<br>I think that I loved about Tanta is that everything you can mix and match:).. Guys don't skip it.. visit often as you can..", "pics": null}}, {"review": {"des": "Everything was delicious! Salmon Anticuchero - the flavors all blended together beautifully. The Salmon was cooked correctly and not dry. The sauce was the perfect addition. I'd definitely order again.<br>I love the complimentary 'chips' served before your entrees with the sauce (tasted like a mustard sauce).<br>For Desserts - the Pie de Limon & Mousse de Chocolate Fortunato were both amazinggggg! Literally, just packed with flavor.<br>I don't know if you can go wrong with anything you order here.. there were 5 of us and we all loved our food.<br>Great find!", "pics": null}}, {"review": {"des": "This was a culinary treat for me. I have been to Gaston's restaurant both in Peru and in San Francisco and each place delivers a solid experience. This time I tried the happy hour - bao and ceviche. For the $5 price tag both were packed with flavor and the ceviche was generous in seafood pieces. <br>Going on to our dinner. The beef empanada, tiraditos and squid ink rice were all delicious.<br>The pobre niguiri was also a dish worth ordering. Definitely a perfect fusion of Japanese and Peruvian cuisine. <br>Also would like to mention the yuca chips they served complimentary were yummy.", "pics": null}}, {"review": {"des": "A few of my girlfriends had brunch at Tanta (thanks for the rec', Anna K!), and their Peruvian tapas + rooftop saved our hungover lives. <br><br>Their rooftop is lovely and lush with plants and string lighting. Great views too! Famished and on the brink of post-birthday-celebraish death, we ordered several things from the menu. We got a couple varieties of ceviche, empanadas, two orders of octopus/pulpo antichucho, a vegetable special featuring asparagus and poached eggs, side potatoes, and some drinks ie hair of the dog.<br><br>When the server described the pulpo antichucho, we instantly asked for two servings. I am so glad we did! The super tender octopus came served beautifully on top of perfect potatoes and lots of fresh herbs. The ceviche was so wonderful we ordered more too. We loved the variety of fish in ample portions, all with a balanced sauce and garnishes. Service was a little inconsistent sometimes and they goofed on our potato order, but overall I highly recommend tapas at Tanta!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SbJwppim4hL_BjATsc0qMA/348s.jpg", "caption": "Impressive octopus! So meaty and tender."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EIMyxoVaWoEowywtnMzIAA/168s.jpg", "caption": "Ceviche - amazing"}]}}, {"review": {"des": "Jalea Tanta: My friends give it 5 stars. Deliciousness!<br><br>Bachiche: This dish was buttery and savory! My friends give it 5 stars!<br><br>Pobre: The skirt steak was fantastic but expected. My friends give this 4 stars. <br><br>Criollo: This dish is fabulous! The scallop and the wagyu beef is a great combination of flavors! My friends give this dish 5 stars! <br><br>Vegetarian:  Verdura dish is tasty but heavy on the soy sauce. I give this 4 stars. The veggies were tender as expected. It basically a stir fry.<br><br>Vegetarian: Empanadas Tamal needed more salt and another flavor. The cheese wasn't that flavorful. I give this a 3 stars.<br><br>Beverage: El Macho was a great substitute of an actual Old Fashion. I give this 4 stars! <br><br>Dessert: Cheesecake is hands down the favorite in our group. We give it a 5!<br><br>Dessert: Pie Dr Limon, we give this a 5 as well!<br><br>Dessert: Mousse is really rich! We give this a 3. You gotta be in the mood for rich chocolate.<br><br>Roof Top: wonderful views! Patio lights and music in the background and a nice windy breeze! <br><br>Enjoy!", "pics": null}}, {"review": {"des": "Pros: Whatever you decide to order at this amazing restaurant, please TRY THE EMPANADAS!!!! I'm still day dreaming of the tamal empanada, I may go back just to get a few to-go. Service was excellent, locale is beautiful. We went for brunch, I had the espárragos anticuchados, it was AMAZING.<br><br>Cons: The water bottles had a weird green plant type specimen at the bottom, no idea what it was but it was not inviting, perhaps they could enlighten me! They still get 5 stars because the food was perfection.", "pics": null}}, {"review": {"des": "Tanta brings a little piece of Peru in your whole dining experience. The food is amazing. It is not food that a Peruvian mom or grandmother might make. It is a twist on those items and classic dishes but prepared in a world class atmosphere. The atmosphere is great. For lunch you can bring your kids. I went with my wife, well behaved nephew and in-laws. Lunch was great and so have been my 3 or 4 dinner experiences. They were very accommodating when both me and my brother in law showed up with leg injuries for our reservation. <br><br>I love the details in plating, the decorations of the dining room and other areas take you on a visit to Peru. Down the stairs to the bathroom you will see a wall that remind you of Peru in October and make you want a Doña Pepa turron. The men's room has paintings resembling concert posters you see glued to walls and lightposts in Peru. This places makes me miss Peru more but also satisfies me knowing I cannot always travel there. So when I come from Ohio to visit we \"travel\" to Tanta. I was happy to try the chingon and barbarian cervezas.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DQ9gDqhEGe9HtGSY-5Fs8Q/348s.jpg", "caption": "Bathroom wall"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fnil5NZPT6CGkNu0lDbWJQ/168s.jpg", "caption": "Calamares en su tinta"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0keUzTmR-1DU-n5GjnsOvA/168s.jpg", "caption": "Pan con chicharron"}]}}, {"review": {"des": "Another super fun rooftop in River North.  Again a beautiful place outside if there's room to cocktail.<br>High top tables with umbrella and seats at the bar.  Full neither also available to eat here.<br><br>It's a Peruvian restaurant with an extensive selection of appetizers and entrees.  But not to be missed so many fun cocktails.  You'll be sure to find something you.<br><br>As you pass all the patrons you'll notice the first drink I posted with a red floating ice sphere in the cocktail.  Although I did not have this one my husband did.<br><br>It's Smokey & spicy with Jalapeño in the mix.<br> It gets rave review.  I had the traditional Pisco sour which was also delish and a work of art as well.<br><br>Bartenders were super friendly and helpful to guide you thru the choice of mixed cocktails.  Enjoy.  <br><br>I will say it's about being outdoors and just some random tall building to look at in the area.  Can't compare to the view at London House.  But cocktails can't be missed!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Uva2kuifEQFU1I2EgHKJJg/168s.jpg", "caption": "Pisco Sour"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/A3SHMo1mI6WE5_pTlAI9Bw/168s.jpg", "caption": "El Chingon"}]}}, {"review": {"des": "If there's a rooftop table available, you should definitely take it because it is gorgeous! We came here on a random week night for dinner and there was plenty of seating. The complementary plantain chips were delicious and so was everything else we ordered. The scallops are pretty but the Parmesan taste is a bit strong!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WpfkJbGODxgdLmZz-DyTKg/348s.jpg", "caption": "Skirt steak with quail eggs"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tuCIHzRnkw2AftUCETi89A/168s.jpg", "caption": "Plantain chips"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/o2DlTQu6EJmNpgdOcxwULw/168s.jpg", "caption": "Beef heart"}]}}, {"review": {"des": "Came in only for a drink at the bar. We ended up trying the \"niguiri nikei\". Which is a skirt steak and quail egg nigiri styled sushi.. but not called nigiri, because it's a mixture of Peruvian and Japanese cuisine.. I normally would not order something like this .  It was interesting , I'm glad I tried it! <br><br>I will be back for the rooftop. , which was sadly closed the night we went .", "pics": null}}, {"review": {"des": "Went here for my birthday a couple weeks ago on a Saturday at 1 PM. We had originally booked for 1:30 but we're glad they were able to take us in no problem. The place wasn't as busy as I expected which I liked-- considering we brought our baby with us. We basically ordered most of the vegetarian dishes they had on their lunch menu. For our starters we had the Potatoes (this was probably our least favorite), Choclo, and Empanada (another favorite. Getting 5 of these next time!). For our main course, we had the Power Lunch Veggie and my favorite was probably the spicy veggies from the three dishes and Quinoa Chaufa (this was probably not really necessary if you're getting the Power Lunch Veggie as it's already there.) And for our drinks we had El Chingon (so good especially if you love mezcal) and La Guapa. <br>Everything was amazing and we would definitely go back!", "pics": null}}, {"review": {"des": "I have never eaten Peruvian food that did not shake my soul and leave me both physically sated and spiritually hungering for more. Tanta managed to leave me wanting.<br><br>I ordered an expensive ceviche plate. The waiter brings over a small plate with about three chunks of tuna. I waited for the rest of the $20 plate to show up. It never did. <br><br>The chicken plate did turn up. The salad was heartily forgettable. The fries were standard fare. I sadly munched on the chicken skin, which by itself tasted fine, but disappeared quickly, before turning to the white meat, which was mediocre. I stared wistfully at the rain clouds overhead. I longed to escape this steaming drivel. I dreamed of my life before ordinary, over-priced food.", "pics": null}}, {"review": {"des": "Tanta is still one of my most favorite restaurants in Chicago...hands down!  We rarely have a bad meal, and last week was no exception.  We were lucky enough to snag a table on the rooftop on a Friday night.  Great ambiance and view of the city.<br><br>We had our usual pisco sours - which are the best in the city.  We had the sirloin empanada, Conchitas scallop, aeoropuerto, and the Carretilla ceviche.  We loved every dish!  The empanada and ceviche had a wonderful spiciness to them.<br><br>We will continue to go back to Tanta and encourage everyone to go there!", "pics": null}}, {"review": {"des": "Pisco Sour($12)- very good- smells and tastes like Fall<br>Nikei Ceviche (small-$12)- flavorful, fresh and delicious <br>Pescado Frito ($39)- individually battered pieces of sweet/sour flavored fish presented on a battered fish skeleton. Very tasty, but would recommend as a dish for sharing as the portion is pretty big, and with the sauce being very sweet the flavor gets tiresome after a few fish \"nuggets\"<br>Pollo a la brasa(1/2 order) ($23)- pretty big entree despite it being a half order. Comes with a side of wedge fries, salad and rice. Favorite part of the entree was actually the delicious, buttery flavored rice! And the three dipping sauces. Chicken was a bit dry. <br>Pollo Empanada- simple, average empanada<br>Plantain chips-supposedly complimentary, but never received<br><br>Overall, food was decent, but overpriced.<br><br>Ambiance:<br>Had reservations for the rooftop bar, but there was still a long wait time, so decided to sit indoors. Actually ended up preferring indoor seating as it was very rowdy, loud, and cramped at the rooftop bar. It was still pretty lively and loud inside, but the mood lighting and more spacious layout made for a more enjoyable dining experience.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4rS9u-6qI9n1QQspOEuh7A/348s.jpg", "caption": "Pescado Frito"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-0NIzoloV3Gw1oYkKe7cTw/168s.jpg", "caption": "Pollo Empanada"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JD6bB0bCfYgKS4NHOC5Zyw/168s.jpg", "caption": "Nikei Ceviche"}]}}, {"review": {"des": "We were just at Tanta last night, we went to celebrate a friends birthday. It got off to a bit of a rough start with seating and being told a their was a cake slice fee. <br><br>Aside from that the Tom Collins and the Old Fashion were very good and they were the perfect appetizers before the meal. We order ceviche and had a different type at each end of the table. They were very good.<br><br>Meal came and to be honest with you I got the ribs and the beef heart, yes beef heart. They were what hit the spot the rib meat was perfect and the heart was great. Never thought I'd have beef heart but now I have. Everyone at our table enjoyed the food and it was worth the trip.<br><br>Service was good with good recommendations and quick service. Only hiccup was our seating at the start, we had a reservation for 12 and I don't think they were ready and honestly I can't blame them too much. <br><br>Next time we come we'll have to try the upstairs and bring a smaller group.", "pics": null}}, {"review": {"des": "This is another one of those places that lots of people have tried and told me so much about over then last couple of years. I was supposed to actually show up here for brunch a couple of years ago, but I just didn't make it. Fast forward to last week as Restaurant Week was upon us and I was able to convince some friends/colleagues to make it over for the $22 prix fixe per person lunch and they happily accepted my idea.<br><br>The place is located to one of my favorite cocktail bars, Arbella in which they have a connection to. I was told by one of the people that work there that they are under the same umbrella. Our server came to the table and broke down the Restaurant Week menu as well as the regular menu. He started us out with some plantains which was good and then gave us some yucca with cheese drizzled over it which was very good!  I also ordered a Pisco sour which was amazing...I wish it wasn't lunch time as I would have had another. <br><br>The entree options were very good and as I was waiting on my friends to show up I asked the bar staff what they thought of the options and they told me to go with the Aeropuerto which is Chinese bbq pork fried rice, shrimp egg tortilla and mushrooms...very good dish and a very big portion. When the server brought it over he mashed it all up and I then went to town on as much as I  could.One of my friends got the Grilled salmon with spicy sauce and it was good as well. The bar gal told me that would be her 2nd option after the Chinese rice dish. The dessert was the Alfajor which is a short bread cookie, dulce de leche and lucuma ice cream...it was very good and had a butter scotch flavor to it. Had a chance to taste my friend's Peruvian chocolate mousse with quinoa and it was good as well. <br><br>I like Tanta and would like to come back and try more items and the service and setting is very good. I see myself paying a few more visits here in 2018.", "pics": null}}, {"review": {"des": "Went here with a client for dinner. 4 of us. Definitely get the entrees to share. 4 of us shared 4 entrees and 2 appetizers. The food is so good. I'm so glad we shared because all of them were good. It was nice to try food that I had never heard of or seen before. It was really helpful to have somebody with us who had been there before. The menu is overwhelming because of the choices and the uniqueness of the food. Definitely ask the waitstaff for suggestions if you don't have an \"expert\" with you. They also have interesting mixed drinks with funky names. You won't regret going here.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HyRkxwjSzM_dKEscGiF44w/348s.jpg", "caption": "Mixing"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UaO9j52ughpD38v0izLLag/168s.jpg", "caption": "Apps"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bQaFWLZjQ2boj12BoPlRSA/168s.jpg", "caption": "Entrees"}]}}, {"review": {"des": "Stopped by for a quick drink and a post-dinner, \"second\" dinner with a friend.  Ate at the bar. <br><br>The service at the bar was a bit hit or miss, but I plowed on. They had Alligash White so that was a good sign.<br><br>I ordered an empanada. They are supposed to be good right? And I take a bite and....it's ice cold on the bite. Ugh.  Just gross.<br><br>They profusely apologized and brought out a second one. Much better but alas the damage is done. Kitchen shouldn't make mistakes like that one.  After that experience, I held off on another dish and just made do with the beer.<br><br>My dining companion had a bit more and enjoyed it more than me. So, just a one-off? Or something larger? Don't know but I left this place underwhelmed.", "pics": null}}, {"review": {"des": "My experience at Tanta was good. Most dishes are bursting with flavour. Love the chocola corn and the octopus; 2 dishes you must try.  It's a tapas style restuarant so feel liberated to order a few dishes and try a bit of everything. Good idea to make reservations. I need to mention a weird observation: the front door is extremely heavy. Make sure you are prepared to power through it on your way in and out!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vBO1DueP7w7hh1XNyvNBWw/348s.jpg", "caption": "Warm quinoa"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gXWboabEXpFm35-Km0HQtg/168s.jpg", "caption": "Mojito look a like."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0mNbZ1i3G8xZG7LxHjdZ3g/168s.jpg", "caption": "Corn...on the cob. Savoury"}]}}, {"review": {"des": "January is always a stressful time of year for me. New year, new expectations....New Restaurant Week Menu's! The choices! There are simply too many.<br><br>This year, Tanta was the winner for dinner. It was the right choice. Our experience, from beginning to end, was fantastic - even with a bonus photo backdrop downstairs!<br><br>Three was our company and there were three options per flight, so we just shared everything, per the suggestion of our server.<br><br>The Ceviche was out of this world, citrus-y and tender. Definitely the appetizer winner. We also had Causa Anticuchera (Grilled Octopus) and Quinoa Caprese, both which were solid starters.<br><br>For main courses, the winner in my opinion was the Beef Stir Fry. I struggle to say that, because it wasn't as inventive as everything else we dined on, but when you do a simple dish well - it shows! This was just perfect. The Pasta Tanta was a close second (VERY rich - not sure I could eat this entire course as a main) and though third in my book, the shrimp crusted fish was still incredible. <br><br>The three desserts were great, but we were stuffed. These Restaurant Week portions were no joke! I also had an El Chingon - a Jalapeno Tequila drink. The spice is in the ice cube ball, so it got spicier as the ice melted. <br><br>Great meal! I'd definitely return. Per Michaelango V's request, I took lots of photos! Check out the shiny background - great for photos; it's downstairs near the restrooms.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/F4MCgzIVU8nYYYtV-tAIkA/168s.jpg", "caption": "Fun photo backdrop downstairs!"}]}}, {"review": {"des": "One of my favorite places to go. Great Menu and even better drinks. The rooftop is a great date place if open.<br><br>Tried two of the Cebiches which were great. The Frilled Prime NY Strip is a must have .", "pics": null}}, {"review": {"des": "Interesting Peruvian fusion restaurant that serves picture worthy dishes. Enjoyed the \"meat sushi\" and ceviche they are famous for, and think the place has great cocktails and location to hang out before or after for a night on the town. This restaurant is a solid pick, but was slightly disappointed as a friend said this was their favorite restaurant in the city, and I felt it was more \"good not great\" material. Definitely a solid pick for a special occasion as the food presents and looks beautiful. For more pics and reviews check out @BuehEats on Instagram", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Tn1zFaRCRo9_ansPyTvWcQ/168s.jpg", "caption": "Scallop nigiri"}]}}, {"review": {"des": "I've been dying to try this place and the unique peruvian flavors, and my expectations were far exceeded! I will continue to rave about the awesome food and service we had here. Our waitress was so knowledgeable and informative, which is necessary in a restaurant like this as we had no idea what half the items on the menu even were. <br><br>Per recommendations, we tried the octopus appetizer first. This was a delicious, tender small plate that was perfect for two to share a few bites of. The mashed potato (I think that's what it was?) underneath the meat was great too. Then we shared the plancha marina and chaufa aeropuerto. These seafood platter and pork fried rice dish, respectively, came sizzling and were very pleasing to the eye. The fried rice was mixed in front of us and was so delicious when we finally got a taste. The seafood platter was super flavorful, with plenty of different seafoods mixed in.<br><br>All this food went down really well with my paloma cocktail. I couldn't handle the pisco, otherwise I would have gotten a pisco cocktail. All in all, service was quick and excellent. Food was just as excellent. Everything was great!", "pics": null}}, {"review": {"des": "Fantastic experience and delicious food. We were very pleased with quality and service. Can't wait to be back!", "pics": null}}, {"review": {"des": "We enjoyed most of our experience here. The drinks were great and service attentive. The food was really delish- especially the ceviches!  The one exception was the whole fish dish we ordered. There were a couple of problems with that one- it was deep fried and was soggy when it got to us, and the fish was REALLY fishy. ( like it was not fresh, fishy). <br>I'll return.", "pics": null}}, {"review": {"des": "The food and ambience are all very good and I'll definitely come back to try other dishes. We ordered beef heart skewer, king crab causitas, and pollo a la brasa this time.<br><br>It's my first time having beef heart, and it tasted very tender. The potato has crispy skins and the corns are very delicious. Everything on that plate was delicious.<br><br>King crab causitas is very interesting. The mashed potato  was a little too salty for me, but they had lots of king crab on top of it. It reminds me of king crab potato salad when mixed together. The quail eggs make the dish look cuter. <br><br>Pollo a la brasa has chicken, wedge cut fries, salad, beans and rice. Chicken might have been premarinated and it was juicy, tender and flavorful. The skin was slightly burnt so it tasted perfect!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6r8mvdoKl9MhkaRe3yRXjQ/348s.jpg", "caption": "pollo a la brasa"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YNKuW4KsXGyiKSC1HouYxw/168s.jpg", "caption": "beef heart skewer"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/s0CvoqP_jTH7j8j14DnCdQ/168s.jpg", "caption": "king crab causitas"}]}}, {"review": {"des": "Recently I had the pleasure of eating at Tanta - it was recommended to me by a local. The cuisine is very unique and so tasty!!  A blend of Peruvian and Asian flavors. I had many favorites here- and would definitely recommend the following: <br>* The pork fried rice - cooked in a stone pot....so good and a definite must try!!<br>* Tanta Cebiche - unique and delicious combination of flavors<br>* skirt steak niguri - loved the quail egg!<br>* clasica causita - crab was full of flavor and the tobiko gave it a nice crunchy texture<br><br>My least favorite was the corn cake - it was a bit too sweet for my taste and it came with the fried rice. The two together is not a good combination of flavors. Did I say the pork rice is a must try??  <br><br>The service was spot on!  We sat at the bar and explained to the server we were in a hurry as we needed to catch one of the architectural boat tours. I had scouted out the menu prior so I was ready to order before the waters even arrived. Would love to return the next time I'm in town!!", "pics": null}}, {"review": {"des": "I recently attended brunch at Tanta with a bunch of cool Yelpers from across the country.  Tanta is an attractively designed Peruvian restaurant located on Grand in the River North area.  They are open on Sunday at 11:00 AM, though if you are a few minutes early you can chill at the lovely bar area while waiting to be seated.  There is supposedly a wonderful rooftop terrace, though apparently it is only open May through September.  There were eight of us in our group, and we were seated at a table in the back by the kitchen, and near the stairs that lead to the restrooms on the lower level.<br><br>Our group ordered quite a variety of food.  There were plenty of tasty and interesting food selections on the menu.  To start things off our servers presented baskets of plantain chips with dipping sauces, and carafes of drinking water.  Off the brunch menu I ordered the aji de gallina pot pie.  Aji de gallina is a very typical chicken dish that can be found all over Peru, so I was very intrigued to order this version of the Peruvian dish as a mashup with the thoroughly typical American chicken pot pie.  The result was delicious!  The sauce in the pot pie is very similar to what I had tasted in aji de gallina dishes in Peru, with a mild curry-ish flavor enveloping chunks of chicken, along with an olive and a quail egg.  A square of puff pastry was draped over the top of this dish, flaky as you would expect atop a real-deal pot pie.  There was also a mini-salad that topped and sided the pot pie.  Other dishes ordered at our table included Calamari en su Tinta - with both cooked and crispy calamari atop a pool of squid ink and avocado mousse, and Huevos Tanta - braised beef cheeks with hash browns and fried eggs.  We also ordered chicken empanada, quinoa salad, and a beautifully presented grilled choclo among other plates. Tanta was definitely an enjoyable adventure for the eyes and the taste buds.", "pics": null}}, {"review": {"des": "we came right when they opened and because we had a full day of eating so we just came here to sample a few small dishes.<br><br>Ordered the Cebiches Sampler and we immediately wished we got their full order. While it was great to taste a little bit of the Clasico, Criollo, and Nikei. I like the Clasico and the Criollo the most. We could have skipped the Nikei. <br><br>Clasico came with fish, red onions, and cilantro. The acidity combined with cilantro made this dish so aromatic and addicting.<br><br>Criollo had fish, scallop, squid, and shrimp with aji amarillo sauce - this was just as tasty as Clasico with a little kick. <br><br>Nikei - ahi tuna (which i thought wasn't as fresh), cucumber, avocado with tamarind. This was not that tasty, in a way it reminded me of a regular poke bowl but with less flavor. I didn't find this mouthwatering at all. <br><br>Beef Heart skewers (comes in two skewers), grilled. On a bed of potatoes and corn with polleria sauce. I thought this was tasty; it's got a little smokiness and a little bit of spicy taste. However for $10, it was quite expensive. for the amount they gave. <br><br>Pulpo: Grilled Octopus (just the tentacles) on top of mashed potato balls with chimichurri, crispy garlic, olive oil sauce. This was VERY delicious. The octopus was tender, the sauce went well with the potatoes and the octopus. One problem was that there were just too many potatoes vs octopus. The potatoes definitely filled me up. You get 3 potato balls w/ the octopus tentacles for $17.<br><br>Overall i do think this restaurant is very expensive. but the food was good - everything was delicious (except for the Nikei, in my opinion). <br><br>I would like to come back and try their seafood rice dish.", "pics": null}}, {"review": {"des": "Came here right at the open on Saturday. We were the only ones when we got there but people started to trickle in gradually. The service here is decent (probably helped that they weren't busy). <br><br>My boyfriend got the Chicha Morada ($6) a non alcoholic fruity drink and I had the matcha cocktail ($9) although I really couldn't taste the matcha at all. <br><br>We ordered the Ceviche Nikei ($19) to start which was a small portion for $19 but had really fresh and bright flavors. For our entrees we got the Chaufa Aeropuerto ($19) a pork fried rice with spicy garlic. The sweet chili sauce was really delicious but the dish was a bit too salty for me. We also got the Arroz Con Pollo ($18) which was delicious and tasted authentic. It had chunks of giant Peruvian corn kernels that I really enjoyed. <br><br>We would definitely come back here again to try their dinner items and cocktails, probably in the summer during rooftop season!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Mu_EJ7SYXumVQgRmPnnJkw/168s.jpg", "caption": "Arroz con Pollo"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BCkXRpx7jcTs02WImU0YNw/168s.jpg", "caption": "Ceviche Nikei"}]}}, {"review": {"des": "Went to Tanta on a Friday evening and had a fantastic time and wonderful food. Everything we had was unique and delicious. We had the clasica causitas, conchitas a la parmesana, pobre niguiris nikei and pescado frito. The clasica causitas were amazing, so tasty and one of our favorites of what we ordered. Scallops (conchitas a la parmesana) were rich in flavor and cooked to perfection. The pobre niguiris nikei was okay, some of the meat was chewy but still very good. Lastly, the whole fish (ppescado frito) was spectacular, the fish is deboned and easy to eat. The sauce on the fish was absolutely delicious and the meat was tender.  We also had a variety of cocktails and were impressed with them. Definitely highly recommend Tanta. Service was great and food was even better, will definitely be going back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xB_jtm06r76yGzAktIubdg/348s.jpg", "caption": "Clasica causitas"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4om592LAqn9aa5xyqJ6KzA/168s.jpg", "caption": "Whole fish (pescado frito)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mlZEaq7oSthpWbt2xptm4g/168s.jpg", "caption": "Scallops (conchitas a la parmesana)"}]}}, {"review": {"des": "My husband and I had our anniversary dinner here. It was the first time either of us were having Peruvian food and we didn't know what to expect. <br><br>The seafood was amazing  -- we got the shrimp and scallop Ceviche and salmon Sashimi -- both were excellent.. the ceviche was slightly on the tangier side but full of textures and flavor. Everything was fresh and the flavors were exotic! Also, plating was done really nicely. <br><br>We also got the Beef skewer -- but it wasn't the best -- the flavor was really unique and delicious but the steak itself was way chewier than We like. <br><br>Service was a little average the night we went. server wasn't that friendly and she never offered us any chips like others were given (but did mention it on our bill). But they gave us a little dessert to share on the house for our anniversary. <br><br>That dessert is on the menu -- shortbread cookies with dolce de leches with quinoa ice cream -- wasn't for us at all!<br><br>Overall a great experience. Will definitely go again to try something else on their menu!", "pics": null}}, {"review": {"des": "I am writing this review because of the way I was treated by the valet attendant. I pulled up after pre-paying for a spot hero which indicated that I did NOT have to eat at the restaurant in order to use the parking spot. I pulled up to the valet booth, explained that I had a Spot Hero parking pass that I paid for, and his response was disgusting. He looked me up and down, looked up and down the street, smirked at me and said he will not park my car. I asked why not, I paid for parking and according to the agreement between the restaurant and Spot Hero, I didn't have to eat to park. He told me \"I don't care what you paid for, I don't work for Spot Hero. Go somewhere else.\" He told me I could speak with his boss and when I asked how I could do that he said, \"I don't know, he went home, you're out of luck.\"<br><br>This is disgusting. Regardless of this restaurant's food, this is not a way to treat someone. I don't know why he treated me this way when I was nothing but polite. I will never eat here and I will spread the word about how poorly this valet attendant treats people. In today's world, this is the last thing we need; it's unnecessary to be rude to someone for no reason.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6DWXr8doaiAQQA7WsgPiJw/348s.jpg", "caption": "The rude valet attendant...Tanta, you need to be aware of the rudeness of your employees. It reflects so poorly on your restaurant."}]}}, {"review": {"des": "This restaurant has a fun vibe and cool menu. There are a ton of \"hip\" restaurants in the area, but this is a great option if you looking for a more unique menu. <br><br>Food/Beverages(9/10): The El Chingon cocktail was excellent. The block of ice inside the cocktail had a color to it and the drink had a nice kick. The carne de res empanada was good, but not among the best empanadas I've ever had. Almost all of the main entrées sounded desirable to me, but I settled on the pork and shrimp fried rice (Chaufa Aeropuerto). Before I received my meal, I was hoping I didn't just waste $24 on unimpressive fried rice. This dish was actually really flavorful. The fried rice also had a generous amount of shrimp and pork, so I was extremely pleased. Another plus side of getting this dish was the fact that I was able to get 3 meals out of it. <br><br>Service (6/10): Our waiter was \"interesting\" and I don't mean that in a good way. Our interactions with him were all really awkward because he was constantly in a rush. One example is when my friend and I were putting our main entrée orders in. I gave him my order and then he left the table before my friend could give him her order. It was really odd. Most other waiters would ask, \"Would you also like to put an order in?\" He just left before she could start her order. He eventually came back.  His rushed behavior would have been a little bit more acceptable if he was rushing to help other customers, but I saw him 2-3 times just chatting with other waiter's near the corners of the restaurant. I am thankful for the kitchen staff that did a great job at getting items out within a reasonable amount of time.", "pics": null}}, {"review": {"des": "During the meal, I kept saying that this was one of my favorite meals in a really long time. So true. Everything we ordered from the ceviche, to the chaufa to the cocktails were so so good and memorable. I love pisco sours and this place does them right. <br><br>The service was exceptional and cocktails came out SO fast. The whole group was impressed by the deliciousness and speed of the cocktail production. Definitely order a bunch of plates to share family style.<br><br>Overall, I highly recommend this spot for lunch or dinner!!!", "pics": null}}, {"review": {"des": "A friend of mine who is from Peru recommended this place so I knew it had to be good. We made reservations about a week before for a Sat night, were seated promptly, and the service was great. I will mention that all the tables around us got their complimentary plantain chip appetizers except us, unsure why but we eventually asked for them and got them mid meal haha. The drinks, food and service was top notch. More casual than I envisioned. Would definitely recommend!", "pics": null}}, {"review": {"des": "Seized the warm evening by dining at the rooftop of Tanta. The ambiance was bustlin' with conversations and laughter. I especially love the large menu and that nearly every dish is full of vivid colors and intense flavors! I quite liked the Sudado dish with its shrimp, clams and salmon over a bed of warm crispy and saucy rice. The octopus and potatoes appetizer was another delight. Lovely. The only thing I have to point out was our waiter wasn't particularly pleasant to us nor did he give us complimentary plantain chips that he laid out for the guests next to us.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QpcyI8EKcfGZ_ZqigLuirw/348s.jpg", "caption": "Sudado"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5W2Vnx8qLwwFyDqfZ_CSRw/168s.jpg", "caption": "Pulpo anticuchero"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/f_NhH8LIoU4wcl8G9ppuAA/168s.jpg", "caption": "Pulpo Anticuchero"}]}}, {"review": {"des": "I was super excited to come to tanta and I was not wooed. <br><br>Made reservations for Friday night and when we got there the weather was beyond perfect so we walked upstairs to see if we can get a patio spot. We got seated right away (woo!) and then waited a while for anyone to come by. <br><br>The waitress finally came by and asked if we were ready to order. Drinks yes. food- no? I told her we had never been there and if she could go over the menu or give some suggestions and she quickly went over the menu with us. We places our drink orders and she gave us some time to look through the menu. <br><br>drinks- I ordered the pisco sour. Yum! I'm a fan <br><br>Food-<br>Carne anticucho- it was good. But the meat was more well done then I would prefer <br>Tanta ceviche- not impressed. I just flew back from Miami and I had some bomb ceviche there <br>Criollo niguri- yum! I loved this<br>Classica causita- so I really wanted to love this. But I just liked it. I wish the mashed potato was warm and it was cold. But the king crab was delicious and super fresh. <br><br>Maybe my expectations were a bit to high, but I think I need to give tanta a second try, I just wasn't sold", "pics": null}}, {"review": {"des": "I dropped in here this evening for dinner by myself after checking into the hotel nearby. The receptionist suggested this as one of three places I might enjoy. And she was right! <br><br>I was seated right away and it's a good thing because about 15 minutes later the place was packed (7'ish). Let's go through my experience:<br><br>1) Service. All around solid. Vanessa took good care of me and walked me through the menu explaining different items and making recommendations. I had my eye on the sangria and decided to go for it, and it was really nice. A little fizzy or effervescent. I placed my order and my items were ready fairly fast. All in all a really good service experience.<br><br>2) The food/menu: Lots of options to choose from. I had a hard time deciding but a couple of recommendations made by Vanessa sounded really good. I picked one of them--the lomo saltado--the beef entree, and decided to start with an order of empanadas. They in themselves were a hearty portion and I had only eaten one when my dinner arrived (I guess that could have been because I was busy making quick work of the plantains). The beef dish wasn't your ordinary stir fry but rather had all the nice pleasing and complimentary flavors that make your mouth water. It was served with a side of white rice. The beef was cooked medium rare or a tad more which was perfect for me. The two people sitting next to me were quick to befriend me so I was chatting with them during my meal. At some point, I must have looked down at my now empty dish and sadly realized all the goodness on it was gone. I'd managed to eat the entire meal. I looked up and the two next to me asked me what I got that was so good and I told them. She had the lamb, and I'm not sure what he had but they were both equally pleased with their food.<br><br>3) Ambience: A nice vibe, easy to move around, a little loud with the ambient noise but not at all too much. Just a nice vibrant scene. I was leaving messages with my bluetooth ear device and I had no problem doing so while I waited for my food.<br><br>4) Price: Drinks are priced just right and there's a big speciality drink section. The food, in some cases, seemed a little pricey which is the only reason I didn't give it five stars. <br><br>I'm glad I checked out Tanta this evening and I'd definitely come back again next time I find myself in Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/10ADVGUV6U4EE5eQkLotTQ/348s.jpg", "caption": "Empanada"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mp6dlJ-KJMHQ4_SguHf6Pw/168s.jpg", "caption": "Beef entree."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/E8604YwIXWKlP_T6DiTFZA/168s.jpg", "caption": "Plantains."}]}}, {"review": {"des": "I came here for a early evening drink and snacks with a friend visiting from out of town. She had read about this place and we were excited to try it. The cocktails were very average. I got their spicy margarita and my friend got a rosemary infused gin drink. We ordered several dishes from the appetizer section on the menu. My favorite was the ceviche. <br><br>I want to go back again to try more. However one downfall was that it was very pricy for how small the portions were.", "pics": null}}, {"review": {"des": "Pretty sad that people are saying this is one of the best Peruvian places in Chicago when the lomo saltado was subpar. I got the lomo saltado medium rare as suggested, and the beef tenderloin was extremely chewy and took me several minutes to chew through each chunk. The sauce was very very salty. For $32, I expected something delicious, but in reality, I've had way better lomo saltado for half the price in New York. <br><br>Also got the conchitas a la parmesana (two scallops with 20 month aged parmesan). These scallops were absolutely delicious. The foam was very rich (flavor wise and monetary since they were $16). The presentation was a bit over the top with actual ROCKS on my plate...<br><br>Pro tip: if you're ok with bar seating, the wait is much much shorter!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5qyeLgbvEldiyC2983YkcQ/168s.jpg", "caption": "Lomo saltado. Looks great. Taste not as great"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kpafQsL4r53xQDuWOnK7Kw/168s.jpg", "caption": "Scallops with parmesan (lol at the rocks)"}]}}, {"review": {"des": "I came here for an office event so this may have been better had it not been a private party but I thought the food was only average. Maybe it deserves a 3.5 Star but that's not available and it would be misleading for me to post a 4 Star for it. <br><br>The appetizers were good- Tiradito Nikei (ahi tuna) and Empanda de Tamal. Would recommend. Ahi Tuna was fresh and made me wish it came with more pieces and the empanadas were surprisingly filling. <br><br>Lomo Saltado was very tasty and would definitely order but I think the quinoa chaufa was what really tanked my rating for this place. I thought it was very average and mediocre. It just tasted like a lot of quinoa with sesame oil. Not that much flavor if you ask me. <br><br>Out of this whole experience, I probably enjoyed the lomo saltado the most. However everything was all relative so I think it was better than other dishes but isn't amazing enough for me to think about it and eagerly come back. <br><br>This place wasn't bad but it was average enough for me to probably consider elsewhere next time.", "pics": null}}, {"review": {"des": "Tanta is the Peruvian gem I have been looking for. My wife and I came here in a Thursday evening and were immediately sat and served drinks. The atmosphere is cozy with a modern Latin flair. The margaritas were solid and delicious without suffering the problem of too much sweet and sour.<br><br>My wife ordered pork fried rice and I ordered a Peruvian roasted half chicken. The fried rice dish was jam packed with great spice and smoke flavor. My chicken dish was buttery with a great crispy skin. The fried rice dish was the better meal however the chicken was still beautifully done..<br><br>The entire meal was $90 which I felt is reasonable considering the food, service, and location. Overall I would absolutely recommend Tanta to anyone!", "pics": null}}, {"review": {"des": "Tried making a reservation for 7pm but they said that the earliest opening was 10pm. Our backup option was in the same area and we figured we might as well see how long the wait was in person. We went to the rooftop where we were immediately greeted and given a table. <br><br>Food looked amazing and tasted great but service was lacking. The server recorded my order wrong and when the incorrect order came out, it seemed like she wanted me to simply say \"that's okay, I'll eat this instead.\" After a long silence, she finally said that she'd submit the correct order. <br><br>Not sure whether they're understaffed or not because everything from water to ordering to getting the bill was slow.", "pics": null}}, {"review": {"des": "Restaurant week is such a great way to branch out and try new things, which is exactly what Tanta helped me do. I'm new to Peruvian food but I felt like this place and it's Restaurant Week menu struck a great balance of new and different, but not too out there. Our waitress was so friendly and helpful. She pointed out that since there was 3 of us and 3-4 options per course, we could each just pick one and share. What a great idea!<br><br>I loved their cebiche, quinoa caprese, the beef stir fry, pasta, fish... yeah. Everything. Flavors were big here! I didn't try a single thing that I didn't enjoy. I'd definitely be up for returning in the future.", "pics": null}}, {"review": {"des": "I may be a little obsessed with this restaurant. It's a little place; you might walk right past if you didn't know it was there, but you'd be missing an absolute gem. A Peruvian Japanese fusion brings unexpected flavors together. My favorite is an ahi tuna ceviche sweetened with passionfruit. It's absolutely mouthwatering. You can't forget to also grab a carne de res empanada -- probably the best empanada I have ever had. I can't wait to go back to Chicago just to return to tanta.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ehxil1NZH3KfUq3uKSsVsA/348s.jpg", "caption": "Bloody Mary with pisco"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/k_jdBbtLJPV_DBD_G-mKdA/168s.jpg", "caption": "Carne res empanada"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rzze18X-ypmdVzTaolGz0A/168s.jpg", "caption": "tuna and passion fruit heaven"}]}}, {"review": {"des": "This place is incredible!! I came with a friend on Saturday night for dinner and left beyond pleased. We each enjoyed one of their cocktails, including the Pisco Sour, which was good but nothing to write home about. The food is what stole the show. I regret not taking pics, but we dove in immediately lol. We decided to order a few things and share, settling on the following:<br><br>- Criollo Cebiche - excellent flavor, seafood was fresh and absolutely delicious. The flavor had a nice kick to it without being outright spicy. The plantain chips they serve to snack on went with this perfectly as did the zesty sauce they came with.<br>- Conchitas la parmeseana - served in a shell, the scallops were cooked perfectly, melting in your mouth and perfectly seasoned with a light cheese.<br>- Chaufa aeropuerto - I LOVE this rice dish. A pork fried rice - a touch spicy (I would have loved it even more if it had been spicier), with shrimp, egg and pork. The flavors were really enjoyable, I wish I could keep eating it or learn how to make it myself.<br>- Chef's special grilled octopus dish - the octopus was grilled and seasoned very well. It wasn't my favorite dish, but was quite good.<br><br>It's too cold for me to ever wish I lived in Chicago, but I wish they had a location near me! It's certainly a special occasion type place - the entrees are on the pricier side and one would not be filling enough, except the rice dishes. Absolutely worth visiting!", "pics": null}}, {"review": {"des": "Came in around 6pm on a Saturday and surprisingly was able to get a table without waiting. Right off the bat we ordered a round of pisco sours, which were refreshingly tart and a good start to the meal. Our waitress recommended the cebiche and anticuchos, so we went with the clasico cebiche (fish of the day was halibut) and the beef heart anticuchos. I thought the cebiche was ok but not amazing. It wasn't especially diverse in flavor or balanced (very acidic without much else going on), and the fish had a lot of sinew. The beef heart anticuchos on the other hand was amazing. Cooked to a perfect medium rare and with a delicious slightly spicy sauce. I enjoyed every bite and could have gone with a second portion. For mains, my friend and I shared the adobo and the grilled octopus. Both were good but not particularly memorable. I'm not a huge adobo fan but the meat was super juicy and tender--it fell apart against my fork with little effort, and it would definitely be a hearty dish for one person. I still think it could have been more flavorful--I was kind of bored after a few bites. The grilled octopus was also very tender, but again not special in any way. I probably would have wanted a larger portion size of the octopus if that was the only thing that I had ordered, but with all the other food, my friend and I couldn't finish the two mains. I think I would have enjoyed this place a lot more if I had come here with a couple more friends and shared a couple more dishes, since everything was good but didn't leave me wanting to take more than a few bites (except for the beef heart!) Would definitely come back to try more anticuchos, and I'd be happy to give other mains a go too.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xIREcXKxqlDYvc-60MSwRw/348s.jpg", "caption": "adobo"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dJQSSZ_53l4Iw8B3S8GwnQ/168s.jpg", "caption": "grilled octopus"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PXY12n5XLcn1LuPrJQk5ZA/168s.jpg", "caption": "cebiche"}]}}, {"review": {"des": "I'd been meaning to try Tanta for a while, as I'd heard tons of good things, and when I finally made it in for dinner, it did not disappoint! Everything was delicious, the service was friendly and fast, and the environment was a perfect combo of romantic and chic. They also have a rooftop that's supposed to be lovely, but by the time I went in October, it was closed.<br><br>We had their Pisco Sours, which of course were delicious. Then we shared the Pulpo app -<br>grilled octopus, the the cebiche mixto, the causita classica (kind of mashed potatoes with a bunch of crab on top), and the chaufa aeropuerto - pork fried rice.  Everything was DELICIOUS and so flavorful.  The octopus was by far my favorite, and the pork fried rice was incredible too. It came in a stone bowl and was kinda toasty and charred on the bottom, with just a great combo of flavors - a little spicy and a little sweet.<br><br>All in all delicious food and great atmosphere, would be a perfect date night spot or girl's night out! I'll be back for sure.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oQx4_2fG9PK0aj1Dgb3W6w/348s.jpg", "caption": "Pulpo (octopus) - the most delicious thing we had"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qRXC3H8Er50D0me2RAtdqg/168s.jpg", "caption": "Complementary plantain chips!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ulxQ2qJhI_xwwPSwbFN9FQ/168s.jpg", "caption": "Cebiche mixto"}]}}, {"review": {"des": "I am a fan! This place is great for  any occasion - nice dinner with friend(s) or significant other. It has very cozy atmosphere and it is also perfect for nice and romantic dinner.<br><br>Great spot for grabbing a cocktail (or two, who counts?!) or a beer(s). The beer selection is great - plenty of drafts but also interesting bottle selection to choose from. <br><br>I have tried their octopus which was super delicious and also several of their vegetarian dishes - my favorite by far is their Pastel de choclo (it is a special type of corn cake with mushrooms), just this dish itself is a good enough reason for me to come back soon! Another vegetarian dish I loved was Verdura Nikei - very well spiced vegetarian mix - it is good to eat it along something else though, like quinoa or salad. <br><br>The service was very nice and attentive. I am looking forward to coming back soon.", "pics": null}}, {"review": {"des": "I had a friend rave about this place and mentioned it was a must visit for me in Chicago. Unfortunately, I just wasn't as in love with as he is. The only thing that I recommend is their Pisco sour. I had me two glasses of this baby over dinner. <br><br>We ordered quite a few dishes from the recommended ceviches to the grilled octopus, but the only one that left a lasting memory was the grilled octopus. There was such a large selection of appetizers and small plates when we initially thought we ordered too much for two, but ended on the search for more. <br><br>A little bit of a disappointment, but the flavors didn't quite jam together for my taste. Very bright place and super group friendly. I love the ambiance and decor for a date.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Q0mFGnSGvXQ8P5gjHRsk_w/348s.jpg", "caption": "Cocktails"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mlzQL4ouk-pcq5gWTRmfHg/168s.jpg", "caption": "Octopus"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VaBcp2UDtkl7fKcQja10AA/168s.jpg", "caption": "Ceviche"}]}}, {"review": {"des": "Very nice place ，the steak is very good! I love the Lomo saltado! Lomo saltado is my favorite dish here. It must a try", "pics": null}}, {"review": {"des": "I have heard great things about this place but we were very disappointed. <br><br>Pros:  The service and the ambience were very nice. The waitress did a great job explaining the food menu being that it was our first time there. The shrimp and crab appetizer was different and very good.<br><br>Cons:  The bloody Mary that I ordered it was just a plain, simple drink. Nothing thrilling about the drink and not worth the money I paid for. I ordered the pork belly sandwich which was nothing more than a piece of dry piece of pork. My experience with pork belly is that there's always a piece of fat to it and mine was just very dry. The company I was with ordered the chilaquiles and they two were very disappointed. It was a skillet of nacho chips covered with the ingredients mentioned in the menu.   Yes, this entrée is prepared with tortillas chips but it normally ends up being a bit soggy once you sauté it with the sauce. Unfortunately in this case they were not.  Everything we ate had a kick to it but it was the same sauce with each and every entrée. I really enjoy entrées that are put together creatively but the dishes we had were just overly complexed to enjoy.", "pics": null}}, {"review": {"des": "What a great and wonderful place and an impressive ambience. Staff is super friendly. And the food is amazing. I will definitely be visiting this place again.", "pics": null}}, {"review": {"des": "Tanta is quickly becoming one of my favorite restaurants in Chicago. Not only do they have a rooftop seating area and bar, but their food is thoughtful and delicious. <br><br>Tanta has a unique cocktail list with universal appeal. I love the El Chingon cocktail, which contains a sphere ice cube made from peppers. I could go there just for this drink and their complimentary plantain chips! If going for lunch, do not miss the Choclo side -- their decadent take on Peruvian corn. Everything I've tried is bright, fresh and full of flavor. I'm hoping to work my way through the entire menu!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vl664smOTWq0lTEQ7BDbew/348s.jpg", "caption": "Choclo side dish and Cebichera"}]}}, {"review": {"des": "OH MY GOD! The food is heavenly delicious! We shared around 5 appetizers just because they are all amazing and you want to try them all! They have nice rooftop with cozy atmosphere. Expect up to 30 min wait to be seated on Saturday night. The only drawback was a not very friendly hostess on the second floor. She kept asking same questions and we were a lil frustrated with her assistance. But the place is OMG! You have to give it a try!", "pics": null}}, {"review": {"des": "Amazing place, it's beautiful, colorful, flavorful and overall pleasant. <br>We had a lovely lunch on their beautiful rooftop. Our waitress was the cutest. She recognized that I was pregnant and made appropriate suggestions and modifications for me. <br>The menu is awesome! Lots of fresh, light and fragrant options. We shared a few plates like De la Huerta salad (delicious dressing), octopus, a few cebiches. I also had a Spa Time bebida (juice), it was a bit too sweet so I diluted it with water. Everything was fantastic!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kVAnx_emMSMiMorZmrV6Fg/168s.jpg", "caption": "Fresh and beautiful de la Huerta salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/flYkZT3pTDLAWQ1lQsbgoQ/168s.jpg", "caption": "Fantastic octopus dish and golden yukon potatoes"}]}}, {"review": {"des": "I would love to give Tanta more stars but man, was I disappointed. <br>One big star goes to the drinks which were creative, tasty, and strong. <br>One star goes to the food which we tried a sampling of at the bar. The cebiche sampler was *amazing*. And whatever those bar corn nuts are were ADDICTIVE. <br>Sadly, the remaining three stars were lost because service was WRETCHED. <br>Came here for my birthday and arrived in the early evening already anticipating a wait. Put my name in and party number (7 ftr) for the rooftop and was told the wait would be an hour and a half, perhaps a little less, but it was gorgeous out and I was feeling good, so we decided to stay and sit at the bar downstairs while we waited for our table...<br>...An hour and a half later I hadn't heard anything and went upstairs to check on the status of our table. Was told the table they were waiting for was still unavailable and that they'd text me when it was finally ready. <br>Fast forward another 45 minutes, still no word from the rooftop.  <br>I left and got food elsewhere. <br>THREE DAYS LATER I got a text saying I'd been submitted for a table on the rooftop, which leads me to believe they'd never had me on the list in the first place. The bartenders were legit but don't plan on getting a table for a group here.", "pics": null}}, {"review": {"des": "Tanta charges upscale prices and plates Michelin-star-level quantity portions while having the decor of a Chili's and the PF Chang's cookbook.", "pics": null}}, {"review": {"des": "The food was delicious, fresh and tasty. They were kind enough to get us in immediately, despite the fact that we didn't have any reservations. Dinner was delicious and pretty much perfect with the exception of our waitress, she wasn't pleasant at all. We still tipped her generously anyway in hopes that it would change her mood. Definitely a place I would love to return to again! Assuming we got a different server of course!", "pics": null}}, {"review": {"des": "We visited in the evening without reservations. This is a popular place and I wasn't sure we'd be seated so we opted for the first-come-first-serve seating on the patio. Luckily the weather was just right so that was fine. We were able to be seated right away.<br>We ordered lomo saltado and the quinoa chaufa. The food came out very quickly, which was a surprise since we ordered the meat well-done. The meat was medium rare and we had to send it back. The prepared a new dish and it was cooked properly.<br>The food was delicious, seriously, very tasty. <br>Service was good though I think they had one guy managing the entire rooftop. He was hustling all night.<br><br>If you are in the area this is worth a visit. It's pricey and you get what you pay for which is quality and a unique experience.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eyrJhQaa8bpYJa7vVJ46yw/348s.jpg", "caption": "Evening view from the patio."}]}}, {"review": {"des": "Stumbled across the Gem by accident and was well worth it. Staff were very inviting and provided excellent service. Who knew i could get Yuca and essentially a Paella in Chicago.", "pics": null}}, {"review": {"des": "Delicious! Patio has a beautiful view! All the food was amazing. We started with the toreado tiraditos which was so good I wish we had ordered two! For an entire I had the pulpo anticuchero (grilled octopus) which was also so good I finished every last bite. Of course dinner was accompanied by many pisco sours.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0OYqs9rOp_DIF6fACKIO1A/348s.jpg", "caption": "Pisco Sour"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/D2l0P4aJt3_I-xujHSZ0Ug/168s.jpg", "caption": "Pulpo Anticuchero"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xKgNtIllYNT1JbHGijhJMA/168s.jpg", "caption": "Toreado"}]}}, {"review": {"des": "Top 5 in Chicago.  Can't get enough Causitas and Piscos Sours.  Have been several times, and everything on the menu is excellent.", "pics": null}}, {"review": {"des": "As part of Restaurant Week 2018, I remained seated at the table contemplating the complex flavors in dessert: ice cream accompanied with shortbread cookies that contained a dulce de leche filling. My mind was completely at ease as I realized that this had to have been one of the best set meals I have ever had in my life.<br><br>Being that I have never tasted traditional Peruvian food, I asked my Peruvian friend to look over the Restaurant Week menu and suggest some \"must haves\". He suggested the causa anticuchera, lomo saltado, and whichever dessert I fancied. What marvelous suggestions, as each dish offered sophisticated and unique flavors with each bite. <br><br>This is definitely one of the ritzier restaurants I've been to, so expect to dress nicer and pay a pretty price. In my opinion, it was very much worth every cent for such an exceptional experience.", "pics": null}}, {"review": {"des": "Restaurant week 2018! We had the lunch set menu for $22 per person. For appetizer, there is no choice, and on the day we visit was fried yuca. It was crispy outside but since yuca is not very moist inside, I would not say that this is better than normal fries. For the main dish we had the grilled salmon and Chinese BBQ pork rice. Salmon was grilled right to the point, skin crispy and soft inside,  and went well with sweet chili sauce. The only thing is that the dish is too oily for me, especially when I am eating the cauliflower and other vegetables that absorb a lot of oil and sauce. Also, the BBQ pork is rice was a bit too oily. For dessert, I had the alfajor, which was Ok.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PxIAKFcSUJFgbQiigJmazg/348s.jpg", "caption": "Alfajor"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8T_2cqd7ID7ek1LfHDO72w/168s.jpg", "caption": "Salmon"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8azF2Isu7xsMXtVXxQ4lYg/168s.jpg", "caption": "Fried yuca"}]}}, {"review": {"des": "Came here for my birthday dinner and it didn't disappoint! Service was great for our group of 8, our server took time to explain the menu.<br><br>The drinks were delicious - solid reviews for the pisco sours, Lima llama and el macho.<br><br>We may have over-ordered for the table but we liked everything, from most to least loved:<br><br>- octopus skewers - the hands down favorite<br>- tanta & nikei ceviche - great fresh flavor and great cuts of fish<br>- skirt steak and quail egg nigiri - great flavor combo<br>- plantains and aioli - yes it the free bread course but soooo good<br>- pork fried rice - unexpectedly so good<br>- chicken empanada - simple but good<br>- king crab causita- decadent<br>- short rib - fell off the bone tender<br>- beed empanada <br>- lamb - not my favorite but the polenta was good <br>- scallops and Parmesan foam - interesting combo but wasn't a favorite <br><br>Really great atmosphere, would love to come back for the roof top", "pics": null}}, {"review": {"des": "The food is well made and overall tasty. But I've got a serious bone to pick with you, Tanta! The scallops...2 of them for $16-18 bucks?!? And no side? Just some rocks (yes you heard me right) and two sea shells (yes you also heard me right). And the waiter told me this would be a decent sized entree for one! No way. So yes, I was starving and the food took forever to come out so no way I was going to order another \"entree\". My husbands ramen bowl was huge and cost $23 which makes a lot more sense!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gwzcmTa-PqFeukMXVSpd2A/348s.jpg", "caption": "Cornbread dish"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8dmxONwECv26p8tjOuHQEA/168s.jpg", "caption": "2 scallops for 16-18$"}]}}, {"review": {"des": "I love a cocktail with the empanadas here!  The atmosphere is great for a date or mixing it up with some friends!  I do not recommend the ribs but I recommend bringing the bifocals because the print is small and the lighting is dim!  This is a staple restaurant for me and I like all three empanadas so I can mix it up!  There's a roof top bar but I've always been there on a night where weather did not permit!", "pics": null}}, {"review": {"des": "My wife and I went here for my birthday after we had a terrible experience trying to go somewhere else. The somewhere else didn't communicate that they would be closed and wasted our time so needless to say I was upset but I wouldn't remain that way for too long as Tanta delivers on great flavors as well as service. I got over my displeasure with the other restaurant quickly and my wife and I enjoyed my birthday very much. We will be returning to Tanta!", "pics": null}}, {"review": {"des": "I went during Restaurant Week 2017 and was rather underwhelmed. I chose the pictured traditional steak and potato dish as my main course and really regretted it. It was nothing special. The rest of my group got it, which intrigued me. I wish I had opted for the seafood option on the Restaurant Week menu instead. It looked so much more complex. <br><br>My starter however, is the vibrant yellow dish. It was very interesting in texture and was very pretty to look at. There was also some kind of bean/corn/vegetable ingredient in it that I really liked. I am unsure what it was called. <br><br>Only three courses were offered for the Restaurant Week menu. I feel that I may have had a better experience just getting something from the regular menu. But I do not think I will go back to try. I liked the art a lot though and the vestibule/entryway.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0eVInhneQlBbqs6EGA2i2g/348s.jpg", "caption": "Decor"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tYjQSHvS5YKajf3oKoE_cA/168s.jpg", "caption": "Restaurant Week 2017"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-IQQK5rmrzoYs1t-pCLEKA/168s.jpg", "caption": "Restaurant Week 2017"}]}}, {"review": {"des": "Overall great food and excellent ambience. It is a little dark and the noise levels are higher than average, but nothing too oppressive. They have a well stocked bar and a decent wine list, although, we didn't order wine here. <br><br>Regarding the food, the octopus appetizer was amazing! The beef empanadas were pretty good as well. My grilled shellfish and fish came in a nice flavorful broth with a risotto underneath. Delicious! <br><br>The causitas, which are whipped potatoes with aji are really good. My wife got the clasica which came with king crab,  avocado, egg, etc. My daughter got the lamb here --- it was good, but this is a hearty rather than a delicate dish. She couldn't finish it even with help from us :). My son got the traditional  beef tenderloin stir-fry, which he seemed to like very much. <br><br>The cocktails were a bit of a hit or miss. I got the el chingon, which was made with a jalapeño tanteo tequila, and lime. It was okay. My wife's cocktail, although sweeter, was much more refreshing.", "pics": null}}, {"review": {"des": "Better than average Food / Good Service / Energetic Atmosphere / Reasonable Prices<br><br>Can't say we'll be regulars but I can say we were not disappointed.  <br><br>If your hungry and looking for a dish big enough for 2, try the Chaufa Aeropuerto as it will not disappoint.", "pics": null}}, {"review": {"des": "We walked in around 6 pm on a Saturday. Sat at the bar, ordered drinks and their version of paella. The dish was very favorable. We would've loved it if the squid ink rice wasn't drench in oil. We were disappointed because it's nothing like our favorite Peruvian restaurant in Covina, CA.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vDNi2hBi7uSWVkVwHyLFzw/348s.jpg", "caption": "Arroz en su tinta, flavorful but very oily"}]}}, {"review": {"des": "This was my first experience trying Peruvian food and I feel like anywhere else I go in the future will definitely be subpar. Tanta has spoiled me. <br><br>Let's start off on the right foot. The arroz con pollo dish I award 5 stars. Being a Latina I've tried many different arroz con pollo dishes but nothing as delectable as this. Juicy meat, crispy skin, and super flavorful! The rice was heaven on earth. I have no idea what they make it with but it was green, maybe some sort of thick chile or avocado. I could eat that everyday. This dish is a money maker! <br><br>5 stars goes to the Corrazon. Beef corazon, that is. I have to be honest the infamous Anthony Bourdain did a segment in Peru and I was in awe of his adventures. Thus, Tanta eased my itch for exploration and trying new food. Never have I ever tried beef heart! What I really enjoyed about this is the thick and meaty structure of the skewers. It's like eating a mini steak. The sauce they cooked it in was mind blowing. I felt like GOT Khalessi in the initiation scene into her tribe by marriage! (If you know what I'm talking about. Lol)<br><br>4 high stars to an amazing empanada filled with carne de res! You can tell that the empanadas were made that morning. Fresh crispy dough and tender shredded meat! <br><br>A low point was the chilaquiles. I give this 2 stars. It's unfortunate because we were expecting so much more. This dish is salvageable and I hope they challenge their view on this take. It was more like a loaded nachos. I can see where they wanted to wow with the fully breaded fried egg sitting atop the nachos but I think they are better off scrambled within the tortilla chips. The lomo soltado meat was great addition. <br><br>I can not wait to go back and visit the roof top during the summer with pisco in hand and flight of civiche all while jamming to the infectious latino music. What a great experience overall!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ygvb5QyShAk1DBQnNqZmqQ/348s.jpg", "caption": "The most amazing arroz con pollo I've ever had at Tanta!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/o62GsclrxmO1d-ei628hbA/168s.jpg", "caption": "Chilaquiles were more like loaded nachos at Tanta."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5u9tplD74cd3bOmUUydBVA/168s.jpg", "caption": "Corrazon- Beef Heart! My new obsession!"}]}}, {"review": {"des": "Had a phenomenal experience here on a Sunday night.<br><br>Regardless of the packed-house, service was attentive, professional, and knowledgeable. I don't think my water glass was ever empty. <br><br>Menu made it hard to make a decision (only complaint, haha). So many good options but I went for the grilled octopus. Octopus was tender and flavorful. We also got the chicken salad caustia as an appetizer and it was so rich and fabulous. Had their signature cocktail that had great presentation and a taste to back it up.<br><br>Will be recommending this place.", "pics": null}}, {"review": {"des": "Great food. Very difficult to park, even though they offer a valet parking.  I recommend parking your car on a street - you still need to pay for it.", "pics": null}}, {"review": {"des": "So happy to be here! What amazing and friendly bartenders. They welcomed us and made us our special drink right away! It's just cozy and comfortable. The staff is so friendly - I recommend this place highly!  Of course, the food is divine! You can't go wrong with anything that you order here.", "pics": null}}, {"review": {"des": "Recommended by the bartender at the hotel. Ordered drinks, and shared a whole chicken along with ahi tuna. The ahi run was okay, not a lot and wasn't really a shareable portion and I'm used to tapas... there was hardly any tuna. The chicken was delicious though and the redeeming factor. Moist and plenty. Enough for 4 people to share and enjoy without being stuffed. Great rooftop and atmosphere. Everyone was dressed up for a nice night out. Would go back", "pics": null}}, {"review": {"des": "The ceviches and the \"Asian inspired\" menu items (Nigueris Nikei) were excellent, and we likes that the menu was unafraid to branch out into some innovative fusion-y directions. The starter chips and the main courses were decent, but a bit oily/heavy. For classic takes Peruvian entrees in an upscale setting, try La Mar in San Francisco. <br><br>Note it can be VERY loud here -- you may have to yell across your table to have a conversation.", "pics": null}}, {"review": {"des": "I had lunch with a friend at Tanta on the rooftop. Great location and lush landscape. We had empanadas and a salad each. The empanadas were very good.  My ahi tuna salad was good -- the fish was fresh.  The salad had nice flavor and acidity from the citrus, but portions were pretty small for around $20. My friend thought the same with her salad. The service was friendly and attentive. <br>Overall, a nice lunch spot. We both agreed it would be a great place to come back for a cocktail.", "pics": null}}, {"review": {"des": "The service and food was fantastic.  Ended up here for lunch to celebrate Mother's Day with my family.  Will definitely come back for more.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YO_FPtQzCOcQbnzMLxsatw/348s.jpg", "caption": "A must"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YUM276c-bxyfemxEc7ahXA/168s.jpg", "caption": "Delicious"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uQGyZ8HbY3L18n3927Wq0A/168s.jpg", "caption": "Tasty"}]}}, {"review": {"des": "I spent a month in Peru while I was in college and ever since then I have missed the food. And Tanta satisfied some of that craving I've had for 4+ years. <br><br>I came here with a Gilt voucher for two entrees and two drinks. My friend over the Sylvia Rose for a drink, which was a lemonade like drink with blueberries. I ordered the Pomegranate-Orange Cobbler which was delicious. Sherry, mandarin, grenadine, lemon, and mint. Amazing cocktail. <br><br>For my entree, I ordered the Salmon Antichuchero. The salmon was delicious and the quinoa salad was incredibly flavorful. I enjoyed my meal immensely and found it to be quite filling. <br><br>Definitely hope to come back to try more entrees and drinks!", "pics": null}}, {"review": {"des": "Wow this place is so so so great! I have successfully tried everything on the menu. The one thing that sucks is that his place isn't consistant. My ALL time fav is the scallops on rice. I could eat 50 of them. <br>All there ceviches are phenomenal. I highly recommend this place.", "pics": null}}, {"review": {"des": "Tanta provided good food and service. We enjoyed a variety of dishes, including the Clasica Causita (king crab potatoes) and Costillitas (baby back ribs), which were my favorite for the flavors and textures.", "pics": null}}, {"review": {"des": "You can absolutely taste the Asian influence in Peruvian cuisine. You can especially taste it from the shrimp fried rice, which is my fav dish in Tanta.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ymYV1P2ONfHaufDemCeA8g/168s.jpg", "caption": "The taro fries is great!!!!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Lxi5yMx7Qcrkzfwe9znzLw/168s.jpg", "caption": "shrimp fried rice"}]}}, {"review": {"des": "I've visted Tanta many times over the past 4-5 years for lunch, brunch and dinner and have never been disappointed. Every single item from the menu has been outstanding and the service is always on-point. <br><br>Recently visited on a Saturday around noon my gf and we were a bit disappointed they only have their brunch menu on Sunday, since we were looking forward to that. But we stayed and decided to try the sandwiches - the chicken and pork belly. OMG they were delicious, and the fries on the side were fantastic. Always enjoy the plantain chips they provide too!", "pics": null}}, {"review": {"des": "I came here on a Friday night and sat on their rooftop. Our service started off a little slow but improved. <br><br>We ordered the cebiche tasting, pobre, criollo, and toreado. Everything was really good. I would highly recommend the pobre and criollo. They were excellent. We did the Cebiche testing and my favorite one was the criollo. I would just order that one next time. <br><br>As far as cocktails go, I would recommend the lima llama. It's similar to a Moscow Mule but has Pisco in it. <br><br>I would come back here again. The only reason I docked a star is because the service was slow when we first arrived.", "pics": null}}, {"review": {"des": "First things first- don't mess around, get a pisco sour here. It's the drink they are known for and it's a drink they do well. I ordered the Korean BBQ rib and a beef empanada. When you order food, instead of bread and butter, you get fried plantains. They were delicious and seasoned well. I enjoyed the BBQ ribs, but they were not what I was expecting (based off of the menu description). The empanada was flaky and juicy and had a bit of spice to it. The dessert menu looked good, but I didn't have any room left after the meal!", "pics": null}}, {"review": {"des": "Drinks were good.The pulpo ala parrilla was good too.Staff and the place is good as well only letdown was the ceviche was more like a sashimi than a peruvian ceviche.Will go back to try other dishes.", "pics": null}}, {"review": {"des": "Last nights dinner with the girls. Everything was muy delicioso!!! It's definitely worth the hype! The ceviche was freshly made, and melts in your mouth. The explosion of flavors of the plancha marina was exquisite! You definitely need to make reservations, as they're always booked.", "pics": null}}, {"review": {"des": "Tanta... this one's been on my radar for awhile. Always been a fan of Peruvian food, but hard to say if I can justify how pricey this spot is for the amount of food you're getting. We get it, you're in the heart of River North and going for trendy and an upscale sort of vibe like the rest of the area... Anyways, lets do this.<br><br>Showed up here on a Sunday evening to meet a close friend and his parents for dinner. I think for the most part, everything is meant to be shared family style (but if it isn't, that's essentially what we did... oh well more to try for everyone). For food, we did an order of their empanadas (beef and chicken), lomo saltado (a beef tenderloin stir-fry with red onions, tomatoes, cilantro, garlic-soy sauce, rustic potatoes), chaufa aeropuerto (a pork fried rice with shrimp tortilla,<br>spicy garlic), and the pollo a la brasa (amish roasted chicken peruvian style,<br>cannellini beans, arroz con choclo, criolla salad, rustic potatoes, aji sauces). Empanadas were solid no complaints. Lomo saltado was really the only traditional sort of Peruvian dish I had noticed, tasty but pricey at over $30 for an order. Chaufa aeropuerto was essentially a pork fried rice dish, tasty as well and pricey at $24. And the last of the bunch, the pollo a la brasa was nice and tender and ran us $36 for a full sized order. Weirdly this seemed the most Americanized of all the dishes served with some beans, rice, and salad. <br><br>Wish I could say more on this one, but all I really got is food is good and price is not so nice. This one lingers between a 2 and 3 star for me, since I don't know if I'd come back as it doesn't seem like a good value overall. Anyways, to each his/her own.<br><br>'Til next time.<br><br>196/365", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eTYQbr8_RPz6yp_erunRTA/348s.jpg", "caption": "Yummy empanadas"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zWVgcwwY-WlqQjlWIXSDaQ/168s.jpg", "caption": "Lomo saltado. $32 for a lot of potatoes bruh"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/n9NWJzRcSIsj2dp9Jr_zUA/168s.jpg", "caption": "Chaufa aeropuerto"}]}}, {"review": {"des": "Enjoyed an incredible dinner with two friends from out of town this past weekend.  As usual, it was one home run after another - from the ceviche sampler to amazing scallops to beef heart skewers, grilled octopus and everything else we enjoyed.<br><br>On top of this, our wonderful server Vanessa was incredible helpful and lovely to chat with.  She knows every detail about the menu and helped make our evening even nicer than we could have imagined.<br><br>Thanks again, Tanta.  See you again soon.", "pics": null}}, {"review": {"des": "I recently enjoyed Tanta at the suggestion of a friend who works in fine dining in Chicago. I've yet to become a Peruvian cuisine fan, but this is about as great as it gets -- and it's good. First, the place honored our reservation with quick seating, and a friendly greeting. Once seated, we immediately ordered some wine, the mezcal cocktail and a pisco sour. They all were tasty and priced around the $12-14 range. The place itself is contemporary and has a great vibe.<br><br>The food also was fantastic, at least everything but the chicken. I know the Peruvian chicken pollo a la brassa is a \"thing\", and this place does serve it beautifully. Rather than blame the restaurant, I'll just be honest: I like my chicken barbequed or fried, but roasted chicken is boring and just not my thing. If I wanted a roasted chicken with some sides, I'd go to Ralph's or Krogers. We did share the chicken entree, and one serving was more than enough for a few of us when combined with other tastings. <br><br>What is much more impressive here are the appetizers, bite and sides. We particularly loved the croquettes, empanadas, and octopus. <br><br>Despite the beauty of the place and the goodness of the food, our server just did not have chemistry with our table. Perhaps we are a picky bunch because we travel for business a lot. With that said, she ran through all of the menu options so quickly and with such depth that we were totally overwhelmed and confused. She was not particularly warm or welcoming, and after all this, she made mistakes on our bill. After showing her, there was barely an apology and she seemed irritated that we called it to her attention.<br><br>I loved Tanta, and I'm glad that I went. But there is room for improvement here to sustain it as a staple of Chicago dining.", "pics": null}}, {"review": {"des": "Came here to be nostalgic about visiting Peru a year ago and to celebrate my travel buddy's birthday for dinner--thought the food was very aesthetically pleasing but underestimated how pricey this place could be.<br><br>To start off with, their pisco sour is great! Didn't think I'd be able to find a solid pisco sour after being spoiled by Peru. There is a complimentary starter of plantain chips which we enjoyed quite thoroughly. We ordered the pulpo (octopus), the pollo a la brasa (amish chicken), the pastel de choclo (peruvian corn cake) and the cocillina (bbq short ribs in an orange puree). I definitely recommend sharing dishes so you can try a bit of everything. The pulpo is delicious and probably my favorite out of the four. I wasn't too impressed by the chicken as 3/4 of the platter consisted of potato fingerlings, a measly salad and three dipping sauces. Their dishes are all elevated in some way (hence the hefty pricing) but at $24, the chicken just fell short for me. In terms of price, their drinks are over $10 and each dish was on average at least $15-20 (some resembling the portion size of tapas) so it becomes expensive really fast.<br><br>Atmosphere is very lively, and wall art makes the place very colorful. We were packed between two other two-party tables. I would say it made conversation a little difficult because we had to raise our voices to overcome other people's chatter and often couldn't help but eavesdrop on our neighbors' problems.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6pJBqElEuDJUROVrmdITAg/348s.jpg", "caption": "Pollo a La Brasa - half!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aPxOo70hXFUoC1osPEPF9w/168s.jpg", "caption": "Pastel De Choclo"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-rtIa4cTy1FkGhezlbA5kQ/168s.jpg", "caption": "Pulpo"}]}}, {"review": {"des": "I have been wanting to try Tanta for a while now and managed to snag a spot for dinner just by walking in. I don't think I have tried Peruvian food in the past, but looking at the menu, many familiar foods and flavors stood out to me.<br><br>We started by ordering the Yuquitas (croquettes) and Cebiche Tasting flight. In my opinion, the croquettes were pretty average-tasting. The better croquettes that I have eaten had a crispier outside to contrast the smoothness of the inside. The three different cebiches that came with the tasting flight order were also okay-tasting. Nothing really stood out to me, although I did like the slightly sweeter sauce of the Nikei Cebiche.<br><br>Other menu items we ordered were the Conchitas a la Parmesana (scallops), A Lo Pobre (strip steak), and Duo de Alfajores for dessert. I thought that the scallops and steak were easily the best part of the meal. There were only two scallops per order but they were very juicy and flavorful. I didn't think that parmesan would go well with the scallops but cheese was melted down into more of a sauce that added an interesting flavor. The strip steak was pretty juicy but towards the end, I thought that it was a tad salty. I also enjoyed the cipollini onions that came with the dish--they absorbed all of the juices of the steak and were bursting with flavor. The Duo de Alfajores were pretty average-tasting shortbread cookies with a much too rich dulce de leche filling.<br><br>While there were a couple dishes that I thought were pretty good, dinner was not exactly cheap and with the assortment of hits and misses that I experienced, I probably won't be visiting Tanta again anytime soon.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yBwoH8nozy44HHl-c9SIwA/348s.jpg", "caption": "Duo de alfajores"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5F0oD4JbOKzVpIghtU8zQQ/168s.jpg", "caption": "A lo pobre"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/O35GN-i-EDT16YMZGCUa-w/168s.jpg", "caption": "Conchitas a la Parmesana"}]}}, {"review": {"des": "The Nikei here is a no brainer . I never knew tuna could taste so good . Topped of the meal with a pisco sour . I was glad we made this our last stop in Chicago", "pics": null}}, {"review": {"des": "I heard good words about this place so I decide to give it a try. I'd say it's a typical loop restaurant, great atmosphere, delicately decorated plates and three dollar sign. The server who help us order gives us the most helpful dish description I've ever had in ages. In terms of taste and flavor, I really believe that we had a seafood-heavy Asian fusion meal in a Peruvian named restaurant. Ceviche really tastes like sushi rolls without rice or roll. That being said, it's a great restaurant in a good location serving delicious food. Just leave the Peruvian expectation aside.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/frWd0e9m7M-7iPuqkJr5Xg/168s.jpg", "caption": "King crab and something"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QKEX-6pIAZ08dBXUGkJrfA/168s.jpg", "caption": "Cebiche Tasting"}]}}]}