{"name": "taste-of-lebanon-restaurant-chicago", "reviews": [{"review": {"des": "Taste of Lebanon doesn't just have amazing food - it has the best people running the place. I'm always struck by the sincere kindness and customer service I experience here. Kafka kabob is like soul food for me -- and this place does it so well!  The spices and quality is top notch, and service is ALWAYS fast and friendly.  I picked up dinner here tonight and they surprised me with a piece of baklava on the house - it made my day :)  (and the baklava is amazing - it has the honey and rose water flavor that is sooooooo good!!)<br><br> Remember: Cash only!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YyY7WNivPihLkZ2PqGFbkg/168s.jpg", "caption": "Literally the best baklava I've ever had in America. This is the real deal!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sGXOpvKRuY7r42y360lZGA/168s.jpg", "caption": "A sweet surprise from the best guys!"}]}}, {"review": {"des": "Amazing Lebanese restaurant in Chicago.<br>It's a small page with limited menu, but their sandwiches and salads are amazing. And I'm Lebanese, so I know Lebanese food very well.<br>Suuuuuuper cheap.<br>This place is a gem.<br>I just wish they deliver.<br>Staff is very friendly", "pics": null}}, {"review": {"des": "**Vegetarian Friendly**<br><br>Great little mediterranean restaurant, with incredibly fast service. Everything is reasonably priced and orders are made quickly. The falafel wrap was delicious, and their pita was soft and thin. There are tables to sit inside, but I got my warp to-go since I was in a hurry. <br><br>I wish they had seasoned fries on their menu, but they don't. <br><br>PS: CASH ONLY", "pics": null}}, {"review": {"des": "I have to agree with other yelpers who Have said that this restaurant has the best lentil soup ever.  I ordered that and it was in fact delicious.  I also had the chicken salad, which was well seasoned and filling.  You won't leave here hungry.  <br><br>The vegetarian special number 1 was not as awesome. It includes falafel, hummus, and baba ganoush. The falafel tasted the same as at any place like this and the hummus is better at the market across the street.  <br><br>The wife ordered a falafel hummus wrap that she did not love. She called the falafel generic and the sandwich did not have much hummus on it.  There was so much bread that she had to remove some of it.  <br><br>This is a cash only restaurant where you order/pay at the counter and then sit or leave.  There is not much seating available, but we went in the early afternoon and got a table.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KWlMeTzhqxe0JRCkJQsR2w/348s.jpg", "caption": "Chicken Salad"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/d_WqizWiF6fUwQOKdR3L2w/168s.jpg", "caption": "Special 1"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hnqHX7HfXZpfzKRge22Fww/168s.jpg", "caption": "Falafel Wrap"}]}}, {"review": {"des": "I have been back to Taste of Lebanon since my initial review.  I came later in the day and the lentil soup was much too salty probably a result of it sitting on a flame for too long as it was near the end of the day.  Their food is good and very inexpensive, but my revision to the rating is based on other places where the Mediteranean food is far superior.<br><br>Two of the places that come to mind are Pita Pita Mediteranean Grill in Palatine, Lombard & Hoffman Estates which have moderate prices & Larsa's Restaurant on Dempster Avenue which is in  another class by itself, but is pricier.  Taste of Lebanon still has very good food at very inexpensive prices and is a great deal for a good meal", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GR2i9tl5CqIfoz4TXR09vA/348s.jpg", "caption": "1509 W Foster Ave"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rkI5OaYuaoXAbabwjRWbNw/168s.jpg", "caption": "Chicken Shawarma Wrap"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EJPQrDbaYTNYh8KmwxLpbg/168s.jpg", "caption": "Lentil Soup (delicious) w/pita bread"}]}}, {"review": {"des": "I'm not much of a soup guy, but I kept hearing that the lentil soup at Taste of Lebanon was a game changer. I had to taste it for myself to see what all the fuss was about. Not content to let it be the sum of my meal, I accompanied it with a beef shawarma wrap. Service is super friendly and efficient. <br><br>The casual-as-can-be space is relatively small, but the flavor of the food more than offset that. The wrap was a good size, and had plenty of flavorful beef to make for a solid lunch on its own. But the soup was truly exceptional. It had a lot of flavor and a great texture. I will certainly get it again, as I make my way through the other menu items.", "pics": null}}, {"review": {"des": "My latest obsession is the chicken salad here. Although I prefer the lentil soup across the street, the salads are much, much better here. The chicken salad is a generous portion of deliciously spiced grilled chicken (shwarma, I think) on a bed of lettuce, tomato, onion, and cucumber with a simple but satisfying tahini dressing. It comes with pita, but I order it without pita for a low-carb meal. I've started to eat this every Monday to help me recover from \"weekend excess.\"<br>The staff is really friendly, food comes out quick, and prices are very reasonable!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gkgKonFeihHkKj_jOI7XOQ/348s.jpg", "caption": "The chicken salad - a great low-carb choice! The chicken is deliciously spiced!"}]}}, {"review": {"des": "There is no reason to get Lentil Soup anywhere else. It's definitely pleasing to the soul and tastes like it was made with love. <br><br>It's so good, I'd buy a cup on a 95-degree day.", "pics": null}}, {"review": {"des": "It barely makes that a place this delicious and well priced exists. AND the staff is nice. Incredible.", "pics": null}}, {"review": {"des": "Great food at amazing prices!!! Chicken shawarma and falafel wrap are staples for me at this restaurant. The staff is super friendly and kind. They don't take credit/debit so stop by an ATM before coming to Taste of Lebanon. Hidden gem!!!", "pics": null}}, {"review": {"des": "The chicken salad & lentil soup are both INSANELY delicious and everyone is always super kind and friendly!!!", "pics": null}}, {"review": {"des": "The lentil soup! Food is affordable and around a very central location. Highly recommend coming here and the market across the street", "pics": null}}, {"review": {"des": "I love this place. The lentil soup, the hummus and the falafels are the best I had in the US. They use an incredible tahini. Very kind and friendly staff", "pics": null}}, {"review": {"des": "Wowowow! What a gem! This place is walking distance from my home and worth the walk. <br><br>The veggie platters are awesome (get the one with tabbouli) and so cheap. 2 meals = $16! When I left, I was stuffed! <br><br>The only drawback is that this is a cash only establishment and they close early. This would really be the perfect place for late night eats. I even told the staff this, and they agree, but it isn't expected to happen. <br><br>I will be back!", "pics": null}}, {"review": {"des": "Had to leave a review because I was so impressed by the fast service; the food literally came out in about 2 minutes. Delicious falafel wrap only $4 while at other places that would be double. Will definitely come back again", "pics": null}}, {"review": {"des": "Holy Hummus, this place is terrific. One of my favorite \"cheap eats\" in Chicago. <br><br>It's not just that the food tastes good...what's special is that the restaurant has high standards for creating the best version of a dish, even if it's served on plastic plates. For example, the Combo #2 has felafel and includes tehina as a dipping sauce. It has salad but adds tabouleh, cucumbers, tomatoes, hot peppers, marinated radishes, and other unusual vegetables. The grape leaves are stuffed with a creamed rice that is soft and fragrant. <br><br>Everything is good here. Don't miss the shawarma that's made in the Lebanese style, on a large flat bread rolled up with the precision of Cuban cigars. The flavor includes a light touch of either nutmeg, cinnamon or something exotic. <br><br>I'm also partial to the baklava here.  It's carefully made and not too sweet and costs all of $1.15. <br><br>It's all very simple. Yet totally \"comme il faut,\" signaling a pride in each dish and it's necessary place in Arab food culture.", "pics": null}}, {"review": {"des": "Can eat here once a week a wouldn't get sick of it. Perfect for a satisfying lunch or dinner that won't weigh you down. Love the shawarma wraps and falafel. Super cheap, but great quality and fresh. One of my favorites in the city.", "pics": null}}, {"review": {"des": "Met up with workmates for a quick lunch, very casual, cash only restaurant :) we ordered the chicken shwarma rolls and falafel combo platter....everything was good but not super I my opinion. The staff were very polite and overall a quick lunch spot if u got cash on u.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8dS_RAmNUrzlTn7ghHc1jw/168s.jpg", "caption": "Chicken shawarma roll"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0dMvSwSCeTaUIg1wE3xEDA/168s.jpg", "caption": "Falafel combo platter"}]}}, {"review": {"des": "LENTIL SOUP! LENTIL SOUP! Lord it's good. <br><br>Also those. Everything here is. It's so affordable and fresh. The chicken shawarma is my favorite. But the falafel is also to die for. Great to grab and meet at the beach with.", "pics": null}}, {"review": {"des": "My go to \"I'm so hungry. Feed me now\" spot. This place is quick, always delicious, and affordable. Plus, the wraps are just the right size (no skimping) and full of all the right flavors.", "pics": null}}, {"review": {"des": "Delicious, fresh food at a delightfully affordable price! Heads up - it's cash only. My sister & I didn't realize this until we arrived, but luckily I had a ten on me. We split the Vegetarian combo #1 and a piece of baklava and walked out happy and satiated! Friendly service. Pleasant and clean seating area. I will be back!", "pics": null}}, {"review": {"des": "Excellent falafel wraps and lentil soup. Perfect place for an affordable satisfying meal. Make sure to bring cash ! Your meal will most likely be under $10 and you will leave not hungry.", "pics": null}}, {"review": {"des": "Every time I go to Chicago I ask my friend to take me to get the lentil soup. Yeah...it's that good. And it's pretty cheap too at around $2.75 a cup. The place is closed on Sundays so I stopped by an hour before they close on Saturday night to get some soup (this was en route to El Che so you know that soup is awesome). I also got hummus with chicken to go and that was yummy and came with a hefty amount of pita bread. To be honest, the hummus is actually just so so but the chicken is well flavored and at under $8 is a steal compared to my neighborhood hummus place in NYC. I'll definitely be back for the soup the next time I'm in Chi Town and highly recommend it.", "pics": null}}, {"review": {"des": "Inexpensive, well-crafted, delightful!<br>ToL has the best falafel texture in town, the hummus and baba ghanoush are both always on point, and their lentil soup is a balm against bad weather and sadness of all kinds. A wrap and a soup is my go-to dinner.", "pics": null}}, {"review": {"des": "Awesome and inexpensive lamb kafta!!!  Service is also super fast and very friendly!", "pics": null}}, {"review": {"des": "Definitely the best deal to be had in Andersonville.  Cash only for payment but there is an ATM across the street if you roll with empty pockets.  <br><br>They use really fresh lavash for their wraps and to accompany their awesome lentil soup.  Solid falafel with hummus or baba ghannouj wraps.  Service is always friendly and you can request to make your wraps spicy if that's how you like it.  <br><br>If you don't live in the neighborhood or have planned an afternoon taking in the shops along Clark St., parking is a real pain if you just want to pop in and out.", "pics": null}}, {"review": {"des": "Delicious falafel, shawarma and hummus for a really good price. Cash only but there is an ATM less than a block away.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bdAWbZzGG4s-n53Kvi-Mvg/348s.jpg", "caption": "Chicken shawarma and vegetarian #2 with small side of hummus. Delicious!"}]}}, {"review": {"des": "This place is a neighborhood gem. Feels like a little shop from NYC nestled in Andersonville. My go-to has always been the falafel wrap with hummus, fries, and a coke. Amazing flavors and I'd be full for the rest of the day for well under $10. The guys at the counter are always super friendly. I even picked up a massive order once to cater my wedding. They had it all ready to rock the morning of the big day and our guests raved about the food. Definitely make Taste of Lebanon your new favorite mediteranean spot!", "pics": null}}, {"review": {"des": "So good so affordable and the staff is friendly. I love coming here. Worth stopping in. I personally like that there's always people in and out.", "pics": null}}, {"review": {"des": "Great food, perfect for vegetarians. I don't know of much great falafel in Chicago but you can always get it here! The lentil soup is also incredible, as is everything else I've had. Inexpensive, casual, cash only, delicious. Honestly one of my favorite restaurants in the city!", "pics": null}}, {"review": {"des": "I'm usually fond of Lebanese restaurants in general, but this one left me cold.<br><br>The turnip pickles (kabees al lift) were good, but the hummus was too salty and the stuffed grape leaves rather mushy and somewhat flavorless.<br><br>The cash only part bugs me, too, as it makes me wonder if this is a ploy to avoid taxation. Whatever the case, I DON'T like carrying much cash in downtown Chicago. (Can you blame me?)<br><br>Prices are reasonable here, granted.", "pics": null}}, {"review": {"des": "Yes, yes, yes. This place is incredible. The lentil soup is a thing of beauty; I crave it at all times. I haven't had a single item here that I didn't love, and the staff is fantastic. So good!", "pics": null}}, {"review": {"des": "Yummy food, Ultra fast friendly service, great prices.   My favs - Lentil soup, grape leaves, veggie special #1.   Love this place!", "pics": null}}, {"review": {"des": "Looking for a good lunch spot, we happened upon taste of Lebanon. The Falafel and babaganoush wrap was tasty. Nice staff, great food and prices. Cash only.", "pics": null}}, {"review": {"des": "Wow! Cheap and delicious, you can't get much better than that in my opinion! <br><br>I came here on a rainy Saturday afternoon so it was not too packed and we were able to find seating for us 3. This restaurant is tucked alongside the busy streets of Andersonville. They only take cash so thankfully there was a chase right around the corner! <br><br>Everything came out so fast after ordering and they bring it out to you. Our table ordered the lentil soup, vegetarian combo #2 (falafel, grape leaves, tabouli, pita, hummus) and lamb wrap. Wow the food is so delicious, everything tastes fresh and not greasy. The lentil soup is not watery or salty and is one of the best I've tasted so far (I've tried a lot of lentil soups since that is my favorite thing to eat). There was so much food in the combo I had so much leftover and was able to share with my friends and such a great price for $6.99! That is rare for me to see. <br><br>Definitely, check this place out when you are in Andersonville since it is close to all the shops!", "pics": null}}, {"review": {"des": "Great food at a great price! The guy behind the counter was very friendly and helpful when I couldn't make up my mind when ordering. It's cash only, which worked out - I usually never have cash but happened to today. I couldn't have asked for more from a random find while wandering the area.", "pics": null}}, {"review": {"des": "I am a Palestinian American. Palestine and Lebanon share many things nothing more so than our cuisine. I have been frequenting Taste of Lebanon for ten years. I can report with 100% confidence that Taste of Lebanon has the best Felafel anywhere west of Jerusalem and Beirut at incredibly reasonable prices. If you are a lover of felafel you are doing yourself a disservice by eating them anywhere but at Taste of Lebanon. The guys are super nice too.", "pics": null}}, {"review": {"des": "Wanted to grab a quick meal before meeting some friends.  Place is a little store front with about 10 tables.  I went with the beef shawarma wrap.  Price was about $6 and foot d was ready really quick.  The beef was a little dry for my taste but would definitely go back.  <br><br>Saw someone got the Felafel and that looked delish.  I must try that next time. <br><br>Quick easy and relatively cheap.  Worth a look", "pics": null}}, {"review": {"des": "Per middle eastern standard the place is acceptable but the food is poorly prepared and presented.  We tried the kufta kabob and we were greatly disappointed.  As for the appetizers , we couldn't even differentiate between the hummus and baba ganoosh.", "pics": null}}, {"review": {"des": "Fast and friendly service. The food is so good and affordable. Best falafels ever. Chicken shwarma wrap is amazing.", "pics": null}}, {"review": {"des": "Super tasty, awesome prices, great little gem. Had the falafel and hummus appetizers and the lentil soup. Falafels were nice and cruncy on the outside but fluffy and soft in the inside. Which is a rare treat. The pita was the flat bread kind that I like. The lentil soup was just great. This is not a fancy place. Just a little shop with a handful of tables. Authetic, clean, and economical. Will be back often!", "pics": null}}, {"review": {"des": "I work down the street, and this is my favorite place to stop to get food. Great food, good prices, and the guys who work there are always so nice. I see everyone rave about the lentil soup but the beef shawarma wrap is ALSO phenomenal!!", "pics": null}}, {"review": {"des": "Best value for the money period. But don't go there because they are cheap, go there because their food is really good and fresh. Don't expect atmosphere or high end service... Just honest to God food. I had their shawerma beef and chicken, both great. Also had hummus and tabouli salad. Also good. I do crave their falafel sandwich though. I go there when I can and they always consistently good. Staff are nice and welcoming, down to earth people. I always eat there and order alot of food then be surprised by how low the cost is. Did I mention they have great falafel!!!<br><br>Cash only place....Worth the trouble.", "pics": null}}, {"review": {"des": "Lentil soup gets 5 stars. You've got to try this to experience the depth of flavor and texture. Shawarma was ok. Babaganoush was more like hummus and they use super thin pita that staled very quickly. Service was fine and the place was clean. I'll return for the lentil soup and some entree. I'm not exaggerating about the lentil soup... it's the best soup I've ever had. I don't count pho as regular soup so that would be apples to oranges comparison.", "pics": null}}, {"review": {"des": "CASH ONLY!<br><br>This is my favorite restaurant - it is so good! AND CHEAP. and delicious! It's a total whole in the wall, but they are so nice and have real price in their food!<br>You can fill to the brim for under $5 at Taste of Lebanon on falafel and shawarma wraps or salads. Their falafel is super fresh and crispy! I also love their lentil soup (awesome for a cold night!). <br><br>But don't forget that it's cash only and order wraps for 100 people and show up with a work credit card and like four dollars like I did... <br>Also, they close kind of early on weekdays - just FYI.", "pics": null}}, {"review": {"des": "This review is seriously overdue! The food here is so amazing! I personally come<br>For the lentil soup and chicken wrap which is seriously so good. The flavors are super authentic and the prices are unreal. I wish they had more locations and would deliver bc it would be a huge success! Try the baklava as well for a sweet treat as well so delicious!", "pics": null}}, {"review": {"des": "Such Value. Taste of Lebanon has some of the best wraps at a city, at half the price as you'd find elsewhere. Where you can get delicious lamb kabab, beef schwarma, or chicken schwarma for $4.39 a pop, or get falafel, baba ghanoush, or hummus wraps for even less, this is one of the best values in the city. They aren't a fancy establishment, but you don't need to be to order a delicious wrap and eat it on the walk home(it's hard to wait until you actually get home).", "pics": null}}, {"review": {"des": "Great cheap food! Also a pretty good amount of portioning served! Love the falafel wrap and the lentil soup is amazing.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7O9j6Rx8PkgKqHkocov8mg/348s.jpg", "caption": "Hummus plate"}]}}, {"review": {"des": "Great food and service. Best falafel in Chicagoland by far!!<br>I have been coming here for over 15 years and quality has been consistently good. <br>Prices are low and staff is friendly.", "pics": null}}, {"review": {"des": "This is a hidden gem! So cheap, so delicious, and pretty healthy. They know what they're doing! I've ordered quite a few things and have liked everything. Their garlic sauce is amazing if you like things very garlicky. Love coming here for lunch. Cash only!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fgvzX1HayMvl8-yNoZGX1g/348s.jpg", "caption": "Chicken salad with a side of garlic sauce to go."}]}}, {"review": {"des": "Shh...hidden gem in plain sight! This un-assuming hole-in-the-wall place does a fair share of neighborhood carry out and regulars' business. It's cash only, though everything on the menu is less than $8. They do wraps and a few sides, and they do these things well. The chicken shwarma wrap that I got was scrumptious. The chicken was well-seasoned, moist, and plentiful, and the veggies were also crisp and paired well. I had some of the silkiest babaganoush here, and can't wait to try more. The staff is also super friendly.", "pics": null}}, {"review": {"des": "Ever been in that state of HANGER (Hunger + Anger)? I certainly was - I skipped breakfast and decided to try to honor my New Years Resolution of working out. I was starving and remembered that this gem exists in Andersonville and decided to order the lentil soup and chicken shawarma sandwich. It was my lifeline that afternoon. <br><br>The staff was super friendly and I was able to be in and out within 7 minutes of ordering on the spot.<br><br>One helpful hint: It's CASH ONLY.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/24G_248Hj32RtWx4KY390A/348s.jpg", "caption": "This is yummy -falafel and hummus! I also love their lentil soup and chicken shawrma (not pictured here)."}]}}, {"review": {"des": "Love this joint!<br><br>This is not a destination restaurant by any means. The term \"hole in the wall\" fits TOL perfectly.<br>What they lack in ambiance, they make up for with amazing food and service.<br>This is great food served fast and on the cheap.<br>The vegetarian plates are terrific and I'm a confirmed omnivore.<br>Also, they have what I consider the be the best lentil soup of any middle eastern restaurant in Chicago.", "pics": null}}, {"review": {"des": "The Service is crazy fast, and the food is crazy good!  My favorite dish is the lamb kofta! I really recommend it :)", "pics": null}}, {"review": {"des": "This place is aaaawwwwwesome. Tasty as heck.  Super quick and very affordable. Employees are really nice as well. Call ahead and it'll be ready for you in a jiffy.", "pics": null}}, {"review": {"des": "These guys are a solid 4 stars and easily could be 5. I've been coming here for years and they are a model for quick, inexpensive, and quality Lebanese food.<br><br>I've had their lentil soup, lamb/kafta kebob wrap, beef wrap, chicken wrap, falafel wrap, hummus, baba ghanoush, and all are solid. My personal favorite is their chicken shawarma wrap. It does a great job of blending chunks of juicy chicken with super flavorful crisped up pieces and it's seasoned perfectly.<br><br>The meal wouldn't be complete without their complimentary hot sauce, sport peppers, and pickled radishes. I recommend putting it all together and dipping the chicken wrap in some of their baba ghanoush, adding a sport pepper, pickled radish, and some of their hot sauce and then going to town.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QnmIEH7Y3vkFlSe7dK873w/348s.jpg", "caption": "Chicken Shwarama Wrap"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZiFzuVB4iaxyJP5Nbgr0Zw/168s.jpg", "caption": "Baba Ghanoush"}]}}, {"review": {"des": "Damn you misleading reviewers! I think the lentil soup tastes the same as anywhere else just a bit sweeter. It was good but it comes in a styrofoam cup, everything about that is wrong. I tried the special, and it was underwhelming. Never seen iceberg lettuce at a Mediterranean place before, kinda ruined the salad. Hummus and falafel was very basic. Dolmas were ok. Overall the ingredients seemed cheap and mostly pre made. I also got an open bag of store bought pitas with my order which is pretty hilarious.", "pics": null}}, {"review": {"des": "The lentil soup is comfort food for the soul. The shawarma is amazing and I can never go out without the two.", "pics": null}}, {"review": {"des": "This place is truly something special. You could walk past a million times and never notice. But the food is cheap, so fresh, fast and tasty. I just had a beef shawarma wrap and it's divine. ASI the baba famous his amazing Service is friendly. This is the type of local business we want to support. Five stars for sure!!", "pics": null}}, {"review": {"des": "I think that they put crack in their lentil soup, it is incredibly more-ish and it makes me wish for a stomach just for soup, so I could eat 20 bowls and still have room for their falafel.  It is a beautiful soup, perfectly spiced and unlike any other, not to thick and incredibly savory.<br>I haven't explored the menu much because I am unable to not get the soup, and also helpless against the falafel which is offered with hummus or baba ghanouj. I get it with the latter, and it is smoky and gorgeous and the falafel is fresh and flavorful and never soggy. My boyfriend loves the shawarma, but I barely muster even a bite because of the generous size of my own sandwich. <br>All served up by a friendly affable fellow who must be the happiest man in the world because he can get that soup everyday.  The result of lunch? Two happy, sated and somewhat stuffed people for a mere $15. So the price is also very right. I love this place.", "pics": null}}, {"review": {"des": "Only takes cash. <br><br>Small sitting area. <br><br>Long line between 11-1 (lunch time) <br><br>Why the 5 stars? - the owner's sons are great, they work hard and treat customers really well (no matter how busy they are). <br><br>I always order falafel wrap (spicy), hands down best tasting falafel in the city. Get the small lentil, the large is a bit much. <br><br>The long line moves quick so don't be too discouraged if you walk by and see people by the door. <br><br>Overall great place for a quick bite.", "pics": null}}, {"review": {"des": "Love it!!! Light and delicious. The service is very fast and the wraps are filling. I like the well balanced shawerma; salad, meat and pickles. Will come again!", "pics": null}}, {"review": {"des": "A few months ago I thought to myself, hey, I like chickpeas. If you ground them up and fried them I'd probably like that too. Pretty soon, a falafel freak was born. I went everywhere I could to buy *boxed* falafel mix and tzatziki sauce to thrown into a pita with tomatoes n stuff. I thought I had invented something beautiful. <br><br>Then one day I thought to myself, hey, what if someone else made this for me? And then... I found Taste of Lebanon. SO GOOD. SO CHEAP. SUCH NICE STAFF. <br><br>The only thing I'll say is that that resembles criticism is that they use a lot of parsley, I am too forgetful (read: dumb from hunger) to ask them to leave it out of my wrap. It is perfect in the falafel itself, but my childlike tastebuds can't handle any more than that. Oh well. I LOVE YOU!", "pics": null}}, {"review": {"des": "KAFTA ME<br><br>I walked in wanting either a beef or chicken shawarma. I asked the nice man at the counter which one was his favorite and he told me that both were good but chicken is the most popular. I then pressed him for his favorite and he suggested the lamb kafta. Why didn't I think of that? I looked at him and said, \"Yes let's do that!\"<br><br>I also asked if he could make it spicy and he said yes. The prices weren't bad either. A Lamb Kafta wrap was only $3.99 which is a great deal. <br><br>My wife went with the vegetarian combo special #1 for $5.99 which included Falafel, hummus, Baba Ghanoush, fresh vegetables, tahina sauce & pita bread. We also ordered a bowl of Fresh Lentil Soup for only $2.49. <br><br>After placing our order we went to our table and waited. The nice man who took our order also delivered our food to us. We had arrived before lunch which was nice and relaxed but the closer we got to noon the larger the crowd got. I was so glad that we didn't come during the lunch rush. We were able to relax and enjoy our food. <br><br>Our lentil soup with pita bread arrived first. I really liked it but I would not say it was the best lentil soup I've ever had. I liked the fact that it was not boiling hot. I hate getting soup that takes two days to cool off. I enjoyed the sweetness of the red lentils and it gave this soup a uniqueness. <br><br>I really loved my lamb kafta. I was so happy he suggested it. I was very happy that there was lamb in every bite. I've had kafta wraps before where it's mostly veggies and no meat. That drives me crazy. I was also happy with the level of spiciness and the freshness of the vegetables. I would definitely come back for this. <br><br>My wife loved her vegetarian combo. I was a lucky recipient of the food she couldn't finish. The hummus was very good. I loved the level of smokey flavor and believe it must be the smoked paprika that was served with it. I must also give high marks for the falafel. I love falafel but finding a good one is hard. This falafel was moist and soft on the inside. I hate it when falafels are dry and taste like gritty sand inside. This place gets how to make a good falafel. I was also impressed with the nice crispy outside and the yummy tahina sauce on top. I would also come back for the hummus and the falafel. I saw a wrap that includes both and I may have to try that. <br><br>This place was a hidden gem. Thanks to all of the Yelpers that directed me here. Your reviews and photos really made me want to eat here and you did not steer me wrong. I just wish that this place was closer to where I lived because I would be a regular.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YdrcYoMI0czxmo6xrNOYcQ/348s.jpg", "caption": "Best falafel I've had in a long time."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gOtUKUdJx3mPnT6a7ACU_A/168s.jpg", "caption": "Spicy Lamb Kafta Wrap...so good!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/z8bY2GBQ_oY4ELhf7nmASA/168s.jpg", "caption": "Vegetarian Combo #1"}]}}, {"review": {"des": "Cash only, but worth it! Great Lentil soup for $2.50 and the shawarma wrap is delicious! There are a few tables to sit and eat. Great hummus as well! Can't go wrong with anything on the menu.", "pics": null}}, {"review": {"des": "This is a small restaurant near Foster and Clark. It has very good food. The lentil soup was amazing even though it was a little too spicy for my wife.<br><br>There was no lamb and beef options when we got there but It was almost 7pm. Next time we will go early to try the beef shawarmas and lamb kebobs. I ended up getting the chicken shawarma which was really good.<br><br>They threw pita bread and a small dessert at no extra cost. Everything was delicious. I totally recomend the place.", "pics": null}}, {"review": {"des": "Very good, casual middle eastern food at a reasonable price. Friendly staff, tasty eats and neat location. A great little hole in the wall.", "pics": null}}, {"review": {"des": "The magical word, yummy..that is what I use to describe their chicken salad. It may look like an average chicken salad, but this salad is not a basic bish. The base is a combination of fresh romaine lettuce, sliced cucumbers and tomatoes. Next, they top it with perfectly cooked and seasoned chicken. There is something about their chicken that gives it an extra something makes you want MORE! Whatever it is I effing love it!! Now, to bring it all together they use this tangy, lemony dressing and they drizzle some olive oil on top of everything to make sure the lettuce gets nicely coated. At least, that is how it was when I did take out <br><br>And let me say because I did take out..hot chicken on top of cold lettuce?..yeah, not a good combo. I did not know they served it like this because it was my first time coming here so that's on me. Normally, I would not eat this but I was hungry. It was glorious. The first thing that came to mind was yummy. Yes, I want one right now. This salad is addicting.<br><br>I did order lentil soup which was very good and the veggie combo 2. The grape leaves were solid as were the falafels. They even threw in a baklava for free. It was so gooooood. What a nice surprise too! Thank you guy! <br><br>The items are reasonable here just bring cash. Small place with some tables to eat at. As for the parking you will have to find street parking.", "pics": null}}, {"review": {"des": "Best falafel I've ever had (and I'm a vegetarian).  1st time my bf and I tried this place and we were both very happy.  He got the lamb kebab.  I got falafel and grape leaves.  And we split hummus.   It was ALL delicious.  We'll be back!!", "pics": null}}, {"review": {"des": "I went to Beirut once so now I'm a real tightwad about American falafel and I will tell you that this is absolutely the best that it gets. the shawerma is good as heck too, the lentil soup is to die, the veg platters....my goodness!!!", "pics": null}}, {"review": {"des": "Ate lunch here for first time.  Had falafel wrap that was fabulous.  Also baklava for dessert.  Hard to identify restaurant from outside.  Attached is a market with imported products - very authentic.  Highly recommend both.", "pics": null}}, {"review": {"des": "Amazing place for Middle Eastern food!! All the food is fresh, comes out fast, and truly authentic. The lentil soup is to DIE for. Keep in mind that this place is small and also only takes cash, but luckily, there is a Chase bank very close by. <br><br>Service: A <br>Food: A+ <br>Price: $ <br>Atmosphere A (It's a homey type feel) <br>Overall: A", "pics": null}}, {"review": {"des": "The food was delicious and the service was excellent. I ordered the chicken shawarma which turned out delicious. I also ordered the tabouli salad and it was perfectly refreshing.", "pics": null}}, {"review": {"des": "A Hidden Gem!  If you like fresh, authentic Mediterranean food, look no further.  Like so many other authentic places with phenomenal food, this place is small, has great service, and is cash only (a fact that only makes the place better).<br><br>I ordered the Tabouli Salad and Kafta Kabob (Lamb).  The Tabouli had just the right balance of olive oil and lemon.  The Lamb was perfectly tender with delicious tahini.   Highly recommend!", "pics": null}}, {"review": {"des": "Good food, good price, great staff.  Not a big place so may be hard to get a table during busy times.  This is a cash only establishment", "pics": null}}, {"review": {"des": "This place is the definition of hidden gem. Cheap but delicious and tastes very fresh. The lentil soup is the best I've ever tasted. Most middle eastern lentil soups can taste bland, but this one has so much flavor! It's so good I crave it and make a trip just for the soup. The prices are so cheap too! A shawarma and soup is maybe $7. It is cash only so that's probably how they keep costs down.lots of vegetarian options as well. Thank you taste of Lebanon for the great eats.", "pics": null}}, {"review": {"des": "Amazing food, amazing people, amazing prices, amazing lack of pretension.  This is my go-to in the neighborhood.  Everything is good, but the lentil soup and falafel stands out.", "pics": null}}, {"review": {"des": "Best lentil soup and stuffed grape leafs! I love this place, it's healthy, affordable, and delicious. The guys are friendly and fast.", "pics": null}}, {"review": {"des": "I'm in love with Taste of Lebanon. I was introduced to this place by a friend that lives in the neighborhood and, after I tried it for the first time, I almost always requested we order food from here when I'd hang out at her place. <br><br>Taste of Lebanon is unassuming on the outside but don't be fooled, the food is fantastic. Here's what I like:<br><br>- Lentil soup (simple, but delectable) <br>- Chicken chawarma wrap (meat is juicy and special sauce is delicious)<br>- Hummus (yum)<br>- Baba ghannouj (double yum)<br>- Falafal (crunchy on the outside, flavorful on the inside)<br>- Baklava (it's dripping in honey, my mouth is watering just thinking about it)<br><br>The food is super cheap but it's a cash-only establishment (boo!) and there isn't a lot of seating, so I always order it as takeaway. I wish this place stayed open later but what are you gonna do? Absence makes the heart grow fonder.", "pics": null}}, {"review": {"des": "I love the falafel wrap with hummus and the veggie combo! Some of the best value in the city-- you get a full meal for $4-$6! And the staff is very friendly.", "pics": null}}, {"review": {"des": "I come here pretty often for my lunch. I think this place is such a great deal for the price I get. Plus their food is delicious. I didn't know what tabouli salad was at first, and I didn't like it in the beginning, but I love it now!! Service is awesome too", "pics": null}}, {"review": {"des": "The food is fresh, authentic, and delicious..always ready very quickly even with large orders.. amazing place to pick up dinner for the family or swing by and grab lunch solo! Staff is always very friendly and this spot is a gem for sure.", "pics": null}}, {"review": {"des": "The lentil soup is somehow both simple and and out of this world. I've tried to re-create it at home with little success. There is no lentil soup quite like this one!<br><br>I also enjoy the wraps and plates. I'm veggie and the baba ganoush and falafel are other favorites.<br><br>You cannot beat the price for the quality of food, fast and friendly service! I love Taste of Lebanon!", "pics": null}}, {"review": {"des": "The bomb. Tiny spot, cash only, small menu but the food is great!! If you like falafel, definitely order. My go-to order is chicken over hummus (sometimes beef if I'm feeling it) and it comes with pita. It is more than enough food and would recommend over the shawarma wraps! <br><br>All in all, can't make a mistake here. The Lebanese guys here are awesome too and provide great service! Gave us some free soup and filled waters even when really busy - which they are, especially around lunch time.", "pics": null}}, {"review": {"des": "No better service, baklava, lentil soup or falafel sandwich! Super casual, out of sight service and food. Cash only. Simple menu.", "pics": null}}, {"review": {"des": "300+ five star reviews, this place must be good, right? Not. Looking around the bare-bones storefront, I just don't get it -- what am I missing? \"Well, you have to rate the place as an example of its type, not against some Michelin-starred restaurant downtown.\" OK, so how does it compare to any other storefront falafel joint? <br><br>Answer: the food here is VERY ordinary. I had the Vegetarian Combo No. 2. Falafel, ordinary. Stuffed grape leaves, mushy and off-tasting. [Search \"mushy\" in their reviews and you'll see what I'm talking about.] Tahini sauce, ordinary. Tabouli, wrong ratio of parsley to bulgur wheat. And the same unripe tomatoes and unpeeled cucumber as everywhere else.<br><br>The lentil soup is nothing special. I know what folks write about it here-- it can't be taken seriously. Maybe they add a little more cumin or turmeric than usual--not a big deal in my book. Tastes pretty much the same as everywhere else. <br><br>TOL is fast, friendly and cheap--I will say that. But as to the food actually served here, not 5 stars. Guys, up your game. People wanting to sample Middle Eastern food can always give Dawali or Sultan's Market a try.", "pics": null}}, {"review": {"des": "Missed trying this my last stay but made the effort to get there to pick up a plate for later, to eat at a time after they close. Veggie Combo #1 and a beef shawarma. Baba ganoush, humus, cucumbers, tomatoes, falafel, olives, radish, and peppers on a bed of shredded lettuce with pita and tahini on the side. What a tasty meal! The shawarma was solid, too. Really too much food for one, but no regrets. Proceeded to eat here the next two nights, just to get my fill. Super polite and attentive gentleman at the counter. Get the hot sauce, too.", "pics": null}}, {"review": {"des": "I absolutely love Lebanese food but live in Indiana.  My Mom lives in Andersonville so when I came to visit we were all wanting Lebanese food.  That is when we discovered Taste of Lebanon and thought we had died and gone to heaven.  Their food is absolutely delicious!  Everything we have ordered has been incredibly fresh, beautifully made and a delight to eat.  We have been sharing the food with family and friends and everyone loves it.  The hummus, baba ghannouj, taboule, salad etc, etc are fabulous!  What is the best is the pita that comes with the meals that is still warm when you get it.  <br>   I also want to recommend them because of the amazing service the owners give to you.  We ordered a large amount of food tonight for a carry out order. We were on the way to pick it up when one of the men called me back to say the restaurant had just gotten very busy and had a long line of people ordering so he wanted to make sure I came to the front of the line as soon as I got there so I didn't have to wait to pick up the order.  I was so touched that they took the time to call me.  They are so friendly and I really appreciate that.  It is not often that you find a restaurant that offers both wonderful food and lovely customer service.  Highly recommend!!", "pics": null}}, {"review": {"des": "Chicken Shawarma. All you need to know. I've tried several other things from the menu, but my standard go-to never fails. I work in the neighborhood, and there are plenty of other great places to eat, for sure, but this is the quickest and most affordable option for such a great shawarma. I go every other day, and I am never disappointed.", "pics": null}}, {"review": {"des": "(Important: CASH ONLY!!) Not a single bad thing to say about this place!!  Well, other than it isn't close to where I reside, but nonetheless, this place is amazing!  I stopped in on a Friday late morning/early afternoon for some lunch with my boyfriend.  He ordered the falafel wrap and a side of hummus and I ordered the lentil soup (had to),  and the Vegetarian special #2.  Everything tasted fresh, homemade, and all flavors were on point!<br><br>The place itself is a bit small and I'm glad we got there at the time we did because the lunch rush soon followed and there was not a single place to sit after 12:00-12:30 pm.  That goes to show you how great this place is.  The price point is great as well if you're looking for some not-too-expensive places to eat with great food.  Sidenote: the staff is so damn efficient!  Huge thumbs up for quick, great service!  Definitely try this place out.", "pics": null}}, {"review": {"des": "Get the lentil soup.  Thick & substantial with pita bread on the side. I also had the shawarma wrap & companion had the grape leaves.  All for under $20 but they only take cash.  Very casual.  Great service.", "pics": null}}, {"review": {"des": "CASH ONLY!!<br><br>I am here, no joke, almost every other day. People already know what's up with this place, they almost always have a steady flow of traffic, but it's counter-service, and they handle everything amazingly fast, and have never had any part of my order come out wrong.<br><br>They have something for everyone and every appetite. If it's cold out, get the fresh lentil soup, it's hot, tasty, rich, filling, and comes with a stack of pita.  <br><br>Vegetarian? They got you, the #1 is an ample portion of falafel, fresh veggies/salad, baba ganoush (sp?) and hummus, also with a stack of pita, I'm not a vegetarian, and I make a dinner out of the #1 twice a week. <br><br>The lamb wrap is unreal. Be warned: it is pretty onion-heavy, but delicious. I wasn't a huge fan of the beef shawarma, but I overhear a ton of people ordering it, so if you're curious, give it a try. I frequently make a dinner out of one lamb wrap and one falafel wrap, which is more than enough food for one, and probably enough for two to share.<br><br>Did I mention it's not pricey AT ALL? Did I mention the dude that runs the counter is cool as hell? Did I mention the food comes out insanely quick? What's that? You're upset because there's no bathroom on site? PEE BEFORE YOU COME!! AND BRING CASH!!<br><br>This place is the chronic, and will probably be doing awesome business 20 years from now. Truly a neighborhood staple.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/g6Vvh5G9Rfz7a8VB_I2VkA/348s.jpg", "caption": "Special #1!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/g4JkconOtN4cSx0BprQoSw/168s.jpg", "caption": "This is the spot!"}]}}, {"review": {"des": "Taste of Lebanon is without a doubt, the best quick eat (for under 10 dollars) that I know of in Chicago.  The owners and entire staff have the perfect balance of friendly and efficiency.My favorite items are the Lentil Soup (Must Try), Fattoush, Hummus with Beef and the Lamb Wrap. It's cash only and is a smaller space for those that try to dine in.  <br><br>You should definitely check out this neighborhood gem.", "pics": null}}, {"review": {"des": "I don't have to go into much detail with this review given the large number of positive reviews already made.  I had the chicken shwarma sandwich and lentil soup.  Everything tasted fresh and the staff was really friendly.  Will order from here again!", "pics": null}}, {"review": {"des": "This is the go to spot . I've been going here for the past 5 years and absolutely love everything about this place . The people that work there are some of the friendliest , hardest working people I've seen and they never ever break under stress or mess up a order when it's super busy and still remain consistent in taste and service every time I go . CLEAN FRESH AFFORDABLE HEALTHY SOUL FOOD (soul food for middle easterns and people that like vegan food with flavor ) <br>6 STARS", "pics": null}}, {"review": {"des": "Awesome spot, staff is always friendly and the food is great (decently priced too)!", "pics": null}}, {"review": {"des": "Just got takeout and not only were they super speedy, but they were so kind, the food was amazing, and I barely spent any money! The chicken shawarma is so delicious and do not pass up dessert! You won't regret it. Yummm!!", "pics": null}}, {"review": {"des": "God, the food here is so good. Yeah, the decor's not pretty, and they're cash only, but who cares when you can eat like a king for under $10. I work nearby, and the $3.99 wraps are the perfect lunch. My favorite is the grape leaf hummus wrap, though the falafel hummus is a close second. Honestly, there have been some days where I eat lunch here...and return for dinner!", "pics": null}}, {"review": {"des": "A quick, tasty and affordable place for lunch. I had the lamb kebob wrap and lentil soup - both were delicious and filling. Service was fast and friendly, and I'll definitely be back to try the rest of the menu.", "pics": null}}, {"review": {"des": "The food quality is amazing the lentil soup is the best I've every had and the owner is always so nice.....I just love coming here!", "pics": null}}]}