{"name": "taza-cafe-chicago", "reviews": [{"review": {"des": "The customer service of this place really stands out in the loop where almost everyone behind the counters during the weekdays is just super slammed and busy and therefore does not usually even take time to look at your face and say proper hi. At Taza, that is not the case, they always give you a warm welcome here and are very nice & helpful with your food choice in case you are not sure what to order.<br><br>They have plenty of vegetarian options and their food is inexpensive but yet absolutely delicious!<br><br>Great spot to grab a lunch but just like anywhere in the loop on weekdays, it gets really busy, so if you can, try to make it here a few minutes before noon or come after 1:30 PM when everything is slowing down.", "pics": null}}, {"review": {"des": "Extremely friendly staff in this counter service restaurant make it special.<br><br>I tried the gyro platter, which came with lentil rice, hummus, a falafel, salad, and pitas. It was very good, especially the gyro meat coated in tzatziki and spicy sauce.<br><br>Even better was the falafel sandwich, a generous serving of falafel, lettuce, tahini, spicy and a very fresh pita pocket to hold it all.<br><br>Definitely one of the best choices for fast Middle Eastern food in Chicago.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DloFsDciDH3fP3pWtJqAMw/348s.jpg", "caption": "Exterior"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hXZHdf2ee8QBkOxJ3IW62A/168s.jpg", "caption": "Interior"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aQlxSws4PYYndq0tjZtIHA/168s.jpg", "caption": "Falafel Sandwich"}]}}, {"review": {"des": "In Chicago for work this week, and I love me some Mediterranean food so was thrilled to see this is directly across from my office. Went in about noon, ordered a gyro plate, which was fantastic. Great gyro meat, good rice and hummus, good sized portions, and they gave me a sample of their roasted turkey which was fantastic as well. Cover it all with tzatsiki & some spicy sauce and I'm a happy guy. Oh! And the falafel they put into each order made me debate going back to order more falafel despite being absolutely stuffed from the gyro plate. <br><br>Just under $14 for a large plate and a drink isn't too bad given the downtown location, I definitely recommend this place to anyone in the area! Staff was fantastic and cheerful even with the growing lunch crowd. I'll definitely be back at least one more time this week!", "pics": null}}, {"review": {"des": "Still excellent food and service.  The owner is so sweet and always hospitable. <br><br>I haven't been back for a while because we have been so busy at work and it's a bit of a walk for me.  But everytime I return, i'm reminded why this is the best falafel around!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cuTMA4hVzZQ4RbXg4E8UAw/348s.jpg", "caption": "Falafel sandwich, extra salad and the most amazing lentil soup!  Also, side of falafels.  This is my only meal of the day and well worth it."}]}}, {"review": {"des": "I've been here a few times for lunch and each visit is just as delicious as the last. I usually get their gyro hummus bowl and it's sooooo good. Even if there's a line, it always moves quickly. Absolutely worth a visit if you're in the area and want good Mediterranean food. Only downside is I wish they made their own naan bread, that would be so delicious!", "pics": null}}, {"review": {"des": "You guys are amazing! Thank you for your excellent customer service and consistently tasty food. I really appreciate you guys cranking out a huge catering order for over 20 people in less than 24 hours! You guys saved my life! <br><br>If you are ever in a bind and need a catering order, these guys answer their emails all the time (even on weekends when they are closed). I had a panic moment and forget to order catering for an event for my job. I emailed these guys in hopes that they would answer and sure enough they did. They were more than accommodating, called me on Easter to take my order, and processed everything on Monday morning. On top of this, they delivered very quickly, set everything up, and they even threw in some free stuff like baklava and falafel. We absolutely love their food and their baba ghonush ( I am sure I misspelled that) is to DIE FOR! Please patronage them--you won't be disappointed!", "pics": null}}, {"review": {"des": "I have been going to Taza for a while now, on my lunch breaks, but did not think to write a review until I received service above and beyond the norm. <br><br>What I've always loved about Taza is that their food is fresh, delicious, and much higher quality than the other fast food joints I've frequented for lunch.<br><br>THE FOOD:<br><br>Falafel is nice and crunchy on the outside, but super soft and moist on the inside. And when dipped in their delicious tahini sauce it's perfect!! <br><br>The chicken schwarma is also delicious. You'd think that the chicken would be dried out and bland, but it's not. It is homemade and tender and tastes awesome in a pita sandwich. <br><br>The tahini sauce is one of the best I've tried. I wish they'd give it out in a larger container though. I didn't have enough for the 6 falafel that I ordered, but I'm sure if I went up for more they'd have given me more. <br><br>What I really want to talk about is how warm and generous the owner is (I believe that's he's the owner??).  He is always saying hello, and giving free samples of falafel.  He comes out from behind the kitchen and asks you if your food is OK.  I always tell him it's really good!  But today, after I'd finished my food and was sitting there watching YouTube videos to pass the time, he came over to me with a plate of baklava and a napkin.  For FREE!  Now this guy knows how to go above and beyond for his customers.<br><br>I hope to spur on his business even more (not that they need it!!!) with my review because he is someone who deserves it!!", "pics": null}}, {"review": {"des": "In town for business & stopped by for lunch. This place is awesome! Best flavors for Mediterranean that I've had; each item was exceptional. The staff was so welcoming and friendly...I wish this place was in my town!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MPo3eJCHg51Vv0ocAGPrNA/168s.jpg", "caption": "Dolmas/ grapeleaves . Delicious"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mOup8imrzWs46u2ClkUrjg/168s.jpg", "caption": "Combine plate lentil rice, gyro, chicken"}]}}, {"review": {"des": "Taza is the kind of restaurant everyone hopes to find - friendly, local-owned, cheap, delicious, and filling.<br><br>Taza is the best Mediterranean lunch spot in the loop, period.", "pics": null}}, {"review": {"des": "I'd say Taza was decent but certainly not the best. I enjoyed that it is genuinely a \"small business\" and all their employees are SUPER friendly and helpful. However, I thought the food was largely just average especially for the location it's in.<br><br>Had the Taza platter that comes with chicken shawarma, gyros, hummus, dill rice, and a salad. Everything had decent flavor, but generally nothing really stood out.<br><br>I'd come back maybe if I just wanted a quick fix, certainly not \"bad\", but decent.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7BhKhF5s1gaERB9rJSD3Yw/348s.jpg", "caption": "The Taza Platter"}]}}, {"review": {"des": "This is my go-to lunch place when I meet up with my husband during the work week. <br><br>The friendliest staff, good prices, and great food. I usually go for a gyro pita and my husband gets the Taza combo plate and we're always satisfied. Also the falafel here is BOMB. Now whenever I get falafel somewhere else, I'm always disappointed because they can't live up to Taza's. <br><br>The only downside is the size of the space because it will get crowded and the tables are fairly close to one another, but don't let that deter you! It's just an opportunity to make some new friends.", "pics": null}}, {"review": {"des": "Friendly place, with a wide selection of quick mediterranean food. I liked their hummus plate options, since I want all food of this style to be liberally dowsed in hummus anyway.", "pics": null}}, {"review": {"des": "Came here for lunch, I had the Gyros Plate, which contained Dill rice, hummus, pita, salad and obviously the Gyros. the food was good, gyros were tender and juicy. the staff here is friendly, and the place is a little small, but there is a sitting area outside. overall a good experience", "pics": null}}, {"review": {"des": "A very classic, hole-in-the-wall Mediterranean spot. Right in the loop, so perfect for a workday lunch. Not the most luxurious of interiors, but the food and casual setting makes up for it. I had the Chicken Shawarma platter, which came with hummus and pita. Very tasty, quick, and fresh!", "pics": null}}, {"review": {"des": "Mezza and Roti are a block from my work location.  I don't go.<br>I walk by Naf Naf on my way to Taza.  <br><br>It's eight blocks and at least three Mediterranean restaurants way.  The choice is Taza, no matter how cold, it's worth the walk.  The lines are shorter, it costs less, tastes better and the employees are happier.", "pics": null}}, {"review": {"des": "Love this small quick service Mediterranean joint. No fuss fabulous food. Chicken kebabs and falafel us excellent. Love the herb flavored rice.", "pics": null}}, {"review": {"des": "I was craving hummus, so I decided to come by for lunch. Nothing fancy, but the hummus shwarama bowl was really good. And their falafel was amazing. I also tried lentil soup for the first time. Not my favorite, but it was still tasty and it really hit the spot during the cold weather.<br><br>The employees were all very friendly. The cashier who helped me was smiley and polite, and the guy who served my food made sure to check in on me. Definitely enjoyed my experience!", "pics": null}}, {"review": {"des": "Taza is my favorite go-to lunch spot when I am at work! It's so consistently good. I always get the veggie combo platter, but I've tried all of their meat and everything is so fresh and absolutely delicious (especially the gyro). I've brought so many co-workers with me to try and all have fallen in love, so much that I'm about to self proclaim myself as a brand ambassador.  Finally, everyone who works there is so incredibly friendly and nice. Shout out to Ahmed (spelling?), the owner - once you chat with him once and tell him your name, he'll never forget you. If you're lucky, he'll even give you free soup/baklava/tea (on top of free falafel) which are all equally as good. This place is the best!!", "pics": null}}, {"review": {"des": "Pleasantly surprised. The food tasted fresh and the staff were really nice. I will definitely be back. <br><br>And that's all I have to say about that. <br><br>Jackee", "pics": null}}, {"review": {"des": "Phenomenal food. Great service. Line moves fast at lunch. What more could you ask for?", "pics": null}}, {"review": {"des": "Was craving something middle eastern near work and upon doing some research discovered this little gem. It was so good! I got a lunch Combo/special with chicken kabob and dill rice (not white rice). Some people were ordering turkey?! But I'm not sure how I feel about turkey and rice to be honest. <br><br>The food actually kind of reminded me of a mix between Pita Inn in Skokie and maybe Reza's Restaurant ?! Quality was up there. Some places give me a stomach ache because they use a lot of oil etc but I felt great after eating this. <br><br>It was a bit on the pricier side for a lunch special. I think I paid $11. But it was worth it. It was an unforgettable lunch. I've been meaning to go back!", "pics": null}}, {"review": {"des": "Huge fan of this place.  I'm so glad I finally came to try it.  The first thing worth mentioning is the owner was extremely nice and greeted everyone like family.  Several customers came in and it was a lot of, \"How's your family?\" or \"You're not getting the falafels today?!\" kind of thing going on.  I wanted the kebab combo but they recommended the daily special which also comes with a falafel for a cheaper price.  The guy even asked if I wanted to try their gyro meat.  Of course!  Everything was really good, especially the dill rice and hummus.  The kofta kebabs were my favorite but the chicken if I had to be absolutely honest, was dry.  With that being said, I'm still coming back because everything else, including how genuinely nice the owners were, made my lunch even more enjoyable.  They've won me over.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gTAZmnoPRVacpXw23KjsiQ/348s.jpg", "caption": "Kebab combo but they threw in falafel and some gyro"}]}}, {"review": {"des": "Great Gyro Sandwich and good Falafel. Not a fan of their Jerusalem Salad, it lacked salt and flavor!<br>SURPRISINGLY cheap!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vcQkgyUIS1djLJwmlNpQ_Q/348s.jpg", "caption": "Gyro Sandwich"}]}}, {"review": {"des": "Wonderful delicious goodness.... with a smile!  You walk into Taza and immediately smell homemade flavors of a roasting grill.  I ordered the chicken shwarma sandwich - excellent meat, jerusalem salad and tzadziki and Taza's terrific homemade hot sauce (good heat, but not too hot).  All of this and none of the sandwich fell apart or got too soggy to eat!<br>I received two extra falafels - pillowly balls of softness, not hard and dense at all!  The baklava! Ahhhhhh......what a treat. <br><br>You can tell the owner and staff work hard to bring us good, healthy food at a reasonable cost. I highly recommend Taza - run, don't walk!<br><br>I will be back - probably tomorrow :)", "pics": null}}, {"review": {"des": "When I get pita bread stuffed with hummus and salad and shawarma, I don't expect much. It doesn't even have to be evenly spaced out to hit the spot, and honestly, as long as the meat isn't dry, I'm usually about it. I'm trying to think about what more Taza could do. Like, I guess they could have, idk, \"juicier\" falafel and they meat could be more dexterously marinated, but it doesn't matter when I scoff this shit down. The portions are generous, and they really know how to put this together; every ingredient is like a tier above what I'd expect from a chain (cough cough Olive) that is usually more expensive. It's $8. For a cheap Mediterranean grill type place, I honestly do not know what else I could ask for, without telling them to line the bread with hummus (I mean it kind of gets stuck at the bottom of the pouch, but nobody's a magician here). The chef's sandwich gives you falafel and shawarma (or gyro meat, if u want that), and it will not leave u hungry or wanting more.", "pics": null}}, {"review": {"des": "Top 5 all time places, in all genre, in any city.  Gotta have the gyro plate with falafel!! 5 stars because I can't do 6", "pics": null}}, {"review": {"des": "The ambiance is unimpressive, but make no mistake, this is a terrific place.<br><br>Food is fabulous.  Nice variety for carnivores and herbivores alike. Shwarma, gyros, and the other traditional meat entrees are very good, as are the salads and my favorite, the veggie platter (Dolmeh, Falafel, Hummus, Tabbouleh and House salad served with pita bread and tahini sauce).  <br><br>I have been coming to this restaurant since it opened (near my office, so it's convenient and good) and perhaps my favorite part -- over and above the food -- is the service. Long-term staff and the owner recognize regulars and greet new customers heartily.  <br><br>Truly, truly worth the visit and the repeat.", "pics": null}}, {"review": {"des": "Awesome quick lunch. Despite being packed, the staff still managed to be super warm and friendly. When he had to run to replenish something before he took my order, the guy encouraged me to try the fresh, streaming falafel samples that were out. I had a gyro (try it with hot sauce) and could not resist buying the half pound of baklava to take home.", "pics": null}}, {"review": {"des": "Stopped by for a quick bite yesterday after discovering this restaurant on Yelp for its good rating/reviews. The food was great (I loved the dill rice and fresh baklava!), and the employees were very nice and provided quick service. I spoke to the owner before leaving. He was very kind and ask how the food was. I'm not sure if the place usually has music playing, but when I came in it didn't. Some Arabic music would be nice to add, but other than that it was a pleasant experience and I'll definitely be coming back! :)", "pics": null}}, {"review": {"des": "Got a good salad here for lunch. Service was super fast, if not a bit rushed. Portions were solid, but it was a bit on the expensive side for the salad ($10). The other dishes looked delicious, so will definitely come back. Definitely a good place to grab lunch.", "pics": null}}, {"review": {"des": "Wow. This place is amazing. First off, everyone is incredibly kind and friendly from the second you walk in the door. You seriously feel like family. The food is also amazing. I ordered a #1 special; the rice was clearly fresh, the chicken was so tender and flavorful, and the falafel were like pillows of joy. Highly recommend this place as a go-to for anyone in the area. I'll surely be back regularly to get my Mediterranean fix.", "pics": null}}, {"review": {"des": "Stopped in for a late afternoon lunch at 3pm. Greeted nicely by employees and they offered suggestions - went with special 2 - turkey, gyro meat, rice, 1 falafel, bread hummus, and salad. Came with tztatziki sauce and hot sauce. All was excellent - as good as it gets. Everything looks good - clean restaurant - but small and no washroom that I could tell. All very good.", "pics": null}}, {"review": {"des": "Fantastic and authentic food. Excellent service....there are always free samples of delicious falafel. Also don't forget to try the baklava. You won't be disappointed!", "pics": null}}, {"review": {"des": "6 years later, it's time to write an update!<br><br>Taza is still awesome.  Prices have gone up a bit, but $6 for a delicous falafel sandwich is still a great bargain.  And they are so friendly!  There are often samples of falafel and pita chips on the counter.  The other day, there was a girl in front of me who wasn't ordering anything (she was there with a friend who was getting food) and the guy gave her a falafel ball wrapped in foil to enjoy while she waited.  The line can get long, but it moves pretty fast.  Even faster if you pay with cash.  Still a gem!  So glad that I now work nearby and can get my falafel fix whenever I want :)", "pics": null}}, {"review": {"des": "The yummy Mediterranean food at Taza  Café  combined with the ever-humid  Chicago summer weather made me feel like I was luxuriously eating in the hanging gardens of Babylon.  If only...because that would have been some epic shit.  <br><br>Although there is another Mediterranean place that is still #1 in my heart of hearts I do really like Taza Café and their falafel that everyone else seems to rave about.  Don't let the three star rating blind you because most of my experience at Taza was great, but there were just a few decrements for me.  Before I talk about what was bad I will tell you what was good!<br><br>The falafel was obviously amazing.  It had the perfect flavor and it was extremely, extremely fresh.  I had gotten the kifta kabob plate which only came with one falafel; I wish I'd gotten more than one falafel in my plate!!!  They really are some of the best in the city.  Other than the lonely falafel that came with the plate, the dish also came with hummus, two super fluffy and big slices of pita, lentil rice, cucumber salad and the meat of course!  All of this was only about $10!  What a good deal for that much food in city center!<br><br>Every single thing I just listed was delicious, but the kifta itself was quite dry.  I had to chug a lotta water after taking a bite of the kifta.  Despite the dryness of the meat it's flavor was plentiful with all the delicious spices it was cooked in.  if I were to go again I may try the chicken schwarma  plate which seems to be quite popular.  <br><br>The venue was quite small so don't plan to sit in if you have a big group of coworkers with you at lunch time...that just won't fly.  Given that Taza Cafe is surrounder by many other yummy restaursnts, this place does seem to be hit up a lot during the lunch hour which is a testament to the quality and quantity of food you're getting.  The owner was also quite happy to give me the special (which was $2 cheaper than the plate without any special) so I can deduce that  he feels comfortable knocking prices down for customers due to a high volume of people coming into his restaurant.  With that being said, the owner was extremely friendly while helping out behind the bar.  I can't say that some of the other staff were as friendly as the owner, but it didn't ruin my day.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Kcc2SnKtJDXKtTE4_kK1mg/348s.jpg", "caption": "Kifta  kabob plate, yummy"}]}}, {"review": {"des": "This place has excellent falafel. It's got the perfect texture and flavor, crispy on the outside but that soft, green, flavorful inside. Too many Mediterranean places just don't get falafel right, but Taza has mastered the art of perfectly frying chickpeas.", "pics": null}}, {"review": {"des": "Solid Mediterranean lunch place and one of the better lunch places in the immediate area. Their menu is pretty expansive, with salads, plates, sandwiches, and different combo items. There's always food to sample while you wait, either fresh falafel or pita bread. Even when the line looks long it always moves fast. They're always really fast and friendly in here, and the food tastes great too.", "pics": null}}, {"review": {"des": "My friend suggested Taza and I was underwhelmed (see my first review), but I took his word for it and gave it another try. I followed his lead and ordered a gyro hummus bowl. A whole bowl of hummus had me scratching my head at first but it was really good. I added tzatziki sauce, giardiniera, asked for some hot spicy sauce on the side (I like all things spicy!!!!), and it came with a pita on the side and a piece of falafel in the bowl. $10 and I was definitely satisfied.<br><br>We sat inside and took our time eating and catching up. I noticed a table nearby with two regular customers. They chatted with the owner/manager/staff and praised their food as always. It was really nice to see that. A little while after my friend and I had finished our food, they brought us two cups of hot sage tea and pieces of baklava. How sweet!? The manager/owner possibly was like \"I saw two nice customers in here and wanted to treat you both with some of my sage tea. Enjoy!\" I had never had or even heard of sage tea. There were fresh pieces in the cup and boy was it suuuuuper tasty. I immediately looked up at the menu and saw that it wasn't one of the hot tea options. He said he had just made it personally for himself but was considering adding it to the menu. Heck yeah... it was really freaking good. And then the baklava... I don't like baklava... at all... but things were going so good so far that I decided why not take a bite... and another... and another... LOL. 5 stars all around. I get it now. Don't order a regular old salad like I did during my first visit last year. That was a silly move. Thanks to my friend for bringing me back and thanks to the whole crew at Taza for being great.", "pics": null}}, {"review": {"des": "I recently relocated from the east side of the Loop to the west side of the Loop so now's the time to try new places.  I'm a sucker for Mediterranean food and the loop has lots of good options.  Taza leaves all others behind.<br><br> I've never been a fan of falafel.  I've tried it many times and I've always been \"meh\" about it.  The ones I've had have always been hard and dry.  My opinion quickly changed after the first bite of my first visit.  I don't know if they add crack to these, but they're SO addicting.  Falafel has now gone from being the \"optional\" part of my meal to the staple of my meal.  Falafel sandwich combo with a side of falafel and I'll even grab some samples when they're available. :-) Might as well get some falafel to take back to the office for an afternoon snack...<br><br>Ok, the shawarma isn't so bad either.  Get the Chef's Sandwich which is shawarma AND falafel stuffed in a pita with hummus and all the other goodies.  This is easily one of the best sandwiches I've ever eaten.  Maybe someday I'll get burned out on this and try it with gyro meat just to mix it up a bit.", "pics": null}}, {"review": {"des": "Nice folks who work here but food was very average.  Ordered the special combo plate so had an opportunity to try the gyro, chicken sharwama and the falafel.  I thought the chicken was extremely dry (it appears they use white meat chicken here instead of most places that go with a dark meat chicken on the spit) and the gyro was fairly typical.  The falafel was crispy on the outside but a bit too dense on the inside for my liking (enjoyed the falafel at Naf Naf Grill a bit more).<br><br>The combo plate comes with rice, a Jerusalem salad and a pita - decent amount of food for $12 but in terms of taste alone, very middle of the road.", "pics": null}}, {"review": {"des": "Great lunch spot in the loop. Food is delicious but what really shines is that the staff is the most friendly anywhere. Clearly a small business where people take a lot of pride in the food that they make.", "pics": null}}, {"review": {"des": "My absolute favorite lunchtime place...these guys and gal are super kind and sweet!  The food is well seasoned and the difference between this place and others is their dill rice, hummus and falafel which I tend to never give 5 stars too.  <br><br>On colder days, I tend to get my lentil soup and side of dill rice.  In the warmer months, I get their salads  which are fresh or if I'm super duper hungry (piggy status), I get their gyro plates are awesome with big portions.  Even the side of their Baklava has the right amount of sweetness that just makes this place the best.  As for pricing, you can't get better than a $7 sandwich with fresh ingredients, plates are around $10-13 depending on what you get.  <br><br>I love supporting smaller business like this that produce great food.  Go Taza! :)", "pics": null}}, {"review": {"des": "As far as near-middle-eastern shops for kebab and falafel go, this is among the best I've found in Chicago. The falafel and pickled vegetables I've had here were very good, and I note that Taza has an expansive selection of vegetables and sides, as opposed to some of the other, less authentic shops that focus mostly on meat (e.g. Halal Guys).<br><br>I recommend Taza for a tasty and light lunch in the loop. It's very convenient for taking back to your office.", "pics": null}}, {"review": {"des": "Best falafel I have found in Chicago. So amazing. Not super mushy in inside, crispy on outside, and so flavorful. Very nice staff", "pics": null}}, {"review": {"des": "Great food as always and fairly priced<br>I've been coming here for years <br>You must try it", "pics": null}}, {"review": {"des": "Best under-appreciated hidden gem in the middle of The Loop!  <br>From the outside, Taza is pretty unassuming.  But once you get your food, you'll realize the storefront is deceiving.  <br>The workers will immediately make you feel right at home.  They're friendly, funny, and help you figure out exactly what you're craving that day.  <br>Definitely would recommend the Hummus Bowl with chicken shawarma or gyros.  They fill the container with hummus and pile on the filling inside and top off the whole thing with a sample of their delicious falafel.  And don't forget the warm pita on the side! <br>Taza's a great place if you're looking to grab a quick bite and need to get right back to the office, or if you're just craving some delicious mediterranean food with welcoming company.", "pics": null}}, {"review": {"des": "Pretty great food and quick service. Make sure you get a cup of water if you dine in, the food is good but also really dry. I made two sandwich/gyro style things with the chicken and something combo. It was extremely filling, ended up paying around $12 I believe with tax.<br><br>I would give this place a five, but I came in thinking I'd pay $8.50 for the combo (based on their website). It's definitely more expensive than the menu on yelp/website menu suggests. It's expensive for a lunch place to be honest, but it seems well run and something different than larger chains. I may come back here, definitely something new to add in the loop list.", "pics": null}}, {"review": {"des": "I think I've been seriously spoiled by NYC middle eastern. Taza was fine but nothing special. The baba ganoush was interesting - less of the smooth paste with lots of tahini version I've had a lot, and more eggplant-y and watery. Wasn't the biggest fan of this version tbh. Chicken wasn't super juicy per se, but it was serviceable, and hummus was fine.  Nothing really stood out, and I ended up feeling a bit underwhelmed.<br><br>On the other hand, staff here was super friendly and accommodating.", "pics": null}}, {"review": {"des": "Food is slightly high for what you get. There is a similar restaurant on the north side so being ignorant, I thought it would be the same, I was wrong, the food is edible and somewhat tasty, the space is small and can get overwhelming during lunch hour and how busy it gets. I would give it a go just to knock out the list of neighborhood joints that are around", "pics": null}}, {"review": {"des": "Great selection and good value.  I had the gyro salad which did not mention having feta cheese and then it did, but i already ordered the add-on of feta which was an extra $2, so need to work on the online menu descriptions to make sure they are accurate.  Besides this point, I would definitely go back as they had no line right at noon downtown which is unheard of meaning its a hidden gem.  Also, I like that its an independent mediterranean joint rather than the 4 other main competitors downtown and is still very price competitive.", "pics": null}}, {"review": {"des": "Came here for an early dinner before going to get drinks elsewhere. We got falafel, stuffed grape leaves and chicken shwarma. Everything was good, especially the falafel and grape leaves. <br><br>Even though I gotta say my mom makes the best falafel, Taza's wasn't that far off. That's saying something. Would definitely recommend.", "pics": null}}, {"review": {"des": "Excellent spot a friend recommended as his go-to spot for lunch during the week! They had fresh falafel and pita chip samples to entice you as you made your selections. My husband and I ordered the combo of the day which came with both types of rice - dill and lentil, chicken gyro, lamb gyro, salad, pita, and hummus. We also ordered a chicken kebab \"sandwich\" to try something new. Everything was delicious. Hummus was full of flavor, meat was juicy and tender, and even that falafel sample was great. (It was so good it reminded me of a falafel I'd had in Sudan!) This place is a gem and I would definitely go back.", "pics": null}}, {"review": {"des": "This place is amazing! Delicious food, cute location, and the staff were super nice, especially the owner. I had the falafel and fries, and they gave my friend a free baklava for bringing so many others to their restaurant. I'll be going back!", "pics": null}}, {"review": {"des": "We didn't make it to \"Greek Town\" so this place was the next best thing.<br><br>My wife & I both had the \"Combo Plate Special.\"  We had skipped breakfast, so we came here at 11:30 am, just before the lunch rush.  <br><br>They are very nice here, and the food is amazing!  Even the \"greek salad\" was good.  Loved the sauces they provided (one was tzikiki, the other was a hot sauce).<br><br>My only complaint is styrofoam boxes.  That will always give a reduction of one star.<br>Had they used hard plates and silverware --- I'd give them a \"5\".", "pics": null}}, {"review": {"des": "Dear Taza, <br><br>I'm writing this to apologize for betraying you today. I was too lazy to walk the extra block, so instead I tried another place that is similar. I am so disappointed by the quality of this meal and promise I will never eat at another Mediterranean in the Loop! The Falafel is not greener on the other side. Thank you for your great customer service and quality food!", "pics": null}}, {"review": {"des": "Came here for lunch with my husband today. I got the chicken/falafel special plate and my husband had the combo special. Each meal was 10.85. It comes with your choice of dill rice or lentil rice, then hummus and cucumber/tomato salad and pita. The chicken was juicy and I liked that the spicy sauce actually had some heat. The rice was fluffy and light. My husband's dill rice was tastier than the lentil rice so I know that for next time. The hummus was also nice. The falafel were kind of hard and very dense. They were not light and crispy. The outer shell was a bit hard. The pita was also cold and not freshly made. However, it was a good value and seemed more authentic than places like Roti/Nesh/etc. Although, I do prefer the warm pitas and falafels at Roti/Nesh/etc. I do appreciate that it seems family owned and there seem to be a lot of regulars who know the owner well.", "pics": null}}, {"review": {"des": "The food was ..meh<br><br>I wished Olive: Mediterranean grill did not move.<br><br>Sorry to do a full blown comparison:<br><br>Plate was more expensive<br>Meat was not as good...heck, food was not as good<br>Portion was about the same<br><br>yea...I miss Olive", "pics": null}}, {"review": {"des": "Easily the best falafel I've had in the Loop, and the freshness of everything else just rounds out the experience.<br><br>I got a chicken shawarma plate. With a drink, it comes to just over $10, which seems like a lot, but you a good amount of food: the bottom of a steel disposable plate thick with hummus, two pitas, one falafel and a layer of chicken.<br><br>The chicken was seasoned, but the hummus was fantastic. Fresh lemon juice makes all the difference with hummus. And the texture was good--smooth, and dippable with the pitas, which were nice and soft.<br><br>Next time I'm getting the falafel plate, because the falafel was the size of a hush puppy but tasted so, so much better. Fresh lemon (or is it lime?) juice on the inside, moderately crispy on the outside. I'm looking forward to having more.<br><br>Taza is a bit of a hike from River North, but it's worth making, and the accolades it has received are well deserved.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/q9gZIifJ1QKXi5GQUEcuSw/348s.jpg", "caption": "Chicken shawarma plate."}]}}, {"review": {"des": "The only thing better than the food at Taza (and yes, it beats out the beloved Roti) is the customer service. The employees are incredibly hospitable and treat you like family. Bonus points for handing customers in line fresh, free samples of their amazing falafel.", "pics": null}}, {"review": {"des": "Love love the food here and the owner! Super friendly and kind staff, one of my favorite mediterranean places in downtown! Two thumbs up", "pics": null}}, {"review": {"des": "Came here for lunch with my boyfriend. We both got the combination platter and it was absolutely amazing. I grew up with a lot of middle eastern cooking and this was so authentic. The owner is so nice too. He really tries to get to know his customers which I love in a place because it keeps people coming back!", "pics": null}}, {"review": {"des": "I love middle eastern food but I don't usually think to get it during lunch because I find that some things can be a bit heavier or could just be that I subliminally forget that there is anything outside of $12 salads, burritos and pizza. Enter piping hot, crispy falafel, juicy kifta sandwich with toasty pita and crunchy fresh veggies. They also make a mean chicken shawarma salad for those lighter days.", "pics": null}}, {"review": {"des": "Chicken was overcooked and dry though the rest of my plate was good.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sC2gcoDMWYT1KZn10UqWcQ/348s.jpg", "caption": "Chix kebab plate"}]}}, {"review": {"des": "I pass this place every day on the way to work, so figured I'd try it out for lunch. Unforunately, I wasn't too impress. It's a tiny space, so you may want to go on off lunch hours if your looking to eat in.<br><br>Service was great! Everyone was really friendly and greeted you when you came in. I went with the Falafel Hummus Dinner Plate. The Falafel's were okay, but something was off in the seasoning. I did however, like the texture and the fact they weren't ridiculously hard like some places. The Hummus was very bland and I didn't care much for the salad. It was okay, but compared to the Hummus Plate I normally get at Naf Naf it really didn't do it for me.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OW22qunnKW3PmqdNCmz2Sg/348s.jpg", "caption": "Falafel hummus dinner plate"}]}}, {"review": {"des": "Taza was one of my clients at my previous company. I, as a consumer of their delicious food, and as an internal source of information can say without question that their entire menu was top notch. I'm not being biased here, I honestly love their food. I always loved coordinating with Taza at our lunch events. Management is knowledgeable and friendly, they go above and beyond to satisfy customers and their selection of food leaves a lasting impression. They have made it on my top ten places for favorite middle eastern restaurants and they will have me as a customer forever. Try these guys!", "pics": null}}, {"review": {"des": "I went to Taza for the second time today. The first time I was impressed with the Lentil soup and Tabbouli. This time I was delighted for a different reason.<br><br>I got back to my office after lunch and realized I left my purse at Taza. When I returned to retrieve it, I was relieved that the staff had it waiting for me behind the counter. I looked in my purse on the way out and found the walnut baklava I had wished I ordered earlier. They turned a stressful situation into a pleasant one and it scored them a loyal customer.", "pics": null}}, {"review": {"des": "Yum yum yum! Perfect chicken shawarma for this chilly day! <br><br>I work walking distance from this gem and decided to give it a try over my lunch break. Loved how the bread is moist and the chicken is so tender and flavorful! Definitely coming back!", "pics": null}}, {"review": {"des": "New menu board; substantially higher prices (20-30% for the platters and salads); slightly smaller portions; still great food. Not the value play it once was, but probably still the tastiest Mediterranean food within a 2 block radius (and there are a bunch of options). <br><br>What! $7.00 for a Chipotle salad across the street -- deep value relative to Taza! #WhatDoesntGiveYouEColiMakesYouStronger?", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AvWCyjq-q4Qw7bvvTVLKDg/348s.jpg", "caption": "Chef's Special with gyro and falafel (~$9) reminds me of the old Wendy's slogan 'where's the [meat]!?'"}]}}, {"review": {"des": "I enjoy that they have a variety of options. I had the Taza's Chicken Regular Plate, which included a piece of pita and a bit of Jerusalem salad. The chicken tenders were over a bed of dill rice. It was also nice that they had the other option of lentil rice. The dill rice was probably my favorite part. It was flavorful and fragrant. The chicken was pretty good and tender, considering it is white meat. The salad also had a nice flavor, but wished there were more as it only filled the small pocket of the container. Their pitas aren't that good (but maybe I'm just used to Naf Naf's freshly made pitas).<br><br>Last time, I had the Shawerma Hummus Plate. It came with a pita and a falafel. The falafel was one of the best I had. My chicken shawerma was tasty but cold, maybe due to the hummus. The hummus was plentiful and good but not great. The pita that time was even worse, cold and hard.<br><br>Overall, their items are pretty tasty and rather authentic. While their portions are pretty decent, I still find their prices to be a little too much, like $1 over, relative to other Mediterranean places. I do, however, enjoy their service. Friendly and efficient.<br><br>*Perfect snack: Falafel, 3 for $1.80!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mr2FK3ofbpo8mWPt8T_qog/168s.jpg", "caption": "Half eaten Shawerma Hummus Plate"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0z00XqV4ZppulRqL51YuPA/168s.jpg", "caption": "Taza's Chicken Plate (regular)"}]}}, {"review": {"des": "Ordered carry out for the first time today.  Great portions for lunch- I had the chicken shawarma plate which came with dill rice, chicken, tomato/cucumber salad, hummus and pita.  I would have liked some sort of spice to it but probably my bad for not indicating that.  I'll certainly be giving them another try!", "pics": null}}, {"review": {"des": "super excited to discover this gem in the loop. My lunches just got so much better.", "pics": null}}, {"review": {"des": "Best lunch carry out spot for Middle East food in the loop.  Super fast and friendly service, many delicious options and very fairly priced. <br><br>Usually I get the hummus and shwarma bowl ($9) which is very filling and always fresh and tasty.  Other favorites are the Taza special (gyro, falafel, hummus, Jerusalem salad and choice of lentil or Dill rice) or the kebab and falafel plate, both under $11.  Every order comes with pita, and everything I've ever tried has been flavorful and never greasy.", "pics": null}}, {"review": {"des": "Always fresh and delicious food that won't cost you an exorbitant amount(a rare thing to find in a loop restaurant) staff is always courteous and friendly, even when they are busy. The owner usually throws in a little something extra to keep you coming back for more. Plus the food is truly authentic Middle Eastern cuisine, not some out of touch franchise.", "pics": null}}, {"review": {"des": "Fantastic!!  Cheap and quick but so delicious, and everyone was super friendly!  Had the combo plate with a really great falafel and some super tender gyro meat.  Awesome if you're super hungry, but enough to share if you're not!!", "pics": null}}, {"review": {"des": "With seemingly hundreds of Mediterranean offerings in the area, I was curious to see what made Taza Cafe stand out from the rest... and it was pretty clear... the amazing falafel. <br><br>I had ordered the Chicken Sharma plate on my first visit. The portion was quite sizable. A healthy scooping of chicken, a bed of nicely spiced rice, hummus, Jerusalem salad, were enough reason to stop by here, but it was the one ball of falafel that changed my attitude for the whole meal and has made me a somewhat regular. <br><br>The chicken was slightly dry but seasoned nicely. The rice while flavorful, really was more fitting for dinner than for lunch. The salad is nice and the hummus is about average from what I would expect. The pita that comes with the meal is nice and chewy with an interesting taste. However, the falafel is awesome. It is super flavorful and well spiced. They are fried to a perfect brown and crumble nicely when bitten into. After my first visit, I now frequently order the falafel plate which comes with a bed of lettuce with falafel, Jerusalem salad, pita, and hummus. I top the falafel off with some nice tahnini sauce and some housemade spicy sauce (quite heavenly).<br><br>Overall, I really like this place. At around $8, the plate is around the average Loop price for food. I might give the meats another try, but so far have found little reason to stray away from my new found usual.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TtsDR_VHLO8vlLwF-tGPuQ/348s.jpg", "caption": "Gyro special plate (no rice, salad instead)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vJ176yLZRe94ghHrYT9jfg/168s.jpg", "caption": "Falafel plate"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DE5ww4fffvfiLnwjbYW6ow/168s.jpg", "caption": "Chicken sharma plate"}]}}, {"review": {"des": "Lots of things are great here: friendly employees, quick service, and I've always gotten a sample of falafel. However, I find the food bland with not enough seasoning and flavors at other middle eastern places nearby.", "pics": null}}, {"review": {"des": "You can't fool middle eastern with your day old meat that you use for the sandwich. All I am saying is shame on you guys. The sandwich was so cold the meat was old and to much tahini . I mean com'on guys you have one job to do !", "pics": null}}, {"review": {"des": "The falafel and the hummus are both amazing!!!!  I also tried the lentil soup and it had a very distinctive and different flavor than what I typically experience, very good.  Its definitely a very authentic place and I suspect all the food tastes as good as the food I tried for the first time today!", "pics": null}}, {"review": {"des": "I'm digging Taza a lot.  Their chicken is on the dry side but it's packing a lot of chicken flavor, whereas other places serve chicken that's essentially just texture and spice and you don't taste... CHICKEN.  However I'm sure that's a reason why a lot of people prefer that.<br><br>When getting a combo or plate, you have a choice between Lentil or Dill rice.  I actually like both.  On GrubHub they didn't offer the choice but you can use the special instructions to say which you want.  Lentil makes me feel healthier whereas the dill rice is a bit more oily to contrast with the chicken.<br><br>Their falafel packs a pretty heavy flavorful punch.  Definitely get one to try.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TmhU-gvZfyrTbrYYlBoQkw/348s.jpg", "caption": "Delivery: hummus and salad came in containers to prevent leakage."}]}}, {"review": {"des": "The bread of the sandwich is quite different!<br>The shopkeeper also very nice to introduce the menu if you don't know", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Vp3Kl5OlT5PygMTK6wB0-A/348s.jpg", "caption": "Yummy! Delicious sandwich"}]}}, {"review": {"des": "Great food, great service! A lot of bang for your buck, here. There's not too much seating here but we managed to nab a table during the busy lunch rush. Someone who I can only assume is either the manager or the owner came out and said hi to us, very friendly!", "pics": null}}, {"review": {"des": "First off I have to apologize for the picture that I uploaded.  It does not do the gourmet falafel proper justice for how amazing it truly is.  Growing up on Pita Inn I have lofty expectations for Mediterranean places.  I have worked in River North for a few years and am typically disappointed by the lack of quick stop fair priced restaurants.  After doing some yelpwork and craving some pita/falafel I decided that a nice walk would do me well. <br><br>The place is tiny, but seems to have their process down pat.  The line was flying and it was my turn to order before I even had a chance to decide.  Without thinking or knowing what exactly it was I ordered the \"Gourmet Falafel\".  It's a great price for downtown eating at $4.95.  It's a pita with three falafels, hummus, Jerusalem Salad, lettuce, tomato, hot sauce, and any other fixings that you desire.  I wasn't sure how the falafel would keep after a 10ish minute walk back to the office.  Once I got into our break room I opened the still hot goodness and indulged.  It was probably the most flavorful falafel sandwich that I have ever had.  I have a lot that a love, but this one had the right amount of spice and flavor.  I am fairly certain that this will be a regular stomping ground of mine.  Next time I will try the lentil soup and the schwarma.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cmXWU7bKw5tnCjmvQt3v5A/348s.jpg", "caption": "Special combo"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6hu8AbcsVu0pQIGZXV8njw/168s.jpg", "caption": "Lentil soup"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bzlZgGzuqszCMNIdhYsmlA/168s.jpg", "caption": "Love this!!!"}]}}, {"review": {"des": "Absolutely love Taza - The schwarma/gyro combo is as good as it gets with usually plenty of leftovers. Since I started working in the loop Taza has been my go to Mediterranean spot.", "pics": null}}, {"review": {"des": "Wasn't too impressed with the pita sandwich. I ordered a Kifta Kabob sandwich which I was excited to eat, but to my disappointment the pita appeared to be overly soggy, impossible to hold to take a bite, and not to mention that I received 3 small pieces of the Kifta. Overall, the taste of the Kifta was good, but a tad too hard. I went during the lunch rush so service was alright, nothing spectacular.", "pics": null}}, {"review": {"des": "Taza and its surrounding restaurants were smack dab in the middle of our work buildings, so my best friend and I came here a couple of times for our weekly lunch date.  <br><br>Taza is a tiny little cafe that makes really great, cheap lunch food! I've tried both the gyro and falafel sandwich, and both are deeelish.  The falafel here is amazing- I don't know how they make it differently from other restaurants, but it is crispy and delicious on the outside and smooth and almost creamy on the inside. The food is fresh and delicious and you can get a quality lunch here for under $7!", "pics": null}}, {"review": {"des": "My new office is at 333 West Wacker, literally one block from Taza.  So on my first day here, I decided to hit Taza for lunch.  I'm not kidding when I say that this might be the only lunch place I need when I visit my office twice each week...between the friendly staff, the fair prices and the best falafel I've ever had, what else do I really need?<br><br>Stopped by around 11:30 today to beat the lunch crowd.  Ordered a combo that had two kinds of meat (chicken gyro and gyro meat), hummus, pita, falafel, and salad plus a soda.  All of it was great, served fast, and came in around $10.  I didn't even need this much food but I ate it all anyway....mmm, mmm, good!  I'll see you later this week, Taza!!", "pics": null}}, {"review": {"des": "I am actually surprised that Taza has the reviews that they do. I went today and got 2 chicken shawarma salads. I am Indian and I eat a lot of kebabs (Indian, Mediterranean, Turkish etc.). The salads were meh to say the least, and the chicken not all that flavorful. In addition, I didn't realize until after the fact that they charge extra for hummus (which was later reversed). Given that the city of Chicago has seen a huge explosion of Middle Eastern fast food that includes Roti, Naf Naf and I dream of Falafel to name a few, Taza ranks at the bottom for me and I will not be back. Finally, Naf Naf and Roti offer unlimited toppings, and Pita bread, Taza offers neither and is the most expensive of all.", "pics": null}}, {"review": {"des": "Visited this place for lunch. We had hummus shawarma bowl and chicken shawarma plate with falafel. Everything was so good that we visited twice again. Would definitely recommend Taza.", "pics": null}}, {"review": {"des": "I got the vegetarian combo. Best hummus I've ever had!! The falafel isn't greasy, and the tabouli is very refreshing. My only complaint is they use iceberg lettuce, but that's prob typical. The customer service was great too and offered samples. Great lunch!", "pics": null}}, {"review": {"des": "Man, this place is great. They have some of the best Middle-Eastern food in Chicago despite the fact that it's a small and casual restaurant in the Loop. I had a combo plate with freshly cooked turkey and kifta kabobs, rice, hummus, salad. This particular combination is not on the menu so Ahmed agreed to call it the Joe Special - so ask for it - kifta and turkey combo! The lentil rice is sublime. The meats are delicious. Go!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sGtL5XqMUY8kIkWkfDOYfQ/348s.jpg", "caption": "Turkey and Kefta combo - Excellent!"}]}}, {"review": {"des": "I love the dill rice and chicken shawarma here with the spicy sauce. It is simply one of th best, and in some way reminds me of the NY Chicken over rice.<br><br>The pita chips were stale, so I would exercise caution in buying that.", "pics": null}}, {"review": {"des": "Love this place for lunch! Fab lentil soup, shawarma, falafel and hummus! Super friendly service even in lunch rush! Big thumbs up all around.", "pics": null}}, {"review": {"des": "The food is set up on a hot bar (like chipotle) but never fear it's always super fresh. The service is amazing and fast. The best hummus and falafel I've had in Chicago thus far. The gyro is also delicious. Totally love this place!", "pics": null}}, {"review": {"des": "Get the specials with a meal deal you add $2 for falafel and a drink plus the specials are worth the price", "pics": null}}, {"review": {"des": "Not terrible, but not great either.  Maybe my expectations for this place were too high, but I definitely didn't experience an abundance of flavor here like everyone else did.  Are there other places with better hummus?  Yes.  Are there other places with better falafel?  Yes.  Are there other places with better pitas?  Yes.  Are there other places with better Jerusalem salad?  Yes.  To me this does not a 4.5 star place make.<br><br>Would I go back?  Probably not, there's other places in the area with similar food that are better.", "pics": null}}, {"review": {"des": "Being from Detroit it is difficult to find middle eastern food better in other parts of the country.  Luckily for me I found one right next to my office.  <br><br>I usually go with the veggie platter.  The falafel are always fresh and crunchy not like some other places where they have been sitting is the bin and are soggy.  The pita is always ultra fresh and needed to wipe that last drop of hummus or tabouli off the plate. <br><br>The staff is also very friendly.", "pics": null}}, {"review": {"des": "I would definitely go back.  This was my first time there and the staff was very nice the food portion was good. <br><br>I normally don't order falafel but I got one with my combo plate of chicken and kifta kabob and the falafel was reallly good... I was surprised.", "pics": null}}, {"review": {"des": "The place is located on Franklin street north of Naf Naf Grill, which is probably its biggest competitor. I've come here multiple times, a few times through the Mealpal free lunch promotion, and have had the opportunity to sample their salads, soups, falafel, and hummus/meat platters. One reviewer mentioned the chicken was dry but I didn't have that experience. Also, they have a strong base of regulars. <br><br>The owners are friendly and on one occasion they offered my friend and I free baklava for paying in cash. As a smaller place, they prefer cash over credit, but they usually do accept credit. The portion sizes here are fair, more on the larger side, but not excessive like Naf Naf. I'd go to this place for a more authentic taste over more popular mediterranean places.", "pics": null}}, {"review": {"des": "Great hummus and fresh falafel.  Chicken shawarma was alright but I find a bit dry.  Very friendly owner.", "pics": null}}, {"review": {"des": "Pretty happy with my experience at Taza. Their falafels were definitely amazing and I highly recommend their Jerusalem salad. The shwarma was good but not what I expected of the normal version. <br><br>Overall, this is a casual and small place that is good when you're in a rush or wanting take out.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gfAZcRwYe2PR8VkaSx6BxA/348s.jpg", "caption": "Hummus shwarma dish with a falafel"}]}}]}