{"name": "the-chicago-diner-chicago", "reviews": [{"review": {"des": "I tried The Chicago Diner for the first time and was very impressed! They have a great vegan selection and their Portabella Melt was absolutely delicious! As a side, I chose their sweet potato fries and they, too, were delicious! They were well seasoned with what seemed like sea salt--either way I greatly recommend both! <br><br>The diner is small, but the service is fast. Would definitely visit again.", "pics": null}}, {"review": {"des": "To start. Don't be fooled by the name \"diner\". This is not a diner - you can't order meatloaf at 1am or waffles for breakfast. But this IS diner style - booths, friendly servers.... they just all have tattoos or piercings because this place is hipster AF, which makes sense because all the food is VEGETARIAN/VEGAN. Which I didn't realize the first time I went. I hardly even noticed that the chorizo tostadas weren't real meat. <br><br>I've been back more than 10 times since my Chicago Diner cherry popped summer 2017. And I often order in the sweet potato quinoa black bean tofu thing from Caviar regularly. <br><br>The menu is incredible, there shakes and lattes are a little guiltless because of the vegan deal, the only negative is the place is pretty small, one bathroom, and the wait is often long. However, they just opened this back heated cozy room for a waiting space so now there is somewhere to eat. <br><br>Animal lover or not, try this place!!!!", "pics": null}}, {"review": {"des": "It actually took me a few tries to come here since the wait time has been longer than I was willing stay hungry, but eventually I did make it in (a few times now) and had a pretty good experience each time! I've tried the Thai Basal Stir Fry, Orange chicken stir fry (I think? it was on the seasonal menu) Jalapeno poppers (my favorite menu item tbh), and the milkshake. Honestly, for me, the milkshake really wasn't all it was hyped to be. But it was still tasty! Wouldn't reeeeeaaally recommend it for the price point, though.<br><br>The service is always great and everyone is so nice and willing to help when you're not sure of what to choose to eat.<br><br>The food is very good, and I highly recommend it if you're looking for a solid vegan place in Chicago!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/I4-qY8j7VtSOw5OyE2OI1Q/348s.jpg", "caption": "Thai basil stir fry"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uVZ9xkULlXYyow99PIPlIA/168s.jpg", "caption": "Chocolate chip cookie dough milkshake"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JaAxoFStpzbXiSKcrR-OAw/168s.jpg", "caption": "Jalapeño popper"}]}}, {"review": {"des": "I've been here a good number of times and I've always tried something different. I went with a seasonal item this time around and that item was the Po'boy. The flavor, because of the condiments on it, made it work and the crispiness of the bread was just right. I wish there were just a few more plantains in it. Overall it was tasty! <br><br>I got a side of sweet potato fries that did not disappoint. I forget how big the portions are here! I was defeated! <br><br>Not sure how long their seasonal menu will be around for but I want to come back soon to try the rest before they're gone. <br><br>Side note: Their waiting room patio is heated during winter, which is of great convenience!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ldI6XitMAxKIWh_ltIkXEQ/168s.jpg", "caption": "Po'boy and sweet potato fries"}]}}, {"review": {"des": "The bf and I came here for our anniversary dinner after going to a haunted house a few miles away. I had been to the Logan Square location a year or so ago, and had an okay experience, but I had heard amazing things about the Lakeview location, so I was excited to check out this location. <br><br>We were seated almost immediately even though the restaurant was pretty packed (I'm assuming it's always packed since it was 9pm and still had heavy traffic). Staff seemed extremely friendly compared to the other location, my only complaint was that our waiter wasn't very attentive. I'm not sure if he was just super tired and zoning out, or something else (no judgement), but it would have been nice to have some suggestions since I was wanting to try something different. <br><br>We ordered the jalapeño poppers for our app (AMAZING!), and the bf had the pierogi quesadillas with dairy cheese, and I had the Reuben. He loved his and left me jealous that I didn't order the vegan version, but I was left disappointed with my option - but that was 100% on me for ordering what I did with my tastebuds, I'm sure this sandwich would be a great pick for people who enjoy mock meat that legit looks like the real thing. Just wasn't my cup of tea, and I know better for next time!! :) Mega disappointment that WASN'T my fault was that the waffle fries were hard as rock and we had to chase down the manager to have a new batch made because our waiter was off in la-la land, AND it was next to impossible to get water refills. But whatevs, I've learned to not expect 5-star service from the Chicago Diner, and it was the end of everyone's shifts, so I do understand!<br><br>I will definitely be back for those jalapeño poppers and to try the vegan version of those pierogi quesadillas! I would recommend this location over Logan Square any day!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wUudBJo9Lhv3OEamYhbyOQ/168s.jpg", "caption": "Pierogi quesadillas with dairy cheese and Reuben with waffle fries and a side of bbq sauce (because I can't eat anything without bbq sauce)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QJRAlKBR_PjwLSEHsyAZxg/168s.jpg", "caption": "Amazing FRESH jalapeño poppers!!"}]}}, {"review": {"des": "This was my second time eating at Chicago Diner, and I don't think I will ever love their gravy- or sauce-laden dishes (like the lentil loaf and country fried steak). I don't think the taste surpasses non-vegetarian gravy. But their Buddha burger is delicious -- sweet and salty with a kick from the chimichurri sauce. The bartender gave us a complimentary cinnamon roll which was amazing! I would like to come again to try their other burgers.", "pics": null}}, {"review": {"des": "First off, this is a super cool diner on Halstead - great vibes and great service off the bat. We waited for 5 minutes outside before getting seated. I love the old school retro decor and didn't at all mind being sandwiched next to another couple because that's what diners are all about, embracing community and not fussing about the little things. <br><br>While I was tempted to start with a shake, I opted for an old fashioned to get my booze fix. It was very strong, but I didn't mind one bit. We both got the black bean burger for dinner, although I got mine with a side salad and he got sweet potato fries. The side portions are very generous!<br><br>When it comes to the main event (da burger!), I have to say it was delicious. It tasted almost like a regular burger if you closed your eyes and embraced the moment. The saucy cheese-like substance, the heat from the burger, and the caramelized onions....mmm. Very tasty! Lol, I tricked my man by taking him here without mentioning the whole meatless thing, and he enjoyed it too!!", "pics": null}}, {"review": {"des": "I believe the Reuben is our future;<br>Its cooked well and it will lead the way.<br>Showed me all the flavor it possessed inside.<br>Gave me a sense of pride, made vegan easier;<br>Let the milkshake yumminess remind us how it use to be.<br><br>Everybody's searching for their gyro;<br>People need quinoa to look up to.<br>I never found any place that fulfilled my need.<br>A tasty place to eat, and so I learned to embrace meat free.<br><br>I decided long ago never to walk in a carnivore's shadow.<br>I won't fail, I will succeed. <br>At least I lived as I believe. <br>No matter what meat takes from me,<br>It can't take away my dignity.<br><br>Because the greatest love of all is this place to me.<br>I found the greatest love of all not chewing meat.<br>The greatest love of all is easy to achieve.<br>Learning to love meat free is the greatest love of all.<br><br>Thank you Whitney Houston RIP...for this song that I adapted for my review.  While on a business trip I thought I be condemned  to eating salads and I was going to suck it up because not all states are vegan friendly.  Then I found this place online and everyone said that the Reuben was BOMB so I thought I would check it out.<br><br>Parking is a premium as it is in most places in Chicago.  Inside is a nod to the 50-ish style diner with booth tables and some regular tables.  The place was almost packed when I arrived.  But when it's one person your pretty easy to sit quickly.<br><br>I was given a menu as I was seated.  I pretty much knew I wanted to try the Reuben but perused the menu in case something else came up I wanted to try.  They have a few vegan desserts and burgers so I figured I would come back and try a burger.  I mean I had had that before so it could wait.<br><br>Then Eye-spied some vegan mild shakes.  YUMMY!  I had not had a milkshake in a while so I was totally excited to try that and they had flavors other that the standard Chocolate, vanilla and Strawberry.  I got the vanilla chai milkshake and since I wasn't in the mood for fries I got some flashed kale.<br><br>The server brought me some water while I waited. This placed really dilled up and people were waiting outside and it didn't look like they mind the wait.<br><br>My food was ready in no time and it LOOKED SOOOO GOOD!  I snapped my pics and dug in teeth first.  I tired the milkshake first.  OMG slap your momma good.  I stopped drinking it.  OMG I didn't tell her I wanted a vegan milkshake.  I waved her over and asked if my shake was vegan and she said yes.  WUUUTTTTT!  This is too good to be vegan.  I mean it tasted like a regular milkshake.  TOTALLY BLOWN AWAY!<br><br>Then I cut my Reuben in half and OMG!  The cheese or the teese and the layers or juicy vegan meat stacked to perfection.  I took a bite and HANDS DOWN ZZZ_BEST Reuben meat/meat free or otherwise I have EVA HAD!  I'm drooling on my keyboard just remembering.<br><br>I'm telling you if you eat meat COME HERE and try it out.  YOU WILL NOT be disappointed!  I PROMISE!  I wish I had room for dessert but sadly I could not finish the sand.  I did eat the flash greens (kale) which was seasoned to perfection.  <br><br>OMG so good.  I'm really NOT understanding why there are any meat eaters in Chicago when this place has TWO, dos, deux, zwei, er locations in Chicago. PAAAA-LEASEEEE open one in SoCal you will not be disappointed.  <br><br> By far the best eats I had on my business trip.  I must come back and try more.  I missed so much on the menu.", "pics": null}}, {"review": {"des": "Had an amazing brunch/lunch at The Chicago Diner. Raspberry and Lime soda with Country Benedict. <br><br>Country Benedict: Herbed biscuits topped with over med egg sautéed spinach, onions, mushrooms and tomatoes. Smothered with seitan sausage and gravy. You'd never know the sausage wasn't real meat. They have the texture down perfect and the flavor was so so good! Nice pepper flavor like it should have. The biscuits were so flavorful and not too heavy.  The veggies were not greasy at all and one egg was slightly over cooked but it was still so good!<br><br>Raspberry Lime Soda: nice light flavor that was not too sweet and neither flavor overpowered the other. <br><br>My significant other had the Ruben (it's all he gets here) and a Bloody Mary and loved it. <br><br>I'm not a vegetarian but my significant other is vegan. He's been coming here when he's in the area since before I knew him (over 20yrs) and has always raved about it. No reason why I haven't been here. I'm not opposed to eating vegetarian food. I'm so glad I finally got here and can't wait to come back to try other stuff!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0axo25l9Re3b0CKFH5EmBQ/168s.jpg", "caption": "Country Benedict"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/d7z8IAAb9IbKyKSPUmbnlw/168s.jpg", "caption": "Handcrafted Raspberry-Lime Soda"}]}}, {"review": {"des": "I am not sure how to express how amazing my experience was at this diner!! The staff was beyond friendly, making you feel at home the moment you walk in the door. They take the time to have a conversation with you and really enjoy your presence. We ended up sitting at the bar and it was the nest thing that happened! <br><br>Good wise, it is amazing!!! I recently had to go gluten free and dairy free and this place really hit the spot in comfort foods that fit those restrictions. I had the lentil loaf that has mushrooms as well and I highly recommend it! Even if you arent vegetarian or vegan this place is definitely one to try!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/v9ma-XooAvS1dOG6CLabrg/348s.jpg", "caption": "Lentil loaf"}]}}, {"review": {"des": "Food 5/5, Service 3/5<br><br>Met up here with a couple of friends upon one of their suggestions. I am vegetarian (both my friends eat meat) but not usually a fan of American or diner food. That said, The Chicago Diner really impressed me with how flavorful their food was. I love that they embrace their image as a diner; from the retro decor to the dishes offered, they're not trying to sell a healthy, raw lifestyle, and I thought that was really refreshing in a vegan restaurant serving American fare. <br><br>Before coming, I'd done some usual digging on Yelp and saw their Radical Reuben and Cajun Black Bean Burger seemed really popular. We decided to share those and a Portabello Truffle Melt, family style. For sides we picked vegan Mac n Cheese, Sweet Potato Fries, and Yucca Chips. Each dish was seasoned to perfection! The Radical Reuben was by far my favorite, and one of the most memorable sandwiches I've had. Would have preferred the Mac n Cheese to be a little creamier, and the Yucca Chips were a little plain, but overall we really enjoyed our meal. Family style was definitely the way to go!<br><br>Service could have been more attentive; despite the diner not being very crowded (we came off peak hours), our server wasn't very present and we had a hard time flagging them down. Not a big deal, but not ideal if you need to be somewhere. <br><br>Excellent food experience at The Chicago Diner, highly recommend checking them out for yourself!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/I-m11UjzuzdX96ZqwBT6Lw/348s.jpg", "caption": "CAJUN BLACK BEAN BURGER"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IEz6Hw3pRlZNjn_hlUzz_A/168s.jpg", "caption": "PORTABELLO TRUFFLE MELT Sandwich"}]}}, {"review": {"des": "Great place to eat! The staff was very friendly, and the food was delicious. We ordered the spinach artichoke dip which we loved! Then we ordered the BBQ tips they had on special and that was phenomenal! We also ordered the chicken pot pie on the special and that was ok. Our server Gage was very friendly and helpful. Would highly recommend!", "pics": null}}, {"review": {"des": "Great food and amazing customer service. They took care of our dietary restriction for Indian jain food very well.<br>We ordered SUV sandwich, avocado tostadas and pancakes and loved the food.", "pics": null}}, {"review": {"des": "I usually skip vegan restaurants and rather have a vegan option at a regular restaurant or some side dishes, because they are expensive and not really overwhelming. However this doesn't apply for the Chicago Diner. It is the best rated vegan restaurant in Chicago and this is totally deserved. <br>It is well visited but the staff deals with it and good organized. Super friendly. The prices are very reasonable. And the taste is just amazing. <br>We had the Thai \"chicken wings\" and for entree we had the stir fry (with tofu and tempeh - I love both, but the tofu is even better). Service is fast. Sizes are big. Not as tiny as you usually find them in vegan restaurants. They really fill your stomach. Parkings are easy to find outside (I paid something like 2$ for a whole hour). <br>If you wanna make your stay as a vegan in Chicago unforgettable - stop by and eat here!<br><br>By the way - This is the first time I actually taking leftovers home, because it was so good. But even when it comes to the boxes they use an eco-friendly box. This restaurant integrates the vegan lifestyle from head to toe.", "pics": null}}, {"review": {"des": "I'm sure everyone loves this place and I do as well. It was crowded when my friend and I arrived but we were seated at a nice table near the back, at a cozy table for two. I'd like to note that it was just the right size because I didn't have to shout across the table and we could hear each other even with the crowdedness. <br><br>Our waiter was the best - very concerned about our order and made sure that we were pleased. What made him extra special was his concern about my opinion about my black bean burger. I stated that I have tried others and had a favorite. I thought Chicago Diner could try to sway my allegiance... so, why not try? And they did try... but the other competitor's is more to my liking. However, our waiter took careful note of what I said to share with the cooks, because they are in the business of getting better. <br><br>The service and atmosphere were great and the food was wonderful, as well. I'll probably try something different next time so that I can be surprised and say things like...'I can't believe it...\"", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/inTaXLfoVQDb-ww09Y8ppg/348s.jpg", "caption": "Let's see if it stands up to the king ..."}]}}, {"review": {"des": "There are three main reasons I try to get to Chicago as often as I can. 1. My friend lives there, 2. my friend has great cats, 3. The Chicago Diner. Luckily, she lives less than a mile away from the Halstead location! On this very short trip, I managed to make it to CD twice!<br><br>My first visit was at dinnertime, but I wasn't very hungry. That gave me a good excuse to \"just get the nachos\" lol. OMG. Seriously. OMG. Good vegan nacho cheese is a hard thing to find - and they've figured out how to make the best of it. I believe they use Teese cheeze for theirs, which is hard to come by in Phoenix. It has the ooie gooiness that you need in nacho sauce and doesn't turn into plastic like some do when they cool. The nachos are served with items - vegan chorizo, black beans, etc. but who cares when the cheese is that good? I enjoyed all of it. But even with \"just nachos,\" I was too full for desert. I did have one of their delicious Blue Sky organic ginger ales though - hoping that would open my stomach up to more capacity, but no luck.<br><br>My friend had the truffle mushroom lentil loaf. I'm not a fan of mushrooms, but I took a bite off the corner and it was delicious! It was a thick, crispy slab of meatless loaf. The roasted and sauteed veggies on the side were good, but the potatoes were a little over seasoned.<br><br>I managed to get there for brunch for the second visit. No one does vegan breakfast/brunch better than CD. I had the Mickey Muffin - an English muffin with sausage, tofu and gravy, and had Daiya cheddar cheese added. The vegan sausage was the best I've ever had! The gravy overpowered it a bit (made it a hot mess), but it was delicious. I ordered the potato hash extra crispy and was delivered a half a plate full of bite size potato flavor crunch. Over-the-top outstanding!<br><br>One of my companions got the Country Benedict and gobbled it up. I forgot to grab a sample! Another went for the Tofu Marsala. He loved the mushroom sauce. The tofu was nice and crisp on the outside. We didn't care for the veggies that came with it though - maybe too much garlic?<br><br>Once again I was stuffed, but we got a piece of the cocoa mousse cake to go. By the time we got home in the Chicago heat the \"mousse\" part had melted away (duh), but the cake was fine!<br><br>Service was great both times. My Thursday night visit was wait-free, but we did need to wait out front in the heat for about 15 minutes for the Saturday brunch visit. They offered the back porch as a waiting area, but other patrons advised us that it was like being in a sauna back there. At least out front there was a slight breeze. Either way, it was worth the wait (and the trip up to Chicago)!", "pics": null}}, {"review": {"des": "Kudos to this place for making some damn delicious vegan food!<br><br>Double kudos to my boyfriend to entertaining my crazy diets and joining me here for the experience.<br><br>I dragged my boyfriend to Chicago for a Cubs game against the Milwaukee Brewers. I was seeking out vegan and vegetarian options in the area and found this place to be suitable. It is within a reasonable walking distance of Wrigley and other attractions in the area.<br><br>We arrived and were able to be seated right away. It is a small place so if there is a wait you get to hang outside. Our server was pleasant and helpful. Since we were newcomers she provided recommendations for popular dishes and some of her favorites. My boyfriend was excited about the cheap Pabst tall boys and I was excited to try expertly cooked vegan food. In addition to his beer, the BF also ordered a Rueben with vegan cheese. I ordered the Potato Tempeh Hash with tofu. <br><br>All I have to say was everything was delicious! I wish this place had a third location in Milwaukee because the food was top notch. I tried the the Rueben and you wouldn't even know the difference between vegan and non vegan version except for the coloring of the \"meat.\" I also thoroughly enjoyed my hash. The gravy tasted so much like the real thing. <br><br>I can't wait to go back to the Chicago Diner. There were so many more things on the menu I want to try. Especially the vegan shakes.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/w9wiFxrYwbPDSFLvKhOaWw/168s.jpg", "caption": "Potato hash with tofu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/njA17sGQM3dhgbgVpCqqRg/168s.jpg", "caption": "Reuben with a side of kale"}]}}, {"review": {"des": "Awesome vegetarian staple in Chicago's Lakeview neighborhood. <br><br>This was my favorite veg place in high school and the menu still holds up! Their shakes are so flavorful! <br><br>It is so exciting going somewhere and not having to scrutinize a menu to make sure an item doesn't have meat. The service is great-if you aren't familiar with some of the items used they are willing to explain and help guide you. <br><br>Always a favorite.", "pics": null}}, {"review": {"des": "So I'm here on a layover with my crew, and our friend that we're with tells us about a vegan restaurant that his aunt and uncle own in Chicago and I immediately knew I HAD to go. HOLY CRAP. There are no words! <br>We ordered the POUTINE and added \"bacon.\" That vegan cheese was incredible. I highly recommend it. We also got the PORTOBELLO TRUFFLE MELT, which literally melted in our mouth, as well as and a brunch item, the POTATO TEMPEH HASH, which had a nice little spice to it! The sweet potato fries were exceptional. <br>You wouldn't guess these items are dairy free but they are!!! I will ALWAYS come back, anytime I'm in Chicago. Excellent service as well! Thank you, thank you!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OGFrqjzXH0GEJHdBm5tB7w/348s.jpg", "caption": "Rishi Chai Latte"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KpEIvTuBk8ipvA_Bq81LqA/168s.jpg", "caption": "Top: Potato Tempeh Hash Bottom: PORTOBELLO TRUFFLE MELT Sandwich"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LurpT5X-T_1jr-x5Go7ZNQ/168s.jpg", "caption": "POUTINE appetizer"}]}}, {"review": {"des": "Above average food !! <br><br>Firstly, there is always a wait of 30 min minimum considering size of the place being really tiny. They would fit you into small cramped up tables placed all over the restaurant very close to other people. But its understandable considering their popularity vs size.<br><br>About the food that we tried....<br><br>Black bean burger was really flavorful and really recommend it. The patty was pretty thick and jalapenos did add a kick to the burger. Loved the proportion of patty to the bread. It's totally different from other black bean burgers I have had before. <br><br>Pierogi quesadilla was just ok. I personally thought it had too much sauerkraut as it made the quesadilla really sour and pungent .... they really need to balance out the acidity .<br><br>Gyros were horrible. Seitan was really dry and chewy .. Left a really bad aftertaste in the mouth. <br><br>Sides : Sweet potato fries pretty good <br>            Mashed potatoes decent.<br><br>I would still recommend you to try this vegan place as they have a huge menu that you can try ...<br><br>We would be visiting again to try out other items before I can judge this place as there is a lot to try.", "pics": null}}, {"review": {"des": "Chicago diner makes the best vegan nachos, hands down. Melts like real cheese and tastes like it too - apparently it's brand called tease cheese which isn't very broadly distributed (so much better than that daiya brand). Topped with vegan sour cream, guacamole, spicy raw jalapenos and pico de gallo. THIS is how nachos are done.", "pics": null}}, {"review": {"des": "I came here for brunch because of all the amazing vegan options, and I wasn't disappointed. In particular, I had the cookie dough peanut butter milkshake, and it was delightful. I have a bit of a soft spot for well-done vegan desserts, so this milkshake was an absolute treat.<br><br>As for the meal, I really appreciated that they had a vegan Reuben, since I really liked Reubens in my pre-vegan days. It was pretty good. Not spectacular, but I was satisfied. The portion size was also pretty huge.<br><br>I also got the poutine as an appetizer, and it was delicious! I loved the flavor of the cheese and gravy, and the waffle fries were also great. I would recommend this dish.<br><br>I would definitely come back and try some new dishes. (And, of course, have another milkshake.) This place is a must-go for vegetarians and vegans.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GhGIYZRLN9GQ8dQWkitlhA/348s.jpg", "caption": "Vegan Reuben"}]}}, {"review": {"des": "I have heard raving reviews about this spot so I had to go. Upon going there I expect a little more \"pazzaz' but I guess it's like the name suggests it is like a old school Diner feel. I decided to have the Ruben sandwich. The presentation was no different than the traditional Ruben I was use to. I tasted the sandwich and though it tasted similar to a Ruben you could tell the difference. The sandwich came with fries it was good but nothing special there. For a vegan meal it was pretty solid. I am not rushing back but don't mind going again.", "pics": null}}, {"review": {"des": "I love both locations of the Chicago Diner.. Yes I'm from Des Moines, Iowa and our vegan food options are pretty limited... so when in Chicago, I like to eat like a guy who has never seen food before! <br>Give it to me, more and more! <br><br>Last Sunday I got a chance to head back to this location of the Chicago Diner! I have not been to this location since 2010. I have been to the new location in the past few years, so it was nice to go back to the original spot! This place is always perfect! Had to wait about a half hour in the heated back room to snag a table, but the wait was worth it! <br><br>We got a couple of drinks and I was debating a burger or the country fried steak, lucky my awesome brunch buddy got the burger so I could try that and I dug into the country fried steak, with mash potatoes and veggies. <br><br>The meal was hearty, huge, and perfect! Great flavor! And very unique to me! The service was splendid and the place was super clean and cool! Very busy but we got in and the food came fast! <br><br>We were in need of a post meal walk so we took the short trip to walk around Wrigley Field after the meal! It was a perfect start to a perfect Chicago trip! Thanks Chicago Diner!", "pics": null}}, {"review": {"des": "One of the best vegan spots in chicago! The bbq wings were the favorite among everyone at dinner with the thai curry ones and buffalo coming in second. We also had the spicy chicken sandwich which was also tasty but the patty was a little too thin for my liking. The milkshakes are great here as well. The only thing we didn't enjoy were the overly sour margaritas. Service is also great, kind servers and food was prepared fairly quickly. It seemed pretty busy on the weekend but they are open late.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zoQ3lboUrwJ2cjA04SzxUQ/348s.jpg", "caption": "BBQ and Buffalo Wings"}]}}, {"review": {"des": "We ordered at the bar as there were no seats and a 25 minutes wait at 6:45 pm.<br><br>I ordered the nachos with no avocado, Karma sandwich with Mac with the vanilla chai shake.  My husband had the Thai wings sweet potato fries, cheesecake ( raspberry , blueberry and blackberry) and Lemonade. My husband didn't like the wings said it was too dry (even with the sauce) but loved my nachos and sandwich... as did I.  I would go back and get the nachos again and again as well as the vanilla chai shake it was so flavorful.", "pics": null}}, {"review": {"des": "Amazingly good food here. We loved our time here. We ate to our heart's content and enjoyed every delicious mouthful. <br>It was crouded and we sat very close to our neighbor table. If you have an issue with sharing space, this is not the place for you. But we loved it and enjoyed the ambiance (it is just like a 50's diner). <br>If you have a sense of adventure and are looking to have a really good meal I would certainly recommend stopping in for a meal. Have a milkshake too.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dSM2qo8I1MMU9siik6gNqg/168s.jpg", "caption": "Titanic blt"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/F1UBhhyao7bGE5hJsJIVyA/168s.jpg", "caption": "Yummy VEGAN desserts- delicious"}]}}, {"review": {"des": "Perfect in Every Way. <br><br>Deep, clean flavors. Honest preparations. Fresh ingredients. Great selection. <br><br>I could eat here every single day. Just wonderful.", "pics": null}}, {"review": {"des": "I love the Chicago Diner ! I am a hardcore meat loving gal and I definitely don't miss meat here. We came here as a big group of 7 on the Sunday of thanksgiving weekend. My fiancé and I ordered the following: Reuben and Cuban sandwich, the sides we chose were the balsamic Brussel sprouts (+$1) and the sweet potato fries. They ask you when you order if you want regular cheese or vegan cheese- opt for the vegan cheese, you might as well! Our waitress, Sal, was one cool chick. <br><br>My Cuban sandwich was quite delicious, I loved the mustard and the fried yucca chips inside the sandwich! It really added the extra crunch. The seitan \"ham\" didn't quite taste like ham, but it was good none the less. Their sweet potato fries were good and soft, too. The portions were generous and more than fair for the price. <br><br>Now, the real star of the show was the Reuben. It was giant (bigger than the Cubano), the corned beef seitan was crisp around the edges like real caramelized meat corners, the Russian dressing was creamy and didn't taste vegan at all, and the kraut was piled high. Get the Reuben, you won't regret it! The balsamic Brussels were also deliciousssss. We will be back.<br><br>The only thing was that the cheese sauce that came with the cheese fries tasted kind of funny-- it had a strange taste to it.", "pics": null}}, {"review": {"des": "The food was great, I came here because one of my girls recommended it and had a great time and delicious meal, however, I came back the very next day by myself because I fell in love with this place, the servers werent as nice and not really welcoming, I was seated and then ignored, they served other people that came right after me and that was very wrong! And I was just sitting there watching the servers working not acknowledging me for whatever reason, tired of waiting, i just stood up and tell them that I just want my food to go because I dont want to tip them anymore.... luckily the bartender guy was so nice. But no, Im not coming back to this location ever thanks but no thanks!", "pics": null}}, {"review": {"des": "Five stars for The CHICAGO Diner.  I came here on a Saturday night and was able to get a seat right away.  Mike my server was on it. He was very attentive and checked in on me often.  I started with an IPA and the vegan wings.  They have three different kinds, Buffalo wings, BBq wings and Thai Chilli wings. I couldn't decide, so I requested them naked with the three sauces.  This sauce was pretty good however, that BBq sauce that they have is Amazing!  The wings were great.  For the entree I went for the country fried steak.  It came with mixed veggies and mashed potatoes.  It was a large portion Easily enough to share.  The vegan country fried steak did not disappoint.  It had a nice crispy batter and the gravy they put in top was delicious.  I also, ordered a side of the Mac and cheese.  Wasn't really filling vegan cheese that they used.  Mike noticed that I wasn't eating it and volunteered to take it off my bill.  I was stuffed after eating less than 50% of the food boxed it up and will be having leftovers tomorrow. I also grab a chocolate mouse cake to go.", "pics": null}}, {"review": {"des": "5 stars for the incredible vegan milkshakes and awesome service, 3 stars for the pierogi quesadilla--evens out to 4 stars! I loved the idea of it, but I wasn't a huge fan in practice, and the portion size was enormous so I felt wasteful leaving some of it, but I literally could not go on.<br><br>This place has always been an awesome option for local vegetarians, especially those who like fake meat. I, unfortunately, am not one of those, so the menu selections for me are a little slim. I've never liked meat, so I've never been one to crave it or anything like it. My girlfriend, on the other hand, has not been a vegetarian for as long as I have and was ecstatic to be able to eat a Cuban Sandwich with grilled marinated seitan. If that sounds like your kind of thing, this is the place for you!", "pics": null}}, {"review": {"des": "This place, oh how I wish we had one in Michigan!<br>Wonderful food and awesome service! Avocado Super Crunch Salad for Bob and I got Chipotle Tofu Quesadilla, both meals were very satisfying. Just wish we would have had room for a shake!", "pics": null}}, {"review": {"des": "Wow! I spent forever with the menu trying to decide among a wealth of options! As a vegetarian who loves comfort food and hates salads, I can't believe it's taken me this long to visit here", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/E6TWCrx7yMEeJelDxfSbyg/348s.jpg", "caption": "Mac and Teese plus burger"}]}}, {"review": {"des": "The Chicago Diner's tagline is \"Meat Free Since '83.\"  For any veg/an, this should be enough information to peak interest.  <br><br>As a Boston native/resident, I've been hearing about the Chicago Diner for years and while I've visited the city a few times now, only recently did I have an opportunity to visit this historic establishment.  It definitely did not disappoint.  There were so many options on the menu that I wanted to try it was slightly overwhelming to make a decision.  After deciding on three possible options, the friendly waitstaff helped me make the impossible decision.  I went with the country friend \"steak\" which included battered seitan filet, topped with country gravy, rustic mashed potatoes & sautéed vegetables.  The dish exceeded my expectations by far and was enough food for me to ask for a take away box.  To top it off, I also ordered a vegan shake--chocolate peanut butter.  While I'm not typically a shake kind of guy, the server urged me to try one.  I'm so glad I listened to him as it was the highlight of my experience in Chicago.  In fact, I tried to arrange an additional visit to the diner before heading back to the airport to get another shake.  Weeks later, I can't stop thinking about that shake!  Seriously go get one if you are in Chicago.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0ANz9TVCtPGH3swZYaaODA/348s.jpg", "caption": "Peanut butter shake!  It will change your life!"}]}}, {"review": {"des": "Favorites from my first visit: Thai chili wings (which were more like ribs without the bones, but still quite good), Taquitos fundidos, Cuban sandwich, and the steak (just a really big portion!). The crispy chicken sandwich was kind of a let down but the Mac and \"Teese\" on the side was delicious. Staff is super helpful and attentive too. Best part: parking available!", "pics": null}}, {"review": {"des": "The story starts with \"A carnivore walks into a vegetarian/vegan restaurant...\"<br><br>I was very impressed with how tasty the dishes my friend ordered.  From the Thai Chili Wings to Chili to Truffle Mushroom Lentil Loaf to Buddah Karma Burger to Country Fried Steak.  Oh the fried steak...  was it ever so delicious!  The fact that I had a meatless meal did not faze me one bit.<br><br>I will definitely visit again!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/58TunEJ0OnlKjSlFIbXXJQ/348s.jpg", "caption": "Buddha karma burger with sweet potato fries"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Lz-o5vpBAKB8sBsO2jzJIg/168s.jpg", "caption": "Country fried steak"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Gckg8xVfwHwUEOKJhQ_i_w/168s.jpg", "caption": "Thai chili wings"}]}}, {"review": {"des": "I loved this place! It's small, and you'll likely be pretty close to the next table over, but the food is GOOOOOD. I love all the vegan options in addition to their meat free menu. I've been hearing about this place for a while and am glad we finally gave it a try. We had the Reuben, a polish quesadilla, and the mac & tease. All of it was super good, and we'll return as soon as we're able!", "pics": null}}, {"review": {"des": "Can't believe this is all vegetarian!  Had the best Reuben ever (made with setan). Other standouts were the portobello mushroom sandwich on ciabatta.  Sides are included and the roasted Brussels sprouts were a standout. <br><br>Huge portions , good service, retro inside and reasonable. <br><br>Just GO!!", "pics": null}}, {"review": {"des": "I usually come here with my vegan friend, but would come here on my own accord if I was having a vegetarian craving.  The food here is pretty good, but I am typically a meat eater, so my standards might be a little different.  I especially enjoyed their  cauliflower curry soup that they had on special one day.  I came back the next time and it was not offered, bummer!  I am not a big egg person, and never thought about scrambled tofu, which I really enjoy.  Similar to what everyone else is saying, their milkshakes are really good!<br><br>Overall the food is creative and tasty.  Issue I run into with vegan or vegetarian cuisine is the texture.  Most of their imitation meat is made of seitan, which to me has a slight rubbery texture.  The chili wings, gyro, country friend steak, and Cuban although have different seasoning and taste, all have the same texture.  This is just a general comment, and doesn't take away from the taste of the food.  My vegan friend enjoys their bean burger so I assume it's pretty good, I just don't like beans.  A downside is they do not take reservations, and the wait can be long.  When the back is open, it give you a place to wait.  Otherwise they use the back as extra seating and so most people have to wait in the front.", "pics": null}}, {"review": {"des": "If you're looking for diner food catered for vegetarians and vegans, The Chicago Diner serves meals rich and delicious enough that you don't even miss the meat.<br><br>\"Meat free since '83,\" this diner located in the heart of Chicago's Boystown offers plenty of meals featuring meat substitutes such as seitan and tofu, as well as other creative veggie-centered entrees. At this joint, it's quite easy to substitute things like tofu and vegan cheese for ingredients like eggs and real cheese.<br><br>\"Chicken\" shawarma plates, poutine and Cuban sandwiches are just a few examples of the innovative plays on classically meat and dairy-filled meals that have helped solidify The Chicago Diner's reputation as one of the best restaurants for vegetarians and vegans in the city.<br><br>For dinner, I ordered the Radical Reuben ($12), arguably the most popular item on the menu. It's a fat and hearty sandwich made with rye bread, stuffed with corned beef seitan, tangy sauerkraut and dripping with creamy vegan thousand island dressing. While I'm not a fan of Reuben sandwiches to begin it, it was still substantial and satisfying. If you don't mind slightly soggy bread and runny fillings, order the Reuben and prepare to get a little messy.<br><br>Read the rest of my review on my blog Cat the Critic! <a href=\"/redir?url=https%3A%2F%2Fcatthecritic.wordpress.com%2F2017%2F05%2F24%2Fthe-chicago-diner-comfort-food-v%2F&s=f0593fd43175a54878b2634c1a413eab5054c13441d63ddebe007496a8fab13b\" target=\"_blank\" rel=\"nofollow\">catthecritic.wordpress.c…</a>", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yQxViwDlK9m1RJ5nhC4Rsg/168s.jpg", "caption": "The Monte Cristo"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iZIrCUFSuFHD5UJk8yrl5w/168s.jpg", "caption": "The Radical Reuben + macaroni & teeze"}]}}, {"review": {"des": "Location- in the heart of Boystown- everyone feels welcomed. <br>Vibe- retro diner, laid back<br>Food- totally meat-free but not entirely vegan. Eggs are offered, but there are many vegan options. Unfortunately, the rely heavily on soy. I was sad to learn that all the ice creams (and by default milkshakes) are soy-based. An alternative (coconut or almond) would be nice. The chili was just ok, not much depth of flavor. The corn fritter was great. The apple pie was wonderful.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qGwqvXTp1D0HavG1xwFpHg/348s.jpg", "caption": "Apple pie and hot cocoa... feels like fall"}]}}, {"review": {"des": "The Mecca of restaurants for vegans/vegetarians! I met a friend here for dinner on a Wednesday night around 6:30, and the place was packed! We had to wait for about 30 minutes for a table which was fine, they had a designated waiting area out back in a tent. It was a bit cold out there and a strange experience, but it worked.<br><br>I ordered a blt burger, my friend ordered the tostadas and we both ordered milkshakes. The shakes were AMAZING, I am still  day-dreaming about them! My burger was good, I tend to like the texture of fake meat so it was a good taste and texture, and the sauce was delicious. Waffle fries were also great. It was a lot of food after the milkshake appetizer, should have only had half and brought the rest home. <br><br>No downside to this place, will go back once I'm in the area again to try something new on the menu, such a good experience!", "pics": null}}, {"review": {"des": "Wowzers this place was good. The BBQ strips were delicious. The chili was pretty good. The quinoa tostadas were also very delicious. The tofu Marsala was pretty good. My favorite part about that dish was the mashed potatoes. For Parking use the adjacent alley. Parking is very limited though and it's pretty tight. Definitely recommend this place.", "pics": null}}, {"review": {"des": "Very happy to have so many vegan options. Everything was really good. I got the Radical Reuben. It tasted just as good as the meat version. I think the best thing was the chocolate shake. Thick and delicious. The only reason I'm giving it four instead of five stars is either the kitchen or waitress screwed up the order. Half the food came way after half of us were served and finished our food. So it was an average wait time for the first half of us then an extra 25 minutes for the other half of our table. It would have been nice if they offered an apology. So if you don't mind sketchy service, the food is awesome.", "pics": null}}, {"review": {"des": "Fantastic! I love this place. I've been trying to eat less meat and I'm lactose intolerant so this place is ideal. I had their Reuben that tasted better than any Reuben I'd had before and it was vegan! Some of the best food I've ever had in my life. I like the fact that they serve water without ice (it hydrates you faster apparently.)", "pics": null}}, {"review": {"des": "After a year, I finally got the opportunity to eat here. First of all, the service was great! Friendly and attentive.<br><br>As for food, we ordered a black bean burger with mac n teese. I think both could use more flavoring. There was nothing special to it- no kick and nothing to remember it by.  We also got the quesadilas but there was way too much sauerkraut that it became too sour and distasteful.<br><br>The chai tea was overly sweet. The pb chocolate shake was delicious though! I only recommend this dish from the ones we got. Top to bottom, it was very enjoyable.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XjeWOQKI36T-aWawS5saWQ/168s.jpg", "caption": "Chai tea was overly sweet but the chocolate pb shake was delicious! Treat yourself and get it- you won't regret it."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xnF50p5rTBWb1eF9dtZN8Q/168s.jpg", "caption": "Very sour and off-putting quesadillas. Black bean burger and Mac n terse could use a little bit more flavor- would not try again."}]}}, {"review": {"des": "As a big fan of the Logan Square location, I was excited to give this one a go when visiting Chicago for the weekend. We were able to find nearby metered parking pretty easily on a Saturday morning, so that was nice. But upon venturing inside, we realized what a cramped space this location has. We did have a short wait, which was awkward as we had to stand in the door way with the door propped open. And once seated, it felt like we were practically on top of the people sitting next to us.<br><br>All of that being said, the food is just as delicious as the other location - as expected! We ordered some of our favorites for brunch - a vegan cinnamon roll, the monte cristo and the breakfast bowl - and were not disappointed. All of the dishes have such great flavor and, though indulgent, are totally worth the splurge. These meals are like the ultimate comfort food. Also, for being as busy as they were, the service was pretty fast and the food didn't take too long to come out. <br><br>I would recommend the Logan Square location over the Halsted location, but certainly think you can have a great experience at either!", "pics": null}}, {"review": {"des": "Fantastic spot for all delicious things vegan! I'm not even vegan, but thoroughly enjoyed what we ordered! The service is friendly, the wait time was not too bad, and the options to choose from on the menu was incredible!<br><br>We ordered the BBQ Wings, Sweet Potato Fries, Country Fried Steak, and the Tofu Scramble Deluxe.<br><br>The BBQ Wings did not taste or feel like actual chicken, but the BBQ sauce it was covered in was phenomenal! The Ranch dressing accompanying was also just so perfect, the combo of the BBQ sauce with the Ranch made each bite so irresistible! The breading on the \"wings\" was a little too hard and made it difficult to cut, as many of the pieces were quite large and would not fit into the Ranch dressing cup.<br><br>The Sweet Potato fries were just like any fries elsewhere, good crunch and nice amount for the cost.<br><br>The Country Fried Steak felt and tasted like pounded and breaded chicken! The portion size was huge! The mashed potatoes were nice and flavorful as well. The gravy was tasty and made each bite juicy and delicious. The breeding here was also a bit tough, but after sometime the gravy softened it.<br><br>The Tofu Deluxe Scramble is incredibly filling! The Tofu Scramble was flavorful and had the texture of eggs, just a tad bit on the dry side. The quinoa was cooked nicely, but lacked some flavor. The sautéed veggies were awesome though, good crunch and flavor!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Jdhz56PHluyIzpxaWiSXNw/168s.jpg", "caption": "SCRAMBLED TOFU DELUXE"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bfFqcBgrOfRPUhrtLdPwdw/168s.jpg", "caption": "BBQ Wings"}]}}, {"review": {"des": "A-M-A-Z-I-N-G<br>Hands down a must try for vegans/non-vegans everyone !!! <br><br>Totally loved my lunch. I ordered the Thai Chilli Wings and Mushroom Lentil Meatloaf, both of which were really good<br><br>WINGS: the ranch sauce that goes with the wings was to die for. <br>Mushroom Meatloaf: Got a little dry towards the end when the gravy was being soaked up, but I certainly would have it again. Also, a really health option since its veges, lentils and shrooms !", "pics": null}}, {"review": {"des": "Cozy, cute, and a little bit hipster. This is the place to go when you just need a good hearty winter meal, which is exactly what brought my friend and I in on a cold weekday night.<br><br>They have a lot of vegetarian takes on classic diner foods--definitely not healthy by any means, but oh so good.<br><br>We got a peanut butter cookie dough milk shake. Pro tip: make sure to ask about their milkshake specials not on the menu! We also got poutine fries, a Shepard pie special they had (with lentils!), and mushroom loaf. It was decadent and HEAVYYY but we walked away full and happy, and thankfully with leftovers :)<br><br>I'll also note, the service was great and our food was made quickly.", "pics": null}}, {"review": {"des": "Best vegan milkshakes! This place is a neighborhood staple. A lot of the dishes do taste super similar, which I understand is because a lot of them are made of the same meat substitutes, but still very tasty. I recommend the pierogi quesadilla or the Reuben - both wonderful! Prices are a bit on the high side for the amount of food (you probably won't have leftovers). And service can sometimes be a little unfriendly, but I think it's just when they get busy and are running into things and each other. Thumbs up overall.", "pics": null}}, {"review": {"des": "Came here on a super busy and bustling Saturday night. My friend has Celiacs disease and therefore she can't eat anything with gluten and she's a vegetarian. My friend had just arrived from NYC and she was starving so why not try The Chicago Diner? It was super busy but my friend decided to wait It out because she liked the menu. The hostess did an absolutely amazing job keeping everyone posted on the wait times. The Chicago Diner is not that big but they have a closed off patio in the back. To avoid commotion in front of the restaurant, the hostess encouraged people waiting to be called to proceed to the patio area where there were heating lamps and chairs for customers waiting to be called. It was so nice of them to accommodate their customers in such a way. There was a family of four that had been waiting for a while and the hostess came by frequently and let them know, \"hey we're working on it- we're waiting for one table to clear out.\" I know the customers appreciated it. <br><br>We finally got seated and to be perfectly frank, this is not a place to go to for a romantic date or a first date. This is a place you can go with friends or on a chill night out with your significant other. Hipster crowd for the most part but this place also accommodates larger parties (families). It is so busy with people walking by with food or squeezing between each other that if you're sitting in between the two rows needed to move between the front of the restaurant and the kitchen, you'll constantly feel like someone is bumping against you. We had a really tall waiter with curly brown hair- he was super nice but he was also super tall and could barely hear us as we ordered our food. I kid you not- poor guy came back three times to be like \"I'm sorry, what was it that you ordered with this again?\"- I just started laughing and said to him, \"I'm sure it's hard to hear from all the way up there\". Anyways, I was at a wedding taste testing earlier in the day and so I wasn't hungry and ordered the mint chocolate chip shake. I have to say- I was disappointed! Okay keep in mind this was my first vegan experience so as far as anything vegan dairy is concerned, I had no expectations and I had no idea what was coming my way but I learned quickly, it ain't no Philadelphia though! You're charging me $7 for a regular milkshake which is btw more like a small milkshake. It wasn't nearly enough milkshake for $7 worth especially when you see how quickly it goes from ice cream to I scream because it turned into milk. It also tasted more like milk and chocolate chips than an actual shake. I was told I got the wrong shake, that the best shake is the peanut butter and chocolate chip- well, it's too late now! My friend got a gluten free burger that contained sweet potato and i don't know what else but she said it was delicious. My friend also got Brussels sprouts which seemed to be marinated with vinegar. That too was super delicious as well. For dessert, my friend wanted to try the cheesecake of the day- key lime cheesecake but the waiter said that it was out and they had no more so she just ordered a scoop of ice cream with chocolate syrup on top. The ice cream tasted weird- it needed some coconut milk in its life. The ice cream was bland and the texture was slightly off- I'm also comparing my observation to the dairy I eat so naturally it's not on the same level playing field. Well, while I went to the bathroom, my friend looked over to the desserts and noticed there was a cheesecake and it looks like 3 slices had already been cut. She confronted the waiter who said after I brought you the ice cream, I was informed that we do have cheesecake and he then said he would knock out the price of the ice cream and just charge us for the cheesecake... even though the only reason we chose the ice cream was because he failed to look into whether or not there is cheesecake. Overall, id go back to try a meal from here but no desserts.", "pics": null}}, {"review": {"des": "1st time eating here, amazing... the food is out of this world.. and the shakes .. delicious.. I'll definitely be back.. <br>Yummy", "pics": null}}, {"review": {"des": "My boyfriend and I stopped here on a Sunday evening for dinner. <br><br>The place was super busy- almost every table was full but we managed to snag a two seater table on the floor. The space is crowded, not very roomy. We constantly bumped into other tables making our way to our own and once we got seated, the same happened to us. Our table was tiny. It was a pain once the food arrived, having to try to make room so that everything fit. The place didn't seem (or smell) too clean, but eh. <br><br>The staff was super nice, welcoming and patient despite how busy it was. Our server provided some recommendations and we placed our order. We ordered the thai seitan 'wings', cajun burger, the soul bowl and the cookie dough milk shake. <br><br>Perhaps we just didn't order the right stuff (per the other Yelp reviews raving about Chicago Diner), but we weren't that impressed. The Thai wings were good, cajun burger was drenched with too much \"cheese\", the soul bowl didn't look appetizing and the cookie dough milk shake was amazingggg. <br><br>In summary- do your research on which food to order (not everything is super delicious here) and absolutely order a milkshake. Although this wasn't the greatest experience, I'll probably give it a shot one more time since there are tons of great reviews!", "pics": null}}, {"review": {"des": "They have good food but the portions weren't that big for the price. The bbq wings were delicious and they are made of seitan instead of soy like a lot of other vegetarian restaurants were doing. I love the waffle fries and the sweet potatoe fries were to die for. I would have given them five stars if the portions were bigger", "pics": null}}, {"review": {"des": "That dressing that comes with spicy chicken sandwich though...... ABSOLUTE FIRE. So good. I found myself reaching for it when I didn't have anything left to dip. Being a Detroiter, I've only ever ate here twice but both times were impressive. Even the nonvegans I was with loved their food! Also that coconut milk whipped cream is soooooo good too. Wish I lived closer so I can dine here daily (okay maybe that's pushing it, let's just say weekly although in my heart I'm definitely still saying daily).", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/V-kguz-MSUmAoaOgpDsVpA/348s.jpg", "caption": "the vegan SPICY CRISPY CHICKEN Sandwich"}]}}, {"review": {"des": "SERIOUSLY? why does this amazing little shop of delights have to be a block from my house? It means I never really want to try anything else because I know that the vegetarian reuben is within reach! On the weekends there is always a group of brunchers and lunchers whose tummies are rumbling for veggie and vegan options. I always get the reuben and put it on ciabatta instead of the rye bread and because i'm not vegan I choose the dairy option cheese. Your side options are great, the waffles fries are crispy and salty and the house soup is perfect. Usually its curried cauliflower. but that reuben :) i love sauerkraut and russian dressing and you really can't tell that the seitan is not meat. Very filling. I always leave with the other half of my sandwich.<br><br>Don't forget to take-away the best vegan vanilla-chai shake you will ever have :)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kKbTs5cuf09eCjiR36nBwA/168s.jpg", "caption": "Pierogi quesadillas - strange but great texture"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nF0sBTQyZGhAMVZ_W0nxgA/168s.jpg", "caption": "Ruben switched to ciabatta bread"}]}}, {"review": {"des": "Great times. Waited 40min at the bar for a table. Super busy restaurant on a Saturday. Tight space, but cute decor. Ordered the chocolate chip cookie dough vegan shake - it was heavenly!!! Super sweet!<br><br>I enjoyed my date's Cuban sandwich over my spicy tempeh Thai basil stir fry. And I prefer Native Food's nachos over Chicago Diner's nachos. But everything still tasted pretty good! <br><br>Fresh food, big portions, average prices, full bar, friendly staff. Parked a few blocks away. I'll be returning to try other meatless options. Probably during a weekday so it's less crowded. Decent meals regardless", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VJlk6Ytn15szOZ6HvGRK6A/348s.jpg", "caption": "Cuban sandwich with mac&cheese, nacho appetizer, choco chip cookie dough vegan shake, and the spicy Thai basil stir fry. Yum!"}]}}, {"review": {"des": "I don't eat out a lot, but I'm vegan, and this location and the one on Milwaukee have been a go-to spot for date nights and other special occasions for years. I don't think there's a significant difference between the locations. I always get either the S.U.V. - veggie sandwich, or the spicy chicken sandwich, usually with sweet potato fries, and both are very good and dependable when I want a classic diner sandwich and fries. I've tried brunch items from my partner's plate and it was also excellent. I also usually go for desert - the brownie is the best, I think, but the shakes are good too. Also, I love that even though they are a very casual place, they still serve alcohol. I've had the moscow mule, the lavender gimlet, and the negroni - all good and reasonably priced. All the food is reasonably priced and filling. <br><br>I've taken non-vegans and non-vegetarians here and they've been happy. The one and only problem with both locations but especially the lakeview location is how crowded the seating is. If they seat you in the two person tables you will be bumping elbows with a stranger. Larger groups are better because they'll put you in the booths. This problem is negligible though, because I've never waited longer than 20 minutes, and I'm very appreciative of a place I can go and order anything!", "pics": null}}, {"review": {"des": "I came here on the recommendation of several vegan friends and it was definitely worth the trip! I really wish I had time for multiple visits to be able to try more items, especially the milkshakes. I came during lunchtime on a weekday but the place was already packed. I opted to place a to-go order which was quick and easy. I got the poutine loaded up with sour cream, jalapeno, and bacon, a cup of quinoa chili, and a cinnamon roll. I waited outside and before I knew it my order was brought out to me.<br><br>The poutine was definitely the highlight. One of the most filling and delicious vegan meals I've ever had! I never even would have known it was vegan unless I was told. The fritter in the chili is great but the actual chili was a too sweet for my taste. I was way too full at this point and had to save the cinnamon roll for later. I was impressed at how fresh it stayed, even the next day the center was still moist and full of flavor. I would highly recommend this spot to vegans and meat eaters alike, the menu has tons for everyone to enjoy!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3wFsAahszQ84wfUMQ3_Q2g/348s.jpg", "caption": "Poutine, chili, and cinnamon roll"}]}}, {"review": {"des": "Worth checking out when vegan/vegetarian/gluten free in Chicago. :) I'd give it more of a 4.5 but I don't mind rounding up. <br><br>What stood out the most was our server. Right when we closed our menus she was coming right up to get our orders. It wasn't slow either, as if she was standing around. She was attentive. She checked to make sure everything was good after we had a bite of our food. She got our drinks first thing, of course. She asked us for boxes when she could tell we were slowing down/done eating. She didn't rush our check. It was perfect service. <br><br>Someone on yelp mentioned something about the water tasting bad so I was afraid to drink the water. I smelled and tasted it anyway. I'm usually really reluctant to drink restaurant tap water but the water here was fine. :) I think it may even be filtered. I hope it was, at least. <br><br>My mushroom lentil loaf wasn't bad. It wasn't off the wall fantastic but it's good for sharing. Sharing always makes things taste better. By itself, I can get tired of eating it real quick, but I ate some of another dish, and some soup, and some wings and went back to it so it was a good mixture of things to enjoy. Wouldn't mind ordering it again. Best thing about it is that it's vegan and gluten free! :)<br><br>Soup of the day - lentil soup was perfect in flavor. Cup size is good enough if you're going to order an entree and or an appetizer. Soup is only an additional $2 with entree order. I appreciate that! :)<br><br>Original wings were good. Good when hot and fresh. <br><br>Quesadilla was pretty good too. Mashed potatoes and vegan cheese inside with \"dipping sauce\" was a good combo. <br><br>Place was pretty packed! That tells you something. I'd totally come back if I lived here or visited longer.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/p2wIg0cjiCXiNqPAlhwbVg/348s.jpg", "caption": "Quesadilla"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WzxiFgE7ZMBPLikOrBhcFA/168s.jpg", "caption": "Mushroom and lentil loaf"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/T-GUdKf8Q4TpExSbM-TMhw/168s.jpg", "caption": "Cup of the lentil soup of the day"}]}}, {"review": {"des": "This is a main staple of Chicago for vegans! <br><br>The best vegan Ruben in the country (so glad I got the recipe in the cookbook!).<br><br>No joke, my best friend had them make his wedding cake (I didn't even know they did that kind of thing!)<br><br>They have a host of comfort foods, so whatever you are in the mood for on the comforts side, it will do you well! <br><br>Service is come and go, but they are busy!", "pics": null}}, {"review": {"des": "I cannot believe my Yelp self has always forgotten to review one of the best vegetarian/vegan restaurants in all history!  I love Chicago Diner, and have been visiting for many a year.  The quaintness of this local establishment is immeasurable, as it's located in Boystown, which is fun all by itself! But I digress, this is about the Chicago Diner.  <br><br>As others have mentioned, they are best known for their Radical Reuben.  This sandwich is heavenly!  I use the dairy Swiss cheese and its melty goodness covers the seitan and sauerkraut with love.  While I'm weird and request the thousand island be on the side, it is only to have a dipper friend.  Pair it with their mashed potatoes and vegan gravy and you are set.<br><br>Of course, I've had a medley of other great food here.  Their gyro is quite tasty, and you cannot go wrong with anything that has house made tsasiki sauce on it.  Their buffalo wings are a meal in itself, and their specialty platters are definitely something to write home about.  Although I no longer live in the city, I make sure to visit Chicago Diner whenever possible.  Ugh, now I need it for dinner!  I will always return.", "pics": null}}, {"review": {"des": "My roomies and I wanted a late night dinner so we ventured to The Chicago Diner for some healthy vegetarian food. It was pretty packed when we arrived at 10 PM so we waited about 10 minutes for a table to open up. <br><br>I got the Thai Stir Fry spicy w/ tofu and I loved it. The flavoring was on point and I love that there was plenty of veggies and tofu, they definitely are generous with their portions.<br><br>My party of 3 shared the Thai style lettuce wrap (season special) and I loved it. The sauce that it comes with is super spicy so don't put too much..<br><br>Would definitely come back if I'm ever in the mood for vegetarian food.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/d7tZanU5dd9TSZamWY2Fmg/168s.jpg", "caption": "Thai lettuce wrap"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZbtIAFvc_Yxtmv8kl-RVpw/168s.jpg", "caption": "Thai stir fry with tofu"}]}}, {"review": {"des": "Thai chili wings are to die for!! Flavorful seitan breaded and baked with Thai chili sauce. Absolutely amazing! <br><br>I also ordered the breakfast combo which came with scrambled eggs or tofu, potatoes, sausage, bacon and a choice of French toast, pancake, toast or an English muffin. I got the French toast and it was really good. The sausage was very flavorful but the bacon was okay. I've never had either vegan or meat sausage or bacon before so this was a new experience. <br><br>The ambience is nice too. Casual place with a diner feel but everything is vegan and vegetarian which made it even better. They have a large menu so you would need to come back to try more of their selection which you would want to do! It's worth coming back. <br><br>The place is kinda small so big groups may be difficult to accommodate.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HjcnK1XGIXTXC96TByxl5A/348s.jpg", "caption": "Sopes"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6ryYmuxinT4G71Be3DLGeA/168s.jpg", "caption": "Chilaquiles"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/W2zeqOWrqvBVfFlBR0aXrw/168s.jpg", "caption": "Breakfast combo"}]}}, {"review": {"des": "Meat free since '83! First time I came here was 6 years ago with a group including one German friend who was incredibly skeptical about the vegetarian concept; we had the wings appetizer, and after that he was converted. We finished our meals with vegan shakes -- delicious, rich, creamy, filling. I've been here many times and can say that the concept is fun and the quality of food is great. I stopped coming as often within the past 3 years because as a gluten free eater, many of the meat substitutes are made of wheat. If you are gf, your protein options generally consist of tofu, lentils, or mushrooms. To me, being gf took away from some of the novelty of the restaurant (I can no longer order the delicious wings and admire how I wouldn't have known it wasn't meat). However, if your primary dietary restriction is vegan/vegetarian, you will absolutely love this place.", "pics": null}}, {"review": {"des": "Best vegan and vegetarian restaurant!! The food was spectacular! This place really knows how to capture great vegetarian food!", "pics": null}}, {"review": {"des": "I'm moving away from Chicago and seriously, the Chicago Diner will be one of the things I'll miss the most! Being vegan, it's not always easy to find a place my omnivore friends will like. Chicago diner offers both vegetarian and vegan options and it's one of those places where the food is so damn good, I've never heard a bad thing from anyone (veg or not).<br>The Chicago Diner has a wide variety of food and it's all fabulous. Their vegan milkshakes are the best milkshakes I've ever had (including \"real\" milkshakes). The staff is always friendly and quirky. If you go during popular times to eat (like brunch or dinner), there may be a bit of a wait, but it's sooooo worth it. Seriously. Go there, you'll be hooked.", "pics": null}}, {"review": {"des": "Oh how I wish this was closer to where we were staying in Chicago! We rode our Divvy bikes to this spot (twice) and waited in line both times. <br><br>The food is a vegans dream - not for the health conscious BUT definitely hits the spot and is tasty. The staff is friendly, knowledgable and quick. The food is hot, fresh, fast and delicious. We had breakfast AND lunch items as well as their cinnamon buns. Yum. <br><br>We really enjoyed the seitan, so much so that we bought the restaurants own cookbook to learn the marinades. <br><br>Great spot for people watching and a good place for vegheads to stop before a ball game as the stadium is walking distance.", "pics": null}}, {"review": {"des": "What a wonderful place! Being a hardcore meat eater, it is a perfect place to get meat tasting treat without any guilt for eating animal fats! <br><br>Pierogi Quesadilla, Spicy Crispy Chicken sandwich, Portobello Truffle Melt,The Titanic BLT burger along with sweet potato fries are definitely to die for! Staff is very diverse and attentive. Any server that I had gave fantastic recommendations and was nothing but polite. I will definitely be back!", "pics": null}}, {"review": {"des": "I'm vegan and love their food, but hate the service.  Every time I go, I feel like I have to wait forever for a server to get my initial drink order.  <br><br>Last night, a server finally came, and we ordered drinks (beer and a bloody mary) and an appetizer.  The food came within 10 minutes, but the drinks did not.  Turns out the server forgot.  Everyone is human, so I get that...but what I don't understand is why she wasn't attentive enough to notice that after 10 minutes, our drinks were not on the table? I feel like servers should be scanning their tables regularly for hints as to what the customer may need, what they may be out of, what they're done with. <br><br>If I had gotten my beer within a couple of minutes of ordering, I might have ordered a second one, thus adding to the total cost of the meal and higher tip.  <br><br>Also, the bartender would come to give us our drinks, but would never take the empty bottle or empty glass with him.  I guess it's just beneath him?<br><br>Anyway, I'll still come back because of the food, I just really, REALLY hope their service improves.", "pics": null}}, {"review": {"des": "FINALLY, I dine here!  It's been a lifelong (well during my vegan lifetime) aspiration of mine to grub here!  And goshdarnit, I made it worth my while!<br><br>So we very unstrategically arrived around 1 on a Saturday with our group of five, which required a rather extended wait in the sad leaky back room.  Granted, the back room was still preferred over waiting in the outside drizzling cold.  <br><br>Once we were seated in the rather cramped dining area, I opted for the Vegan Cinnamon Rolls (to share), a White Russian (I've never had a nonvegan one), and The Radical Reuben.  The cinnamon rolls arrived first and I forced all my omnivore dining companions to try them out.  A couple of them seemed hesitant, but well what do you know?  They were a hit.  The husband even went as far to declare they were better than the vegan cinnamon rolls from a bakery I frequent in Houston - which are like the most amazing things, EVER.  They could have used more sugary frosting, but I'm a sucker for that stuff!  As for the White Russian, it was definitely boozy, boozier than I had expected, sooo that was perhaps a minor mistake as it sort of slowed down my ability to stuff my face.  The reuben, while quite delicious, was super overwhelming.  Like whoah ginormous.  Dare I say it was the most massive vegan reuben I've ever encountered, to date?  It actually held up better than I thought it, as a leftover.  I expected super soggy city, but hours later, it was still pretty delicious.  The sweet potato fries were a perfect accompanying side dish, crispy and warm.  Definitely consider ordering the reuben if you're famished or desire leftovers!<br><br>I forgot what everyone else ordered, I think all vegetarian stuff. I don't think it necessarily blew the socks off any of my omnivore companions, but they agreed everything was good and they had no complaints.  <br><br>Service lagged a tiny bit at times, but like I mentioned previously, it was a pretty jam-packed that particular day and timeframe.", "pics": null}}, {"review": {"des": "We were a group of 9 so we split up into two. <br><br>Four of us sit at the bar. The drinks -- the girl scout and the one with lavender -- were good. We ordered thai basil stir fry, cuban sandwich, country fry steak, and yellow curry rice.<br><br>Thai basil stir fry: rice drenched in soy sauce <br>Cuban Sandwich: imitated meat in a sour dough with lots of mustard<br>Country fry steak: rubber texture \"meat\" with gravy on top  <br>Yellow curry rice: lemon juice \"curry\" with rice<br><br>Overall, we had a horrible experience and couldn't even finish 1/2 of the meal. The only edible/\"tasty\" things on the plates were the boiled/salted veges.", "pics": null}}, {"review": {"des": "I love bringing people hear and not telling they won't be having any meat with their meal. The Chicago Diner has the best vegan milkshakes.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QGtps4mTXuUcqu3B6V79fA/348s.jpg", "caption": "BREAKFAST BOWL"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nuyMjtPOey9P5HtQ3sCOFQ/168s.jpg", "caption": "Sweet Potato Fries"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/e6qFsUYqDnAYgGqBZM7CwQ/168s.jpg", "caption": "CHILAQUILES"}]}}, {"review": {"des": "My favorite vegan place in Chicago. Good food, good service, good atmosphere. I have never had a bad meal here. My non-veg friends love their food, too. <br><br>Get their radical reuben sandwich. It is by far the best vegan meal I've had in 8 years.", "pics": null}}, {"review": {"des": "My first comment after my first bite was \"This is food for the God's and Goddessees\". It is a rare thing as a vegan to be able to look forward to going out to eat unless you are lucky enough to live close to the Chicago Diner. I ordered the taquitos as an app and it was amazing. The taquitos could stand alone but the salsa and cheez sauce was incredibly delicious. That cheez sauce was so good! For lunch I had a Tofu Fillet sandwich and it was one of the best sandwiches I've had in years. I was never much a fan of imitation fish stuff but this sandwich is on point. All the parts you want in a fish sandwich like crunchy crust, perfect tartar sauce, a little cabbage and herbs but no fishy grossness. It's the bees knees. I'm a Chicago diner life long fan now!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LkUi8PjiJNQlT8Sk_V6xXg/348s.jpg", "caption": "Tofu Fillet at Chicago diner"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eetHyRUrkDyvdtgXVtT88A/168s.jpg", "caption": "Meat free Country Fried Steak"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LB8uYh7XrJ9jCvhMOEabaA/168s.jpg", "caption": "Chicago Diner"}]}}, {"review": {"des": "I have been going here for years! I have no complaints about the food.I have eaten in and ordered take out from the Halsted and Milwaukee locations. I do notice that after all the years I have been eating here there is a lack of diversity in the staff. I am not sure if a lot of Black people don't apply, but I believe I have been coming here since 2008 and have only seen one Black man and one Black woman. Just an observation, not sure of the hiring process and who applies, etc.", "pics": null}}, {"review": {"des": "Pretty good. Ice cube less water is negative. Atmosphere is nice & causal. Food is delicious!", "pics": null}}, {"review": {"des": "I've already tried their other location and just tried this one since it was closer. The only part I didn't like about this location was the interior. Very tiny and crammy inside. Our seat was near the entrance where people walk into the building, and it was kind of bothering me - I was able to feel people walking past me super close.<br><br>The food:<br>Soul Bowl - just ok, nothing too exciting. One of their healthier dishes with not a lot of flavor. Came with very little chimichurri sauce. Portion didn't look that big or filling comparing to the other dishes I've had. <br><br>Country fried steak - delicious! Huge portion. I kind of forgot that I wasn't eating meat. But the breading was too tough to cut. My boyfriend had to cut them for me. They gave me a steak knife to cut with it, but it didn't do any help. Their table knife did the work instead lol. <br><br>Chocolate peanut butter shake - Yes, it's vegan and I didn't taste any difference. But it definitely tasted a little too heavy for me. Maybe I should've gone with their strawberry shake instead. Other than that, yummy!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/x6BwyO81123XVq8mt2P0kQ/168s.jpg", "caption": "Country Fried Steak"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yy91GhJQdpl0Sr7aiLJlZQ/168s.jpg", "caption": "The Soul Bowl"}]}}, {"review": {"des": "Country Fried Steak....yes!! I'm a Texas girl so take my advise and eat it! We are new to the vegan/plant based lifestyle and this place made us feel like it was a cheat day. A+! Lentil Mushroom Loaf was a hot too! We will definitely be back.", "pics": null}}, {"review": {"des": "What a discovery! Stumbled upon this place on my way to looking for vegan spots in Chicago while I was visiting from out of the country, and I was not disappointed at all. The food was amazing, tables were packed, spoke to the quality of the food. The Mac and cheese was one of the best I've eaten in Chicago - the fish fillet burger - Couldn't believe it really wasn't fish! This place could fool any meat eater.. will be back for dessert and milkshakes!! A shame that we were too full for sweet treats, can't wait to be back again! Our server Mike was super attentive despite how busy it was - really impressive service and a wonderful vibe overall. Do not miss!", "pics": null}}, {"review": {"des": "I think every time I go here I get more and more confident on the matter of \"it's easy to go vegan\". First of all I love the space. When you first walk in the people are very friendly and honestly I never wait more than 10mins for a seat. This place is usually poppin' so I appreciate the quick service. <br><br>As for the food. I took my boyfriend who is a very big meat eater. I mean even if it tastes good but it says vegan he will always agree the real thing is better. BUT he ordered the biscuits and Garvey and I got the radical Ruben. He took a bite of mine and said it was probably the best Ruben he's had in awhile. He grew up eating traditional New York Jewish Deli food. So I was super happy with his reaction. <br><br>It's our go to spot. Will be coming back more often!", "pics": null}}, {"review": {"des": "Best Rueben ever!!! I am never disappointed. The \"milk\" shakes, the desserts, and great servers.", "pics": null}}, {"review": {"des": "You have to order right at this Chicago classic or it's not as healthy as you might think. It makes plant based vegetarian eating easier for a lot of non vegans. But deep fried French fries and other processed food and sugar loaded deserts isn't going to move you far up the good health scale.  <br><br>But if you go with some fantastic and healthy dishes like the Soul Bowl - scrambled tofu, quinoa, kale, mashed sweet potatoes, black beans, avocado and chimichurri- or Lentil Loaf with veggies and red potatoes which are my two favorites you will be eating well. Also try the Cajun Black Bean burger with sautéed onion, mushroom, spinach and jalapeño. Fantastic. <br><br>All in all add the funky atmosphere and consistently cheerful great service and this is every bit of a 5 star experiance.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5BF8YMoDr2szcBPNK4ZBFQ/348s.jpg", "caption": "Chicago Diner"}]}}, {"review": {"des": "Like many other reviews below have stated, the service at The Chicago Diner was less than spectacular. So much so that it nearly negates the quality of the food (which On its own I would give 4 stars or a B- for vegan food). We waited 45 min for a table in a mostly empty restaurant.<br><br>We came in today around 2:15,for lunch. The restaurant was not packed. The host staff (a blond girl and a slender male) were incredibly rude to our group. <br><br>The milkshakes, though tasty, took at minimum 10 minutes each to come out. We are confident the girl making them was stoned. (But At least she was friendly! Along with the other guy working the bar!)<br><br>The host staff & server on the patio exhibited  passive aggressive & completely unprofessional behavior towards their customers.. not accommodating whatsoever. Our server could not remember to bring water, and when she finally did, she forgot to come by and fill it up.<br><br>I know being a server can be a difficult job, but the patio was not busy today, and it was 90+ degrees out.. a lack of empathy and care of customers hydration needs. A black family with a small child were also made to wait for at least 20-30 minutes for a table even though there were clearly many open tables available. <br><br>Server was condescending about vegan products that members of our group asked about. She appeared to not want to be bothered by our simple<br>Requests (again - the restaurant was not busy).<br><br>2 of our friends visiting us from out of town wanted to introduce us to a vegan restaurant & we're disappointed that this experience was a negative one.<br><br>This place seems like it's run by stoned college kids with little/no leadership, zero experience in hospitality, and emanate a rude self righteous/exclusive attitude about veganism. Management needs to address this with employees.<br><br>In terms of the food, The shakes were phenomenal. My friends gyros wrap was good. The beer list is ok. My cinnamon swirl French toast was dry. I think someone else at my table liked their food (tofu/eggs Benedict?) It's a shame because the staff in the kitchen is clearly working hard to keep their customers happy, but then the front of the house staff ruins it.<br><br>If this was strictly a shakes-only restaurant we would support it. But because of how annoying the whole ordeal was, We won't be coming back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/K8tk0327ajCU4WK5OxDh7Q/348s.jpg", "caption": "Cinnamon swirl French toast was extremely mediocre. The setan bacon was OK. The potatoes were good!"}]}}, {"review": {"des": "Love, love, love The Chicago Diner! When in town I make sure to stop in for some awesome dairy free/vegan desserts. My city has the cakes and pies by the slice at Whole Foods and I've had every single one. My fave us caramel crunch cake and cheesecake. My fave to pick up while in the Chi is the peanut butter shake and the Smores brownie sundae because I don't live a restricted life and always have more than one favorite!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-TOrL-peWY-oAypoXFy1_Q/348s.jpg", "caption": "Smores sundae to go . . ice cream on the side"}]}}, {"review": {"des": "I'm wary of vegetarian restaurants although I usually eat vegetarian. Especially the ones with meat and cheese analogs can be a little... weird. Chicago Diner, though, usually isn't like that. I've had some bland food there and can't get with the deserts, but I keep going back because it's mostly great. They always have good soup, the lentil loaf with mashed potatoes and green beans is phenomenal and almost too filling to finish, and yes they serve alcohol. Oh, and the portions are pretty huge in general. It's a nice, comfortable, space too, with booths, tables, and a bar to sit at, but gets crowded in the middle of the day so they do kind of rush you through at times.", "pics": null}}, {"review": {"des": "I hate to ping anyone with a one-star review, but this diner advertises gluten free options prominently here and on their main site, and that is frankly deceptive. <br><br>When you arrive you'll pick up the menu and discover in the fine print that the food is made using \"shared equipment, utensils, and fryer oil.\" In other words, the food is not gluten-free. It is not allergy friendly. Period.<br><br>It doesn't matter what it's made of if the kitchen can't prepare it right. It doesn't matter if some people who are avoiding gluten have come away with a positive experience. People will still get sick, and not just their \"especially sensitive customers\", as the fine print disingenuously implies. The majority of people with celiac or gluten intolerance are put at some level of real risk by that sort of cross-contamination. For some of us, that risk can even be serious. At this point I'm quite used to reading the entire menu back to front, and asking the waiter pointed questions, but it's hard to keep up your guard against this kind of shenaniganry when every bozo and their mother is ready and eager to promise you a safe, allergy friendly meal. Places like this make it too easy to screw up. <br><br>I used to give eateries the benefit of the doubt, and assume that they did this sort of thing out of ignorance. But that was ten years ago. Gluten intolerance is well and widely understood now, and lack of awareness is no longer an excuse for playing fast and loose with people's health. The real clincher is that, according to one review here, another customer explained the above to their staff at length in 2011! <br><br>TL;DR: In other words, The Chicago Diner is being intentionally dishonest in an effort to attract more customers, and has been doing so for years. People with allergies should stay far away. This deserves a one star in my book, even less if I could give it.", "pics": null}}, {"review": {"des": "i had chocolate chip milkshake --- it was reallyyyy sweet!!! i didn't really like it! <br><br>their strawberry milkshake is much better!!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3Vp3ZhIBs7nQVKyQwcErAw/168s.jpg", "caption": "chocolate chip milkshake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xXWRQ5Vwg_74GYJ6o7GXpw/168s.jpg", "caption": "tortilla"}]}}, {"review": {"des": "I have long heard how The Chicago Diner is like the ultimate in vegan variety, and that's what drew me in. However, when I walked in to hear Lady Gaga's \"Bad Romance\", was then seated immediately, followed by \"You're the One that I Want\" <br>(Grease)...and omg, then playing \"On the Edge of Glory\"...and next, \"Material Girl\"...you know no matter what, you're in the right place if you're Christina. I felt like my head would explode with the next song...and I was right since it was The Clash's \"Should I Stay or Should I Go Now?\" My brain blew all the way around that restaurant, somewhat ironically, since brains aren't vegan-- or are they since they were MY brains, and I'm vegan...hmm, that's a thinker. <br><br>So the music, definitely awesome eighties and current pop. The food, fantastic! We vegan feasted that night. I loved the sweet and spicy chili seitan wings as an app, and had all the usual heartburn I used to have with wings in the past. Worth it. And when my country-fried \"steak\" arrived, I was blown away. It was huge and looked straight out of Cracker Barrel. This is a good thing. It was served with mashed potatoes, streamed broccoli, and swimming in country gravy. If you weren't told this was a vegan entree, you never would have guessed it. It was perfect. My husband who is not vegan said he would definitely get that next time, he loved it so much. It was lacking nothing! He did however enjoy his vegan \"chick'n\" sandwich with a decent Mac and cheese. We wanted to try the waffle fries and they were good too, if not a tad on the small portion size. I'd also highly recommend the hot chai tea latte, hot, cozy and good foam, and a vegan whip, yum! I would pass on the Blue Sky root beer which weirdly tasted like an RC cola? ‍ <br><br>I loved our cutie petootie server, with his bright smile and sparkly eyes, never rushing us even though we got there late and stayed a bit past their closing. Very nice! The music made it really fun and energetic; the diner decor and vibe was adorable; and the food was fantastic! I'll be back for the country fried \"steak\" and this time I'll be prepared for some diner booth chair dancing. This place lived up to and exceeded the vegan hype, and the music was a delightful surprise for this Material Girl. <br><br>Pro-tip: after 6 pm, you can park in the very narrow side alley parking \"lot\" (really just a row) that shares the diner's exterior wall. If you blink you'll miss it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/oWpoNZ7KaRj12NUhp4SbJw/348s.jpg", "caption": "Breaded chick'n sandwich with Mac and cheese side"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3A2xosflXvbkvSgbzokLOA/168s.jpg", "caption": "Inside"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cJFeux42E4AxOadR6K0jYA/168s.jpg", "caption": "Inside"}]}}, {"review": {"des": "Yes yes yes! The Chicago Diner is amazing and I love it here! <br><br>I just moved to Chicago and I have already come to the Chicago Diner twice. It is super casual and comfy in here..really warm and welcoming ambience.<br><br>I am pretty sure that you cannot make a reservation here, but that is not a big deal. Even though it gets super busy, you usually do not have to wait more than 30 minutes.<br><br>This restaurant is vegetarian/vegan...but that does not effect the quality of the food. I love the bowl of chili, the chips and guac, and the potato skins with Mac n cheese on them! Also, this place is in a super fun area and it is not pricey! <br><br>The Chicago Diner is great for every meal and I recommend you come here!", "pics": null}}, {"review": {"des": "I had a fabulous experience at the Chicago diner! There was a wait, but it wasn't too long. They have you wait in their enclosed patio area which gave me time to look over the menu. I ended up getting the Reuben with fries as a side and added their garden salad for two dollars more. The Reuben was so good! I'm not vegan/vegetarian but this tasted like the real deal so I was happy! The fries were yummy and the salad was HUGE. My fiancé ordered the lentil loaf with roasted potatoes and green beans. We both finished our entire meal which usually doesn't happen. The tables are really close together, but it didn't bother us since the people to our left and right weren't loud. I could see where if we had been seated by loud patrons it could get annoying. Overall, delicious food and a fun dinner.", "pics": null}}, {"review": {"des": "Really great food. The Buddha Burger is a favorite. I like this location over the other, but they are both pretty good locations. You have to get an order of wings. Their milkshakes are delicious as well! Staff is usually friendly and food doesn't take too long. Definitely recommend.", "pics": null}}, {"review": {"des": "Waited for over an hour after we were told a 20 minute wait.  No apology when we came up and we're just told that someone \"line jumped\".  <br><br>Ruined our date night. <br><br>Should take better care of customers.  Won't be coming back and wouldn't recommend.", "pics": null}}, {"review": {"des": "This diner is the best place to go for staple comfort foods made with the vegetarian and vegan in mind. They have so many great dishes! One my my favorites is the buffalo chicken wings (made with seitan I believe). Also, you have to try the gyro! Bonus: the company has a very eco friendly, sustainable culture, so your dollars are supporting an earth conscious business. They also sell a cookbook which shows you how to make all their amazing treats plus some not even offered at the restaurant.  I cannot recommend this place more!", "pics": null}}, {"review": {"des": "Ten years ago, my friends and I walked out of Chicago Diner quite unhappy. The entrees just were not up to par.  <br><br>I must say, I've seen major improvements on the entrees in the past five years. Their classic and top seller is the Rueben sandwich.  Currently, I can only comment on their gluten free menu- which has a nice selection. The avocado/quinoa tostada is messy, but delicious with the cilantro sauce which accompanies it.. The portabella truffle sandwich is on toasted gluten free bread and is excellent. The sweet potatoe fries are good. The newest version of the taco salad is OK(I prefer the prior version)<br><br>And the milkshakes are the best vegan milkshakes around. Vanilla chai is at the top of my list. The cheesecake is also pretty good, although it still has that slight soy aftertaste. The cupcakes have always been pretty good- not gluten free, though.", "pics": null}}, {"review": {"des": "I ordered the Thanksgiving takeout this year. I have never eaten at the Chicago Diner and it's legendary here in Chicago.  I got the Lentil Loaf with White Truffle Mushroom Sauce. It came with roasted potatoes and green beans.  It was excellent.  I would definitely eat it again.  I also ordered an apple pie and the Wellington Dinner that I will eat tomorrow on Thanksgiving.  To eat later, I ordered a pound of the Reuben Corned Beef style Seitan and the Italian Seasoned Seitan.  I'll freeze those and save them for January when my son will be vegetarian for a month. Love the food so far and will definitely visit the restaurant to eat there.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IuecjKfCpeWmmLnaP2s3ww/348s.jpg", "caption": "Lentil Loaf with White Truffle Mushroom Sauce, Roasted Potatoes & Green Beans from the Thanksgiving carry-out menu - delicious!"}]}}, {"review": {"des": "Have been a few times in the past several years. It's a Chicago staple, and probably was a bit ahead of its time, but also remains relevant, especially with the increased focus on plant-based eating.<br><br>It's often crowded, and I'm not a huge fan of waiting, but thankfully, a wait doesn't always accompany a meal. <br><br>The shakes don't taste plant-based, but I personally can't digest that much richness in one sitting. I usually taste a few sips or spoonfuls of friend's shakes, and am not disappointed.<br><br>For non-meat, it's solid. You'll pay more than if you were to go to a generic meat-serving place (expect $15/$20 a person), but CD isn't generic (and that's also comparable to its competitors). There are a lot of healthful and innovative options, and for that, Chicago Diner gets 4 stars.", "pics": null}}, {"review": {"des": "This restaurant its great for Vegan and vegetarians like me . I even brought my husband and he only likes meet and he enjoy there food as well . <br>a most to visit next time in Boystown .", "pics": null}}]}