{"name": "the-crepe-shop-chicago", "reviews": [{"review": {"des": "This was the best breakfast I have had, went there with my friends, I had turkey spinach crepe and Nutella late. It was delicious. <br>The place is small but very comfortable and nice, service is pretty fast . Perfect place to enjoy awesome food with friends. <br>Can't wait to come back.", "pics": null}}, {"review": {"des": "I think I'm in love!<br><br>Barely a year old, this tiny little shop on Broadway is rocking the crêpe game. I like to consider myself somewhat of a professional when it comes to crêpes -- I lived in Paris for almost a year, and I've been making crêpes at home since I was little. On my first trip to France, I brought a crêpe pan home with me in my suitcase. But even given all of that, The Crepe Shop exceeded my expectations! <br><br>Yes, it's Americanized, and yes, it's a tad pricey. But at $6-9 per crêpe, they're both a generous size and have so much filling that you really get your money's worth. While flavors such as \"blueberry cheesecake\" sound a little wild (and non-traditional), I ordered it on a whim and it was SO good. But what really makes this place amazing? The gluten free crêpes! I can't tell you how many years it's been since I've been able to eat a crêpe out at a restaurant, and from my experience, they're celiac-safe.<br><br>I can't wait to come back here again and again! Next up on my list to try: Nutella with strawberries.", "pics": null}}, {"review": {"des": "Wonderful little place in Lakeview. The crepes were light and fluffy - very delicious. My friend and I shared three crepes: the honey truffle and the turkey spinach for the savory and the matcha for the sweet. The honey truffle and matcha were my favorites but the turkey spinach is fine too.<br><br>Would definitely go back and hope to try their coffee next time too!", "pics": null}}, {"review": {"des": "This darling cafe succeeds in crepes and espresso. The menu is located on the wall or at the register. Order at the counter and then the food is brought out to you. Atmosphere is cheery, stylish. Tasteful decorations. Artisan menu.<br><br>I went during a warm summer evening. The breeze from the outside wafted through the small interior (just as I am sure the pastry aroma was wafting out onto the street). Waft, waft, waft. A whole lot of wafting. The walls were decorated with a beautiful neon sign and a lively wall planter. Intertwined edison bulbs highlighted the ceiling. This place is a mere image of Pinterest or Etsy. <br><br>The crepes are prepared as an artform; aesthetically pleasing to look at and even more to taste! Savory and sweet crepes here. I chose the Fromage A Trois ($8 fontina, parmesan & mozzarella--- huge portion for the price, rich, fresh ingredients, and filling. yyuuum). You can tell that the ingredients are hand selected... with love. I also ordered the Wild Berry Cheesecake ($9 blueberry, raspberry, blackberry coulis and cheesecake filling --- fruity, fresh, and so sweet 10/10 would order again). <br><br>I love that this place is open in the morning and evening. The smaller menu moves the spotlight on more intricate ingredients. I can't wait to see what crepes they add to the menu next.", "pics": null}}, {"review": {"des": "I've been in a review writing rut, but leave it to The Crepe Shop to inspire words of deserved praise!<br><br>My boyfriend had wanted to try The Crepe Shop because he loved how quietly tucked away it is on the always bustling Broadway. Plus eating crepes is a lovely throwback to our first date :)<br><br>It's very small, with two long farmhouse type wooden tables that could seat about 8 each. The guy that took our order was extremely helpful in helping us decide which crepe to try. We both wanted sweet crepes, so my boyfriend ordered the Nutella with bananas and I ordered the Matcha Made in Heaven. Their coffee drinks sounded devine, so I ordered the Bourbon Vanilla Bean latte. <br><br>Let me tell you, the Matcha Made in Heaven crepe was fantastic! It was made with Matcha, mascarpone , pistachio, and strawberries. And I love how they served my latte in a snifter! You could taste the vanilla bean so well without it being too sweet. The portions are generous for such quality food!<br><br>The decor is minimal, cute, but very welcoming. You can tell they want to make great crepes and great drinks and put real thought into the ingredients and presentation. <br><br>Another highlight is their fantastic customer service. Really, a friendly bunch!<br><br>I am definitely planning to go back to try their other crepes and espresso drinks!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5XloYWeZzqn4D3Wj7oHtNQ/168s.jpg", "caption": "Matcha Made in Heaven crepe!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/l5IcW-VKqvDTMLuGZmGVCQ/168s.jpg", "caption": "Frothy iced cold vanilla bourbon bean latte!"}]}}, {"review": {"des": "Their lavender latte.... oh my GAWD.  So delish!!  They will get you hooked.  Highly recommend going here.  The ambiance is very warm and comforting and the people at the counter are so friendly and welcoming.", "pics": null}}, {"review": {"des": "The place: It's small. Unassuming. Perfectly tucked away on broadway. Service was solid and helpful. It's a pretty casual place, but has a really interesting menu.<br><br>The taste: This time, we got the lox crepe, the honey truffle crepe and a french lavender latte. I was a tiny bit sad that they didn't have skim milk, but I made do with 2%. I pretty much inhaled my crepe and coffee and also kind of wish it was socially acceptable to get a flight of crepes. I definitely left full, and was also really glad to be able to eat outside.<br><br>My face: A smile with chipmunk cheeks full of crepes. My friend was a doll and treated me as a belated bday present, so I don't exactly remember the total, but I'm guessing around $30 for 2 crepes, coffee and tip. Worth it. <br><br>Can't wait to try another crepe and soon.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ka9utt6v4XXgb-m-A2eQbQ/348s.jpg", "caption": "Honey Truffle Crepe"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oiguQlaPAqLoGRx7xyG4GQ/168s.jpg", "caption": "lox crepe with an egg on top"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5t9iUGSmsi8cJJUz97UlWg/168s.jpg", "caption": "French lavender latte"}]}}, {"review": {"des": "Let me start by saying that the staff here is incredibly nice and accommodating. Came in and tired the ham and swiss crepe with a fried egg on top. Pretty good far as favor however I cant help but feel the taste needed something more. Other than that the reason why I only gave this spot 3 stars is because i feel they  need hair nets while cooking because my husband found a hair in his meal, and the complimentary water they offer is really warm and difficult to swallow.", "pics": null}}, {"review": {"des": "We came to the Crepe Shop because of the 5-star average of its Yelp reviews.  These reviews were based mainly on the shop's dessert crepes, but we had come for a savory lunch.<br><br>When our orders came out, I was surprised that the crepes were made with wheat flour, rather than buckwheat flour (which is traditional for galettes -- see <a href=\"/redir?url=https%3A%2F%2Fen.wikipedia.org%2Fwiki%2FGalette&s=617a7f693c8a3b3552294f8b24baa1335e2e9dd2c80457fd73053ec1180ec5d7\" target=\"_blank\" rel=\"nofollow\">en.wikipedia.org/wiki/Ga…</a>).  My ham and cheese crepe was not awful, though its quality was way below what I encounter in my home town (which is in California, not France).  My crepe seemed to be laced with béchamel.  SR's cheese crepe was not a big winner either.<br><br>There's a \"no public restroom\" sign behind the kitchen, which I interpreted as meaning \"restroom for customers only\".  Actually, it means \"restroom for employees only\" -- sad!  If you were hoping to wash your hands, you can make do with the hand sanitizer that's just inside the door to the restaurant.  For other restroom needs, you need to go elsewhere on the block.<br><br>I've definitely seen better.  Two stars.", "pics": null}}, {"review": {"des": "Wow so good! Just had a ham and cheese with egg and wow it was amazing and the Nutella latte iced hit the spot!", "pics": null}}, {"review": {"des": "Tight little crepe shop with comfortable seating. Very efficient.  Very concerned that all is great with your meal.  Had a lox crepe which logically came cool, not hot--surprised me, but I shoulda known.<br><br>Had a latte and that was great.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WzN1IziUY04jvep8U4VZzg/168s.jpg", "caption": "Sunday delight!"}]}}, {"review": {"des": "I am biased to anything crepes and deep down I'm a Francophile. First the ambiance, its hipster with just a touch of bougie. The sound system is amazing. The place is small but pretty pictures won't capture, it visit the place. The crepes come out and are presented pretty. I had the sugar and butter, you can taste the honesty of just the crepe in this dish. Then we had the Matcha made in heaven - it was green, like... well matcha if you like matcha. You will like this one. And last the Biscoff. It was good and in any other place this Biscoff would be way above average. This is probably my favorite crepe place because of the texture of their crepes. It's not over cooked. <br>I'm here again 071318 at 8:50 and Benjamin<br>Made me feel welcome even though I came 10 mins before closing and we ate in. I love this place 5 stars", "pics": null}}, {"review": {"des": "Came here on a Wednesday morning. I would recommend you coming during weekdays. This restaurant is truly a hole in the wall place. And I can see it get really packed during weekend. <br><br>We basically ordered everything that we wanted from the menu. What a dream lol. In general, the savory crepes had a richer flavor profile.<br><br>Promise me you will add an egg to the ham and cheese. And you have to eat it when it's hot. When you cut into the crepe, you would have runny yolk and gooey melted cheese. Imagine that together with the ham. Simplicity is beauty. FOR REAL. <br><br>The lox one was honestly the one that I had the highest expectation. The combination of herbal infused cream cheese, caper, and salmon really made a melody. But be careful, don't get too many caper in one bite. It's really, really, really salty. Don't ask me how I know that hahaha. <br><br>Among the sweet crepes, my personal favorite was definitely the wild berry cheesecake one. The tartness from the blueberry and raspberry coulis perfectly balanced out the richness and sweetness from the cream cheese filling. It really tasted like a treat, while not feeling guilty when indulging into it. <br><br>Everything on the menu sounds delicious. Will come back and conquer the rest of the menu items!", "pics": null}}, {"review": {"des": "This is a nice little crepe shop with all kinds of drinks and crepes!  <br><br>The crepes are pretty big with a nice presentation and even better taste.  It is big enough to be able to comfortably share with someone else after a nice meal.  <br><br>I tried the matcha crepe, which was delicious!  I also opted in for the Nutella latte which was also great!  Not too sweet, just the right amount of Nutella.  <br><br>The atmosphere of the place is also very relaxing and chill.  I am looking forward my next visit here and try another crepe/latte combination!", "pics": null}}, {"review": {"des": "\"Crepe diem\" is right! We just finished our first meal at The Crepe Shop, and I'm already ready for a second. <br><br>The shop occupies the space that used to be Budlong and, before that, Bunny pastries. It's small but hip, hyper-focused on what they do well (crepes and coffee), and the customer service is extremely welcoming. We just chatted up the owner for a good 10 minutes, and he checked on us regularly as we dined. <br><br>We got two drinks--a matcha latte and a Nutella latte--and both were fantastic. We also got the lox crepe, which has a delicious herbed cream, and the matcha pistachio crepe, which is earthy and floral and unlike any crepe I've ever had. The presentation and cookery were that of a 5 star restaurant. <br><br>I'd definitely try to come during the week or during off-time weekend hours, as it's a small shop with only 2 long communal tables, and I can see how it'd get busy during peak times. <br><br>Even still, this is probably my favorite new find this year, and I'd be willing to wait for another chance to gobble up one--or ten--of their crepes.", "pics": null}}, {"review": {"des": "Oh my gosh, what a little gem! Perfect for breakfast! <br><br>My friend and I each got the ham and cheese crepe with an egg on top. Amazing melt in your mouth savory creamy deliciousness!<br><br>For a drink, I got a regular latte and my friend got the lavender latter. Both were really good. They also have other interesting latte flavors like mole and rose. <br><br>The place is super cute but super small, so seating will be limited on busier weekend mornings. It's a casual order at the counter place. <br><br>Next time in the area, I will definitely be back!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-vDw_g5lyXNRYYs0wWWz4w/348s.jpg", "caption": "Regular latte"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wNKk9jIoRRge5IpbPVpPew/168s.jpg", "caption": "Lavender latte"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/caJ8BTRA2Lx3xFTjdwiAYg/168s.jpg", "caption": "Ham and cheese crepe with egg on top"}]}}, {"review": {"des": "Another  fiver for this special little joint, perfectly crafted crepes with fresh ingredients, super espresso concoctions, and obvious care about their product.  Easy, and a shame, to miss, worth the search (That little stretch of Broadway that holds such other treasures like City Press Juice, Soupbox, and Crisp, I find myself there far too often.........", "pics": null}}, {"review": {"des": "My new favorite place in the city! From excellent service to excellent food to an excellent atmosphere, this little shop is top notch.<br><br>The Crepe is a very small shop with about 16 communal seats in total. When we walked in, there were just a couple other parties so we had no issues finding seats and were warmly greeted by the staff. After ordering, they even brought everything out to us! I absolutely loved the look of the shop. If I were to design my own cafe, I'm pretty sure it would be right on par with what they've done here. <br><br>Their menu has 5 sweet & 4savory options - all of which sound divine. I settled on the Honey Truffle Crepe ($10.50) and it was beyond delicious! <br>Ricotta Cheese.<br>Honey.<br>Truffle Oil.<br>Arugula.<br>Candied Pecans.<br>YAS! All of these ingredients made a medley of food perfection in my mouth. I was so incredibly happy with it. Every one of their savory crepes sound like heaven and I plan to work my way through their menu.<br><br>They also have a great coffee menu with a couple of fun latte options - Chai & Nutella. I'm not sure if they rotate these but if you're in when Nutella is a choice, choose that sucker. It's not overpowering in the hazelnut at all and adds a fantastic sweetness to the coffee. <br><br>I seriously cannot wait to go back, maybe solo next time with a bit of work and just chill out with my crepe & coffee. I find their prices to be right on par for the quality offerings and don't have a single bad word to say about The Crepe Shop, my new love!!!<br><br>Pro-Tip: The shop is super instagrammable! Seriously is an IGer's dream!", "pics": null}}, {"review": {"des": "This place became one of my favorite breakfast place. I was looking on Yelp for breakfast-brunch in Lakeview area one day. And found this Crepe Shop with 5 stars reviews. So I took my 10 years old out to try and we loved it! First time there I tried the Mocha New Belgium and The berries cheese cake crepe. The Mocha tasted amazing! The crepe was delicious. So I went back again on weekend with my husband and my friend. I tried the Lemon crepe and the Vanilla Bourbon Bean Latte. Both were awesome too. The service was fast and the staffs (maybe the owner ) were really friendly. I definitely will go back again and again. Thump up", "pics": null}}, {"review": {"des": "Delicious crepes and lattes for $10 and under! We all agreed that the Matcha Made In Heaven crepe (a la mode with Bobtail vanilla ice cream) was really good. I absolutely loved my French Lavender Latte. They were quick and efficient, and followed up to ask how we enjoyed everything. Such a cute and friendly place to grab a quick bite with friends. <br><br>My husband got the Wild Berry Cheesecake crepe and thought the cheesecake was too rich - and this is coming from a guy who lives and breathes desserts, so I guess be forewarned that that particular crepe is not light at all. Also note that this place is very small, and probably cannot seat more than twenty people comfortably. Otherwise, absolutely loved everything and will come back again!", "pics": null}}, {"review": {"des": "This is the best of both worlds; amazing crepes and great coffee. <br>When I ordered a latte, I asked if we can sub for almond milk, and he had suggested oat milk. I thought it would be strange, but decided to give it a try. It is the best coffee I've ever had. <br>As for crepe, the selection was difficult to make. They all sounded so good, but I decided to get the butter me up with bananas. Wow. <br>I can't wait to come back again- the Nutella latte is calling my name! <br>Thanks for the great pick me up, and outstanding service! Will most definitely be back.", "pics": null}}, {"review": {"des": "So, I'm not sure if this place recently just open (like within the last two years) cause I don't remember seeing this before when I went to Crisp prior times.<br><br>But, we saw this on our current trip and decided to try cause I am a huge fan of crepes.<br><br>It's a small place, but it's lovely and intimate. They have this saying in lights that says: crepe diem. Which to me, is pretty awesome. The people working there were friendly and very helpful.<br><br>They don't have much on their menu, but I like when places have a small menu consisting of savory and sweet crepes. Because, in most cases, they do those items fairly well. <br><br>After much deliberation with the cashier, we finally went with his recommendation with the wild berry cheesecake. It delivered. The crepe had a nice texture and mouth feel. It wasn't too thick, but wasn't too thin, perfect consistency. The filling was perfect, the cheesecake was not too sweet with a touch of tartness (but not too tart) from the wild berries (blueberry, raspberry, and blackberry). It was a wonderful treat to enjoy.<br><br>I do believe that thus far this has been my favorite crepe place. However, I cannot fully give it a 5 star review because I have not fully tried the rest of their menu. But, this particular crepe that I got from there at my first trip to the place deserves at least a four star. <br><br>I will definitely go back to try their other items and maybe update my review then.", "pics": null}}, {"review": {"des": "What a delightful little spot. We came here for dessert crepes. We got the matcha made in heaven crepe and Wildberry cheesecake crepe. They both were very tasty (the crepe itself was chewy and flavorful) but I wish the flavors would've come through more. The cheesecake crepe tasted just like a melted cream cheese and jelly sandwich- which is tasty, but nothing exciting. My husband wished the matcha came through a bit more.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AqvGE5P3IAYFu2nSOX-kuQ/348s.jpg", "caption": "Wild Berry Cheesecake Crepe"}]}}, {"review": {"des": "The Crêpe Shop is a fantastic coffee house and crêpery on North Broadway with close proximity to bus stops and the CTA's 'L' light rail service.  There was indoor seating for about 16 people, and a table outside that could seat ~8.<br><br>I ordered a banana Nutella Crêpe and a vanilla bourbon bean latte; the prices were reasonable at $6 + $1 (for bananas) and $5.25, respectively.  It is important to note that cash is NOT accepted, and that there are no customer restrooms.<br><br>My vanilla latte was delicious and even had tiny bits of vanilla bean in it. The banana Nutella Crêpe was also delicious and well-presented on my plate.  It tasted like fresh batter, flavorful banana, topped with authentic Nutella spread and powdered sugar. <br><br>The owner, Marius, was cordial and we spoke for some time.  He said he frequently visited coffee shops in the past and decided to open one of his own about 10 months ago. <br><br>It was clear that Marius and his brother Peter put genuine effort into running the business; both the customer area and what I could see of the food preparation area looked extremely clean and well-maintained.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vrLmmizDustgSaQ2DoR8SA/168s.jpg", "caption": "Banana nutella crépe"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qUZ2jgG0D3fuzDCQ7FF1PQ/168s.jpg", "caption": "Bourbon vanilla bean latte"}]}}, {"review": {"des": "These guys have a cute space, are very friendly and informed, perform their skills expeditiously, and have great product. I'm looking forward to coming back.", "pics": null}}, {"review": {"des": "What a great Lakeview gem! The crepe shop has such a great atmosphere, great food, and great coffee. Seriously five stars! I had the truffle crepe and matcha and they were both absolutely delicious. I also had the citrus latte which I was skeptical about but it was really good. I like sweet coffee and this definitely was the right amount of sweet. I'll be back to try other crepes in the future", "pics": null}}, {"review": {"des": "If you are looking for some great crepes and amazing coffee, look no further. This is the place to be!<br><br>Atmosphere is relaxed and cozy. The decor is aesthetically pleasing and most importantly, it was clean. Service is top notch. The staff is friendly and attentive.<br><br>We ordered 4 crepes, so here is the break down:<br><br>Fromage a trois. 5 out of 5. Soooooo good! Smooth texture from the cheese. Added with a crunchy cheese crisp on top of the crepe. It really was my favorite!<br><br>Honey and truffle. 4.5 out of 5 stars. It's sweet and savory topped with arugula and candied pecans. It's a good balance of flavors if you are venturing into something unique. <br><br>Butter me up, sugar. 5 out of 5. If you want a simple sweet crepe, get this! Just enough of sweetness, perfect pairing with your Americano. <br><br>Wild Berry cheesecake. 5 out of 5. I love this crepe so much! It is one of my favorites. <br><br>Overall it is one of the best crepe shops I've tried. Each plate is served beautifully and you will find yourself ordering some more because after 4 crepes we had the lox. Which by the way, is 5 out of 5. Must get!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yJaQp9z6l6WDfKTsd13AWw/168s.jpg", "caption": "Best crepes in town"}]}}, {"review": {"des": "I adore this place. It is simple beauty at its finest.<br><br>The Crepe Shop is my go-to for an introspective, creative afternoon. On weekdays it is easy to find a spot to eat a crepe, drink a latte, and read a book. <br><br>The crepes are excellent! My personal favorite is the honey truffle. One crepe for 10 dollars seems expensive but I made two meals out of this bad boy.<br><br>Both their vanilla and Nutella iced lattes are delicious as well. They have a rotating seasonal coffee menu so don't be fooled by the limited options online! <br><br>Ambiance: Simple, relaxing, and beautiful. It is a small space but has outdoor sitting as well. I appreciate the industrial and hipster vibe. They always have fresh flowers. I love getting work done here.<br><br>Highly recommend! This place is perfect for taking guests, studying, and a mid afternoon date.", "pics": null}}, {"review": {"des": "Wanted a sweet snack/coffee on small business Saturday and decided to stop by the Crepe Shop. It's a small cozy place with sparse but cool decor. I have allergies and the gentleman at the counter was very patient with my questions on ingredients. I ordered the mocha new Belgium espresso drink, and wow it was delicious. I don't like when a drink is too sweet, and this had the right amount of sweetness yet still letting the richness and bitterness of the espresso through. Honestly, I go to Starbucks a lot and when I go to a small coffee shop for espresso drinks I am disappointed, but not this time. This was the best espresso drink I've had!<br><br>My family had three different crepes: the lemon curd, matcha made in heaven, and the nutella. Because of my allergy I couldn't have any and so cannot describe how they tasted, but my son is the slowest eater in the world but he ate his crepe before I finished me drink, so that's how good they were!", "pics": null}}, {"review": {"des": "Amazing amazing amazing! If you're in Chicago for a weekend, come here! The crepe just melts in your mouth. The owner Marius is super nice and always checks up on you to see if everything is okay. The decor is so beautiful and modern. The music is hip and there are different styles of it. Also, the butter and sugar crepe is just glorious! Especially right when it comes out. It's like heaven in your mouth. The seats are super comfortable. Not enough words to describe this place. It's a ten out of ten. For the coffee lovers, they serve counter culture and the beans are more affordable  than elsewhere. Definitely your go to<br>Coffee shop.", "pics": null}}, {"review": {"des": "I went here today with my sister who was visiting from TN and loved it! She is gluten free and they have gf crepes which is rare and awesome. They were really good about making her crepe before ours on a clean griddle and everyone was really friendly. The shop is tiny but modern and cute. I had a honey truffle crepe which was a perfect mix of savory and sweet, and my sister had a banana Nutella crepe which looked delicious. I will def be back! They have a matcha crepe that I need to try!", "pics": null}}, {"review": {"des": "Been craving authentic crepe, bf found this little jewel and added to must visit place while in Chicago list! went there for breakfast on the first day, and last meal right before we left and we took out 3 crepes and ate them at the airport! <br><br>Their savory are all good, but I especially enjoyed the lemon custard!!!! Devine", "pics": null}}, {"review": {"des": "Love the Lavender Latte here! I really enjoy the minimalistic feel of the shop. The menu is simple. The staff is friendly. Everything is always clean. They open early at 8. The music is fitting and cheerful, (I probably enjoy it too much) I definitely recommend The Crepe Shop!", "pics": null}}, {"review": {"des": "This is the first place we visited in Chicago. It was a small shop but very aesthetically pleasing. I love the decor...and the services was amazing. They were sooo friendly and they even gave us tips on places to see and eat at in Chicago. It was such a nice welcome to the city. We ordered the ham and cheese crepe and the honey walnut crepe (not exactly sure if that's what it is called, but it's the honey one), and a nutella latte.<br><br>The ham and cheese crepe was amazing!!! so cheesy but also filled with ham...the guy that took our order suggested to get it with egg and we did! The honey crepe was also delish! It had some greens in it so it was healthy too, and I added egg on it as well. Their crepe batter has such good flavor that I am totally craving it right now. I wish that we were able to try the sweet crepes, but since we just got there we didn't want to over eat. I also wish that we could have gone back before we left but we didn't have time. The nutella latte was okay to me, but my man enjoyed it.<br><br>Overall, a great experience here. I want some crepes now!!!", "pics": null}}, {"review": {"des": "Me and my friend came here for breakfast, she got the ham and cheese crepe $9 and I got the biscoff with bananas $8. We both really enjoyed it! It was delicious. <br>The environment is really pretty and the service was friendly . The space is really tight so I wouldn't come if you have a big group . More of a 2-3 people hangout .", "pics": null}}, {"review": {"des": "Amazing crepes and the best coffee! The service here is great! Very friendly staff and cute environment/ ambience. Every time I visit Chicago, this is on my list to go. Highly recommended!", "pics": null}}, {"review": {"des": "The ham and cheese crepe with an egg was awesome! Super friendly waiters went out of their way to make us feel welcome. Service was quick and casual. Will definitely be back to try one of the sweet crepes :)", "pics": null}}, {"review": {"des": "Super sweet people. Honestly I would come back just for them even if the food wasn't good (BUT IT IS). Also the decor is beautiful. Fresh plants hang from the walls and the natural light is plenty. Also the plates they use to serve the crepes on are super cute looking. <br>The seating is a little weird in that there's only one long bench for one side of the table so if it were really crowded there would be a lot of awkward shuffling, but I came when it was nearly empty so it was fine. <br>For the food I saw the nutella latte and immediately had to get it. This girl easily has the biggest sweet tooth of all time. Did not regret that at all. I was 100% on board with only drinking nutella lattes from this point onward. We also got a Honey Truffle crepe. I was a bit hesitant to not get a sweet crepe, but this pairing between the sweet drink and savory crepe was so worth it. Every bite of the crepe was perfect. This could go down in history as the best crepe place in Chicago.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Qbmxu6yG35aq4hOANeXQlg/348s.jpg", "caption": "Crepe diem indeed"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uvJXiWO-niQMASpINakpAQ/168s.jpg", "caption": "Fresh plants"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rSA7cVOMsPYD3t0olrjJeA/168s.jpg", "caption": "Nutella latte"}]}}, {"review": {"des": "oh my goodness....so this place happens to be right next to one of my favorite restaurants, crisp! so happy my friends and i decided to give it a try.<br><br>love the interior...oh and their butter me up sugar crepe is AMAZING!!! and if you complement it with an iced chai, even better ;) we also tried the cheesecake one and it was good but not as good as the butter me up sugar. 5/5!!! <br><br>must. come. back.", "pics": null}}, {"review": {"des": "Deeelicoous!!!! Cute place. I would recommend getting a drink and crepe. They offer sweet or savory seasonal menu/options. We tried the Lox (smoked salmon, cream cheese, capers, tomatoes, onions) and the Wildberry (sweet cream and berries).", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PphY_2542ZGDuwCt0YFZ6g/168s.jpg", "caption": "The Lox"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/F_c6uEoWGmdZ74V4RBmPGg/168s.jpg", "caption": "The Wildberry"}]}}, {"review": {"des": "Wandered in yesterday for a light breakfast a few hours before hitting the airport. The vanilla bourbon latte was amazing & the crepe was out of this world. Between the great dining experience & getting a chance to get to know the awesome staff, I can't wait to go back.", "pics": null}}, {"review": {"des": "Needed something sweet after dinner but not too sweet; Crepes all the way. Had pretty high expectations walking into The Crepe Shop reason - 1. New Restaurant & 5 Stars 2. I just have high standards for Crepes. <br><br>When I walked in I was very impressed by the layout of the restaurant, very minimalist interior yet aesthetic and appealing to the eye. Their menu is basic around 8 Crepes. Half savory, half sweet. <br><br>Food - Went with the popular house recommendation Wild Berry Cheesecake Crepe. Good amount of ingredients in the crepe, not too sweet not too bland.  Filling consisted of blueberry, raspberry, blackberry, cheesecake creme. <br><br>Pricing - Reasonable pricing for the quality of crepe you get. Crepes normally run me around $5-$10 per. Crepes here were same price. <br><br>Service - Order and pay at the counter + self seat. Employees took effort to chat it up a bit with us and recommended other crepes for future visits. Definitely will be back to try other crepes. <br><br>Parking - Lots of meter parking, might have some difficulty finding parking during peak hours.<br><br>Overall - Love the minimalist design/interior. Definitely will be back to try their other crepes. Highly recommended.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ouVuh6wtHKsxYfip629MSQ/348s.jpg", "caption": "Wild-berry cheesecake"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/c_IWkrMUVfWunaAP4sVUEw/168s.jpg", "caption": "Interior decor"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PIdHdCKGEBenei6pu7xk_Q/168s.jpg", "caption": "Interior shot"}]}}, {"review": {"des": "Such a great place! Hubby and I have come here a few times for breakfast and every crepe we've had has been excellent! <br><br>Coffee is good- they have counter culture beans you can get also!! They do pour overs or drip coffee. There's also a selection of interesting lattes(lavender, honey, etc)   The take coffee seriously! <br><br>Service is great too- the cashier and servers always make time for a kind word or two- very friendly and welcoming! <br><br>I highly recommend coming here!!", "pics": null}}, {"review": {"des": "YUM SERIOUSLY YUM. Was perusing Broadway for some brunch, and stumbled onto this place and holy shit were were in luck. My partner and I split the ham and cheese, lox, and nutella crepe (for dessert...duh). Everything was FANTASTIC and may I personally recommend the nutella latte if you want to treat yourself.", "pics": null}}, {"review": {"des": "This is one of the best coffee shops I've been to. The vibe in this place is just so peaceful and the seating is really unique because of the small space. Not only are the drinks and crepes the most aesthetic things you've seen, but they taste amazing. I had a Nutella latte and the strawberry Nutella crepe. None the less, I love Nutella, so it was good.", "pics": null}}, {"review": {"des": "Super cute little restaurant in a great Lakeview location! The space is small, with communal seating, but the lighting and simple flowers on the tables made it a cozy atmosphere, especially on a rainy fall day.<br><br>A friend and I stopped in for breakfast today, she optioned for the savory ham and cheese crepe and I had the sweet nutella crepe with added strawberries. I had a hot tea but they have a good selection of coffee speciality drinks as well. Both our selections were delicious, and service was fast and friendly. I thought the prices were reasonable for the area, and I would definitely return! A good breakfast friend or romantic date spot", "pics": null}}, {"review": {"des": "Everything was so good! My friend and I got the matcha, salmon, lemon and cheesecake crepe. The cheesecake and salmon crepes were our top favorites after trying each one. The rose latte I got was also very well done. On top of that they had really nice lighting for pictures hehe! I highly recommend this place.", "pics": null}}, {"review": {"des": "Decent crepes, quick counter service. <br>Nothing out of this world. We got the biscoff crepe (nothing special) and the berry cheesecake (also, nothing special). In my experience, it didn't taste like cheesecake but the crepes were well presented. <br>I found the texture of the crepe to be good but again, the taste was underwhelming. When compared to iguana café, this place is severely lacking. <br>Staff is really nice and environment is fine. Pretty casual. The booth-like seating against the wall is already pretty run down considering they haven't been open terribly long. <br>Maybe they should invest in better quality seats.", "pics": null}}, {"review": {"des": "Continue with the 4 star streak...I visited again last night and the staff was different.  This time when I said I had a gluten allergy they asked if I would like them to wipe everything down.  Even though they are not Celiac safe, they do take every precaution they can.  I really appreciate it!<br><br>This time I tried the Butter & Sugar crepe and it definitely competes with the Lemon Curd.  I do wish there was a little more filling inside the Butter & Sugar, but would not hesitate in ordering it again.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WiLZVw-9BISD1BDCYwR1Jw/348s.jpg", "caption": "Starting at the top: Nutella strawberry GF Matcha GF Butter & Sugar Biscoff banana"}]}}, {"review": {"des": "If you want to have a nice crêpe , I would recommend this place. Matcha crêpe is so good and latte coffee. They have a very tiny patio but it's cute. Service is nice", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/AqxGDRY0SUUTzAO-3MMTGw/348s.jpg", "caption": "Matcha crepe and Latte"}]}}, {"review": {"des": "The perfect people watching spot with your little pooch companion. I've had crepes in a lot of places around the world and I can't recall ones tasting better than these. Flavor, presentation and friendly service was second to none. Worth the drive from Washington DC to Chicago", "pics": null}}, {"review": {"des": "I can't wait to go back to this place, it is seriously so good! I had a matcha crepe with a lavender latte, my friend had the cheesecake crepe and vanilla bourbon latte, and my other friend had the honey truffle crepe. They were all fantastic! The owner of the restaurant was there and he was very helpful and friendly. The prices are all reasonable, and they even have a gluten free crepe option! It's small, but we had no trouble finding a spot to sit, and it had a great ambiance!", "pics": null}}, {"review": {"des": "Amazing! Had the Honey Truffle and Wild Berry Cheesecake, both gluten free. Best crepes I've ever had (gluten free or regular)! Filling was plentiful, and batter light and fluffy. Also had the Mocha New Belgium coffee, and it was both beautiful and delicious. Smooth and only slightly sweet; perfect!", "pics": null}}, {"review": {"des": "Saturday morning I decided to check out this little cute crepe place around the neighborhood I stayed for layover. The place is really neat and adorable. I ordered lemon curd crepe and a small latte. The coffee and food are both amazing!!! I was probably the first one of the day, and I had an awesome conversation with the guy over there at the shop. Really friendly and down to earth! I would suggest this place for sure if you ever around the neighborhood.", "pics": null}}, {"review": {"des": "I legitimately would have walked by this place without even seeing it if I didn't take a closer look. This place is a cute and quaint coffee bar and crepe bakery with seating for about 15-20. I probably wouldn't pick this place for brunch for a crowd or anything, but it's a good place to bring a few friends/family in town and maybe a brunch date. <br>The coffee is fresh and the crepe choices are great! I don't think you could order wrong here, no matter what you got!", "pics": null}}, {"review": {"des": "I had to wait to finish my food before writing this because everything was too delicious to let sit. I love using Yelp, as it helps travelers find hidden gems like The Crepe Shop. Although small, it's big enough to hold 16 people comfortably in its community seating. Staff were super polite and place was clean.<br>I ordered the Fromage A Trois with an added egg on top and a Nutella Latte and couldn't of been happier with my choice. <br>I recommend coming in, even if it's for a tasty Butter me up Crepe.", "pics": null}}, {"review": {"des": "We recently came in to the Crepe Shop for breakfast munchies. It was on a rainy Sunday and it wasn't too crowded inside, but seating is a little limited. The menu is pretty straight forward with a few options for sweet and savory crepes. We shared a few of them: honey truffle + egg, wildberry cheesecake, and biscoff (speculoos). The honey truffle was our first bites and it was delicious - really hits the spots if you're craving something savory. We also added an egg for some extra protein deliciousness. Our next crepe was the speculoos. We were hoping that it was the cookie butter (actualy crumbles) but it was just the spread - but it was still tasty and creamy delicious. Our last one was the Wildberry cheesecake - hit the sweet spot! 3 crepes doesn't sound like much but shared between 2 people, we got pretty full and didn't get to finish our cheesecake crepe. The employees here were pretty friendly. The guy making the espressos came over to us and chatted about our meal a little bit - super friendly and nice service. Definitely worth grabbing a meal here!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/63H8KfOjXs3Y3yAhHMzK7g/348s.jpg", "caption": "Wildberry Cheesecake"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Gt25o9B5JnFrbd8DxLCR1A/168s.jpg", "caption": "Wildberry Cheesecake"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/b9ZCZNAFtxhCsOO7BrFQYQ/168s.jpg", "caption": "Honey Truffle with egg"}]}}, {"review": {"des": "Great great great place <br>Been there multiple times and I was never disappointed <br><br>Have tried the Nutella and the lemon and the wil berry <br><br>Very very good and the coffee was great <br>Would very much recommend and suggest you go", "pics": null}}, {"review": {"des": "My heart goes zoooom One of my fav place in Lakeview They make the best crepes in the city.", "pics": null}}, {"review": {"des": "I came here on my visit to Chicago and ended up going back 2 days later! The first time I came for dessert and had the berry cheese cake crepe with a Nutella latte.... yummm. I was surprised at how filling it was, the crepes are pretty big. My husband had the lemon curd, and if you love sweet lemon desserts, this is the one for you. Perfect balance of citrus and sweet with a strong lemon flavor.<br><br>The 2nd time I went for brunch. I always associated crepes with dessert and the savory menu sounded so good, I had to go back. This time I tried the lox and they did not skimp on the salmon, it was so filling! Other places Ive been to and tried something lox, it was sparse, or not fresh, and felt I over paid. The cream cheese is amazing because they mix it with a ton of herbs and its defiantly different than just plain cream cheese. My husband ordered the ham and cheese with an egg on top and I think he was in food heaven.<br><br>I will defiantly return when I come to Chicago again. The staff was so friendly and caring, and thank you Nadya for making our crepes  :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hqEMSsYWQHoFGhDp4ci9dQ/348s.jpg", "caption": "lemon curd crepe, amazing"}]}}, {"review": {"des": "My husband and I are obsessed with this place! We love coming here when we are in town. I've tried every single crepe in the past, but what's wonderful about The Crepe Shop is that they offer gluten-free options. My favorite crepe is the Biscoff, but I also love the Fromage A Trois. What sets them apart from so many places is that they use quality ingredients and prep all their fillings in house. The owner brothers are very welcoming and make you feel like family. The vibe in the shop is relaxing, inviting, and chill. If you're coming to visit Chicago, you have to get the full Chicago experience, so go check out the Crepe Shop! If you're really lucky, you'll meet the brothers.", "pics": null}}, {"review": {"des": "I stopped by the Crepe Shop for a light breakfast with a few friends. The seating area isn't too large, but delicious crepes! We each tried different crepes - Nutella with Banana, Wildberry Cheesecake, Lemon Curd, and Nutella with Strawberries! We all were very satisfied. I'd love to come back and try one of their savory ones!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZdYeyN0GWsFzvjGuS3qjvw/348s.jpg", "caption": "Nutella with Banana, $6"}]}}, {"review": {"des": "I'm so amped to have a found a creperie that actually makes a gluten free crepe. I also throughly enjoyed my bourbon coffee iced latte. Today I tried the lox crepe and it did not disappoint! I appreciated the attention to detail with the micro greens and spiraled onions :) the gentleman behind the counter and the owners are always friendly and give excellent recommendations!", "pics": null}}, {"review": {"des": "Loved it. The place is super cute- the Nutella crepe was AMAZING. The coffee was super strong and fresh - we loved it. And the service was wonderful too - two smiling faces  definitely recommend you try it out! <br><br>Edit (July 22nd, 2018) -- we have come twice after our first visit -- tried the biscoff, berry cheesecake and cheese crepes. <br><br>Biscoff with strawberries -- if you like the biscoff cookie (which is sweet) you will like this too. <br> <br>Berry cheesecake -- great for people who love fruity flavors -- the cheesecake provides a good balance of flavors. <br><br>The three cheese crepe was just out of this world! It was like pizza on steroids. So soft and cheesy! There is a layer of kind of hard cheese on the top which is just perfecto!", "pics": null}}, {"review": {"des": "I have officially found my favorite dessert spot in the city. <br><br>These crepes absolutely hit the spot! Rich, moist, and spongy- they come in a variety of flavors to satisfy your late night sweet tooth cravings, or the need for a savory start to the day! <br><br>I got the wild berry cheesecake (cheesecake and crepes.. who knew?!) Filling is made up of blueberry, raspberry, blackberry coulis, cheesecake filling. My grandma has always made the best crepes (in my very biased opinion), but I was blown away at my first time at the crepe shop. I've tried crepes around the city and haven't been left with that satisfaction and craving to go back. <br><br>Trendy neighborhood, great customer service, reasonable prices, perfect ambience and the interior design is completely on point.. but most importantly- the food was excellent! Definitely on my list to try out the rest of the crepes in the future!<br><br>P.S. They've got the coffee art down to a T!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jVcJL4BoAQJ3zIMgDpVLEw/348s.jpg", "caption": "Berry Cheesecake & Lemon Curd Crepe// Cappuccino & Chai Tea Latte"}]}}, {"review": {"des": "This place was great. Rich, perfectly drawn coffee, tender carefully prepared crepes and wonderfully welcoming owners. We are traveling and were lucky enough to try this place today. We are going back to enjoy tomorrow as well. Go if you want the best breakfast experience in the area....but also go for lunch or after if you just love crepes!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AW3Yr94ZR23RuCR7We-y8A/348s.jpg", "caption": "Affogato....yeah baby. It's all about the pour at the table and that first minute and a half of hot rich espresso and cold sweet vanilla."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/T7yxiFUB2nbJ7ObR-8Tu6w/168s.jpg", "caption": "Wild berry cheesecake...NOT TO BE MISSED!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wORUny7QEMBJkwyVsBuNJg/168s.jpg", "caption": "Ham and cheese. I added truffle oil......YUM!"}]}}, {"review": {"des": "This gem is a bit hard to find, nestled near the Tesla Supercharger. Has some sidewalk seating, but I opted indoors as the heat was too much for me. Nutella latte and strawberry sweet crepe. Wow! Service was fast and friendly. Found my new brunch place! Next time will try the Nutella strawberry crepe!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YzcKPYZTfCXnTfbLuktasA/348s.jpg", "caption": "Nutella latte and strawberry sweet crepe!"}]}}, {"review": {"des": "The matcha crepe is heaven on a plate!!! I had the lavender latte and it was so good and presented so well. My usual three cheese crepe is outstanding always!!!!", "pics": null}}, {"review": {"des": "I really meant to take a picture of the crepes, I did - but they were gone before I had a chance to remember! <br><br>I've been to the Crepe Shop several times now since it opened a couple weeks ago and I'm never disappointed. I usually start with the lox or ham and cheese crepe (which now comes with an optional egg, mmmmm) and work my way to the real magic on the menu: the dessert options. <br><br>Let's start with the Wild Berry Cheesecake, break up the mojo with a strawberry/banana nutella and finish with another Wild Berry Cheesecake. <br><br>Now that's what I call a happy ending ;)<br><br>And you're welcome.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nAowclTVZUHbN7lxjtmA_A/348s.jpg", "caption": "Sooooo good!"}]}}, {"review": {"des": "I ordered their lox crepe. I loved it! It wasn't overpowering. Just the right amount of crepe to the filling! One of the employees did suggest next time to try it with egg. They offer free cup water and they were super nice. The menu is not overpowering and I can't wait to try more crepes! My friend enjoyed their lemon curd crepe and asked for lite curd so to not be too lemony.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hnjNSO-QEg4hqH0lIaa0aA/168s.jpg", "caption": "Lox was great!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OHwMqikCQG2gDnootlEt3g/168s.jpg", "caption": "Lox"}]}}, {"review": {"des": "This is my second time to The Crepe Shop and it was just as good as the first.  The ham and cheese crepe with scrambled egg is my go-to.   The Macha made in heaven is good if you want something sweeter.", "pics": null}}, {"review": {"des": "Lovely store with a great environment. I see how much passion the owners have and it makes me feel happy to sit in their shop. <br><br>The lox that I ate had a harmonious balance between the salmon and the creme cheese. Boy, that was some good creme cheese. The lemon adds a great way to cut through the fat and brighten the salmon. My mouth and stomach are happy.", "pics": null}}, {"review": {"des": "It's a very lovely shop that has a wide range of selection for crepes. The drinks are also very good. So just be brave and try anything you want on the menu.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UO2ybF40e_S0-GAytKJFog/168s.jpg", "caption": "Traditional nutella banana crepe"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Lj0c3beSGsT8zS57gcrxJA/168s.jpg", "caption": "Very cute French latte"}]}}, {"review": {"des": "This place had some awesome crepes. The fruit one is what I had it tasted fantastic. Would go back if in the area.", "pics": null}}, {"review": {"des": "This little crepe shop blew my expectations out the water. When I say this was one of the best crepes I have ever eaten I am not lying. Made on the spot and super fresh. I even got a cool looking latte to go with, which was also delicious. 10 out of 10 for sure!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3DfDn-G9L6COzHaDVF5Njg/348s.jpg", "caption": "Berry crepe and nutella latte...yum!"}]}}, {"review": {"des": "This little place has the best customer service in Lakeview. The staff is super friendly and accommodating. They have a nice table outside so you can enjoy your crepe in the sun! The crepe tasted exactly like it should- full of nutella and fresh strawberries.", "pics": null}}, {"review": {"des": "Best crepes I ever had!Customer service is amazing!Great cappuccino!Great owner,very friendly and generous!", "pics": null}}, {"review": {"des": "The crepes are great, not really my pace, but they certainly do a good job. <br><br>The real star of the show is the coffee. They know what they're doing. From espresso based drinks to pour overs, these guys use the best quality beans, best practices and best equipment to brew an incredibly balanced and consistent cup. Delicious all around. Best coffee in the neighborhood, hands down.", "pics": null}}, {"review": {"des": "The Biscoff Crepe is so damn good! Wow! I'm coming back to The Crepe Shop to try every crepe.", "pics": null}}, {"review": {"des": "Decided to stop by for a quick snack. The aesthetic was on point. The space is small but had a great vibe to it. They had a neon carpe diem sign, they had fresh plants on the wall which I thought was a great touch and they had overhead fairy lights. The people working there were very friendly and nice. <br><br>We ordered two different crepes, one savory and one sweet. We ordered the ham and cheese and the wild berry cheesecake. Of the two, my favorite was the wild berry cheesecake. The ham and cheese crepe, in my opinion was not too special. I mean there is not too much you can do with a ham and cheese crepe. The wild berry cheesecake crepe though had great flavor. It was sweet but not too sweet. The berries had gave it great texture and the cheesecake part gave it a great tart flavor. Overall, if you're in the Lakeview area looking for a dessert of a snack, I would recommend stopping and checking out this place.", "pics": null}}, {"review": {"des": "I'm in love with this place.  Lovely decor, owner was charming and the crepes are amazing.  Our trio shared the ham and cheese and the lox crepes from the savory side of the menu.  From the dessert side we shared the berry cheesecake and biscoff with strawberries.  Are there adequate words to describe how delicious they were?  The crepe itself was perfection and the fillings were fresh, balanced between sweet and tart - just delicious! We accompanied them with mole latte, delicious with just the right amount of heat.  Will be back for sure.", "pics": null}}, {"review": {"des": "I came here at 8AM on a Saturday. I got the honey truffle crepe with an oat milk cappuccino. The crepe was phenomenal. Everything tasted amazing and it all went so nicely combined together. I hope I can try other crepe variations they have in the future!", "pics": null}}, {"review": {"des": "Delicious crepes, love the unique combinations they have! We had 3 different types (the gluten free versions) and they were all amazing, will definitely be back!", "pics": null}}, {"review": {"des": "Seriously impressed by the nuances of this crepe shop! Their attention to detail and quality is evident throughout. I was extremely impressed by the coffee, serving single origin espresso with the latest gear and a friendly barista who is knowledgeable in geek coffee world! The buttery crepe is insane simple and good, and the lox is fancy and always check the specials!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CcmUhnk7Ota_qpM32s2TSA/168s.jpg", "caption": "Nothing like some late night crepes and coffee! Solid cortado and butter crepe is my go to!"}]}}, {"review": {"des": "This place is so cute! So trendy and esthetically pleasing. Very clean and small and the crepes were so yummy! Everything from the vibe inside, to the presentation of the food, and the friendly workers made for such a pleasant experience. New fav spot to get crepes!", "pics": null}}, {"review": {"des": "One thing I really love about this place is that their batter isn't sweetened for the savory crepe so you get to experience an actual savory crepe instead of feeling like you are eating a sweet crepe with meat. <br><br>With that being said, I'm not really a fan of their \"cheese cake\" crepe. It's a very misleading name lol while I love cheese cake, I hate creme cheese, and their cheese cake crepe is just hot creme cheese. That tho, is just my personal opinion and my preferred flavor profile is definitely different from a lot of people. <br><br>The savory one taste nice, but a bit too bland... well not bland but it's hard to say, just felt like it's missing some flavor. A very uniform texture and flavor. Which taste good, but could be made better if they can think of adding a little secret ingredient or something lol maybe pickled jalapeno in the ham and cheese crepe? Could be fun to experiment. <br><br>Very friendly staff for sure. Thinking of going back and try other flavors", "pics": null}}, {"review": {"des": "Yummy crepe and vanilla latte. Beautifully presented.  Almost stopped and had breakfast at Starbucks but decided to try something different. And I'm glad I did.   Love the atmosphere and vibes.", "pics": null}}, {"review": {"des": "I came here today with friends and we tried them all! 5 star crepes- not too sweet- all are flavorful and perfectly fluffy! Be sure to talk to the co-owner, Marius!", "pics": null}}, {"review": {"des": "BEST CREPE I'VE EVER HAD! Flawless texture. PERFECT flavor. Lord help me, I've found this place!", "pics": null}}, {"review": {"des": "I've lived down the street for about 6 months, hadn't found the time to stop in until this past weekend. <br><br>I stopped in right before close to get some coffee after dinner with my best friend- and I'm glad I did. The barista, Eric, was probably one of the most talented baristas I've ever met in my entire career in coffee and is probably one of the most badass baristas I've had the pleasure of speaking to. Seriously, like I know a lot of people might be reading this like, \"was it really THAT good...\". Let's just say the barista is an artist, and the cup was the man's canvas. <br><br> So, now I'll be stopping in as frequently as possible- you should too.", "pics": null}}, {"review": {"des": "Best crepes ever!!! I have been here several times already, and will keep coming back. The place is super nice and clean, and the staff is the best. Peter and Marius, you guys are awesome! I have had the wildberry cheesecake, Nutella strawberry, biscoff with strawberry, lemon curd, three cheese and ham and cheese. All were so good, but the berry cheesecake was by far my favorite. If you don't know what to get, get the berry cheesecake. You will not be disappointed! Their coffee is great too. I had an iced Nutella latte last time and it was amazing. Can't wait for the seasonal flavors of crepes and coffee to come out! I'll be back soon!", "pics": null}}, {"review": {"des": "Delicious BISCOFF crepe! Blows Nutella out of the water. Ham, cheese, and egg was delicate, savory and delicious. Staff was helpful and super friendly.", "pics": null}}, {"review": {"des": "Absolutely the best Mocha I've had so tasty. Excellent coffee and cappuccinos. Have not tried the crepes. Highly recommend. Very good service too.", "pics": null}}, {"review": {"des": "Every time we come, we get the best possible service - the guy at the counter makes everyone feel welcome, and the guy making the coffees always asks how we like them. Really feels like a place that cares about its patrons.<br><br>To top it off, the crepes are delicious. I'm obsessed with the one that has honey and truffle oil. Definitely one of my new favorite places!", "pics": null}}, {"review": {"des": "At a loss for words with how great this place is. Living in Paris, my crepe standards would be considered critical to say the least. With this in mind every crepe I've had here has delivered to expectations. Sweet or savory you simply can't go wrong. The coffee though is what turns this place from a weekly pleasure to an addiction. The lavender latte is an a must. Top it off with great service and owners who are involved and interact with the guest you can easily feel at home here.", "pics": null}}, {"review": {"des": "The Wildberry cheese cake is so awesome. It's really different from the normal cheesecake.The Wildberry blended with the cream cheese is so tasty. Everyone who wants to visit can't miss this!!", "pics": null}}, {"review": {"des": "I love this place! The most delicious crepes! Last time I went there I had the Honey Truffle one and it was soo good. The staff is nice and friendly.", "pics": null}}, {"review": {"des": "Man I took a picture of breakfast and somehow deleted it... you'll just have to take my word that the food is awesome.<br><br>Showed up on Sunday morning around 10 and there were some open spots at the shared long tables. My boyfriend and I debated about sharing but I didn't want to share my savory crepe for a sweet one! We both got the ham and cheese and added a friend egg. The crepe also comes with Dijon mustard inside. We also ordered Nutella lattes. Wow- everything was really phenomenal!! I didn't really go with any expectations I just wanted something faster than a table service breakfast, and was so happy that we ended up here. We gobbled every last bite of both our crepes, and the lattes were perfection too!! Will absolutely come back here again.<br><br>Also- that staff was super friendly and attentive. The barista had a 7yr old audience and was explaining how he pours the designs- so cute!", "pics": null}}, {"review": {"des": "The Crepe Shop is the perfect cafe to meet your close friends for brunch and enjoy high quality, delicious crepes and coffee drinks. Although a small place, people tend to only stay for about 30 min so the wait is not too long for a seat.<br><br>For food, my friend and I had:<br>- Lemon Curd Crepe: amazing homemade lemon curd with poppy seeds. Absolutely delicious and not overly sweet.<br>- Ham & Cheese Crepe: large crepe filled with ham, cheese, fontina, mornay sauce and dijon. Yum!<br>- Honey Truffle Crepe: my absolutely favorite! The combination of truffle oil with the fontina cheese was to die for. I would order this one again and again.<br>- 2 lattes: high quality, nutty flavor, very good!<br><br>The staff here was extremely helpful and friendly. They have only been around for about 5 months and I wish them all the luck in the world! Looking forward to when they open up a spot near me in West Town.<br><br>Well, well done The Crepe Shop!", "pics": null}}, {"review": {"des": "I love this place! I've heard about it so many times from friends and family, so when I came to town, I had to see if it met my expectations. Let me just say, it has reached and exceeded my expectations! My favorite crepe is the Wild Berry Cheesecake. But I also love Nutella with strawberries, Lox, and my wife goes bananas for the Biscoff. I've been here three times in one week and each time I leave feeling satisfied. Thank you for this great addition to the Chicago experience!", "pics": null}}]}