{"name": "the-crab-pad-chicago", "reviews": [{"review": {"des": "1st time trying The Crab Pad  and we got delivery.<br><br>-Delivery arrived very quick (around 25 min if that) and came hot!<br><br>-food was very good<br><br> -Ordered 2 lobster tails, a 1lb bag of headless shrimp, calamari, 2 biscuits, 2 corn, 3 potatos x2. <br><br>We got the lobster in the garlic butter it was tasty. <br>The shrimp in the cajun seasoning. We chose mild. We eat hot food but the mild was super hot. I think its because there was TONS of GARLIC..if you dont like garlic than request no garlic if its possible. Its alot.<br><br>The portions for the shrimp and lobster tail were legitimate for the price. <br><br>The portion for the calamari was probably the smallest portion ive seen for calamari. Although the calamari was very good especially for delivery we wanted more lol.<br><br>The biscuits were only okay. Id probably skip on the biscuits they just crumble way too easily. <br><br>Overall it is a tiny but pricey but seafood always is. Its definetly a nice change to order seafood vs pizza for delivery.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xpjM4ZnmjXl_y4BSB5eu2A/348s.jpg", "caption": "Half of one order (half of 1lb) of headless shrimp"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Q0UvHWDrfu8cP42BWWYzaw/168s.jpg", "caption": "Half of 1 order of calamari plus sauce (not much)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iALyRqBoAl4YVDI5L5U4yg/168s.jpg", "caption": "Lobater tail corn and potatoes"}]}}, {"review": {"des": "This place is really awesome - and I don't just mean the food, which is delicious. I mean the messy, eat-on-the-table (with your hands), drink-from-a-bottle, caveman happiness that makes you feel like a 7-year-old. A good place for large groups, too. Will definitely revisit. Didn't get a chance to try the king crabs - want to do that next time.<br><br>Well deserved reputation!", "pics": null}}, {"review": {"des": "I had heard that this place was similar to Angry Crab without the wait, and after trying it, I can confirm that's true! <br><br>My boyfriend and I came for dinner on a Saturday night. We made a reservation but didn't need one. <br>We shared mussels, clams, and king crab legs in crab pad style sauce. Our order came out quickly, warm, and tasty. Three pounds was more than enough food for two people. It's pretty messy, as these places typically are, but they'll give you a roll of paper towels if you ask. They'll give you a bib even if you don't ask. <br><br>Prices were reasonable, but a little higher than expected. It's BYOB though, and they didn't mind when we sat for a little while after our meal and finished our drinks.", "pics": null}}, {"review": {"des": "I'm a bit obsessed with seafood and love the boil experience.  Crab Pad is a fun BYOB with lively music.  There's a liquor store a few doors down if you show up empty handed.   Food was incredible, make sure to get the mussels and garlic noodles, delicious!  The crab pad seasoning is the best in my opinion.  Warning the medium has a lot of heat. I like things spicy but it was a bit too hot for me.  I'd recommend the crab pad seasoning mild.  The atmosphere is very casual and laid back.  Love the murals! Staff was very friendly and patient as we tried to figure out our order.  They also make their own ice cream.  I didn't try it but my friend did and said it was really good.  I was too stuffed so next time!  Cant wait to go back to this spot!", "pics": null}}, {"review": {"des": "I was excited to try this place for it's second anniversary because they had $2 specials. <br><br>I wanted to reallly love this place, but I couldn't. The food took a while to come out, but that's happened before at other places. The wings took a bit longer. It was okay because the wings were really juicy and good. Although, the lemon pepper ones were too sour. The thai and mango habanero were the best tasting.<br><br>They give a LOT of fries but seasoning like garlic is extra cost. They didn't taste bad though.<br><br>The fresh tea lemonade flavored with peach adult capri sun tasted a little off almost like it wasn't sweet enough or something. I can't put my finger on it but there was this bitterness that made it so hard for me to finish my drink but I wanted to try a different flavor. Plus, when I got mine I actually got wayyyy less inside than a couple of other people at my table. Kind of disappointing.<br><br>We got the Crabpad sauce which was just okay. I thought mixing all the sauces would be an awesome like other cajun places I have been, but this sauce was underwhelming. It didn't help that we got ours in a small bag so we ended up having to dig around the crab legs to get to the small clams. I can say that the crab legs broke very easily when I used my hand to break it and the meat stuck together inside!!! Impressive cooking for that!<br><br>The one thing that I found was weird was that my boyfriend and I got a small bag for 1 pound crab, 1 pound clams and 1 pound crawfish but my friends sitting across from me got a bigger bag for half pound shrimps, 1 pound clams and 1 pound crawfish. They got less, but we got a smaller bag and it was hard to dig around.<br><br>I think it's cool that they have Milk and Wood inside. They had unique Asian flavors like Ube, green tea kit kat, pandan, etc. I tried the green tea kit kat and it wasn't bad! There's a big piece of kit kat inside which is a nice bonus.<br><br>I think it's a cute concept, but it sucks that the ice cream bar was behind our table the whole time. We had to wait to get up which sucked especially when I wanted to go wash my hands. I had to sit and wait for people to finish getting their toppings and most people don't notice they are standing in the way.<br><br>Another thing that made the experience kind of surprising, and ultimately brought my review down, was that one of my friends spilled his full cup of water on the table and floor and NO WORKER CAME TO HELP. I was surprised a waitress just walked behind and around him to get to her table. I'm sorry - I wanted to like this place, but damn no one said anything along the lines like \"oh I'll be back with a mop\" or anything to acknowledge it. So I am disappointed since I thought yay! another possible go-to cajun seafood place.<br><br>Overall, I think it's an okay place. I, honestly, wouldn't go out of my way to go up to Logan Square just to go here. I have had better experiences at other cajun seafood places. It's not my worse experience but it doesn't tie for first either. I think if I did come back, I'd try other flavors from Milk and Wood.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XjN1C-HQw3US3gP00Gbqhg/168s.jpg", "caption": "Anniversary deal"}]}}, {"review": {"des": "I have had great experiences at the Crab Pad. When my H and I went here for the first time, we were greeted by a fun and unpretentious atmosphere filled with drawings on the walls and plastic crab printed bibs (very necessary). The waitresses are all really nice and down to earth and helpful (Lex and Kat!). My H and I were able to sample the following:<br><br>-garlic noodles: a delicious, buttery, garlic experience with spaghetti noodles. The presentation is awesome too because they spear a fork through the noodles and stand it up on a potato (you have to see it for yourself) and very instagram worthy. The noodles are seriously amazing and you have to try dipping it in the seafood sauce.<br><br>-fried okra: very tender and not slimy. Comes with a good parsley yogurt sauce and very hot/fresh breading.<br><br>-fried calamari: extremely tender, well fried and fresh. Appreciate how this place seems to make food to order as everything comes out piping hot. Some of the most tender calamari I've ever had. <br><br>-1 lb mussels and 1 lb shrimp: the mussels were big and tender and the shrimp tasted fresh and were also quite large. This amount of seafood was too much for two people and we were even able to take a portion home to eat for our next meal. You can choose different sauces (lemon pepper, Cajun, etc but I always choose their house special Crab Pad style). The Crab Pad style has a really great strong garlic flavor with tons of chunks of real garlic. You can also choose your spice level: mild, medium, spicy. Warning: their spicy is legitimately spicy even for spice lovers so beware!! I settle on a medium.  You can add on items like corn or sausage to your boil if you desire. <br><br>-ice cream popsicles from Milk & Wood: this is a unique concept where you choose your popsicle flavors (Ube, green tea kit kat, pandan, Thai ice tea, Vietnamese coffee, etc) and they drizzle layers of chocolate on it and layer unlimited toppings on it (coconut, fruit loops, Oreos, wafers, sprinkes, etc). It's an epic way to end a spicy meal with something nice and refreshing. By the time you build your popsicle your sweet treat will be nice and thick with layers of flavors.<br><br>I think the prices are affordable and the portions good for what you order. Seafood is market price but still very affordable. <br><br>I'll definitely be back!", "pics": null}}, {"review": {"des": "I wanted to like this place but overall it's a waste of money. I searched crab boils in Chicago and this one came up. It was later in the evening so I decided to visit since many others were closed or closing.<br><br>I didn't have to wait because it was later in the evening. I started with the hot Mac n cheese which was a special. It was good when it first came out hot but turns the end of my dinner when I continued to eat it and it was cold it didn't taste like much but it was the better food choice of the night.<br><br>The seafood was so bland and we tried two different seasonings. The garlic was better than the house but neither seasoned the food. <br><br>I say look for another crab boil this one is overpriced and the seafood is blah.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6O_Z55U4l0gilNHy2zGDHg/348s.jpg", "caption": "Garlic shrimp"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xwKaKlqZEicjxFnurkimHw/168s.jpg", "caption": "King crab with house sauce"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PgTuWFeTZJ-Sip1NbJdjsg/168s.jpg", "caption": "Mac n cheese"}]}}, {"review": {"des": "The Crab Pad is all that.  I love the fact that it's  in Logan Square.  The other restaurants similar to this establishment are all way up north.  Sometimes ain't  nobody got time for all that if I want to satisfy my craving for some delicious under the sea crustaceans.<br><br>So if you've never been, the menu is similar to that of the Angry Crab and Asian Cajun.  You order your food by the pound, then choose the sauce and how spicy you want it.  The price per pound is based off of market value, so its not a set price.<br><br>Came here with 3 adults and 1 child and we ordered the snow crab legs, and shrimp.  For the shrimp you can choose to get it with the head on or off.  Being from the Philippines, we choose the head to stay on.  Thanks.<br>We complimented the bag of seafood with some corn and rice on the side.  <br><br>We chose the Crab Pad sauce with only the first level of spicyness.  It was amazing and I was not dissapointed!  All of the crustaceans we consumed were nice and fresh.  Be prepared to get down and dirty with your food because thats the only way to eat seafood in a bag, people.  Forget them forks.<br><br>The service was also on point.  Cat was our waitress for the night and she made sure that we were attended to the whole night and that we had enough to drink or even enough seafood.  She also helped explain the menu as I had some questions since it was my first time there.<br><br>I almost forgot to mention that they have a kids menu here!! I loved that! I get nervous bringing my kid who is such a picky eater to restaurants such as these because there wouldnt be anything \"normal\" to eat.  Rest assured, the kids menu consists of chicken nuggets, mac n cheese bites, spaghetti, fries, and a drink.  All normal food items that kids cant get enough of.<br><br>Last but not least, if you have room for dessert after, check out the popsicles at Milk and Wood.  This is located right inside of the Crab Pad restaurant.  Check out my separate review on them.<br><br>Til my next crustacean craving!  Peace out.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Y7ogu1vbiwYVfWrnzjxc-Q/348s.jpg", "caption": "Working for that crab meat! Lol"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Jd9OiDkeK9f8XgGYx-ypkA/168s.jpg", "caption": "2 lbs snow crab legs + 1 lb of shrimp"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zjSHvhmWS1T_ZbZXKygxOQ/168s.jpg", "caption": "They have a kids menu!"}]}}, {"review": {"des": "The Crab Pad..... Where do I start?<br><br>1. Appetizers<br>The Garlic noodles and the Wings are always a must for me, but always ask for their specials.  I've tried crazy things like Flamin Hot Elotes and Mac and Cheese. What?!?!<br><br>2. Seafood in a Bag<br>Crawfish and Crab legs are always my go to, but sometimes i'll switch it up and get Shrimp or Mussels. If i'm there for a birthday or special occasion then maybe i'll step it up with some King Crab or Lobstaaa.  <br><br>After choosing your seafood you still have to customize it with your seasonings and sauces.  I always go with Crab Pad Style, but some people like it simple with just Garlic Butter or Lemon Pepper.<br>On the side I ask for salt/pepper/lime just as an extra dipping sauce. <br><br>3. Ice Cream / Milk & Wood<br>If you haven't seen their crazy looking ice cream bars yet.....just check out the Yelp pics or the Milk & Wood IG.  There are countless times that I would just drop in just for one of these quick desserts.  Some of my favorite flavors are Green Tea Kit Kat, Thai Iced Tea, and Pandan.  I put toppings like graham cracker crumbs, coconut and oreo but always the condensed milk drizzle.<br><br>Definitely a must stop shop if you are in Logan Sq or just strolling down Milwaukee Ave.  Appetizers, seafood and ice cream all in one place. All are very Amazing and Yummy!!!", "pics": null}}, {"review": {"des": "We had been wanting to try Crab Pad since it opened in our neighborhood but because they aren't open for lunch hours (when we could go while the kids were at daycare) and trying to take a needy baby and a toddler to a place where our hands would be covered in spicy coating every time they needed something seemed more trouble than it was worth. We finally decided to just take the family and go for it this past Sunday and the food was every bit as Louisiana-y delicious as I had hoped. <br><br>It's a very casual place and meant for you to make a mess (which helped us feel less guilty about our 14 month old shoving all her food on the floor) and they do have high chairs and a kids menu. The restaurant is BYOB and we were kicking ourselves for not remembering to bring a few beers to enjoy with our Cajun boils. Rookie mistake. <br><br>We ordered the chicken tenders and fries appetizer for the kids to split (probably should have just ordered the chicken bites kids meal as the app only came with 3 little tenders and a ton of fries).  Then we opted for 1 lb crawfish, 1 lb headless shrimp, potatoes, and corn all boiled in the heavenly spicy crap pad seasoning along with a few biscuits (don't skip the biscuits!) and the garlic noodles. <br><br>This was way too much food. Like way way too much. We barely touched the noodles though the kids ate a bit. The biscuits were amazing but pretty filling and while we ate off all the crawfish, we left a lot of shrimp behind because we were too full. A pound of headless shrimp is a lot more food than a pound of \"headful\" shrimp. <br><br>For our dipping sauce we opted for classic garlic butter and spicy garlic butter and both were amazing. <br><br>The crawfish, shrimp, corn, and potatoes were phenomenal. The garlic noodles were good but a bit too greasy and the least exciting item of the night. That's one we would easily cut next time. The biscuits were coated in garlic butter heaven and were perfect to dip in our crab pad sauce. <br><br>Our server was happy to give us a quick coaching on how to twist the crawfish open (we were rusty) and gave us great flavoring recommendations. The service was a little tedious as we had to ask for every single thing (water, plates for the kids to eat off of, a bucket to throw our shells in, etc). But other than that, the experience was wonderful and delicious. <br><br>We topped off the visit with a popsicle from their bar - definitely save room for this. It's amazing - our little guy chose a dreamsicle with torched marshmallow, milk chocolate drizzle, topped with sprinkles and coconut. It was perfect for him to get his dessert treat fill, and the 3 of us to get a couple bites as well. <br><br>We will definitely be back as soon as my body finishes processing out all the garlic and butter we absorbed.", "pics": null}}, {"review": {"des": "First time ordering here and did not care for their boil. I ordered a Pd of headless shrimp (crabpad style), as well as their garlic noodles. The shrimp to me lacked flavor and were just plain ol soggy. Just because it's drenched in their sauce does not mean the shrimp are flavorful. Garlic noodles were nothing to brag about and the Parmesan cheese could be left off it.", "pics": null}}, {"review": {"des": "On the last night of my Chicago trip I was craving some spiciness so I hopped onto Yelp and got a Grubhub order to go from The Crab Pad. I ordered their famous garlic noodles and some heads-off shrimp with everything (medium spicy). OMG this food was delicious!<br><br>I'm always a little nervous ordering seafood so far away from the sea, but thought I'd give them a try since my rage for cajun was off the charts. The shrimp were huge, fresh and delicious. Maybe they have 'em flown in, I dunno, and I really don't care because they were marvelous!  And they were swimming in a sea of cajun/garlic deliciousness, with tons of spiciness (I was glad I'd ordered 'em medium).  There were SO many shrimp I couldn't even eat them all - hello breakfast leftovers!<br><br>The garlic noodles were no slouch either. They were buttery and loaded with garlic, but not too dry as garlic noodles can tend to be. They were the perfect accompaniment to my shrimp - and also made for a tasty (if non-conformist) morning treat before heading to the airport.<br><br>My only, very minor, issue is that the shrimp were served in a plastic bag and hard to eat in a hotel room. I would've preferred them in a tub. Also there were a couple of forks with my order, but not a single napkin (and trust me, you'll need a napkin to eat these saucy suckers). The Grubhub experience was pretty good, although the food was ready a good 15 minutes BEFORE their estimate - I was glad I arrived early, as I didn't want it to be cold.", "pics": null}}, {"review": {"des": "My first time having seafood boil in Chicago and I had a great experience here. Luckily we came on their 2nd anniversary since crawfish and clams were $2/lb. Although it was a lot and worth the price, some of the crawfish wasn't as fresh. <br><br>We didn't get an assigned server, but the one girl, Kat, she decided to become our server and she made our experience amazing. She was super attentive and fast at helping us. She was super cheerful and helpful.<br><br>We also got the Cajun fries and biscuits. Both super delicious. Lastly, we got the Pandan ice cream and Ube Ice Cream. Both so delicious. Wasn't too sweet so it was perfect. Loved my first experience here. Would come back!!", "pics": null}}, {"review": {"des": "Delicious!! Love that it's BYOB. After pic, we killed it. <br><br>They also have a ice cream / popsicle stand inside.", "pics": null}}, {"review": {"des": "Love it here! We had quick service. We received kind service.<br><br>The seafood here was delish!! Had lobster and crab legs and it did not disappoint! Had the mix sauce and it was perfect! We also got the ice cream bars which was a nice addition to end our dinner with. I got the ube bar with condensed milk, and my son got everything chocolate.<br><br>I totally recommend", "pics": null}}, {"review": {"des": "I would rate this a 3-3.5. <br><br>This is a typical cajun boil joint. Pricing seems comparable, if not consistently a few dollars more than other cajun places. I recall Asian Cajun and Captains Catch having king crab legs in the $30s. <br><br>The seasonings are comparable to the others. I will always prefer Asian Cajun for their additional Asian flavored sauces. <br><br>We came during Happy Hour and were able to score a few discounted appetizers and drinks. I knocked off a half star because the staff working here seemed relatively inexperienced. They made one drink orders wrong, and also billed us incorrectly. <br><br>Overall, not a bad place to have in Logan Square. We will be back when the craving hits and we are too lazy to go to Asian Cajun.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8yejUQ_LPeKBvBa1Xi_b8A/168s.jpg", "caption": "Pricier than others"}]}}, {"review": {"des": "Came here with 2 friends, we already had dinner but I was craving some garlic noodles and shrimp so dinner round 2, here we came.<br><br>Between the 3 of us, we just ordered a lb of headless shrimp ($17), garlic noodles ($8), and garlic fries ($4.50). <br><br>The shrimp came out within 10 minutes of us ordering which was good. But we really didn't want to start eating without the fries and garlic noodles. after another 10 minutes of waiting, we asked someone who wasn't our server to check on it. another 10 minutes, no word, we asked someone else who wasn't our server to check on it. since it has been 20 minutes since we've gotten the shrimp but no sides.<br><br>It finally came out 40 minutes from when we ordered. and then our server comes to us and asks how everything was. we told her it was really slow for the sides and she apologized, saying the kitchen was just super busy.<br><br>By that point we had already ate 3/4ths of the shrimp which sucked.<br><br>I had to go up to the counter to ask for the check and they gave us 10% off for the wait which was a nice gesture.<br><br>The garlic noodles were good. Everything else just okay. The hot level, we were warned, was really spicy. so we settled on medium but got some extra sauce spicy level (extra .50 cents) so that we could know. IMO, it wasn't really spicy but a good level. Wish we would have gotten that instead of medium. <br><br>All in all, this place was just A-okay.", "pics": null}}, {"review": {"des": "The service was great and Kat is wonderful! <br>Had broil earlier that day and must say I give this place a fluid 8.2 depending on what sauce you get and also if you indulge in the delicious treat that Milk & Wood provides inside. From ice cream bars to bubble tea, after a pound of broil it is the perfect ending!", "pics": null}}, {"review": {"des": "No wait at 9pm on a Sunday night. Waitress was really nice.<br><br>I came specifically to try the garlic noodles ($8). I'm obsessed with the garlic noodles at ppq dungeness island in San Francisco and was looking for a similar dish here in Chicago to curb my craving. Though it wasn't quite as good as ppq, it hit the spot. Wish it was more garlic-y though. <br><br>We also tried the loaded crawfish tots ($9). It had cheese, various sauces, and some crawfish tails. It was decent but probs wouldn't order again. Not enough crawfish. Also tried the fish tacos (3 for $5). Those were smaller than I expected but flavor was on point. <br><br>Of course we had to try one of their popsicles ($5). Check-in on yelp for $2 off!! We got the Thai tea one and at the recommendation of the waitress, got it dipped in dark chocolate, sprinkled with graham cracker crumbs, and drizzled with condensed milk. It was yums! I'll have to come back to try the viet iced coffee popsicle!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iD5n66nAElfo_R_LR74m3Q/348s.jpg", "caption": "Thai tea popsicle, dipped in dark chocolate, sprinkled with graham cracker crumbs, and drizzled with condensed milk and more dark chocolate!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZhISiyXzspXsFTek0_pUMw/168s.jpg", "caption": "Loaded crawfish tots"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7CeaNl_xwbBw617zohCBhg/168s.jpg", "caption": "Garlic noodles!"}]}}, {"review": {"des": "Extremely fun experience with friends. When you come, make sure you wear something that you do not mind getting dirty or smelly because you will really use your hands. <br><br>Basically you get to pick your seafood and the food comes out in bags. My friends and I ended up getting a combo and you can share. Just order extra sides as desired. <br><br>A must try is the garlic noodles - very nice presentation as well as yummy. <br><br>I eat spicy, but not super spicy. My friends ordered a bag of seafood that was so spicy that I had to order a side of clams in garlic butter sauce to ease the spice (but they were super good!) <br><br>PS. The only reason I gave them a 3 star was because their bathroom was disgusting. It was overflowing and water was coming out next to the sink that you wash your hands with before eating.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EXd7jpOGSySAdWeWU9mfCg/168s.jpg", "caption": "A bag of seafood in cajun seasoning"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rjmx92vp21E65iv9fkQj0Q/168s.jpg", "caption": "Garlic Noodles"}]}}, {"review": {"des": "For two, we ordered <br>1. 1 lb of headed shrimp - it wasn't super fresh. You can see and feel the texture was off...<br>2. 1 lb of king crab legs - AMAZING! MUST ORDER IT<br>3. 1 2-lb dungeness crab - average<br>4. 1 lobster tail - great in the garlic butter sauce<br>5. side of green beans and potatoes - could have skipped<br>6. crab rangoon rolls for an appetizer - recommended by the waiter and was very average and definitely not worth getting<br><br>We ordered everything but the lobster tail in the crab pad sauce.  It was so-so and wasn't very absorbed into the food.  My friend said the sauce is better elsewhere but the garlic butter sauce was better than other places.  The butter was thicker and more flavorful.  <br><br>This was plenty of food for 2 people but we almost finished it.<br><br>The decor is cute! <br><br>Tip: <br>1. They have clear plastic gloves if you ask but they're not that helpful because they're super thin and get punctured easily<br>2. Check-in on FB for free drink<br><br>P.S. Save room for dessert from Milk and Wood, which is located inside the Crab Pad.  They have some cool popsicles", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Wv4jLWnIzp93Kt7ioS73zA/348s.jpg", "caption": "Dungeness crab"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GiTxyTlhnfZ44paBre8igw/168s.jpg", "caption": "Lobster tail in garlic butter"}]}}, {"review": {"des": "We got the #2 combo, garlic noodles, calamari, and biscuits and it was all great, especially with the crab pad style sauce. I just want to give Cat a special shoutout for the great service! It was an amazing first experience and next time I will definitely try the popsicles!", "pics": null}}, {"review": {"des": "I love their food! The servers are always so nice. The ice cream is honestly some of my favorite ice cream ever", "pics": null}}, {"review": {"des": "Not as good and higher priced than the other boiled seafood in the bag places that we've been to.  The service was outstanding, and that cannot be improved any further.<br><br>If I went to this location again, I would avoid the crawfish and the dungeness crab.  But the mussels were better than the other's that we've tried.  Scoop that shell full of juice and drink down that mussel- yum!<br><br>Also its a BYOBeer place", "pics": null}}, {"review": {"des": "YUM! This place is exactly what we hoped for! The service was great too! <br>Can't wait to come back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UFWZ8lXEDP4IVJSVmtHm_g/348s.jpg", "caption": "Wow!!!! This was exactly what we hoped it would be! Already can't wait to come back, and loved Neyra and the rest of the staff!"}]}}, {"review": {"des": "Hands down one of my favorite seafood boil places in the Chicagoland. Got to go here for my birthday and we had clams, shrimp, crab legs, mussels, and lobster tail crab pad style and it was all so goood! The popsicle bar too inside was a bonus! We will be back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/k5WyX5-Zi8itL8lHe2LNKQ/348s.jpg", "caption": "Sooooo goooooooood #HappyBirthdayToMe"}]}}, {"review": {"des": "So fun and yummy! It's a casual spot with really nice staff. I'd never been to a place like this, but we decided on this place since we saw it was BYOB and had popsicles. The liquor store is just a few doors down. We got headless shrimp and snowcrab legs - both tasted great! We picked the rajun cajun sauce and the crab pad sauce (which is all the sauces mixed together). Both of these sauces tasted pretty similar. The only issue I had was how oily the sauces were, it made it difficult to enjoy the real flavor. I LOVED the grilled fish tacos. Tacos are my favorite food and they are only $5 for 3 (small) tacos??? What a great deal! I didn't try the popsicle because I was too full, but the person I went with did and loved it. There are a lot of creative flavors. I'd love to go back and try the strawberry lychee one. <br><br>Favs: <br>-milk & wood popsicles with toppings! <br>-BYOB <br>-fish tacos - $5 for 3 small tacos <br><br>Mehs: <br>-how oily the sauces are", "pics": null}}, {"review": {"des": "I had never been to a Cajun type restaurant and this far exceed my expectations of it. The food was mind blowingly good and the atmosphere was trendy and fun. Don't forget to get dessert the bougie popsickles from milk&wood are to die for!", "pics": null}}, {"review": {"des": "I read the reviews of all other places in Chicago for seafood boils and this seems to be the place to try first. Honestly, did not want to be the first customers of the day but took a chance. We sat near the door and was handed two menu's (regular and happy hour). There were fairly a good selection of food during this happy hour (50% off - appetizers and drinks) so we took advantage of that deal. <br><br>I ordered hush-puppies, bbq wings and flavored drinks and three pounds of crawfish (MP- $13.99). <br><br>Out of the three pounds of crawfish, 10% of the crawfish were not fresh. <br>Overall, we enjoyed all the items ordered. I would come back here for the happy hour items. Happy hour is from 5pm - 6pm only.", "pics": null}}, {"review": {"des": "I'm glad they offer Dungeness crab here, but the size is a little bit small. Fresh clams are really great. The only thing I don't like is that when I asked whether the \"headless shrimp\" is fresh caught... the waitress said yes... but as I tasted, they were more like the frozen one u can buy in the supermarket :(", "pics": null}}, {"review": {"des": "Fun ambience where you get down and dirty to eat great seafood. Everyone is given a plastic bib. We LOVE the king crab. We got combo #2 that had king crab, shrimp, clams, potatoes, and corn with the crab pad seasoning and mild spice. (Crawfish are too small and too much work for such little meat). The biscuits are SO good and only 75 cents each. I would not recommend wearing white and don't forget your hair tie!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hzVEjtR4izVZoZVIpjC59A/348s.jpg", "caption": "Fry nachos, Mac and cheese topped with hot Cheetos, and one beautiful biscuit"}]}}, {"review": {"des": "BYOB: There is a liquor store a few stores down- Your Happy Place Liquor - mention The Crab Pad get 10% off <br><br>Reservation: You can put in a reservation in advance on their website <a href=\"/redir?url=http%3A%2F%2Fwww.thecrabpad.com%2Freservations-1&s=8582696927e655dbcf49ff4564a4697678cf2fce2b847957318d32a82484eb70\" target=\"_blank\" rel=\"nofollow\">thecrabpad.com/reservati…</a><br><br>Unique dining experience: You will get hands on with your food. Be ready to get messy and have fun (make sure to wear your bib) <br><br>Food: Good! We got Combo #1 Mild/Medium and it was perfect, not too spicy not too mild. We also got garlic noodles & mozzarella sticks <a href=\"/redir?url=http%3A%2F%2F-BOMB.com&s=d0168ccf5b9745e2d614fba3fb5fc4fb7ade86f308f18628c20302bdd04a6f63\" target=\"_blank\" rel=\"nofollow\">-BOMB.com</a> <br><br>Service: Great! Some of the people in our group haven't eaten crawfish before and they were able to explain their menu and show them how to eat it. Crawfish tutorial 101 included if asked <br><br>Dessert: Gotta try their POP bar - I got their pandan special.. it was delicious! They have different flavors all the time<br><br>Overall, fun dining experience with quality seafood.", "pics": null}}, {"review": {"des": "I haven't had boiling crab in so long! I love the noodles that you can add to the bottom of the bag they soak up all the flavor. I had the spicy Cajun with a lb of crab legs it was so amazing.", "pics": null}}, {"review": {"des": "My first seafood boil place and I loved it!! I came here on a Saturday around 6:30 and it was pretty empty (it started to fill up more by the time we were done though).<br><br>I ordered a pound of snow crab legs (basically got 8 legs) for $27 (mp) with Cajun seasoning and sausage, noodles, and corn for sides. Everything was delicious but I highly recommend getting the corn with it. I could have gone without the noodles, they were buttery and delicious but was a little too heavy for me given everything else I had. I also wish they actually gave proper crab leg cracking tools but not enough to take off a star for that. My boyfriend got one pound whole shrimp and one pound blue crab and also loved it! We also ordered Cajun fries in the middle of dinner because we were both craving it and I also highly recommend!!! They're thin-ish fries but the Cajun seasoning is perfect.<br><br>For drinks, it's BYOB so we brought our own drinks but I was interested in how they have Asian drinks like Thai Iced Tea on their menu. Literally two of my fav styles of food in one place it's great. For dessert they have an ice cream bar station where they also have other Asian flavors (like ube and matcha). With your bar you can choose what kind of chocolate drizzle you want and unlimited toppings! (Or as much as they can fit on the bar).<br><br>I was SO SATISFIED with my meal here. It's also all instagrammable so that's a plus. I'll be back!!<br><br>Shoutout to our server Luna for being super sweet and attentive throughout our meal!!", "pics": null}}, {"review": {"des": "First time here and I had a lot of fun and enjoyed the food! :) Molly was super helpful and showed us how to properly crack open crawfish. Would come again and try the spicy seafood!!", "pics": null}}, {"review": {"des": "Prepared to get your hands messy! There are no plates or silverware here. Instead orders of seafood come out in bags and everything is dumped onto the table. Super fun place to come with a group of friends and it's BYOB.<br><br>My boyfriend and I shared the combo #2 ($70), which came with 1 lb king crab legs, 1 lb shrimp, 1 lb crawfish or clams (we picked the crawfish), and 2 orders of potatoes and corn. We chose the crab pad style seasoning with medium spice. You can ask for extra spicy sauce on the side, if you want more of a kick. We also got an order of the garlic noodles, which is a MUST. <br><br>Another one of the stand outs here is that there is a customize ice cream bar inside the shop. You pick a flavored popsicle, drizzle it with dark, milk, or white chocolate, and then pick toppings such as sprinkles or mixed nuts. I got the cookie butter with chopped butterfingers, oreo crumbs, shredded coconut, and white chocolate.<br><br>Our server, Cat, was a gem. Being first timers, she was super informative and did a wonderful job taking care of us.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ao0gHoVmYNb-1OhOLnY8Ow/348s.jpg", "caption": "Cookie butter w/ white chocolate, butterfinger, Oreos, and coconut"}]}}, {"review": {"des": "It was a rough beginning at the Crab Pad. We were a large group but over half of us was present and we still weren't able to sit. The 7 of us could only block the entry and stare at the big table that was waiting for us. Once seated I noticed that it is crazy loud in there. Only the person sitting next to you can hear you. We waited for what seemed like a long time for the basics, cups and ice buckets for our drinks (no water offered from what I can tell) and to take our appetizer order. So by this point, I was hangry. In my mind I was thinking, I cannot wait to write my Yelp review!<br>But then the food came. And oh boy! It was delicious! We shared some calamari, crab sticks, hush puppies. All amazing. I saw someone got the crab french fries and I thought that is what I'm getting next time. Yes, I was already plotting my return.<br>For my main, I shared a bag with my boyfriend. We got the mild with shrimp and crab. It was very very messy and very very good! You get some sides with it like potato, corn, and beans which cuts the richness. <br>Let me tell you about the staff. I don't know what was going on in the beginning of our time at the CP but the people who took care of us, TOOK CARE OF US! They were awesome. It was a really big group! I was really impressed by everyone. <br>I have told my friends and will definitely come back here. It's what I would call \"a happy place\"", "pics": null}}, {"review": {"des": "Boy did I enjoy it here! <br><br>We came on a Sunday night. There was a decent amount of tables occupied, but it wasn't crowded. Comfortable. The food took a while to come out, but it was delicious. Seriously, we never get through the entire bag. I didn't even mind that they don't have a container to place the shells. You have to place the shells on your table, which takes up space at the two-seaters quickly. <br><br>As with most places like this, there's a sink near yet outside of the bathrooms, making it easy and convenient to wash your hands. There's no such thing as not getting messy here. <br><br>The ice cream here was great! Choose from dark chocolate, milk chocolate, or white chocolate for the drizzle, along with an assortment of toppings.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IYRcbelnuJ4IaSvSA0RzjQ/348s.jpg", "caption": "Room for dessert? Why yes!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/P19YYhgjrot2ZRN7lytOwQ/168s.jpg", "caption": "The aftermath"}]}}, {"review": {"des": "So yummy!! MUST GET THE HEADLESS SHRIMP ($16/lb) with crab pad style sauce!!!!! The SAUCE IS DA BOMB!! Corn, sausage, and potatoes are good too! Lobster tail isn't the best value (you get 1 for $15). In terms of portions, 1 lb of headless shrimp and 3-4 sides was enough for 2 ppl. <br><br>It's fun cause the food comes in plastic bags and you get a plastic bib and eat with your hands. <br><br>Btw it's BYOB! They also have AYCE crawfish on sundays apparently.<br><br>Plenty of street parking around.", "pics": null}}, {"review": {"des": "ATTENTION PLEASE!   <br><br>Grab your bibs and let's get dirty<br><br>Once you dig into this bath of seafood smothered with the deliciousness of lemon butter sauce, along with the additional seasoning you choose, your fingers, hands and mouth will get messy.<br><br>We decided to share our dish and choose Combo 1 ($70), it contained lobster, clams, shrimp, crab legs, corn and potatoes, oh my.  Three of us ladies shared this dish with some to take home.<br><br>They covered the table in paper, we slapped our bibs on and waited.  Once our meal was ready, they served it in this plastic bag.  They opened the bag and it was filled with steam cooked seafood and seconding, along with the noodles.  My mouth waters as I describe this. <br><br>They do serve forks with your meal, but mostly everyone uses their fingers.  Yes, there's plenty of napkin rolls to keep you clean, but let's face it, it's a huge mess.  From the shells left on the table, along with the buttered napkins. It's just a delicious mess.<br><br>Don't worry.  There's a sink in the restaurant (no, not the bathroom sink) where you can clean your hands once you're finished with dinner.<br><br>If you still have room left over for dessert, they have this popsicle bar made from milk and your choice of toppings.<br><br>It's a win-win all the way around.<br><br>If you love seafood, come check this place out.  <br><br>It's DY-NO-MITE!<br><br>Happy Holidays (2017) everyone on Yelp.", "pics": null}}, {"review": {"des": "Second time being here, still as good and messy. Garlic butter is always a good choice at first, but 30 min in you realize your cholesterol is at its peak. <br><br>Ice cream is always a good way to follow ups even if the sign outside for 2 bucks off is a lie.", "pics": null}}, {"review": {"des": "I came here with a friend for dinner. We had the Combo (mild spice) which included crab, corn, shrimp, potatoes, and crawfish and then we added a side sausage. Everything was finger licking good...literally! The combo was just a perfect size for the two of us. Will definitely be back both with friends and family. Family friendly.", "pics": null}}, {"review": {"des": "Me and my wife were trying to do something different for our anniversary instead of the steak and lobster +++++ I looked into seafood options near me 1st surprised it was so close 2nd  I am stuffed wow what a treat this is a very layed back not over the top,byob which I think is a deal closer for me exactly what you look for in a eatery thumbs up all the way up I will be going back again soon", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rjreJ4L6O4kKXx8cUBLl-w/168s.jpg", "caption": "Great you've won me over at the presentation."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MW2PRy6yY_xAE1GZ69Phyg/168s.jpg", "caption": "1st times a charm I'm stuffed"}]}}, {"review": {"des": "My new obsession. In short BYOB & freaking delicious! Highly recommend <br><br>The lengthy version : i have been twice now . Once with one other person and once with a reservation for a large group<br>Food: crab and shrimp in the crab pad seasoning delicious! You can add corn and green beans to the bag so they get all coated in seasoning too. A great addition add them! Onion rungs probably best ive had . GET THE GARLIC NOODLES!!!! There has to be some secret ingredient in there. amazing!<br>Service: shout out to Kat! She was so friendly and helpful! I also appreciate we didn't feel rushed out as sometimes i feel like you do at byob establishments<br><br> The place is fun and casual . Prepare to get messy obviously", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Z9ggmlHSOetkLnyhAB4RRA/348s.jpg", "caption": "Dessert. Create your own ice cream bar"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dqA8UIZGsO9SzrwN5dtz4Q/168s.jpg", "caption": "Crab,shrimp with green beans in the crab pad seasoning AMAZING"}]}}, {"review": {"des": "This is is one of the first Cajun seafood restaurants I've ever visited in Chicago. The staff here is super friendly and very helpful when it came to deciding what to order. <br><br>For appetizers, my friend and I ordered the garlic noodles and crawfish tots, which were really yummy and flavorful. We also ordered the crab fries, but I felt the crab fries tasted bland in comparison to our other two appetizers. <br><br>For the main part of my meal, I had the snow crab legs with sausage, and my friend had the whole shrimp with corn. Both of these combos were prepared with Crab Pad flavoring and mild spicing.  Each bite of these combos was full of fun flavors, textures, and garlic, all while being perfectly spiced. <br><br>The Crab pad also has a fun dessert bar setup consisting of peletas of all flavors (including chai tea & ube), which made for the best dessert surprise ever. <br><br>This restaurant is located along Milwaukee Ave in Logan Square, and parking is readily available in front of this establishment. <br><br>My friend and I plan to visit this place again some time soon to try the rest of their yummy menu!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/R_JUr3GqUhMRw_gRIcARVg/348s.jpg", "caption": "Snowcrab legs w/ sausage, crawfish tots, whole shrimp w/ corn, and crab fries"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kryIwxFzJIYI84gYk-MYyg/168s.jpg", "caption": "Garlic noodles & crab fries"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/X6_Z_Wg2daClpguw2OsqsQ/168s.jpg", "caption": "Ube paleta covered in dark chocolate, sprinkles, coconut, & condensed milk."}]}}, {"review": {"des": "This is one of the best places in the area for seafood and ice cream! My sister and I had a blast with combo #2 and the Vietnamese coffee ice cream. They were packed but they were super friendly and the service was great. I can't wait to return for their ice cream!!", "pics": null}}, {"review": {"des": "The crab pad style seasoning was amazing! Went there on a date and I did not hold back! We did the combo #1 and it was plenty. We had to take it home and it was still good the best day. Very helpful server. Good food!", "pics": null}}, {"review": {"des": "All I can say is WOW! What a wonderful pearl  in the middle of the Chicago restaurant scene. Do not miss going here. Excellent food ! Ginormous servings and a staff of sweet people. My kids took me here for my 68th BDay, and it will go down in the books as one of he best, if not THE best. Thanks to Cat our server  and my four kids for making it a great night.", "pics": null}}, {"review": {"des": "This was my first time coming here and I'm visiting from STL and i found this place on Yelp. I am so happy that I came to this place because the food was awesome. I really like the fact that its BYOB vs buying a lot of drinks plus the food because the seafood portion is kind of pricey, but worth it. The service was awesome, our waitress Lex really helped out with menu and how to order the food, and the spice levels. Lex did an awesome job.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uYzbiriUR0Nf0IFXHxlLXQ/348s.jpg", "caption": "Loaded crawfish tater tots....these were good"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VXmAVgzrcRMSUn7v1g_TZQ/168s.jpg", "caption": "BBQ wings...the wings were okay, it just had too much breading for my taste"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/S0Rar1huXy52XvtjwYUfcQ/168s.jpg", "caption": "These were their famous garlic noodles"}]}}, {"review": {"des": "My friend and I came here for dinner as it's been a place I have been meaning to come try for a while and my husband unfortunately doesn't eat seafood. They were accommodating with the changes in our reservations, and we were seated right away when we came in. Our waitress was helpful in suggesting the combo for us in addition to a level of spicyness. We had it between mild and the first level of spicy, which was still pretty spicy even for me. Included in the combo was the king crab, shrimp, crawfish, potatoes, and corn. We also added sausage and started with the crab egg rolls. Everything was delicious. I think I finished a majority of the food. The place is also BYOB. I would love to be back with a beer or a bottle of white wine, maybe a white sangria, or moscato even. I also capped it off with a Taro ice cream from Milkwood inside. Prices were reasonable as well.", "pics": null}}, {"review": {"des": "Great time and great place. Alexis was an amazing server and the food was delicious. Highly recommend combo $3 and they crack the Dungeness Crab for you!", "pics": null}}, {"review": {"des": "Crab pad is soooo good!!! <br><br>My boyfriend and I had reservations for A different crab place, but I felt guilty spending that much on dinner soooo I made him cancel lol. <br><br>We found ourselves here and we couldn't have been happier!<br><br>The service was on point. Our waiter was always checking in on us and making sure our cups were always filled. <br><br>We decided to order 1 lb of crab with potatoes & corn in the crab pad style. It was delicious. It did have a slightly sweet after taste, but still tasty. <br><br>We always ordered 2 lbs of shrimp. One was lemon pepper with corn and the other was garlic with potatoes. Both flavors were so good. I think we ended up leaving with about 1/2-1 lb of the shrimp. <br><br>We ended our meal with a Popsicle! We loved all the interesting flavors they had. We ended up with a ube drizzled with white chocolate, sweetened condensed milk and Oreo. This one was our favorite!!! Tasted like French vanilla, but prettier. We also went with a Vietnamese coffee drizzled with sweetened condensed milk and graham crackers. This one tasted exactly as if you were drinking an iced coffee. It was good, but don't think I'd order it again. <br><br>We can't wait to go back and dig in again! Cracking the crab legs was so fun. <br><br>Our total bill was like $83 or so.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IS3TNHpPpDElvqqf1dVGKw/168s.jpg", "caption": "Ube with white chocolate, sweetened condensed milk and oreo"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WVvnGgmsk-73iuC2G_Lt-g/168s.jpg", "caption": "Vietnamese coffee with milk chocolate, sweetened condensed milk and graham cracker"}]}}, {"review": {"des": "It's good...but pricey. I love seafood and this is a different eat with ur hand version. We shared two bags of various seafood from crab legs to lobster tail. The dipped dessert is a good option to try but $1 for each topping?! mmm<br><br>ooh and u can ask for clear plastic gloves if have nails u want to preserve...hehe", "pics": null}}, {"review": {"des": "Some may wonder why someone allergic to shellfish would go to The Crab Pad. I asked myself that while sitting inside with friends chowing down on all the crustaceans they could fit in their mouth. Now, if you have a shelly ocean swimmer allergy like me, your options will be limited at The Crab Pad, that's for sure. You won't be able to try any of the fun eating from a bag! However, you will absolutely have some options for chowing down.<br><br>They chicken tenders, fish and chips, delicious fries, mac & cheese bites - you can find many things on their appetizers menu that is shellfish-allergy friendly. Now items like the fish & chips and Chicken Tenders are a full meal! Although it's listed under apps, they are all filling and delicious. Their chicken tenders and fish are so flavorful, they didn't even need any dipping sauce. Their Mac & Cheese bites for $5 are really tasty, too! Some of the better bites I've had. My friends said the seafood was all very good and were happy with the market prices.<br><br>The staff at The Crab Pad is awesome! We had the friendliest server ever who was very accommodation and on top of everything.<br><br>I loved everything I had here and wouldn't mind stopping in again. Be sure to check out Milk & Wood afterwards for some great dessert!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IiRHu0ZLOLNNHEWjercl7A/348s.jpg", "caption": "Hehehe"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/D_beYLXmOSvyfKLH615kmw/168s.jpg", "caption": "Mac n Cheese bites"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xPUe-RdMup15RcADZLk_bg/168s.jpg", "caption": "Fish and chips"}]}}, {"review": {"des": "We celebrated at Crab Pad for my sisters birthday. John served us for our party of six and food was fantastic and service was excellent! They made my sister's birthday special! The ube popsicle tasted just like halo halo!", "pics": null}}, {"review": {"des": "Went here on a Tuesday night, it was empty. We were excited. <br><br>We got the below: <br><br>Calamari was ok...I hated the fact that the marinara wasn't served hot, it was actually cold. Really threw it off but nothing stood out about the calamari itself anyways -- not something I would get again. <br><br>Unfortunately, I can tell the Gallic noodles were warmed up in the microwave. It was unevenly hot, but the flavor was good. <br><br>We got the combo 2 and added clams and lobster tail with the combo sauce medium hot. Clams were a little small, they seemed over cooked. Our waitress was honest and told us that the crawfish was in fact frozen when we asked and results were what was expected. The king crab was great, as well as the head on shrimp. I feel like the shrimp was cooked to perfection, our favorite out of all the things really. Lobster tail was Nothing special, I feel like the sauce could have made it better but it wasn't that flavorful to begin with, it was actually really oily and I felt like it was lacking garlic and flavor. <br><br>Our server Angel was really sweet, and super tentative. I would maybe come back here again. Not something I would go out of the way for though.", "pics": null}}, {"review": {"des": "Dinner date fun included a pound each of head-on shrimp and mussels plus potatoes and corn - with the mixed spice, medium. Garlic noodles were really good - flavorful but not overpowering.<br><br>I think we found our new go-to for Cajun seafood!<br><br>Hope you get neyra when you visit - she was wonderful!", "pics": null}}, {"review": {"des": "Crawfish was great but unfortunately the 911 seasoning was not even close to being a spicy emergency. <br>The crab legs were great swirling in the garlic butter seasoning.<br>Biscuits were just okay nothing too great.<br>The vegetables (corn & potatoes) were a nice touch even though they were swimming in the spicy seasoning it just added a really nice touch again not spicy. <br>Clam Chowder was slap yo momma good...<br>Also tried those famous garlic noodles...they're everything everyone raves about! <br>Wasn't aware that it was BYOB that will a nice idea for round 2...there will definitely be a round 2", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-Oqt_d95jeGhW4FhLXEKBw/348s.jpg", "caption": "The menu to get you started the market values are on the boards on the walls."}]}}, {"review": {"des": "This place hands down my go to for seafood. They are super friendly and the food is delicious! You had to try the garlic noodles and the crap pad flavor on whichever seafood you choose! Try this place once and you won't regret it!", "pics": null}}, {"review": {"des": "Finally tried! Defff LOVED IT! Did a pick up order.. shrimp were fresh big potatoes and corn were great as well. My only dislike sauce lacked a little flavid and was too oily/buttery. Overall GREAT FOOD!", "pics": null}}, {"review": {"des": "Unfortunately the service is bad here, just terrible. No wonder this place is usually empty. As for the food, the crab legs were bottom of the barrel. It looks bountiful by the pound but yeah hardly any meat. Be prepared to ask for a crab mallet cause I guarantee they won't offer it before your meal. Supervisor of the night I went also asked me if I ever ate crab before haha. Poor service, period.", "pics": null}}, {"review": {"des": "Six stars! Great for seafood and garlic lovers. If you don't like seafood, the appetizers and ice cream are really good. <br><br>Came with a large party for a birthday and the service is impeccable :) decor and environment <br><br>Ordered the Jonah claws and headless shrimp, 1 lb each to share for two. Threw two half corns in there and a side order of fish and chips. Crab pad style. <br>Let me say, the garlic sauce is sooooo good. Do the sauce boss thing that they recommend. A cup of salt and pepper with lime. I love the sour taste and the garlic butter at the bottom of the bag. <br><br>The food itself surprised me. Received like four large Jonah claws that wasn't ruined by the sauce. The only criticism I would say is one of the claws was large shelled but inside the meat was small and probably because it wasn't fresh and died earlier. It was just so good I kept eating.<br>The shrimp was nothing to complain about. I'm glad we invested in the headless shrimp. It was cleaned and yummy, per usual. I kept dipping it back into the sauce and sucking the flavor out.<br>As I continued to enjoy our seafood in a bag with the taste of sweet corn dripping in garlic butter, I was reaching for the fish and chips. After the first bite of flaky fish, I couldn't resist taking more bites. It was going higher and higher on my favorite list. It's battered and crisp to perfection  <br><br>My friends pretty much got everything else on the menu and everything looked pretty good. <br>Check was decently priced. I'm really satisfied. <br><br>Thanks Shirley for bringing us here and Happy Birthday!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2mY4kAnYMMOWrQ0A5KuJ8A/348s.jpg", "caption": "Best fish and chips I've had"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xEOVMYei3JX8JafgGfOrOQ/168s.jpg", "caption": "Jonah claw!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_o5ml7NyvYYfnmQHLsRqEQ/168s.jpg", "caption": "Corn, shrimp, everything was so good in crab pad style sauce"}]}}, {"review": {"des": "This is my favorite shrimp in a bag place. The apps were nothing special but the dessert was a hit. Homemade ice cream pops with a selection of toppings. I had the mango strawberry. Yum. Clean, simple, really nice service. I'll be back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LFV2KlAs6cIJ-89oChbZ6g/168s.jpg", "caption": "Yum"}]}}, {"review": {"des": "Wow. Went here for the first time yesterday, it was a Sunday evening and this place automatically had great vibes. It was BYOB, we had forgotten to grab liquor but the host found us a close by liquor store to go to so that was nice! <br>Asia - our waitress was super cute and helpful, thanks girl!<br><br>We ordered the Combo (#1) which was like a mix of shrimp (heads on), mini clams, lobster tails and claws, crab legs, potatoes. We also ordered side of broccoli, which was thrown in the bag as well. BTW, all the seafood is just thrown into a bag which you just dig into, not sure if that was obvious, but I was thrown off. It was cool though, definitely a different dining experience. But perfect for messy eaters such as myself. The sauce at the bottom was sooooo good and seasoned, we got mild spice. YuM!!!", "pics": null}}, {"review": {"des": "I came across this place while in the Chicago area this weekend and it was the best Cajun food I've had in a long time! I ordered the shrimp, clams, crawfish and my husband had the crab. All did not disappoint. We also ordered fries and garlic noodles that were also on point. I was too full for dessert, but my husband tried one of the ice cream bars that you could ad toppings to. It looked like there was a pretty good selection of flavors and toppings to choose from.<br><br>The restaurant ambiance was pretty unique with street art on the walls and it also looked like people could write messages around the restaurant too. Overall the experience was a great surprise considering I wasn't too familiar with the area or the restaurants in the area. <br><br>If you're in the area definitely make sure to check out this seafood spot!", "pics": null}}, {"review": {"des": "4.5 stars. My special lady, her hubs and I got reservations for their 2nd anniversary celebration a couple nights ago. We ordered the cajun fries, a dungeness crab, two pounds of clams, a pound of crawfish with potatoes, corn, and sausage Crab Pad style. We all ordered limeades: regular, strawberry, mango, and decided the mango was the best of the three. My lady and I ended our meals with the Thai tea & ube popsicles drizzled in dark chocolate. Don't worry, we shared with the hubs. Everything was delicious and our server was attentive. We will return.", "pics": null}}, {"review": {"des": "I'm probably at 3.5 half stars, but I'll round up.<br><br>We came in on a Saturday night at 8.  We did make reservations via their text-message-rsvp system, which was pretty cool, but not necessary; there was plenty of seating and no wait.  I had misinterpreted Spouse's \"I want Endless Shrimp\" when I chose this restaurant, forgetting that he doesn't like getting his hands dirty.  I ordered the garlic noodles that were so highly recommended, a pound of shrimp for me, and he had chicken tenders.<br><br>The food was all okay.  Nothing really to write home about.  I mean, garlic noodles are exactly that - grab some spaghetti noodles, boil them, and mix with some garlic and butter.    Pretty expensive for $5 for (maybe) a cup.<br><br>The shrimp were okay.  They came out in a bag with the flavoring in them, so they're a mess to eat, and no silverwear is provided.  I gather that's a schtick at these places.  Spouse said his chicken tenders and fries were below average.<br><br>I did, however, love the popsicle bar that was inside.  Basically, they hand-make a bunch of popsicles of different flavors (I had mint oreo flavor), then you can drizzle them with chocolate (white, dark, milk), and add one of nine toppings.  It's quite impressive, and good for a sweet tooth.<br><br>It's worth noting that the popsicle bar and the rest of the restaurant are set up so that you can easily come in and DIY a popsicle without having dinner, or sitting down.  I'll probably be back for a popsicle, but I'd only do dinner again if someone else wanted to.", "pics": null}}, {"review": {"des": "It was a perfect day: 80 degree weather, sunny, bar-hopped with the best of friends, and it couldn't have been a better ending than at the Crab Pad. <br><br>Ambience: It is a very lively place with upbeat music that's not too loud or too soft, and was very busy but not too busy that we had to wait forever for a table.   I loved that the entire table was our plate and that they gave us cute crab-printed bibs.   <br><br>Service: Amazing! All the waiters/waitresses were so sweet, welcoming, and attentive.  I never felt like my water cup wasn't refilled or that we were waiting around too long. <br><br>Food: SO GOOD.   The table after we were done looked like a warzone and every little thing on the table was eaten in record time which is a sign either that everyone was starving or that it was all super delicious (i think it was both).  First off, the garlic noodles were so flavorful and buttery and oh so good.   We ordered the shrimp, sausages, crawfish, king crab legs, and corn with mild seasoning and it was perfectly flavored and juicy.   <br><br>I had a great time at the Crab Pad and I'll definitely be back!!", "pics": null}}, {"review": {"des": "This is my first review on Yelp and I have to make it out to The Crab Pad (TCP). This place is legit! If you want the best Viet Cajun style seafood boil in Chicago, go here! The flavors are on point and the seafood is fresh. Love the garlic noodles, crawfish and king crab selections. After you're done feasting on the delicious food, get some specialty ice pops from Milk + Wood. The Thai Tea and Green Tea Kit Kat pops are some my favorite ones. Also, the owner, Theresa is good people.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cBC8pA18tGm0ptFw9Ag13A/168s.jpg", "caption": "The food is on point! Try a little of everything."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IC686zhvLKZ0fvtXQ1jVrg/168s.jpg", "caption": "Specialty pops make the perfect desert after a delicious meal!"}]}}, {"review": {"des": "This place is delicious! Got the shrimp, snow crab, and clams in Crab Pad style with mild heat, and it was perfect for three people. You can skip the boba", "pics": null}}, {"review": {"des": "We went here on Thursday and got a table right away! If you want to drink it is BYOD. They do have tea and pop. Our server was Lex and she was knowledgeable about the menu and very nice! We ordered seafood in a bag. We had shrimp, snow crab, and lobster. They had a lot of seafood to choose from. We added the house spice mixture and made it mild as I am not a spicy girl. We also got a side of fries and hush puppies. They have a huge list of sides. Our bag came out and they opened it up on our table that was covered in white butcher block paper. The seafood was hot and flavorful. The sides where yummy. I think when we go again we will get more shrimp instead of the lobster. I didn't think we got enough of the lobster.", "pics": null}}, {"review": {"des": "This place gets 3.5 stars. We ordered the combo #2  , which consists of shrimp, king crab, crawfish, corn and potatoes. The Garlic Butter flavor was delicious and in between mild and medium gave us the perfect kick of spice. <br><br>The shrimp tasted like it was a minute over cooked, the crab sooooo good, but the crawfish sucked. Oh and their peach tea lemonade is a MUST!!! Trust me!<br><br>Molly was our server and she was very accommodating. I initially ordered the combo #1 and she allowed me to change it to #2 even though the order had already dropped. I appreciate good customer service!!", "pics": null}}, {"review": {"des": "We ordered the combos 1 (crab pad mix, medium heat) and 2 (garlic butter, mild), mac n cheese, and garlic noodles. The crawfish were bland and the mac n cheese was just ok, but otherwise, we thoroughly enjoyed all of the food and the service was great. The crab legs, corn and green beans were especially delicious. We can't wait to go back!", "pics": null}}, {"review": {"des": "I literally LOVe this place! I usually go to Low Country and this is just a smidge cheaper. The service is friendly! I told my waitress, Jade or Jasmine, that I would Yelp her and I forgot her name. Love love this is a must try. I did the combo 2, with lobster tail, crab legs, clams, and shrimp... there were no left overs and 2 adults and one child.", "pics": null}}, {"review": {"des": "Omg such a fun place to go to! Even during their happy hour you should be prepared to spend a couple of bucks ... or if you're on a budget stick to it!!!! Im warning you now. Let's just say everything was cheaper than normal and because of that fact my boyfriend and used it as a reason to try almost everything. Lol the  look of shock on our face went we got our bill was hilarious. The music  was awesome. I'm a people watcher and everyone at the restaurant seemed to be having a great time . Oh and the dessert. Ube popsicle!!! My filican heart was so happy. Ube makes the world better just saying .", "pics": null}}, {"review": {"des": "This place is great. We were served by Neyra and she was the best. She checked<br>In on us always. She was part of the 5 Stars. We ordered snow crab, whole shrimp, and mussels, Potato, green beans, biscuits. And a green tea popsicle. Omg! The using hands to eat and byob wearing a bib!!!!! Great fun! Love this place. The music was waaaaaay too loud to have table talks. I'd suggest they lower the music. Very good food.", "pics": null}}, {"review": {"des": "I don't eat seafood  but I went with a very large group for a birthday and the servers are nice and chicken tenders and fries were smackin & you get a discount on a popsicle for writing this review", "pics": null}}, {"review": {"des": "Me and my wife heard of this place through here coworker. I love sea food and my wife is starting to because of me. It was a little to spicy for her but great part was u can make it anyway you want and not have it spicy. This was are three year anniversary and we wanted to try a different experience no plates, forks or spoons just ding in with your hands and fingers and eat.", "pics": null}}, {"review": {"des": "It was a fun experience and the staff were all really friendly and excited. That made the meal.  Additionally, the ice cream bars they sell at the front were delicious. <br><br>However, the seafood's flavor wasn't quite there. The spiciest sauce lacked noticeable kick, and the crawfish were falling apart from being overlooked. But the rest of the meal still tasted really good! It was still a great experience and I had a fun time. <br><br>Also it's BYOB!", "pics": null}}, {"review": {"des": "So delicious! This was our first time here and we'll definitely be back. Our waitress Neyra explained everything to us and was awesome through the whole process. We ended up ordering the garlic noodles because other yelpers recommended them and they were so worth ordering. Full of flavor, we wished we had two orders! We also got the headless shrimp with the Crab Pad spice and I couldn't stop eating them. We got corn in our bag and I recommend anyone to get the corner. All the spices and flavor on the corn made me never want to eat corn any other way.", "pics": null}}, {"review": {"des": "Went in here on a Saturday afternoon. The place was lack luster in appearance. We ordered snow crab. I had the everything spice and the hottest level of heat along with corn, fried shrimp and garlic fries. Ummmm. Meh. Crab legs weren't piping hot as I'm accustomed to in heat or flavor. Corn. Well it was corn. Fried shrimp the first batch one of the shrimp was raw. Sent it back. I will say the breading to shrimp ratio is pretty nice on these shrimp. But all in all compared to other cajun/ Creole boil places this place just lacked in umph! Service was very attentive though girl was super sweet.", "pics": null}}, {"review": {"des": "Came here on a Saturday and was seated right away (they take reservations online too). Ordered combo #3 to share among the three of us and it did not disappoint. The Crab Pad Style sauce in medium was thick, savory, and just downright delicious. They have limes, salt and pepper for those that need their citrus fix. Our only complaint is we wish it came with more for the price. <br><br>Bonus points - there's a pop bar, Milk and Wood, located inside the restaurant. I'm not sure if it's owned by the same ppl. They serve interesting flavors like Thai tea, Vietnamese coffee, taro, etc. Basic flavors like mint chip and chocolate are also available. They run out of bars, but make new batches often. Loved having these after eating so much Cajun! Will be back. <br><br>Parking is street btw.", "pics": null}}, {"review": {"des": "Hadn't had a chance to write this but I must ! Came in with a girl friend for a random craving (both 8 months pregnant ) I never liked seafood before pregnancy and that's what I craved ! We ordered everything lol and it was all amazing ! Food is served in a bag ! And you get a bib and some cool clamps to break open lobster legs ! Idk if this is usually how you eat this but i loved it ! Messy and delicious ! I got mine with a small amount of spice and it was spicy ! But that could have been my taste buds ... I will return to try the ice cream this time I was to full !", "pics": null}}, {"review": {"des": "Our server Lex was great, fast service and very friendly. We had the crab legs, garlic noodles and onion rings and everything was seasoned to perfection! Don't forget to try the green tea and kit Kat pop!", "pics": null}}, {"review": {"des": "So yum!!!!! 1st time but not the last! We got one of the combos and  with the rajun spice which was delicious! Very southern seafood boil! My better half is from MS and approved!<br><br>Neyra was great too!! Very helpful and sweet! The topping was the orange dreamsicle popsicle as dessert! Definitely worth checking out and great spot in the neighborhood", "pics": null}}, {"review": {"des": "Apparently i am in a minority here but I thought the \"experience\" of being served plateless, sans eating utensils, with our food presented in one large,  group access \"crayfish family mosh pit\" to be disgusting. Disgustingly messy, disgustingly unsanitary (you use your hands to extract food and then you drop it on the paper covered table and eat away) Ultimately a wholly unpleasant experience. While our two main \"combo\" eaters liked their food no one in the group felt they would return based on the physical eating experience.<br>*Positive feedback on my chicken tenders and the sweet potato fries which we ordered for our non seafood eaters. Also the ice cream desserts are tasty. Our waitstaff was attentive and responsive. When our two combo eaters could not extract their meal properly she taught them how to and also helped them tackle the more complicated crustacean access.  <br>Many in the room seemed to enjoy their meals so each to their own. Perhaps if I had been better prepared for our dinner in the city I might have been more amenable. Nonetheless eating out of a common bag of food with my hands and the hands/germs of my friends is quite unappetizing. At the very least I would have appreciated if they would have given me one of the small paper boats that they use for the chicken tenders, fries etc., but I was told I could not receive one. <br>They certainly have a brilliant idea for a low overhead, unique food establishment. <br>Just not my cup of crustacean.", "pics": null}}, {"review": {"des": "Pretty good for this type of place. I came here with a large group of people itching for some seafood. I tried the shrimp, which I thought was delicious at a decent price point. We also ordered the garlic noodles, which are tasty, but a little salty and overpriced for the amount you get (it's basically just noodles, garlic, salt, and tons of butter?). <br><br>Overall, pretty standard. There wasn't anything here that I wasn't expecting, but there were a few things I didn't get the chance to try. I've heard the popsicles are good -- maybe I'll try one next time?", "pics": null}}, {"review": {"des": "The Crab Pad in my opinion is the best cajun seafood place I have tried.  I have been to Angry Crab, Crazy Crab and Hot & Juicy.  I think the flavors are better here.  I got the crab legs with a mix of all sauces, sausage, potatos, corn.  They also have customized ice cream bars which is a must try!  Make sure to save room for them!<br><br>Service is great!  Opens at 3pm.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7mHF3FmtJpQ1ifZCFfXfsg/348s.jpg", "caption": "Yum!"}]}}, {"review": {"des": "I've been 4 times so far. I love this place, much better than some of the other restaurants in Chicago with the same theme. Great tastes and great service. Great spice.  A very fun place to take a date (as long as he/she isn't a diva who can't get her/hands messy).", "pics": null}}, {"review": {"des": "This place was nothing short of amazing!<br><br>For starters, there is plenty of space. I have heard from others that other similar establishments are very tight and congested; horrible for you to be in if you're claustrophobic. That is not the case here at all.<br><br>Our server, was great. He was super friendly and informative. Anything that we needed, he was there. <br><br>Now, I had the headless shrimp, on medium, with all three of their seasoning flavors mixed, noodles and potatoes in the bag. I swapped with my friend who did the snow crab legs. We were told that medium/mild wasn't hot, but my sinuses would beg to differ. By the end of dinner, we were all sniffing and trying to cool our mouths down. It was so good, we didn't want to stop though! We STUFFED our faces like there was no tomorrow! I love how you could taste the seasoning all through the meat, noodles, and potatoes. There are some places where the outside of what you're eating contains the flavorings and nothing else! <br><br>The friends that I went with also mentioned how it's so different from Angry Crab where you almost feel rushed to eat your meal and finish. We got to lounge and linger and event sign the wall. <br><br>They also have ice cream that is made in house and up near the front with UNLIMITED toppings!!!!! <br><br>I'll definitely be back! Buen Provecho!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/L1DMNuk3vcvGCvGyxE3KQw/168s.jpg", "caption": "Signed the wall!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/o2ClB0RZUgXno5LcF3GpSw/168s.jpg", "caption": "........After"}]}}, {"review": {"des": "I'm probably biased because I'm used to fresh, never frozen Maryland crabs but with the strong reviews I had high expectations. Snow crabs were cold and very obviously not fresh. Shrimp was ok, but again not the best. No flavor within the crabs either. Overall would not recommend. High prices and low quality crabs. <br><br>On the other hand service was great and attentive!", "pics": null}}, {"review": {"des": "This is my first time at Crab Pad's. I have read some very good reviews, so I've decided to give it a shot. I ordered the combo #1 ($80),  there is no meat in the snow crab, clams have only shells left, lobster tail is shorter than my Frenchie tail. I have also ordered 1 lb of King crab ($43), that came out to be a disappointment, too. I honestly have to use my phone to zoom in to look for some meat. Sauce was okay. I got the mild and medium house special sauces. I definitely like the medium spicy sauce  more. Garlic noodle is straight up garlic with some spaghetti noodles. Elote is a another disappointment. Who put hot Cheetos on top of Elote to replace the original condiments? I<br>am seriously getting crabby after eating at this place! The 3 star is for the popsicle! If you want to give this place a try. I recommend to bring some extra $$$ cause the crab shells ain't cheap!", "pics": null}}, {"review": {"des": "Finally found a place that has great service, BYOB, right ratio between oil/spice/butter, and amazing sides.<br><br>I've been to many cajun seafood boils in Chicago and in the suburbs. They had their flaws in service, ratio between oil/spice/butter, and sides. I was waiting for a place that would be great in those 3 areas. The Crab Pad is the place to go! This will now be my go to place when craving seafood boils. <br><br>Our server was very friendly. She went over the menu since we told her that we haven't tried The Crab Pad yet. She was very knowledgeable of the menu and had great recommendations to try out. She always came by to check up on us and asked if we needed anything<br><br>Food: We had 4lbs of seafood (2 lbs of whole shrimp, 1 lb mussels, and 1 lb crawfish). We did all the seasonings and medium spicy. The medium spicy was just right in our opinion. We were very surprised how big the mussels were. Normally at other crab boils it's fairly small. We also ordered garlic noodles and oh my!! So good! I want to go back to try out more of the sides that they had. Also I was curious of the Hot noodles that you can add to your bag. I'll try it out next time. I believe the noodles soak up all the oil/seasonings on the bottom of your bag that you can eat..YUM! The ice cream was a must since it was our first time. We loved it! We had the Thai Iced Tea and Green Tea Kit Kat. Must try! <br><br>I would for sure be going back here and I recommend everyone to go!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yah8JMNtWVoU3a0vcJZdtg/348s.jpg", "caption": "Thai iced tea ice cream with Oreos/fruity pebbles"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HXRefLz66PD9GvmOEgO0zg/168s.jpg", "caption": "4 lbs (2 lbs of whole shrimp, 1 lb mussels, and 1 lb crawfish)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ekKf5xsFPiy2FvUrUJYZXQ/168s.jpg", "caption": "Garlic noodles"}]}}, {"review": {"des": "Great food and delicious! The only reason that I'm giving a 3 stars is because last time that I went there I had a bad experience with the table that it was very stick that and the toilet it was dirty. The only reason that I'm saying this is because I will try one more time.", "pics": null}}, {"review": {"des": "So glad I found this place. It's basically like Angry Crab, but with better service, better quality food, no wait, and the best part: customized ice cream! <br><br>I came here with a couple of friends on a Saturday afternoon for an early dinner. It's in Logan Square, so parking wasn't hard at all. The staff was very welcoming as we were seated right away since we came early (5pm). Our waitress was very friendly and walked us through the menu and how the restaurant works (many places do things differently) but it was basically the same as the other restaurants like Angry Crab or Asian Cajun. <br><br>All the reviews talked about how great the garlic noodles were, so I ordered them as an appetizer. Definitely worth it!! Garlic and parmesan goodness. I'll definitely order this again next time. For $8, we were given a pretty large portion so it's worth it.<br><br> I was happy to see that crawfish was available even though it wasn't in season. I ordered a pound of snow crab legs and a pound of crawfish in crab pad style (all sauces combined) and in spicy. The crab pad style sauce tasted identical to Angry Crab's trifecta sauce, but without all the excess butter.. I loved it!! It also came with whole cloves of garlic--another huge plus. I have a high tolerance to spicyness, and the spicy was just perfect for me. The crawfish was a little salty, but that was expected since it wasn't in season. My boyfriend ordered the shrimp, they were huge. We were really happy with the way things turned out. <br><br>In the corner was a Milk & Wood ice cream pop bar. What I liked about it the most was that they had different flavors rather than the traditional ones like vanilla or chocolate. From what I remember, there was Green Tea Kit Kat, Thai Tea, Cookies and Cream, and more. I got the cookies and cream, and topped it with dark chocolate, mixed nuts, and oreos. SO GOOD! But pretty messy, so be sure to eat over the paper boat. <br><br>Again, this place is probably the closest thing to Angry Crab, but I'd definitely prefer this place. The staff was awesome, the food & sauce was awesome, and no long waits! The only thing that was kind of a letdown was that they didn't offer bibs--so don't wear anything nice otherwise you'll have lots of stains on your shirt.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Ofxilb7NFZy1dvTDlufg8w/348s.jpg", "caption": "Cookies and Cream customized bar at Milk and Wood"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/awpokUH2eXHiVRalXVVIiw/168s.jpg", "caption": "Whole cloves of garlic! Yum!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JJ_efrMom0s7ivpnJnVbvQ/168s.jpg", "caption": "Snow crab legs and crawfish in crab pad style sauce in spicy"}]}}, {"review": {"des": "Free Parking across the street! <br><br>Soooo worth the wait! Snow Crab Legs w/Medium Spice, Garlic Butter, Sausage, Potatoes, and Corn! I was ready for the bag of goodness, especially because I had my Fat Fighters on hand. It's BYOB so bring your favorite beverage. Otherwise they have fresh tea and soft drinks (free refills). Popsicles will be next on my list.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AbSvmpq-wEi93LwBKlFm8Q/348s.jpg", "caption": "Prices are by the pound. Pick your seafood. Pick level of spice. Throw in an add-on if you'd like. Eat Up."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HjONN6T2yhD_CkMXP0UavQ/168s.jpg", "caption": "Before I started dancing because of the bag of goodness!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/x6G0PPwlfNAmWJpDhZV_GQ/168s.jpg", "caption": "Bag of Goodness"}]}}, {"review": {"des": "Yaaaaassss! Actually stumble upon this place by accident. Didn't even knew it existed until we were looking for places nearby since our $1 Thursday flautas was a fail. I was actually craving boiler food and we were actually going to go to angry crab in wicker park but then actually saw the crab pad so we were like why not try something new. <br><br>Thank goodness we did! Overall great experience (: Staff was very nice and accommodating. Our server actually recommend a pound per person and I should have listened because the third pound left us rolling out the door because we were super stuff.  Food was amazing! Mussels and shrimps were amazing. The crawfish fell on the little side though. Sauce was on point and tasted excellent. <br><br>Such a cute concept in having an pop bar there as well for dessert. They called it milk and wood. We were so stuff but who knows when it's going to be the next time I can stop by so we definitely got a bar to share. Tried the Thai ice tea and it was amazing. I wonder if it was in house made as well, it was so milky and tasty. Such a cute concept to put any toppings you want on it just like when I went to popbar in LA but I wish i was able to coat everything on both sides but overall: great experience!<br><br>I will be back!", "pics": null}}, {"review": {"des": "This was my first time having this style of seafood in a bag. It's a super fun experience and I definitely recommend it! We got the crab legs, mussels, and crawfish. It is more than enough for two people. We also had the garlic noodles that everyone raves about and we enjoyed them but didn't think that it was exactly as great as everyone says. It's very messy so definitely do not go in wearing a super nice outfit! Take advantage of the free bibs and then have fun! <br><br>The popsicles are also very tasty. We got the strawberry mango one and it was the perfect end to our dinner!<br><br>Overall a super fun and messy dinner experience for all!", "pics": null}}, {"review": {"des": "Neyra told me to yelp. So I'm yelping. This place is good. Prices are pretty standard. Cool popsicle from Milk&Wood. Come check it out.", "pics": null}}, {"review": {"des": "Second time to this place. Always so good! The service is good, food is amazing  love their giant shrimp haha. Plus you can have ice cream after cajun!", "pics": null}}]}