{"name": "the-map-room-chicago", "reviews": [{"review": {"des": "I had a great time at this bar! Our bartender was so so friendly. He took time to ask each of me and my friends what kind of beers we liked and proceeded to give us each a taste of ones he'd thought we enjoy that night. I really appreciate when bartenders take the time with customers like that :) ambiance is chill, the space is amazingly decorated with maps and National Geographics. Great place to grab a couple beers with friends.", "pics": null}}, {"review": {"des": "Amazing place to grab a beer and dream up a fantastical trip in a land far away.  A huge, versatile tap list and plenty of old school travel guides is quite the combo to fuel your wishes to venture to the other side of the Earth.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vFKkVF1DI3er1Ryd00hrVQ/348s.jpg", "caption": "Great tap list and enough travel guides to plan your trip around the world, definitely a unique place to check out"}]}}, {"review": {"des": "Chicago has a million bars, probably. Amidst the plethora of options is The Map Room, my favorite spot for coffee, beer, and good music, especially while I work. <br><br>Don't get too excited, it a Pandora playlist, not a live jam band, but if you like Motown, alt-country, bluegrass, and non-rock tunes, this is the place. <br><br>I go to The Map Room once a week. They're open early, have a terrific breakfast sandwich, coffee, and good wi-fi.  The bartenders are kind. Drew, one of the bar tenders, is friendly and provides excellent service, always. <br><br>They serve Intelligentsia coffee. The beer list is extensive, and bouchée. There is something for every palate, from beer to liquor. <br><br>If you want a break from the traditional coffee shop. If you like Chris Stapleton, Gillian Welch, or Jason Isbell. If you want coffee at 8am and a bourbon aged vanilla bean stout at 11am. The Map Room's for you. No children. No animals.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8L8T03m-n0ZRTxzvIly6kQ/168s.jpg", "caption": "The inside of The Map Room, toward the back."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/chgAAolROPcd9YZV3Xi-LA/168s.jpg", "caption": "Vanilla Bean Stout, aged in a bourbon barrel, 10.2%. Excellent."}]}}, {"review": {"des": "On the third and likely final Map Room visit of my current Chicago stay, I was happy to find the Monday cold meat and cheese buffet back in operation.  From the beer side, three more new items:<br><br>- BuckleDown Shady Aftermath Robust Porter.  6.3% ABV.  Dark but clear red-brown; one-finger tan head, lacing the glass.  Coffee and raisin nose.  Caramel-y roast malt; nutty; bitter burnt-coffee finish.<br><br>- Pollyanna Nose Over Tail Maibock.  7.0%, 28 IBU.  Clear amber; light white head, with lace.  Weak malty nose.  Nice balance of sweet bready malt and noble hops.  Slight caramel and peach notes.<br><br>- Deschutes The Dissident 2016 Reserve (bottled).  Ale brewed with cherries, 40% of it aged in French oak pinot noir barrels.  10.9%, 30 IBU.  Clear chestnut, light tan halo head.  Winy nose, with a definite cherry presence.  Tastes of sweet malt, Candi sugar, and cherry; ethanol warmth, and a slight funk, from its wild yeast strain.  Overall, rather sherry-like, and delicious.", "pics": null}}, {"review": {"des": "Very cool beer bar with maps all over- only con would be that the name/bar theme is deceiving..they certainly are not as diverse with their beer origins. Mostly American and German beers. Not much else, but definitely a variety within those two countries! Pretzel rods for those that sit at the bar.", "pics": null}}, {"review": {"des": "Straight off the plane a few weeks ago, came here for a friend's \"change of job\" party. Cool place with a lot of beers, friendly/local crowd. Did I mention lots of beers?<br><br>Not much else to add here. The service was cool and we had a good time for an hour at 3pm on this particular Friday.", "pics": null}}, {"review": {"des": "Bar with interior that has map and travel decorations all over it.  On a Saturday night there is no line to get in, but table space is limited (it is possible to reserve a table in advance for a large enough party).  The beer selection on tap is large, and then they have even more bottle options available.  And this is before mentioning that they offer a full bar and can make any cocktail you can name.  The internal noise is reasonable (one major complaint I have about most other bars), so you can have a meaningful conversation at The map Room.  As someone who enjoys a wheat beer, the on tap selection was limited to Allagash White, but there were bottle options I chose to forgo.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/x8Q3qVkxwibo9KhY0oX_CQ/348s.jpg", "caption": "Allagash White"}]}}, {"review": {"des": "What a fun little spot!great service, cute bartenders and great Collection of books and art. I had great drinks And tea. Haven't tried the food but will do next time, cause I'll definitely be back! :)", "pics": null}}, {"review": {"des": "This is place is pretty chill! They have a very extensive list of beers for people who are into that, but if you're like me and overwhelmingly dislike beer, they also have a nice amount of spirits and they have coffee,too. My mimosas were great and again, despite not really liking beer, my friend's beer was doable. He drank it quick, so I'm guessing he liked it! The bartender was very friendly. <br><br>There are a bunch of National Geographic magazines and Lonely Planet books that I suppose you can grab. My partner and I sat in a corner and worked on a few things, on our laptops,but there were people just hanging out with each other as well! It's a nice bar to do both and there is no pressure to do one over the other - it has a very relaxed setting.", "pics": null}}, {"review": {"des": "The Map Room appears on nearly every list I've seen of \"must visit\" Chicago bars, and I can't figure out why.<br><br>The Map Room's decor is surely interesting.  Opposite the bar, the wall is lined floor to ceiling with National Geographic magazines.  The ceiling fans are unique and anchor the look.  Other walls are wall-papered with various maps and flags from around the glove.  A nice look, but hardly warrants a special visit.  <br><br>The beer list is extensive.  Each pour is served in its prescribed glassware, a nice touch to be sure.  <br><br>I believe the Map Room's appeal must be for folks that want to be able to have a beer in a coffee shop.  It's a nice place to open a laptop, drink a beer or two, and enjoy the laid-back atmosphere.", "pics": null}}, {"review": {"des": "The Map Room has been on my hit list for quite some time. I'm a beer chick and I've long heard Map Room is one of the best beer bars around town. When a guy wanted to go here for our first date, I was totally game! The way to Sarah's heart is good beer and good food, that's fo' sho.<br><br>Pro-Tip: They used to be ca$h only but I saw this past weekend saying they now take credit cards.<br><br>Their beer selection is stellar and prices aren't bad. I was able to try a bunch of new-to-me beers including one nitro which was fabulous for me because though I love beer, I could do without all the carbonation. I had Firestone's Nitro DBA, Hopewell's Old Duck Barleywine (which I had tried to get at the brewery earlier that week but they ran out so that was great) and...Jamo shots. I'm too old for that! Anyways, great on draft beer list...but even better bottled list! Impressive. <br><br>At one point, I ordered a couple of beers and they tapped out of one I ordered. The bartender ended up giving me the last half glass on the house which was pretty cool of him.<br><br>Along the wall, they have tons of National Geographics. I felt like I was in my Grandma's house with all the magazines and random stuff around the bar. We actually opened one up and started Oooo-ing and Aaaah-ing at the photos. Made for some random fun!<br><br>Pro-Tip Numero Dos: BYOF! Bring Your Own Food.<br><br>It wasn't overly crowded on a Saturday night but every table and barstool definitely got full. I liked the chill atmosphere, great beer selection and friendly bartenders so could see myself coming back here many times over.", "pics": null}}, {"review": {"des": "Great location, great coffee, great beer selection, and great vibes.  In the morning they serve Intelligencia coffee, which is great coffee but I believe it's expensive.  At the Map Room it's cheaper than what you would spend at the cafes.  It's also right off the 606 which is a big plus for early morning exercisers.  At night the beer list is staked.  The map is a gem of a spot!", "pics": null}}, {"review": {"des": "Oh hey, what's up? It's me again. So, I somehow ended up at the Map Room. It may have had something to do with me driving directly here, I don't know. Anyway, they have these huge open windows and there's this subtle breeze, and man..what was I saying?  I'm drinking something delicious. It's a Lizard King, if you're keeping track. The crowd is pretty awesome, and quite bearded. You'll like it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zZpjOnBdv3TE36td5eR9hg/348s.jpg", "caption": "Oh the Map Room. You are so full of maps. I like it."}]}}, {"review": {"des": "Fine enough local jaunt. Solid beer selection and all. It was pretty crowded, but then again it was a Friday. We posted up at the bar and tried a beer or two. If I lived in the neighborhood, I'm sure I'd swing by a decent amount. It has all the bases covered.", "pics": null}}, {"review": {"des": "A little disappointing. We stopped here as a suggestion from a local beer advocate. They did have a long list of beers but the menus weren't even updated. We sat down and happened to order all the beer they no longer have.", "pics": null}}, {"review": {"des": "I'm not sure what this place is like at night but I went in during the day. Never been here before and asked if there was WiFi to which the bartender politely informed me they did, however when I came back momentarily and sat down at a visible table absolutely no one saw to me. I made eye contact with the bartender confused several times and no one presented me with a menu. No one told me the WiFi password, for 30 minutes I was sitting until I decided to pack up and leave because I was so hungry and in dire need of coffee.", "pics": null}}, {"review": {"des": "I am a Nat. Geo fellow with some other awesome teachers in Chicago.  We are all fellows from different years and organized a \"meet up\" at The Map Room.  What better place, really.  <br><br>It was a great place to do this.  There are maps everywhere you look. Our table was actually flanked by National Geographic magazines.  And, that just added to the fun. <br><br>We all had some drinks and shared some incredible stories from our adventures.  You see, Nat. Geo sent us all to different parts of the world.  Myself and another to Antarctica.  Another to Iceland and Northern Canada and another to Arctic Svalbard to chase Polar Bears. <br><br>The place is definitely a neighborhood bar that is out of the way. But do go out of the way for it. The staff was great. They had meatballs free to the patrons in a crockpot and my drinks were pretty decent.  <br><br>Enjoy and imbibe!", "pics": null}}, {"review": {"des": "Cool little cafe/bar in Bucktown (why can't all places sell both lol) we went at 10am so sadly couldn't order beer, but I got grapefruit juice, which was pretty standard, I just had had coffee, so didn't wanna die by ordering it again here, but it's inteligentsia so I know it's good, solid beer list, would be down to chill and rink coffee or beer/liquor here. An overall cool vibe in a quiet area right on Armitage. Hope to return at some point", "pics": null}}, {"review": {"des": "A great selection of beer and liquor, Love the indoor deco. They have a huge collection of National Geography and lots of traveling books like lonely planet series. Will definitely come back again just to fulfill my wanderlust :D", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dP62SDJgoRyftumuaTGhDA/348s.jpg", "caption": "The atlas"}]}}, {"review": {"des": "Decent place to grab a coffee later in the day - or a drink. Super chill vibe.<br><br>It's nice to sit by the windows, they had them open but it was getting chilly - would be rad in summer.<br><br>I tried to order a cortado and the bartender didn't know what that was - maybe that's too boujee of a request though, I dunno.", "pics": null}}, {"review": {"des": "They don't allow kids...which would have been good to know before we got a table and were ordering. The place was almost empty and our one year old was happily seated on my lap, not bothering anyone. Security guy at the door also didn't mention it when we came in. Might be good to have a sign outside or something.", "pics": null}}, {"review": {"des": "I don't go to bars during the day, and I don't drink beer. But upon my first visit I have fallen in love! I wandered in thinking it was a coffee shop; it's literally right across the street from the Starbucks I'd been headed to, and of course I'm gonna walk across and support something local instead! So I was pleasantly surprised to find out could still work on my laptop in peace but also enjoy a cheap glass of chardonnay. Love the decor and the feel in here. So much better than Sbux!", "pics": null}}, {"review": {"des": "I agree with the hype, it is one of the best bars in Chicago. Unpretentious, good brews, an almost always lively crowd in the evenings, and a lovely assortment of maps & National Geographic magazines as decor that you can appreciate. I'm also a big fan of coming here in the summer and trying to snag a coveted spot by the large open windows.", "pics": null}}, {"review": {"des": "This is the coolest place you could visit. Coffee, alcohol but it's the relaxed environment that is amazing! A lot of tables to sit down to chat with friends or do work on your iPad. This is my new go to place!", "pics": null}}, {"review": {"des": "Amazing beer bar and chill ambiance. But not as many wine options as I'd like. With 100 beers, you'd think there would be more than 4 glasses of wine to choose from. Totes understand a beer bar, but there's always someone in a group who's gluten free or doesn't like beer. Also, they used to have this really cool international dinner night but I think it's been quite a while since they did that. <br><br>Lost a star for the lack of wine selection. At least Quenchers has tater tots.", "pics": null}}, {"review": {"des": "This place has an amazing beer selection and a really fun vibe. I go on Friday afternoons a lot and it is surprisingly busy, but not too busy to get a drink. They also have free pretzels and cool, old (like from the 80s) magazines to look at. My only complaint is that they should have a couple of servers to service the tables so I would not have to get up and wait in the crowd at the bar for a drink every time.", "pics": null}}, {"review": {"des": "beer is good but fir some reason they wont turn on sound for worldcup futbol game????‍", "pics": null}}, {"review": {"des": "It's a BEER bar!   A very good one.  I come here once every blue moon (no pun intended, I don't drink that!) on a Saturday night.  Sometimes it's slammed, sometimes you'll get a seat at the bar.  The people are generally friendly here and the bartenders know their stuff.  It's definitely a place for beer enthusiasts, and I am hard to please.... but I will always find something on the menu that I went to drink even if it's $30 - $40 for a bottle (example:  limited production beers such as Brickstone Dark Secret, Deschutes The Abyss Brandy or Scotch Barrel aged etc. don't expect them to be there when you go there.)  The beer menu is changing frequently and there's always a huge variety of beers on tap and a VERY extensive bottle list.<br><br>Sometimes there's a Cubs game on and people do congregate there to watch the game on the small television.  This does attract some non-beer enthusiasts but they do offer peasant beer for those that choose to drink such beverages.<br><br>Usually friendly people, I've had good conversations with the bartender and patrons.  It's a great place to buy something nice to drink and share with others around you.  Just make sure you eat something before coming here or you'll get a bit drunk :-)", "pics": null}}, {"review": {"des": "Up until today, I enjoyed coming here often. Today, like many days during the week, I held a meeting at the Map Room and we usually stay about an hour or so. I normally leave my tab open at the bar and my employees order away - mostly breakfast sandwiches and coffee items. I had forget my wallet at home and was going to go grab it after the \"meeting\" and come back to get some drinks and do a little \"work from home away from home\". When I was standing out front, the bartender/barista came out to tell me \" I know you come in here all the time but today no one ordered anything. You know there is a library down the street that you can go to. It is expected that everyone at least orders a coffee\". I apologized and quickly explained to him that I had forgotten my wallet at home and was going to grab it and come back. He didn't seem to care what the reason was and continued to go on about how no one ordered anything. He even mentioned that the other bartender commented on it being so busy but not a lot of sales. I have never NOT ordered anything here. Over the fast few weeks I have spent $133.81 on coffee at the Map Room. As a business owner, I would never ruin a relationship with a customer over a few bucks. Pathetic. Rude. Embarrassing.", "pics": null}}, {"review": {"des": "Pretty solid bar.  I came on a monday night while a Bears game was going.  Wasn't as crowded as I would've expected for a home game, which was nice as I wasn't fighting for service.  You have to order from the bar and the bar staff is very knowledgable and offers samples of some beers if you want (unfortunately no flights).  Since it was a monday, they had a free buffet in the back with some cheese, fruit, bread, and other goodies.  No fresh food, but free snacks are always a plus.  <br><br>The beer menu itself is very good.  They have a rotating list that can match most places in the city.  Then they also have a very extensive bottle list, with a bunch of Belgians that other bars don't offer.  My complaint is about the bottle list which doesn't show prices.  Other than that this is a great neighborhood bar with a unique decor that I wish was available where I live.", "pics": null}}, {"review": {"des": "Nice place to sit down and have a drink with friends. Prices are fair, pours are fairly generous, interior is pretty spacious and not too loud (so you can hear people around you). I wish service was a little faster (with more staff to serve drinks) but they still managed to serve customers fairly quickly.", "pics": null}}, {"review": {"des": "Bumble date #2 blew up in flames at this fine establishment, located conveniently around the corner from my apartment! <br><br>Despite the questionable company, the bar itself was great! It is a combo of coffee shop meets  full bar with an extensive draft list. Bar has a really cool atmosphere and is much larger than expected with a lot of seating. Bartenders were attentive and knowledgeable about the beer list, which is important when its so vast! <br><br>Beer...check. Next time I will definitely be trying the coffee, or even better, maybe an early morning bloody mary. <br><br>As for the date, lets just say he didn't get as many stars as Map Room did....", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cv7XwASu6wTSINk2DBD5-A/348s.jpg", "caption": "Shiegl Goldbrau"}]}}, {"review": {"des": "Friendly atmosphere with great beers. Plus they open early and serve good coffee and breakfast sandwiches. What's not to love?", "pics": null}}, {"review": {"des": "Chill vibes, cool atmosphere, amazing complimentary cured meats/cheese/breads/mustards buffet. Came here alone feeling slightly self conscious and ended up having an amazing time.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RN-HeKmda5aG26zJdc029g/168s.jpg", "caption": "Interior pano"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZVUXYiWhVVr1l-hYkwLvVg/168s.jpg", "caption": "Complimentary buffet!"}]}}, {"review": {"des": "Can't believe I have never written up Maproom!  Great selection of beer and REASONABLE.  Excellent specials and great owners, Mark and Laura.  I've been coming since the very 1st day they opened about 20 yrs ago and they keep on getting better.  They've added cheese to the munchies list and it compliments the beer, wines and ales.  $5 bloodys and mimosas on Sundays.  BTW - knowledgeable bartenders so if you need a suggestion just ask.  One more thing --- cask conditioned available from the beer engine.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1j4mhCpWCKDzomnxStRmCQ/168s.jpg", "caption": "Can you say cheese?"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DLsxjt0vwV0oK-VjyUYcTQ/168s.jpg", "caption": "framboise!"}]}}, {"review": {"des": "Cool place! It has a pretty impressive beer menu, and a good amount of seating...though many of the tables didn't have chairs, which me and my girlfriend found odd.<br><br>Anyways, I'd recommend it if you love beer. It's the kind of place I'd think of to go out with a few friends and appreciate a new brew.", "pics": null}}, {"review": {"des": "After a short walk along the 606, headed over here to get some craft brews and a general vibe of the area. Divey bar feel and not too crowded on a Saturday evening.<br><br>Cool draft list with a lot more international options than I expected. Settled on a couple local brews instead (all ranging between $5-6). Bartenders are friendly and give good recommendations on the brews they pour. Also, free pretzels!<br><br>Overall a good spot for beers and chats (not much on TVs or regular food).", "pics": null}}, {"review": {"des": "My favorite bar in Chicago. Comfortable space, terrific staff, fantastic beer.", "pics": null}}, {"review": {"des": "love this place. Very good vibe and good beer selections and daily specials , will be back for sure", "pics": null}}, {"review": {"des": "I'm 50/50 here. The beer was good the vibe wasn't great. No one spoke to us, seated us, nothing it seemed like a place not interested in new business", "pics": null}}, {"review": {"des": "The best of the best of the best of the best bars period (a bar for beer)<br><br>The staff is Cool as hell, not overbearing so you don't feel like yr at Applebee's yet they are helpful and kind.  I truly wish they could tutor 90% of the bartenders throughout this city on the finer points of being (and not being) present.<br><br>The music is always good and eclectique! TVs are present but discretely placed and often turned off.  Lighting is a dim warm glow, just bright enough. Walls and shelves covered over in travel paraphernalia like maps and National Geographic's along with a healthy blend of Belgian beer signs. Overall atmosphere subtly removes you from everyday concerns.  <br><br>The beer.  All the right beer.  The draft menu flaunts a healthy share of adventurous new selections mixed with the pillars of fine beer that you look forward to having specifically at Maproom because their taps are spotless clean and their kegs are fresh as hell (Alpha King always tastes like the heavenly nectar it's meant to).  Intimidatingly vast bottle selection.  Plus the bartenders here actually know to put a proper head on a glass of beer, a dying priority that is so damn crucial.<br><br>The vibe here like no other bar I know.  I am utterly grateful for Maproom and it's incredible staff who have maintained a chill, enthusiastic warmth for the decade that I have known them. A true sanctuary in an occasionally frustrating world.  <br><br>Cheers you guys and thank you!!!!!", "pics": null}}, {"review": {"des": "Five stars on any day but Monday or Tuesday. For a bar that's a tremendous place to spend an afternoon - over coffee or a tasty beer, solo or with friends, studious or social - those two days are a painful window of time when you *don't* want to be in The Map Room. A talkative (to put it politely...) old gentleman holds court at one end of the bar ruins the vibe for anyone unlucky to sit within about five bar stools or 2-3 tables distance from his perch where the aged fellow (technically an employee) holds forth in salty language on whatever subject happens to cross his mind, much to the irritation of anyone in his general vicinity much less unfortunate enough to sit nearby. On a recent Monday afternoon, he drove away no fewer than four patrons at the bar and so irritated another (a regular) that he relocated to the far end to seek refuge. You'll know the aged fellow if you see him. Better to find a table at the back wall or best yet, not come in at the beginning of the week.", "pics": null}}, {"review": {"des": "This was my first visit to the Map Room.  Wow I'm a wine guy but this is a beer lovers paradise.  If you can't find a beer you like here get a life!  The choices here will overwhelm you, there are at least 20 beers on tap and well over 50 bottle beers.  The bartenders are very knowledgeable and quite friendly.  <br><br>Ok when I drink I like to eat.  I don't believe there is any food offered at this bar.  I saw a lot of delivered pizza but no in-h ouse food.  <br><br>I went there on Thursday night and it was packed.  It was a very mixed crowd. Singles, couples, & folks out on night out.  Great climate and good atmosphere.  This bar has a great neighborhood atmosphere.  This is a Chicago classic!", "pics": null}}, {"review": {"des": "went here on a first date. it was alright lol but there was no second date. regardless, I was at least impressed that he chose this place bc it's actually pretty cool and laidback. the décor takes after its name. decorated with maps and other travel paraphernalia. they have a pretty extensive beer list. I'm a fan of dark beers so I'm glad they had a few options for me to choose from. I always get a little annoyed when bars only have IPAs or something. most beers are $5-$7 and I really liked the 2 that I tried:<br><br>Begyle Neighborly Stout 6% abv<br> An American-style Dry Stout - smooth and quaffable, with a strong roasty backbone - $6/20oz<br><br>Great Lakes Alberta Clipper 7.5% abv<br> A strong, rich, and smooth American Porter with tart raspberry and chocolate notes - $6/16oz", "pics": null}}, {"review": {"des": "Intelligentsia coffee and craft beer in the same place with responsive bartenders and enjoyable clientele? Yes please! <br><br>Why I didn't give them five stars: A friend of mine held a birthday party here recently, and they wouldn't let me in the door 30 min prior to close. The plan was to connect at the Map Room and then head to a third spot, and I had to sit out there on the street for half an hour, which sucked. Just fix the doorman and they'd have it all.", "pics": null}}, {"review": {"des": "Amazing beer selection, but the reason this bar stands out is the bartenders. Every time I come here I get amazing service. Even if the bar is packed- they will at least acknowledge you which is more than a lot of other places. <br><br>They also really know their beer. It's not like they just remembered a list of beers- they seem to genuinely know about and enjoy beer.  <br><br>Hallelujah for kind and knowledgeable bartenders! The world needs more of um.", "pics": null}}, {"review": {"des": "Last Monday, we visited this place while we were in the neighborhood. We walked in to an almost EMPTY bar and sat at a table. The bartender came over and ID'ed us then walked away without a word. After waiting for over 10 minutes we finally inquired with the bartenders why they weren't getting our order. They replied that it was bar service only. When I asked why they didn't tell us that when they checked our ID's, the bartender condescendingly said \"that's just how it's done, darling.\" <br><br>I have no problem with bar service. However, they did not make that clear upon approaching our table and checking our ID's. Why would you approach our table to ID us then not get our order? That's confusing and poor business practice. Afterwards, they acted as though we were an inconvenience to serve when there were only 2 people in the entire establishment. The bartenders were rude and condescending and after that experience we chose to take our business elsewhere. Go across the street and you'll be greeted and served promptly. I will never go back here. <br><br>I don't appreciate condescension or chauvinism from a bartender. If you don't like those things either, I suggest you go elsewhere.", "pics": null}}, {"review": {"des": "I drove an hour an a half to visit with Rogue Ale's President Al on his final stop on the Rogue Tour 2015.  The Map Room is awesome! Its located on the corner of Armitage and Hoyne. Its one of those classic bars with the windows that are open and you can see the world from your vantage points. They have an active and current draft beer menu. I had the stickee monkee from Firestone Walker. It was delicious. I spent time with President Al and showed off my rogue nation card as well as Logan's rogue nation card. Worth the drive and I cannot wait to visit again.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rnzWO0L4hf3ejogVti-aag/348s.jpg", "caption": "Firestone Walker Stickee Monee."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fbiTzeMcMYDW842H798cJA/168s.jpg", "caption": "Visiting with President Al."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9glB1AlkSAu7Qq5p9BDKzw/168s.jpg", "caption": "Rogue Nation Tour 2015."}]}}, {"review": {"des": "Wonderful bar! Great beer list, always something new. Relaxed staff and atmosphere.<br><br>By the way, about 4 times a year they host a \"beer school\" where they highlight a specific type of beer, usually seasonal, such as Oktoberfest, or Marzen beer and they have about ten different beers of this type for you to try with very generous portions. It's really fun!", "pics": null}}, {"review": {"des": "I can't believe I've never reviewed this place. We went here a ton when living in Bucktown. I loved coming here. Solid beer list, such a relaxing chill environment. Miss this place.", "pics": null}}, {"review": {"des": "Well, I'm probably biased because I've been coming here for almost 20 years, so that's worth a star.  Nowadays, it's reminiscent of older days, but still keeps true to itself.  National Geographic.  Anyway, great low key place, the essence of unpretentious Chicago.  Go on a weekday, enjoy the nice beers, surroundings, and pretzel sticks.  Great for having a beer or 4 alone... or with friends.", "pics": null}}, {"review": {"des": "Typical local hangout. Good drinks, reasonable prices, but nothing to plan your night around.", "pics": null}}, {"review": {"des": "I like a place that is not pretentious. The Map Room fits the bill. Everyone is so laid back.<br><br>Lots of different brews. Pretty reasonably priced. And when I was not sure what to order, the bartender let me sample the two I was considering, lest I make a choice I would not enjoy.", "pics": null}}, {"review": {"des": "If you want to try a new spot and be completely ignored this is the spot #never again", "pics": null}}, {"review": {"des": "Fun bar. Flip through Nat Geographics while choosing form huge beer selection.", "pics": null}}, {"review": {"des": "Super freakin awesome place. <br><br>Let me start by saying that I am not a beer drinker. <br><br>1. not a beer drinker<br>2. single female <br>3. out drinking by myself on a weeknight<br><br>Awesome combination, right? Sure...<br>As you can well guess, I was pretty intimidated walking in to Map Room because from what I hear, they are the beer gods. Not to worry though, the bartenders took really good care of me. <br><br>I admitted I was naive when it comes to beer and the bartenders were more than happy to school me on what they had in stock. I sampled multiple beers and tried full glasses of a few. I was really happy that the bartender (i hate that I can't remember his name) tried to help me figure out what I would like. <br><br>I mentioned that I mostly drink rum and not beer and they steered me towards a dark and stormy at one point. Superb. <br><br>Looking forward to going back soon.", "pics": null}}, {"review": {"des": "Bar tender with beard was a knob.  Will never go back.  Too many good bars in chicago to waste your time with this on.  This knob actually made one of tge ladies in our party cry.  We spoke with our feet and left after the drinks tgat were paid for werr done and left zero tip.", "pics": null}}, {"review": {"des": "Really great ambience, fantastic beer selection, and nice location. However, the prices for a lot of the beers are a bit high and it can be pretty tough to get service. That said, the bartenders know their stuff and are friendly. They're just real busy. It's on the noisier side, so keep that in mind. If you're trying to track down an exotic beer, definitely try the Map Room as they easily might have it.", "pics": null}}, {"review": {"des": "Great spot for a surprisingly large selection of beers. Excellent and friendly service. Local gem. Also don't underestimate this place for a great cup of coffee! Can get pretty packed in the morning towards the end of the week and on weeknights. Insider tip: Monday's and Tuesday's they put out a smorgasbord at around two that you can help yourself to. Don't forget to tip them well!", "pics": null}}, {"review": {"des": "This place is pretty cool. The decor look like an actual map room, something out of Indiana Jones or Tomb Raider.<br><br>A pretty great selection of beers and ciders from all over the world.<br><br>There is free wi-fi, so if it's too crowded at Starbucks down the street to work on that screenplay, come here and enjoy a beer while you write the next great Oscar-winning film.<br><br>Just remember to bring cash.", "pics": null}}, {"review": {"des": "Excellent spot to drink, get some work done, or do a little of both.  I've come here twice, both times during the day on the weekend.  I've noticed a mix of groups of friends hanging out and people working on their laptops, which I love.  The beer selection is great, and the bartenders are quick and kind.  The only downside is that it can get a little bit loud!", "pics": null}}, {"review": {"des": "Wandered into this oasis with very low expectations. I had already heard that it was cash only) so I was prepared for that. Beyond that, I had no clue what to expect. People I talked to seemed to like it but no one really sold it.<br><br>I am prepared to sell it a bit better. This place is a great spot! Yes, it's cash only. And, yes, that's kind of inconvenient. But, c'mon! We are a city that has proven willing to stand in long lines for a hot dog stand. We can't make a stop at an ATM for a worthy watering hole?? Of course we can!<br><br>It was a very lovely day out when I went and all the windows were open to the street. My main regret was not snaring one of the stools at the window so I could people watch on the street AND people watch in the bar. <br><br>National Geographics and old travel books line the walls everywhere. Perfect conversation starters if needed. The draft beer list is updated daily and they have a ton of bottle options. The beer prices are typical - not cheap but not higher than any other bar in the area.<br><br>The vibe of this bar is totally relaxed. I could have hung out here all day quite happily. Free Wi-Fi too...so maybe I should have stayed there all day...<br><br>So what do you need to know before going?<br>- Cash only<br>- No food (But apparently they have menus available of restaurants that will deliver there)<br>- No kids. A woman came in with a baby carrier and I'm pretty sure I saw her turned away. (I felt bad for the mom and dad who were denied a beer in a comfy bar. But I also understood that this was a bar and not a restaurant. So maybe babies and kids shouldn't be there anyway.)<br><br>I will be back Map Room!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ClA_HS1dmwRGKBPamCtZnw/168s.jpg", "caption": "Draft beer menu updated daily"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bnaitjCIhFNx_9eXdjRCJw/168s.jpg", "caption": "Beer, beer, beer :)"}]}}, {"review": {"des": "Except for the ATM (cash only) and hipsters, walking into the Map Room is like walking into my dad's basement . Maps, massive amounts of National Geographic magazines, and British beers. <br>As one who travels to many beer bars, the beer selection at The Map Room was good, not great. It was also challenging to get a beer with no server and trying to catch a bartenders attention. I was expecting something more from a top ranked beer bar.", "pics": null}}, {"review": {"des": "Really closer to 4.5 stars. I can't imagine a homier feeling bar. Superb draught beer selection, decent prices especially the beer of the month and friendly bartenders. BYOF! Great place to order a pizza to. <br><br>FANTASTIC coffee believe it or not. I have no idea how Starbucks stays in business across the street. Better prices, environment and quality. They serve intelligencia in all styles. Great espresso.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mp3kIrm-oVqT6OnQCTr0rQ/348s.jpg", "caption": "That Saturday morning transition. Nice cortado, then on to something more fun"}]}}, {"review": {"des": "Maybe I have unrealistically high expectations, but being called the \"Map Room,\" I literally expected them to have at least one beer from almost every country.  I was pumped to try something crazy like an Estonian or Argentine beer.<br><br>The beer list is still pretty long, but I let my imagination run wild earlier.  I had a German beer with a light banana flavor.  It was refreshing, tasty, and I was able to relax after shopping and running around on Milwaukee Avenue earlier in the afternoon.<br><br>They do not serve food, and it is cash only.  There is an ATM inside in case you've forgotten to bring cash.  There is free WiFi, and the locals are not shy about using it.  There were quite a few people leisurely drinking and using their laptops.<br><br>We even studied our tabletop a little bit, it was covered with foreign currency including Polish Zloty, a Jamaican note for something crazy like 1,000,000 but it was worth less than a dollar, and a U.S. $2 bill.  And of course there are maps covering the walls, including foreign beer advertisements.  I couldn't keep my eyes off of that neon bunny!  Yes bunny, I will drink you!<br><br>Fun concept.  Good beer.  Relaxed atmosphere.  I'd go back.", "pics": null}}, {"review": {"des": "If you are into beer, anytime of day then this place is for you. They have a pretty large beer list here and it is a no frills, cash only bar that takes their beer drinking pretty seriously. There is also no food here so with high percentage beers you may be eating a lot of the free pretzels to try and keep up with all of the beer you want to drink here.<br><br>And I love the old national geographics and maps and such around this place too. It is called the map room after all. And if you aren't a big beer person some people on weekends here as we saw since we came here early on a weekend, come here to just grab some coffee (or a coffee stout ha ha) and then pull up a chair and get their laptop out to do some work, grade some papers, you know. So earlier on the weekends this place is pretty empty and a good spot to get some work done. In fact the bar tender told us people come during the week to get work done there all the time. So if you are in the area, this place could be a nice alternative to your typical cafe!", "pics": null}}, {"review": {"des": "Love the Map Room.  Great bar and a totally chill vibe.  When my husband and I wanted to do a small going away party get together we immediately thought of the Map Room.  They were totally and completely accommodating and flexible. Their staff, specifically Laura, helped to make sure we had tables reserved and room for the food we brought in.  Everyone there was incredibly friendly and as a result all the people who came had a great time.", "pics": null}}, {"review": {"des": "This is one of the places that you will either  hate or love.<br>The good: The beer. If you are a hardcore beer fan this place you will love. Three floyd's on tap. No more needs to be said really, but do note that they have about a dozen other taps of very serious beer. If you are not a beer snob, they have more then a hundred bottles including cra.......er, popular domestics like miller, pabst etc. <br>The bad: The service can be spotty. Since there is always a crowd pretty much from open to close, the staff see no real need to coddle their customers. Unless they like you. Planning to go there as part of a large group/pub crawl? Yeahhh, good luck with that.<br>The odd: this is a cash only place-no cards accepted. If you do not live nearby it can be kind of tricky to get there. There is limited parking and no el stop close by.<br>Tips: Bring cash. Be super nice to the beertender/waitstaff. Know what you want,(if it's not on the menu maybe you shouldn't try to order it) and always  try anything on tap from  three floyds.", "pics": null}}, {"review": {"des": "It's been a good six or seven years since I was last at the Map Room and my experience then was awesome. Great extensive menu of beers,  yadda yadda.<br><br>Tonight's experience on the other hand....I got kicked out. Actually, I got escorted out. I'm 5'2 and not one, but TWO  bartenders felt the need to escort me out.<br><br>I was there was a friend at her friend's graduation celebration. I only knew my one friend. First of all, getting to the bar was a pain in the ass, it was that crowded. I didn't realize they were cash only (when did that happen?). I ordered a drink, they served it, I handed them my credit card and that's when I was made aware of their cash only policy and they took my beer back. I couldn't take out money from their ATM as I didn't have my debit card. Oh well, I thought. I'll just hang out with the people I just met that are drinking. <br><br>About 15 minutes later, the bartender that served me, came up to me and said, \"Hey, didn't you order a beer and never paid for it?\"<br><br>Me: Yeah, sorry I didn't realize you were cash only and I can't take out money using my credit card.<br><br>Bartender: So you mean you don't have any friends that are going to pay for your drink?<br><br>Me: No, I'm not gonna ask strangers to pay for my drink. It's not that big of a deal.<br><br>Bartender: Well I\"m gonna have to ask you to leave.<br><br>Me: *laughs* (I thought he was joking at this point) <br><br>Bartender: You mean to tell me you don't have any money with you and you can't take out any cash?<br><br>Me: Right...Dude, what the hell? That's not cool.<br><br>Bartender: You know what else isn't cool? Ordering a drink and not paying for it.<br><br>Me: I never drank it!<br><br>Bartender calls another staff member and tells him, \"She ordered a drink and never paid for it, and she's refusing to leave.\"<br><br>Staff: Mam, you're gonna have to leave. You need to leave through the back door please. <br><br>I didn't even get a chance to say bye to the people I was with and forced my friend to leave her party.<br><br>So if you ain't drinking, you can't hang out with others that are drinking. Eff you Map Room Staff!", "pics": null}}, {"review": {"des": "Incredible beer bar, divey decor, beer paraphernalia. Large wooden bar, some tables, no food though. Three Floyds, Half Acre, and other local craft with one-offs and specialties. Extensive vintage bottle list with older vintages of Three Floyds Behemoth for instance. Staff were beer experts and were patient as I sifted through the bottle list. Prices were not bad considering the area. Had a blast here!", "pics": null}}, {"review": {"des": "Hands down my favorite bar in the city.  If you're anything like me, you're not a fan of loud bars where you need to fight a crowd of people so you can order a $5 Miller light.  That's where the maproom comes in.  Here's the low down.<br><br>- At least 20 awesome beers on tap.<br>- Crowds seem to disappear after about 10pm so getting a table has never been a problem.<br>- Bartenders might seem a little surly but they mean well.  <br>- Relaxed atmosphere to hang out with friends over the aforementioned great beer.  <br>- No food served but tamale guy makes his rounds a few times a night.<br><br>I've been here too many times to count and it's always been a good time.  It's worth a special trip just to try some beers you might never have even known existed.", "pics": null}}, {"review": {"des": "Very cozy, neighborhoody atmosphere. Good beer selection (I am not a beer expert, but my husband definitely found some that he's been trouble getting elsewhere); friendly, easy going vibe; affordable prices; we went twice in the same night.<br>They do not serve food, from what I can tell.", "pics": null}}, {"review": {"des": "Great selection of craft beers at respectable prices. It is cash only so make sure to visit an atm beforehand. My best friend lives about a block away from Map Room, so I am in heaven to say the least. I feel like a kid at a candy shop when I am there because it's always a battle on what new brew to try.<br><br>The set up of the bar is decent. Typically this place is packed do get there early if you want to have a place to sit and enjoy your beer without bumping too many elbows.<br><br>Highly recommend a visit to this amazing establishment if you are into cozy, neatly decorated bars with an epic selection of beers.", "pics": null}}, {"review": {"des": "This place is pretty cool. It's reasonably priced and has a laid back feel. It was lively but not crowded when I went on a Saturday night. It's a good semi-divey bar.", "pics": null}}, {"review": {"des": "It is the goto place for craft beers in Chicago. So many to choose from and priced very reasonably.", "pics": null}}, {"review": {"des": "Good bar! Great beer section! Bartenders are knowledgable of the beer selection They also have outlets for computers and coffee. Highly recommended if you are in the area.<br><br>The bar is not cash only!", "pics": null}}, {"review": {"des": "Cash only<br><br>Cool bar.  Went there with friends.  <br><br>You have to go up to the bar to get your drinks.  Didn't see the restrooms.", "pics": null}}, {"review": {"des": "I arrived at Map Room after escaping the madness that is downtown Chicago on St.Patty's day (or whichever day around the holiday that's celebrated). When I arrived around 3pm, there was a guy at the door that said they were at capacity and to wait in line. So, the 7 people standing outside weren't just smokers, they were waiting to get in. We decided to wait since several people were walking out of the bar, and luckily, we were inside within 5 minutes.  <br><br>The bar wasn't too crowded, which was a pleasant surprise after having to wait in line. We picked up a sticky beer menu at the bar, & began to narrow down my craft beer selections. Map Room has a great menu of craft beers, and they are at really decent prices! I had a Three Floyd's pale ale that was citrusy and delicious.<br><br>After grabbing a beer, we mingled with some friends and hangout for a little while. Maybe it was the super busy day, but I felt like the bar was just ok. <br><br>Overall, I would definitely go back if I was in the area, but I don't think I would make a special trip just to grab a drink here.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Op9htzPxcGRDof5067u47A/168s.jpg", "caption": "Draft menu - good selection of beers at really decent prices!"}]}}, {"review": {"des": "The Map Room's atmosphere is perfect on a cold Chicago night when you are looking for a place to escape the cold in a cozy atmosphere. Also great for a summer day with the windows open and enjoying a game on tv with friends.<br><br>Prices are cheap. CASH ONLY. No food served here.<br><br>The Map Room is a destination spot for any fan of great beers in Chicago. Excellent selection of Belgian, European, and American craft beers. About 30 or so draft beer selections but over 200 bottled beer choices.<br><br>If you are looking for a great neighborhood beer place in Chicago check out the Map Room!", "pics": null}}, {"review": {"des": "This bar has character. It feels like stepping inside the pages of a national geographic... with a beer in hand.<br><br>It's covered wall to wall with maps and flags, and features bookshelves stacked with national Geographic's throughout. <br><br>Usually it's packed! Hard to find a seat after 9pm. Before that it's pretty relaxed. I most enjoy coming here early for some hearty stout and friendly conversation or studying with a lager in hand.<br><br>Selection is great. Constant rotation of mostly Midwest microbrews. Why Midwest? They are the best! <br>Last I indulged in a Founders Curmudgeon a most enjoyable libation. It was perhaps the most flavorful beer I've tasted. It's a strong 9% ale very sweet to the palate.", "pics": null}}, {"review": {"des": "I've been to the Map Room a bunch of times and can't believe I'm only now getting around to review it.  We stopped in around 5pm on Monday, and it was already pretty crowded.  They had a little table of snacks set up in the back, and one of our friends tried some.  It was a nice little bonus that I had never seen there before.<br><br>They have an amazing selection of both beers on tap and bottle beers.  The beer is always cold and tasty.  Keep in mind that Map Room is cash only, but there are two ATMs in case you forget.", "pics": null}}, {"review": {"des": "Update: Still a 3 star review. As stated below they serve good beer and I like the atmosphere but after my second attempt to come here and give this place another shot, the bar does like feces to me and I just can't help but notice that every single time someone opens the bathroom doors the entire bar get a very nice long whiff of that nasty. <br><br>Had a good experience every time except the past time I went. The place smelled like feces, made the beer not very enjoyable when the smell is in there.", "pics": null}}, {"review": {"des": "As a fan of craft beer everyone always asks me what I think of the Map Room. Until today I sadly had to say I had no idea because I had never gone, but I finally made it out here so here's my two cents. <br><br>It's no surprise people around Chicago put Map Room and craft beer together so often. The Map Room offers a great rotating draft list of local favorites and international goodies. I also really liked that something is coming off the cask engine and that stouts are appropriately offered on nitro. You're not chained to CO2 carbonation if that's not your cup of tea (and you're probably a tea drinker if you really appreciate cask and nitro beers). The bottle list at Map Room is also really extensive, I have a hard time resorting to a bottle when so many great taps are available but hey that's what happens. <br><br>The only downside on the day I stopped by was that despite it being not that packed they were running out of a lot of the beers on the menu. The bartenders are friendly and offer good suggestions but it's always a little sad to get your heart set on that special IPA only to hear they're all out.<br><br>Oh yeah and just like everyone else says, no food, so bring your own (or order in!) and cash only.", "pics": null}}, {"review": {"des": "Love this bar! Always full of regulars, and an awesome place for hanging out during the day. People treat it like a coffee shop (with the bonus of delicious craft beers available on tap!) during the day. Also, they let you bring in food from outside, which is really cool. Love the atmosphere. Very nice bartenders. I'm a fan.", "pics": null}}, {"review": {"des": "Not bad! This place is cash only and doesn't serve any food (hence the 3 stars), but the staff is super friendly, the beer selection is fantastic and the ambiance is very relaxed and bar-like.<br><br>I haven't been back yet, but I did try the Perennial Saison de Lis-- it was a good choice :)", "pics": null}}, {"review": {"des": "The kind of place I love. Unpretentious, always open, and great selection of beer. Simple and adorable with kind service.", "pics": null}}, {"review": {"des": "Impressive and charming. A bar with an atmosphere that I love and beers and coffee that are superb. The Map Room's theme is maps and back issues of National Geographic on the walls, so if you're interested in traveling and drinking, this is your place. The interior is cozy and interesting, with tons of travel magazines to browse. Too bad the lighting is too dim to read much of any though! But I suppose most people don't intend to come here to read for a couple of hours, and my husband and I are just geeky enough to want to do that while sitting at the bar. The beer selection is impressive, with a strong list of excellent craft beers on tap and in bottles. They also offer Intelligentsia coffee brewed right at the bar. A great place that really makes me wish I lived in Chicago!", "pics": null}}, {"review": {"des": "Ugh, this place was my favorite bar that I visited in Chicago. The drinks were great and well priced, the neighborhood was clean and comfortable to walk around in and the ambiance was perfect. The music wasn't too loud or too low and it looked like they had something for everyone. I want to go back.", "pics": null}}, {"review": {"des": "Loved the very well-assembled selection of domestic local craft brews and notable international offerings, but in all honesty I was a bit put off by the bartender.  I kindly asked to sample a few beers before deciding on a pint only to be unnecessarily informed that they don't do tasters.  It was probably just a misunderstanding, but I'd appreciate better service especially when I already made it clear that I'd be getting a pint.<br><br>Despite that, I enjoyed my glass of Central Waters Broken Window and would not mind coming back to relax with friends over more quality beer.", "pics": null}}, {"review": {"des": "I hosted my Partner's birthday party here in Dec. 2016. Laura, one of the owners, was extremely accommodating and so easy to work with. We loved the service and overall ambience of the place. It was perfect for our event!", "pics": null}}, {"review": {"des": "If you like good beer this place is for you.  Selection here will appease anyone's taste.  Its one of a few places where I end up scrolling through choices like a kid in a candy store and don't know where to start.  If you a are adventurous this place is perfect as they'll let you try any draft beer before you buy it. bartenders are very knowledgeable too, if you tell them what your taste buds crave they'll take care of you.  <br><br>Only negative is this place has gotten way more popular since I started coming here 16 years ago.  If you are service snob with attention needs like a little kid or like cheap beer this place is probably not for you.  I don't like packed bars but still give this place 5 stars because I can come on a weekday and their beer selection alone is worth it.  Cheers!", "pics": null}}, {"review": {"des": "I fell in love with beer here when a friend of a friend (who brews his own beer) took charge of the menu and ordered for me. I loved analyzing the beer menu and perusing all of the different bottles and glasses, since I knew nothing about beer at that point. The decor inside is quite charming, there were National Geographic magazines everywhere, on the tables where we sat and on the bar, some of them were even ten years old! This place is all about beer though, so make sure those in your crew are beer-literate and if you do one thing, do not order a Bud Light or a Miller Light, expand your horizons and branch out please, there are too many options not to. <br><br>Beware though, they do not accept credit card. This place is cash only,here is an ATM on site but I have no idea what the fee is. I've never eaten here and I'm not even sure they have a food menu. I've heard their coffee is really awesome too but obviously, I've never been for the coffee. I may only be 22 but this place has grown on me and is definitely a good time with friends who are really serious about what they drink.", "pics": null}}, {"review": {"des": "Love that this bar is in my hood and walking distance. It has one of, if not the best, beer selections in the city. Extra bonus is that they have pretzel rods to nosh on in between your next beer. Everyone that works here is super chill and cool. Also love the tamale guy that makes an appearance every now and again!! Those things are so damn good! Map Room does except credit cards now, however Tamale guy is cash only!", "pics": null}}, {"review": {"des": "Great bar with an awesome beer selection. Old school feel and definitely a Chicago style corner bar.", "pics": null}}, {"review": {"des": "A very chill bar with a crazy long list of beers, great wall art, TVs and surround sound speakers for the Blackhawks game. There were quite a few people working on their laptops (free wifi), while others were enjoying their libations and Hawks game.<br><br>I'm not much of a beer connoisseur, but the $5 Bloody Mary on Sundays was pretty delish. They don't serve food, except for some light breakfast options in the morning. However, they have a binder full of menus for restaurants that deliver to the bar.<br><br>I'll definitely be bringing back a few friends who LOVE a great international or microbrew beer.<br><br>TIP: Bring cash", "pics": null}}, {"review": {"des": "Love this place. Was in last night and had a very helpful bartender give me samples of beers he thought I would like and he was spot on every time. I ended up just letting him pick out my drinks because I trusted his judgement. He didn't steer me wrong. Wish I would have gotten his name! It has a pretty relaxed atmosphere and isn't so loud that you have to shout at the person next to you. This is perfect assuming you are there with somebody you actually want to talk to. <br><br>It is cash only so come prepared.", "pics": null}}, {"review": {"des": "Great beer list with sour favorites like Petrus and Bockor and I believe at one point Rodenbach.  Relaxed atmosphere and food delivery acceptable.  Cash only.<br><br>Bartenders are kind of distant and on occasion unfriendly, but that's my only real complaint.", "pics": null}}, {"review": {"des": "I could make this review really short and say simply that the map room has the best selection of beers in the city of Chicago.<br><br>But that just wouldn't begin to tell the story. A great afternoon place on the weekend to have a beer with friends or late into the night. During the day you can sit chill discuss maybe watch a little bit of TV always have a great beer. Lots of selection both in bottles in and taps from around the world. They do a great job of bringing in the seasonal beers or more later refreshing beers in the summertime and some dark heavy beers in the winter time.<br><br>Some fun games and national geography adds to the charm of this cash only bar", "pics": null}}, {"review": {"des": "Let me prefaces this: I am a nerd, like extra bonus nerd. <br>Needless to say, I spent hours pouring over ancient (and recent) issues of national geographic while enjoying some of the finest beers Chicago has to offer.  <br><br>Inside this small, (yes CASH ONLY), joint the walls in between the floor to celing windows are filled to overflowing with old travel inspired magazines.  Reading how the world has changed (or not changed), since some of the older issues were printed.  <br><br>The selection is great.  Bottles are limited, but drafts are amazing.  There is ususally a Three Floyds on draft which is a treat for out of towners.  <br><br>Definitly a go to when I am in Chicago.", "pics": null}}, {"review": {"des": "Showed up on a Friday night looking for a beer or two.  The larger bartendar looked at me three times but each time served a lady who got there after me.  For two of the ladies he chatted them up and made conversation, and for one of them he even gave her back her $20 bill.  Oh, and the bathrooms were beyond disgusting too.", "pics": null}}]}