{"name": "the-wormhole-coffee-chicago", "reviews": [{"review": {"des": "A unique experience. Upon walking inside Wormhole coffee you'll be transported to a place filled with items from an 80s time capsule. <br><br>There is a decent amount of seating but it's usually packed. Bring headphones if you want to get any work done on your computer since the ambient music is louder than most coffee shops.<br><br>Beverages and service are slightly above average but let's be honest you're going out of your way to experience the atmosphere here not be blown away by the coffee beans.", "pics": null}}, {"review": {"des": "The sci-fi feel of this place is cool. Seems like a great place to sit, do work and enjoy the wormhole with your fellow worms.<br><br>I wish I could do that but I don't think I will be able to get past the awful coffee her. The beans of the coffee were nothing but bitter and I believe that is why they try to mask it with their 'artisanal' flavours such as curry and peanut butter lattes. It sounds cool but that is because they need to market their drinks differently to sell such horrid coffee.<br><br>I tried their hot chocolate as well and it was basically sugar, milk and a spoon of chocolate syrup. At least put some cocoa in....<br><br>Cool place on the outside but probably won't come back for their drinks.", "pics": null}}, {"review": {"des": "If you like craft coffee mixed with 80's nostalgia mixed with video game memorabilia then you have to pay a visit to The Wormhole Coffee. <br><br>It was packed when I came in on Saturday morning and the coffee is worth the wait. My friend ordered the koopa troopa drink, which is like a peanut butter cup in liquid form. I was kicking myself for not ordering that while I was waiting for my hand brewed coffee. But for coffee lovers, the rotating selection of brews is excellent here. The baristas know what they are doing, my coffee came out perfect. Surprisingly it was a great temp where I could basically immediately have a sip once my brew was ready. <br><br>The atmosphere is amazing. I love all the intricate details they have placed throughout from the stained glass Nintendo to the Delorean in the back. I wish I lived closer so I could come here more often, but it's def on my list as a must visit to take friends when they are in town.", "pics": null}}, {"review": {"des": "This coffee shop is the MF bomb and I love it! I love the vibe here! Not sure if it's because it reminds me of Brady street coffee shops in MKE or if it's because it has that cool hipster vibe Bay View has but I dig it and I continuously find myself here whenever I'm in Wicker Park. They have a delicious latte called the Koopa Troopa that I highly recommend getting. <br><br>I'll be back here for sure whenever I'm in the windy city. Give this place a try!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CXTBpgJcMMbXlhkva-fB7w/348s.jpg", "caption": "Koopa Peanut Butter Koopa-Troopa. A-mazin'"}]}}, {"review": {"des": "Wormhole is definitely a trendy/hipster modern day spot where they bring back memorabilia from the 80s. They even have a model size Back to the Future car and a old school Macintosh computer. They have alot of cool signature drinks on their menu. However - keeping with my standard - you have to try their hot black coffee or cold brew to determine if their coffee is on point. I opted for the cold brew since it was a hot summer day. I would have to say I am relatively disappointed. The cold brew fell really flat. No flavor whatsoever and way too much ice. Dissapointing. <br><br>Cool coffee shop concept - need better coffee.", "pics": null}}, {"review": {"des": "Edgy coffee shop! Great music, knowledgeable baristas, and fast service! <br><br>It has a lot of nostalgia in terms of 80's and 90's movie memorabilia! Ghostbusters, Gremlins, Aliens and more! <br><br>I got my iced soy chai latte: I was impressed! 5 stars! <br><br>There is ample seating inside and plugs for all your devices to charge! There is also outdoor seating as well. <br><br>This will be my office for the morning!", "pics": null}}, {"review": {"des": "This place has plenty of character, and at least a few unique options for coffee drinks. I had the 'Cool But Rude' and it delivered a pleasantly memorable coffee experience with strong hints of ginger and curry sauce. Health concerns aside, the overall taste was better with whole milk versus skim milk.<br><br>It's also worthy to note that the decor inside the place was fantastic for any vintage 1980's fan. From the DeLorean from Back to the Future to the original Game Boy to an original Apple computer, there are plenty of bits of eye candy. Overall, I'd certainly recommend trying this place at least once.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nJ1-pdZW1KJNNS637-5mrg/348s.jpg", "caption": "Cool but Rude: Fresh ginger & curry sauce latte"}]}}, {"review": {"des": "Not your typical starbucks, this place is one of a kind.<br>I love all their 80's movie theme decors/menu, it really made the place more hip. Cute spot to chill.", "pics": null}}, {"review": {"des": "Easily one of my favorite spots to get work done. If you order a tea, they prepare it with loose leaf tea, and provide a free additional steep if you'd like. Not a bad spot to hang out, but most of the people here seem to be getting work done. Dimly lit so if you're not next to a lamp, I could see it being difficult to read if you're bringing a book here in the evening. <br>Employees are friendly as well.", "pics": null}}, {"review": {"des": "I love this place!! My only complaint is that it's difficult to find a place to sit. <br><br>All you 80s babies will get real nostalgia vibes from this place - from the decor, music and even the coffee titles. <br><br>The coffee is able to match the cool ambiance. My personal favorite is the Peanut Butter Koopa-Troopa.. smooth and creamy peanut buttery goodness. <br><br>It is in a cute area and there are some awesome thrift stores near by that are worth checking out!", "pics": null}}, {"review": {"des": "This place brought me back to my childhood with Nintendo's, movie posters of awesome 80s movies and just a funky vibe! It's the only coffee shop I've ever been to where you can just be you and you won't be judged by anyone! The staff are very friendly and kind and that's the main ingredient to a great coffee shop! It should be like you real home, not your second home.<br><br>Their coffee is...well, let's just say you won't be disappointed! Brought to you from halfwit coffee roasters, so you know it's good stuff, but it's just made with a lot of nerdy coffee love and I guess that's what makes this place such a cozy hangout spot for the all time fans of the 80s or for those who just wanna go somewhere cool and just being themselves. <br><br>I had a special latte called A shot in the dark (not sure if it's a reference to the movie) but it was might good!", "pics": null}}, {"review": {"des": "What a cool coffee shop! I love, love, love the decor! Takes me back to my childhood.  Want to take a picture with Keanu Reeves...head on over. Also love that there is a couch seating area in the back with old video games.  Totally creates a great ambience. What a gem in Wicker Park! <br><br>Close to blue line on Milwaukee it is also quite convenient to get to.<br><br>Coffee and service is great as well.  Will surely be back.  Seems to be pretty crowded but surely it's for a good reason.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sV25RbJLqCfqws8DvBrzsA/168s.jpg", "caption": "Who you gonna call?"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cetaASdEgbnDp_hwJUmyPg/168s.jpg", "caption": "Back to the future!"}]}}, {"review": {"des": "Cozy old school coffeehouse. <br>The vanilla bean and peanut butter koopa troopa were both excellent. Decandent and good enough for both satisfying my coffee and dessert urge. <br>Only wish they had more pastries available though.", "pics": null}}, {"review": {"des": "My SO fell in love with Wormhole's coffee. I tried their Honey Bear latte and I have to admit that it is one of the best tasting coffees that I had I  Chicago. <br><br>Drinks:<br>Honey bear latte: a slightly hint of honey and latte. Very nice and good under a rainy day. <br><br>Koopa troopa: peanut butter mousse mixed in as a latte. My SO likes it but definitely not my fave. I like my peanut butter in solid form. <br><br>Ambience: <br><br>Very very cool ambience. A very 80s feels with a back to the future car in the back. Furbies, POP figurines and cat paintings on the wall. Definitely a sight to see. <br><br>Coffee bean: <br><br>Bought several types of coffee beans here. They ate roasted by HALF WIT roaster and we gotta say it's pretty good (espresso wise). A local chicago roaster and we will be ordering more online!<br><br>Ps. They can do a little more work on their latte art. Lol :)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/l_6HrEtcE8Isri7SmVYYMw/348s.jpg", "caption": "Honey bear latte"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iwTILA0ZIQIEAlMXlN0zjA/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/K-JYAOyYz4nR0KbFxsNmDA/168s.jpg", "caption": "Wall arts and misc"}]}}, {"review": {"des": "Hi um the coffee here is great :) Actually just had probably? the best latte of my life last night from here (honey bear). I love the vibe of this place. I'm a huge nerd and really appreciate all the star wars and pops I saw throughout the shop. Such a cool little gem in Chicago.", "pics": null}}, {"review": {"des": "I'm not a coffee drinker, but I would go to any length to get my paws on a peanut butter latte: the KOOPER TROOPER. <br><br>WH is a trendy, hipster modern day wormhole that transports you to the 80s/90s, and everything old that people love to resurface. Like, an antique Macintosh. I do not belong in any of these sentences, yet I was still welcomed with the smiles and aroma of some quality coffee. Hop on over, even if you aren't a coffee drinker!<br><br>Spacious enough for personal space or group parties! NOSTALGIA, anyone??", "pics": null}}, {"review": {"des": "Pretty cute spot with video game and movie references, lounge area seating, and tasty drinks. <br><br>Most of my friends and I ordered the Peanut Butter Koopa Troopa lattes, while one ordered the Honey Bear and one ordered the Cool but Rude latte. <br>I was hoping the Koopa Troopa would have more chocolate flavor (not too much of a PB fan) but it did not. Nonetheless I still liked it and it wasn't overpowering. I tasted the Cool but Rude and would have liked that better I think. <br><br>I would probably come back to this place if I'm in the area to check out their next specials and have a pastry!", "pics": null}}, {"review": {"des": "Love this place. It was my go-to study spot on Saturday mornings during med school. I'd always get a coffee or piping hot cup of tea with a sugary cereal that reminded me of childhood. Nice comfort while studying away. It's a cool vibe, always met nice people there to chat with during study breaks. Travis, the owner, was often there serving people himself. And everyone was always so hipster and funny and super nice. Miss this place -- don't go as often since I'm not studying as much, but always make it a point to stop by when I'm in the neighborhood to get a latte.", "pics": null}}, {"review": {"des": "Fun 80's themed coffee shop in the heart of Wicker Park.  Where else can you grab coffee and see a DeLorean (like the one from Back to the Future)?  They also have old Nintendo games you can play to transport you back in time.  There are many tables and seating options throughout the shop and also outside. The drinks are pricey, but no pricier than a Starbucks. The $5 Cool but Rude ginger & curry sauce latte I tried was delicious. Both the ginger and curry flavors were subtle, but present. The honey bear has a fancy name, but it's a simple coffee drink that's delicious in a simple way.  There's paid street parking, but may be hard to come by. Free on Sundays.<br><br>....| \\      _  , , , - - , ,  _  ,      <br>.../  , ` . - ' ` '             . _   \\ -  ;  ;  ;  , _    <br>..| ,  a  -   )   ) _         . ; .  (   ` - ` -  ' - '   <br>'  - - - ' ' ( _ / . _ ) - ' ( _ \\ _ )", "pics": null}}, {"review": {"des": "Back to the future car, 80s music, old movie posters, first macintosh, floppy disks PLUS really yummy caffeine concoctions so what is there not to like?! Order Koopa Troopa or Vanilla Bean and hangout and you're are set!", "pics": null}}, {"review": {"des": "Hi, my name is Casey and I'm a caffeine addict. It doesn't matter where I go, I make sure to get my fix in. Anyway, during my last trip to Chi-town, I came across this awesome coffee shop. <br><br>The chai latte that I ordered was delicious and I'm a sucker for latte art so they get bonus points just for that. Definitely my favorite coffee shop in Chicago not just for the drinks but for the atmosphere. If you're looking for a chill, hipster, 80's/90's vibe, this is the place for you. They've got a DeLorean on display, Nintendo games on an old tubular tv and decor such as ET, Sesame Street and lunchboxes.<br><br>If I didn't have to pay for parking, I probably could spend the whole day there. I would definitely find myself back to this place the next time I'm in Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QDw0BpKvaXXCNjpQgYHb6A/168s.jpg", "caption": "Delicious chai"}]}}, {"review": {"des": "*** Workspace ***<br>It's a bit dimly litted and most of the seatings are for lounging. If you're the type to work sitting on table, your only options are a big communal table or a hanging bar table nailed to the wall. It's not my preferred work space (esp. Because it's always bustling) but I come again and again for the delish coffee and to relax surrounded by geeky retro memorabilias.<br><br>*** Coffee ***<br>Phenomal and one of my favorite go-to cafe. It was love at first sip. All their drinks have personality (in both name and flavor). Each drink is unique but in general all of them have a well-balanced spice notes.", "pics": null}}, {"review": {"des": "Came here on a Sunday around 11AM to meet a friend from out of town and instantly loved this place as soon as I walked in! the ambience is super cool and they have a variety of unique coffees.  <br>They have lounging chairs, couches, and table/chair options.  They also have a cool spot in the back where you can play video games!<br><br>The service was super good and the workers were friendly as well.  I had the honey latte and it was super good- i would definitely recommend it / get it again. The orange blueberry scone was also very very good.  The flavor was rice and it was a nice size.  I spent about $10.50 for these two items.<br><br>They also do offer milk subs such as almond/soy.<br><br>Very cozy atmosphere with a hint of retro!<br><br>There is street parking (free on Sundays).  It did take me about 10 minutes to actually find a space and still had to park 2 blocks down - but not terrible!  <br><br>I would definitely recommend this place and cant wait to come back!  I wish it was closer to my house.", "pics": null}}, {"review": {"des": "A coffee shop gem that is right around the corner from my new spot. Lucky me!<br><br>My go-to is their lavender mint latte with oat milk and activated charcoal. What's amazing is I don't even have to be boujie, (or however you spell it), they're already boujie themselves! #win<br><br>The inside is decked out with old school movie props (I'm never familiar with this sort of thing since I haven't seen nearly enough movies). They also offer a ton of free stickers with fun quotes. <br><br>The only reason I give them 4 stars is because you can't come here when you're in a rush, like before work. Sometimes that's a great thing but it's too bad because now I can only enjoy them on a weekend.", "pics": null}}, {"review": {"des": "If you are a sci fi movie fan from 1980/1990s, Wormhole is a must-stop!  Buy some Half Wit toast coffee while you are there. And did I mention....THE BEST LATTE I HAVE EVER HAD. Cool but rude latte with ginger and curry. Outstanding. Bottom line, they had me with Alien facesucker on the Millenium Falcon. You rock, Wormhole!", "pics": null}}, {"review": {"des": "Nothing wrong with a nostalgia trip now and then (heck I dressed up my son in vintage Ocean Pacific for 80's day).  From the movie posters to Doc Brown's DeLorean, there are bits and bobs of fun pop kitsch all around to catch your eye and steer your conversation away from it's topic for a bit. <br><br>My friend and I met up for caffeine and convo and loved pace of this coffee shop. Great place to work, read or meet up. My honey latte was delicious and the croissant was perfectly buttery and flaky. <br><br>There's table seating, communal work table and comfy couches. Laid back friendly vibe.  Can't wait for Max Headroom to start working the counter.", "pics": null}}, {"review": {"des": "Good latte and chocolate chip croissant. Neat decor inside with Back to the future Delorean inside. Not sure if it's one from movie but definitely a Delorean. Nice indie coffeeshop vibes!!", "pics": null}}, {"review": {"des": "One of the best places for coffee in Chicago. I got their vanilla latte last time I was there and it was delicious. I've also gotten their regular coffee and really enjoyed it. They have a good selection of sweet coffee drinks with solid black coffee as well. They have a small selection of baked goods but you can't go wrong with their croissants. The staff are super friendly and the staff is super attentive at keeping the space clean. <br><br>The space itself is very cool. There's a lot of comfy seating and you could actually play their old 90's games. The controllers were a little old and didn't work quite right but it was still cool to see. If you're in the area definitely stop by or even if you're not in the area it's close to the L!", "pics": null}}, {"review": {"des": "Wormhole is such a cozy coffee shop with a very friendly and attentive, great regular and iced coffee, and rotating specialty drinks.<br><br>There are a number of different seating options, even a couch with video games. Plenty of outlets, as well.", "pics": null}}, {"review": {"des": "I have come here a few times with a girlfriend of mine who lives in the area. The coffee is tasty- I love me some cold brew! Their muffins are delicious, too!<br><br>The place has a retro/hipster style and I enjoy the fact that the seating is set in a way that you sit next to strangers while you all are doing your own thing. And since I love meeting new people, it sets up that opportunity, too.<br><br>The only reason I'm not giving this place 5 stars is because the service is kind of abrupt and not as friendly as it could be. Otherwise, I enjoy hanging out here for a coffee&reading session.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sdp_Py86qnQgFkP3T-7yNQ/168s.jpg", "caption": "They have 2 gender-neutral restrooms- how great is that!"}]}}, {"review": {"des": "What a great find! My boyfriend and I happened to walk by this coffee shop and I'm so glad he convinced me to check this place out. Walking into the coffee shop, we immediately loved the 80's and 90's decor with the Delorean from Back to the Future, the old school Apple computer and floppy disks, and all the movie poster paraphernalia displayed everywhere. I ordered the cortado and my boyfriend ordered an iced mocha. Our coffee came out extremely fast and I loved it! The cortado was strong (just the way I like it). My boyfriend also enjoyed his iced mocha. In addition, the staff are super friendly. I will definitely keep this place in mind the next time we're in town.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bYv-U0KtpKVWzvfP0RB4_Q/348s.jpg", "caption": "I loved the cortado"}]}}, {"review": {"des": "This place has 80s character and good drinks to boot. I ordered their seasonal shot in the dark latte, with lavender, mint, and activated charcoal and wow!!! Wasn't sure what to expect, but the flavor combos really work. <br><br>We loved the 80s decor and broken-in couches- such a great place to hang out and play some cartridge video games (Mario, TMNT, blades of steel, link), grab a spot at a table to work, or sit at their coffee bar close to the barista action.", "pics": null}}, {"review": {"des": "I had to go to wicker park for a event and was looking for a place to meet friends in the neighborhood.While browsing places on yelp came across this place with pretty good reviews and especially reviews from Sarah and Alex compelled me to try this place.<br><br>The decor is unique and pretty youthful with Old unused car on the attic ,Macintosh and Old telephone which gives pretty good vibe.<br><br>Service was pretty good and quick.I tried the honey bear latte and it was good and friends had cold lattes and they loved it.<br><br>Cons:<br>Free Wifi<br>Unique Ambience<br>Patio<br>Reasonable prices<br>Unique Taste<br><br>Check this place and you will like it", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UpnWjSWNW0UYhPWQIRQ_dg/348s.jpg", "caption": "Menu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yO0nbmEPF2Ds9wGYOmJvrw/168s.jpg", "caption": "Spacious"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/s_SDaMozAD9HknehPdVJog/168s.jpg", "caption": "Unique decor"}]}}, {"review": {"des": "Throwback Thursday Phoenix begins on a Chicago Wednesday with a song called Blue Monday....<br><br>I am a believer! Believer!! Capital B. This wormhole works. <br><br>It's about time I fire off these five stars given that I drank up another Peanut Butter Koopa Troopa (PBKT) yesterday, snapped a never-before-done photo (by me) with the \"My other car is a Delorean\" bumper sticker,\" flew out to Phoenix last night and today...driving along I-17 north and what am I coming up on...a Delorean!? THE Delorean.  \"OUTATIME\"  Total replica, only 30-some in the world. Not only that, dude exited same ramp as did I so we ended up in a Walgreen's parking lot - having a chat. He loved it that I showed him my photo of the Wormhole Coffee.  <br><br>So back to the future...long have I loved this house of coffee, from when I first set eyes on the Delorean (among other retro stuff, especially the Mac) and when I first set lips on this PBKT - a peanut butter mousse, dark chocolate latte. Yeah.  So, indeed no, I have not had any other drink here - not even my regular black coffee.  How can I drink anything else when the PBKT is like drinking a decadent, rich peanut butter and chocolate souffle.  I liken it to a souffle because it's just so perfectly airy and rich. Creamy and delicious, not at all overly-sweetened. And I'm not a latte or \"fru fru\" coffee drink person whatsoever.  <br><br>I don't even mind that - when I'm sitting on that comfy couch - that I figure out how old I am. It clicks that I'm listening to remakes of what I listened to in college. By the way, nice job, \"Orgy\" on not screwing up \"Blue Monday.\" And then, I remind myself that I like the '90s and beyond music too so I'm  not that old after all. Phew. You're young. You're thin! Get a pastry. <br><br>They have donuts, assorted cookies and a chocolate candy bar maybe even...and one time, I know I got myself a macaron here.  I did!.... <a href=\"https://www.yelp.com/biz_photos/the-wormhole-coffee-chicago?select=BIe2AtLzQWq0ZpXE3nlx7A\">yelp.com/biz_photos/the-…</a> (December 2014 but I'd wager they still have 'em)<br><br>If you need a sugar fix, a caffeine jolt, a PBKT kiss, a blast from the '80s past or a trip back to the future...this place has you covered. Hey, all that and bumper stickers too. I swear it's how wound up standing behind the bumper of the Delorean this fine afternoon.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3zwg869SlkEWiuThRDLs3w/348s.jpg", "caption": "Peanut Butter Koopa Trooper etc 05/24-25/2017"}]}}, {"review": {"des": "Think a 80s and 90s throwback vintage coffee shop with a great menu and latte art, but high prices and slightly disappointing coffee drinks. This coffee shop in Wicker Park has been on my bucket list for quite some time now, and I am sad to say that it didn't quite measure up to my expectations.<br><br>First off, my mocha drink was barely warm when I got it to drink at the shop. The latte art was fantastic, but I could barely taste the coffee or chocolate flavor. It just felt like a mediocre coffee drink from quick vendor, and not necessarily a dedicated coffee shop. <br><br>Parking is hard to come by, but possible. Paid metered parking on Milwaukee Ave, and free street parking in the residential area behind the coffee shop.", "pics": null}}, {"review": {"des": "I adore the quirky feel & nerdy decor of this coffeeshop. There's a variety of seating from chairs to cozy couches. The lighting towards the rear of the shop is quite dim so just a heads up. The wi-fi is reliable & fast. Outlets are kinda sparse depending on where you sit. Coffee is always good. I haven't had a bad experience yet.", "pics": null}}, {"review": {"des": "We loved the selection of lattes, but we weren't impressed with our orders. The vanilla latte had vanilla bean flecks in bottom of the cup (which is amazing in theory), but we honestly couldn't taste it. The cool but rude latte (with curry paste and ginger), was extremely sweet, though I loved the spices. <br><br>The decor is quite a scene. I might bring friends in just to see the interesting wall art and back to the future car installation. Not much seating.", "pics": null}}, {"review": {"des": "Nostalgia is a funny, fuzzy thing. It's also a powerfully selling tool and this cuteass geek-chic coffee shop delivers 80s nostalgia in glorious spades. I mean, they have an actual DeLorean (the time machine from Back to the Future) inside. It's as if they're actually sending you through time. Meta. <br><br>It is worth noting that most of Wormhole's patrons (and staff!) are likely born after the 80s. Like I said, nostalgia is a funny thing. You can be nostalgic for a time when you didn't even exist. Not that this applies to me. I'm old and definitely on this earth before the decade came to a close. <br><br>Anyway, my regular drink order is the \"Cool but Rude.\" It's a ginger + curry latte. Sounds insanely weird but is actually subtle and delicious. I've also tried the Peanut Butter Koopa-Troopa. It's not bad but I don't love  peanut butter flavored things. It is a top drink choice for many though. The vanilla bean latte is also popular, but seems like such a plebeian pick. But hey, your choice. <br><br>Conclusion: a must visit if you're in Chicago and into anything quirky, sci-fi, geek-chic, nostaglic, 80s...all of the above.", "pics": null}}, {"review": {"des": "The Wormhole Coffee brings you back to the '80s, with its great collection of TMNT, Star Wars, Ghostbusters, and Back to the Future (yes, a replica of the car was situated on top of a makeshift divider) figurines, posters, and other paraphernalia.  In addition, they have locally-roasted coffee, vegan donuts, and hot/cold beverages, including ever-changing specialty beverages.  <br><br>A group of us came here after having lunch in the area, and the place was noticeably super packed!  We ordered: the Koopa-Troopa (a peanut butter mousse and dark chocolate latte; more strong and bitter, with a slight hint of peanut butter; came with a nice latte art on top); Holy Water (with jasmine green tea, melon, and honey, iced; this was super refreshing, and while it was more melon-based, I really enjoyed it!); a regular glazed donut, a sprinkles donut, and a crumbled frosted donut.  The yeast donuts were large and airy, and tasted pretty good.  <br><br>There is a hodge-podge of furniture - solo chairs and sofas where you can do some work, play catch-up, and/or to just relax.  Imagine a friend's living room where you just hang out.<br><br>The place isn't much for large groups, but maybe up to 3 people.  <br><br>I loved the '80s decor, and I'd be interested in checking out their other specialty beverages that seem to change often!<br><br>Some residential parking can be found off of Milwaukee.<br><br>+Holy Water<br>+vegan donuts<br>+'80s decor<br>+limited seating<br>+limited parking off of Milwaukee", "pics": null}}, {"review": {"des": "The Wormhold is a neat little place, decked out in 80s decor. The coffee was good, which is the main reason you'd come to a coffeeshop. However, I was underwhelmed by the baked goods. For me, I love to pair my coffee in the morning with some form of a baked good, whether it be a donut or a muffin or something else. I tried a few items from here, and they were all only okay. The donut was interesting- very, very dense, and not like a donut at all. I tried a muffin as well, but I guess since everything is vegan, they taste different than I'm used to? Certainly not bad, but not what I was expecting. I know most people love this place though, so I guess it just wasn't for me! Coffee and service were both great, however.", "pics": null}}, {"review": {"des": "My type of place! Video game themed and cool spot to hang out. I like their cool but rude latte with nice ginger spice in it.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sX5BZfRI8CDREkk340yA4A/168s.jpg", "caption": "Cool but rude"}]}}, {"review": {"des": "An 80s coffee shop run by someone who used to run Darwin's in Cambridge? Seriously that is awesome. The space is filled with 80s memorabilia including plastic and tin lunchboxes that I just wanted to take down and bring to work, discs next to a Macintosh computer (pictured), and just a funky vibe. Was in the neighborhood and decided to stop in, I definitely want to do work there soon to take me back to my baby years especially bc there must be more to see on the wall. Oh and I ordered a soy chai tea with a croissant. Yum!", "pics": null}}, {"review": {"des": "Not enough seating for the amount of people coming in and out. Chai was definitely made in-house, but had too much cinnamon for my liking. <br><br>Staff seemed friendly enough though, and the 80s decor is awesome. <br><br>Update: came in a few days later and tried the Koopa Troopa. The peanut butter balanced the strength of the coffee nicely. Could've used more chocolate in mine, but will likely reorder this.", "pics": null}}, {"review": {"des": "Love the coffee and the specialty coffee drinks if you're on the mood for something different and maybe a little sweet. I can honestly say that I'd come back for the decor as I had I'd come back for the coffee. It takes you straight back to childhood in the 80's!  Super fun to sip your brew and check out memory lane", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ka1j4XYCdzdQ2u8_FPtfUg/348s.jpg", "caption": "No Doc Brown siting, but damn fine decor"}]}}, {"review": {"des": "This is probably my favorite coffee shop. I love how they decorate the shop in the old fashioned way! I definitely enjoyed playing the Mario game on Nintendo. It brought back the memories I had in the past, I missed playing the game! I had a chai & my boyfriend had dopp something I forgot what it was called. It had peanut butter and dark chocolate in the coffee. He said the peanut butter shouldn't go in the coffee, but it was ok. However, I loved my chai! (Not pictured)", "pics": null}}, {"review": {"des": "When I sober I like coffe there but I dont like place too much. Staff its ok <br><br>When I am drunk I love peaple who work there <br><br>When I got hangover I hate them lol ... but coffee its amazing<br><br>When I am high ... I realy recommend brown sugar... its amazing", "pics": null}}, {"review": {"des": "A 90's kid haven! What is there not to love about this place! Nintendo and coffee, chill hipster vibes, delorean car display, awesome art, all in the heart of Wicker Park. Yes please! An overall good spot with tasty treats and drinks! Nuff said!", "pics": null}}, {"review": {"des": "Loved the 80s nostalgia, the atmosphere was fun.<br>Coffee was okay. Not my favorite. I had the troopa and I didn't like it, hubby had a vanilla latte and it was good", "pics": null}}, {"review": {"des": "Excellent coffee - I can't remember what they use. It's quality stuff. Maybe a wee bit overpriced for Chicago, but whatevs.<br><br>I used to go here when I was unemployed (*sobs*) and during the day there was almost always table seating. My roommate said weekends are awful, though, so I don't bother. It's also a little dark inside for my liking.<br><br>Overall, great coffee and a decent workspace.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hmYU-MY8tREjrGY0MGVijA/348s.jpg", "caption": "Vanilla latte"}]}}, {"review": {"des": "Easily top 3 best coffee shops in Chi. I've given less than 10 Five star ratings on Yelp. Coffee shops around the country should take note. This is what A game looks like:<br><br>- creativity designed decor: homage to old school films like Back to the Future <br>- probably the friendliest, happiest, and quirkiest team<br>- the specialty lattes are actually balanced with the right flavor profile and balance without losing the essence of a latte. Most places stick bunch of random ingredients together that sound good on paper but betray their coffee essence and taste horrid. See how it's done - get the Honey Bear or the curry latte.", "pics": null}}, {"review": {"des": "Very cool place. It has a back to the future feel to it. I had a lavender and mint latte and it was super good. The flavor was awesome. No need for any sugar which is rare for me. The pastry selection is very nice.", "pics": null}}, {"review": {"des": "Cool spot with quick service and good coffee. Definitely a good area to spend a day working or just relaxing. Love the touch with using mugs for those dining in.", "pics": null}}, {"review": {"des": "I have to say, this place is spacious on the inside and gives a cosy atmosphere, and adding on top with the retro gaming vibe. I got the Honey Bear Latte when I visited here; if your looking for a subtle sweet drink, I would recommend it. <br><br>My friend and I were able to find seating on the couches in the afternoon and the service was quick!", "pics": null}}, {"review": {"des": "Had a cold brew Yerba mate with ginger and lime drink that tasted nothing like mate, but was still okay. The music they were playing, however, was terrible and made me have visions about entering the gates of Hell.", "pics": null}}, {"review": {"des": "What a Wicker spot. The coffee is warm, welcoming, and strong and the atmosphere is odd, unique, and 80s-90s themed. Great place to sit down with your computer, book, etc. and get some work done.", "pics": null}}, {"review": {"des": "Great coffee, great ambiance.  Loved the decoration and the service was great/super friendly.  And the novelty of the Delorean is definitely worth the trip alone.", "pics": null}}, {"review": {"des": "So, I moved to the Chicagoland area this past September and I haven't had a chance to write any reviews about the places I've visited here yet. But Wormhole definitely deserves a shoutout. <br><br>Overall, this place is awesome. I absolutely love the vibe/theme of the cafe which is a nice throwback to the geeky side of the 90s with tons of decorations that really make you want to dig up your old comic books and action figures. My favorite decoration was the lifesize Delorean on the back wall. They even have a cathode ray tv set up with classic Nintendo games in the back and the music is fitted to the theme of the cafe which I thought was a very thoughtful touch. <br><br>As for drinks, I definitely recommend the Honey Bear Latte which comes with a seasonal honey or the Koopa Troopa which has a nice subtle touch of peanut butter and dark chocolate. But honestly all their drinks are great and they serve extremely smooth coffee drinks -- some of the best in the Chicagoland for sure. <br><br>Unfortunately, this brings us to why I didn't give the place 5 full stars.  The place is a little bit small for how busy it gets mostly in terms of seating as there are a lot of people who come here to do work/read/chill. Not REALLY a fault of the place but the bigger issue is that the drinks are definitely on the pricier side. Expect to pay about 4.50 for a small latte here. But one does have to keep in mind you are paying for a lovely drink and setting so that definitely makes up for it.", "pics": null}}, {"review": {"des": "This is a great spot for doing work or for hanging out with friends! I visited after work on a Tuesday and it wasn't packed at all. I ordered the honey bear latte with honey (soy milk). It was absolutely delicious.<br><br>I will definitely be coming back here and I recommend this spot to anyone who appreciates a nice \"hipster\" coffee shop. It's in a great location- right by all the shops and bookstores.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MxrUWUBHVpYnfecMeMzw_w/348s.jpg", "caption": "The interior! Very nice spot for hanging out and for working"}]}}, {"review": {"des": "One of my new favorites. Thank you, man behind the counter with black hair and a beard - you steered me right with the Cool but Rude latte. Holy smokes. And to think I was considering a simple Vanilla Bean latte! LOL me. The Cool but Rude is perfection - don't get thrown off by the curry. It's spicy and sweet and got that hit of ginger that you didn't know you wanted. This was my first time in and it won't be my last. I love that everything here reminds me of my childhood and that there's plenty of couches for me to come chill on soon.", "pics": null}}, {"review": {"des": "This place is unique to say the least, got the iced koopa troopa which only comes in the small size but it was good. Best thing about this place is they let you bring donuts in from outside even though they sell their own there. Pretty cool !", "pics": null}}, {"review": {"des": "One of my favorite coffee spots in Chicago. Love the music and the nostalgia 80s decor. I like to sit here and read or journal. When it's crowded on weekends, it can be a little hard to focus on work though, more of my go to leisure spot. <br><br>The specialty drinks are on the sweet side, but experimental and I like the lavender charcoal latte when I need a break from the usual black coffee. <br><br>From the Han Solo cardboard cut out, to the floppy disks, the details in this shop are just so on point. Love it.", "pics": null}}, {"review": {"des": "I was walking around with my friends when my boy told me to try this place out. I was shocked. I never looked back. The moment I saw their menu, I damn near fainted. The creations were some things I've never seen before. The one that caught my eye was the coffee w/ in-house made curry sauce & ginger. This was one of the most unique coffee drinks I've ever had. From the first sip to the last, it just gets better. The best thing about it, the curry sauce & ginger is well pronounced and has a soft kick. These are one of the coffee drinks I'll never ever forget and something I'll keep craving. This is just way too perfect.", "pics": null}}, {"review": {"des": "As a person who was born in the 80's and grew up in the 90's, \"Wormhole\" reminded me of the good time during my childhood and adolescence.  <br><br>We saw cartoon lunch boxes placed along the walls, \"Lisa\" Apple 2 computer found on the condiment table, and a random \"Michaelangelo\" from Teenage Mutant Ninja Turtles leaned against the window by the front door.  No, that wasn't an exhaustive list of knickknacks I spotted.  <br><br>The seating arrangements kind of took me back to my college years, with comfy sofas, large communal tables, and the clientele.  I felt there was something in common among most patrons who hanged out there.  The space was somewhat similar to a community lounge in a university dormitory, except there were too many activities going on at the same time.  I would get easily distracted if I were to try to finish my term paper.  <br><br>Fortunately, hubby and I came over for a quick coffee break after work; no tricky MLA or APA format that I ought to pay attention to.  The hours are great, 7am to 11pm daily.  They serve \"Halfwit Coffee.\"  If you purchase a bag of coffee beans, you can get either a free 8oz. coffee or $2 off on anything else.  <br><br>The CTA Damen Blue Line station is just a few blocks north of WH.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RsGwCHOUkxDqRdKr0c5mhA/348s.jpg", "caption": "Mocha"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9IYQYUCTNkQaGUIdJ-WgQg/168s.jpg", "caption": "Cortado"}]}}, {"review": {"des": "My favorite cafe by far in Chicago.  Great coffee and they make fantastic lattes with interesting and seasonal flavors.  My favorite year round is the honey bear latte which is delicious without being too sweet.  Had the seasonal cider/beet/thyme drink which was delicious and he best cider I've ever had.  You could really taste each and every bit of each ingredient (except maybe the beet which was probably used for just the color).  Tried a pastry as well which was great and not stale like many coffee shops.  Will come here over Starbucks any day.  Great decor with nostalgic pieces throughout- limited seating and lots of people loitering around with laptops.  They have a punch card - buy 10 drinks and get one free!", "pics": null}}, {"review": {"des": "Best java and fun atmosphere!  The baristas creates yummy drinks!  Wish they were in the suburbs.", "pics": null}}, {"review": {"des": "Awesome place to get coffee with friends! Love how they have a Nintendo. It took me back to the golden years of being young", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WA_YX60Tc1BgnVq8vgVLVA/348s.jpg", "caption": "Menu of the coffee shop"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/58wVSUViFhnAa59iuoECCw/168s.jpg", "caption": "They also had a Nintendo in the cafe shop which made us stay back more to play. Love this!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/B9_P4C-dvkLgtwHgAxu13g/168s.jpg", "caption": "2 Peanut Butter Koopa-Troopa Both 12 ounces"}]}}, {"review": {"des": "Gotta love their Koopa-Troopa peanut butter mousse and dark chocolate latte! Try it, you won't be disappointed!", "pics": null}}, {"review": {"des": "This place has wonderful gourmet coffee but has a very chill and nerdy vibe that also doubles as a truly safe space if you happen to be of q***r identity", "pics": null}}, {"review": {"des": "When people come into town, I take them to Wormhole b/c it makes me seem cool, with 80s & 90s pop-culture memorabilia all around the shop.<br><br>Wifi is consistent here, and during non-peak hours it's pretty easy to find a spot, though they're not the most comfortable seats.<br><br>My one issue with Wormhole is that on my last visit, I ordered a cortado to-go and the cashier said, \"We actually prefer to make cortados to stay, but we can do it to-go as well.\"<br><br>\"Ummm okay. I'll take it to-go then.....\"<br><br>*Silence*<br><br>LOL what??? What does Wormhole gain from making cortados to stay? Does the integrity of the drink decrease when placed in a paper cup versus ceramic? Is it against coffee etiquette (I can't believe there's such a thing, in America nonetheless) to sip cortado from paper cups? Maybe they keep a limited amount of mini-cups and they don't want to use them all nilly willy. Who knows.<br><br>ANYWAY. Yes, cortado to go please. Thanks.", "pics": null}}, {"review": {"des": "I could not wait to write a review for these people. Everyone was so sync with one another.<br><br>Andreas was very passionate about the shop. Tory was so knowledgeable about her craft. I wish you all the best, I truly do.<br><br>You guys have to check this place out. They have such an awesome theme , and even though it is dedicated too displaying different memorabilia , it still looks like a calm and Casual coffee shop.<br><br>The decorations support the coffee shop feel and are not one bit overbearing.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7TMAZRRWtoHYFzZoEHz69A/168s.jpg", "caption": "It is amazing that they stay open until 11 p.m. . You guys have to try one of their latte' creations that actually has curry sauce."}]}}, {"review": {"des": "Known for their lattees, they are delicious and well spiced but pricey. The decor is a wonderful vintage nerd-town collection, bathrooms are clean and genderless, but usually very busy and not many tables for being productive, it's more of a social atmosphere.", "pics": null}}, {"review": {"des": "The Koopa - Troopa is A1. Love the peanut butter + chocolate hint! Their customer service is amazing and their workers are so friendly.", "pics": null}}, {"review": {"des": "Great place. They have the old school video games, my son loves. I come here to get some work done in the winter sometimes.", "pics": null}}, {"review": {"des": "Rustic coffee shop with an old school vibe. Providing locally roasted coffee that tastes simply amazing. Strong and fresh. Great for a social meet-up or studying with plenty of seating.", "pics": null}}, {"review": {"des": "How can you go wrong with a place that has a Delorean inside?  You can't, people.  You can't.<br><br>PB Koopa-troopa is my go to, cause peanut butter and dark chocolate and espresso.  Hot, iced, whatever.  It's 80's nostalgia name and an amazing flavor combo!<br><br>Chai and other fun summer tea creations are available too, and the honey bear latte is good for the non chocolate lovers.<br><br>Wormhole has all the details down, including their game controller punch cards and floppy disk wifi password display.  Just the right amount of irony in a Wicker Park coffee shop.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/O9Vkxx0WSqGw9hwlDPDxkw/348s.jpg", "caption": "All the fixings"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/d0oUkZ-IPqm2RyKWqTcSyA/168s.jpg", "caption": "Menu boards"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/B6qLWUnEmxNdO67uEZxZgA/168s.jpg", "caption": "Gear and beans to go"}]}}, {"review": {"des": "When I went to Wormhole Coffee it was as if I was transported to another time period by the decor that is inside of the cafe.<br>I consider myself a coffee critic, I know a bad coffee from a good coffee quite easily, and I get picky if the title of the drink says it is \"cinnamon or nutmeg\" I then expect to taste that in my coffee.<br>After taking in the neat decor of the cafe, I went to order and I got the Honey Bear Latte to go and it still had cute heart on it, and it was sweet - but not overpowering. I know that I will be going back Wormhole Coffee, to try more of their menu items. <br><br>It's a bit hidden on the block, but once you find it - you won't regret it.", "pics": null}}, {"review": {"des": "The 80s. It's about trying too hard. <br><br>Trying too hard takes a lot of work. Just like the 80s. <br><br>Explains why they don't have time to work on making the coffee good.", "pics": null}}, {"review": {"des": "The decor and atmosphere are great.  A safe space for people of all orientations, genders and nerd levels to have an oat milk cappuccino.  The microfoam, coffee and tea were excellent.", "pics": null}}, {"review": {"des": "MY ABSOLUTE FAVORITE COFFEEE !!!! I love this place, the coffee, the vintage, the unique atmosphere, the neighborhood! If i didnt live on the south side i would be here everyday! Honestly the best", "pics": null}}, {"review": {"des": "Had the koopa Troopa coffee and it was tasty! T had mocha and peanut butter in it. Good for getting busy work done but music is a little to loud for studying. The place has a video game 90's vibe to it and all of the decor was unique. Will definitely be back!", "pics": null}}, {"review": {"des": "Place is very cool. Love the retro throwback feel. Drinks were pretty good too! I'd give it 5 stars but the two girls working there had an attitude and were not friendly at all. I mean if you aren't happy there don't work there lol. Other than that great place", "pics": null}}, {"review": {"des": "Came here on my biannual trip to Chicago and fell in love. Husband got a classic latte which he said was amazing & I got a seasonal rooibos peppermint tea which I also really liked. We visited midday during a Monday and the place was completely packed-I can't even imagine what it's like on a weekend. We didn't try any of the food items, but they looked good, and several people had bowls of cereal with their drinks! Overall we enjoyed the cafe and would recommend it to anyone looking outside of the normal coffee chains.", "pics": null}}, {"review": {"des": "Wormhole Coffee is the quintessential hipster coffeehouse with an appropriate amount of grunginess. It has always been packed every time I come here, but there's usually some spot on some couch or chair, but I never expect to get a spot at the communal tables as easily. I've only had the Koopa Troopa (peanut butter & dark chocolate latte) because what else would I possibly want. Overall, this is a great place to get some work done but maybe not if you really need to focus because it tends to get loud with all the music and voices.", "pics": null}}, {"review": {"des": "Free street parking on Sundays!! I came in specifically to try their Koopa Troopa, and was not disappointed. It was busy inside but the line wasn't very long at 4:15pm on a Sunday. It took them less than 5 minutes to make my Koopa Troopa (Peanut Butter Mousse & Dark Chocolate Latte, 8oz/$4.50 + $0.50 Soy Milk, <a href=\"https://www.yelp.com/user_local_photos?select=pg4qizBhRLU_3XgrnvwJWQ&userid=76vIFZcC7owykCBjMfGVXg\">yelp.com/user_local_phot…</a>), which was delicious! I could taste the peanut butter a lot more than the dark chocolate, but I really liked the richness and thick consistency of this latte. However, the soy flavor may have overpowered the dark chocolate flavor, so it may be more prominent with regular milk. I would definitely come back here to purchase some freshly roasted beans, try their pour overs, and of course, order more Koopa Troopas! They have a good amount of tables available inside, but it seemed like all the seats were taken by people studying or doing work. Although the street parking was free, it can be difficult to find a spot since the street was very busy.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pg4qizBhRLU_3XgrnvwJWQ/348s.jpg", "caption": "Koopa Troopa (Peanut Butter Mousse & Dark Chocolate Latte, 8oz/$4.50)- 4.5/5 stars"}]}}, {"review": {"des": "The atmosphere is great however the redhead manager has a terrible attitude. Next time you go ask her is they make Cuban coffee....she will tell you that they don't do that here because our machines are very expensive and she doesn't want to put sugar in them. Have you ever heard of cleaning your machines to satisfy customers!! I wish I had her name but she ruined the entire experience. Even her staff was embarrassed with her crap hipster attitude......<br><br>Response to the below:<br>This is exactly the point of my original review. It has nothing to do with the sugar, it's your condescending, rude attitude that made the the experience to your location awful. I prefer to review on my good experiences however your lack of customer service and blatant disrespect is what rattled me. <br><br>Thank you for your response because now everyone can see what I am referring to.", "pics": null}}, {"review": {"des": "I love this place. Stopped by while waiting to be seated at a restaurant and needed some tea to warm me up while I waited outside. They had a pretty good selection of teas to pick from. It was a bit pricey than average but the taste was definitely worth it. I'll be returning to chill and read a book.", "pics": null}}, {"review": {"des": "Super cool eighties-movies themed coffee place. I would definitely come back. <br><br>The staff is funny and the warm chocolate is tasty.", "pics": null}}, {"review": {"des": "When I was visiting Chicago, I made it a goal of mine to come here. It was even better in person. Came here on Labour Day at around 9:40am, luckily it wasn't overly busy on that day. It was nice and quiet, a perfect place to work while enjoying coffee. Service was wonderful and wasn't pretentious at all.<br><br>My favourite part of the place was the details of the place from the NES to the floppy disk wifi display was incredible. The whole place was covered in 80's decor  and they even had a DeLorean- but this place wasn't all for show, their coffee is just as good! I ordered the Cool...But Rude latte and it was so flavourful and full of different spices.Since it wasn't very busy I was able to play on their NES, they had quite a game collection. That part of the room felt very much like playing video games at someone's living room-ah the nostalgia and I'm not even born in the 80's haha.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/P_6mpYfM6Nlg3GnGNLa0mw/348s.jpg", "caption": "\"Don't stare at me you got that bug eyes thing.\""}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/w9OHRjFeRo3kUP_rMcTJpw/168s.jpg", "caption": "Look at that game collection!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jBEMZblIx1KR9cHfDdJDpQ/168s.jpg", "caption": "Feels like playing the NES in someone's living room"}]}}, {"review": {"des": "Obnoxiously loud and terrible music playing most of the time making it impossible to read or work. Employees are pretty chatty behind the counter too so no way to have any peace in here. The coffee is good, had the honey bear and the vanilla bean. Yes this place is cool and quirky but it's not suitable to put down your laptop and get anything done.", "pics": null}}, {"review": {"des": "We were in the neighborhood for dinner last night and were excited to check this place out after hearing about it from friends. <br><br>It was busy but not excessively so. We didn't have an issue finding a place to sit. In fact, it seemed like seats were turning over regularly during the time we were there. Maybe a function of a Saturday night? <br><br>Customer service was great. The barista working the register was friendly and funny while taking our order and talking to us about the shop. It was a nice change from some of the barista drones I find at other coffee places. <br><br>My husband ordered the macchiato. He said it was okay but not great. I had a vanilla bean latte, which was really good. There was a strong vanilla flavor that melded well with the espresso. And, in contrast to larger chain coffee shops, the vanilla wasn't cloying or sickeningly sweet. <br><br>The decor is fun, especially for 80s kids (or people who have an interest in that era). My husband and I loved the old lunch boxes on display and reminiscing about the ones we and our siblings had. The DeLorean is impressive, of course, but I was more enamored of the smaller, nerdy touches -- video game character magnets made out of perler beads, stickers, etc. <br><br>Also, I found this sign (see photo) on the table near our seats and love the socially conscious way Wormhole is doing business. We're glad to support them in this and will absolutely be back.", "pics": null}}, {"review": {"des": "Cool place but I hate the coffee..they use ipsento beans which are acidic and gross.  I don't know how anyone can drink that and say they love it", "pics": null}}, {"review": {"des": "Hung out at the wormhole on a Saturday morning to drink some delicious coffee and catch up on reading my book. This coffee shop provided a cute 90s vibe - the gremlins poster on the wall sealed the deal. Coffee was delicious and there was plenty of space to sit around and catch up on reading. Recommend this spot for a down to earth vibe with some delicious coffee and plenty of chairs and comfy couches.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CXXz1SNLPuFgUzu2kBmkQw/348s.jpg", "caption": "Small mocha"}]}}, {"review": {"des": "This place is super unique. Every coffee I've had here has always been on point. Seating can be tough sometimes but other than that this place rules.", "pics": null}}, {"review": {"des": "Love this coffee shop for its eclectic decor- my favorite is the back to the future car. I also spotted an ASTROS vintage lunchbox which made my heart fill with pride especially after our WORLD SERIES victory (I was wearing my Astros hat as well ;)) The staff is friendly. The coffee shop was packed Sunday afternoon- so it's a local favorite. My soy vanilla latte was oh-kayyy- not as warm/hot I would like it to be. My friend loves their jasmine green tea.", "pics": null}}, {"review": {"des": "Fun and hipster vibe going on in Wormhole. Vintage displays all around the shop! Definitely not a place to work or study for me. Great place to meet your friends. I don't drink coffee, but I decided to try their cappuccino. It was okay, but I loved the teddy graham on the side. So cute! Some of the seats are kind of uncomfortable. But I definitely recommend this shop for people who are into both the 80's and coffee.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rEcq-HXIyXP9OK5PenAt5w/348s.jpg", "caption": "Cappuccino"}]}}, {"review": {"des": "I'm an 80's baby and this place hit me right in the feels. Talk about cozy and nostaglic! The baristas were fun, friendly, and fantastical and their awesomeness can only be matched by the food and drinks. They even offer some vegan pastries! A++", "pics": null}}, {"review": {"des": "Amazing coffee, friendly staff, array of baked goods, and space. <br><br>We ordered the Peanut Butter Koopa Troopa Latte, Honey Bear Latte, and the breakfast donut! Both lattes were fantastic! The Koopa Troopa was creamy with deep notes from the peanuts with this roasted flavor. The Honey Bear was perfectly sweetened, creamy, and topped with a delicious and luxurious foam. The breakfast donut paired well with our lattes. The donut itself was dense with a sweet glaze topped with oats and cranberries. <br><br>We really enjoyed the interior of the space with its open space, plentiful seating, and light shining from the Windows. Being there and enjoying the food and coffee just makes for a really good time!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/z7etXiZJ8Avbv8kNiSVKBA/168s.jpg", "caption": "Top Left: Koopa Troopa, Top Right: Honey Bear, Bottom: Breakfast Donut"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/x3R2jIGoa2vtWBBxED433A/168s.jpg", "caption": "Breakfast Donut-yummy"}]}}, {"review": {"des": "The coffee is warm, but the service is not. My \"hey how are you?\" was met with an anticipatory blank stare as if my friendliness only exacerbated his impatience. My friend got the same vibe. The coffee was good though. ‍", "pics": null}}, {"review": {"des": "Pretty cool coffee place! <br><br>This place has an interesting mix of hipsters, coffee snobs, and 80s nostalgia. It looked like it would be a good place to sit and work for a while, or just hang out. I got the cappuccino, and while it was expensive, it tasted great. It also came with a teddy graham on a tiny spoon which is kind of adorable.", "pics": null}}, {"review": {"des": "Does your coffee shop have a back to the future Delorean inside of it ?80s toys and  movie posters ?A Tv with a  Nintendo playstation and games ?A Funky random music playlist ?  Delicious coffee including a Ginger /Curry Coffee and honey bear latte ? Friendly fun staff?I  I didn't think so !<br><br>These are just some of the reasons why this is my my Favorite little  neighborhood Coffee shop. <br><br>I basically get the same thing every time I come in here . Cool but rude ,a ginger/curry latte . Or the honey bear latte  ,which is exactly what its sounds like ,honey latte .They also have delicious pastries and macaroons incuding a jameson caramel macaroon I had here once . <br><br>Seating is usually pretty good if you need to use the wifi. Theres 3 long big tables ,couches and a diner style bar  table .Although during busier times it gets jam packed and you wont find any. <br><br>I only wish this place was on my way to the blue line before work .", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Q2CbZdJswv6Y20gJe-LMoA/348s.jpg", "caption": "Raspberry cornmeal muffin and a cool but rude"}]}}]}