{"name": "the-bongo-room-chicago", "reviews": [{"review": {"des": "(8/26/18) Such an amazing place to have brunch. While this is my first review, this isn't my first time attending one of the three locations. Of course I have only been too the locations that sell liquor. I love how they tell you your wait time will be 45 minutes to an hour and usually its about 20 maybe 30 minutes at the most. Such good service. <br>A girlfriend of mine and I were seated by the window (that's the best place to sit). You get more room and if the weather is nice, you have a nice breeze to go with. I ordered the Shrimp scampi benedict and my friend order the deconstructed lobster roll benedict. Yall! (yes I hollered) Those HAVE to be the best items on the menu and yes I will argue. Maybe it's my bias opinion of seafood but the Bongo Room is not stingy in the slightest with the seafood. so you get bang for your buck. <br>If you live in chicago, I shouldn't have to tell you to go. If you're in town visiting, GO! GO! GO!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LYABllWGkruj-ecnHJ_Bog/168s.jpg", "caption": "Shrimp scampi Benedict"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sqRnzVfWPs_z-G8yFvff5w/168s.jpg", "caption": "Deconstructed lobster roll Benedict"}]}}, {"review": {"des": "While eating brunch has never been my thing. In the past year I've taken a liking to it since I made it a goal of mine to go out an try a new place at least once a month with my family and friends. So when I go somewhere I go to enjoy my time and not really look into dissecting my experience. This time however, I need to say that I had to hold my tongue at the request of my wife. <br><br>The experience started just like any other, with the exception of us actually being seated sooner than we had expected which was a huge plus with 3 children in tow. We were seated pretty much next to the kitchen that was cranking out plates like a well oiled machine. Little did we know that it was not going to continue to be as good as it had started. Almost like when you go skateboarding and the road is smooth, but you just don't see that crack coming up in front of you at the intersection of heavy traffic and then, well, you know how that ends. <br><br>So we were greeted by Meghan, who was very friendly. As she handed us our menus, she noticed that we had young ones with us and made some recommendations on pancakes that the kids would enjoy, +1 for Meghan. She walks away to give us some time to review the menu. After a few minutes she comes back and asked if we were ready to order. We begin to give her our order when she interrupts at the fourth person, not the first to state that she didn't have her pen, - 5 for Meghan. Not sure why it took her that long to realize that she didn't have her pen, but the fact that we had to go back and start the whole ordeal of ordering for hungry kids didn't make this a worthwhile moment. <br><br>Now, as you can see from my pic of the kitchen, we were pretty dam close. Close enough that I could just grab my own plate right from the griddle and enjoy my BLT Benedicts, which had some very well executed poached eggs on top with just enough of their Hollandaise on it to make it right. Yet, when I went in for the potatoes that came with my meal, they were cold and completely unseasoned. I asked one of my friends that came with us and the result was the same, cold unseasoned potatoes. Not sure how or why, but I gave in and just added some S&P and called that one a day. <br><br>The iced coffee that we ordered also didn't meet par. It had a taste that was bitter, which is what commonly happens when a coffee sits too long in the carafe on a burner. I only drank a little bit of it and switched over to water. The coffee actually caused my stomach to become irritated and it seemed I wasn't the only one that felt the same at our table. <br><br>I really wanted to love this place because its close to home, but after my experience I'll have to look elsewhere. <br><br>Here is a highlight of what I enjoyed:<br><br>- Nice lighting and décor<br>- Food portions were very good<br>- Staff was friendly<br>- Place was clean<br>- Not too loud, average noise level so you can at least have a good conversation with out yelling across the table. <br><br>Areas of improvement that could make this place great:<br><br>- Making sure that food is better executed before serving, Hot food goes out hot and seasoned unless noted in the menu. <br>-Price for drinks was a bit too high. Example: Chocolate milk $4.75 for only 8 to 10 oz. If that, it actually looked like less. <br><br>After this, I look back and can say that my comparable preferred choices in the area would have been Yolk or Hot Chocolate.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QCVWiyn8JnEsb-d_MPooiw/168s.jpg", "caption": "Mango mamosa"}]}}, {"review": {"des": "Delicious food and speedy service-- classic for a busy, Chicago diner. We came for brunch on Saturday and were estimates to wait 30 minutes for a 2 person table. We were seated within 15! PSA: like most brunch places, this restaurant is heavy on the pork dishes (unfortunate for those of us who do not eat it). Our waitress was very pleasant and the food also came out exceptionally fast. They nailed the service to a science. <br><br>Also an interesting tip-- despite their menu saying that they do not offer substitutions, they DO allow for swapping or replacing of certain items. Keep this in mind!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_JyAt80ybyop4VOne0hRrA/168s.jpg", "caption": "Lobster Benedict"}]}}, {"review": {"des": "I should have read my prior review. This place sucks. I got the potato chorizo avocado omelette. It sucked. Hardly any cheese or avocado. Got served with potatoes...SO MANY POTATOES. All for the great price of $14.00!!!  Ughhhhh. I loathe this place. Never ever again.", "pics": null}}, {"review": {"des": "Stopped at this place with my fiance while downtown.  It was suggested to us.  Girly got an egg breakfast with chicken sausage and toast.  I got a breakfast burrito.  Also, had a couple drinks (all pictured).<br><br>Breakfast burrito has no meat, just egg and guac with a spinach wrap.  I found the wrap not so great, so, I just ate the insides with the provided salsa.  Pretty good, but really just eggs.  The potatoes I thought were very good.  Girlies breakfast was good, but, there were a couple issues.  She asked for Tabasco; sadly, they only carry one hotsauce, Cholula.  Then she asked for some grape jelly, but again, they only have one jelly option, BlackBerry.  That turned out ok because she did finish her toast, so, the BlackBerry must have been alright.  Just odd they had very limited hot sauce and jelly options.<br><br>Service was very friendly and prompt.  3 stars for an \"A-Ok\" experience.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/voWp_HnEVFY65qfwjHBNEg/168s.jpg", "caption": "Breakfast burrito.  Was ok."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jFzxjp7RClaBySmSt6ltrw/168s.jpg", "caption": "Chicken sausage, cheesy eggs, & toast"}]}}, {"review": {"des": "How could you not like the Bongo Room? Unless you're on a diet in which case you're in the wrong place. Avant-garde menu with out the snobbery. <br><br>I've been here several times and there's always something new.  Today we had the white chocolate caramel pancakes- too rich. I need an offset. The apple churros French toast came with fruit to cut the sugar of the toast, this is better.  I had a sliver of the egg white Rueben - no complaints", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4ke6xZNBS2h8rlQUpQkgVQ/348s.jpg", "caption": "Churros French Toast/ white chocolate caramel pancake / egg white Reuben"}]}}, {"review": {"des": "You can always tell how good a place is by the wait to get inside. Luckily since it was just the two of us we got almost right in.<br>All of the staff is friendly and the brunch menu is amazing. I had the lobster roll eggs benedict and my husband had the chocolate french toast. Both were very good, but also very rich... we ended up swapping plates mid brunch to change up the palette.<br>This is not a place for people on a diet!", "pics": null}}, {"review": {"des": "Saturday brunch wait was 25 minutes for us, as quoted by Host. We waited for our server to come to our table for ten more minutes because the place was extremely busy. Average Chicago breakfast atmosphere: crowded, popular tourist destination, fast staff service, waft of great smells, line out the door. This place is among the hustle and bustle of Wicker Park six corners.<br><br>The menu is categorized by savory or sweet selections. I'm not a sweet foods gal, but the savory pancakes looked like they could persuade me to the dark side! The table next to us had a pancake that was fully submerged in a white chocolate creme. My husband was seconds away from running away with it. <br><br>I ordered the Chorizo, Potato, and Avocado Omelette (per title; queso fresco cheese with side of red salsa, house potatoes, and choice of toast. Chorizo was spicy. Plenty of Avocados. Couldn't taste the queso fresco. Potato overload. Side potatoes were buttery, soft, and seasoned with herbs. Worth the $13.95. Overall, filling and spicy). My husband ordered the Greek Style Burrito (scrambled eggs, feta, diced tomatoes, grilled chicken with tzatziki sauce and side of house potatoes- bland, not enough feta or tomatoes, but good tzatziki portion. $13.25. My husband said he would order a savory pancake instead, next time. <br><br>Prepare to wait. Venture towards the savory side of the menu. Not great for groups more than four. The two of us were seated faster than larger parties. Awesome service. Will return for those sweeeeet pancakes!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/T53PS80FRvqpzlZEl1rTMg/348s.jpg", "caption": "Menu as of 9/2/18"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ybeSxIqa2UG_koWtGzk5eQ/168s.jpg", "caption": "Greek Style Burrito"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WX5LYqHPOha1ahdWfVI4tQ/168s.jpg", "caption": "Menu as of 9/2/18"}]}}, {"review": {"des": "Came here for a Sunday Brunch, wait was about 30-45 mins.<br><br>Friendly service, ordered the white chocolate and caramel pancakes, that was heaven. Totally hit the sweet tooth, I would ask for extra sauce for the pancakes that didn't get coated. I also got the mocha latte with whip, that too was also good. Great spot for brunch.", "pics": null}}, {"review": {"des": "Stopped in here for breakfast with a friend. We both ordered the vegetarian croissant with a side of bacon. It was fresh, flavorful, and delicious. Highly recommend! This is a hip spot to grab a great breakfast in wicker park.", "pics": null}}, {"review": {"des": "Came for brunch at about 10am on a Saturday. We were able to snag a table for 2 without waiting only a little while before a rush of people came in and had to wait.<br><br>The inside and outside of the place are pretty simple. Kind of bright colors with a vintage wood floor, the kitchen is semi-open and the place itself is long and fairly narrow.<br><br>We perused the menu and started with mimosas, I had the guava and she had the orange mango. Both were good but I liked mine better, I have never had a guava mimosa but I definitely would order it again. Seemed to be pricey at almost $10 each but it seems that $10 is about the going rate for a drink in any good city restaurant.<br><br>We also kept brunch quick and easy. I had a create-your-own-omelet and she had the tomatillo salsa scramble. Both were good but I thought hers was much more interesting than mine. Omelets aren't the most exciting brunch item, and if I didn't add the Havarti cheese, it would've been very mediocre, but the cheese added a needed texture to it. The other ingredients tasted nice and fresh, just didn't wow me.<br><br>Overall it seemed a bit pricey for what it was. My omelet exceeded $15 after all the stuff I put in it, and I'm not quite sure it was worth the high price. My date really liked the scramble and the drinks were good. There are a lot of sweet options on the menu like pancakes but we didn't try any of those. Maybe next time.<br><br>Our server was pretty nonchalant. We didn't need him much but he did check up on us. The only thing was that he brought the check a little too early, in my opinion. We did not ask for it and were about 80% done with our food when he dropped it off. I know Saturday brunch is a busy time and tables need to be moved, but this made us feel a little rushed as we were still eating.<br><br>Didn't really see the hype here, food was good, but pricey for what it was.", "pics": null}}, {"review": {"des": "Delicious brunch, but be prepared to wait....and wait it is worth it. As a reward you will get to enjoy  creative old favs like French toast made churro style and eggs benedict with cajun shrimp! Yum!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NYRS19bh1-H98t62rdLvMg/348s.jpg", "caption": "churro french toast!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/deECN9GjDeI-gpBCT2k8cg/168s.jpg", "caption": "brisket and eggs, eggs Benedict and shrimp, and churro french toast"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7GsrqjEijp8b2sbMTsjd1A/168s.jpg", "caption": "Shrimp eggs benedict"}]}}, {"review": {"des": "This review is years overdue. Back in the day when they first opened I would have complained about the pretentious hostess that continually gave us a snobby attitude but come 2018 I'm glad they got their attitude in check! Equally happy they offer text messaging to summon you when your table is ready. If you've never experienced The Bongo Room you're in for a wait. It's a good idea to put your name in then walk around wicker park enjoying the shops. <br><br>When you're finally called, first timers shouldn't hesitate to order their outrageous pancakes or french toast offerings. Stacks on stacks drenched in various frostings and toppings. IG worthy! Once you get past the initiation, breakfast sandwiches are phenom on flaky, buttery croissants! I always order tea to drink here because it's loose leaf and flavorful! My favorite is mango strawberry. I opened the kettle and to my surprise their were whole chunks of mango! Phenom!<br><br>Bongo Room is a long standing Wicker Park staple for brunch, cant go wrong!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/acCWEUX5e9r8PdIyM6aUGw/348s.jpg", "caption": "Tempted to get a stack of pancakes or French toast but settled on the vegetarian croissant sandwich! Delish!"}]}}, {"review": {"des": "We've been here multiple times. Used to be one of our favorites when we first moved to the city 4 years ago and were new to big city brunch. After having experienced many other places, my rating has overall gone down for bongo room. <br><br>You can always expect a wait on the weekend. No reservations. They're quick with food and service. Menu items I'd give 5 stars are the chorizo omelette and the white chocolate caramel pancakes. Those are musts. <br><br>I've had a chicken sandwich here that was very dry. The turkey sausage sandwich was very one note and dry as well. The egg white Reuben omelette was fluffy but nothing overly special flavor wise. The blueberry cornmeal pancake is well balanced. They don't advertise it but you can get a single pancake to split for $5 which is nice if you don't want to have to order that as your main dish!  The iced coffee is bitter and nothing special. <br><br>So overall- the sweet dishes are always strong. But there are plenty of other options for brunch in the neighborhood as well :)", "pics": null}}, {"review": {"des": "I had the shrimp BLT which was good but I feel like it could have been better if it had a different bread/roll: the ratio felt a little off. We have a baby who's less than a year old and brought him with us for brunch, it's always nice if places can accommodate families as well for brunch. Otherwise I wasn't really impressed with the menu. It seemed like a lot of really sweet breakfast options and it's not really my thing.", "pics": null}}, {"review": {"des": "Came in for brunch and had THE BEST EXPERIENCE! Our amazing server, Emily, was so friendly and made sure we were having a great time! They have a nice selection of mimosas that you have to try. I ordered their crab salad sandwich and the crab was very fresh and I was stuffed! The food, atmosphere, and employees were excellent! I can't wait to visit again.", "pics": null}}, {"review": {"des": "Like other 3 star reviewers I wanted to like Bongo Room more but it just did not wow me. My roommates RAVE about this place so I reluctantly allowed them to drag me out. They warned of an hour wait, which I was NOT interested in and so we were plesantly surprised when we were seated immediately. <br><br>Ambiance: Like others have said- it is a noisy, crowded place. Now to be fair, this is not unusual for breakfast only places. So I'll give them a pass on it. It was however, FREEZING in this place. I know it's Chicago and it's summer but I was shivering. Not how I wanted to start my morning. <br><br>Food: Reason number one I wasn't all that excited about Bongo Room is that I am not a sweet breakfast person and I hate poached eggs (see this was a disaster to begin with). Anyhow, I ordered my usual- two eggs over easy with an english muffin and potatoes. Eggs cooked great, english muffin was warm enough. Potatoes- meh. I wouldn't order them again. <br><br>Service: Now here is where I may have given 4 stars but instead I'm at a 3. Our service was terrible. Although we were seated right away, we waited and waited and waited for our server to come back after we declined drinks other than water (our first mistake). Then the two tables around us who ordered after us got their food first, not the servers fault I recognize but we were kinda like uhhh okay? After we waited and waited now we wait some more? <br><br>Planning your visit: things to remember- you should expect to wait. We had some fluke of luck and didn't have to. Their aren't benches or seating outside so if you have older folks with you this may not be the best. Parking- it's Wicker Park and it's Milwaukee Ave. Be prepared to have to walk a bit if you do find parking. Uber here (unless you can walk) is probably best. <br><br>Overall I'd probably come back not on the weekend and try the regular menu. Not all that impressed with the brunch menu. TBD.", "pics": null}}, {"review": {"des": "Wowsa, what a cool place.   Very busy, yet the food was out very fast and was very delicious.   The staff was super friendly and very attentive, my glass/cup was never more than half empty.   I have to give five stars because the food and staff are A+, but please be forewarned that breakfast is really pricey here.   If they are going to charge an arm and a leg for an omelette, at least give us a break and offer cheap beverages.  My daughter had an omelette and it was light, fluffy and delicious.   The eggs Benidict was out of this world delicious.  I had a turkey/egg sandwich on a pretzel bun, and like the others it was great.   The sausage on the sandwich was a bit spicy, which I love, but may not appeal to all.   Again, I loved this place, and I am sure you will, too!", "pics": null}}, {"review": {"des": "I decided to check this place out on a whim and to treat myself since it was my last day on a visit back to Chicago. I have lived in Chicago for six years prior to moving to the south. This place is absolute and utter trash. The seating arrangement was poor and small and there were way too many two table tops squeezed into this tiny place. We were awkwardly greeted and shoved into a two top in the corner of the restaurant next to the host stand. Our waitress, Jessica V, was no where to be found for at least a solid 15 minutes. She was snippy and rude. My friend ordered an Irish coffee - Jessica slammer her drink on the table when dropping it off and didn't even come around once to ask us how our food was. <br>  The menu here sounded impressive but it basically looked like this place threw a bunch of fancy sounding ingredients together for its brunch menu. To make matters worst - the food was ATROCIOUS. My friend and I ordered the breakfast burrito. The only decent aspect of this entire experience  was the side of potatoes. They were crispy and perfectly seasoned. The burrito wrap was complete trash. The spinach tortilla was doughy and overwhelming. The eggs were bland - looked and tasted like they were out of a carton. I'm not sure how it is possible to make avocados taste disgusting but bongo room succeeded to do so. The avocados were runny and watery and were so bland and made the texture of the spinach tortilla even more watery. I could take the $10 I spent here and go to Aldi's and make a much better breakfast burrito than this place. I'm astounded this place has customers and it was as packed as it was. There are much better breakfast places/brunch places in the city of Chicago. Also special shout out to our extremely rude waitress, Jessica V - thanks for being the absolute cherry on top of this awful dining experience. Seriously, Jessica, I don't know if you were having a bad day but your attitude was completely unacceptable. I've included a picture of this burrito but don't be fooled - chipotle tastes like a five star restaurant in comparison to this place. avocados, eggs with a spinach tortilla wrap = complete failure.<br>Eggs were bland and tortilla was doughy and soggy from the runny underripe avocados. YUCK! This place was also hella overpriced.<br>I can't get my $30 I spent in total on having brunch at this place but I can use yelp to encourage people from making the same mistake I made to attend this place for brunch. Don't do it!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YoAo2W4E33NkmXfvIeEQJQ/348s.jpg", "caption": "Looked more appealing than what it actually tasted like. Breakfast burrito wrap"}]}}, {"review": {"des": "GOOD FOOD RECIPES/ BAD FOOD PREP. <br><br>I'm confused on how to rate this place. I walked in and didn't get greeted, 2 minutes later the hostess seats me infront of the door, I ask for something away from the door, I get a mean look and shitty attitude as she walks me to the bar. Not a single worker is smiling. <br><br>After 2 cups of coffee I was wondering what was taking so long for the food to arrive. Sure enough the food was delivered luke warm. AWESOME! Food had good flavor. I'm sure this place is a great restaurant I just got the shitty experience draw. Oh well. I will never return tho. AVERAGE $60 breakfast. <br><br>Manger needs to reevaluate the customer service policy and coach employees how to smile and great customers properly.", "pics": null}}, {"review": {"des": "Bongo Room is overrated. I have been here twice and am very underwhelmed. <br><br>One reason for a star reduction is that they are not very allergy friendly. I told the waitress twice that I had a dairy allergy and my food was still served with dairy. I took away the other star because while the food is decent, I don't think it's worth the wait. It didn't blow me away.<br><br>Better brunch places with less time to wait.", "pics": null}}, {"review": {"des": "I had been wanting to come here for the longest time. Finally made it and I wasn't disappointed. <br>The service was fast, maybe cause i came on a Tuesday morning. It wasn't crowded. <br><br>Although the omelette wasn't great, nothing special. But the pancakes were probably the most delicious thing I've ever had in my life. <br>I'd come back just for those.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JfLZubwQA0QVbMbeaT63nQ/168s.jpg", "caption": "BYO omelette, added potatoes instead of bread."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nY6DWMo59wuZCGQeGs8DTg/168s.jpg", "caption": "White chocolate caramel pretzel. It's a piece of heaven in every bite!"}]}}, {"review": {"des": "They were slammed on Labor Day- not surprising. We had the chorizo with avocado omelette, crab salad sandwich and turkey sausage sandwich plus a small order of a lemon and white chocolate pancake. Mimosa and two of the coffee cocktails. All was good and tasty- I think the pancake and the omelette were the best. Kinda disappointed my mimosa wasn't served in a champagne flute. I would certainly go back to try more yumminess!", "pics": null}}, {"review": {"des": "My first time here after hearing so many people talk about how good it is. I ordered the chorizo omelette. So good! The potatoes also were cooked on the crispier side, which is my fave! The portion size is big so I had enough to enjoy more for lunch!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9fhBf30offk4ddvKHIdihA/348s.jpg", "caption": "Chorizo potato avocado omelette"}]}}, {"review": {"des": "A weekday visit seemed in order as I had the day off. So instead of opting for our favorite place, we decided to try Bongo room, as there was no line and it's been a while since we had the most delicious pancakes with a lemon mascarpone cream that was so memorable!<br>Our server sat us and within 1 minute came back and asked if we knew what we wanted. Uh, no. Maybe coffee first? <br><br>Sadly, there was no special pancake offered on the weekdays, so we went with the blackberry and Meyer lemon pancakes and a breakfast burrito. <br><br>Both were forgettable. I noted to my dining buddy, the croissant sandwich had one egg..one egg? He said I could add another, but if anyone has ever eaten a croissant, it is larger than an English muffin and those hold one egg. <br><br>So the pancakes were less than spectacular and the burrito was just all spinach tortilla and some tasty scrambled egg. Melting cheese on top seemed dumb and there is a size down from huge tortilla that could have held the fillings of this burrito prefecture. <br><br>We ate a 1/3 of the pancakes and just 1/2 of the burrito and regretted our choice of bongo room for brunch. <br><br>My only tip to those waiting in the huge line on the weekend, if you're going here and can convince your friends to do a coffee walk and find another place in the area for food, you will be grateful that you went to eat brunch at any other place.   Maybe do a traveling meal...coffee and a danish, then go find an egg dish at another place like Fairgrounds, then wander off to find some good sausage or bacon and a cocktail at Covey.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DVS0bPnDPhwofp0FNmsYZQ/348s.jpg", "caption": "The menu on 8/31/17 note the croissant sandwich with 1 egg!"}]}}, {"review": {"des": "Holy mackerel. This sh*t is fire! It's some of my favorite breakfast food in the Wicker Park neighborhood and I'll tell ya right now, it's worth the wait! Let's be honest, if you're going to actually wait up to an hour to get a seat at a restaurant, the food must be bomb. Welp, lucky for you that's exactly the case here at The Bongo Room. Now, the wait isn't always forever and a day a d if you play your cards right you may sneak right in. Forget brunch on the weekends, sneak in during the week or bright and early on a Sunday. The place is pretty small so I suggest that you're mindful of the fact that you're really close to other diners. They can easily overhear your conversations, just be warned, ha. <br><br>My absolute favorite item on the menu is their vegetarian croissant sandwich. Oh my goodness, its so good! The sandwich is built on a soft and flakey croissant and comes with melted Muenster cheese, fresh spinach and tomato, crisp cucumber, a flavorful basil mayo, and I always get my egg over medium. I also scratch the mushrooms. I'm not a mushroom gal. Now this sandwich is huge and even comes with breakfast potatoes. So, you better be hungry! I always pair my order with a coffee and every single time I get this I leave full as can be with a giant smile on my face. I am guilty of nibbling on my friend's pancakes every now and then but honestly, I've always stuck with the same order. It's hard to find such a delicious vegetarian breakfast sandwich with so many veggies on it. I simple can stray away from it. <br><br>If you have the time and you're hungry gallivanting around Wicker Park, try and stop through the Bongo Room. You'll be in for a treat!", "pics": null}}, {"review": {"des": "This is probably one of my favorite places in Chicago for Breakfast! They do both sweet and savory dishes so well whereas I feel many other restaurants seem to do one better than the other.<br><br>We got the salted caramel pancakes and the BLT Eggs Benedict. The pancakes were smothered in sauce - head to toe. Whenever I get sweet pancakes at other places, I feel they never give enough of the sauce and the dishes aren't sweet enough - not the case here, this was basically a dessert. The sauce was rich and creamy and very tasty. The pancakes had bits of pretzel incorporated into them and were a little dry by themselves (to be honest) but were very good with the sauce. The benedict was very good as well. It was savory and delicious, exactly how it should be. The prices aren't cheap but could be worse ($10-$15) so I would say it's an OK value.<br><br>The reason for the 4 stars is the service. Our waitress actually rolled her eyes at us! She asked for one of us to pass the salt - we couldn't hear so she had to repeat herself. Not the most professional service, that's for sure.<br><br>Overall - yes, this is a great option for Breakfast/Brunch! Hopefully you get better service than we did.", "pics": null}}, {"review": {"des": "Honesty first...pancakes are my least favorite item for breakfast, BUT damn it Bongo, you converted me to a believer of the pancake! It was a homemade light and fluffy perfection dusted with graham crumbs (like what a touch of angel dust) and smothered with a smooth light lemon and raspberry sauce from the heavens. I felt every bite was like a first kiss.", "pics": null}}, {"review": {"des": "Good breakfast spot with friendly service. My boyfriend and I came in for breakfast today. We were greeted by the nice hostess who seated us promptly. Our waitress then came by to introduce herself and immediately got our food and drink order. My boyfriend ordered the two eggs any style with bacon and wheat toast and I ordered the breakfast burrito. Both dishes came with a side of potatoes. In addition, we ordered a short stack of the churro French toast to share. My boyfriend also ordered an iced coffee and I ordered the cappuccino. We got our drinks but it wasn't anything that great. My boyfriend wasn't too fond of his iced coffee and neither was I with my cappuccino. We also waited quite a bit for our food. Once we got our food, everything was good but nothing that really impressed us. Out of all the dishes, the churro French toast was the best part in my opinion. <br><br>Overall, it was a good breakfast place to try but I'm not sure it would be something we would want to come back and try the next time we're in town.", "pics": null}}, {"review": {"des": "My husband and I had a tasty breakfast here. I love breakfast so I'm usually pretty conservative on my menu choices. I had the eggs and bacon which were...well...eggs and bacon! The serving was hearty for both with 4 pieces of bacon included instead of the normal 2 that gets served everywhere else. My husband had the turkey sausage sandwich on a pretzel bun. He really enjoyed it but found it spicier than he anticipated. He likes spicy, so he was fine. He just wasn't expecting it. We arrived right at opening so we were seated quickly but there was a line forming shortly after our arrival. Service was very good and the food arrived quickly. Reasonably priced for a big city joint - we spent ~$35 with tip for 2 entrees, coffee, and iced tea.", "pics": null}}, {"review": {"des": "Drinks were amazing... blackberry grapefruit mimosa was nice but felt like bloodymary didn't have alcohol... hahaha maybe that's just me ;)<br> I also ordered pineapple coconut pancake, it was soooo good. It's a bit expensive but food is worth the price. Will definitely come here when I m back in Chicago.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QBtgKKRWgjLDy3xOCuTCAQ/348s.jpg", "caption": "Blackberry grapefruit mimosa & bloodymary"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6oolwIncu1iUJGe8QuCoJg/168s.jpg", "caption": "Pineapple coconut pancake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iycTxFe5EkoPf00yIgPboA/168s.jpg", "caption": "Hash brown"}]}}, {"review": {"des": "I have been to the Bongo Room Downtown Chicago as well as the one here, I would say the cooking quality is about the same in both which is nice. The wait here on a Sunday morning was about 35 minutes, they take your name and phone number and then text you when at able is ready which is really nice. The place is clean and the atmosphere is really cute. Our waitress was really nice, and even though the kitchen lost our orders initially apologized a thousand times and made sure we got everything correctly and as fast as possible. <br><br>I had the Chocolate French Toast Tower, which was good but I got bored w/ it pretty fast. I would recommend the red velvet pancakes and the egg benedicts over it.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FQX_nZAqpOMOFDF-1gCGzw/168s.jpg", "caption": "Shrimp scampi eggs benedict"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OzSinBEyDqgwoTw-uRh9JA/168s.jpg", "caption": "Chocolate tower French toast"}]}}, {"review": {"des": "Just came here for brunch. Ordered the blt eggs Benedict and deconstructed lobster roll eggs Benedict . Both come with a side of potatoes. Can't remember prices maybe around $15 each. Also ordered white chocolate caramel pretzel pancakes which were delish. I don't think it was overly sweet. Also had the mint tea . All together the bill was 47. <br><br>Arriving on a Saturday I waited 15 min for a table for two. No reservations, and you won't be seated if your party isn't completely there", "pics": null}}, {"review": {"des": "The food was average.  I got two eggs any style which comes with potatoes and bread.  It was alright, I mean how fancy can scrambled eggs get really?<br><br>We also got white pretzel pancakes for the table to try.  They were tasty for about two bites, after that it's just sugar overload.  <br><br>I would recommend this place to people who have a huge sweet tooth.  I'm glad I went here because my husband loved this place but I'm not sure I'll return.", "pics": null}}, {"review": {"des": "Horrible experience! My eyes are still burning from all the smoke coming out of the kitchen. Maybe you should spend some of that up-charge money on a new exhaust system. I now have to shower again and change my clothes because I smell like burnt grease.   <br>The sandwich was tasty.  never again! <br>Not the same old bongo room.", "pics": null}}, {"review": {"des": "Ahhhhh.. I don't know where to start. My gf insisted we come here for BRUNCH.. and how amazing their pancakes are, especially the Banana Pancakes. <br><br>We came in on a Saturday, few days after Thanksgiving. And we were surprised that there wasn't a line out the door. My friend said that this restaurant would get extreme busy and the wait can be an hr long. We had given our name to the host and the host stated the wait would be 15-20 mins. After 15 mins we were seated. <br><br>We ordered the Deconstructed Lobster Benedict and the Banana Pancakes. <br><br>Oh my gawwwwddd the Banana Pancakes are to die for. Not over sweet, nice and fluffy, and just the perfect amount of bananas. We couldn't finish the pancakes, so we had them packed Togo.<br><br>The Benedict was delish as well... very flavorful. <br><br>We also got their spicy Bloody Mary and that was perfect. Not overly spicy, just a kicked and with all the fixings on top... so so good.", "pics": null}}, {"review": {"des": "This review is long overdue but much deserved. I'm not a huge breakfast person but this place blew me away! Their Bloody Mary was delicious and their pancakes are a must try! My husband ordered the breakfast burrito which he loved. Can't wait to go back!", "pics": null}}, {"review": {"des": "I'm Bonkers for the Bongo Room!! <br><br>We showed up at 9am and had a 20 minute wait so we window shopped and were texted about our reso twenty minutes later. We were lucky because when we sat down, the wait time had changed to an hour.<br><br>The place was jammin' with families, friends, and couples, all talking, eating, and laughing. Perfect!<br><br>I immediately felt at ease as I slid into our booth, prepared to dive into a big plate of something--all the dishes around me looked marvelous and I couldn't decide, so I closed my eyes, let the roulette take over, and chose the goodies :)<br><br>The sausage patties were pretty tasty; not greasy or fatty.<br><br>I thought the Fruit Plate was pretty large for a side order; I enjoyed the medley of grapes, watermelon, cantaloupe, apples, pears, strawberries, and of course the chilled bananas. I did not share the chilled bananas. <br><br>The Tomatillo Salsa Scramble was light and surprisingly very filling! The egg white scrambled with grilled chicken, spinach and avocado was a protein heavy meal and the side of tomato slices and multi-grain bread rounded out the healthy portion of my brunch.<br><br>I decided to get 'sinful' (as the menu says) with the White Chocolate & Caramel Pretzel Pancakes. Yes, that's right: white chocolate. caramel covered. pretzel. pancakes. The generous portion of three pancakes was more than enough due to the layers of crushed pretzel covered with white chocolate cream and buttery caramel. <br><br>I don't generally let my sweet tooth come out to play during an actual meal, but I was thanked over and over again :)<br><br>Our server was very attentive, the atmosphere was casual, and the food was excellent! <br><br>Get Here Fast and Get Here Early!", "pics": null}}, {"review": {"des": "They don't take reservations or use apps like No Wait, so it's either come early or be prepared to wait at one of the nearby coffee shops. Checked in and were told the wait was 35 minutes- ended up receiving our text in about 15 minutes! The space is pretty small which is probably why the line gets long. <br><br>Raspberry-pear mimosas  Sweet & delicious. The blackberry-grapefruit was okay, mostly grapefruity. <br><br>Tried the BLT Benedict- each ingredient was absolutely delicious, from the bacon, to the tomato and spinach, to the English muffin. Potatoes were great in the hollandaise sauce with the bacon bits from the Benedict... so yummy. <br><br>And the chocolate tower French toast! !!! It doesn't look like much, but the chocolate inside is a wonderful surprise. The banana cream balances out the richness of the chocolate too. <br><br>Tip: go with a friend so you can try multiple dishes. My friend and I rotated between the Benedict and French toast. Portions are big so come hungry or be prepared to share/take leftovers home.", "pics": null}}, {"review": {"des": "Had lunch on a busy Sunday morning.  Good size line but a reasonable wait as the service is quick and attentive.  Food was great (I had classic Eggs Benedict and my Wife had the BLT Benedict) and the Bloody Mary was killer!!  Have already recommended it to others!  It is a great space that has a \"Breakfast Joint\" like feel with really good food.", "pics": null}}, {"review": {"des": "Awesome Breakfast! Had the pineapple upside down pancakes. Tasted great...only missing the maraschino cherry.", "pics": null}}, {"review": {"des": "If you're looking for a decedent, over-the-top brunch place you found your spot. Absolutely delicious. Menu items feature things like white chocolate and caramel pretzel pancakes. They are as good as they sound. They also have very good mimosas, served in lots of flavors. Do you really need to know more?<br><br>Note: wait times are huge. Get there before noon or send someone ahead. <br><br>Not many places I'd wait 1.5 hours for, but this is one of them.", "pics": null}}, {"review": {"des": "I think that people, myself included, are often under the impression that restaurants with long ass waits = the best places to eat, and Bongo Room definitely falls within the realm of that misconception. I went to the Wicker Park location today and was shook by how crowded and loud the place was and the number of guests who brought luggage with them to brunch. It certainly draws a lot of tourists, but that shouldn't be a reason for below average food. I got the Veggie Croissant Sandwich with a side of fruit. The sandwich had minimal flavor even with the basil mayo smothered on the bread. Aside from the egg, the fillings were mostly cold, the croissant barely toasted. The assortment of fruit was also underwhelming. My friends got different omelettes, and I couldn't help but notice how much ketchup, hot sauce, and salt they had to pour onto their plates. There are a million brunch spots in the city, and I urge you to try any of those before you wait an hour to eat at Bongo Room.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_qWI_8NJiAk78MnNBZZX1Q/168s.jpg", "caption": "Veggie croissant sandwich"}]}}, {"review": {"des": "I had breakfast here on a Saturday around 10:00am and the wait was only about 5 minutes. The Bongo Room is in a great location on Milwaukee in Wicker Park, so if you do have to wait there are tons of places to explore. <br><br>The food was decent, I had a build-your-own omelet and I was more than satisfied. The coffee was $3.50, so just make sure you get a few refills. Other than that, I highly recommend the Bongo Room and would love to check out other locations.", "pics": null}}, {"review": {"des": "If you're looking for a treat yourself brunch in wicker, this is definitely a great option for you to consider. I came on a Tuesday morning around 11:00 and was seated nearly immediately (I hear on the weekend there can be an absurdly long wait). The hostess was quite friendly and the busboy brought us water before we could even sit down. <br><br>We were asked for our drink orders promptly and served those quickly as well. We both orders vanilla iced coffee which I thought had great flavor and was a good size for the price. They even offered to take it back and put more vanilla in it if we didn't think it was flavorful enough which I felt was very thoughtful. <br><br>After contemplating our menu options for a bit, we decided to split the infamous white chocolate and caramel covered pretzel pancakes and a made our own omelette with roasted red pepper, avocado, and sharp aged white cheddar cheese. They were both absolutely amazing. They also came in sizable portions and we had some leftovers even after splitting the meals. The pancakes were a fabulous combination of the salty pretzel and the sweet white chocolate sauce with caramel. It was certainly rich, and I don't think I could've eaten an entire order alone, but it was perfect to share! The omelette was also well made and the flavors meshed well together with ample fillings. There was also a side of well cooked breakfast potatoes and sourdough toast. <br><br>I'm so glad I had the chance to dine here on a weekday, I truly enjoyed my experience and would highly recommend! The service was great and attentive, and the food was delicious. I don't know if I would wait excessively long to get in, but if you have the opportunity to go during the week absolutely take advantage of it!", "pics": null}}, {"review": {"des": "Excellent breakfast. We had the apple churros French toast and an omelette with spinach, avocado, and broccoli.  It's were delicious. The vanilla bean cream on the French toast was perfect. The ambiance was very nice, not too loud, and very relaxing. You will most likely sit next to people you don't know, but nothing wrong with that. Se bees were friendly and always kept your drinks full and table cleared of any trash.  Definitely recommend.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OKp-UP6rtHXUtID36V0HDA/168s.jpg", "caption": "Apple churros French toast"}]}}, {"review": {"des": "The food was surprisingly good. I had the cornmeal blueberry pancake with a side of bacon. Nice breakfast/brunch spot. Kinda pricey but definitely quality service.", "pics": null}}, {"review": {"des": "If you blink, you'll miss this place as it's a small place right on a corner with minimal exterior marketing. The pancakes are definitely the reason to come here. They are fluffy, cooked perfectly, and packed with flavor. Unfortunately, the chairs are incredibly uncomfortable and the whole place is just a little too cramped. In addition, the rest of the menu is good, but certainly not on the same level as the pancakes.", "pics": null}}, {"review": {"des": "Unbelievable breakfast! Especially if you have a sweet tooth this morning. We did one of their sweet pancakes for an appetizer and then had the lobster roll Benedict....fantastic! <br><br>Come early or plan on waiting on line. If you're not a morning person or just simply prefer the \"unch\" timing of brunch, come down and out your name in, then walk a few doors down for coffee and enjoy the 80's decor. <br><br>Whatever you decide, you'll have a great time", "pics": null}}, {"review": {"des": "Came here on a Thursday around 12 with a friend and got seated with water immediately. The restaurant is on the smaller side without being overcrowded. The decor, walls, and chairs are very cute. <br><br>Our server was nice and helped us with menu options. Having read reviews we knew we wanted to split the Vegetarian Croissant Sandwich and pancakes but weren't sure which pancakes to go with. I have a sweet tooth but don't like things to be overly sweet. After the server assured us that the White Chocolate Caramel Pretzel Pancakes were a good amount of sweetness we decided to order that but asked her to bring it out after food so they wouldn't get cold. <br><br>Food:<br>-Vegetarian Croissant Sandwich (we got ours with scrambled eggs) was very good. The Croissant was buttery, flaky, and basically perfect. The vegetables inside were very fresh and I loved the dill mayo they used! I asked for extra :) The house potatoes were well seasoned. <br><br>-White Chocolate Caramel Pretzel Pancakes - Holy hell. I have no words. These were AMAZING. They had the perfect amount of sweetness with a little bit of salty and a great crunch. The pancakes were well made (and I'm very picky when it comes to pancakes!) and were beautifully dense. If you get one thing here, GET THESE. I was hesitant at first because the pictures make it seem like it's doused in sugar but trust me when I tell you it is the perfect amount. They're constantly changing their menu around but this is one item that has been there forever and with good reason. <br><br>The portion sizes are big! My friend and I split both items and couldn't finish the pancakes because we were stuffed. <br><br>Service: Our server was very nice and helpful. She brought out the pancakes at the PERFECT time just as we  had finished our sandwich and potatoes. Our waters were refilled constantly and at good intervals. <br><br>Overall, The Bongo Room is an amazing breakfast/brunch place. If you're in Chicago, this place is a must!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aDhRvGGaDPK-PjxtgQ5Qzw/348s.jpg", "caption": "White chocolate caramel Pretzel pancakes"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yQ1Jc8xURtQTNd-IL8NHWQ/168s.jpg", "caption": "White chocolate caramel Pretzel pancakes - these were amazing!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jNovMNj9h2PUqYF09sVilg/168s.jpg", "caption": "Vegetarian Croissant Sandwich"}]}}, {"review": {"des": "Love the ambiance, decor, and service. Long waiting time due to the popularity as expected. We walked around the area and waited at WH for about an hour or so until our seats were ready. We sat at the bar which was fine w us. Our waitress/barista was super friendly and patient. <br>Got the famous white choc caramel pancakes but were undercooked and raw from the bottom which caused GI upset and a run to the bathroom sorry TMI. My friend got the spinach Benedict which looked and tasted amazing. Apart from my order- the food is fresh and superb quality.", "pics": null}}, {"review": {"des": "This place is great for breakfast, brunch and dessert.  Great food for foodies, ambiance is on point with young and old enjoying the perfect experience.", "pics": null}}, {"review": {"des": "I love the pancakes here! This time I had the white chocolate lemon pancakes and was not disappointed. I've been to both locations and enjoyed the food at both. One thing I did notice is at the downtown location they ask how many pancakes you'd like but this location didn't, not a big deal though. Customer service at this location was wonderful and the food is amazing, the portions are pretty big so I'd suggest sharing the pancakes.", "pics": null}}, {"review": {"des": "So I could definitely see myself eating here a few times a week. I won't because I don't want to tire of the food! We ordered these amazing white chocolate and Carmel pretzel pancakes, can I say thank you for this amazing gift! We also had the shrimp scampi, lobster, and steak Benedict's!! I was in all types of heaven. Now the bad part is I waited for 30 min in the hot sun (I walked-in no reservation) but it was still worth it, what's a little vitamin D any way! Service was good food was better. This place is a must try!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bk_B3gBNTzujD7spMOaFag/348s.jpg", "caption": "Lobster roll Benedict"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/g4lSeO4Q0-wxiN70Cb18OA/168s.jpg", "caption": "White Chocolate and caramel pretzel pancakes. AKA heaven.  So surprising because I greatly dislike chocolate, but this is LIFE."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UGO2bJi8oL2eQlYaMuUuTg/168s.jpg", "caption": "Steak Benedict"}]}}, {"review": {"des": "This place is a well oiled machine. Went for brunch with 2 friends. We had a 25 minute wait, which we expected. The brunch menu is limited so they can crank out a few key dishes, but the choices hit a variety of flavor profiles so I didn't feel limited in my selection. The \"benedicts\" are their signature. Huge portions. Lobster benedict FTW. <br><br>Also, one of the BEST blood marys I've ever had!", "pics": null}}, {"review": {"des": "After visiting several of the more popular breakfast places in Chicago, this was the best breakfast I had. Every place I got an omelette as the basis for comparison and theirs was the best. Would recommend for sure. Good service as well.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kp0SM2njCjRAatVMUokMLw/348s.jpg", "caption": "Omelette from make your own menu"}]}}, {"review": {"des": "Bad service- No one seems to cared about anything<br><br>Mediocre food- everything was lukewarm. They brought my toast when I was almost done eating. Their best known dish is their chorizo omelet and it was terrible. The egg was tough, the chorizo wasn't cooked enough to develop, and who puts avocado inside an omelet? I don't know. It would be nice to have it sliced and sitting on top. My pancakes were tough and crappy, overall. One of them was raw in the center.<br><br>Ambient- It was very cold in there, somewhat empty, too. <br><br>my total was $57.00, way too over priced for tough eggs.", "pics": null}}, {"review": {"des": "I always enjoy brunch here.  The shrimp scampi Benedict has great crispy texture and tons of garlic.  Yum!  Me only complaint would be noise level and you really get bumped around a lot on the wooden bench seats at the booths.  They move and you feel every bump from the table next to you.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RfH2gEwEtjCWs9DMSv_ywA/348s.jpg", "caption": "Shrimp scampi Benedict"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/L3vYdIv1Jit0f11WDJ5syQ/168s.jpg", "caption": "Eggs Florentine"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VK1Lw59BhsNv1TcHCABmDQ/168s.jpg", "caption": "Cranberry pancakes"}]}}, {"review": {"des": "My friends and I got lucky and fortunately did not have to wait very long on Saturday morning. The place was packed, so our wait time of 15 minutes surprised me greatly.<br><br>If eggs are your thing, then this is definitely the place for you. I ordered a custom omlette. The ingredients were incredibly savory, and the eggs were super fluffy and tasty.<br><br>My friend ordered a guava-based mimosa that tasted good, but as a diabetic I didn't go beyond a sip. The iced coffee offered here is P-O-T-E-N-T, so be careful when consuming (I'm sure this stuff could be used to ressurect the dead if brewed in a large enough quantity)<br><br>If you're looking for a meal to fill you up before a day of exploring in Chicago, then definitely hit this place up. You will not be disappointed.", "pics": null}}, {"review": {"des": "My favorite meal is brunch and this place is nearby, so it was a must-try on the list. Extremely happy with everything ordered! Delicious food and worth the hour or so wait.<br><br>I had the shrimp scampi eggs benedict and our group split the salted caramel pancakes and chocolate banana french toast. Amazing. You honestly cannot go wrong with much here!<br><br>I'm *only* docking one star for the service as I felt like we were an inconvenience to our waitress. I wanted a mimosa but lighter on the juice, which resulted in her saying it'll \"be less full then.\" Also, we wanted to split evenly among five cards, and we were told this was a \"one time courtesy since the max is four.\"<br><br>Regardless, I will be back and am looking forward to trying out more of the menu items. Happy brunching!", "pics": null}}, {"review": {"des": "I was utterly appalled and repulsed when my friend told me of her horrible dining experience here.  I encouraged her to write a review but she regretfully declined as she had never written a review on Yelp and felt her complaints would fall on deaf ears.  <br><br>So here I am.  Writing this review on her behalf because NO one should ever have to go through what she went through.<br><br>Despite the 40 minute wait, my friend (I'll call her Jane) still found herself in good spirits and very much enjoying the company of her brunch date (I'll call him John).  The conversation was free flowing until it was awkwardly interrupted by the extremely rude waitress (trust me EXTREMELY RUDE is an understatement). <br><br>Quickly after being seated, the waitress approached the table attempting to take an order.  Since it was literally only 2 minutes after being seated, John and Jane asked for more time.  The waitress returned after a few minutes.  John and Jane still were not ready and once again requested a little more time.  At this point, the waitress was visibly frustrated.  She refused to leave so she stood at the table hovering and starring until an order was placed.<br><br>What was ordered was the banana pancake, tomatillo salsa scramble, breakfast burrito and two bloody marys.  The food came out before they could even blink (a little suspect if you ask me).  Halfway through the meal, John requested another bloody mary.  The waitress asked Jane if she wanted another, even though her glass was still more than half full.  Jane politely refused as she could not anticipate whether or not should would want another beverage.  <br><br>Fast forward 10 minutes, Jane finished her drink, the date was still going well, and there was still plenty of food sitting in front of her, so naturally Jane wanted to order another drink.  The response Jane got from her waitress left her bewildered.  Rather than an easy, \"sure,\" Jane got, \"let me check.\"  The waitress returned a few minutes later and refused to serve Jane a drink.  Her explanation made no sense.  She explained (of course she was unpleasant about it), that she could not serve Jane because they needed to vacate the table for another party.  Jane waited 40 minutes for a table.  The total duration of her meal was 40 minutes up to this point.  Vacate the table?  John still had more than half of his drink left and there was still food remaining.  The waitress refused service to John and Jane and reiterated that they needed the table for another party.  At this point there was no reason to stay any longer.  John and Jane were not welcomed at the Bongo Room.  They were essentially kicked out after 40 minutes.<br><br>I have had the Bongo Room on my list of places to go.  Needless to say, I will not be wasting my time.", "pics": null}}, {"review": {"des": "Cousin had the red velvet pancakes. She enjoyed, and they were thick and delicious, but I would  get bored after three bites. Might be more fun in a short stack with a side to break it up. <br>I had the shrimp benny. Delicious, well portioned. <br>The hibiscus tea with pineapple and coconut was phenomenal, a new fav. <br>Wait was reasonable, 15 mins for 2 on a Sat am about 10.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_F8lQ9gKzieJ21nJv3B8_A/348s.jpg", "caption": "Shrimp benny"}]}}, {"review": {"des": "This is an amazing place for breakfast. You get absolutely huge portions for the price. I had ordered the Reuben white egg omelette which came with a nice side salad and ordered an English muffin as a side. The omelette was delicious. I loved the English muffin which was toasted to perfection. They also had great coffee.", "pics": null}}, {"review": {"des": "We had breakfast at The Bongo Room and it was good.<br><br>There are three locations in Chicago: this one, which is the original, in Wicker Park, Andersonville, and South Loop. These restaurants only serve breakfast, lunch, and brunch and do not accept reservations. Brunch is served on Saturday and Sunday.<br><br>We chose this restaurant because we were looking for a good breakfast spot near our Airbnb in Wicker Park and this was the top search result on Yelp.<br><br>This is a casual American restaurant (with a bar serving alcohol) and it's been in Chicago since 1993. It's a popular place. On a Monday mid-morning, it was busy. Luckily, our group of four didn't have to wait. However, several parties after us had to (early lunch crowd).<br><br>The breakfast menu was pretty simple with eggs (any style), croissant sandwiches, breakfast burritos, omelettes, pancakes, and standard stuff like bacon, ham, and sausage. They have a variety of coffee drinks as well as teas and juices. They also have seasonal specials.<br><br>Here's what we went with:<br><br>Seasonal specials:<br>* Lemon Brioche French Toast ($13.25) - warm Meyer lemon cream, blackberry coulis, fresh blackberries, shortbread-poppy seed streusel<br>* Red Velvet Pancakes ($11.25) - red velvet chocolatey cocoa hotcakes topped with warm vanilla creme and toasted walnuts<br><br>Savory (regular menu):<br>* Chorizo, Potato & Avocado Omelette ($13.75) - chorizo, potato, avocado & queso fresco cheese omelette, salsa, tomatoes, toast<br>* Spinach, mushroom, and smoked ham omelet (custom omelette)<br><br>My favorite was the lemon brioche French toast. The lemon cream and blackberry coulis were tangy and delicious. The toast was just covered in the stuff.<br><br>The red velvet pancakes were filling. Three thick pancakes come to each pancake order. You can mix and match pancakes, but it'll cost extra. I decided to get all three red velvet pancakes, but it turned out to be too much for me to eat. The pancakes were thick and the stack was topped with a good amount of creme. However, the pancakes were so dense that I had to ask for more creme, which they brought in a bowl. Yum!<br><br>The portion size on the pancakes is so big that I suggest sharing an order. Otherwise, you'll probably have leftovers.<br><br>The omelettes were yummy. The ingredients were fresh and flavorful. What I like best about the omelettes is they are relatively healthy. If you customize an omelette, they start at $12.95 each and include 3 ingredients of your choice from a list of 30+. Additional ingredients are $1 each (meats are $1.50) and egg white omelettes cost $13.75.<br><br>Service was great. The staff seems friendly and cool.<br><br>TL;DR - I give The Bongo Room 3.5 stars rounded up to 4. If you're looking for quality, comforting American breakfast food, look no further.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IUP5gQ6CfBnwDcfpCuieGA/348s.jpg", "caption": "Red Velvet Pancakes. Red velvet chocolatey cocoa hotcakes topped with warm vanilla creme and toasted walnuts. $11.25."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3YJgbqSgLdioRwGWFQNjcA/168s.jpg", "caption": "Chorizo, Potato & Avocado Omelette. Chorizo, potato, avocado & queso fresco cheese omelette, salsa, tomatoes, toast. $13.75."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4hhdePe9NpKCbk2z6EV83g/168s.jpg", "caption": "Spinach, mushroom, and smoked ham omelet."}]}}, {"review": {"des": "Uber driver recommended! It's good. Had the French Toast which is, by far, the best I've had in Chicago. Heavy cream, pralines, peaches and raisins (I think). Very well done. So sweet, strong coffee and a breakfast meat needed. Had a side of the maple chicken sausage. 3 pieces showed up. 3? If sausage is split in half and the order is almost $5, where's my other piece? So I asked. The sausage is homemade and they come 1/2'd. Ummm, ok. They are good and perfect to cut the sweet. The Man had eggs & ham, and potatoes--delish potatoes!<br>No wifi.<br>Great staff.<br>A keeper if I'm in a pinch and in the area.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5EUa9HaacrWTIPzANdqHcQ/168s.jpg", "caption": "Great atmosphere"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cRtfUTmHzgupJbsqOQyetQ/168s.jpg", "caption": "A little more pricey. Not a dive!"}]}}, {"review": {"des": "I came here last week as I was in town for work and my friend suggested this spot. It was a clean not very crowded place thankfully at 10am. I had the lemon and berries pankcakes they were sooo delicious but I didn't even finish them. The waitress Evelyn was super friendly and bubbly she's the type of server that would make you go back to a spot just because the customer service was on point!<br>When I'm back in my hometown I'll be visiting", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5lepVcalOx2Gy01tj41ABw/348s.jpg", "caption": "Berries and lemon (I believe) pankcakes"}]}}, {"review": {"des": "The Bongo Room is simply delicious and was surprised by how quick and friendly the service was. The portions are bigger than expected and I'm definitely not complaining about that. The food is delicious, I am not a big sweets person but I saw the pancakes everyone was getting and just had to. Who doesn't love cake for breakfast because The Bongo Room has its own meaning of breakfast pancakes . I came here two weeks ago and have been raving about it to all of my friends and coworkers.", "pics": null}}, {"review": {"des": "There is always a wait, and I have no idea why. There are a handful of better breakfast/brunch spots in the area. Food was ok, and the Bloody Mary was overpriced for what it was. <br><br>Recommend trying Kanela down the street instead.", "pics": null}}, {"review": {"des": "It is so unfortunate that I have to leave a 3-star review instead of a 5-star review, because the food is certainly deserving. <br><br>I had the tenderloin eggs Benedict, and it was possibly the best brunch dish I've ever had. The Hollandaise sauce was incredible. <br><br>Had to remove two stars because when we checked in with the hostess when our table was ready, they would not seat us until the last person (who was parking) arrived. The five of us awkward stood in the way of everyone while our table sat empty. They then asked us to move to the back to get out of the way, at which point we were standing NEXT TO our empty table (photo attached) while still in the way of the waitstaff. An absolutely ridiculous policy. <br><br>Pros: unbelievable brunch<br>Cons: OK service, one incorrect dish, and absurd policies.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4-XVmnsDjRes2AjIgGNfaw/348s.jpg", "caption": "Our empty table that we were not allowed to sit at."}]}}, {"review": {"des": "Before I complain to be fair, my husband and I went here on Memorial Day so I expected a wait and for there to be a lot of people what I didn't expect was for it to be SO LOUD, we had to shout to speak to each other and the waitress. The noise level was a bit much but we got used to it. <br>Now onto the food. I ordered an omelette with mushrooms, goat cheese, and onions, house potatoes, and toast. To my understanding an omelette is when ingredients are cooked into the egg mixture not just dumped inside and covered over a giant egg pancake. It was ok not great. The house potatoes tasted really doughy I was hoping for crisp potatoes but that's not what I got. And the flavor was not great either, I would have skipped them otherwise. To complete I got a tiny glass of overpriced OJ.<br>The only highlight was the service everyone was kind and attentive if I was reviewing only them I would have given it more stars. The stars are mainly because of the bad quality of food. <br>We wanted to enjoy a nice local place but we're going to have to skip it for any future outings. Maybe their other breakfast food is good but beware the omelettes !", "pics": null}}, {"review": {"des": "My new Favorite breakfast spot! OMG the red velvet pancakes are heavenly!!!! The portions are big so 2 people can share a 2 stack + entree and have more than enough food. This was worth the 1hr wait. It's great they can text when your table is ready. Our server was extremely attentive and great with answering questions. I can't wait to get back", "pics": null}}, {"review": {"des": "Terribe service. Asked for Manager no one came. Food wasn't cooked completely and waiter was rude.", "pics": null}}, {"review": {"des": "Amazing breakfast place ever. Probably the best I've ever gone to. I ordered a Churro french toast with fruits on top. It's a bit pricy, but it so worth it. I loved it so much and I wish I finished it. The taste is authentic, fresh, and reminds me of the food my mom cooks. I definitely recommend going to this place. The service is amazing and the interior is minimalistic, but a great aesthetic.", "pics": null}}, {"review": {"des": "The chicken and pear sandwich was ok, I'm not sure if it was the cranberry-pecan aioli or the Gorgonzola but something was overpowering. We ordered salted caramel pretzel pancakes for the table which were amazing!!!! I definitely want to go back to try the red velvet ones. Also the portions were big and we all had leftovers, definitely could have ordered 1 plate for every 2 people!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bpWFgWBIvfcEdJsZe6rFug/168s.jpg", "caption": "Salted caramel pretzel pancake"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DqUnvj-3t32xAEiT5CTX9Q/168s.jpg", "caption": "Chicken And Pear Club Sandwich"}]}}, {"review": {"des": "I used to visit The Bongo Room as a tourist when I was in town. Now that I live here, I still keep this place in rotation. Time after time, I still always try to convince someone in my party to get the Dark Chocolate French Toast with the banana brulee sauce. It's dark chocolate flavor doesn't leave you in a sugar coma, but it's more of a rich indulgent guilty pleasure feeling :) Although it's literally dark chocolate bread that is used, the fact that it's baked in make it less sweet and you really get to control the sweetness by the sauce served with it. Get this dish for sure! You will not be disappointed!<br><br>I've had a handful of the other items, but key calls outs are the dill house potatoes (served with almost everything), the vegetarian croissant sandwich (so fresh and tasty), deconstructed lobster benedict (heavier than you would think, but rich and filling), and of course, the dark chocolate french toast with the banana brulee sauce!<br><br>Always expect a wait! Get here, put your name in, then walk around a bit and soak up the neighborhood!", "pics": null}}, {"review": {"des": "I don't really see what the hype is for Bongo Room. I've had much better brunch elsewhere in Chicago. I came at 8:30 am on Saturday morning to avoid the wait. They have a stupid policy of not seating everyone until the entire party is there. My sister and mom were trying to find parking. The food is mediocre at best. The highlight was the sausage. The food came out cold. I would never ever EVER wait more than 10 minutes for this establishment.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IDAb99_roF7tfS_1m5wdSA/348s.jpg", "caption": "Vanilla French Toast"}]}}, {"review": {"des": "Had an awesome lobster eggs benedict here during Sunday brunch that my waiter recommended to me. Definitely would go back again!", "pics": null}}, {"review": {"des": "I've had brunch here a few times and both have been pretty good experiences.<br>My two recommendations are the Lobster Benedict (spring special) and the Breakfast Burrito w/ chorizo added. Both were super fresh and tasty. <br><br>Skip the Bloody Mary. Too salty and not enough booze.", "pics": null}}, {"review": {"des": "I think it's overrated. The overall good review from yelp is what led me there, but when we went I didn't think it was anything special. I ordered plain pancakes, two scrambled eggs and sausage. My pancakes were decent, I still ate them, but my scrambled eggs were nothing extraordinary and my sausage was served room temp to cold. I will not be returning there.", "pics": null}}, {"review": {"des": "COST:<br>$12.50 (Omelette - Bacon, Mushroom, Avocado)<br>$10.50 (Banana Hazelnut Pancakes)<br>$3.50 (Coffee)<br><br>Went here on a request by a visiting friend since she saw it from The Lonely Planet or one of those travel guides. Usually people scofff at travel guide suggested spots, but seeing how well received it is on Yelp, I figured it wouldn't hurt to try.<br><br>I'm so glad we did because it was one of the best brunches I've had in the city so far! Both the omelette and pancakes were ginormous! We ordered a few things off the menu and wished we had known how huge the servings would be! It's not the worst \"problem\" to have.<br><br>Nothing compares to California Avocadoes, and The Bongo Room's were so fresh, tasty and made me feel at home! The coffee was pretty awesome and service was great.<br><br>The pancakes though? Sweet heavens it was paradise! The hazelnut sauce was very savory, but not completely overpowering. I need to get myself checked on WHY I have not gone back yet.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OFM4W0no7rbi7kT_-i4Mxg/168s.jpg", "caption": "Bacon, avocado, mushroom omelette"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/G4mXlQ16tjZIdt4DvCjsXA/168s.jpg", "caption": "Banana hazelnut pancakes"}]}}, {"review": {"des": "Revisiting a place that was our go-to for weekend breakfast when we could walk over. The cup says Serving Chicago for 20 years and I remember eating at the first location almost under the Blue Line on Damen before they moved to the Milwaukee space. I ordered breakfast and my husband lunch. Our service was good- friendly and attentive without being a pain. Good strong coffee came followed by my breakfast burrito with a side of house potatoes. I really like that they serve normal sized portions and my burrito wasn't the size of a football. Tasty guacamole with scrambled eggs inside a spinach tortilla. There isn't black or refried beans inside which is the usual but there's plenty of flavor with the salsa and sour cream- I order sans cheese. My hubby ordered egg salad- which I must say was really good. Loved the bread it came on. The potatoes are a well worthy side with a little spice. We left happily stuffed!", "pics": null}}, {"review": {"des": "The Bongo Room was fantastic!  I arrived with a crew of three at 10:30 am aka primetime brunch time.  But the wait was miniscule, only about 15 minutes.  I ordered the upside down pineapple flapjacks and LET ME TELL YOU they were amazingly mouth watering.  Scrumptious.  Definitely will be returning!", "pics": null}}, {"review": {"des": "I had brunch here, and it was truly delicious. I've had their pancakes on previous visits to the other locations and wasn't too impressed - this time, I had the vegetarian croissant sandwich (no tomatoes, plus bacon, egg over easy) which was AMAZING. <br><br>Honestly, just really really fresh. Delicious. Huge portion. Did not regret, would go back again. <br><br>Loses a star for a pretty subpar Earl Grey and because the potatoes that came with it were also just not great. The sandwich itself was more than worth the trip, though, and one of the best breakfast items I've had this year.", "pics": null}}, {"review": {"des": "The food and service here was great. I had the lobster Benedict. The flavors were great and the portion was generous. My only complaint is that was my food was kind of cold. They have great a cocktail selection as well. I had the grapefruit and blueberry mimosa and it was amazing.<br><br>I also tried the banana pancakes and they were fluffy and just the right amount of sweetness with the maple cream. If you are looking for a nice brunch spot in a great area, go to the Bongo Room", "pics": null}}, {"review": {"des": "Oh my, the BLT Benedict.  Do yourself a favor and get it now.  Also, our table split the chocolate French toast tower as a dessert and it was perfection.  I wouldn't be able to eat a whole plate of their sweet dishes, but sharing with the table was a great idea.", "pics": null}}, {"review": {"des": "Pretty good brunch place. There was a 30 minute wait when we got there, but it only ended up actually being ten minutes. Make sure to stay close while waiting, because they just call out your name and don't take a phone number or anything.<br><br>My friend and I split a sweet and savory item. The tomatillo scramble was delicious and was definitely a winner. It was really light too and had chicken, avocado, spinach and egg whites. We also split blueberry pancakes with vanilla bean cream and a streusel topping. These were SO sweet, but decent. They were a little dry, despite the vanilla cream - it would be better if they layered the vanilla instead of just putting it on top.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uFagyIdkK4xxcKFFRnfoZw/168s.jpg", "caption": "Tomatillo scramble - so good."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/i5zKgihpy8iZkWgKqOEIvQ/168s.jpg", "caption": "Blueberry pancakes with vanilla bean cream and streusel topping"}]}}, {"review": {"des": "love it<br>i had breakfast whit my friend alex<br>never been here before<br>i like it<br>coffee was hot  not strong<br>i order coconut pineaple upside down pancakes was delicious<br>our server was great on ponint<br>i be back soon whit the family for sure", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/x_8rUbHoDwZRjU_weiEJ1g/348s.jpg", "caption": "the menu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FGeuecmrNh4xNk10EGK3Dg/168s.jpg", "caption": "slow motion service & server"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Lk6PA_xKOnpcdK9Z_iqu6A/168s.jpg", "caption": "the oj"}]}}, {"review": {"des": "Great heard things about this place and it didn't disappoint. Went with a group of girlfriends for brunch. Didn't have to wait too long because of the poor weather, but if you're coming for weekend brunch, be prepared to wait.<br><br>Got the lobster benedict and it was delicious. It was almost a little too rich for me, but it is definitely tasty. Our party also got the dark chocolate french toast and it was pretty much diabetes on a plate (in a good way).<br><br>I'm  a huge fan of sweets, but even so, I don't think I would have been able to eat just the french toast by itself as my entree. It was more like dessert than a brunch item.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/outFPlnXSjlOPheLQFC2ZQ/168s.jpg", "caption": "Lobster benedict"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pwM_-ZrLRP8mvRzWU4yfjw/168s.jpg", "caption": "French toast"}]}}, {"review": {"des": "My wife would give it 5 stars, but this isn't her review! The breakfast is very good, though I have other favorites I prefer. What pushed it up to 4 stars is the outdoor dining area, which is gorgeous-flowers, ample shade, wood instead of brick-love it. Good service too.", "pics": null}}, {"review": {"des": "Definitely get a white chocolate pretzel pancake to split, you guys. It is amazing. But I'd get something savory for your main dish -- I liked the breakfast burrito, but wouldn't get it with chorizo again. Chorizo was meh. Good place overall, will definitely be back for that flapjack.", "pics": null}}, {"review": {"des": "Even though I've only been here a handful of times, Bongo Room never disappoints. The service is prompt and your food comes out super fast, and it's soooo delicious!!! I like that they divide the menu into both sweet and savory. The white chocolate caramel pretzel pancakes looked amazing, but I knew I couldn't eat an entire stack, so the waitress said we could order just one for the table to split and try, which was perfect! They were definitely worth a try. All of their savory dishes are great. I would actually recommend the dreamsicle mimosa over the standard: it actually tastes like one, but with booze! What more could you want?!<br>When people ask for recommendations/what my favorite spot for brunch is, Bongo Room always makes the top 3 easily. Go! Now! Why are you still reading this? Get over there!", "pics": null}}, {"review": {"des": "This place is smack dabbed in the middle of a shopping block. Its convenient to grab something to eat from there and shop around. This place is not so big so there may be a wait. Fortunately, we went around late brunch and did not have to wait. <br><br>I ordered a fried mozzarella, smoked sausage, and pesto spread on a pretzel bun. It came with potatoes. It was good. A friend ordered a white chocolate and caramel drizzled pancake.... OMG words cannot describe how good it was. It was also not so surprisingly sweet.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DwHyijBzWaXKnWGvSmfFfg/168s.jpg", "caption": "White chocolate and caramel drizzled pancake."}]}}, {"review": {"des": "This place is super delish! We live just around the corner and have pretty much had everything on the menu and have never been disappointed. My only complaint is the lack of personal space. You are literally elbow to elbow in this dinning room, which on a weekday morning isn't so bad, but on weekends when families bring their minions and they are jumping in their seats and don't know how to not rock their chairs making our breakfast more of a nuisance then I'd like. Coffee is excellent and staff is super friendly and knowledgeable of the menu. Avoid the weekend wait time and give it a try on a weekday!", "pics": null}}, {"review": {"des": "This place is by far one of the greatest breakfast spots in town. The burrito was the best I've ever had. Simple ingredients done in an immaculate way!", "pics": null}}, {"review": {"des": "The breakfast burrito was quite filling and tasty. I recommend doing what my husband and I did: split a savory item, since they are pretty generous portions, and then order one, two or three different pancakes. There are so many fun flavors of pancakes, and they sometimes have special or different ones, and they will allow you to order just one instead of a stack. The only bummer is that you have to order up front and it all comes at the same time, so you're trying to slam the first part of your brekkie to get to the sweet part, hoping it's not just a cold, sad, sweets experience. This particular location was a great second breakfast spot to go to from the Robey. Just know that the queue starts a little while before 9am and there is no \"kids only\" section, sadly, so if you have a hangover, this may not be the spot for you. The breeders take over half the restaurant with their loud and moody spawn. No matter how many bloody mary's you may imbibe, it does not take the edge off the screeching kiddies.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TaKEnQNqxtVzLJwX6IfMgw/168s.jpg", "caption": "Ghost marking"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/usRYz3RNo6zZQyfKKl4EyQ/168s.jpg", "caption": "Croissant sandwich"}]}}, {"review": {"des": "33 3e0er3ew and all 0e Dr erred f2f free 9ddde e3 erred we 4e 33 e3 eered l''fccfdd rxxccccxdxdx xdxccx xxx, 88 zzzz8z8zl88888lllllll8zzzz8z8zl88888lllllll8l7 ll8 ou oojp zzz w2ww2w2 e xxx ed re", "pics": null}}, {"review": {"des": "Amazing brunch and great service! Had lobster eggs Benedict and the chocolate tower French toast. The place gets really busy on the weekend, but we still got our food very fast and our server spent time with us explaining the menu.", "pics": null}}, {"review": {"des": "I've been to Roosevelt location and enjoyed it. So I went to Wicker location as I live there, and I couldn't have been more disappointed. Food was great, but maybe cause it's Wicker Park, the attitude was more than I wanted. John, who is apparently a manager, has let the high Yelp reviews and success make him forget, that everyone in there is a potential repeat customer. Guess he didn't care to adjust his smug-ness. Go to Roosevelt spot for good food with less pretentious pr&#k.", "pics": null}}, {"review": {"des": "we stopped in here for breakfast on a busy saturday morning and were seated right away.  we were a party of two.  service was quick and food was awesome!  we ordered classic eggs benedict - the sauce was different than we'd had before, like maybe cheesey and creamier and so much better! we also ordered plain pancakes with fresh vanilla whip and they were super tasty but also a bit denser than a fluffy buttermilk pancake.  delicious nonetheless on all counts, coffee superb.  i'd for sure stop back in here if i'm i'm the hood. yum!", "pics": null}}, {"review": {"des": "The Bongo Room was a good brunch experience for our group of first time visitors to Chicago.The savory breakfast items needed more seasoning, but the omlettes, farmer's breakfast, and eggs benedict were all good! The sweet breakfast items such as the white chocolate or berry pancakes were flavorful albeit very very sweet. My SO, a pancake aficionado, was a big fan of the sweet pancakes and was a fan of their fluffy texture. <br><br>The Bongo Room offered hearty portions and attentive friendly service. Do yourself a favor if you're visiting from out of town and put your name down for brunch before 11am! The downtown location gets crowded really quickly.", "pics": null}}]}