{"name": "the-bongo-room-chicago-3", "reviews": [{"review": {"des": "Huge portions, yummy food, and the option to do half orders all made the bongo room a great experience for us.<br>We went for the white chocolate caramel pretzel pancakes which were delish, and their french toast which was good but not anything to write home about. <br>We paired that with a side of their house potatoes which were excellent - supremely seasoned and added a nice complement to our sweet entrees.<br>Enjoyed our food and it was in a super convenient location for us as we were visiting the city - walking distance to Millenium Park and the downtown sights.", "pics": null}}, {"review": {"des": "I went to Bongo Room on a rainy Sunday for brunch. We waited about 20 mins before being seated. The menu had normal breakfast choices and options for brunch as well. I order the chorizo avocado omelette while my boyfriend got the white chocolate caramel pretzel pancakes. <br>The portions are generous and were delicious. The pancakes I thought would be too sweet for me but they had the perfect combination of being sweet enough. <br>The location was 3 blocks from me and is located near Millennium Park. I believe Bongo Room is a perfect choice for anyone that wants sweet or savory food choices.", "pics": null}}, {"review": {"des": "Visited Bongo Room on a rainy Sunday for brunch and arrived with a 30 minute wait. As far as wait time, it was accurate.<br><br>Food wise, it's that classic decadent American style brunch with a twist featuring chorizo omelettes and chocolate french toast tower. The portion is generous and I also loved that their menu featured a wide array of coffee and tea that were delicious and a step above diner's<br> selections.<br><br>It's located near a park, short distance away from Museum Campus and several grocery stores, making Bongo Room a great restaurant to fit into a day of errands.<br><br>Overall, Bongo Room is an above average Brunch restaurant with a menu spectrum that covers those who craves decadently sweet treats as well as delicious savory dishes.", "pics": null}}, {"review": {"des": "Decent Breakfast spot if you are just trying to get a lot of food at a decent price.<br><br>Food Order: Veggie Breakfast Burrito (w/ avocado), and the Breakfast Croissant (veggie style w/ avocado)<br><br>Environment: typical diner spot with two-person tables you can push together to make larger tables.  No wait - was able to get two seats right away.<br><br>Verdict: The food was just okay, nothing special, but nothing was outright wrong either.  I feel the food was just filling, but wasn't inspiring or making me want to revisit/recommend to others.<br><br>How They Get More Stars?: The food can be a little more flavorful and have fresh veggies to bring out a more fresh feel of the dish rather than something that came from the heat lamp of a kitchen.  <br><br>Tips: This one doesn't serve alcohol for those that want a mimosa or Bloody Mary brunch spot.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/E4UyWnQ2zeuqqvKw8sZrFQ/168s.jpg", "caption": "Veggie Breakfast Croissant Sandwich"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kQRIC44KW3ZHS0H5N6CQuw/168s.jpg", "caption": "Veggie Breakfast Burrito"}]}}, {"review": {"des": "Great place for breakfast/brunch in Chicago. They have multiple locations but this one is in the loop.and close enough if you want to check out a Bears game afterwards. (Best to take the train on game days! Parking nearby is spiked HIGH - like $40- on game day). No reservations but they run like a diner - quick service! I thought the lobster benedict was creative twist on an old classic. Portion was good. It is a good spot for a quick meal.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6-GenPLERwQOWccyZCF_0A/348s.jpg", "caption": "Lobster benedict (brunch menu) decent. Thought would have had lumps of lobster but nah."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0wbc01Gme5FS15ixQixEvw/168s.jpg", "caption": "Egg white omlette"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mF0FL73AQoR9BcfezbmZiA/168s.jpg", "caption": "Eggs, avocado (a ton!), and toast"}]}}, {"review": {"des": "The Bongo Room is a good brunch place, and I was pleasantly surprised by the fact that my roommate and I did not have to wait at all despite it being a busy weekend morning. I think a good brunch place not only has good food, but has exciting options that invite you to come back and try the next time you're there. Both my roommate and I loved what we got and shared, and she even brought up potentially bringing her parents here when they're in down. <br><br>We got the chocolate tower french toast (bittersweet chocolate chunk bread stuffed with maple mascarpone, banana creme brulee sauce, fres bananas and shaved white and dark chocolate) and a BLT benedict (two toasted english muffins topped with two poached eggs, applewood smoked bacon, baby spinach, tomato and basil pesto hollandaise sauce, served with house potatoes). The chocolate french toast was the perfect blend of being sweet but not overwhelmingly so, which is an important note to hit for sweet brunch items. Decadent, but not overwhelming. The BLT benedict was good, but nothing mindblowing, and I don't think I'd come back just to try that. Lucky for us, they have a deconstructed lobster roll and shrimp scampi benedict, both of which sound delicious, and that enough would bring me back to the Bongo Room for another brunch.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9KGdxsXO9Q5kWcDTo1zJOQ/348s.jpg", "caption": "Chocolate french toast and BLT eggs benedict I think"}]}}, {"review": {"des": "Met up with some friends that were staying nearby and heard from their hotel it was a \"Chicago staple\"... not so sure I'd agree actually. My friends were seated at the table before my Uber dropped me off and although I was at the address, I almost didn't find the front door. It doesn't really stick out so you have to know what to look for (see window picture below). Meanwhile, inside apparently the waitress was dishing out major attitude to my friends and would not even allow them to order coffee until everyone at the table was present and ready to order up. So unnecessary!! This place isn't the Seinfeld soup window lol.<br><br>Anyhow once we ordered, the waitress basically slammed our coffee and plates on the table, never even cracking a smile or made eye-contact once. Guessing she was as miserable inside as the lack of air conditioning was to sit in. I mean, we were using our sticky (someone else must have used them as placemats) menus as fans until our waitress confiscated them. Not joking! We literally ate & ran. Not a plaće you would want to go for a relaxing coffee and conversation vibe.<br><br>On the bright side, food came out super fast, was average quality yet plentiful, flavorful and reasonably priced for a brunch in downtown. The menu had a lot to choose from but word to the wise: they are strict about no substitutions!!! Do not even ask. Just No!!<br><br>I doubt I'll return to this location but they have a few other locations and I'm seeing many high-star Yelp reviews so before I write them off my Brunch list, maybe I'll give Bongo Room another chance to Woo me. If they've been in business 20+ Years the've gotta be doing something right!! To be continued...", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AsxROcoXEgo1YDW7G1A51g/168s.jpg", "caption": "I only had a few bites... it was super sweet but these hot cakes are what the Bongo Room is known for:)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fe8ecuVZfQXc-dLXB0SAqg/168s.jpg", "caption": "Deconstructed lobster roll... there could have been more lobster though. Felt liked they skimped!!"}]}}, {"review": {"des": "I came here with my sister because I'm new to the area and I saw a long line over the weekend. Overall, it was very average, which is why I gave three stars. It's possible it was just what I ordered, but I don't know if I would bring friends here or anything. <br><br>We both ordered the scrambled eggs, which came with toast and potatoes, and we added sausage for a fee. The eggs were okay, but cooked very firm even though we specified a softer cook (possibly a health hazard for the restaurant, so it was reasonable). The potatoes were soft - I personally prefer a crispier potato, but they were seasoned well. The best part was that the portions were large, so I didn't feel jipped or anything. <br><br>I will say that the pancake options looked really good (from what I saw on the menu and other people's orders). The interior was okay, but not super comfy or welcoming, so I would maybe come back to get pancakes as takeout.", "pics": null}}, {"review": {"des": "Not as good as expected. We went in at 11 on a Sunday morning and it was super busy. We were told that there would be a waiting time of 20 minutes, we didn't even wait that long. The place was really busy as expected but the staff was not enough to cater to them. We waited for about 8 minutes before someone attended to us and handed us menus. The food was really substandard. I was expecting to be blown away what with all my friends recommendations but I was sorely disappointed. The house potatoes were mushy, the shrimp scampi eggs Benedict was really okay, nothing great. The only thing I liked was the latte. On the whole, a less than okay experience that I don't care enough to return for.", "pics": null}}, {"review": {"des": "In search of a tasty classic breakfast, a friend recommended the Bongo Room. They have three locations. This one doesn't serve alcohol. <br><br>We came on a weekday afternoon and got in without a wait. Service was very fast and attentive. I think we only waited about five mins for our food. It was crazy fast! I got the omelette and it was full of avocado, sausage and goat cheese. They don't skimp on the ingredients. They really fill it up! The potatoes were delicious. I loved how soft yet crisp they were. They were very flavorful. <br><br>This spot has great quality breakfast with quick service! It was tasty and simple yet flavorful!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/g5YSWyIk1uOV_FG5WAMrJw/348s.jpg", "caption": "Menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/09HwE3aPnqrXnFYxWubUQQ/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/h6weEMKl_j2-w4yEv9ZCqA/168s.jpg", "caption": "Omelette"}]}}, {"review": {"des": "The wait for this place on a Wednesday noon was about 20 minutes. I ordered the tomatilla salsa scramble with a substitute for the potatoes. The actual scramble was healthy and delicious!! 10/10. It had avocado, tomatilla salsa, chicken, and spinach among other ingredients. This was the only stand-out part of this dish-hence the 4 and not 5 stars. The potatoes were ok (not much flavor) and had to self-slather butter for the bread. The service was also ok- not great but not bad. If you're from out of town, I recommend saving your money for better food the city can offer. If you're from here, it's a good casual brunch spot.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/B-L7NrasV6rIV-SUomzKxA/348s.jpg", "caption": "Tomatilla salsa scramble"}]}}, {"review": {"des": "Any place that has a significant wait, or is consistently always crowded will always make my list of places I must try. With that being said, I was a little underwhelmed. We waited for about 45 minutes and enjoyed coffee and tea at the breakfast bar (standing room only) outside of the dining area. <br><br>I ordered the deconstructed lobster benedict and the white chocolate pretzel pancakes to share. The pancakes were EVERYTHING and I would absolutely come back for them as my go to top 5 winter breakfast favorite. Now, the benedict left me wishing that there was a more prominent lobster presence and definitely more flavor. I found it to be bland. It wasn't terrible, but it also wasn't noteworthy. <br><br>In short, get the pancakes, as it seems to me that's what The Bongo Room does best!", "pics": null}}, {"review": {"des": "Came here on a Friday around 11am<br><br>The good: <br>We were seated right away<br>Chorizo omelette was good<br>The tomatillo salsa Scrambled was tasty but a little watery<br>Chai latte was okay<br>Dishes were unique<br><br>The bad:Nothing was bad but nothing was amazing<br><br>Final Verdict: Glad we tried it and although I wouldn't go out my way to return I would give it another try if in the area", "pics": null}}, {"review": {"des": "A good place for breakfast. Came here around 8:30 on a Monday and it was 80% empty so no waiting time, always nice.<br><br>We ordered the tomatillos and the Rueben dishes. Both were great and would recommend the Rueben if you don't mind being unhealthy for a day. For dessert we shared the berry french toast which was covered with white chocolate.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/svZl9EEWhtyMazfWrvygEg/348s.jpg", "caption": "French toast"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6-avgsNNNRCtvbM1P8Tobw/168s.jpg", "caption": "White Rueben beef hash"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RgdcY-JX9Og2EbUX2svokQ/168s.jpg", "caption": "Tomatillos eggs"}]}}, {"review": {"des": "Great breakfast place. They don't serve traditional American breakfast but are fresh in taste and healthy!! The veggies were nicely cooked and tasted great. <br><br>We ordered omelette of our choice- <br>1) spinach, mushrooms and jalapeños<br>2)onions,mushrooms, spinach. <br><br>You can add 3 ingredients but definitely can go higher but have to pay extra!! The orange juice was great- can't say fresh or not but tasted great. <br><br>We were too full to try the pancakes - but if you visit this place - do try try the caramel pancakes. I have read a-lot of reviews on that and saw in person people ordering them and making great yummy faces :D", "pics": null}}, {"review": {"des": "I wish I could put zero. Stop the discrimination of single people going to restaurants. It was 9.20 am , a table was available by the entrance for 2. The greeter refused to give it to me because I was by myself. He wanted me to sit by the bar or next to the kitchen (hello smelly clothes)<br>Whats next refuse a party of three when a table of four is available? I have been a patron of this establishment for 5 years. Not going back anytime soon.", "pics": null}}, {"review": {"des": "Appearances can be deceptive. This seems like a small hole in the wall at the corner of Roosevelt and Wabash. However, it opens into a pretty large place of 20+ tables. <br><br>Given the popularity of the place the wait times can get pretty long on the weekends, especially for larger parties. 30 to 45 minute wait times are not uncommon at peak times on weekends (around 10ish)<br><br>With so many people it can get a little loud. The clanging of plates adds to the din. <br><br>But if you put up with it all, there is gold at the end of the rainbow. Food is good and arrives fast. The menu changes with the seasons. I loved the chocolate and banana pancake in early 2018 that was no longer available in summer of '18. The triple tower chocolate waffle seemed a close replacement, but I didn't enjoy it as much. <br><br>I did enjoy the chorizo omelette special and the deconstructed lobster Benedict was also above average.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_ewdt3JkHLblQ96pUcFMzg/348s.jpg", "caption": "Chorizo omelette isn't much to look at but has some good flavors"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6A5nLBQE-7V4MvXZk4knGQ/168s.jpg", "caption": "Chocolate waffles"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/oxEuxPfLZz6rSqd5H0Vd3w/168s.jpg", "caption": "Deconstructed lobster Benedict"}]}}, {"review": {"des": "I love this place because of all the places in the city for brunch this seems to have the shortest wait...and the place isn't that big! The wait staff and  hostess are very friendly. Lobster Benedict is good but a bit sweet for me. The shrimp Benedict sounds weird to me but it was oh so good. potatoes are a bit too soft for me but they make up for it with the dill . Very good flavor. They even asked me how I wanted my bacon cooked..never had that before!<br>The white chocolate pretzel pancakes are sooo good but very heavy, so be warned. I was pretty disappointed with the pineapple pancakes. Not enough pineapple flavor compared to how much dough there was and the dough seemed undercooked :/", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/F4wn2ytZzZnW7uBkobomGg/348s.jpg", "caption": "Pineapple pancake ...avoid. Not enough pineapple , too much dough and undercooked"}]}}, {"review": {"des": "The Bongo Room is a perennial favorite brunch place for me. The food is excellent, service exceptional and prices decent. The brunch items are always large portioned (a big plus for me!).<br><br>This weekend, I got the chorizo and avocado omelette, which comes with potatoes and toast. However, I've had the breakfast burrito and a number of their waffles (very sinful and decadent).<br><br>A tip is to come right when it opens. While the line is long, there's no one yet inside so you are almost guaranteed to get seated. There are several locations--Wicker Park, Andersonville and South Loop.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5TlB-d44dGThtoh1tcNxJQ/168s.jpg", "caption": "Fruit plate"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2oMFqIBLu6pM5YJG-2MXJQ/168s.jpg", "caption": "Chorizo and avocado omelette"}]}}, {"review": {"des": "If you are visiting Chicago, this a must try! Came with two friends on a Saturday at 10am. Greeted instantly and was asked to wait for 15 minutes for a table. Not awful considering the wait for breakfast other places can be an hour plus at this time of day on the weekend. Ordered fru-fru coffee drinks, they came in 15 minutes or so. Placed our order for food and it came out within 10 minutes. A pleasant surprise as the place was packed full. Together we ordered the Lobster Benedict, the Chorizo Omelette and the Berry Compote French Toast. All delicious. I will say they do not serve alcohol, so keep that in mind if you are wanting to do brunch with mimosas or bloodys. Would recommend trying this place!", "pics": null}}, {"review": {"des": "A good breakfast spot for locals. I always get an egg white omelette with spinach, tomatoes, onions, and fresh jalapeños, house potatoes, white chocolate pretzel pancakes, and a grapefruit juice. It's a bit small on the inside, so there are days you may have longer wait times. Parking is meh:/ There is no shortage of good breakfast spots around Chicago. Bongo Room makes the cut.", "pics": null}}, {"review": {"des": "10/10 for service<br>10/10 for food <br>10/10 for cleanliness <br><br>Ordered: <br>-Cappuccino (slightly sweet, smooth, light)<br>-Egg white Ruben Omelette (not a lot of meat but packed with flavor, chef boyfriend loved the English muffin, \"perfect muffin\") <br>-Meyer lemon and blackberry pancakes (perfect! Not too sweet not too plain! The pancakes on its own had slight cinnamon flavor, the lemon cream tastes like Greek yogurt and the blackberry coulis added the perfect tartness)", "pics": null}}, {"review": {"des": "We ( I actually had someone who wanted to hang with me, no clue what's wrong with her) came here on a Saturday around brunch. It was slamming, we got some coffee at the bar up front which was a nice touch. And we actually got seated pretty quick all things considered.<br><br>You can tell the place has been loved to death. The table lamentation was peeled and the seats were just short of being just wood with a thinly disguised pad acting like it's gonna cushion my bony ass. <br><br>The food was pretty good. I got the shrimp Benedict and my partner got eggs and potatoes. Both were ok, nothing to write Mom about. Both were also sorta cold. But after walking .5 miles I was hungry. Oh, they don't serve Mimosas. Lame.", "pics": null}}, {"review": {"des": "The bongo room aka the boom ass room. <br><br>Definitely a kick ass place for brunch. Service is amazing and tentative. Food comes out relatively fast and cooked perfectly. Pricing is very decent and affordable. <br><br>Things to get : <br><br>The white chocolate pancakes. The PERFECT amount of sweetness. Not too overwhelming. And if you're like me... and you only want a few bites, just ask them for one pancake. It's cheaper and you get just enough to fulfill the craving without being overwhelmed with a whole order. <br><br>The deconstructed lobster omelette is <a href=\"/redir?url=http%3A%2F%2Fbomb.com&s=bb4f996415a9c2f21137e27cfb68f439a48cec2652b53e9b50dd7e766dbe177e\" target=\"_blank\" rel=\"nofollow\">bomb.com</a>. Comes with a side of potatoes. It's a super decadent dish. <br><br>The salsa scramble. Also amazing !  <br><br>Come early. The place gets packed fast !!", "pics": null}}, {"review": {"des": "Very crowded with a long waiting time. <br><br>We have a reservation for multiple families. We arrived later and they refused to add seats to group table. We squeezed ourselves. When we tried to order, they refused to take our order, even though the group was still actively eating. Very unfriendly staff. Did not even try to be apologetic or accommodating.<br><br>I am giving 2 stars instead of one, because our companions said the food was OK, but they got offended as well because they refused taking any more orders from them either. We did not have the chance to try their food. I would not go back. Many great breakfast restaurants around, all competing to attract new customers.", "pics": null}}, {"review": {"des": "Hadn't been here in like 8 plus years.  So mom and I stop after running a few errands. The menu has a lot of sweet options. I went with the savory breakfast burrito. It was tasty. Very large portion so I had to take Most home. It came with potatoes which were great but also too much for one sitting. <br><br>The service was cool for what we ordered. And the food reheated well the next day. I don't know if I would run back here but on an occasion that I'm hangry and am in the south loop this may be an option.  wasn't bad but wasn't great either. I'm a breakfast gal so for breaky you gotta wow me. Or I'll just go slay in my own kitchen and Ave money!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pVnrFwcLEjbd63ykewn3sg/168s.jpg", "caption": "Breakfast burrito with egg whites and spinach. Breakfast potatoes dog in"}]}}, {"review": {"des": "The best meal I had while in Chicago!  I had the Pineapple Upside Down Flapjacks. Fresh pineapple ring in the center of a fluffy pancake served with a side of lightly sweetened real whipped cream. Service was fast and friendly.", "pics": null}}, {"review": {"des": "We go here every time we have guest visiting. The white chocolate and caramel pretzel pancakes are unlike anything I've had before. It reminds me of tres leches cake. The pancakes are light and fluffy enough where they can soak up all the white chocolate sauce. We always like to ask for extra sauce on the side. It's big enough to share with others. We also had the breakfast sandwich and burrito. Those basic but good.", "pics": null}}, {"review": {"des": "This was HANDS DOWN, the best breakfast I had while visiting Chicago. I'm still thinking about it, and my trip to chi town was last month ! This place doesn't take reservations, so when I arrived I went in and put my name down. My wait was about 40 mins, NOT TOO BAD, for such a popular place, and you can order coffee while you wait,  from the bar . The tables are a bit tight, but honestly you don't care because you're too busy shoving food in your mouth. I honestly can't even review what my friend had cause I was too busy eating. I of course ordered <br><br>- white chocolate  and caramel pretzel pancakes - AMAZING - you assume that it will be too sweet but it's just the right amount of sweet and not overbearing..I couldn't get enough , I was dragging my pancakes through the sauce to make sure I didn't leave nothing on the plate. ( don't judge me) <br><br>- eggs, toast, chicken sausage ..great, especially the chicken sausage. I'm more of a bacon person but the sausage was unexpectedly tasty. <br><br>- chai tea latte and grapefruit juice- chai tea latte temp was perfect..not steaming hot but hotter than warm..it was foamy tasty and satisfying . The grapefruit juice was FRESHLY squeezed. <br><br>If I'm ever in chi town again , I will be running back here !", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xrqf-8TRWUqnRQRQlnV7-Q/348s.jpg", "caption": "Chai tea latte and grapefruit juice"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7zYLgBJGtZed8D4hm2K27g/168s.jpg", "caption": "Eggs, toast, chicken sausage, and potatoes"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ExoIv1F9RiMcEjgxUgL02A/168s.jpg", "caption": "White chocolate and caramel pretzel pancakes"}]}}, {"review": {"des": "Love how it's so close to Trader Joe's and Jewel Osco, so it makes Sunday grocery shopping so much better. The wait at around 10:30AM on Sunday was only 10-15 minutes and the food came out quickly. Delicious breakfast potatoes, if you are a fan of dill, and above average coffee.", "pics": null}}, {"review": {"des": "I came here with two med school friends for brunch, and we picked this location thinking it would be less crowded. We still had a little bit of a wait, but mostly because the whole party must be present before seating. <br><br>The Chicago Marathon was happening on the day I went, and runners ran by just steps away from this restaurant. The entrance itself is also not that clearly marked (no big sign), so just look for the door.<br><br>The interior itself is very bright and warehouse-like. Service was friendly and attentive, and they were more than happy to oblige when I asked for extra walnut pieces for my pancakes.<br><br>Prices were average, and the portions were quite generous. I ordered a savory dish as well as a half-portion sweet dish, but the half-order still came with two humongous pancakes.<br><br>Overall, the food was tasty and I would certainly come back on a future visit to Chicago.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ooFkUdVZeTggniVLdI7h5w/348s.jpg", "caption": "Shrimp scampi benedict."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SAH5mvOvfZbkpu59xC5LiQ/168s.jpg", "caption": "Spinach and feta benedict."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Qm98ExnUsdK9Ub_SxyBS2Q/168s.jpg", "caption": "Lemon brioche toast."}]}}, {"review": {"des": "The pancakes were absolutely delicious. <br>They were covered with white chocolate and lemon custard, With little bits of strawberries on top. <br>My friend had French toast, covered with white chocolate. She said it was very good and not too sweet. <br>They over cook their bacon, which bothered me a bit. I sent it back and they brought me a new portion, but it wasn't much better. <br>I like that they offer specialty coffees, like mocha, latte, cappuccino etc. <br>Their drip coffee was also decent. <br><br>The decor isn't the greatest. Felt a bit uninviting and cold. <br>Service is a bit on the slower side.<br>All in all my experience at this establishment was good. I would return.", "pics": null}}, {"review": {"des": "Wow, the Bongo room definitely has flavor! I was super impressed with their system for handling groups and seating individuals. Once our entire party arrived, they did not miss a beat with getting us quickly seated. The menu is simple is simple, but flavorful and the server was attentive to her section. I also liked the variety of teas that they offered to pair with brunch. My only caveat is the place was fairly tiny and the tables felt crowded, which made this feel like more of a quick stop brunch whether than a chill out spot. Overall, it was an enjoyable experience.", "pics": null}}, {"review": {"des": "The front of the house coffee bar is great because you can drink your coffee and wait for the next available table. (The wait was about 20 minutes). I really liked the coffee bar but it did get a little chilly as the front door are constantly opened to let people in and out. <br>I had the chorizo and avocado omelette with breakfast potatoes on the side. The chorizo was little too spicy/ there were hot spots in my food. Also way too much breakfast potatoes on the side. Overall very pleasant experience, I would probably try something else next time on the menu.", "pics": null}}, {"review": {"des": "Good service and accommodating for having a toddler. Husband got an omelet that was decent, but I got the pumpkin spice pancakes that were underwhelming at best. They were very doughy without much flavor and seemed uncooked. The omelet came with potatoes that were average and choice of toast that was good.", "pics": null}}, {"review": {"des": "My husband and I tried this place based on all the reviews.  As expected, there was a huge line out the door.  However, they did get us in and seated pretty quickly (within 40 minutes).  <br><br>I ordered the Tomatillo Sausage Scramble with three egg whites scrambled with grilled chicken, baby spinach and topped with diced avocado.  It was served with sliced tomatoes and wheat toast.  I did not care for it much at all.  It had way too much sauce on it and not enough egg.  The balance was way off.  The toast was fine and the tomatoes were juicy and delicious.  I was honestly a little disappointed in my meal and wouldn't have to go back.  <br><br>On the other hand, our service was great and prompt!  Also, as I looked around the room, I kept noticing how good everyone's pancakes looked, but I'm not a big pancake person.  If you are, the rumor is that they are delicious!", "pics": null}}, {"review": {"des": "Loved the pancake selections. Really wish I could eat bananas because the banana praline pancakes sound amazing with heath bar chips and warm praline cream. Oh well. I got the white chocolate and caramel pretzel ones because it sounded sweet, crunchy and savory. I was not disappointed. The coffee was good and they had a big bowl of creamer on the table so I didn't have to keep bugging the server for more. It's a friendly ambiance, perfect for a long chat and they were cool with little ones. Prices were decent considering the area. Lunch options sound yummy, too so returning for lunch is a possibility. Staff was friendly and attentive. Overall, a good experience.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CDqqXzf9ett7ChcNO88RUw/348s.jpg", "caption": "Breakfast options."}]}}, {"review": {"des": "!Great Food!Great Service!!<br>Hiding (!?!) Breakfast Place!<br>Different , not standard kind Breakfast Place!<br>Pancakes Die for!!!Amazing Testy Big !<br>They Change time to time test and assortment !<br>I am not really pancake fan,but this place is Killer!...and skip coffee !..instead try Hot Tees!...Great fruits herbal assortment !<br>Great for Breakfast ,Lunch & Brunch !!<br>Great Experience!!!<br>Definitely I will be back !", "pics": null}}, {"review": {"des": "When I lived in Wicker Park, this place was just down the street.  I'd come here for early brunches with the woman I saw at the time, and we'd split a chocolate tower french toast or some other over the top breakfast thing and get a regular bacon and eggs breakfast to balance it.<br><br>I haven't been to a bongo room in years so when a friend was in town visiting this weekend, I decided we should give it a shot.  We went at around 11:30 am on a Saturday.<br><br>I had the deconstructed lobster roll benedict, and she had the egg white Reuben omelet and Moroccan mint tea. <br><br>The eggs benedict was fantastic and the sort of thing where you look wistfully at the plate as you take your last bite hoping there is another morsel somewhere you had missed.  <br>Honestly, I've eaten here enough to know that I was going to get a delicious egg benedict to me the real surprise was the egg white omelet.  I mean the very idea of an egg white omelet makes me weep for the future of the world, but this thing came packed with flavor, and amazingly with all the various ingredients in it (potatoes, onions, tomatoes, cheese) the cured meat flavors from the corned beef still managed to come through.<br><br>I think Bongo room is ready to re-enter my regular brunch rotation.", "pics": null}}, {"review": {"des": "Personally, I think I just got the wrong thing at the Bongo Room. My other friends that got the savory dishes like the eggs Benedict raves about their breakfast. I also got to try their potatoes and they were very well seasoned and delicious. Personally, I enjoy a sweeter breakfast but the pancakes here were overwhelming and I wasn't able to eat more than half of my breakfast. They pour the sauce over the entire plate which unevenly coats the first pancake with a lot of sauce, and the bottom row pancakes with no sauce. I also think proportionally it's just a lot of sauce for pancakes. My friend also decided to get a side of sausage patties and the side was overpriced for the two tiny patties he got. <br><br>I think if I came again I would definitely stick to the savory side, because the sweet side was just too sickeningly sweet.", "pics": null}}, {"review": {"des": "Really good.  (Some of our food was cold) <br>Be sure your entire party is with you, they won't seat you until one is there.  Busy place. We had to ask for coffee refills, our waitress was not asking us. (Same with water)", "pics": null}}, {"review": {"des": "This is a small cute dine in place in the South Loop area. They have a really good chorizo omelette.", "pics": null}}, {"review": {"des": "UPDATE: BANANA & PRALINE PANCAKES ARE BACK :'))) they are seasonal but these are the best pancakes EVER along with the lobster benedict", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/35W84uZ2AL9IiQFNyKTNUw/348s.jpg", "caption": "Banana pancakes (the best item on the menu)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-P3AQVOWQb2CaIFt8-gykg/168s.jpg", "caption": "Key Lime Pie Flapjack - surprisingly very good but got a little too sweet for me after one"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZzBFRrajjshwLAQeE7wHnQ/168s.jpg", "caption": "Strawberry Banana Pancakes..most disappointing pancakes I've had from here"}]}}, {"review": {"des": "We came on a Sunday at 11:30. It took every bit of the quoted 30 minute wait time. The place was packed. Table turn over was quick! Our food took no time at all and was incredible! I ordered the BLT Benedict off the spring/summer menu. The Pesto Hollandaise was delicious! I really enjoyed that. The house potatoes needed some salt- and I never salt my food. The one service critique I would make is that it took quite some time to get our drinks refilled. We asked our server twice, and even another server. We will be back !!", "pics": null}}, {"review": {"des": "Warning: Avoid weekend late brunch time. The wait can be more than 30 minutes. <br><br>But the food is definitely worth the wait. Get their pancakes, red velvet especially.<br>Other brunch places like Yolk serve red velvet pancakes too. But other places' red velvet pancakes are super flaky and dressings are too sugary. The Bongo Room is the only place that serves the perfect soft and fluffy red velvet pancakes.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uWj3hbO02C1APAm-JDgBVw/348s.jpg", "caption": "Croissant sandwich :)"}]}}, {"review": {"des": "I'm not really sure how I feel about this place. I was brought here by some friends who have tried a different location in the past. We didn't realize it was byob but that mistake was on us. I wasn't feeling like a giant breakfast so I stuck with the classics- scrambled eggs, toast, fruit and avocado on the side. I also ordered a house made hot tea which was delicious. The eggs were cooked fine, just like a diner would make them. The toast weirdly didn't even come with butter. The fruit plate was probably the most impressive of anything to be honest. My friends had some berry graham cracker pancakes that are definitely suited for those who love super sugary and sweet breakfasts. It also needed more texture and was basically pancakes with a creamy sauce poured over them, the graham crackers were barely noticeable at all. Our server was nice but the place didn't have a cozy or inviting atmosphere like I would have hoped so once we were done we didn't linger. It's not bad food by any means, but it was just a-ok in Yelp terms. Out of all the breakfast places in Chicago, I'm not sure I would come here again.", "pics": null}}, {"review": {"des": "Small breakfast and lunch spot in the loop. Drove past it the first and almost second time too. Had the breakfast burrito and my friend had a simple two egg breakfast. We split a lemon blueberry pancake. Everything was great (food, service & seating)! Would return here again.", "pics": null}}, {"review": {"des": "We enjoyed our brunch here. Surprisingly, we did not have to wait and they brought out our food quickly (on a Saturday afternoon). Portions are huge, so I would recommended sharing and ordering few sides. I ordered the white chocolate and Carmel pretzel pancakes. I added regular chocolate chips to mine and it was amazing! A cute place to check out whenever you are in the area!", "pics": null}}, {"review": {"des": "If you're into sweet pancakes, this is your place. If savory is more your style, then you're not missing much if you don't stop by here. I'm not into sweets for breakfast and I ordered my to-go brunch plate, eggs benedict. This wasn't anything too great and for $13.50, this was on the pricier side compared to other breakfast places. The house potatoes were on the blander side, not much flavor there. <br><br>My friends definitely loved the white chocolate pretzel pancake though. I tried it and wasn't impressed. But again, I'm not much of a sweet breakfast type of gal. <br><br>Things to note<br>-The sweet pancakes come in 3's. If you want only 1 pancake, it's half the menu price. If you want 2 pancakes, it's 2/3rds of the menu price. ~$6 for a pancake is kinda steep if you ask me but I guess you're really paying to try more than just 1 flavor and not give yourself diabetes in a day.<br>-The take up to 4 cards per check", "pics": null}}, {"review": {"des": "The place is kind of tight on most days. In addition it tends to get pretty hot as a result. All the same, the main pull here is most certainly the pancakes, which are more than likely the best in Chicago, honestly. With that being said, I think the other dishes are just OK. If you're here ensuring the uncomfortable closeness to others and not so fun chairs, do yourself a favor and eat the pancakes.", "pics": null}}, {"review": {"des": "What a great find! And it really was. Our Uber driver had a hard time finding it because there is hardly a sign to let you know it's the Bongo Room. But once inside we knew we were in the right place. We came around 10am on Saturday and only had to wait 20 minutes which didn't seem too bad. <br>The star of breakfast was the white chocolate lemon ricotta pancakes. But the smooth cappuccino and savory chorizo omelet were not a disappointment. Serving and prices made us feel we got our money worth", "pics": null}}, {"review": {"des": "came on a weekend and boy...was it packed. for two people, the wait was close to 30-40 minutes. My friend and I came around 10:00 AM and it was already full! great selection of food! the food is definitely worth the try, IG worthy if you ask me. <br><br>The BLT benedict: two toasted English muffins topped with poached eggs, applewood smoked bacon, baby spinach, tomato, and basil pesto hollandaise sauce, served with potatoes. I love eggs benedict and it was absolutely amazzzzing! You can definitely taste the bacon and the yolk just running down the benedict. the potatoes were also very nice and crispy and it went well the basil pesto hollandaise sauce which was definitely a first for me to try!<br><br>service: could need a bit more work on it. The server kept forgetting my friend's toast that came with his meal and by the time we were done eating, he brought out the toast and we just packed it up since we had left overs.<br><br>atmosphere: very crowded and noisy, I could hardly hear what my friend was talking to me about or the music. But other than that, this place is pretty amazing to have breakfast/brunch with!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MLAFXOYv8lCePjfKW-T0rg/168s.jpg", "caption": "BLT Benedict"}]}}, {"review": {"des": "Well I'm not sure what the fuss was all about, but this was not what I was expecting. First the table was sticky and the seats were covered in crumbs. The service was prompt enough but not friendly beyond cool politeness. My omelette was ok, but nothing special. The reason for three stars instead of two is my daughter's pancakes were really good.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pVZGMakFAogNpWszk8Iwow/168s.jpg", "caption": "Omelette"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Az39TwGAAFVN7F4XcdQ-rg/168s.jpg", "caption": "Lemon berry pancakes dug into before I could remember a picture."}]}}, {"review": {"des": "My visit to the Bongo Room started out great. We were quoted a wait time of 20 minutes for a table for 2 around 12:15 pm, but we were happily seated only 5 minutes later. <br>After perusing the menu, which had tons of delicious sounding sweet and savory items, I ordered the croissant breakfast sandwich (bacon, muenster, and one egg any style on a croissant with a side of potatoes). My husband tried to order the chocolate French toast tower, but the waiter said they had run out. No problem, he went with the vanilla cinnamon French toast instead.<br><br>Our food came out pretty quick and was really tasty. The French toast was especially good: the vanilla cream on top was heavenly, although they definitely skimped on the sautéed apples (there were only 4 thinly sliced pieces on top). The croissant sandwich was delicious too, just what I expected with a perfectly cooked over medium egg. The potatoes were redskins with lots of herbs; it was a little too herby for me, but my husband devoured it.<br><br>Then, the snag. The couple sitting right next to us also ordered the croissant sandwich, and the lady found a hair in her food. She told the nearest waitstaff, who whisked the plate away. A few moments later, our waiter appeared, but he didn't apologize to her at all. He just wandered around our tables and then went back to his station, pulled out his phone, and started playing with it. Very unprofessional. No manager or other person approached to apologize either.<br><br>I am willing to come back to the Bongo Room because the food was fantastic, but god forbid I find a hair in my food-- apparently, they couldn't care less about their customers' experiences.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8pBhDw2Xjl5s4H3Bwl-6Mw/168s.jpg", "caption": "Croissant sandwich with breakfast potatoes"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2qE6cuz1HRQh46g6-V7TNQ/168s.jpg", "caption": "Vanilla cinnamon French toast- yummy but very skimpy on the apples!"}]}}, {"review": {"des": "Wow this place was good. I really want to give it four stars for two reasons. 1- give you a can of soda for $2.75. Who gives cans anymore? 2- waiter never came back to fill our drinks. Not until we got a check. Food was so good though, couldn't take away a star. Had the Chocolate Tower French Toast and the Deconstructed Lobster Roll Benedict. The food was some of the best breakfast food we've ever eaten.", "pics": null}}, {"review": {"des": "The first thing you will notice when you come in on a weekend morning is that how noisy and busy this American diner is. The lunch menu starts by 11 am and before that is your typical brunch items. They also have weekend specials and a different menu for spring/summer and fall/winter. One of my fav item from their winter menu is the banana praline pancake and I miss it this time when I came in summer. We ordered the triple tower chocolate French toast which was sinful. The sauce was in perfect amount and the bread was well dipped. A little not so happy with my deconstructed lobster eggs Benedict as the lobster was too fine and I would have liked some chunks. It came with a side of potatoes which I was very happy with. My partner order the potato avocado and chorizo omelette which really hit the spot. It also came with potatoes which was good. The portion size are not too big so u won't be really packing away another meal.. may be a snack if you are a small eater. So from price point perspective it's a little expensive having to spend $15+ for lobster eggs Benedict with no leftovers. All in all it's a good diner experience with some interesting menu options", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GHN9NoyqHR4yU6-3Fhm8mg/348s.jpg", "caption": "Lobster egg benedict"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RbfRbq8YT35h6yMhdZ_HTw/168s.jpg", "caption": "Potato avocado chorizo omelette"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fIYtYk2MleblMzD69VqVrQ/168s.jpg", "caption": "Triple chocolate tower French toast"}]}}, {"review": {"des": "Didn't quite live up to the hype.  I ordered the croissant sandwich and a single pancake (lemon and blackberry).  The croissant sandwich was underwhelming and the ratio of egg/bacon to croissant was out of wack.  Every bite left me wondering if I made a bad choice.  The pancake was better than the croissant, but not by much.  I expected the acidity of the blackberry to balance out the oversweetened lemon cream - it didn't.  I finished about half of it before I decided it wasn't worth the calories.  I wanted to like this place, but it just didn't do it for me.", "pics": null}}, {"review": {"des": "Stopped by to grab breakfast this morning after reading the reviews on yelp. The wait was about 25-30 minutes. Sat down and immediately ordered. Food came out quick. I ordered the white chocolate and salted pretzel pancakes. They were okay - very dense with no sweet taste to the pancakes. The service wasn't great. We never saw our server again until we had to flag someone down for the bill. I'll take my business to Wilberry where the service and pancakes are better.", "pics": null}}, {"review": {"des": "French toast was heart stopping amazing! Food and service was amazing as well. FYI NO ALCOHOL AT THIS LOCATION!!!!!!", "pics": null}}, {"review": {"des": "Portions are pretty big! Super filling. Got the vegetarian croissant with no cheese, and tomatoes instead of potatoes. It was still good without the cheese! :)<br><br>Breakfast burrito was flavorful too. :) Filled with a lot of egg (loved that!). They certainly don't cheap out on you. <br><br>I wish there were cheese substitutes and gluten substitutes. <br><br>They have Meyers soap instead of the industrial toxic soap so I really appreciate and love that. :)<br><br>The place is kind of hard to find. Look for small little signs of their name on the windows/doors. Located at the very corner of the building. <br><br>I wish I would've read someone's previous tip that benedicts are only served in the weekends! :( I was looking forward to that and was extremely sad to come on a Monday, where it would be less busy, and found out they weren't serving benedicts.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HP2T8wUdpooJBeReWBtgRQ/168s.jpg", "caption": "Vegetarian croissant"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/W-djptRi6yWbpk3yxnigbA/168s.jpg", "caption": "Breakfast burrito"}]}}, {"review": {"des": "Me: Do you want to split something sweet and something savory?<br><br>Boyfriend: I kinda wanted to get an omelette for myself.<br><br>Me: Sorry. I meant, \"We're splitting an omelette and pancakes.\"<br><br>Oops.<br><br>My boyfriend tries to suppress his sweet tooth, but when you show up at Bongo Room, you're not there for an omelette, you're there for thick pancakes slathered in delicious.<br><br>We visited at noon on a Sunday and the wait was just 15-20 minutes for 2. I was actually a bit shocked because when I'd gone here before, the wait was always 30+ minutes, but I wasn't about to start complaining!<br><br>We were seated before our 15 minutes was up. We already knew we were going to get the Chorizo, Potato, and Avocado omelette, but we had a hard time deciding between the Key Lime Pie Pancakes and the White Chocolate & Caramel Pretzel Pancakes. Luckily, our waitress recommended we just have a half order of each!<br><br>Food Thoughts:<br>1. Chorizo, Potato, and Avocado omelette: Yummy. The perfect amount of heat and salsa on the side never hurt anyone. The potatoes on the side were a little bland, but nothing a little salt didn't fix.<br>2. Key Lime Pie Pancakes: Honestly, kind of strange. A little too tangy to be a pancake. But! Once you put the vanilla bean butter on top, it was delicious! I could have put that spread on anything. <br>3. White Chocolate & Caramel Pretzel Pancakes: So rich. These tasted so good! There were little bits of pretzel that gave it a nice salt kick. <br><br>The pancakes were amazingly fluffy, and splitting was definitely the right move since we were both stuffed at the end of our meal. <br><br>Overall, the pancakes were VERY sweet. When I say \"slathered in sauce,\" I mean it. It felt like we had a bit of omelette as an appetizer and skipped immediately to dessert! I almost wish we'd gotten an extra side of bacon or something to balance out our sweet/salty ratio a bit more. But the food was good so I can't complain too much!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PPE9fnFm8bYJjcYCGXIJRA/168s.jpg", "caption": "Lots of room around 12:30 on Sunday!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VD9SZFrzlZGSL07qjHGk_A/168s.jpg", "caption": "When I say \"slathered in sauce,\" I mean it!"}]}}, {"review": {"des": "They have a great selection of teas! It paired nice with my veggie sandwich and I was glad my out of town guests left happy. My sandwich was served on a delicious lightly toasted butter croissant, and all the veggies were fresh which made it taste even better. I  loved that they served<br>intelligentsia coffee and that we never had to ask for refills on our drinks. The waiter was attentive to our table and super nice. If you are driving & going to be hanging out in the South Loop you can park behind the Essex for $8 and walk 2 blocks to the bongo.", "pics": null}}, {"review": {"des": "This is definitely my favorite breakfast place in all of Chicago! The white chocolate Carmel pretzel pancakes are to die for! I also love getting the eggs Benedict with chicken sausage. Servers are super nice and the food is delicious! You might have to wait an hour or two on the weekends so go early!", "pics": null}}, {"review": {"des": "This place is delicious! My wife and I went for brunch on a Saturday and I loved it. Five star food at very reasonable prices. I had a apple cinnamon french toast which was incredible (although I had hoped to eat the chocolate banana french toast which was sold out) and my wife had a very tasty breakfast croissant. If you want the full menu options it appears you have to show before noon but since we came so late we had no wait. (worth it in my opinion)<br>Cons: our waiter was a bit odd. He was slow and didn't really check in with us much. Plus he failed to apologize to the people at the table next to us when she found a hair in her food. <br><br>Looking forward to going back and trying it again!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9GhLUhRyPEyKJWx71mnnqQ/168s.jpg", "caption": "My French toast!"}]}}, {"review": {"des": "I have been wanting to try this place pretty much since I heard about it when I first moved here, and I finally got to!  Went with a friend for brunch on a Sunday-I'd heard horror stories about the wait, so when I walked in and told it would be about 15 minutes, I was pleasantly surprised.  I was even more surprised when 5 minutes later they called my name and I had to wait because my friend hadn't arrived yet!  (Maybe because it was Mother's Day and all the brunchers were going to nicer places with their mothers?). <br><br>I was expecting a bit more in terms of atmosphere-it's a pretty bare-bones diner feel, with old chairs, small tables, etc.  It wasn't dirty or anything, just very basic decor.  The tables are packed pretty tightly in there, as it's not a large space (as in, I could have reached over and taken a forkful of the breakfast of the person at the table next to me, who I didn't know).  And it was quite warm in there-we were sitting by the side door and they had it propped open to get a breeze going, but it helped only minimally.<br><br>The food was amazing, so that lived up to expectations.  I had the White Chocolate Caramel Pretzel Pancakes, which I've been dreaming of for years, and they were amazing.  Not too sweet, and the crunch of the pretzels in the pancakes was a nice touch.  It was way too much to eat at once, so I got leftovers.  My friend enjoyed her BLT Benedict as well.<br><br>Service was good, and prices were pretty reasonable.  I'm happy I got to try this place finally, and I'd go back because the food was amazing, but I probably wouldn't endure a super long wait to get in now that I've been once.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sMMdcp_zRnrm0yWFm43WTA/348s.jpg", "caption": "White Chocolate Caramel Pretzel Pancakes"}]}}, {"review": {"des": "Bongo Room has been my favorite brunch place in the city since it opened. The mix of savory and sweet decadent options are fantastic and everything on the menu is delicious. I take every out of town visitor there and go often myself. I've probably been there 50 times over the last few years. <br><br>This is why I was all the more upset when I arrived at 1:52pm and the door was locked. I knocked and someone answered and said they were closed. I pleased that it's my favorite restaurant and we would order very quickly. He told me they close 5 minutes before 2. I told him it was now 1:53. He looked at his phone and said it's 1:58. Just lied straight to my face. We all have the same phones dude. <br><br>I realize no one likes people that come in right before close... but a brunch place that closes at 2pm on Sunday should have been able to seat us at 1:52. Or change your hours on Google! Don't say you close at 2. <br><br>Very disappointed and ruined my day.", "pics": null}}, {"review": {"des": "Line is ok, I mean people wait to get good food. <br>I ordered the egg white omelette with corn beef, which is delicious. The side vegi and toast are super fresh and well prepared. The main dish has a lot of flavor, including black pepper and some kind of spicy. <br>Gotta come here another time to try more stuff on the menu", "pics": null}}, {"review": {"des": "Gave The Bongo Room a shot after seeing all the great reviews. I would say it's overrated and not worth going to. The food was okay, the dining room was very small, service slow, and being a Sunday, there was a long wait. We did try Wildberry and I would say that is the place you should go to!", "pics": null}}, {"review": {"des": "First time to Chicago and came across this place on yelp. I was not disappointed! I ordered the brioche French toast and it was heavenly. The service was great as well. I will definitely be coming back!", "pics": null}}, {"review": {"des": "By far, my favorite place that I visited while in Chicago!! I'm so glad my friend recommended it to me. If you love pancakes like me, then this is the place for you!! I had the Pineapple Upside Down Pancakes. They had coconut and mascarpone with a pineapple slice on top. Incredible! My mom ordered the Lemon White Chocolate Pancakes and they were to die for too (especially if you like lemon!). We went on a Wednesday so there was no wait for the table and the food came quickly. I hope to visit Chicago again just so I can come back to the Bongo Room!!", "pics": null}}, {"review": {"des": "Looking for a good brunch spot, I stopped here with some coworkers on a weekday morning. We were seated immediately and the service was quite fast which was very convenient for us. <br><br>I ordered a freshly squeezed grapefruit juice, which is always a refreshing start. There were so many amazing options to choose from, so we decided to order a large selection to share amongst the table. The Chorizo, Potato, Avocado Omelette was delicious and a great savory option. The Breakfast Burrito was probably one of my favorite dishes. We ordered it with chorizo as well for a more filling meal. I enjoyed how both were served with ample amounts of salsa and roasted potatoes. <br><br>The Pumpkin and Spice Pancakes were definitely more of a dessert dish. I'm glad we all shared, because it was so sweet and rich that I could not have eaten an entire plate on my own. Even with the four of us we couldn't finish these sweet pancakes completely covered in vanilla glaze. My favorite pancakes though were the Caramelized Pear Pancakes. They were just the right amount of sweet and tangy. They were also somehow crisp and fluffy at the same time. It reminded me a little of an apple crisp. <br><br>I'm so glad we found this brunch spot and would definitely recommend it!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PcPwLxdnAfxsIl7w6ADCSQ/168s.jpg", "caption": "Breakfast burrito"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8kmlgt34CNwpx2txNOdU2Q/168s.jpg", "caption": "Caramelized pear pancakes"}]}}, {"review": {"des": "Stopped by The Bongo Room for breakfast at around 9:45. We expected it to be busy and it was but HOLY COW their service was so fast. I couldn't believe how quickly the food came out and it was hot and tasty!<br><br>I had the special eggs benedict, BLT, and it was soo good. It was the perfect combination of feeling healthy with a perfectly poached egg. (which doesn't always happen) <br><br>The fresh made orange juice was really good too just a bit pricey. <br><br>I HIGHLY recommend The Bongo room for food because their service is spot on!", "pics": null}}, {"review": {"des": "Delicious brunch spot!!<br>The outside just looks like a regular building and there is no actual sign for the restaurant which makes it super local. Usually a 45 min- hour wait but came on Easter and got seated right away.<br><br>We had the BLT Benedict which was delicious and the chocolate French toast which was bites of perfection. Would definitely recommend this spot for brunch!", "pics": null}}, {"review": {"des": "Located just outside south loop, this place is at the corner of wabash and Roosevelt amidst all the hustle and bustle of the city. The inside is perfectly fine with decent seating. The staff are very kind and have a great sense of hospitality. <br>We ordered some cranberry pancakes, chicken avocado omlet and veggie croissant sandwich and chicken avocado club. <br>The food is fantastic here and the pancakes were like icing on the cake. <br>Never had such delicious pancakes before! <br>You guys rock! Go Bongo", "pics": null}}, {"review": {"des": "If you're looking for a sweet treat for breakfast, TBR will deliver! My first visit here was with a group of college friends visiting for a football game. I remembered the vanilla bean cream slathered all over my brioche french toast. It stayed with me years later when my wife and I came to visit. I made it a point to come back and enjoy a meal to kick off my day. This time, I enjoyed it with a nice cup of hot tea to pair with the frigid cold. The fruit notes on the tea were deliciously robust. Too bad Acelyn enjoyed my cup of tea just as much.", "pics": null}}, {"review": {"des": "Came here on a weekday. I'm going to keep this short. Food wasn't that great. Don't know why people rave about it. Just blend food to be honest with you.", "pics": null}}, {"review": {"des": "This is a must go place for us whenever we are in chicago. If you're thinking brunch, candy, chocolate, kids, and family - this is your place to go. Now having expanded to numerous locations, you and your belly will be in heaven at this place (as well as your sanity since they are super kid friendly).  Famous for their white chocolate caramel pretzel pancakes, you'll wonder why you have never come here before. Chochoate tower french toast, red velvet hotcakes, oreo praline flapjacks are more reasons the line to come in here gets long on the weekends. Balance out the candyland of breakfast meal with lobster benedict or a croissant sandwich.", "pics": null}}, {"review": {"des": "Decent little diner with good food at reasonable prices.  Service was good.  The place was a little grimy, not dirty, but just grimy like everything needs a good bleaching.", "pics": null}}, {"review": {"des": "This place is delicious but I would only go if your job for some reason allows you to eat a leisurely breakfast on a week day. The wait on weekends is just too long for it to be worth it. Great vegetarian options! I've come here with dates and family. Decent prices and service. Going as a party of 2 and being willing to sit at the bar will help with the weekend wait!", "pics": null}}, {"review": {"des": "This used to be one of my favorite brunch places, but the last 2 times we had bad experiences.  There is no option for call ahead or reservations for brunch, but I am willing to wait for good food and service.  I got an omelette, my husband got shrimp eggs benedict and our friend got the breakfast burrito.  After we ordered, my husband realized he forgot to add on an item for all of us to share.  The waitress returned with my omelette (only 1 of 3 items) and told us that since she brought the first food item, we could not add on anything else.  My breakfast was lukewarm when it came out.  It took another 5 minutes for my friend's meal to come out, and an additional 5 after that for my husband's. We were already annoyed that we were unable to add items, particularly since our food did not come out at the same time.  Then our friend found a hair in her potatoes (which were also cold).  We did not bring this up to our sever because she was difficult to find and we were almost done with breakfast anyway.  In terms of flavor, my omelette was pretty good, the breakfast burrito was bland and seemed lacking.  My husband did like the benedict.  I think they have a good foundation, but need to work on their service and coordination.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/f1_Bn_OWJ1t0LpgHh6xqCQ/348s.jpg", "caption": "Eggs Benedict"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-9KyxVdV7TmuSqqSqIUq1w/168s.jpg", "caption": "Breakfast burrito"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0vXIUSJd7-2z6lAB_4w8iw/168s.jpg", "caption": "Omelette"}]}}, {"review": {"des": "This place had some of the best breakfast food I've had here in Chicago. <br><br>When my best friend and I walked in it was pretty much empty but us and a couple of staff, soon after the place was filled with vibrant diverse people enjoying a meal together. You walk in and get seated immediately and they give you a lot of advice if you ask for it. We enjoyed some pancakes and some of the croissant sandwiches. The side of potatoes were so well seasoned and had lots of flavor. <br><br>I will definitely be back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hLBnbeJhkVLKcyPSOUJmOw/168s.jpg", "caption": "Banana nut pancake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/I4NevS7GI-eF3Apx0I-t2A/168s.jpg", "caption": "Croissant"}]}}, {"review": {"des": "Excellent selection, attentive and quick service and fantastic food.  Very popular breakfast/brunch spot.  Omelette and Burrito were superb.", "pics": null}}, {"review": {"des": "Cute little place making food fresh to order . I had the Veggie Crescent sandwich and the Chorizo Omelette. They were great!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/J0l5SJ7meK22guc6RMBcAw/348s.jpg", "caption": "Chorizo Omelette"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Bqyx-nFqrjIIvlduGGaLlw/168s.jpg", "caption": "Veggie Crescent"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Pn8FzwSjOdzrxK8GXoTC6A/168s.jpg", "caption": "They breakfast and lunch only"}]}}, {"review": {"des": "I love this place! I love it even more now that I can get different pancakes for breakfast-it is more expensive-yes-is it worth it-depends. I had the blackberry lemon and key lime pancakes. Pancakes and flapjacks are identical-that made me chuckle. My friend had a build your own omelette and she didn't want potatoes so they substituted tomatoes which I thought was nice. I've had the croissant sandwich before and that is also stellar. Our server was attentive and helpful. He let me know about the pancakes because it wasn't on the menu. We went at 8:45am and only a couple tables were filled. When we left the majority of tables were full. There is massive construction right next door which makes the door somewhat challenging to find. This shouldn't dissuade people from coming! Can't hear anything inside and the food is great!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/W2GoFeCn9dNF6TfIQpFGyg/348s.jpg", "caption": "Pancakes and omelette"}]}}, {"review": {"des": "Stopped here for breakfast while in town visiting. I enjoyed the two egg breakfast which came with eggs, toast, and hash browns. My husband enjoyed the breakfast burrito with a side of hash browns. We couldn't leave without trying one of the delicious looking sweet pancakes so we decided to split the red velvet pancake with white chocolate icing and chopped pecans. Amazing!!! Don't leave here without trying!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_V6E77HY0tYF_QIr2o9Ung/348s.jpg", "caption": "Red velvet pancake"}]}}, {"review": {"des": "To me Bongo Room is just okay, there are definitely other brunch spots in the city I prefer more. I've been to this location twice and Bongo Room in Wicker Park once, a long time ago. The most recent time I brunched here I ordered the breakfast burrito which was fine, but nothing to write home about. There was too much tortilla with no filling, and not enough salsa. It was good don't get me wrong, but I think my biggest gripe is that the menu is lackluster when it comes to the savory/veggie options. I know BR is known for their sweet stuff, but that's not really my thing for breakfast. If I can help it, I won't be returning as there are so many other brunch spots I like better.", "pics": null}}, {"review": {"des": "Came here for Sunday brunch. I wasn't really impressed honestly. Waited an hour for seating which was fine because it was prime time dining. The food was way overpriced. My mimosa was sooo overpriced for what seemed like a shot of it and heavy juice. My food was average. The breakfast potatoes really lacked flavor. I did try my friends lobster roll Benedict which was better than my croissant sandwich. Just don't see the hype.", "pics": null}}, {"review": {"des": "So I was excited to try this place because of all the great reviews. But honestly it was not the greatest . We ordered croissant sandwich and spinach omelette that was decent but not to die for and  the potatoes were overly seasoned and they serve very small portions . But for this place to be among the top 20 breakfast spots to visit in Chicago I mean . No , just no . The ambience is not even a good one it's just so blah and regular . it did nothing to me .", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cp-baSkgXymTkqI4vkpghA/168s.jpg", "caption": "Not memorable at all !!"}]}}, {"review": {"des": "OMG! I live in Michigan but would drive to Chicago every week to get these pancakes (white chocolate, caramel & pretzel) Reuben omelette was excellent, chicken sausage and orange juice. Service was great! Writing this has made me hungry!", "pics": null}}, {"review": {"des": "Very quick, if not super friendly, service. The food was all-around tasty. The breakfast potatoes were good.", "pics": null}}, {"review": {"des": "The wait is never that long. Food comes out fresh and fast. I order the white chocolate with Carmel pancakes with a side of maple chicken sausage. So delicious. There is on the street parking. The restaurant is small and seating is a little tight at times.", "pics": null}}, {"review": {"des": "Nice place for brunch with tasty, unique plates. My waitress Irene(or at least, that's what the name said on the receipt I got) was fantastic. My breakfast was great, and was brought out very quickly, NO complaints there. After eating my meal, I went to the restroom (1 person at a time) that was in a cramped space next  to an area that staff use to pick up orders etc. When I left the restroom to head out the main entrance I was not aware that one cannot walk through the passageway just outside the bathroom to get out--\"You have to go all the way around,\" as I was so rudely told (along with an annoying signal of his fingers) by a busser. Professional customer service goes a long way with me, even if it has more to do with adjunct staff, rather than my waiter/waitress. Originally was planning on coming back tomorrow for breakfast for some specialty pancakes but Yolk is an old faithful that I may revert back to...", "pics": null}}, {"review": {"des": "Coming in, I had such great expectations and after eating here I was just left disappointed and wanting something different for breakfast. I ordered the BLT Benedict and the bread was very soft and soggy. It was just your average Benedict with bacon. The potatoes were mushy and I felt like the entire meal didn't live up to the hype. If the meals costs less maybe I would feel like I got what I paid for, but that just wasn't the case. It was simply overhyped and overpriced. <br><br>I'll be heading to Meli Cafe instead for a more wholesome, savory brunch!", "pics": null}}, {"review": {"des": "Best dish is the BLT Benedict (available only for Brunch on weekends). Solid coffee. Avoid at peak business hours typically.", "pics": null}}, {"review": {"des": "OH MY ***...SWEET MOTHER <br><br>Chai latte you will want refill but won't be able to after the food coma you're about to undertake.<br>Split Lobster Roll Benedict and the chocolate French toast with my daughter and glad we split a savory and sweet.  IT WAS SO GOOD.  I will dream of this while we are back home.  <br>I will eat there next time I'm in Chicago.  Can I go now???<br>Go...eat...it's ok...unbutton that top button...all the cool kids are...", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1FBBhv9mtHEurAbsU5De6g/348s.jpg", "caption": "Breakfast burrito Average."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rRux2WxyMO1M4DpVP54k2w/168s.jpg", "caption": "Chocolate French toast with bananas and chocolate and chocolate and chocolate creamy numminess sauce"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/d8CPrYStL_DreLYp1g5aBA/168s.jpg", "caption": "Lobster roll eggs Benedict   Sooooooo good.  I can live without the potatoes."}]}}, {"review": {"des": "Really nice place for breakfast brunch. They have a good menu, plus a daily special menu.<br><br>Off the special menu, they had Lobster Benedict as well as a taco burrito.  The taco burrito is basically a taco with all the fillings inside of a large flour tortilla.<br><br>Not very good.  My only negative comments would be about service.  There was about a 20 minute wait for a table.  There is no waiting room area, so you either go outside or wait by the front door inside.<br><br>Servers would pass you and tell you to get out of the way.  The restrooms are in a bad location, right by the kitchen where the servers come out with trays. I was waiting for a restroom to open up, and several servers told me to move.  One server bumped into me with a tray.  There was actually about 3 feet to go around, but they insisted on going straight through me.  It felt very rude.<br><br>Also, at the table, they weren't very friendly.   Go for the food, it's good.  The service could be better.", "pics": null}}, {"review": {"des": "Food was good but nothing different or special that makes me want to recommend to other people. My boyfriend and I went around 10am on a Tuesday, no wait. Great and friendly service", "pics": null}}, {"review": {"des": "My second foodie adventure in Chicago and another must-have recommendation made by my friend. We came around 8:30am on Sat. and there was already a line going around the corner. Luckily, the restaurant is pretty roomy so we were able to be seated right when they opened! We had some coffee and we were happy it wasn't watered down. It's also re-fillable!<br><br>Berry Cheesecake Pancakes: Wow, that sauce!!! It wasn't overly sweet yet really brought out that berry flavor! However, the pancakes were a little too dense for my liking. I feel like they added some cake mix in there or something. I still loved how everything tasted together!<br><br>BLT Eggs Benedict: My friend texted me in ALL CAPS to tell me that I have to get this. Boy, was she right. I'm still dreaming of that basil pesto hollandaise...It was nothing I've ever tasted and blew my mind. It was perfectly creamy and paired with the perfectly poached egg made for a foodgasm moment in my mouth! Plus there was crispy bits of bacon under the egg..it can't get better than this! This dish also came with well-seasoned potatoes.<br><br>I really want to come back, I do, I do, I do! I'd just get that BLT again!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/99iUnN6Ad7U-gyEZoROdkg/348s.jpg", "caption": "Berry cheesecake pancakes"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aY6FSqkbD6RJHRpP_r_nyg/168s.jpg", "caption": "Tenderloin beef omelette"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cQQ4eN8894ijEQNZYZdrzQ/168s.jpg", "caption": "BLT eggs benedict"}]}}, {"review": {"des": "I love everything here. The breakfast burrito, the house potatoes and the pancakes are amazing. The staff is very welcoming especially one amazing waitress Adriana, she's so friendly, always smiling and recommends the best options on the menu. You cannot go wrong eating here. It is definitely a hidden gem!", "pics": null}}, {"review": {"des": "This is hands down my favorite breakfast place on the planet! The caramel white chocolate pretzel pancakes are incredible. My other favorite here is their breakfast burrito. They have so many awesome choices to pick from on the menu. It's right off of the Roosevelt stop so it's easy to get to. It's pretty easy to walk past though because they don't really have a big sign and the blinds are usually down, so just keep an eye out for it. There's usually a line though on weekends so it's not so much of a hidden secret haha.", "pics": null}}]}