{"name": "the-dearborn-chicago-2", "reviews": [{"review": {"des": "Fried chicken!<br>Fish& chips!<br>Highly recommend!<br>The only thing is fried chicken is a little bit sticky, you should ask more napkins or wet wipes.<br>Delicious!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3srnFU8Lt_LrWUnm40cg6w/348s.jpg", "caption": "Brilliant! Highly recommend fried chicken and fish&chips! You won't regret!"}]}}, {"review": {"des": "Went for lunch. Amazing ambiance in the bar area, with lots of natural light, mirrors, and windows. They had a live band playing very tasteful music with a bassist, guitarist, and a singer. There wasn't a long wait because the bar area (with tall round tables + bar seating) was almost immediately available. <br><br>I got the fish and chips which were delightfully crispy on the outside and super-tender on the inside. The fried batter was not heavy at all, but ultra-light and crispy, and the fish itself was very juicy and also tasted light and briney. The tartar sauce really made the dish - it had a sharper sour taste but was also very creamy. I felt like the heavier milk/cream taste really complemented the light taste of the fish. The side of seasoned fries was well cooked. <br><br>While the fish and chips ($18) was somewhat expensive, it was definitely worth it.", "pics": null}}, {"review": {"des": "Found this spot as we were headed to a concert at the Chicago theatre. Great food and great service. A bit pricey on drinks but, we are in Chicago. I tried the seasonal drink \"Let it Snow\" it was fabulous! Looked like Christmas and tasted like the holidays. My date had the Mac and cheese... Let's just say it was so good the sauce on the bowl was sopped up with my truffle fries.<br><br>Yum!<br><br>Oh and it doesn't hurt that my drink had a eco-friendly straw! <br><br>The only reason I didn't give it 5 stars is there weren't many vegetarian options so if you have special dieitary needs you may be limited to sides or salads.", "pics": null}}, {"review": {"des": "I recently stayed in Chicago for the first time in my adult life. I was very excited to try out a new city and new restaurants. Thankfully, we quickly stumbled upon the Dearborn. Even on a Wednesday around 6, the place was packed. Thankfully we were able to find seating at a bar table and ordered a drink and our meal almost right away. I got the seasonal gnocchi and a glass of wine. I am very glad I got to try something relatively unique and different from my usual order. The gnocchi was well seasoned in a buttery sauce. It was topped with  shaved parmesan microgreens and a variety of veggies. Just delicious. However, Chuck ordered a burger and now that was in my brain..... After our first meal, we set our sights on other restaurants while sightseeing. But the burger was calling me! <br><br>On our last night, we had gone out to a few bars and needed dinner before heading back to the hotel. It was very busy but we ordered two burgers to go. They were downright glorious. I don't have burgers all the time but this was really really tasty. It hit every savory taste bud and filled every craving. I was all about it. If I come back to Chicago, I would definitely return for a meal. They also have brunch but  we were leaving earlier on Saturday morning and would not be able to go.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oOjF79bUSwEQNyT1-F2Bxw/348s.jpg", "caption": "Gnocchi. Yum yum yum."}]}}, {"review": {"des": "Date night with our besties before the Jo Koy show on Saturday, 11/3. We loved everything about The Dearborn, from the decor, the staff, food and cocktails. Starting with the cocktails, I had Eleanor's Dagger, like 2 of them. If you like drinks with a bit of smoke, check it out. Hubby had the Noble Society - there is a gold leaf in the ice cube topped off with a smoked applewood chip. Whuh? Fancy stuff going on here at The Dearborn. Not only did these drinks taste amazing, the presentation was well done. Check out my photos :) <br><br>We tried 2 starters and I would order them again and again. The burrata was oh so good with the sweet miso vinaigrette and marinated beets. Equally delicious was the midwest fried chicken - crispy skin, juicy meat. As for the enhancements, definitely get the parmesan truffle fries and the creamed elote. Do yourselves a favor and skip the brussels sprouts. They were not crispy and tasted just OK. One other stand out was the potato-crusted walleye with black truffle..yummo!!<br><br>If you're looking for a new place to try out, you won't be disappointed. The knowledgeable, friendly staff, delicious food and drink will bring you back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JnKZpawEyGZZ7Vimj5eQFA/348s.jpg", "caption": "Check out the gold leaf block"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/X0PDMDU0So0XnkebNtZVzA/168s.jpg", "caption": "Noble Society on left & Eleanor's Dagger on right - both delicious"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qAKh_jLwCIqGsgatwuvY_Q/168s.jpg", "caption": "Dinner Menu 11/3/18"}]}}, {"review": {"des": "This place is absolutely adorable! It's located \"at\" Block 37, but not \"in\" Block 37. Let me explain. If you enter into the main part of Block 37, you know, where all the stores are... you will quickly become frustrated walking around Level 1 in circles and not finding this place although the map keeps showing it right besides Zara in Suite 100. What you have to do is keep walking past the main entrances, walk past Zara, and then you'll see a separate entrance for the Dearborn off of *gasp* Dearborn St & Randolph. *Facepalm* I'm sure I'm not the only person to have ever gotten confused by this (right?) so worth sharing. Hahaha.<br><br>I had already eaten dinner so met up with some friends to have drinks and dessert. I ordered the \"let it snow\" seasonal drink and the caramel apple churros. Both were FANTASTIC! The service was also impeccable. I will definitely be returning here. Street parking can be difficult to find, but easily accessible from the red line train.", "pics": null}}, {"review": {"des": "Arrived on time for our reservation but had to wait 15 minutes for our table to be vacant. No problem because they were very nice about it. <br><br>We got a little booth in the back and the atmosphere was busy, a little loud, but not irritatingly so. They had cute marigolds at the table and the restaurant itself was beautiful. Our waiter was very helpful and suggested some good dishes for us. <br><br>Food: <br><br>Grape and cranberry sorbet were very yummy! <br>Hot chocolate was ridiculous good. Decadent without being too much, ya know? <br><br>Pork belly-The pork belly was fine but fennel frisée salad was just drowning in the coconut broth and it was too much. The sauce wasn't good/light enough for all that. <br><br>House made cheddar and chive milk bread- Get it. Please get it. It's really good for sharing but trust me, you just want to eat it all yourself. It comes in a cast iron skillet with this glorious butter. Just get it. <br><br>Beef Bulgogi Fajitas-very filling, good flavor<br><br>Lavender Honey Duck- My husband didn't even really speak(or share) while eating it and he gave it a silent thumbs up which is a huge compliment. So idk, I'm going to trust him on this one. <br><br>Dearborn Burger-Great burger! Perfectly seasoned and cooked and the brioche was sup<br><br>Pacherri Mac n Cheese- very creamy and great comfort food dish", "pics": null}}, {"review": {"des": "Wow. Stumbled upon this gem while in Chicago with my girls. We attempted to go to another restaurant that was closed for a private event, but our luck Yelp led me here. <br><br>In true foodie fashion, and to raise my daughter in the correct way we ordered like crazy. The shrimp 'n' grits were amazing and a great portion as an appetizer. Great consistency, flavor and shrimp were large and plentiful. <br><br>For entrees I went with the signature Dearborn Burger with Bacon. OMG that bacon. My daughter got the Skirt Steak & Fries and the other a hamburger. The burger was massive, not only that it tasted great. The steak was nice and tender and well flavored. The only thing I didn't love were the fries. <br><br>Btw don't skip on the Housemade Cheddar & Chive Milk Bread. Mmmm, great to soak up the Shrimp and Grits sauce left behind. <br><br>Oh the serving was awesome. You know that fine line of chatty and personable, checking on you and leaving you alone. Our waiter had it. Completely attentive while invisible and even entertained my girls.  Great with food recommendation and even recommended the homemade sodas that were great as well. <br><br>For dessert, I mean we are foodies on vacation, we had the Peanut Butter Chocolate Dream...it truly was dreamy. Only needed one more scoop of ice cream, but was fantastic nonetheless.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WN8DLiexQibe2c-2l2dKBQ/168s.jpg", "caption": "Skirt Steak and Fries"}]}}, {"review": {"des": "* 3.5 stars * Just going to get right into it. <br><br>Ambiance: Beautiful like the pictures. Well-lit and classy restaurant. Loved how the bar looks, and a lot of interesting light fixtures throughout the restaurant. <br><br>Service: It was good the moment we stepped inside. We were greeted promptly and everyone had a smile on their face, looking pleased to be working there. Our waiter was good. At first when we asked for a few more minutes for the menu and then were ready to order, I saw him going to all these different tables. It took him a while to get back to us. Throughout the meal it became better. He asked about our meal and after the initial slowness, the service sped up. <br><br>Food: K and T started off with the cantaloupe soda and calamansi juice. The calamansi was very citrusy, as expected, but they both liked the cantaloupe better. They shared the shrimp and grits and enjoyed it (4/5) even though they found it a bit salty. We split the truffle and parm fries. I found these to be very good (5/5). I'm so in love with truffle! Haha. I wish there were more though.<br> <br>K and I each ordered the Cheddar-Bacon Cornbread Waffles. We both liked it but I thought it was too savory. There was too much gravy and it was pretty heavy being a cornbread waffle (3.5/5). The buffalo chicken on the side was also an odd pink color for the breading and the gravy color was unappetizing. Interesting flavor though. <br>T had the Dearborn burger. She said she liked the waffles better but she isn't much of a burger person, so I was surprised she ordered that (3.5/5). I think I would've liked it more. <br><br>It was nice to try this place but I don't think I will be coming back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lkd4POG6D-LS2jkG1V3nqQ/348s.jpg", "caption": "The The Dearborn Burger"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/piKlafH17TYiI7IM6QuFpA/168s.jpg", "caption": "One side of the interior"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/f-zSnj6kopiJkK2zuD9uHw/168s.jpg", "caption": "Cheddar-Bacon Cornbread Waffle"}]}}, {"review": {"des": "Review #700 for me. Many thanks to our tour guide of Flavor (aka waiter) Victor! He was right about all his suggestions. We were so sad we were stuffed with delicious food because we had to decline dessert. <br><br>The service is excellent across the board. The ambiance was classic. The food was excellent. The young woman checking us in to be seated was very friendly. <br><br>The Moroccan rabbit tagine was incredible with its hints of sweetness and less than subtle spiciness!! They make their pita bread in house too which pairs so well for dipping into the tagine with the chickpeas. <br><br>The burger is clearly made with quality beef. Loved the aioli that came for dipping with the fries. <br><br>The Mac n cheese was just so clever and different. The Brussels sprouts were crispy and cooked very well. <br><br>We didn't try any of the drinks but the non-alcoholic mango and guava ginger beers were delicious. <br><br>All in all, a great experience. The food can run between 3.5 (the heirloom carrot salad was the<br>only one I felt was 3.5) to 5 stars depending on your tastebuds. <br><br>Lots of different and unique choices for dinner. The menu changes quite a bit according to Victor so I look forward to my next visit. <br><br>Thanks so much to the Dearborn, Victor, and Team for a great night.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1esmtiv4CGPImy7qm97G2Q/348s.jpg", "caption": "Mashed Potatoes with the sauce from the rabbit tagine. So good together. We just thought of combining them since they were both delicious"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/q8gr-M8_2g9xndtUalgwnA/168s.jpg", "caption": "The Dearborn Burger"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WX7d6oZq-6teZG2DctC1Iw/168s.jpg", "caption": "The Dearborn Burger 4 stars"}]}}, {"review": {"des": "Good service, good food.  Our hotel recommended this place which was great. Fast service. Our server was amazing. Unfortunately forgot his name. He was tall grey hair young and full of energy. <br>We had hamburgers with fries. Delicious! Also heirloom salad. <br>The day after we went back for lunch on Saturday around 2:45 the hostess was not really patient . <br>We asked couple questions about the menu, she was frustrated. <br>Anyway highly recommended. All staff were well trained. <br><br>The icecream was delicious too.", "pics": null}}, {"review": {"des": "For a restaurant with so many five-star reviews, I was underwhelmed with The Dearborn. <br><br>The restaurant has a distinct old-school feel with red booths and ornate wall decor. Everything feels so cozy! The only problem? Seating was a bit too cozy. I struggled to eat with my right arm constantly bumping up against the wall to my right and ended up holding my plate to eat. Awkward. Our server was amazing at the beginning, explaining the menu and so consciously recognizing allergies. However, once our food arrived, he completely disappeared. We had to flag him down for drink refills, and getting our check was a task. <br><br>The food itself would have been rave-worthy at lower prices. My burger (without a bun to be gluten free) and accompanying Parmesan truffle fries were so so good. But at $16 with mixed service and a cramped environment? I wasn't totally in love. Chicago has so many burgers! All the other menu items were $30+, which seemed a bit obscene. And we ordered the elote to share, but it was warm corn, nothing more. <br><br>Will I be back? Probably not. Yes, The Dearborn serves its purpose. But even given the Loop's limited restaurants, The Dearborn has too many flaws to be a stand out.", "pics": null}}, {"review": {"des": "Went here for their Speak Easy and Sip Gin party, which was their launch party for their new Dearborn Gin, a collaboration with North Shore Distillery.<br><br>We enjoyed cocktails and horderves, live music by Brooklyn Britches and the Whispers, roaring 20's dancers and a troupe of vaudeville performers.<br><br>The shrimp cocktails were amazing and huge! The sliders, deviled eggs, and especially the frozen Dearborn Gin bar.<br><br>They have a really nice selection of wines as well their new Dearborn Gin that compliments their great food.<br><br>They have a great jazz brunch with music by Brooklyn Britches, you should check it out!<br><br>They really need to change their signage, it is practically non-existent, in fact, if you did not know that it was here, it would be very easy to walk right on by.", "pics": null}}, {"review": {"des": "I went here for lunch on a Wednesday at 1:30.  The dining area was maxed out; I couldn't even get a seat for 1.  There were plenty of seats in the bar area, but slow service, and they got the order wrong anyway.  Plus, Yelp lists this as a $$ establishment.  That's not even true for the lunch menu.  If you want lunch and a drink, it'll be at least $$$.  If you want dinner, it'll be $$$$, according to their menu.", "pics": null}}, {"review": {"des": "The interior is nice. The lighting makes it feel warm, cozy, and inviting on a cold Chicago winter evening, without being too dim/dark. Came here with a girlfriend. We made a reservation on opentable for 715 on a Friday night. Got promptly seated in a booth that was off to the side of the main dining area, so it was secluded and quiet. The service was wonderful. The waiter gave us good recommendations on both drinks and food. <br><br>Drinks: <br>I tried the flawless cocktail and liked it so much that I got two of them. It has-- four roses yellow label bourbon, magnolia tea syrup, giffard blackberry, suze gentiane, lemon, vanilla bitters. Served with a cute straw. I also got the azteca old fashioned which was also good. My friend had the Eleanor's dagger since she read good things about it on yelp. I'm personally not very into the Smokey mezcal taste so it wasn't my kind of drink. She also had the let it snow cocktail which is a twist on a Moscow mule but made with whiskey if I recall correctly. The cocktails were $14 each<br><br>Food:<br>We split two entrees and two sides. Our waiter told us that the Dearborn is known for their seafood and that his two favorite dishes were the walleye and the scallops, so that's what we got! The potato crusted walleye & manilla clams dish ($34) had housemade Parmesan, gnocchi, all of the mushrooms, kale, corn, baby carrots, black truffle and Chardonnay sauce. Doesn't that sound amazing?? The potatoes on the walleye added a unique texture to it; also very tasty! I lovedddd all the mushrooms that came with this dish. The day boat scallops ($35) came with sweet corn and truffle mousse, roasted tri-colored cauliflower, pancetta, lemon-caper beurre blanc, and crispy red tuile. The scallops themselves were yummy but I was less a fan of the accompaniments on this dish as compared to the walleye. For the sides, we got the Brussels sprouts and Parmesan truffle fries ($10 each). Both were decent but nothing special. This was the perfect amount of food for us two ladies. We were too full for dessert though <br><br>After dinner, we took a nice short stroll to millennium park to see the Christmas tree :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KQ4AeeBDrjf4cV4nagfGXQ/348s.jpg", "caption": "Day boat scallops"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/azQB21wBRL930NP6GpUydw/168s.jpg", "caption": "Potato crusted walleye"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/P8R7VpRXiV4DKnLlhvbhGw/168s.jpg", "caption": "Flawless (left) and Eleanor's dagger (right)"}]}}, {"review": {"des": "I was here at the changeover time between 3:30-4pm, so this review is a little skewed...<br><br>I was given a lunch menu and sat at a high top in the bar while waiting for a friend. The menu has lots of sandwiches to choose from and I had my heart set on the Veggie Dagwood: a sandwich filled with cucumber, dill, parsley, avocado, alfalfa sprouts, peppadew peppers, chili aioli, a balsamic vinaigrette, in whole grain bread. Just imagining this was making my mouth water :)<br><br>When my friend arrived at 4pm, he decided to get the Dearborn Burger, but when I tried to order the Veggie Dagwood, I was told it was no longer available because the night shift had started. I was confused as to why I wasn't told earlier, but I didn't want a heavy meal, so we just shared the frog legs appetizer and my friend had his burger to go - we went elsewhere to find a sandwich for me.<br><br>The Korean fried Frog Legs were perfectly portioned, lightly pan fried, and covered in a spicy sauce full of flavor. The meat was tender, plump, and mild enough to balance the spicy sauce without being overwhelmed. <br><br>The Dearborn Burger was a double-patty wagyu burger topped with wisconsin cheddar cheese, boston bibb lettuce, sliced dill pickle pieces, special sauce on a brioche bun. It was a fantastic burger!! It tasted like a backyard BBQ party burger!! So juicy and stacked! Loved it.<br><br>I'll be back to get that Veggie Dagwood <br>-----<br><br>4/12/18<br><br>Stopped here for dinner and we had such a Great time! My friend Tyler and I split some items before going to the theatre and there was more than enough food :)<br><br>'Not Billy's Scotch Egg' was phenomenal! Such great flavor and it was very large! <br><br>'Parmesan Truffle Fries' were crispy and seasoned well! <br><br>I think we enjoyed the Steal the most! It was cooked perfectly and the sauce was so Succulent. <br><br>I have had lunch and dinner here and it's been Wonderful!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DUN_rg9zjjITQ2u2yf3L0g/348s.jpg", "caption": "One of the Best Scotch Eggs I have ever Had!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/L-S5y8OOGm2DRtHIwf5lfw/168s.jpg", "caption": "Truffle Fries"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/v8EsfvmawLxSRn1pt7kuYg/168s.jpg", "caption": "Steak steak steak :)"}]}}, {"review": {"des": "We dropped by for dinner on a Saturday night and were seated in the back where it was secluded and quieter. <br><br>Started off with the scotch egg, fried chicken, and cheddar & chive milk bread. Scotch egg has a perfectly runny egg on the inside wrapped with crispy, spicy pork sausage. The fried chicken has a delightful crust that is crispy yet not too thick and over battered. The hot sauce wasn't hot at all. The cheddar & chive milk bread is so soft and appetizing. <br><br>My entree was the dearborn burger, which had 2 thick patties with melted cheddar cheese, special sauce, and a sauce of fries. This was one hefty burger that was extremely filling.<br><br>Strawberry churro and key lime pie cheesecake dessert. The strawberry churro was amazing. The churro is so fluffy and paired well with the strawberry ice cream. The key lime pie was not too limey and had a nice firm crust<br><br>Great service here and food came out fairly quickly.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WElZYQibnoZ_pcREVZtR_Q/348s.jpg", "caption": "Strawberry churro"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hbQ-ZkajbmG7O27jO0CTYA/168s.jpg", "caption": "Key lime pie"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Eywv3KiejS5wERcqMsmGKQ/168s.jpg", "caption": "Dearborn burger"}]}}, {"review": {"des": "Super cool ambiance and great location to the play we were seeing on a Sunday afternoon.  Glad I booked reservations ahead of time.<br><br>Service was very friendly, and for Sunday brunch they had a live trio.  Played great music.<br><br>The menu is so similar to the Roanoke just down the way.  So similar I laughed looking at it.  Great food options and perfect for a foodie.<br><br>I had the mushroom omelet and my friend had the quiche.  Both were very good. <br><br>I had ordered a side of toast that never came; I didn't need it or missed it, but they did forget it.<br><br>Our server was very apologetic about the miss and she was a total delight!<br><br>Would definitely come back here again!", "pics": null}}, {"review": {"des": "Of all the places that I have eaten in Chicago over the past 3 years, this has been my favorite. Just as an FYI I use Eater to guide my dining locations.  <br><br>There were so many great food options.  So we chose to load up on the smaller plates and share it with three people.  Or waiter took the time to put the order in a little at a time as to pace the meal.  He even waited to the end to make sure we had room for the last item before he put in the order.  Gratefully to him, we did not have room and canceled that item.  <br><br>What did I learn today?  Not only is it the best meal in Chicago, the price was lower than most other meals.", "pics": null}}, {"review": {"des": "The food was decent but not great. Like Marq down the street, this place mosty attracts the business lunch crowd and serves busness-lunchy food. I had the steak with fries, and it was very little steak (which actually was delicious) and a ton of fries - wrong portioning. The milk bread was good, though.", "pics": null}}, {"review": {"des": "Fantastic!  Has a cool, old time vibe, with a very large bar and lots of seating.  <br>Stopped in here with my fiance for a late lunch and a cocktail.  Walked right in and sat at the bar, the bartender was attentive and explained the menu to us.  We split the Veggie Dagwood and fries, it was really tasty.   Even tried the old fashion with the infused whiskey of the day!  Such a cool place with great food and cocktails.", "pics": null}}, {"review": {"des": "I've been to the Dearborn twice more since my initial review, once for lunch and another time for dinner.  Lunch was excellent and I was ready to bump up to 5 stars, but then dinner was very disappointing in terms of both food and service.<br><br>At lunch I ordered the gnocchi (English peas, broccolini, chanterelle mushrooms, asparagus, fresh corn, kale, brown butter).  I was dining with a new colleague so I couldn't gush over how delicious my meal was, but it was really good.  The server described it as filling, but not too heavy and he was exactly right.  Service at lunch was great -- he didn't hover but was around often enough and brought the check promptly.  I was very happy with my experience.<br><br>I was so happy that I didn't complain when a friend asked to have dinner at the Dearborn a few days later.  I was tempted to order the gnocchi again but decided to have the burger because I remembered loving it.  Not so much this time -- the burger was good, but not as tasty as I recalled.  It didn't help that my fries came out lukewarm.  Service for dinner was quite meh.  I had to ask to have my water refilled after we were there for almost an hour, and I don't think we were ever asked whether our entrees were acceptable.<br><br>I probably will come back at some point but with less enthusiasm.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WarRgjCrZNLOmNcwJbBBBw/168s.jpg", "caption": "Burger and fries"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pmXXnCk0Y09w0XtsDO3yaw/168s.jpg", "caption": "Gnocchi"}]}}, {"review": {"des": "My wife and I dined here last night. We really enjoyed everything. The decor, atmosphere and seating are upscale but also comfortable and not at all pretentious. The service follows suit perfectly. The staff are all really nice, helpful and took really good care of us. We started with the shrimp and octopus ceviche. The ceviche was really nice, super tender octopus, perfectly cooked shrimp, bits of orange, avocado, pickled onion, fennel and cilantro, delicious. I had the scallops with cauliflower, cream corn and a lemon beurre blanc, again perfectly cooked and delicious. My wife had the walleye with baby clams, chardonnay sauce and root veggies, potatoes, carrots and turnips, also yummy. I got a side of Brussel sprouts, nicely charred and sprinkled with parm cheese.<br><br>We tied it all together with a nice California veltliner, which paired well with the seafood. Finally, we finished off the meal with their apple, almond crostada, which was a nice sweet bite.<br>I definitely recommend this place, it makes me wish I lived in Chicago.", "pics": null}}, {"review": {"des": "Been meaning to try out The Dearborn forever, so when a friend was in town visiting, it was the perfect excuse! We came in for a late Saturday night dinner, and luckily able to be seated right away. The space is beautiful, and when the weather is nice they have big windows that open up (love that!). We were also fortunate enough to snag an awesome server, which made the night a fun and pleasant experience. <br><br>My only complaint is really the price - I know, I know, very typical but hear me out! The oysters were $34 (for a dozen) and while good, hard to justify when there are so many good oysters for half or even a third that price around Chicago. Actually, there are a lot of $1 oyster happy hour deals currently: <a href=\"/redir?url=https%3A%2F%2Fwww.google.com%2Famp%2Fs%2Fchicago.eater.com%2Fplatform%2Famp%2Fmaps%2Fbest-oysters-deals-in-chicago-1&s=c7c167981416b10ccf0be7b3c4e1c99c329310e427e6cbdf6ce495787dfb1a99\" target=\"_blank\" rel=\"nofollow\">google.com/amp/s/chicago…</a><br><br>But I digress. We also ordered the shrimp taco starter and grilled octopus starter to share. Both mouth-watering good. My first cocktail was forgettable but the Azteca old fashioned? Wow. Phenomenal. I would come back just for that drink.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0xBWG9McgUllBylLk42geA/348s.jpg", "caption": "Grilled octopus starter"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/myyfileP1t80dGp-rRpDFw/168s.jpg", "caption": "Oysters"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2UYyGFaCckIxw-jqu9ISUg/168s.jpg", "caption": "Cocktail Menu - June 2018"}]}}, {"review": {"des": "I must say, my experience did not start out very well.  I was with a 9 person group.  We had a reservation for 7:30 and it was past 8 PM before our table was ready.  We had drinks in the bar while we waited, but it was a long wait.<br><br>The rest of the experience was fantastic.  Service was wonderful.  Our waiter was friendly and knowledgeable about the menu.  He made great recommendations.  And the food was especially good.  More on that below.<br><br>The table started out with two of the cheese board, which was a special and consisted of a creamy goat cheese, honey, figs, nuts and apples or pears (can't remember which) as well as crackers.  So delicious.  I had the duck, at our waiter's recommendation and he did not steer me wrong.  Duck sometimes tastes gamey, but he explained that this was a hybrid duck that had more depth to the flavor.  In any event, it was so rich tasting and I loved the marinade/rub that it was prepared with.   Others at my table had the french onion soup, which looked so good, and the rib eye and burger.  Everyone was pleased with their food.  We also had some of the truffle fries, which were (of course) excellent.<br><br>Overall, I'd be happy to come back, especially if someone else is paying!", "pics": null}}, {"review": {"des": "We stopped by the other day for lunch. We were warmly greeted and our waitress was really nice. The manager even stopped by our table and was a really nice guy.<br><br>It is really cute inside but it suffers from acoustics. I shouldn't have to listen to every table in my vicinity (use your \"indoor\" voice two tables away \"Mr. trying to impress date\" & is obviously an alcoholic as boozy experiences are all he discusses.) and not be able to hear my dining companion who is directly across from me. I also don't like how close the tables are. You will get someones behind in your face as they try to sit or get up.<br><br>Now I know a Dagwood named sandwich implies a rather tall & stuffed sandwich. The Dagwood Veggie sandwich has veggies, unfortunately the fore mentioned veggies mainly consist of lettuce... sooooo much lettuce. I   also would have hoped for less bread as it was super thick bread. <br><br>I did really like the fries and the sauce that came with the sandwich.", "pics": null}}, {"review": {"des": "I loved my salad with duck confit, yes, but I'm not too fond of the way in which the servers and bills alike are so insistent upon reminding the guest that tips are considered important. (I'm not an idiot; I tip well and -- gasp!) know how and when to tip.<br><br>A little pricey and dressy, sure, but well worth every bite.<br><br>And the atmosphere? Beautiful -- simply beautiful. (Sometimes I don't give two sh*ts about ambience, but sometimes it's very important to me.)<br><br>We'll return on our next trip \"out West,\" but I'll just bite my lip and be polite next time a server reminds me about gratuities.<br><br>Four stars with room for improvement in that one little area.", "pics": null}}, {"review": {"des": "No, this is not really a special occasion spot.  But you're in the loop an want a really good burger, fries, even fried chicken, check out The Dearborn.<br><br>The chefs get the burger right each time. It's juicy, and a small upgrade can get truffle fries too.  <br><br>The maple and mustard chicken is delicious, but the sweetness can get overwhelming for some.  Just drizzle the hot sauce over it to add some heat.   Make the app an entree for yourself (like I did) with those outstanding mashed potatoes.<br><br>The standout with both of my visits has been the service!   The servers have been excellent and attentive.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EwrFIlsETXkrPVXRI-lkaQ/348s.jpg", "caption": "My straws...."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zZ7Vw0GET47lG9NB6Ix8fA/168s.jpg", "caption": "One dining room...."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NtS0FDN9os-ZnGkmrE2bpA/168s.jpg", "caption": "This Midwest Fried Chicken....YEs!  It's a bit sweet."}]}}, {"review": {"des": "Really friendly staff (at least the ones I talked to), great apps, cool atmosphere, and they definitely put time into their mixed drinks.<br><br>We stopped in for a post theater drink and it ended up exceeding our expectations, especially the bartenders, who I sort of expected would be unfriendly or annoyed to be there considering the neighborhood and day, guessing that they mostly get tourists on weekends, but they were friendly and willing to chat with you about the menu and I never felt rushed to get out of there.", "pics": null}}, {"review": {"des": "Have a decent time at the Dearborn. The food is decent and has a nice flavor profile no matter what you order. I stopped in there for drinks before going to see a Broadway in Chicago show. Had a couple tasty drinks one was a yummy jalapeño infused vodka cocktail. Another was a sweet kind of daiquiri sort of drink that was boozy to. Or french fries were truffle oil fries with Parmesan cheese. Yum! We also have a mozzarella and heirloom tomato appetizer where the mozzarella spread like a luscious cheese on Texas toast. Very satisfying as well. The staff was friendly and very courteous and wanting to make us happy. Check out the Dearborn!", "pics": null}}, {"review": {"des": "5 STAR SERVICE! 5 STAR FOOD!!<br><br>It is such an amazing feeling to feel you as the guest is an establishments priority. We found this gem on YELP while driving to Chicago to catch a flight but decided to dine in downtown Chicago first. <br><br>We parked and had a difficult time finding the restaurant. That would be my ONLY concern. I wish the signage from the street was larger. <br><br>The Dearborn had top notch decor, yet was inviting and casual. It was classy, hip, modern and charming. Michael was our server. He was SO attentive, kind and knowledgeable. I told him my dietary concerns and he made suggestions. He was very relatable to my teenage sons as well. I ordered the Local Fresh Farm salad and the boys the Dearborn burger with cheese and bacon. My salad was so fresh and bursting with flavor. We all had fresh cut fries on the side and  I could tell they were freshly cut, not frozen previously. Our water was refreshed immediately and we drink a LOT of water. <br><br>The manager Greg came by to check on us and I mentioned our difficulty finding the restaurant and was disappointed we were parked in a garage they don't comp. He surprised us at the end of our meal with dessert as a warm gesture. <br><br>You can NOT go wrong with The Dearborn. It's not your typical burger spot. Thought went into every detail and I cannot wait to return while in Chicago. <br><br>Tip: they have an extensive wine collection! We just don't drink.<br><br>Thank you.", "pics": null}}, {"review": {"des": "Overrated, overpriced and I'm just over their attitude. <br><br>The whole experience, which had its positives and negatives was ruined by the waiter trying to force us out after just 45-50 minutes. This was extremely ridiculous considering <br><br>a.) the two of us ordered two entrees and three drinks between us<br>b.) we booked through Open Table an hour and a half time slot. <br><br>It's just a basic expectation that if you go out to dinner, you'll be given at least an hour, hour-fifteen to hang out, but this waiter once he put the check down, kept looking over to see if we paid it, he did it almost every 45 seconds. <br><br>He was a nice, but obviously his being nice was as phony as it gets. The Dearborn has its good points, sure, but one loses sight of that due to their arrogant, condescending attitude. It's very pricy and they seem to think kind of highly about themselves. <br><br>Once was plenty enough. Never going back.", "pics": null}}, {"review": {"des": "We checked in for lunch on a Saturday and we were made to feel welcome. The pint of Guinness is the best in town, we heard, and it did not disappoint. Selection of liquors good too, more Irish whiskey preferred, this place is supposed to be owned by an Irishman... <br>the buffalo chicken sandwich and huevos rancheros were very good indeed, a nice sizable portion and really nicely seasoned. Good fries.<br>It is on the expensive side but probably no more so than the rest of downtown Chicago. The vibe is upmarket, lots of people hanging out before catching the matinee at a local theatre, it is really beautiful and varied inside with bar seats, tables and hidden semi-curved seats. Definitely worth checking out again.", "pics": null}}, {"review": {"des": "Solid brunch place, excellent cocktails, extensive whiskey selection, and above and beyond friendly service!<br><br>They take reservations, so it's  a good idea to make one in advance - make sure the whole party is there to get your seats. The  decor was industrial and lodgey at the same time, and it felt really bright. I thought the liquor shelf was impressive looking and the cocktail options were scrawled on the blackboards by the shelves. It was close enough to noon so I started with the E's Azteca old fashioned - Egan's 8 year whiskey with azetca chocolate bitters, delicious and beautifully garnished with a slice of orange!<br><br>At our table, we had a few difficult food allergies and our server was extremely emphatic and attentive to noting those allergies and offering alternative options to the menu items. I ordered the Chanterelle and fontina omelette in a sad effort to be somewhat healthier and stared longingly at the French toast and fried chicken that others in my party ordered for their entrees. I was not disappointed with my dish, I thought the omelette was really good, savory and earthy from the mushrooms and the home fries were cooked perfectly and seasoned well. As a surprise they brought out an assortment of desserts as a birthday treat that really made the meal memorable.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dZIxjbYCfhrvz-jy-gYvzw/168s.jpg", "caption": "Birthday dessert"}]}}, {"review": {"des": "OMG<br>First time in Chicago and we picked the best restaurant they have to offer. Food was AMAZING!<br>Waiter was exceptional. Also provided desert on the house that was great.", "pics": null}}, {"review": {"des": "Perfect for lunch! <br><br>Ferris Bueller's dad would've come here if The Dearborn was standing in 1983. <br><br>I came with friends to hit some burgers on three occasions. Tried Cesar salad with grilled salmon once. Quality of food ranged from 4.0000079 stars to 4.6668987 stars. Their burgers are happy and very good. Salmon was a little sad and on the dryish side.<br><br>Interior is so chic and classic -like in the movies. I LOVE their bathrooms, napkins, soap and hand lotions! So clean and classy. I would come back here just to go to the bathroom and enjoy the fragrance of the soap and those lovely napkins. They're so perfect to write poems calligraphy on. Especially after destroying a glorious burger. Alex Ay said they have the best margaritas in town.", "pics": null}}, {"review": {"des": "I've eaten at good restaurants and dives around the world. This has to be one of the better food experiences of my life. It's the whole package, great drinks, great service, and great food.<br><br>I started with the Daley Manahatten, which was made from fruit infused Knob Creek bourbon, which is infused with this incredible mechanism on the bar. It was smooth and flavorful without being overpowered by fruit flavors.<br><br>As an appetizer, I reccomend the Scotch Egg. Mine was perfectly cooked with a medium soft center. The sausage was spicy and the breading flavorful without being greasy. The whole thing was topped with a spicy mustard drizzle.<br><br>For my dinner I selected fish and chips. A utilitarian choice for sure, but a dish that I have had from London, Dublin, and across the US. In this case it was perfect and flakey with a flavorful breading. The \"chips\" were twice fried and far from an overlooked accoutrements.<br><br>This is a solid, moderately priced choice, that pays attention to the details, even on the simple dishes.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ogYhz2m_wjKAo7iva3EL9Q/348s.jpg", "caption": "The bourbon infusion apparatus"}]}}, {"review": {"des": "The food was pretty darn good! Huge portions and a terrific cocktails. <br><br>Our server might have been having an off day but he didn't seem to care much about his tables. He was a bit crabby. I would be too if I had to deal with the clientele that were in the place. <br><br>If you want to dine in a crowded but aesthetically pleasing restaurant surrounded by the worst people you could imagine, this place is for you!", "pics": null}}, {"review": {"des": "Came here for dinner to meet a friend. Sat on one of high bar tables while waiting. Ordered the pork belly, octopus and quail with foie gras and house gin and tonic to start with. All the food came out quickly and at the same time. My favorite was the octopus. Nicely fried that's crispy on the outside and tender inside. Service was friendly and fast. Ambiance was fun. Kitchen is open until 11. Love the double doors that open by the bar. I will definitely be back. Trust!!", "pics": null}}, {"review": {"des": "Extremely delicious and high class place. My husband ordered the scallops and said they were the best scallops he's eaten. I ordered the walleye and clams, every component of the dish was delicious and well thought out! We really enjoyed the hand crafted sodas as well. Will be recommending this place to anyone who is planning on visiting Chicago!", "pics": null}}, {"review": {"des": "Everything was so tasty!!! Two of us shared the fried chicken appetizer as a meal. No, we are not skinny models trying to \"eat lite.\" This is only called an appetizer because it doesn't come with sides, but it comes with four pieces of chicken! This ain't your mamma's fried chicken. It has a sweet demiglaze drizzled over it with extra to soak up from the pan. My tastebuds were so incredibly happy, but wait...there's more. We also shared a side of mac and cheese, and although I figured it would not be typical, I was really happy with what showed up. I mean REALLY happy. Another explosion of happiness in every bite. The only problem was I could have easily stuffed my face with another order, and believe me...I don't need it. <br><br>My better half had fish and chips, which she enjoyed, and our other 90 lb. dining companion had the burger. A massive double patty, gooey, masterpiece (see photo). <br><br>Next time I'm in Chicago I'll make this a stop fo sure.", "pics": null}}, {"review": {"des": "Bottom Line:  Quality, comforting food, friendly service and cozy rustic decor.<br><br>Thanks to Yelp my husband and I found The Dearborn, located in the Theater District. We chose the Dearborn because we could get a quality dinner in a nice atmosphere while wearing casual clothing. <br><br>Our waiter was friendly and recommended the Duck Confit appetizer as an entree.  My husband enjoyed that while I filled up on the large, juicy hamburger.  Of all the food we ate in Chicago he said that was his best meal. Regarding my burger, I really enjoyed the contrast of the crispy pickles with the tender patties (yep, two burger patties!) and bun.<br><br>They menu is full of interesting craft cocktails but we skipped those and worked on rehydrating after a warm, sunny and dry day. <br><br>Although we were dressed casually many patrons were looking lovely in their theater-going attire.  It's nice to go to a restaurant where you fit in whether you're dressed casually or in your finery. <br><br>The decor here is cool.  Kinda rustic industrial but still warm and cozy.  The walls feature huge historic photos of Chicago so that is a nice touch.<br><br>We enjoyed our dinner experience so much that we returned a few days later for lunch. <br><br>I would definitely return to The Dearborn when I'm back in town.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6xt9owHL57d8x_FsxHLN1w/348s.jpg", "caption": "Melt in Your Mouth Bread"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uqNF7vjIF0FQjJGSDIxhBw/168s.jpg", "caption": "Duck Confit appetizer is big enough for an entry."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6LlHCGodpEhyGZCrIMETmA/168s.jpg", "caption": "Super decadent and amazing - The Dearborn Burger"}]}}, {"review": {"des": "This was a weird meal. It wasn't bad, but wasn't great in terms of service. We were sat at a table right next to the kitchen, so that's not ideal when you can see the servers hanging out in the galley chatting it up. I like a good view of the chef cooking, but it's not a kitchen meant to be seen. <br><br>Our server was super nice, but things just kept going wrong. We ordered and our oyster appetizer came out at the same time as one of our main dishes. He took the dish back, but I swear he just set it back there because all our main dishes came out pretty fast after. The chefs were on the ball with their fast preparation though!<br><br>So a couple of us ordered scallops and another couple ordered the gnocchi. I really liked my scallops. It came with sweet corn & truffle mousse, roasted tri-colored cauliflower, pancetta, lemon-caper beurre blanc and a crispy red tuile. The whole dish was super flavorful and the scallops were seared perfectly. <br><br>Everyone who got the gnocchi dish complained about how salty it was, but my one friend just couldn't take all the salt and politely asked for another dish of the gnocchi. The server was super nice and went to put in an order. He came back and presented her another dish quickly, and said he just grabbed another persons order that was up first. Bad move. <br><br>Not sure if it was the server or chefs idea. Why not make a fresh dish that was less salted? So she got the next dish and it was still too much. I want to note our server was still super patient and nice, so he got a totally different dish for my friend and it worked better. I just didn't think the whole thing was handled correctly, and just plain disjointed service. <br><br>The space is beautiful and I do believe it's a good restaurant and my dish was great, just a couple minor things they could work on.", "pics": null}}, {"review": {"des": "Went for quick dinner of burgers and fries chicken.  Both good but that chicken!!!!!!  Get the chicken.<br>Atmosphere is great, staff helpful and the bar menu is awesome.  Get the chicken.  <br>Burger was delicious and a double!!  So good.  Get the chicken.<br>Wedge salad was also to die for!  Get the chicken.<br>My dinner mate got the chicken and thankfully I got to try that too.  I may have asked to lick the plate.<br>P.S.  get the chicken!", "pics": null}}, {"review": {"des": "Came here on a Saturday night and it wasn't terribly busy. The mood of the place was kind of romantic. Our waiter was very nice and the food came out fast. Ordered the fish and chips and the wedge salad and the chive milk bun. The milk bun was soft and flavorful and I loved the butter. The fish was very crisp yet light and airy on the inside and had a good flavor. The fries were good too. As far as the wedge salad, it had so much blue cheese and bacon and was filling on its own. Just a word of warning (because I was caught off guard). The menu is pretty small and a lot of the food you see in Yelp pictures are not going to be available. Not sure if they're seasonal or only available at specific times of day.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2T78nyrcQ-zLhxfXOevqWQ/348s.jpg", "caption": "Wedge salad"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zwfwO5ckNxfggq0Z9hj4Xg/168s.jpg", "caption": "Fish and chips"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TawCkzFBQtlijnbhwA5z1g/168s.jpg", "caption": "Chive milk bun"}]}}, {"review": {"des": "Amazing food and service.  Came here for dinner on a Saturday with a reservation.  We were seated with no issue and unexpectedly got a booth for just 2 people which was great.  The food came out surprisingly quick for the style of restaurant.  <br><br>We had the ceviche which had an interesting spin on it, definitely not your traditional ceviche, but very satisfying and tasty.  We also had the creamed elote which was pretty tasty with the fresh and super sweet corn.  For my entree, I had the special at the time which was a lobster and salmon ravioli, it was amazing.  It was incredibly unique and I was so glad I went with it.  If only it became a regular item.  For dessert, we had the strawberry churros since they were so heavily talked about.  Honestly, I would have to say that it was the most disappointing dish.  It wasn't bad, but it just wasn't as memorable as the other dishes.<br><br>Overall, this place was excellent.  Everything about it made for a great and memorable experience.  I really look forward to coming back in the future, next time I'm in Chicago.", "pics": null}}, {"review": {"des": "Came for brunch and the place was super packed. Loved the music they were playing and there was also a live band which we missed by a few minutes.<br>Fried Chicken was awesome!", "pics": null}}, {"review": {"des": "I had the rabbit tajine and it was delicious. I must say tajine is better with lamb but this one with rabbit was great too. I had dinner at the bar and I checked the people eating on both sides and their plates looked delicious too (they confirmed it too - LoL). <br>Also not to forget they had a great selection of wines from almost all grape types. Definitely a place to go.", "pics": null}}, {"review": {"des": "I was shocked to find absolutely ZERO vegetarian food items on Dearborn's menu. Zero... Can you imagine that in this day and age? Well... I don't k ow why we stayed, because two out of three of us were vegetarian, but we ended up settling for a special request - grilled cheese sandwich. Yeah... Wasn't too happy about that, but we settled. I still don't know why...<br><br>Update your menu.", "pics": null}}, {"review": {"des": "Almost a 5.... <br>There are some reviews concerned about the service but we had really great service from start to finish.<br>The food overall was really good. The only plate I wasn't overly thrilled about were the shrimp tacos. The shrimp was cooked perfectly; however, the tortillas were not so good and I felt the corn mixture/salsa was a bit much. Perhaps, offering the corn mixture on the side would have been better.<br>For the rest of the food, the Meze plate is delicious! The deconstructed wedge is pretty good. The vegetarian gnocchi is so good and the elote is super yummy!<br>All in all a really great experience. The atmosphere is really fun and hip.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pN3ymGpzmC8FuBI5881WqQ/348s.jpg", "caption": "Tiramisu Crepe Cake"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Fh1-EWKxDHXXIik_MdFx_Q/168s.jpg", "caption": "Cream Elote"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/p19FUSg8asgFuEBC7AdKmA/168s.jpg", "caption": "Vegetarian Gnochhi"}]}}, {"review": {"des": "Not one entree on the dinner menu sounded good so we ordered appetizers & a salad. Fried chicken, carrot salad and mashed potatoes were all amazing....gotta get the chicken! Four meaty pieces more than enough for 2 to share as a meal. Nothing interesting on the dessert menu. We each ordered a different glass of red wine, Merlot & Pinot. When it was poured the server commented that they looked the same. Upon tasting, they had same nose & dlavor. Server said he would fix the error. Instead of leaving both glasses of Merlot which were already tasted & bringing a glass of Pinot he took both glasses away. Weird! Why would they throw the wine away rather than let the customer enjoy?! It was their error not ours.", "pics": null}}, {"review": {"des": "Great option for brunch if you are near the State street shopping area. We were looking for last minute brunch place to go on a Sunday. Most of the popular places were fully booked or the wait would been over 1 hour. We decided to come here since the reviews on yelp looked great. <br><br>For three people, we ordered <br>- Midwest fried chicken<br>- Lemon ricotta pancakes <br>- Morel mushroom & Brie omelette <br><br>The fried chicken was glazed with maple syrup and the hot sauce added a tangy taste to it. If you order this dish, make sure you eat it right away while it's hot. <br><br>Lemon ricotta pancakes were good too. It was light and the lemon and blueberry were such a great combination you can find in pancakes. <br><br>The omelette was good. You can never go wrong with Brie! <br><br>We wanted to try their Dearborn burger but couldn't order too much. We will come back next time to try it!", "pics": null}}, {"review": {"des": "This was a great dinner experience. Found this place on yelp and the reviews were great. It did not disappoint. <br>For starters I had the burrata with tomatoes. Also had the house bread which comes with European style butter. Both were amazing. <br>For main course I had the pork rib with mashed potato, and some veg. Also excellent. The rib was so tender it fell onto my fork. <br>For dessert I had the snicker ice cream cake which was a phenomenon. <br>Had an after dinner digestif which wasn't my favorite, but drank it anyway. <br>Service was really good, and it is a really beautiful dining area. Would recommend for anyone looking for a treat. <br>The price point is three $$$ so was surprised to see this at $$ when I saw it on yelp first.", "pics": null}}, {"review": {"des": "Terrible, awful experience. First off, we sat at our table for 15 minutes before I finally got up and asked the hostess where our waiter was. She looked confused and went and talked to some people in the back, and it was clear no one was even aware we were there.<br><br>Prices are SKY HIGH and the food was mediocre at best. Our waitress was not particularly attentive and our entrees were slow in coming, even though it wasn't busy at all. The best thing was the bone marrow, but it wasn't a must-have. No idea how this place has 4 stars in Yelp but it absolutely doesn't deserve it.<br><br>The most egregious offense of all though was when the manager came over and we explained our poor experience being initially forgotten--he apologized and said he had a surprise for us later. We got the check and waited around for an extra 20 minutes but he never returned. I wouldn't go back here if it was the last place on earth.", "pics": null}}, {"review": {"des": "Fantastic restaurant!<br><br>My husband, a friend and I had brunch here on a Saturday morning.  <br><br>The ambiance is warm and welcoming, just like the service!<br><br>We started by reviewing the menu, which is extensive and offers plenty of appetizers, savory and sweet dishes.  The drink menu is just as extensive as the food menu.<br><br>My friend and I both ended up with a Bloody Mary, which came with a Miller High Life chaser.  It was one of the better Bloody Mary's I've had. It had just the right amount of spice and kick.  My husband had a mimosa and said it was great.<br><br>For our entrees I ordered the cornbread waffle which came with a sunny side up egg, house made chorizo, and a beer cheese sauce.  It was fantastic and very filling.  My friend ended up with the mushroom omelet, which she loved and my husband had the cinnamon roll French toast.  It was huge and he enjoyed as well.<br><br>I don't recall the wait staff members names, but they were fantastic.  Friendly, attentive, and very knowledgeable.<br><br>I highly recommend a visit to The Dearborn.  I can't wait to visit, again!", "pics": null}}, {"review": {"des": "I visited the Dearborn for weekend brunch with a friend during my visit to Chicago. For the uber/Lyft riders the restaurant has a corner location so be aware that you may be picked up or dropped off about a half block away as I was once I left the location. Upon entrance I was immediately greeted by the staff and then led to my table. Our waiter came to the table immediately to take our drink orders and bring water and was very attentive throughout our whole time at the restaurant. I had an old fashioned which was a little sweet but amazing nevertheless. <br><br>My visit allowed me to get a taste of the brunch menu and I was not disappointed. I ordered the burger, cooked medium rare with a side of parmesan truffle fries. We requested that our fries be brought to the table immediately and they were within five minutes and where hot and fresh. Our entrees arrived within fifteen minutes of our ordering. My burger was large but tasty and my sunny side up egg gave the burger the right flavor it needed. My friend on the other hand, ordered the Southern Fried chicken and cleaned his plate (it must have been good). Overall our time at the Dearborn was amazing and I will definitely visit when I am in town again", "pics": null}}, {"review": {"des": "Came here for lunch with a few girlfriends for a birthday. It was shockingly very busy for noon on a Tuesday. We ordered a variety of things - cheeseburger, French onion soup, veggie sandwich and buffalo chicken sandwich. Everything was pretty good. I'd recommend adding some meet to the veggie sandwich. We agreed the French onion soup wasn't a favorite for the table. Luckily we got in with no reservation and had pretty good service especially since we were in a time crunch. I'd be interested to see how the dinner menu/drinks are here.", "pics": null}}, {"review": {"des": "Maybe because of the holidays, but they served \"brunch\" which was really breakfast with either a burger or buffalo chicken sandwich until 3pm! We came with kiddos after a Christmas play and they had no kids menu. The menu was sooooo limited. Mostly eggs and waffles at 2pm? The ambiance was TOP notch! Live music too! Service SUPER slow. Lots of potential, menu, food, service sucked.", "pics": null}}, {"review": {"des": "The Dearborn is a Loop restaurant right in the heart of Chicago. I came here for brunch with some friends and I liked the place. The place is very cool looking. It has very cool lighting, lots of windows, and an old-school vibe. <br><br>We had a pretty big group so we ordered some appetizers. We split some fried chicken and the Cookies N Cream donut holes. The appetizers were amazing! And I actually liked them better than my main dish. The fried chicken was hot, fried to perfection, and lots of flavor. The Cookies N Cream Donut Holes were made from oreos and had a sugary frosting that just melted in your mouth. For my entree, I ordered the Salmon Benedict. It was just okay. To be fair, I probably shouldn't have ordered fish in Chicago in February. It was a little dry and I wish it had more hollandaise sauce over it. <br><br>Prices are average and is what to expect in the Loop. They had a full bar with lots of liquor options. I had a Bloody Mary, which was good. They had a lot of cocktails that looked pretty good too. This is a good place to have brunch and I will have to try it again for dinner or have a different entree for brunch next time.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zwcAdH9PHJS4pb6Jgc25wA/348s.jpg", "caption": "Salmon Benedict"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VkFTCfyvg0tlHVT46c3RPg/168s.jpg", "caption": "Cookies & Cream Donut Holes"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/btTZfVH7Qt9jPaoASK6JKg/168s.jpg", "caption": "Midwest Fried Chicken"}]}}, {"review": {"des": "We came in for a late brunch and it was wonderful from the start.  The decor is super pretty and unique with historical pictures all over.  The host was polite and greeted us, took us to a table immediately.  <br><br>The food was amazing! I had the burrata and beets with french frys (I suggest you add the truffle oil).  The beets were covered in a citrus sauce that paired great with the fresh cheese.  The french frys were crisp and super hot when they arrived.  The dipping sauce for the frys was also great and had a nice garlic taste.", "pics": null}}, {"review": {"des": "Perfect location in the Theater District.   We stopped by for an early dinner before a cocktail reception.  Since we were there around 4:00pm, the restaurant was basically empty.   We were seated promptly and had our waiter all to ourselves.<br><br>I had the Chicken Shawarma Tacos from the appetizer menu.   They were good but just a tad dry and definitely needed more of the garlic yogurt.  D had the Fish & Chips, which he said was very good.   We also shared a bowl of Crispy Brussels Sprouts.   <br><br>The bathrooms were very nice and had a 1920's feel, Very nice touch.   Our waiter was friendly and kept our coffee filled.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HTnERla-Afz-mQylHeD6Fg/348s.jpg", "caption": "Crispy Brussels Sprouts"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MG9Wo3RQKSx1d7XZnJeSIA/168s.jpg", "caption": "Fish & Chips"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Ca7LgqquJLRhdpvp2ArKJA/168s.jpg", "caption": "Chicken Shawarma Tacos"}]}}, {"review": {"des": "Before we went to this restaurant, we just saw the Charlie and the chocolate factory play and it was very enjoyable. We were looking for a bite to eat after the show, we saw this place and it looks fancy enough me and my family were deceived.<br><br>We were seated at this very nice booth and the waiter came over and started ours were some water and we had the chance to look at the Menu. We were looking at Tips on Yelp for the restaurant and most of the tips of the food on yelp weren't on the menu. We asked our waiter about that and he said that they have just updated the menu two weeks ago for a change in season for the fall. There wasn't much on the menu and it was hard to decide what to choose. I ended up getting The Dearborn burger because a lot of tips on yelp said it was very good. My sister got the fajitas, my mom got the scallops, and my dad got the walleye. Our waiter was attentive and came to us often ask if you are ready. When we got the food, the burger was very good, but my mom was didn't get what she wanted. My mom scallops weren't cooked all the way through and they tasted very bad. When we told our waiter about the scallops, he was very surprised and sent them back right away. What's my dad's walleye, it came with clams that that had sand in them. Soon after that we all slowly lost her appetite. After our meal, waitress gave us A complimentary dessert for the bad food we got. This is what is saving this restaurant from a one star. If I were you, I would suggest getting the burger because that is by far the best thing on the menu and also if you look at the Tips that's what most of them would say.<br><br>To sum it up, don't get the scallops, the walleye, or the clams. With our experience that we had, we will not be going back anytime soon.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/e5DpwD6F9ynLgUacYuf4jA/168s.jpg", "caption": "Our entrées"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kFCVA9XqrFpivtlG1xtsFA/168s.jpg", "caption": "Complementary Desert after a bad meal"}]}}, {"review": {"des": "I visited The Dearborn before seeing a play at the Oriental Theatre because it is just across the street. From the moment we walked in, I felt very taken care of. A waiter greeted us immediately to bring us water and take our drink orders and between courses another wait staff member would come and wipe down the table which was a nice gesture.<br><br>I started with the little gem wedge salad which I split with my friend. The portion was huge but we managed to finish it because it was delicious! There was a generous helping of bacon and blue cheese, which I normally don't love but it was mild enough that it was great. I saw that the individual portion sizes were much much smaller, so I would order the large size to get your money's worth. I then had the Day Boat Scallops ($33) which were delicious but the bed of barley with mushrooms was a little too earthy for me so I couldn't finish the whole meal. I might try a different dish next time, but it was very good if you like a truffle/earthy taste. My cocktail, the Queen Bey (which I ordered for the awesome name) was excellent. It came with a candied ginger piece on top which was a nice touch, but don't mistake it for mango and take a huge bite like I did! <br><br>I would definitely recommend the Dearborn based on the nice atmosphere and location and excellent service. The food was great as well.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-BNa1cOOjEP4iVQurP2Ahw/168s.jpg", "caption": "Queen Bey cocktail"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/95HeI450HLPhFfTqRN6Flg/168s.jpg", "caption": "Day Boat Scallops"}]}}, {"review": {"des": "So much to say about this place. I don't think I've failed to come back to town without stopping in. Everything is good, but I love the seafood. The scallops, amazeballs. The walleye, righteous. The oysters, sublime. But man, it is also just the feel of this place. A great american tavern. A place to warm up on a cold Chicago winter's day. The service is spot on and the people are great. Can't wait to get back.", "pics": null}}, {"review": {"des": "First of all the service was impeccable. I had overestimated how much time I had for lunch but I didn't even mention I was in a rush and she was on point at every point of service. The food came out super fast, she refilled my water before I could ask, I got the boxes and the check as soon as I asked, and she was always checking in at all the right moments. The sandwich was pear and gruyere with a little honey drizzle and the crispest bread, it was so elegant. The elote was delicious. I'll have to come back for a cocktail.", "pics": null}}, {"review": {"des": "This restaurant is beautiful. We stopped in after having seen Hamilton and it was about 1030 on a Thursday. Didn't realize last call is 1130, and they turn the lights on and kick you out at midnight.<br><br>Got the vibe the waiter hated us, which is not a great feeling to have. I found the staff not overly helpful when I asked questions and so maybe this place is snooty (although obviously their clientele is tourists and there was a dude drinking Pabst Blue Ribbon at the bar). <br><br>Brussels sprouts were delicious, and overall the food was edible and yummy. Drinks were good and selection was vast. I think if the service had been more approachable it would have been a 4 Star.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eWLHvAPK6pUfD5-7DZvayQ/168s.jpg", "caption": "Queen Bey"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wmUE5faduaitxV-nnR0sQg/168s.jpg", "caption": "Fries chicken and Brussels sprouts"}]}}, {"review": {"des": "So it was my last day in Chicago before heading back to LA and my friend said she wanted to take me to her favorite lunch place, lo and behold it was The Deadborn.<br><br>We made reservations for Monday at 12:40pm and just for a heads up, they can't seat you until you have your entire party there.  Once we got seated they gave us menus and waters.  We were all starving and were told the portions were big to share so we did family style.  We went with the shrimp & grits, chicken with asparagus smothers with a green aioli sauce, fish & chips, and a Not Billy's Scotch Egg.  At first we thought it wasn't enough food, but it was more than enough! <br><br>Out of all of the dishes our favorites were a tie between the shrimp & grits and the chicken with asparagus, they were both delicious and must haves.  This is not to say that the other items weren't delicious as well, but weren't mind blowing.  The egg was only one and not that big, so that's more of a solo item than a share item.  The batter surrounding the egg was crunchy, but not overly crunchy which still made it a great choice. <br><br>All in all the food was great and the server was very helpful with suggestions.  Oh yeah, grab one of thei non-alcoholic drinks, you won't regret it.", "pics": null}}, {"review": {"des": "I always love the cocktails here. This time we had the Picasso's poison, which was lightly sweet and tasty. The Daley Manhattan was booze forward but well flavored. My favorite was called something like \"first fight\" with the DB gin and grapefruit liquor, (a take on the aviator). The fried chicken here is amazing; so crispy and great flavor. The onion soup was good, really cheesy. The rabbit tagine needed more meat but the sauce with chick peas, nuts and fruits was amazingly good. The dessert of apple pumpkin churro with apple ice cream & caramel was a great seasonal treat.  The churro was a little greasy but the ice cream helped balance it out. Overall I had a good time and I'll be back. I love the interior design here too. Such a nice place to sit at the bar on a cold night and have a cocktail.", "pics": null}}, {"review": {"des": "Probably one of my favorite places I got a chance to visit while in Chicago this weekend. The service was awesome and our server Victor really did a good job with recommendations and accommodating to my dairy allergy. I ordered the fish and chips and my friend ordered the burrata and some shrimp dish. I highly recommend anyone to check this place out if your in downtown Chicago. The cocktail menu is also very good and prices aren't bad at all.", "pics": null}}, {"review": {"des": "I have been frequenting this place since it opened some years back and have probably eaten here about 10 times in the last two years. They have recently changed their menu as they do on occasion making sure that seasonal foods are used. This latest change has really upped the ante when it comes to food options in the area. Combining the new menu with their already outstanding cocktails and wine list makes this a local spot not to be missed. <br><br>This time around I had the scotch egg which is something that I have to try any time that I see it on a menu. Knowing how good the scotch egg is at the Gage of course makes this a competition that I am happy to say the Dearborn wins hands down. I paired it with a couple of the daily old-fashioneds, Which are perfect way to both start and end an evening. <br><br>The after work crowd is lively and fun. And if you have a seat at the bar it's always easy to strike up a conversation with people there. The staff is ultra Pleasant and professional. You will not go wrong if you choose to spend an evening here.", "pics": null}}, {"review": {"des": "Best service ever. The place was packed mid day during the week. That's how you know this place is amazing. Do yourself a favor and order the maple chicken, and a baileys hot chocolate. To die for.", "pics": null}}, {"review": {"des": "Came for brunch and conquered... Great Bloodies, Irish coffees, food was on point. Live music in the background brought it home for me. If Ricardo is at the bar then that's where u need to sit.", "pics": null}}, {"review": {"des": "Came here with some friends before seeing Wicked across the street.  Our server was very friendly at first, noting we had a show so we were on a schedule (though it was a 5:15 reservation before an 8:00 show, so I wasn't really worried).  One friend was on a special diet and he was very helpful and accommodating for her when ordering.<br><br>Once our food came, though, he became a ghost.  The general manager walked by at one point to say hello, and while I appreciated the gesture he overstayed his welcome (some of us were literally about to take bites and he just kept talking).  After all our plates had been cleared our server finally came back, asked if we wanted dessert, then when we said no he just kind of threw our bill on the table.  We wanted one more round of drinks, so then we had to flag him down again to order them (after he slightly huffily had to run and get us a menu), then after we were done with our drinks we had to flag him down again.  He was friendly enough, but his timing and attentiveness were terrible.<br><br>And yes, this is the Loop, but be prepared to pay handsomely for your dinner.  One friend got the mixed greens type salad with salmon, and adding the salmon was more expensive than the salad itself.  Two of us had burgers for $16, and while they were very good burgers if I'm going to pay that much for a burger I'll just go to Au Cheval.  Actual entrees would run you $25 and upward.  Drinks, while good, were also quite pricey.  Our bill for 4 people was over $200 after tax/tip/etc. (and one of us didn't have anything to drink).<br><br>Overall, I'd likely give the food a 4, but the high prices kind of mar that, and the service I'd give a 2.  I get that it was a show night so it was busy, but our server would keep walking by and not even check in.  I got the feeling we were being rushed out, which wasn't much fun for a girls night out.  Maybe it would be better on a non-show night or just at the bar for drinks and apps, but the experience we had wasn't that great.", "pics": null}}, {"review": {"des": "Went here to eat after a show since it was open later<br>Than other restaurants. We got seated quickly, but after that the service was awful. The waiter took forever to<br>Come by. When he did, he did not introduce himself<br>Or say anything and expected us to give him the order without him talking. Our waters we're never refilled. We never saw the waiter again. We had to ask a bus boy to get the check since nobody bothered following up. The food itself was ok. Nothing Spectacular. We will not be coming back here due to the terrible service.", "pics": null}}, {"review": {"des": "The Brussels are beyond delicious! Worth going there for those alone, but there's plenty more reasons to go. It's always packed with people and a welcome addition to the area.", "pics": null}}, {"review": {"des": "Modern decor with soft touches of leather booths and lounge chairs. Live music makes bar area fun and inviting.<br><br>Tried lunch and dinner. The menu is short for both. We tried fish and chips, buratta, the chicken sandwich, and the burger from the lunch menu. They were interesting and flavorful; however, the fish was a little bland; as such would be excluded from our next pick. Also, the fries are too oily with not enough crunch. Finally, the chicken sandwich, while good, was too dry on 2 out of 3 occasions.<br><br>The dinner had fantastic choices of scallops, duck, and the sea bass, among others. The duck and the sea bass was flavorful and prepared well. Fantastic choices.<br><br>The desert of churros and the apple almond crunch are outstanding each delivering enough crunch with soft, pleasant center, and the flavored ice cream which adds another level of perspective while complementing the main event.<br><br>The wait staff are generally acceptable; however, not very attentive. Once out of 4 visits we had a fast and attentive service; on others we had to endure long wait times for drinks, condiments, or simple check if we needed anything.<br><br>Overall, it's a mixed bag. I'm leaning towards a three star rating; however, the ambiance and the pleasant choices somewhat outweigh the disappointments for now.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RLRQH3max7RM7Stf02z_cg/168s.jpg", "caption": "Lunch Menu Drinks"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iCyPye_25zYI90UYsgmGUQ/168s.jpg", "caption": "Lunch Menu Front"}]}}, {"review": {"des": "Totally LOVE this place every-time I visit.  Took my family tonight for an after Thanksgiving celebration and sat in the bar area.  Ronald took AWESOME care of us at every step.  The food and customer service is probably the best I experience in the Chicago area when I visit.  Keep up the Great job Dearborn and Ronald.  Can't wait for my next visit!", "pics": null}}, {"review": {"des": "Raining and cold in Chicago.  Took shelter here.  Do yourself a favor and get the local salad.  Second time I have had it- different every day. Today was greens with an Asian citrus vinaigrette, grapes, feta.  Ceviche terrific too.  Lastly house old fashioned uses bourbon infused with ginger cranberries and orange.  A nice recovery from Mother Nature.", "pics": null}}, {"review": {"des": "Great hearty, high-end American bar food.  The menu is limited, but everything's great.  The brunch menu is especially good, with something for everyone.", "pics": null}}, {"review": {"des": "My husband and I came for dinner for our anniversary, we were started with champagne and a lovely card wishing us a happy anniversary from the team here. Our server Josh was amazing, he went above and beyond to take care of us as well as the busser who stayed on top of water refills and clearing our table. We were wished a happy anniversary from Sarah the AGM who was kind and took care of our dessert.<br>We could not have been more blown away by the amazing food, the NY steak strip we shared ( chefs choice on the temp) was one of the top steaks I've ever had, coming from a native Californian. Our entire Anniversary was just wonderful!! We thank the crew for such hospitality and an amazing meal!!!", "pics": null}}, {"review": {"des": "Upscale menu with delicious choices. Great cocktails. Wonderful service. We will be back! <br>If you go for Sunday brunch, get the cinnamon roll French toast.", "pics": null}}, {"review": {"des": "Had a great pre show dinner here last night! I was able to easily make a reservation the night before. The entire staff was extremely friendly and accommodating. The hosts were very pleasant and our server, Leo, was the best! He made a tremendous wine recommendation for my boyfriend and I based on what we told him about our preferences. We enjoyed the Brussels sprouts appetizer, the Dearborn burger and the duck. Everything was delicious. The Brussels were well seasoned and it was a decent sized portion for the price. The burger was one of the best I've ever had... so juicy and the truffle fries were to die for. The duck was absolutely phenomenal. I will definitely be returning to have this dish again. We also ordered the chocolate peanut butter dessert but it looked so good we dug in before I even took a picture! It tasted as good as it looked.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7sXblslwwTyHjLONkXcShA/348s.jpg", "caption": "Brussel Sprouts"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rOstc5hLIlEpb_7to9ObQA/168s.jpg", "caption": "Duck"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3ZMccJG2YvaILVE9DyCvZw/168s.jpg", "caption": "Dearborn burger with truffle fries"}]}}, {"review": {"des": "We were walking around christkindlmarket and decided to stop for an early dinner.  It was awesome and I definitely recommend it.  The ambience is excellent and they were very accommodating.  Michael was our server and he was professional, attentive and very responsive.  The food was outstanding. We had the milk bread appetizer and I had the Dearborn burger with the upgrade to truffle fries.  My opinion is that the Dearborn burger is the classy version of a Bigmac done right.  I'm also a bit of a snob about old fashioneds and I was quite pleased to see that they used a single large cube ice cube (yes I'm pretentious but it actually makes a difference!).", "pics": null}}, {"review": {"des": "The chicken here is better than the steak . As far as downtown  restaurants  go the syeak here was sub standard  but the mash potatos are to die for i dont know how some dishes are wonderful and ithers are yuk but its just a one time experience place for me i wont be back", "pics": null}}, {"review": {"des": "We were more interested by the starters than the main courses so for two of us we ordered 4 starters, a salad and a side thinking that the starters probably weren't big portion. Our waiter also did not warn us, he only said it was enough when we asked. I would say the portion of their starters was good enough for someone who has a small appetite as a main course.<br><br>The four starters we ordered were: grilled Spanish octopus which was a salad; burata; duck confit and baby back ribs. The salad was the little gem wedge and the side was roasted brussel sprouts. Luckily they were heavy on the veggies. The Spanish octopus was our most favorite followed by the crispy brussels sprouts. The little gem wedge was our least favorite, mostly because there were lots of very salty and chewy bacon bits.<br><br>The place was crowded when we arrived for our 6:30pm Saturday reservation but within an hour lot of customers had left to go to the theaters and then the place filled up again. The restaurant was fairly noisy when it was full and the tables were quite close together to not hear the conversion in the neighboring tables.<br><br>Our server was attentive and so as the food runner who explained every dish he brought to the table in details.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZZjJSYzzsTnBIgDNN2LkDg/348s.jpg", "caption": "Crispy Brussels sprouts, very crispy"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Io8TOP1dkFcJOgzscgRm1g/168s.jpg", "caption": "Duck confit and baby back ribs, the portion is big enough to serve as main course"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YKq34a5mBS0tm5zvWWuu2g/168s.jpg", "caption": "Many customers left just before 7:30pm to go to the theater"}]}}, {"review": {"des": "I had one of the best dinner experiences pretty much ever at the Dearborn. Just wow - wonderful! Everything here was delicious. First. Of. All. The dinner buns that they serve allow you to realize just what a wonderful experience this is really going to be. So good and buttery.<br><br>I probably had the best scallops of my life here, which is saying a lot because I order scallops quite often at fine dining restaurants. The burger is famous for good reason. Truffle fries - yes, more please. And of course, their wine list is really, really wonderful. <br><br>We ended the dinner with coffee and Tiramisu cake. I loved it although some at the table were indifferent about the tiramisu cake. Cannot wait to go back to Chicago just to come to the Dearborn.", "pics": null}}, {"review": {"des": "The Dearborn sits pretty smack dab in the center of the theater district with several big shows playing all walking​ distance.  Make a reservation before a show and your night will be great.<br><br>The service was good and friendly.  The ambiance is casual enough for drinks after work and fancy​ enough to celebrate a birthday or Valentine's Day.<br><br>We enjoyed dinner and drinks, and everything was delicious​.<br><br>GNOCCHI & OCTOPUS ($33)<br>Handmade parmesan gnocchi, confit Spanish​ octopus, housemade chorizo, spicy red sauce, preserved lemon, goat cheese.  This dish was delicious!  Octopus​ can easily be overcooked, but it was perfectly done in this dish.  The chorizo gave the dish a nice kick to it. <br>​<br>FISH & CHIPS ($18)<br>Beer-battered Pacific​ cod, housemade fries, tartar sauce, malt vinegar.  The fish was fresh, and the breading was light and fluffy (not heavy).  The fries were also crispy and perfectly salty. <br><br>CINNAMON SPICE CHURROS ($13)<br>Pumpkin white chocolate mousse, rumchata ice cream, warm toffee pour.  The churros were amazing!  The portion was huge- three large churros with a small pot of toffee.  Do yourself a favor and order these!<br><br>OLD FASHIONED, E'S AZTECA OLD FASHIONED, and a SPRING FLING.  All $14, all tasty, and all worthy of another round.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/B4NbhxEwVxwtC3hbQ581kg/348s.jpg", "caption": "Gnocchi and octopus."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rpd_I3t3_LnSSAsPN-MpDg/168s.jpg", "caption": "Fish and Chips."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jCcJL58EtC9IuWcGAZNcLw/168s.jpg", "caption": "Spiced churros dessert- order this ASAP!"}]}}, {"review": {"des": "Wow what a great experience! We started at the bar which has a great atmosphere and good music. My husband loved the old fashion. For dinner we had appetizers: grilled Spanish octopus and the house bread. Both were great. Loved the octopus! For the entree we split the walleye and mac n cheese. The fish was so flavorful with perfectly<br>Cooked veggies and the Mac n cheese was a cheesy unique version.<br>Loved everything about this place. Great vibe and food!", "pics": null}}, {"review": {"des": "Went here for lunch while walking around Chicago.  The place was packed, but the staff was attentive. I liked the menu here. It had the perfect amount of variety without being overwhelming.  We had the scotch egg which was outstanding, followed by the fish and chips and ricotta gnocchi.  The fish and chips were perfect.  Thick pieces of fresh fish with a nice light and airy batter, that was perfectly crispy. The fries were a little soggy but they tasted great.  The gnocchi was the best I have tasted. It was light and fluffy with one crispy side from being cooked in the brown butter. I would recommend this spot for a nice lunch to fuel up for some sight seeing.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_rBWFu7mmVJ7WhLP6w_0wQ/348s.jpg", "caption": "Scotch egg"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sDjfKDCLjK4CTFaYwQKPGA/168s.jpg", "caption": "Brown butter gnocchi"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Mrc7FY_k4i3Yg0SDUL5KvQ/168s.jpg", "caption": "Fish and chips"}]}}, {"review": {"des": "The Dearborn was the shining star of all the restaurants I visited in Chicago.  I love the decor, the presentation, and the open air concept.<br><br>The Mezze plate was absolutely amazing.  The texture and temperature of the pita bread was sheer perfection.  The hummus, eggplant dip, and every other unidentified item on the plate was magnificent.  <br><br>I also got the softshell crab BLT and a side salad.  This sandwich is a winner.  The bacon on this sandwich was thick, flavorful, and so good that it almost made me embrace my millenialship.  <br><br>Eating at The Dearborn actually made me consider moving to Chicago because the restaurants there blow DC's out of the water.  Then I had come to my senses and remember that it gets blisteringly cold there.<br><br>Go visit out the Dearborn.  You will not be disappointed.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1S5w6Bc-8xN5SqGKWWT0hw/168s.jpg", "caption": "Softshell crab BLT"}]}}, {"review": {"des": "Its simple to say that our experience at the Dearborn this week was excellent. Even after stuffing my face for Thanksgiving and experiencing multiple food comas, I had zero complaints about making room for what we were served for dinner and desert. We were there celebrating my dad's birthday and it was the perfect location - classy but casual, and very close to the theaters and the Christkindlmarket. <br><br>We started at the bar and each had a quick drink. From there there is a great view of the restaurant, which is decorated beautifully for the holidays. Behind the bar is a Gatsby-esque wall that has mirrors which make you feel classy while you drink (who doesn't love that!?) and some super friendly bartenders. <br><br>Once we moved to our table, we were greeted by our server, Kasani, who was just the best. He put up with our bad jokes and did his job impressively well. The food was also incredible. To save time, I'll just list what we ordered and tell you what I thought: <br><br>Starters:<br>- Korean BBQ tacos -  these were delicious! A bit difficult to bite into and chew so if you're not ready for a fight, these may not be the best option<br>- Midwest Fried Chicken - amazing. Sweet maple glaze without being too overwhelming and with the perfect amount of crispiness. Also accompanied by hot sauce and great pickles. <br><br>Dinner:<br>- Wedge Salad - such a great salad. Definitely NOT a wedge contrary to popular belief. The salad is much larger than you'd expect (no complaints here) so if you want an entree and a salad, I'd split this with someone<br>- Macaroni and cheese - this mac was unexpectedly great. I'm a very picky mac n cheese eater and I was blown away. It's a few bigger noodles with delicious, creamy cheese that melts in your mouth and extra thinly sliced cheese placed delicately on top. <br>- Burrata - The burrata cheese was wonderful. The marinated beets convinced me that I like beets so that's saying a lot. <br><br>Dessert: <br>We only ordered one dessert but we were surprised when we got two! Apparently we mentioned on OpenTable that we were celebrating a birthday so they surprised us by bringing us a small treat for my dad. There was a bon bon, a peanut butter cookie, a passionfruit gummy, and a peanut butter mousse with a candle in it. On top of that we ordered the churros. ORDER THE CHURROS. They were the best churros I've ever had; fluffy like a cloud perfectly dusted with cinnamon. They were accompanied by a pumpkin white chocolate mousse and Rumchata ice cream. It was insanely good. Highly recommend.<br><br>Drinks: Try the Gluhwein if you can! Warming from the inside out. <br><br>I'll stop rambling soon but my last thing to say about the Dearborn is that it has a great noise level. Our family often struggles in places that are too loud and I'd be happy to bring my parents or grandparents here again. I appreciated that the layout of the rooms that prevents sound reverberation. <br>Overall our experience was amazing. We will most definitely be back to visit the Dearborn very soon!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oMhAZAgdYG8H9DZjCVQiSw/168s.jpg", "caption": "View of the middle room from the bar"}]}}, {"review": {"des": "Beautiful ambiance with very nice moo lighting. <br>The service on a Friday night was retry good, all of the servers and waiters were attentive and made recommendations based on our varying interests. <br>Try their maple honey fried chicken!! So good!!! Not quite $17 good, but still good if you don't mind spending the money.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BUg1PpHFQdk-ZUae1HSezA/348s.jpg", "caption": "Delicious wings"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OVHESjxSEPaf7Q5bTzzAaQ/168s.jpg", "caption": "Super dark sprout"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sCz46Zzgvr5enh4w5j4p6A/168s.jpg", "caption": "Korean Tacos"}]}}, {"review": {"des": "I've been to this place multiple times even during team lunches since I work nearby. Literally right next to this place. I would definitely give 5 stars but yesterday's experience just made me feel uncomfortable. The waitress forgot an order which I can totally understand, it happens! Its a busy place and hour! But her attitude was not something I could understand. First she threw the napkins at our table, making me feel like she didn't want to work today or something. After that everything about her attitude seemed very negative to me. We had to cancel one of our orders because she didn't forgot to take them but I guess she was told off by her manager because after we cancelled our order she suddenly tried to make up for it by suddenly acting nice and caring. Anyways still gave her nice tip because maybe she was having a bad day. But please don't throw things on the table, its really rude. Honestly me writing one review won't do anything much but if the waitress at least sees this review i just hope you understand that throwing things on the table really makes customers feel uncomfortable. Thanks!", "pics": null}}, {"review": {"des": "The Dearborn is the best restaurant and bar in the State Street District! My favorites are the maple glazed fried chicken, shrimp and octopus, the signature burger and the snickers dessert. The owners are extremely hands on and never fail to greet regulars with a warm welcome. The vibe here is fun, upbeat, has open windows in the summer and always a great crowd. Their beverage program is cutting edge and sure to please the most discerning pallet.", "pics": null}}, {"review": {"des": "Prime location in downtown Chicago. <br><br>The hangar steak  with polenta is die for! I wasn't even craving anything particular but this dish hit the spot like an 7-year itch had been scratched! The au jus is heavenly...I kept trying to \"dip\" all of my food to stain it with the flavor. <br><br>The local choice salad was better heard than eaten. Kind of reminded me of the basic garden variety salad spring mix in the bag. The dressing wasn't particularly special or especially well designed to be a pairing.<br><br>The eloté is a deconstructed Mexican street corn and it's good but it is better left in it's constructed form. <br><br>Server was very informative but the rest of the staff are sort of lackluster. <br><br>The oysters were good and fresh. <br><br>Oh, NO PIE  UNTIL SPRING.", "pics": null}}, {"review": {"des": "This place is a really nice place and good atmosphere.  It's such a shame the service was so terrible.<br>We arrived and they originally sat us at a tall table.  Im shorter and asked to move tables because my feet were going to dangle.  Not a problem they accommodated and we're nice about it.  We were seated at another table.  The waiter came to our table three times and we were at dinner for over an hour.  Once to take drink order when we sat down, again to take our meal order and then to bring us our bill.<br>We watched as he joked around with the tables around us and even refilled their water glasses and he never once approached our table.  Our table was 10 feet from the other table. <br>It's sad that if you are not a family of 4 or more that you are not given the same attention and service being a younger couple just wanting to have dinner.<br><br>I'm hoping that the waiter learned a lesson or even a personality as I even went against my better judgement and still left over 20% tip as I understand working in the service industry and tips are everything.", "pics": null}}, {"review": {"des": "So this is a cool spot to hang out but truthfully the food is not that impressive. I think the thing that stood out the most was that our food came out five minutes after we ordered it. So we got appetizers within five minutes and then we got our food within five minutes after we ordered it after we had finished our appetizers.<br><br>So the food was premade in on a scale to 1 to 10 it was about a six.", "pics": null}}, {"review": {"des": "Wow - so good! We made a reservation via Open Table (around 5pm for a 9:15pm) table for two. We got here a little early but only waited a few minutes before being seated. Our server did take a little while to stop by our table (he may be new? Our neighbors received a wrong dish and then he broke a wine glass...), but the neighboring server took great care of us! <br><br>Their drink menu greatly outweighs their food menu. There are lots of great signatures mixed drinks plus an extensive wine and beer list as well. I  disappointed that the bread starter was sold out, but it makes sense since it was so late. <br><br>Our food arrived 10 minutes after we ordered, so I'm glad we didn't end up with a starter. I ordered the wedge salad (SO GOOD) and a side of brussel sprouts (which is shareable size!) My friend ordered the bone-in short ribs, as suggested by our waiter. All was wonderful! <br><br>We also splurged for dessert. I highly recommend the churros - warm and delicious! Same goes for the coffee. <br><br>All in all, you can't go wrong! Great quality and healthy portions for the price point. I only wish our server had been more attentive...", "pics": null}}, {"review": {"des": "Shrimp tacos were super tasty. Service was great, super friendly staff. Was seated very quickly on a Friday night. Be prepared to pay for a $$$ for appetizers and especially entrees.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/u-Mbn8YQOVv2aFC-6Hzl8g/348s.jpg", "caption": "Shrimp tacos"}]}}, {"review": {"des": "Amazing food.  Definitely start with the pork belly.  I had the rabbit, which was amazing and the wife had the duck.  Pricey but definitely worth it!", "pics": null}}]}