{"name": "the-dawson-chicago", "reviews": [{"review": {"des": "Very trendy! Fun, vibrant atmosphere!<br><br>If you're looking for an intimate evening or a gathering of friends, you won't be disappointed. It is not a quiet place but your ears aren't ringing when you leave. <br><br>The hostesses were very pleasant and seated us right away. Carlos introduced himself as soon as we were seated our server Troy was a doll! She was very helpful in small plate suggestions and cocktail selections. She was always courteous and cheerful   (As well as the rest of the staff that refilled our water glasses and kept our table clean)<br><br>Our meals came out quickly and were delicious! We had the Pumpkin Tortellini :)<br>We did not have any desserts due to a show we were seeing but perhaps next time. <br><br>Thank you to the entire staff! We will be back!", "pics": null}}, {"review": {"des": "Both the interior and exterior of this restaurant are beautiful!! The large windows let in a lot of natural light. The wooden staircase seen right at the entrance is sleek and modern. Their outdoor patio space looks really cute and I'd love to dine out there when the weather is warmer. <br><br>We tried to make reservations on opentable for a Saturday evening at 7 but all of their reservations were booked except an early 530 one. So try to make your reservations in advance! <br><br>Drinks:<br>The cocktails on the menu change every few months so I don't think these are on the menu anymore, but I had the cool kids cabin -- old forester signature bourbon, dickel #12, Swedish punsch, st germaine, amontillado, sherry, hibiscus, black tea, and lemon. This was really good! It was served with a lemon slice and a pretty flower. My friend had the morning assembly, which was a Japanese whiskey based cocktail. She said it was good but that she liked the cool kids cabin better! The cocktails were $13 each<br><br>Food: <br>We shared the chicken fried lobster appetizer ($18), the Texas redfish tacos ($48), and a side of Brussels sprouts ($9). The chicken fried lobster was such an interesting concept. I've never had fried lobster! It was very tasty, especially eaten with the spicy ranch it came with. Wish the portion size was bigger! The Texas redfish tacos dish is a whole redfish and comes with tortillas, guacamole, charred tomato salsa, chimichurri, Napa cabbage slaw - so you can assemble your own tacos. I think we both made at least 3 tacos each and there was still fish leftover. It's a good portion size, but I didn't love this dish. The fish was tender but a bit under seasoned in my opinion. Wouldn't order it again. The Brussels sprouts were solid but nothing too crazy. I'll have to come back to try some of the other things on their menu!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KOE-F5od8rTO1qi9lCWvfw/348s.jpg", "caption": "Cool kids cabin on the left and morning assembly on the right"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mELQsDSt-xTSrErU20GAyw/168s.jpg", "caption": "Brussel sprouts"}]}}, {"review": {"des": "The food: 4/5. I went to the Dawson years ago and didn't like the food, so I haven't been back in a long time. A friend was having a birthday dinner there, so I was able to give it a shot again and it was much better than I remembered. Everything was enjoyable, a couple of things stood out particularly the octopus which was very tender and the duck which was done just right. <br><br>Brussels Sprouts - 5/5<br>Roasted Cauliflower - 4/5<br>Chicken Fried Lobster -3/5<br>Duck two ways - 5/5<br>Octopus - 4/5<br>Chocolate Sunday  - 4/5<br>Banana pie - 4/5 <br><br>The service: 3/5. Our waitress seemed a little out of it, she only suggested the most expensive items on the menu and had to reminded to get water refills. <br><br>Overall: 3.5/5. I'd go back but the service could use some improvement.", "pics": null}}, {"review": {"des": "The Dawson overall was a wonderful experience. The space is beautiful, with a simple but clean and contemporary design. They have both outdoor and indoor seating and the spaces energy and vibe was amazing. The staff was pleasant and the service was great. Although they were busy upon arrival, wait time was short and I was seated almost immediately. Now let's get to the food, the Chicken Fried Lobster is AMAZING! Again, all I can say is amazing! One order won't be enough, two or three orders must be had! The Cinnamon Raisin Sticky Bun was very good as well. If you are in the Chicago area this is definitely a spot to check out.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8wmeViNnCDEZH3KEOYiJlA/168s.jpg", "caption": "Cinnamon Raisin Sticky Buns."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jUqDZtyzSQC8HYyzEOwXJQ/168s.jpg", "caption": "Chicken - Fried Lobster"}]}}, {"review": {"des": "Oh my WOW. What a wonderful surprise The Dawson was. <br><br>My family made a reservation for 6 people on a Monday night for my mother's birthday and it was a great place to celebrate. My family generally gravitates toward Asian cuisine as it better suites my grandmother's taste buds, but for this special occasion, she was open. <br><br>We arrived at The Dawson and was greeted with a stunning entry way with a staircase to the left and gorgeous light fixtures. It's clear that this is the type of space that could accommodate larger special events. We were seated immediately as our reservation was for 5:30PM. (very early for dinner, but for grandma). Our waitress was very nice went reviewed the menu with us as well made a few recommendations. It almost felt as if we were ordering the entire menu.<br><br>For appetizers we had the chicken-fried lobster. It was fried to perfection with a great crispy exterior and a tasty ranch sauce. The only downside to the dish was the price. A whopping $18.00.<br><br>For sides we ordered the Brussel Sprouts, Mac and Cheese and Heirloom Tomato Salad. The stand out was definitely the brussel sprouts. Served with a spicy aioli and soy lime vinaigrette. YUM.<br><br>For entrees we ordered the Hudson Bay Scallops, Farmer's Pork Chop, Texas Redfish Tacos, Steak Frites, and the Halibut. The best entree in my opinion was the Pork Chop. Thick cut and grilled to perfection. Crispy with grill marks on the outside and juicy on the inside served with grilled peaches.<br><br>The cherry on top of this entire experience was the Ice Cream Crunch Pie. We ordered it as the \"cake\" to sing happy birthday and it was quite the dessert. I would come all the way here just for the sweet treat. <br><br>Thanks for the great experience!<br><br>Grade: A", "pics": null}}, {"review": {"des": "Made a reservation at this spot for a Saturday afternoon! The space here was just beautiful. You are immediately welcomed by natural light that comes in through the large glass windows. The contrast of the wood decor and glass make this place very elegant. Also, did I mention there is  a beautiful wood staircase that gives this place such a nice feel!<br><br>My friend and I decided to dine inside since it was kinda cool outside. However, the patio seating looked beautiful and they even had a few heaters out there! For our appetizer we ordered the Chicken Fried Lobster! This dish was great! My only complaint was that it was too small! I wanted more! The ranch that it came with was a good contrast taste to the chicken fried lobster.<br><br>We shared the Texas Redfish Tacos $48. This was a pretty large dish, we even had some leftovers! This dish came with guacamole, salsa (not spicy), coleslaw (which was just okay) and of course the tortillas. Each of us easily made 3 tacos! The fish was tender, but it lacked some taste. Luckily, they did provide us with sides which really made a huge difference once we started to construct our tacos. <br><br>For our drinks we ordered the Morning Assembly and my friend ordered The Cool Kids Cabin. I am normally a whiskey drinker, which is why I ordered the Morning Assembly, but I was not a huge fan of the flavors. My friend ordered the Cool Kids Cabin with bourbon and that one was my favorite! <br><br>Our waiter was pretty great! Overall, this was a pretty cool spot! I would definitely plan a visit back in the future.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3eSdl0vIRcjmU0UQQbbZYg/348s.jpg", "caption": "Texas Redfish Tacos (Large enough to share)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gNgnpYdkdSMgq7uDOcxJzQ/168s.jpg", "caption": "Chicken Fried Lobster"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/avAFDjwC0NSOpTlYKz1yig/168s.jpg", "caption": "Tortillas for the Texas Redfish Tacos"}]}}, {"review": {"des": "So cute! A friend and I went to The Dawson for the first time and when I walked in from the treacherous rain, the first thing I said was, \"This is so cute!\". The entrance was so cute. I loved the wood decor. The hostesses were so cute! They were very polite and immediately welcomed me. They checked my drenched umbrella for me and showed me to my table even though my friend wasn't there. <br><br>I was immediately greeted by our waiter, M. He was great. He was so knowledgeable of the menu  and happily told us his favorites. He was attentive throughout our visit. <br><br>It wasn't crowded at all when I got there at 6pm but it got packed and LOUD. The loudness came in waves so prepare yourself because conversations will get difficult unless you yell to make the LOUDNESS. <br><br>We started with the ceviche and the chicken fried lobster. Both were very good and great to share. I had never had nor heard of chicken fried lobster. It's just what you think. It's lobster fried like chicken, just like chicken fried steak but with lobster. The lobster was was but salty. I mean salty. The spicy ranch dipping sauce was a good compliment. It wasn't spicy at all to me. The ceviche had nice chunks of everything: tuna, avocado. All the ingredients were equal amounts so you could get a bite of everything in every scoop. <br><br>I ordered the scallops and my friend ordered the house-made cavatelli  and elotes. You get 4 well sized scallops on a nice bed of succotash and a corn purée on the side. Everything was fresh. M, told me the dish would have some spicy but the purée would balance it out. He didn't lie. The spice was just the right amount where it didn't burn your mouth at all and it didn't ruin the taste of the dish. The scallops were perfectly seared. I really enjoyed the dish. <br><br>My friend was happy with his cavatelli and elotes. M told him not a lot of people finish the dish but we didn't believe him...my friend didn't finish the dish. Hahaha. I sampled it and it was very good. The pork ragu had a nice amount of meat and flavor. The pasta was excellent. It's a filling dish. <br><br>We were so full that we couldn't think about getting dessert but the menu looked soooo good. I do plan on getting the macadamia banana cream pie. It sounds AMAZING! I LOVE banana cream pie so I will be making my way to that dessert next time and there will be a next time! <br><br>As I said before, the decor is so cute! The Dawson is a very clean restaurant. I went to the bathroom and it was so clean and had one of the BEST smelling hand soaps I've ever smelled. I had to find<br>it online to purchase it. I made my friend smell my hand when I came back upstairs lol. <br><br>When we were leaving, the hostesses were still great. I asked them why do they have so many blankets and the young lady told me, they give them to people who eat on the patio when they get cold. How cute is that! <br><br>I really like The Dawson. You have to give it a try. I saw a book in the bathroom that it was voted one of the best wedding venues in the city so I told my friend who's looking for a venue for her wedding to look at them. That's how much I liked this restaurant. I only gave 4 stars instead of 5 because that lobster was just tooooo salty for me. Other than that, it's great and I plan on trying their brunch.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sz8JWhkHy3q4WwVAsplAzQ/348s.jpg", "caption": "House-Made Cavatelli. It doesn't look like a lot but it's filling."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ziHHxIhOv5er8T782I8pKQ/168s.jpg", "caption": "Scallops before I poured on the corn purée."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OxTtxZXbgHRZOL69vaB6YQ/168s.jpg", "caption": "Scallops with the corn purée"}]}}, {"review": {"des": "This place is pretty good. It's beautiful and the food is amazing. <br><br>We went here just for dinner.  The intersection to get here is awful and parking is a HUGE nightmare so have fun with that. <br><br>We started with the tuna ceviche and the chicken fried lobster. Everything had so much flavor and the chicken fried lobster is literally AMAZING! It's a lobster tail cut in two then deep fried with old bay and baby it's great! <br><br>For drinks I had \"The Cool Kids Cabin\" with old forester signature bourbon. It was nice I still prefer an old fashion. <br><br>For dinner we went with the House-Made Cavatelli and the Hudson Bay Scallops. <br><br>My first concern was, I am going to be starving I did not finish my food. <br><br>The Cavatelli was very nice and flavorful with a slight hint of spice nothing over powering. <br><br>The Scallops day on a bed of succotash with a corn jus which was Devine!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Yx7pkbExckYHcylA5FBnTQ/348s.jpg", "caption": "Elotes"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/o_HiTk3hkHyUyLr-Vrs0nw/168s.jpg", "caption": "House-Made Cavatelli"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NIUJpc5lZ6NAbG7N9JvP0w/168s.jpg", "caption": "Tuna Ceviche"}]}}, {"review": {"des": "I came in here for brunch recently and we had a reservation, but we didn't need one. Any place that serves brunch and is a little bit more fancy that is not packed on the weekend makes me nervous. And I was right to be. I did not enjoy my french toast that much as it was just too much and the flavor was lost in the sweetness of everything. I only ordered the french toast because nothing else seemed appetizing to me. Every entree came with one or two random ingredients that I really did not think I would enjoy. My friend's much healthier option looked like a lot of work to put together and she wasn't even served the cream cheese for her lox and bagel and lots of toppings situation that she could not make sense of. I think they try too hard here. Sometimes standard brunch fare is what people want, and the lack of people here showed me that even before I experienced it for myself.<br><br>I'm only taking off one star for this review update, however, because I still think the look and ambiance of the place, as well as the evening fare, makes up for it.", "pics": null}}, {"review": {"des": "Outstanding brunch featuring boozy breakfast beverages, including the spicy Dawson Bloody Mary ($11). The trendy Avocado Toast ($15) is a real standout with roasted tomato, scrambled eggs and pesto. The Chorizo Hash ($14) is pleasantly spicy, with house made sausage, chihuahua cheese, a perfectly cooked egg and pickled jalapeno. The massive Breakfast Torta ($16) has a tender, properly pounded pork cutlet, spicy beans, avocado, lettuce and egg. <br><br>Don't forget the Bacon Flight ($20) with designer bacon offerings like blackstrap molasses, allspice and glazed cinnamon bacon. <br><br>For slightly lighter, but plentiful portion, try the locally smoked Forman & Son salmon ($16) on a sweetly caramelized onion bialy (Polish bagel) with marinated beets, cucumber ribbons, dill cream cheese and thinly sliced onions. The only thing missing at The Dawson is a place for your mid-morning nap!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BsZnH-Z-Z9CBfCh4Uo-HUw/348s.jpg", "caption": "The Chorizo Hash ($14) is pleasantly spicy, with house made sausage, chihuahua cheese, a perfectly cooked egg and pickled jalapeno."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LP5KCz6-aNVz3mmGskUssQ/168s.jpg", "caption": "The massive Breakfast Torta ($16) has a tender, properly pounded pork cutlet, spicy beans, avocado, lettuce and egg."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ePzLkhlFYOm4kxSq-9w79Q/168s.jpg", "caption": "Smoked Forman & Son salmon ($16) on sweetly caramelized onion bialy (Polish bagel) with marinated beets, cucumber ribbons, dill cream cheese"}]}}, {"review": {"des": "Food: 4<br>Service: 4.5<br>Cleanliness: 3.5<br><br>Came here on a Monday, birthday reservation for 6 at 5:30PM. Right away you're welcomed by huge doors at the entry way where lots of engagement photos are taken; its sun-lit room is perfect for a photo-op.<br><br>Our waitress was great and really did everything she could to attend to my mom's days celebration. Sorry I forgot your name! <br><br>Food is definitely on the pricey side so you expect high quality stuff for a smaller portion.<br><br>Fried Lobster Tail: $18<br>Now this was supa juicy and crispy with a side of spicey ranch. Just on the high-end side for 2 pieces of lobster tail.<br><br>Brussel Sprouts: $9<br>Everyone loved it at the table.<br><br>Mac & Cheese: $9<br>With crispy bacon on top, this hit the spot as a side.<br><br>Heirloom Tomato Salad: $15<br>Fresh mixed with croutons. We liked the slight sweet and acidity too it.<br><br>Redfish Tuna: $48<br>It comes deconstructed so you build it yourself. Fish was oven roasted and loved the spicey sauce. Think it comes with 8 tortillas. This is definitely something to share with a group.<br><br>Pork Chop: $30<br>Now we had to ask for a do-over on this one as it was too overdone for my mom. It's a good chunk of pork chop so kudos to the chef and getting it juicy like how my mom likes it second time around. I wasn't sure about the peach but that's just my taste.<br><br>Scallops: $32<br>Yum! This was a favorite too. Buttery limey scallops, crispy on the outside and soft on the inside. Usually 3-4 pieces depending on size.<br><br>Fried Ice Cream:<br>Wowza, what a great way to end the meal. Reminded us of momofuku's cereal milk. Thanks for the complimentary ice cream cake :) get it get it.<br><br>Note: we were seated at a window booth that was leaking AC water above. Don't know how they can miss it. Before seating the booth was wet and I asked them to dry it off. During the meal it was leaking right above us and even on us, please fix! <br><br>Would I come back? Yes", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hpugwHC_Kmd-tcmJ1XpYSg/348s.jpg", "caption": "Texas Redfish Tacos: $48"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Opiu-pQcjwr59lWTNqIz2w/168s.jpg", "caption": "Halibut"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_q8MAgE4HKpDcNr8b1yGyg/168s.jpg", "caption": "Hudson Bay Scallops"}]}}, {"review": {"des": "I went to The Dawson for a quick pre-dinner cocktail with a girlfriend! Upon arriving, the downstairs area was packed. Nervous we would not get a seat, we quickly checked in with the hostess to check about the upstairs. To my surprise, the upstairs was a totally different scene. It was much more relaxed and chill than the down stairs area. <br><br>We found a spot for two at the bar. The menu looked amazing. I wish we had more time there! I ordered the G.T.O and it was delicious. The thyme really stuck out, but was not over powering at all. It was a great drink. <br><br>Next time I'm in the city, I plan on making a stop for dinner at The Dawson!!", "pics": null}}, {"review": {"des": "I love the ambience of this restaurant, it is very romantic, intimate and perfect for a first date. I have dined at The Dawson many times, both inside and outside on their patio. Beautiful place that will always hold a special spot in my heart because of many special occasions my husband and I celebrated there. The menu is somewhat limited and I always have hard time deciding on my food choice so I'm taking a star off for that. Otherwise the staff is extremely accommodating and the drinks are delicious. I will be back many times as this place proved to be a keeper on many different occasions.", "pics": null}}, {"review": {"des": "Oh boy oh boy. This place is goooood.<br><br>We came here for my dad's birthday. It was supposed to be a delicious celebration, and that it was.<br><br>We started out with the chorizo fondue and the chicken fried lobster. I usually don't like lobster, but I loveddd this. I could have eaten that and two more plates on my own. The chorizo fondue was great...I mean who doesn't like melted cheese?? <br><br>Then, for our meal, we split the scallops, corn ravioli and a side of brussel sprouts. I didn't want the corn ravioli at first glance, but after tasting them, I could not stop eating them. Wow they were so good. And the scallops were great too - a bit fishier than most scallops. But I still loved them! And the brussel sprouts were very different from the usual brussel sprouts I have, but I still really liked them.<br><br>But for the grand finale...dessert!<br><br>They brought out a little sundae for my dad with a candle. They spared us by not singing happy birthday, but still made him feel celebrated. But the sundae was a brownie with fudge and a scoop of orange ice cream. The brownie was delicious and I'm a sucker for a good brownie. But the orange ice cream was weird...that's just a personal preference.<br><br>Finally, we ordered the ice cream pie and the peanut butter chocolate pie. The peanut butter chocolate pie was much too rich for me, but the ice cream crunch pie was so good! The crust was like a sweet graham cracker...and there was chocolate lined inside of it. I would highly recommend it. <br><br>Overall, the service, ambiance and food was amazing. They really know how to treat guests and make them feel special. It's a great location and it really treated us with a special experience. We with hopefully be returning again!<br><br>PS: it would be a great wedding location!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aQ76mzgbjnImZIxW1fetDQ/348s.jpg", "caption": "Side of brussel sprouts"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ovXFmDXi3bMmoC74x9VcMQ/168s.jpg", "caption": "Scallops"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qe_E9u4lbVmATjijgiXjQA/168s.jpg", "caption": "Chorizo fondue"}]}}, {"review": {"des": "I've been wanted to check this place out for about 2.5 years and finally my best friend and I decided to make dinner reservations after work on Thursday.  Their patio looked beautiful and the weather was awesome all week.  Then, of course, Thursday came and so did a huge thunder storm.  BUT we made the best of it and it inside is also nice.  <br><br>My fiance tagged along hah. We had some burrata to start, pretty decent but not memorable.  My fiance has the spanish octopus which he enjoyed on his own since my friend and I don't eat seafood.<br><br>For entrees, my friend had the chicken which was massive! And she actually managed to eat a good portion of it.  I had their tortellini which was really delicate and who my fiance had some other seafood dish which was also filling.<br><br>I definately want to come back when we can enjoy their patio.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jJrx3NeyfuWLIc9Hw7bf8A/168s.jpg", "caption": "Burrata"}]}}, {"review": {"des": "Really cool ambiance and setting. The open air dining room is really great for those summer evenings when you want the open air but don't want to endure the steaming sun. <br><br>Cocktails were fantastic. The GTO is downright deceptive - you could just easily chug the entire cup because it taste like juice!<br><br>The lobster is great for starter; meatballs had a good Asian (Vietnamese maybe) inspiration. Mussels were great, every single one of them were open and fresh. Overall good place for dinner.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/A7l3PGWmzc0tfYmqqyFQDQ/168s.jpg", "caption": "GTO, Arts & Crafts Time, and a bourbon based drink"}]}}, {"review": {"des": "I'd describe The Dawson as \"comforting with an upscale feel.\" My friend suggested this gorgeous spot for dinner plans on a Monday. She made a reservation for 5:30 PM, which was absolutely perfect because the lighting inside at this time was still sunny and welcoming in the midst of this never-ending winter! There is dark, warm wood throughout, with elegant ivory-colored walls and tall candles on every table. <br><br>Of course we began with cocktails, and if you're looking for unique mixes, The Dawson is a fantastic place for just that. While most of their signature drinks are whiskey-based, I'm more of a fruity drink gal, so there were two in particular that stood out to me. One was the Desert Blossom, which had strong flavors of apricot, lemon, and moscato. My favorite part of the Desert Blossom, however, was how beautiful it was: it was presented with both a flower *in* the drink, along with some more small flowers attached to the glass with a mini clothespin. A Pinterest dream come true! The other drink I ordered was the Red Dawn Rising, which had very recognizable flavors of pomegranate, pineapple, lemon, and raspberry. This drink was also gorgeous, so of course I took a photo! They really know how to nail down the aesthetics here.<br><br>As for appetizers, it was difficult to choose, because I honestly wanted them all. We tried their meatballs, which were insanely delicious but not overly filling if you're sharing. The roasted cauliflower was our second choice of app, and not only was it pretty to look at, but was crispy, and without a doubt the fanciest cauliflower I've ever had.<br><br>For my main course, since I'm a BIG fan of seafood, I ordered their mussels. Our waiter spoke very highly of the seafood at The Dawson, so I took his word for it, and I'm glad I did! My mussels were presented with an extra bowl to discard my shells into, along with bread for dipping into my broth. Our waiter even switched out my shell bowl halfway through the meal. Now that's classy. I felt full and fulfilled after my meal... but was still ready to look at that dessert menu!<br><br>I'm a big fan of banana pie, and their's was the absolute best banana pie I have ever had! Honestly! I would honestly go back *just* for that pie. I think the reason their banana pie is so different is because they put a banana compote on the piecrust, as opposed to just whipped cream. UGH. It was so good.<br><br>I highly recommend the Dawson for their great service, gorgeous interior, and their insanely delicious menu. But I mostly recommend it for the pie. Go, go, go!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/a-ptB4BZ8VMwY9_IjfPp0Q/348s.jpg", "caption": "Red Dawn Rising"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UnexEuv08Y2ZRnrm_LMwMg/168s.jpg", "caption": "Red Dawn Rising"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ltZAFw1BKqUjubG5Q5oSKw/168s.jpg", "caption": "Roasted Cauliflower"}]}}, {"review": {"des": "Wow, shocker, another five-star dining experience in Chicago. This city is so impressive!<br><br>A friend and I had a 5:30pm dinner reservation on a Monday, because we are grandmas (just kidding, we just wanted to go right after work.) We were seated right away, and I was taken aback by the beauty of this place. Clean wood tones, candles everywhere, a gorgeous bar -- what more could you ask for?<br><br>Our server was incredible and did a great job explaining cocktails, drinks, desserts, and everything in between. He definitely made the experience unforgettable.<br><br>I started out with the New Growth cocktail, made with cutwater barrel-rested gin, Copper & Kings immature brandy, St. Germain, falernum, honey, and lavender. Yeeeeah. It was like a garden in your mouth, in a really good way. I later had the Devil in a White Hat, but the mix of mezcal and sweetness didn't work for me. The entire cocktail list in general is really impressive, though.<br><br>Alright, let's talk about the food. Here's a rundown of what we ordered:<br><br>-Meatballs (rice noodles, hot & sour broth, cashews)<br>-Roasted cauliflower (masala, burnt lemon, crispy chickpeas)<br>-Tortellini (spring pea, mint, ricotta, cherry tomatoes, parmesan)<br>-Mussels (gochujang, coconut milk, lemongrass, pickled fresno, grilled miche)<br>-Macadamia banana cream pie (macadamia nut crust, banana compote, banana mousse, whipped cream, caramel, candied nuts)<br><br>I cannot sing the praises of this food enough. It was one of the best meals I've had in a long time. The meatballs were tangy, the tortellini perfectly creamy, and that banana cream pie -- just wow. This place is amazing! I'll definitely be returning.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/38_n1NrELmffHJLOQRgQ-w/348s.jpg", "caption": "Brussels sprouts"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8Y7g6p74_8ily9yuOX0ubg/168s.jpg", "caption": "Tortellini"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-lr37L9E-fiSQ4PrSdw6fg/168s.jpg", "caption": "Roasted cauliflower"}]}}, {"review": {"des": "Perfect date night spot! We sat outside and the ambiance was super cute. They even offered me a blanket since the weather was a little cool. <br>We started with the meatballs-Asian inspired with hot and sour broth and rice noodles. They had a little kick to them- perfect dish to share for an appetizer. <br>For entrees I had the cavatelli pasta and my boyfriend got the butcher's sausages. We also ordered the Brussels sprouts to share. <br>All the portions were large and we took home leftovers of all of them!<br>While I didn't try the sausages my boyfriend said they were super good. And the pasta was delicious! It had a lot of meat between the pork ragu and the sausage pieces which made it very filling. <br>Too full for dessert but I'd definitely come back to try it!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tvO0xfWCE_gXikURb-5mBA/168s.jpg", "caption": "Cavatelli, Brussels sprouts, and Butcher's Sausages"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qMaXeYWDJBFxaB12FMusKA/168s.jpg", "caption": "Meatballs"}]}}, {"review": {"des": "We came here with a large company for a celebration. We were seated indoors since the outdoors can't accommodate large parties. The indoors was mostly empty so the vibe wasn't there. <br><br>Food was good - the oysters were really good though they only had a single type. I had the branzino for my main, which was really well prepared. Others in our party were mostly happy with their food as well. <br><br>Cocktails are mostly whiskey-based but they also had a gin based one (GTO it was called) which was pretty good. A bit generic though. <br><br>Service was slow - we were not approached for orders for a long while even though the restaurant was half empty. And then it took a while for the food to arrive. On the other extreme, my water would get refilled even if I took a sip - the guy was almost camped out around our table. <br><br>Finally, even though my dish was good, there weren't that many options on the menu that I'd want to try - most of the menu is a bit of a glorified comfort food. It's also overpriced for such food. I'm not sure if I'll revisit.", "pics": null}}, {"review": {"des": "Not a fan. My experience started off to a weak start. I was there with a group and was one of the first to arrive. Not positive whose name the reservation was under, I named a few names. When I didn't recognize one, I asked the hostess if she could let me know the other names she had down for our reservation time. She then named a name, that I realized was someone's husband from my party. After declaring that that was the reservation she asked me to sit and wait for my party so that it could be determined if it was the correct reservation, as if I was there to steal someone else's party of 7 brunch reservation! The hostess was needless to say rude and very uppity. <br><br>Once seated, the waitress was fine. She wasn't very friendly and sort of took orders like a drill sergeant. I had to request that my coffee be refilled. My salmon breakfast was also a bit fishy smelling and un-fresh. I'm a major lox fan, so I certainly know the difference between a good and bad smoked fish. <br><br>I definitely won't be back. The Dawson is way overrated for what I experienced. Find another trendy brunch place and you'll be much happier!", "pics": null}}, {"review": {"des": "Overall: The ambiance and drinks shine brightly at The Dawson.<br><br>The good: The drinks are spot on, no matter what you're in the mood for. Our larger table got a healthy mixture of wine, beer, cocktails, and everyone seemed happy with their decisions. My personal choice, The Buddy System, was unique and robust in flavor. The patio was a highlight as well, with a varied mixture of greenery to go along with the \"suburban deck\" vibe. The elotes were incredible and the tuna ceviche was also a standout food-wise. <br><br>The not-so-good: Some of the food was great but others were misses. The famous chicken fried lobster was disappointing due to being surprisingly too fried and chicken-y, with not enough emphasis on the lobster side of it. Plus it was far too small, with each person only get a bite or two if you split with 4 people. Also, the meatballs were bland and the broth they were served in wasn't very flavorful or spicy. <br><br>Atmosphere: 9/10<br>Service: 8/10<br>Food: 7.5/10", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_F0-_yRYHUWIYiFMtGB0Cg/348s.jpg", "caption": "Tuna ceviche"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Km1nMGWRwSKtIpmsmxIFtw/168s.jpg", "caption": "Meatballs"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tFH6PHX8fDkxO4Ms5Ombmg/168s.jpg", "caption": "Elotes"}]}}, {"review": {"des": "Such a cute space! The Dawson is an adorable restaurant with a great patio space for warm weather. We came here for brunch on a Saturday morning and had no reservation. We were able to be seated at their full service bar immediately. It was a very pleasant surprise when we were expecting to be waiting at least an hour. <br><br>We indulged in some of their brunch beverages and had an amazing meal. We started with the bacon plate (literally the most amazing bacon I have ever had, the cinnamon one is unreal if you're a fan of cinnamon rolls - you can't find bacon like this anywhere else in the city) and we're not disappointed. I had the chorizo hash tacos, and my friends had the steak and eggs and the Brussel sprout hash and loved every bite. <br><br>The service was quick and friendly, and the good was amazing. Great way to spend a sunny day in Chicago for any meal!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1E9O_P4w-JrZ88Do4pxu_A/168s.jpg", "caption": "Bacon Flight"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ej-_x6e-tmncsj6TgcRTDA/168s.jpg", "caption": "Chorizo Hash Tacos"}]}}, {"review": {"des": "This spot is beautiful, as everyone who passes knows, and I am so glad I finally tried it for its famous brunch atmosphere and dining. Especially on such a beautiful sunny day, this was quite the experience. Our waiter was very quick and accommodating as well.<br><br>I had the brussel sprout hash with chicken sausage. Even though I didn't originally order the chicken sausage with the dish, it was still a delicious touch. I loved the flavors of the brussel sprouts with the sweet potatoes. This went down nicely with a refreshing aperol spritz. <br><br>Overall, this is a perfect brunch or lunch spot on a nice sunny day, and the food and service won't disappoint!", "pics": null}}, {"review": {"des": "I hate to be that person who writes a somewhat negative review because of the service, but that can play a big role in the experience of the meal. My sister and I took our Aunt and Uncle out to dinner and chose The Dawson since they hadn't been here yet. First, I'll start off by saying the food itself is really good, and I really enjoyed the ambiance of the restaurant. <br><br>Our server started out great, however, there was more than one occasion in which he forgot one of our orders. I noted he did write down our orders, and looking back, he probably should have. We all received our main dish except for my uncle. I get it, that sometimes happens. However, after at least 5 min. of us waiting to eat until he received his meal, we realized the server had forgotten to place his order. My aunt then asked for a glass of wine, which took much longer for her to receive than it should have. (She requested the glass when she received her food and didn't get her glass until halfway through her dish). Lastly, we had placed an order for the Shishito peppers. When we told the server we never received them, you could tell him gave an answer to try and cover up the fact that he forgot to put in that order with the chef. <br><br>If I could give 3.5 stars, I would, because I don't believe The Dawson should be knocked down 2 full stars because of the service, especially since the food was so great. I'll definitely be back, but I hope to not have the same experience the next time I dine here.", "pics": null}}, {"review": {"des": "I was looking for a nice dinner spot for my short trip to Chicago, and The Dawson definitely fit the bill! <br><br>They have a huge patio that I imagine would be magical during the summer, but it was a tad chilly that night so we sat at the chef's counter right in front of the kitchen. It was great to see the inner workings of the kitchen and to chat with the chefs about the dishes. I was talked into the special for the night, and I have absolutely no regrets about that decision. It was the sous chef's take on a traditional Mexican dish from his childhood, roasted poblano peppers stuffed with duck confit. There was a nice balance of savory, sweet and sour from the pickled scallions, would highly recommend this dish if it's still around. The chicken-fried lobster was a great starter, I enjoyed the dip that went with it. Next time I probably wouldn't get the mac and cheese -  the cheese wasn't mixed throughout, but more so sprinkled on top of the mac and placed under the broiler, making for a bland mac and cheese. <br><br>The cocktail menu was unique, we had some decent drinks, and all of the portion sizes were huge for the dishes. Would definitely come back the next time I'm in Chicago!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JJJk8y-6UMO5VqNpUHprRw/348s.jpg", "caption": "Chicken-Fried Lobster"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BxwwnBqeo08fhb8YVNENhw/168s.jpg", "caption": "Dinner Special: Duck Confit Stuffed Poblano Peppers"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/l1dyYvnR_2jATDG-BHip4Q/168s.jpg", "caption": "House-Made Cavatelli"}]}}, {"review": {"des": "If you're interested in good food and great drinks, then you fond it. Try sitting at the bar and taking it easy and casual. Very nice", "pics": null}}, {"review": {"des": "I really really wanted to love this, and since prices, hype, and expectations were so high, I'm giving this a solid \"meh, it was ok\". <br><br>We came at 5:30 on a Thursday and sat on the patio, which is absolutely fabulous. I would highly recommend sitting outside if the weather agrees. <br><br>Since it is summer, they are doing a camp theme, so I got a \"bottled bug juice\". They have 3 varieties, all which come in a really cute little bottle reminiscent of summers as a child. However, the \"red rover\" variety was just awful. It tasted like medicine, and was just so, so incredibly gross. I was kinda choking it down because I'm not one to pay for something I'm not going to drink, and the server noticed. She got me something different despite my protests because I don't want to be a burden, but the GTO cocktail was a billion times better. <br><br>We started with the chorizo fondue, which is essentially a queso fundito, and that was incredible. SO good. Very meaty and delicious. <br><br>I ordered the fried chicken (with fried plantains, rice & beans, and hot sauce), and my bf ordered the burger plus egg and bacon. <br><br>The burger was great. It was more well done than medium, but the flavor overall was good and the fries were amazing. <br><br>The chicken...not so much. Luckily my bf switched entrees with me because I found the chicken to be flavorless and the hot sauce to be nothing but vinegar. May just not be my style, but when fried chicken is flavorless without a sauce, I think that's a bad sign. <br><br>We also had mediocre service. I don't know if our server was new, but she seemed flustered and overwhelmed the whole time. Outside of realizing I hated my drink (when there was no one on the patio), I don't think she paid much attention to us at all. It took about 30 mins from when our last dish was cleared to when we actually signed our check. <br><br>Overall, it's a great patio and I think it has a lot of potential, but I'm not sure they know what their culinary identity is. The menu is all over the place and while the burger was great, I don't think they've nailed down anything that can give them some real recognition outside of their atmosphere.", "pics": null}}, {"review": {"des": "Work events are even more fun at the Dawson. I was so excited to hear our evening happy hour would be at The Dawson. I've heard so many great reviews, so finally it's my time lol. This place is super dope, dimly lit and sexy. Would be perfect for a miniskirt and a hot date night. Before heading upstairs I stopped on the main floor just to peep the ambiance. It was sexy for sure. I must plan a date night here. I loved the chandeliers throughout the spot as well. Upstairs was a smaller more private room where myself and my coworkers enjoyed complimentary wine and beer. We also over indulged on small bites. Omg the food was so savory and flavorful. There was spicy chicken sandwiches, bruschetta, cheesy stuffed mushrooms, and mini shrimp tacos. Cool after work vibe, I can't wait to come back.", "pics": null}}, {"review": {"des": "Bravo!<br><br>This would have gotten 5 stars except the service was very slow. <br><br>Upon entering the Host was nice and greeted us with a warm smile asked for our reservation and got us seated immediately even this we were a bit early. I had to ask about coat check tho. <br><br>Once seated we got water as soon as we sat but after that service went down hill. Although nice our waiter was very slow and the food took forever to come to the table. <br><br>On the brunch menu: bread pudding French toast for the table. This wasn't my favorite but it was good. <br>Brussel sprout hash- THIS DISH! Was so full of flavor; cooked to perfection and the substitutions and add ins were all added to my liking. Excellent for vegans and meat eaters. <br>Chicken fried lobster- my mother and sister order this. Great choice! They were in heaven crispy fried lobster seasoned to perfection. The only complaint; it's not enough! Make sure you get a side. We got the French fries. And man those fries were good. Crispy on the outside soft on the inside, season but not too much. We tore them fries up!  I will say they are one of the best I have had in a LONG while. <br>Mac and cheese for the nephew. Large portion easily shared for the table.  I didn't try it, but the consensus was two thumbs up. <br><br>Last but not least the cinnamon raisin sticky bun! Huge, but once you taste it you won't want to share. This thing is so yummers and I'm not even a sweets person. It's perfect just enough sweet just enough sticky. The raisins add just enough yumminest. I will say that the icing is a bit over kill I ate most of my portion without it. <br><br>As for drinks mom and sissy had the Bloody Mary and both agreed they were one of the best they have had. I would suggest trying one the the craft cocktails. They have many to choose from. <br><br>I will be back. Hopefully the service will be better and I can give them that 5th star!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3EvKdJJFgIpIDhly_qzFYw/348s.jpg", "caption": "Brussels Sprouts Hash"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jLkyNxZp6-3aFk356T2BNQ/168s.jpg", "caption": "Cinnamon Raisin Sticky Buns OMG"}]}}, {"review": {"des": "My first time eating there last night (had been before for a party upstairs) and it w+56as fantastic.  We sat outside and split the cauliflower appetizer and the beet salad - both were so good and highly recommended.  One guest tried the Dawson burger with mac and cheese and liked it a lot ...one guest tried the steak frites which also got a high mark...he was disappointed in the flies - he was expecting the string type fries - these were more like steak fries BUT I felt they were either baked after being fried or double fried as the coating tasted crispy - I thought they were very good.  I got the house made cavatelli with pork ragu - wow that was amazing!  Had a great spicy flavor to it.  I was thrilled that I had some to take home!  Our server was great - all and all a really good experience and can't wait to come back to try the brunch.", "pics": null}}, {"review": {"des": "Chorizo hash - very oily and heavy. Recommend splitting with someone to balance with something lighter. Very delicious, but I could t eat more than one taco. <br><br>Staff was really great as they sat us an hour early before our friend arrived! Venue is very beautiful. There was a wedding going on upstairs when we went.", "pics": null}}, {"review": {"des": "After a trip to the pop up 'happy Place', we needed to make our belly's happy too! We walked past a few places and then The Dawson caught our eye. This place has a great dining area and the outdoor aspect feels open and fresh. Two of us had the whole chicken and it was good. It was my first visit here, but I would happily go back again.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lUYAhLO513ugHUc9sJDZQQ/348s.jpg", "caption": "Roasted chicken with Grilled Asparagus"}]}}, {"review": {"des": "Been here once before for drinks. First time eating. Food was pretty decent! I really like the ambiance and how large it is here. <br><br>We got the bacon flight - this was fun. It was salty.  An explanation of what each type of bacon was would have been helpful. We kind of guessed what we were eating on our own based off the menu. <br><br>1/2 off bubbly bottle special for New Year's Day. This was worth it - I otherwise most likely would not buy a champagne bottle here. <br><br>My dish was okay. I got the steak & huevos rancheros. I'm not a beans person so a giant side dish of beans was just kind of blah for me. <br><br>Dishes are on the pricier side $15-$18. Service today was just okay, but not exceptional.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pQ66DbZ4icaQTerL-CAOWw/348s.jpg", "caption": "Dawson Burger 1.1.2018"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/swG_SxGYiXwJV6C0BozR3A/168s.jpg", "caption": "Steak & Huevos Rancheros 1.1.2018"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KVpyu83xH0Xz2iHWvaPb5Q/168s.jpg", "caption": "Bacon flight 1.1.2018"}]}}, {"review": {"des": "Dawson has a very great and fun vibe.  I ordered the scallions which were moist to perfection.  The only reason I am rating this a 4 star instead of 5-star is because the chicken fried lobster was not a great portion.  It tasted really good, but we were told that we can share, and it barely feeds one or two people.", "pics": null}}, {"review": {"des": "First time here and it was a hit for Father's day. The only thing I dont particularly like is that we had a 10:30 reservation and the doors were locked at 10:25. I get that you dont open until 10:30 but you should not make customers wait outside. Anyways, the drinks were delicious I reccomend the blue bug juice. Avocado toast was amazing with burrata, next time i will ask for a poached egg rather than how it comes which is scrambled. The cinnamon bun was massive and covered with icing, great for sharing. My husband loved the burger and the bacon flight was a fun way to start off the meal.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MLZTYvDKp4RhfFdZO0tKwQ/348s.jpg", "caption": "Crab mac and cheese"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JADGh2RLZnc-HIzwHO1IDw/168s.jpg", "caption": "Burger + egg"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fkKxzBTbZVbnwXx_ifx8_A/168s.jpg", "caption": "Cinnamon roll"}]}}, {"review": {"des": "Great place any season. Love their private patio in summer and dinning room at winter. Second flor is available for private events and is open for dinner on weekends. On Saturday and Sunday brunch is served. The rest of the week it's dinner only. <br>On my favorite drinks list at this place are: Talk to the Hand, Save tonight (my choice number one) and Livin' La Vida Loca. <br>From appetizers I would recommend Tuna ceviche (my favorite), Buratta and Mussels. <br>Main course choices would be Hudson Bay scallops, Arctic Char and Filet. <br>I love the atmosphere and candle light.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iImnlZbWzQEkCQpKeYjz5A/168s.jpg", "caption": "No No Man's Fool"}]}}, {"review": {"des": "I'd have to say, this place exceeded my expectations for brunch. Came with a group of 8 today and tried a variety of items, including avocado toast, cinnamon rolls, bacon flight, chorizo hash, breakfast torta, and diner classic.  <br><br>My favorite was the breakfast torta, but it is a tad spicy.  The chorizo hash was good, a lot of cheese but the pickeled onions make it great.  Cinnamon rolls were to die for, and great to share 2 orders for our table of 8.  The bacon flight was good- I'm not a huge bacon person but the table thought it was fun to try the different kinds. I was nervous about the traditional diner classic not being enough food, but the \"sausage\" they give you is equivalent to two full brats, and the bread is thick.  Definitely filling.<br><br>The smallest portion was the avocado toast- it was really only one piece of toast and was pretty small.  Would highly recommend- great vibe and great service!", "pics": null}}, {"review": {"des": "Really beautiful space and awesome brunch food. One of my new favorite brunches in Chicago. <br><br>Went on a Saturday at 11am with a group of 5. We had a reservation but it did not seem that one was needed, it was not crowded at all. To start we ordered from their brunch cocktail list (though all the cocktails from their HUGE cocktail menu are available). The Chandon 'Sweet Star' was a nice refreshing light drink. The service was good, our water glasses were never empty.<br><br>We ordered one of the Cinnamon Raisin Sticky Buns to share. I was huge and omg, so good! Our table ordered the yogurt & granola, chorizo hash, avocado toast, brussel sprout hash, and kale & farro salad. Everything was super good! My favorite was the brussel sprout hash, it had lots of good veggies. <br><br>For how good this place was, I cannot believe how empty it was.", "pics": null}}, {"review": {"des": "This is one of my favorite brunch spots, its the perfect place to have some food and drinks and to enjoy the nice weather. They have a great outdoor seating area and play live music sometimes. Their food menu isn't extensive but i've always enjoyed their brunch menu as well as the chicken fried lobster and their oysters are good too. Prices are on par with other locations in the area ($14-18 for entree and $13 cocktails) and service is always great.  On a random note, we came here for restaurant week a few years ago and they had a duck confit brunch dish with jalapeño grits (i think) and it was hands down the best brunch meal I've ever had. But sadly I've never seen it on their regular menu", "pics": null}}, {"review": {"des": "Had such a great time at The Dawson. My friends and I mainly came here for the beautiful environment but we were pleasantly surprised by the delicious food and attentive service. <br><br>Service was never difficult to find and water was constantly being refilled. Our waiter was also very patient with our indecisiveness on what to order and was able to accommodate all our requests. Also, the hostess allowed us to explore the upper level of the restaurant since it wasn't being used for dinner service and hang out at the balcony - she even offered to let us eat there if we wished!<br><br>My favourite thing here was the mussels - highly recommended! It came out a lot larger than we anticipated and the waiter was awesome and kept giving me bread to dip into the delicious sauce.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4zUl9c4x95dkCpz55Ra4PA/348s.jpg", "caption": "Ginger beer"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/AaAs2QIHdr0PMDDgzlcuLA/168s.jpg", "caption": "Beautiful restaurant patio!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TyHDYVIG5XCBYSqYSM-SZg/168s.jpg", "caption": "Our spread for the night"}]}}, {"review": {"des": "This place is super cute and has really great food! My only complaint was a rude waitress.  BUT I wont judge the entire place off of her behavior...<br><br>I came for brunch during a trip to Chicago. I went halfsies on the avocado toast (nothing to write home about) and the Chorizo hash which was AMAZING.  <br><br>The bloody mary was strange. I didn't like it didn't have the right seasoning or whatever.  Everyone else loved their drinks though so its all good.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/T5mGGoV1ziKThDnHCKAXQA/168s.jpg", "caption": "Chorizo Hash (it was bomb!)"}]}}, {"review": {"des": "thoroughly enjoyed this date night. the glass of pinot noir i had was absolutely delightful to start. being vegan they were overly accommodating. they showed the options on the menu both as they are and how they can be adjusted. they made me a special entree and it was delightful. the service was impeccable. the ambience was perfect. i hope to come back again.", "pics": null}}, {"review": {"des": "Overall a really top notch experience! We snagged a 7pm reservation Friday night via open table and made our way over. <br><br>The restaurant is relatively big and it was packed on an Friday night! We got seated in the same room as the bar and it was definitely buzzing with larger groups and happy hour dwellers. It was rather loud - we had a hard time hearing the waitress and couldn't talk in normal conversational tones. But, hey it's Friday and people were happy!<br><br>We ordered the frozen daiquiri and burrata to start with. The daiquiri was really light and fresh, we really enjoyed it. The burrata was very good, it had more savory notes to it with the fresh greens on top, veggie chips, and yummy cheese. I do wish there was a standard jam we couldve added to it, but it was good overall. <br><br>For our main course we ordered The Dawson burger, mussels, and a side of fries. It wasn't obvious that fries came with the burger (we should've asked) so we should've skipped on the extra side. The burger was decent, per my husbands review. This area is crawling with really, really good burgers (the chevals) so the standard is high in the west side/Fulton market area. The mussels however were amazing! The broth echoes my favorite Thai soup, Tom Kha, with its coconut milk and lemon grass. It was rich and savory and so delicious!<br><br>Service was fast and very attentive. We got new silverware with our courses and our waters were always full. It was a great meal and we'll definitely be back.", "pics": null}}, {"review": {"des": "We enjoyed brunch so much that I cannot wait to come back during the summer to enjoy their kick ass patio.<br>They have so many yummy options to choose from that it was hard to make a decision, nonetheless, we went with the avocado toast, hungarian-style bacon, bread pudding french toast, cinnamon raisin sticky bun, and chicken fried lobster. The toast was really good! It's definitely more decadent than most places that just smear avocado on toast. The bacon was great, but the french toast was not good. It was just too sweet and had an aftertaste that we did not like. However, the cinnamon bun was great; I would suggest that you ask for one that's not too well done around the edges. The star of brunch was the chicken fried lobster! OMG it was amazing! I just wish they gave you more.", "pics": null}}, {"review": {"des": "3.5 stars to be exact.<br>I had a great time here and I think it's a great place, but when I reflect on it, I think the ambience mostly holds up the rating whereas the food itself was mediocre. <br><br>Don't judge a book by its cover. This place is beautiful on the inside. The vibe and people makes you feel energetic and young. I loved the outdoor patio and the fireplace. There's both an indoor and outdoor bar if you're looking just to drink or to wait at while getting seated. Keep in mind that the bar is also full service, so it's a little awkward to wait around if you're just looking for a drink without getting a bar seat and the service is also a bit slower.<br><br>Here's the food breakdown:<br><br>The cocktails are delicious. I had \"da bomb\" which was literally da bomb. It reminded me of a boozy version of Vietnamese pickeled lemonade which is like a salted lemonade. (4/5)<br><br>Spanish Octopus (4/5)<br>Very delicious appetizer. Octopus isn't easy to execute. <br><br>Hanger Steak (3.5/5)<br>I am a carnivore at heart but the element on that dish that I liked the most was the polenta which deserves a 5/5. It was so delicious and creamy! The steak was cooked well but not nearly as memorable for a steak dish.<br><br>Halibut (1.5/5)<br>It tasted like a waste of potential. White fish is a double edged sword. The beauty in it is that is a great medium to absorb flavor. The flip side is that on its own, it has a very subtle flavor and can be easily overshadowed. The way it was prepared was bland. The vegetables did not enhance the dish either. They just seemed like filler. While that execution may have been to highlight the pureness of the ingredients, I think the Dawson has too many upbeat elements to it to have had such a humble dish.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KkMJt01YZ1AJ4dnqfuWU-g/348s.jpg", "caption": "Halibut"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QXa0inF3RMV4P8GChnlTBA/168s.jpg", "caption": "Hanger steak with polenta"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qfsxgLy7R4HPfr6SzoAmUw/168s.jpg", "caption": "Da bomb and As If"}]}}, {"review": {"des": "I honestly loved this place. From the moment I walked into the big wooden doors, admired the chandeliers, walked to the patio...the rest was history. <br><br>The hostesses pleasantly greeted us at door. They were ready to seat us but we wanted to wait for the last two people of our Sunday brunch party. When they arrived, we were taken back to the patio, where I requested to sit in my reservation. <br><br>- I have never heard of this place until I researched restaurants with patios a few weeks before (we went in July). The patio had plenty of seats, string lights, a bar, and even a fireplace for when it gets  chilly. So glad to have found this place! - <br><br>Now onto the food. While looking at the menu, everything looked delicious (which I knew of course, since I look at menus beforehand) but even K mentioned how hard it was to decide! We ended up ordering the Mac 'n cheese, steak and huevos rancheros, chorizo hash, and something w tortilla that I'm not sure is still on the menu. <br><br>Man, were the portions huge! Most of us couldn't finish our food no matter how bad we wanted to. Talk about a food baby! <br><br>Lastly, we shared dessert with the birthday girl who they gave ice cream and cake to. I love when restaurants remember little notes like that on reservations! ..Thank goodness too because our waiter was hard to flag down for more water. <br><br>Overall, great experience and I'll be back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qKkw8LIIFBQraELcDAiqRQ/348s.jpg", "caption": "K and I with the birthday girl"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mKIw4_Pz116q-CnGDHKZhw/168s.jpg", "caption": "Noms"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Bzgc7ALYW9HR8e_bv7ePMg/168s.jpg", "caption": "Interior when you walk in"}]}}, {"review": {"des": "My boyfriend and I went here last Thursday night for a date night. My two good friends that work there, Angel and Phu, have been trying to get me to go for the longest time. Sat outside since it was a really nice evening and had some wine, had some dinner it was delicious.<br><br>He got the steak I believe and I got the salmon. Both were delicious, the steak was perfectly cooked and the salmon had an amazing crunch to it. <br><br>We also had the octopus appetizer and then the cheese fondue... sorry I am forgetting all of these names. <br><br>Loved that we sat outside and appreciate the fire pit that was nearby that chased away those pesky summer night mosquitos. Highly highly recommend! If you go there ask for Phu's section :) he is an outstanding server, friendly, never had us sitting and waiting on anything -  very top of his game!", "pics": null}}, {"review": {"des": "I had always wanted to try this place as I have passed it a ton of times! Finally, my friends decided to do their monthly restaurant club there tonight. We came in two groups, but both were able to score tables on their awesome outdoor patio. While the building looked huge, the padio was the place to be! <br><br>I started with a Malbec blend glass of wine. Perfect with my meal and a pretty large glass. Most of the rest of my table got mixed concoctions including the pretty Blue Lagoon Bug Juice. I probably should have gone with that instead of playing it safe with a nice glass of red. <br><br>We all wanted to try the Chicken Fried Lobster as an appitizer, but we were a little worried on the size. The server suggested our group of 7 get 2x the 3 piece dish. While the lobster was fantastic, it was very small and each person only got about 4-5 bites. It seemed a little expensive for what you got, but it was still good! The spicy ranch was a real standout on this dish. <br><br>For dinner, I played it a little safe and went with Steak Frites. Steak Frites is literally steak with some French butter and fries! Simple, but usually very tasty. That was the case here. The Dawson prides itself on its wood fire grill so I was excited to try it! The steak was good, but I was expecting it to be a little more woody flavored. The part that wowed me was the fries and the pecorino aioli that came with the fries. That was probably the most memorable part. It appears that the Dawson does super well with the sauces! <br><br>One of my other friends got the Steak Frites as well (she seemed to like it). Others got the mussels (a little small), the elotes (huge and worth the money it seems), pasta, and sausages! I didn't hear many complaints so I am assuming everybody was happy with what they ordered. <br><br>We finished off the meal with three of the desserts. I got the macadamia nut banana cream pie. I loved it and they really roasted the nuts and candied them to perfection. We had a brownie sundae with orange ice cream. I liked the ice cream, but I thought the brownie was a little strong. We also got the peanut butter chocolate cake which strangely enough, I actually didn't try! It looked good and those who did try seemed to like it!<br><br>I gave this place four stars instead of five because there were some customer service issues. First, they seemed to have given up the table for our 7:15 friends who were supposed to sit next to us. They were told their option was to wait 45 minutes or eat inside. They waited, hoping it was going to be shorter and ended up waiting about 20 minutes or so. They were nowhere near us, but they seemed to like their table either way! Also, the service was a little weird. Our main server was great, but we only saw him a few times during the evening. It seemed like he had way too many tables for one person. This is not the place to go if you are in a hurry. Service was very slow, but the outside was nice so we didn't complain. They seemed to fill our water glasses super quick even though the bottle was on our table. They also cleared off our table a little too quick and aggressively like they wanted us to leave.  They took my friend's beer glass when it still was 1/8 full. It was so jarring that my friend on the other side noticed it too. Maybe it was a bad night, but service was not that great! <br><br>In all, I had a great time and will probably return to eat and drink outside on a nice evening. The food was good, but it was a little on the pricier side. There are some real deals on the menu, but you gotta look carefully!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ijyn7VPav5FGJrLraAiwPQ/348s.jpg", "caption": "Across the street"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NHn7ipT-eu8omoUSOuXMUw/168s.jpg", "caption": "Outdoor Seating"}]}}, {"review": {"des": "I overall enjoyed my experience here both for brunch and dinner.  The Dawson has a wonderful aesthetic with the exposed wood and really intriguing lights.  I also love the patio area that has a unique, relaxed feel to it.  It's also a surprise because you just wouldn't guess this cool patio exists when you just see the building from the outside.  They also played decent music like LCD Soundsystem adding to the ambience.<br><br>The service is also very pleasant ranging from the hostess to the servers who are knowledgeable about the food and aren't too much in your face but also aren't negligent.<br><br>For brunch I remember having the avocado toast and it was the best avocado toast I had because it had this amazing burrata on it.  This avocado toast puts so many other avocado toasts to shame.  I also really like the Bloody Mary and thought it had a perfect balance of spices.  Their dinner cocktail menu is also decent and I had a very tasty Sin and Virtue cocktail, which had basil and bourbon.  I mainly ordered it for the basil and I think it could have been more present but maybe that's just because I love basil more than booze.<br><br>The menu is a bit limited when it comes to vegetarian options and it is even more so for the dinner menu.  There was just one entree that was vegetarian.  But since I am pescatarian I had more options.  We started off with an order of raw oysters, which tasted very fresh and I loved the dipping sauce for it.  I wasn't too sure what it was but it had a green chile flavor to it but it didn't overpower the freshness of the raw oysters.<br><br>For the entree we each had the halibut.  It looked great on the menu and it was recommended by our waiter.  The halibut was absolutely flavorful and delicious with a lot of different components to it.  The portion was perfect, it wasn't too light or too heavy.  The halibut was prepared very well in the lemon butter sauce and it went so well with the crispy sunchoke.  The soft and crisp textures complimented one another very well.  I also love artichokes so I appreciated that it was in there but I would have liked for there to be more artichokes.  <br><br>I think for the more casual vibe it has and the portions, it could be a bit more less expensive.  But it was an overall great experience and I will be coming back here for brunch again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/79bSxFJ7xoAPpIzgo63h7Q/348s.jpg", "caption": "Halibut"}]}}, {"review": {"des": "Very open and airy inside, has a polished but rustic-ish atmosphere. Like very elevated and modern hipster. They have an event space upstairs.<br><br>Service was great. We had brunch. The avocado toast looks like a piece of art and is certainly enough to fill you up, it's not a puny/simple one that you can make at home. I would highly recommend.<br><br>The bacon sampler was very good, but the star was the cinnamon bun. I usually hate them for being sickly sweet but this one tasted heavenly, fresh, homemade, and had traces of rum flavor. The icing was not too sweet.<br><br>I got the brussel sprout hash with chicken sausage. The sausage is really flavorful. It is one disc of sausage rather than crumbles which I wasn't expecting, but it tasted good. My dish was cooked great and I liked how it wasn't mostly potatoes which some hashes are.<br><br>Heads up that the lobster is just lobster with no sides, so I wouldn't order that as your only entree.", "pics": null}}, {"review": {"des": "2 and a half to be exact. <br><br>My husband and I went to Dawson's for a birthday party. The reservation was made as a private party so there was a prefix menu. <br><br>We ordered the following:<br><br>Old fashioned and whiskey - they had a pretty good old fashioned. Both drinks had a light pour. <br><br>Bacon wrapped dates - tasty but the bacon was a bit overcooked. <br><br>Burrata - delicious! The soft mozzarella with creamy center works perfectly with  miche, fennel mostarda, and cape gooseberry. The dish comes with speck ham, which is very good and not gamy at all. <br><br>Chicken Fried Lobster - breaded fried lobster, similar to the one you get at a Chinese restaurant. It was just ok. <br><br>Halibut - I have had better halibut, the texture was nice and soft but the dish was overall very bland. I did like the black olives on the fish. <br><br>Hanger Steak  - think skirt steak (comes out already cut) but not a very good one.. We ordered medium rare and it came as medium well. The meat was tough and I could not eat more than one piece. The side of polenta it came with was very good, perfect substitute for mashed potatoes. <br><br>Overall the service was very good considering we had one server for a table of 18 people. At one point, my husband ordered a drink and it magically appeared within a few minutes without us noticing (maybe we had a few too many)!<br><br>I would not go back for the food or drinks.. But do I go back for the service only to a restaurant? Probably not.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Gr29xb9IXP5Lm-lpWcQGQQ/348s.jpg", "caption": "Hanger steak"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/O12u0Qv2wyrbBszeqtztDg/168s.jpg", "caption": "Halibut"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/E3T47EmW5IlmIMtI4CCP7A/168s.jpg", "caption": "Burrata"}]}}, {"review": {"des": "Pretty standard great Chicago restaurant with a great atmosphere. Two of us at the table ordered the scallops. I ordered a side of broccoli as well. Our scallops came and I could see the look of disappointment on her 120 pound body's face. There was four scallops on the plate. My friend finished her portion and then asked for another menu to order more food. The scallops were good but feel more like a small plate than a meal. The broccoli was SUPER spicy. The table really enjoyed the mashed potatoes. Drinks were all outstanding. My tip, if you order the scallops make sure to also order a side or app.", "pics": null}}, {"review": {"des": "This place is amazing and phenomenal. I love the wooden door at the restaurant when you walked in and it is so eclectic since no other restaurant I went to have that kind of door. When you walked in there is stairs that go upstairs for another area I guess for a party or private event. By the hostess area when you look up in the ceiling is adorn with these circle like ornaments which is so pretty. This place is so modern and trendy which make for great ambiance. There are another separate door to go inside to be seated. The place was packed and the noise level was kinda loud but not to loud that you can't hear. I couldn't catch the waiter's name since he talked English with an accent. My friends and I shared a chicken fried lobster but I must say it was good but wasn't worth the price. One of my friend had fried chicken with shishito pepper, black beans and rice with hot sauce on the side and it was really good. I asked the waiter to pick between steak frites and lamb shank. The waiter said lamb shank so my friend and I went for it. The lamb shank was amazing with great flavors. The lamb meat was fall off the bone tender that came with coucous, polenta and cippolini onions. We didn't get no desserts because nothing caught our eye the we wanted. There was a lot of people sitting at the bar drinking. Where we sat, you can see the open kitchen. These place is by far one of the best restaurant I have been to in a long time and it is in the west loop not far from the warehouse district. They have a great selection of wines and other drinks. This place will be perfect to get dress up and have a date night or a big social gathering. I am so happy that I came here since I go to other restaurant around the area. I would go back to this place in a heartbeat and try other dishes on the menu.", "pics": null}}, {"review": {"des": "This place has a nice space and great patio but the food was a REAL disappointment. Do not, I repeat do not eat the meatballs here. They were absolutely disgusting.( you've been warned) the sausage entree was just ok. We also tried the ceviche which was decent but the chips served w it were stale & chewy. <br>I'm not sure what happened here,  the ambiance is beautiful but the experience was definitely not one we'd come back for. I heard cocktails are good here but I wouldn't come back here to eat.", "pics": null}}, {"review": {"des": "The Dawson has a nice selection of shareable plates and one of the best spirits lists in town.<br><br>We started with ceviche and the bacon wrapped figs. Both were excellent. Buratta was less impressive and seemed a bit flavorless, although the grilled peaches accompanying it were good.<br><br>For mains we had the fried chicken and the bacon burger. Both of these were also excellent.<br><br>We also had mac and cheese, and grilled asparagus as sides. These were both tepid, but the manager happily replaced them and the hot versions were excellent.<br><br>The outside dining area is one of the most pleasant in town, and I can imagine it being lovely to sit by the fireplace on a cool night.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tRyuYJagz_rzw_yHDgq9XQ/348s.jpg", "caption": "Fried chicken"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CbLZp6szympTHU03ibG4dw/168s.jpg", "caption": "Mac and cheese"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Yl8D1BEHX8D1tyVUrexSYw/168s.jpg", "caption": "Asparagus"}]}}, {"review": {"des": "You can never go wrong at The Dawson. Had brunch for the first time and we nearly had to be rolled out. So freakin delicious!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hPeS6azaGkj1ktWRG8XNow/348s.jpg", "caption": "Not sure why I ordered avocado toast. Oh yeah - the burrata. Add bacon = AMAZING. Not typical of my brunch selections, but to die for!"}]}}, {"review": {"des": "Tried the Dawson for some late night eats and to get some use out of my Restaurant A La Card 2018 card deck :). Our server was so friendly and helped us pick out a few dishes to share. We tried the Fried Chicken, which is 1/2 chicken and a HUGE portion to share. It comes with rice & beans, plantains, and a spicy sauce you can dip or  pour over everything. The drink prices are a little high, but on par with the rest of the neighborhood. The space is very large, and the patio was pretty busy even after 10:30pm on a Friday night. I'd like to go back and try some other food dishes.", "pics": null}}, {"review": {"des": "Delicious! The atmosphere was beautiful and the food was divine! I will definitely be back for the cavatelli which was the start of the night!", "pics": null}}, {"review": {"des": "The Dawson has pretty good food. It's one of the most unique restaurants in Chicago. They have an interesting and diverse menu.", "pics": null}}, {"review": {"des": "I've had the Dawson in my bookmarks for a while now, and was especially looking forward to sitting outside on the patio, which I heard has a great atmosphere. We were seated right under the overhang, and there was a nice pleasant breeze the whole time.<br>My friend and I chose to share the chicken fried lobster, brussel sprouts and pork chops, which was more than enough food for two people. All the food was good, but the chicken fried lobster in particular was a delicious love child between shellfish and poultry. The fried chicken breading was crisp while retaining the lobster flavor beneath.<br>Will be coming back in the future to check out their brunch menu, which I heard was also amazing.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Oi8IwcSltmUbFZQhlNbrtg/168s.jpg", "caption": "Patio at night"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pTLU_j3jX5fMUYIGViQgkw/168s.jpg", "caption": "Chicken fried lobster, brussel sprouts, pork chop"}]}}, {"review": {"des": "I really struggled between 3 and 4 stars, but ultimately I have to go with three. The pros: good drinks, a really cool atmosphere and vibe, good service. The not so good- the food. It seemed to be a hit or miss. My avocado toast was just okay compared to other avocado toasts in the area. The chicken sausage side was amazing though. The reason I was so disappointed was the cinnamon roll. Presentation wise, it's huge and looks delicious. In reality, it's a little dry and over sugary. I also had a plastic pull tab in the icing of my cinnamon roll when I bit into it, so my guess is these are not made by them even. Overall, it's probably a cool brunch drinking spot. The problem is that for the price, there are other cool drinking spots in the West Loop I would rather go to.", "pics": null}}, {"review": {"des": "A friend had recommended this place and I decided to give it a try during the weekend. We showed up to the restaurant with a group of 5 at around 1pm for brunch and we were immediately seated. The restaurant had an inviting atmosphere. The ambiance of the dining room was alluring.<br><br>For drinks, we ordered Bloody Mary's and prosecco. The Bloody Mary was a bit tart but I enjoyed it nonetheless. The waitress was quick to give advice when placing the order. For the entree, I ordered the Steak & Huevos Rancheros. We only had to wait about 15 minutes for the food to get brought out. My dish was both a good portion and well cooked. The steak was done medium/medium rare and the side of beans was a good complement. Everyone else at the table also seemed to enjoy their meal.<br><br>Overall, I would give the restaurant 4 stars. The decorations were very drawing, the food is decently priced, portions are good, and the food is well prepared but nothing out of the ordinary. I would probably come back here during the Summer to try it out again.", "pics": null}}, {"review": {"des": "What?!?!!?  Huh?!!??!  I literally can not hear you.  This is the loudest restaurant I have ever been in.  Every single patron was yelling at the top of their voice.<br><br>We had a cocktail and got out of this place.  It's disappointing because the menu looks fantastic, but the atmosphere here is so absolutely terrible.", "pics": null}}, {"review": {"des": "Went here for the Scotch egg Club event from Dewar's scotch.<br><br>We were in the event room which was on the second floor, it has a nice big beautiful bar in the middle of the room and comfortable seating around it.<br><br>Had drinks that were made from Dewars Scotch, of course, since they were the sponsor and we had Scotch eggs made by fabulous Chef Michael Voltaggio.<br><br>We even got to play chicken Bingo for prizes!  What a fun night!<br><br>This was on a Thursday night and the restaurant was packed with a line outside waiting to get in. They have a really nice outside patio, but it is only partially covered in case of rain. The twinkling lights is a nice touch and adds to the cozy atmosphere of the patio.<br><br>This looks like a nice place to come to for a special occasion not for an everyday meal.<br><br>The menu is displayed outside the restaurant so you can see the many dishes that they offer. I did not get to sample any of the regular restaurant menu as we were at a private event. But from what I saw it looks like delicious food a little bit on the pricey side.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KG3TZmOhx8hUJWrSGoDrlg/348s.jpg", "caption": "The entrance to the event room on the second floor"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GeNsGxrV_EgCWYRDCJV8_w/168s.jpg", "caption": "The bar on the second floor"}]}}, {"review": {"des": "Our party of four came here for a Memorial Day dinner, and we ate in the patio area on this beautiful evening.  The food, beer menu, and vibe were all excellent at this trendy space.   The desserts were also excellent and we learned that they have their own pastry chef.  The only real ratings knock is that the place is on the somewhat pricey side.<br><br>Our party shared the following family style:<br><br>- Vegan salad<br>- Bacon wrapped dates<br>- Halibut entree<br>- Crispy fried chicken entrée<br>- Pork ragu cavatelli<br>- Chocolate peanut butter crunch dessert<br>- Couple of scoops of their homemade ice cream (bourbon caramel and triple vanilla bean)<br><br>The wife even had a summertime self-treat of Stiegl Radler grapefruit beer (2.5% ABV), and I had a couple of draft servings of Revolution Galaxy Hero IPA (7.0% ABV).  Service was excellent and they leave a carafe of ice cold water.  Overall, a nice choice for that special city center dinner outing.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mExMCiucAyyUxBzUZkDDfw/348s.jpg", "caption": "Patio bar view"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4HjsBjRVCezDYlcz9k9y9Q/168s.jpg", "caption": "Vegan salad"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MNUhz8qhWDpcWroId4gf2w/168s.jpg", "caption": "Partial patio view"}]}}, {"review": {"des": "Last night was my second time at The Dawson and it was a great experience. Staff was super friendly, food was pretty good, and so were the drinks. My boyfriend treated me to dinner for my birthday. <br><br>I remembered for others' birthdays, the staff had really sweet surprises. Last time our table got a free round of prosecco and dessert for the birthday girl. No drink this time, but a manager came over to check on us and offered a shot which was super nice! <br><br>My boyfriend had the sausage plate and likes most of them besides the blood sausage. I had the burger and I've got to say, it is in my top 5 for Chicago burgers. I've had it before and it was just amazing. This time the only complaint I had was that the bacon seemed a little overcooked, so it was kind of hard to eat. The manager also brought us extra sauces to try and you can't go wrong with extra sauce. The ranch is spicy but delicious! <br><br>We did get a complimentary dessert, and this was definitely the highlight of the meal. It was a fudgy brownie with hot fudge, ice cream, and whipped cream. We destroyed it. My boyfriend doesn't even like desserts and he loved it. <br><br>I can't wait to come back here for brunch. Highly recommend!", "pics": null}}, {"review": {"des": "We came here to celebrate my birthday. My +1 had made reservations at multiple locations, and though he had cancelled this one thinking we were going elsewhere (whoops!), we were still seated immediately. It probably helps that it was a weekday!<br><br>My guy has been here before and has enjoyed their burger: that's what he got this time around too. They were running a special that included a beer and a shot for the same cost as the burger anyway, so he went with it. The shot was infused (in-house) with fennel and peppers, but he said that he wouldn't have identified the flavors had our server not noted them.<br><br>I was craving steak and opted for the Hanger Steak. It came with polenta and spinach. The polenta was delicious and the steak was seasoned well and cooked medium as requested; however, it was disappointingly chewy. As such, it wasn't truly enjoyable.<br><br>Service was good, but could have been better: I had asked for a few minutes to decide on a house-made soda, but she never returned until our meal was nearly over. We had to flag her down for things whenever we caught her in proximity. I was also put off by her coffee breath, but that could be my pregnancy talking!  <br><br>My +1 brought up my birthday and our dessert came with a candle and was comped, so that was very nice! We had the Warm Brown Butter Sundae: a warm butter cake covered with berries and a scoop of ice cream. It was really good!<br><br>The Dawson is super close by, so I can see us eating here again. I'd probably opt for a burger in the future, though their bacon flight sounds tempting too!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kt3BN24t45JVOe-aynABdA/348s.jpg", "caption": "Warm Brown Butter Sundae"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/52JRG0sIDqOMf00QLnBGng/168s.jpg", "caption": "Warm Brown Butter Sundae"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QKgatzfEGdAVTeulEG2EfQ/168s.jpg", "caption": "Hanger Steak"}]}}, {"review": {"des": "Gorgeous evening in Chicago and I'd been wanting to check this place out so we did.<br><br>The website has excellent pictures but  i did take a few of the 1st level and patio.<br><br>Apps:<br>We order the Spanish Octopus. Excellently charred. I am a fan of bbq Octopus since i tasted it in culinary art school.<br><br>We also ordered the chicken-fried lobster tails.  Right On the money with a lemon aioli. Yes!!<br><br>He had a glass of Rose wine and i had a house specialty drink...can't recall the name yet...it was light and refreshing.<br><br>Entree:<br>Fish of the day not alot of bones. A tad bit salty he stated yet very tasty enough that he cleaned it and the fish cheeks!<br><br>I had the lamb shank(bone in ...one small bone got in the mix) with a basmati rice, cucumbers and green mix.  Delightful.  Too.much for me to eat but very tasty.<br><br>I totally recommend this establishment!<br><br>Many folks shared meals (tip)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/359oBHA0TgF0z30y2cgV_w/348s.jpg", "caption": "Fireplace on patio"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MLxhAG47UT8GPwJ7W5Zn-g/168s.jpg", "caption": "Bar at patio"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/scTs8b6DNaJfWaAEFJyvyQ/168s.jpg", "caption": "Patio"}]}}, {"review": {"des": "The Dawson is definitely more about the ambiance and the company you bring rather than the food. Don't get me wrong, this dish was good, but still felt overpriced for the amount of steak I received. Also, the bloody mary mix tasted watered down. Definitely come to the Dawson for a super nice patio, but you can easily overpay for the portions and quality of food that you receive.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3x2uIunvPGcA0LO3yjxgTA/348s.jpg", "caption": "Steak & Huevos Rancheros // tortilla, pinto bean, cactus, chili bravo sauce, queso fresco"}]}}, {"review": {"des": "Nice space with a large bar area as well as seating with kind of a gastropub feel.  Tables are a bit close together and the space is loud, which actually be a good thing with your neighbors being so close.<br><br>The cocktail list is large and unique, while beer and wine are decent.  Most everything on the menu looked good, and also ended up being good though the hangar steak was very under seasoned and good but not great even after adding salt.  Service was friendly and after the courses got screwed up and our steak was served with the appetizer course the server comped our next round of wine.<br><br>It's definitely a local place and the food & drink appear worthy of returning.  I'll likely be back.", "pics": null}}, {"review": {"des": "I live in the neighborhood and came here for the eighth time last night...Obviously, I love this place. <br><br>The atmosphere is IMPECCABLE, as is the food, service, drinks, etc. In all of my eight visits, I don't think the menu has ever been exactly the same. Below are some of the items I've tried. Asterisks indicate my favorites. <br><br>Kampachi Ceviche*<br>Chicken-Fried Lobster<br>Chorizo Fondue* <br>Beets and Burrata<br>Spicy Lamb Sausages<br>Spanish Octopus*<br>Pork Shoulder Mac & Cheese*<br>Chicken Tikka Masala*<br>Dawson Burger*<br>Steak & Eggs<br>Warm Brown Butter Sundae*<br><br>There's definitely more, but anyway, come here. Order with reckless abandon.", "pics": null}}, {"review": {"des": "Went here for drinks at the end of a blurry night and although I don't remember too much, I remember I loved their interesting drink menu and tasty drink.", "pics": null}}, {"review": {"des": "Ok, I was wrong. First time in my life I made a mistake on a restaurant selection BTW. The Dawson must have had an off day or something. To play it safe, I came back numerous times, tried a variety of items, and now see that they do have delicious food. The drinks are always on point as well, and the ambiance is very cool.", "pics": null}}, {"review": {"des": "Great place for brunch. Limited selection with great food. I wasn't overwhelmed with the selection and the waiter knew what's up. Bloody Mary was superb and they made it a little spicy which was delicious. I got the egg and machaca and the brisket was on point. I will definitely come back.", "pics": null}}, {"review": {"des": "I spent a day in Chicago last weekend and had a whirlwind  adventure, javing dimmer here was one of the stops. The atmosphere was really appealing. So I was looking forward to the food. We were seated right away and sat outside. It was a lovely evening to have dinner outdoors. We had oysters and the fried lobster for appetizers. The oysters were wonderful, however, who destroys a good lobster by battering it and deep frying it. The frying of the lobster wasn't a hit. For dinner we had the steak frites, medium rare and the scallops with a side of brussels. The steak was cooked medium rare, but was ice cold. The scallops were average as were the brussels. Our dessert was a chocolate peanut butter pie. Which was nice. The real downfall was that there were a couple of guys that had too much to drink. The Dawson asked them to leave. As they were on their way out, they ran into me while I was returning from the restroom, spilling their drinks on me. This was observed my the staff including the manager. They were very concerned and said they'd take care of me. Nothing was compensated. Bad move in terms of getting a return customer. Definitely not worth a second visit.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rEA765zyWaeAxFUBuAstZA/168s.jpg", "caption": "Steak frites"}]}}, {"review": {"des": "Two words, people. Bacon Flight. Yep, you shouldn't need to hear anything else to decide to check out The Dawson. We were in the neighborhood, and decided to check out their cocktails, and we were not disappointed. They have a creative list of drinks, and with stellar bartenders like Chris behind the bar, you can't go wrong. Besides their own Dawson cocktail creations, they served up some mean classics, like a perfectly mixed Gin Gimlet. The drinks weren't only delicious, they were beautifully presented. And when you get peckish, the Bacon Flight is a perfect dish to share, and the rest of the menu looks worthy of a return visit. Cheers to The Dawson!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ieAJJvOo7iffoF1f_ENgBA/168s.jpg", "caption": "Bacon Flight. 'Nuff said."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/m_lxXCKVzJ47779hsXdddA/168s.jpg", "caption": "The cocktails are beautifully presented, and taste fabulous."}]}}, {"review": {"des": "Loved the ambience but food was just ok. Tried a lot with burrata being pretty good but octopus was just ok and fried lobster was nothing special and Brussels sprouts and fries were not good. I would come back for drinks but Mr to eat.", "pics": null}}, {"review": {"des": "Amazing outdoor area, great spot for dinner or drinks in the summer. Good a bit pricey but the atmosphere never disappoints", "pics": null}}, {"review": {"des": "soooo cute outside on the patio!! We had the sweetest waitress and loved the camp theme of the menu and drinks. I got the bug juice and it was so yummy! The fried chicken lobster was so yummy. Everyone loved their meal. The owner came by and gave us free shots lol!! 100% will be back", "pics": null}}, {"review": {"des": "The Dawson is my go-to drink spot. I absolutely love the vibe. It is rare to find a place in the city that has the ideal atmosphere in the winter and the summer. Outside, their space and patio is one of the best around, lots of greenery and seating options.  And, inside, the vibe is cozy, trendy and inviting. They nailed the decor. <br><br>I've dined at the Dawson a few times over the years and it has become my spot for cocktails and cocktails alone. Dirty Martini? Check. Manhattan? Check, check. Although, rating (3) stars as the food hasn't been as impressive to me as the drinks. So, for now, I'll continue to frequent the Dawson for drinks and will give the food another chance at a later date.", "pics": null}}, {"review": {"des": "This place is underrated. It is a true gem just a few blocks north of where the more popular West Loop/Fulton Market restaurants reside. Do make the trip to Halsted/Grand/Milwaukee and you won't be disappointed. The Dawson burger is one of the best in the city. The drink list is long and refreshing. The service is always on point. If you're lucky enough to get patio seating on a calm Chicago night you will fall in love.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kPv9YcmqO71nxr_TsU2FSQ/348s.jpg", "caption": "Chef's choice of tonight's meat sampler. Lamb sausage, pork belly, and chicken sausage all prepared over the spit. Amazing"}]}}, {"review": {"des": "I LOVE THE GTO. It's hands down the best cocktail in Chicago. Ok I needed to get that out there. <br><br>The Dawson is a high-end American restaurant that provides excellent service, food, and cocktails at a rather not affordable price, but I'm ok with that because the quality of the service, ingredients, and decor makes it worth your money. All the food dishes I've tried here so far have been made to perfection. The salmon I ordered was crisp, light, and flavorful. My beloved GTO is strong, sweet, and thyme-infused with gin. The service is the best I've had in Chicago: from the bartender to the waiter to the hostess, everyone is incredibly friendly and always smiling.<br><br>If you want to take your date to a nice restaurant to dine in, I highly recommend checking the Dawson out. <br><br>If you want to take", "pics": null}}, {"review": {"des": "Going to agree with basically everyone that the patio is perfect. <br><br>I was disappointed in my chicken fried lobster! I ordered it because it's something I wouldn't make at home, and I thought it lacked excitement. It's cool and different, but wasn't amazing. I will say that the breading outside was perfectly crispy, though.<br><br>The mac and cheese is AMAZING. I'm not a huge bacon fan, but the bacon in this is the perfect compliment. It's thick too, which I am a big fan of. The only thing is that you have to eat it kind of fast if you don't want the cheese to congeal/solidify at all. It's also very rich, IMO, so that might be difficult to accomplish on your own. Just make sure to sit with a friend who is happy to swipe a couple of bites to help you out...unless you're a hungry bear, then go to town!", "pics": null}}, {"review": {"des": "Great atmosphere! Ken the manager was so nice. The patio was a chill place to hang out with friends. Go to the back where there is a fireplace and sofas to sit and drink. The atmosphere is amazing. I like how there is an outside and inside area so you can walk around.", "pics": null}}, {"review": {"des": "Great ambience, great music (which kinda threw me off - wasn't expecting throwback hip hop and R&B but I appreciated it), great food. I recently tried the fried chicken lobster, mac n cheese (minus bacon), and garlic mash. The lobster was amazing, and the spicy ranch had a nice kick. I split the sides with my bestie (I'd say the sides are big enough for 2 adults) and enjoyed those too... after adding a little salt and pepper. <br><br>The only thing I didn't like was my drink. I asked our waiter for his recommendation on a sweet drink and he pointed me to the \"majority rule.\" It was so disgusting and super tart. Even sprite and grenadine couldn't help!", "pics": null}}, {"review": {"des": "Come here regularly but finally realizing that there's not much more to it than the atmosphere.<br><br>Unfortunately, my last few visits have been less than satisfying with slow, rude servers and inconsistent food. Although they do have outstanding cocktails, I will give them that! But the servers either don't leave you alone, or they go missing during their shift! As for the food.... it is salty, over cooked and they need to switch up their menu.", "pics": null}}, {"review": {"des": "Bravo Dawson<br><br>Food: <br>\"Avocado Toast \" may sound boring and simple but it was far from that. The creamy avocado was taken to the next level by pairing it with an over-easy egg.The dish sent an \" Taste Too Damn Good\" alert to my taste receptors.<br><br>Drinks:<br> \"Insanely Beautiful\" was the name of my drink. The perfectly titled drink, made me feel insanely beautiful after I was done. Great drink , lots of flavor and perfectly sweet.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/u3k8CetvYLkKJAtrp6_lzw/348s.jpg", "caption": "Avocado Toast! Picture taken by Dinah Ro"}]}}, {"review": {"des": "This review is for the arsehole valets who park cars blocking the right hand turn lane in rush hour backing traffic up for two blocks and then laugh and point at the frustrated motorists, often leaving the car doors open while casually chatting in the middle of the street with the drivers creating even more traffic havoc while sardonically smiling at the very frustrated motorists.  If these are the kind of Richardheads they hire, then they'll never get any of my money or my considerable client expense funds.  Or maybe I'm just not douchey enough to think screwing over other people is at all funny.  This has happened more than once, so it's a pattern, not a one time occurrence.  There are too many other great places in Chicago to spend my money to associating with a place like this.  I'LL PASS.", "pics": null}}, {"review": {"des": "My review for the Dawson is long long long overdue. I visited the Dawson on Nov. 5, 2016 with some friends in the area and we had a delicious brunch. <br><br>While my fiance and I were in Chicago for the Rugby Weekend I knew I wanted to treat him to a good birthday brunch since it was in fact his birthday weekend. I asked a friend in the area to recommend a place for brunch and she told me to check out the Dawson and I am so glad she did! Just looking at the reviews and pictures I knew I had to try the food. <br><br>My friend made a reservation for 4 on a Saturday around 11. When we arrived the place wasn't too packed and they had the table ready for us. The server came over and introduced herself to us and made a few suggestions for drinks and appetizers! Yes, appetizers for brunch! She recommended the pumpkin pie because at the Dawson they do dessert first! My friend and I totally ordered it too. We also ordered the bacon flight (4 kinds of bacon) to share as a table (but not me since I don't eat bacon). We also each ordered some beverages to start the day. Our drinks were brought over quickly and tasted great. By the time she brought our appetizers over we all needed another round of drinks. The best part? They added a candle to the bacon flight and we were able to sign happy birthday to my fiance. I am sure that embarrassed him a little, but whatever-it was fun! <br><br>The pumpkin pie was so good and the rest of the group enjoyed the bacon. I don't think they ate it all, but they ate enough of it to say that the bacon was all tasty and delicious. Once our server brought our 2nd round of drinks we were ready to order. I ordered the avocado toast because the reviews for it made this toast sound heavenly. I really can't remember what else was ordered, but I think someone ordered a burger and I am pretty sure someone had a B.E.A.L.T sandwich. All I know is that there was a ton of food on the table when it was all delivered. The plated presentations of the food was eye-candy for me. It was almost a shame to start eating to mess up the art-work. <br><br>Long story short, we were at the Dawson for about 2.5 hours and had a blast! Our server was incredible and friendly. The bartender made some great drinks (we even opted to take a shot of something at one point; it was the daily drip). It was a delicious brunch with delicious food. I really do want to go back next time I go to Chicago. I can't stop thinking about their avocado toast! When it was time to pay the check we just decided to split it 4 ways so that there wasn't any confusion with who had what and who was going to pay for what...it was just easier to split it 4 ways. Thankfully the group I was with was completely okay with that. I'm not sure if they do split checks since we didn't ask. <br><br>Of course, it's nice to also let you know that the bathroom is downstairs if you need it. I had a bit of a hard time finding it, but I saw the hostess and she pointed me in the right direction. I'm sure they get asked all the time where it is. <br><br>Overall, this is a great spot for brunch and I bet they have a great lunch and dinner service too. I do recommend you check it out when you are in the area. It's worth it-trust me!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Mvg6zPHohsmHeqsIy0nMgA/168s.jpg", "caption": "Pumpkin Pie"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AxHl9NYiA8GN-mUVOOzzDA/168s.jpg", "caption": "Bacon Flight"}]}}, {"review": {"des": "This restaurant definitely has a very romantic vibe going for it, with the dim candle-lit space. This week they were celebrating the 90s with various, 90s inspired drinks. I had \"da bomb\" which was a delicious, well-balanced margarita. For dinner I ordered the fried chicken. Was it amazing? No. Was it good? Yeah. The chicken skin was nice and crispy, but the standout was the coleslaw which had a hint of spice. The French onion sauce was very salty and not very pleasant. Don't order this on a first date, gets real messy! The hanger steak was well cooked, but lacked any real umph, real taste to it, but the accompanying polenta was good.<br><br>Overall, a nice date night restaurant with great drinks and average food. Our waiter was not very attentive, but the ambiance was nice. 3.5 stars", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lMo0lzNUunJ4qFdnDuFZbQ/348s.jpg", "caption": "Drinks on point"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OBexYk5wycoFi9zzxDHOig/168s.jpg", "caption": "Hanger steak and polenta"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZHnICmbk1QHI54U6JZK9jg/168s.jpg", "caption": "The fried chicken"}]}}, {"review": {"des": "A local spot for us - always enjoy The Dawson and consistent in quality. Outdoor patio is fantastic when it's summertime.  Never had a bad experience here.", "pics": null}}, {"review": {"des": "We had a really wonderful Sunday brunch here, and our server Tim took great care of us. I got the brussels sprouts hash per his recommendation, which was delicious, and we were also really blown away by the cinnamon bun and bacon flight we ordered for the table. Probably the only downside to our entire experience was when a live band started playing around 4 or 5 and suddenly our table couldn't hear each other speak. But overall we had a great experience and would return.", "pics": null}}, {"review": {"des": "I'm struggling with this review. Overall I give it a 3.5. Let me break it down for you. <br><br>Drinks, Ambiance 5 stars. Drinks are great here. The ambiance is very lovely. If you want to take a date, they have an upstairs which is really chill. It's intimate, romantic, and they blast some old school 90's music to mix things up. No joke, really cool place, no a GREAT place to take a date. For drinks I got the eat my shorts dude. If you like whiskey/scotch and any sort of rendition for an Old Fashion, this is a great drink. I liked it a lot. Also got the Talk to the Hand. This was an interesting drink. It's definitely for those who like to sip on scotch/whiskey, the lavender was an interesting smell to the drink. Overall I liked the drinks I got a lot. <br><br>Food, the food is where this review is hard for me. We got the mussels. If we only got the mussels, this place would be 4-5 stars. The mussels with the soup base was GREAT. And when you dip it with the toast they provide it's phenomenal. However, I wish they would take a look at the toast as some of the bread was burnt. Yuck. But I can't complain, they provide more toast for you if you like. We also got the mix grill. This part of the dinner was a bit pricey. It was $30 for the dish and it was mostly sausage. Last I remembered, sausage isn't that expensive. There is two meat skewers that were included as well, but half of the skewers were burnt. Whoever was running the kitchen that night liked to burn the food that night. The Mac and Cheese as a side was extremely underwhelming. I felt like a box of Kraft Mac and Cheese was opened without the cheese sauce and Parmesan was sprinkled on the top. <br><br>Overall like I said in the beginning the ambiance/drinks were great. The food? Not so much. Maybe I came in a bad day or maybe it is what it is.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aNqiJrn4wm2vJbgZrGM5-Q/348s.jpg", "caption": "The eat my shorts dude drink is phenomenal!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QmFNyzNFprfJFSpXs40gZA/168s.jpg", "caption": "The mix grill. Some burnt meat. Sausages for $30. Eh. And the mac and cheese. Very underwhelming. Tasted like out of a box."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cM0dQfD22UrWESainOn9sw/168s.jpg", "caption": "Talk to the hand. Solid drink if you like whiskey scotch kind of drinks."}]}}, {"review": {"des": "I met a friend for brunch early on a Saturday morning. The ambiance is fantastic, very hip, dark decor, which we loved!<br><br>Drinks:<br>-Gin & Tonic with Rosemary: refreshing and delicious<br>-Irish Coffee: strong, not too sweet<br><br>Food:<br>We both ordered the brussels sprouts hash with the chicken sausage. Could have done without the sausage patty, just didn't love it, but otherwise, this dish was amazing! The egg was perfectly poached and the combination of spices and vegetables was perfection! Could not more highly recommend this dish.<br><br>Service:<br>Average. Our waiter wasn't very attentive, but we were chatting, so didn't mind too much. We always had water though- the staff was fantastic about that!", "pics": null}}, {"review": {"des": "Lovey place. Amazing patio for the summer with a wood burning outdoor fireplace that you can smell as you sit outside.<br><br>The service is great, the ambiance is amazing, they almost always offer us champagne! And the food is great. <br><br>We had the fish tacos which is a shareable dish (good for 3 people) and the fried chicken (generous portion). Both are impressive.<br><br>The Dawson is also kid friendly - they have high chairs and mac and cheese for kids, and they accommodate big groups.", "pics": null}}, {"review": {"des": "Beautiful place, delicious food and good service. <br>Ordered mussels, fried lobster and vegan salad, all appetizer but easily feed two people. <br>Mussels come in a very large portion. I like their coconut milk idea, kind of rich, but much better than the regular red or wine sauce. <br>Fried lobster is okay, I am not a fan of fried food, but my husband like it a lot. <br>Make sure to get Stiegl Radner, I could drink it every day.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6s7vk57ZrBkIm9l1rxadpQ/348s.jpg", "caption": "Vegan salad."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/29lwGA1z1n9ByEOsd05RPw/168s.jpg", "caption": "Lobster half way, very large portion."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/px65vdPY8aBP27YW0wy7NA/168s.jpg", "caption": "Mussels"}]}}, {"review": {"des": "This is what I expected after a long day of working. The drinks are unreal and the food had great flavors I can't believe I found this using my phone to find some burgers but I found so much more. Try the return to your roots drink you won't be sorry. Hats off and thanks for keeping the historic charm.", "pics": null}}, {"review": {"des": "Gosh, I was really hoping for a great experience here. <br><br>Let's begin... and I left just 2 hours ago. First, I called to reschedule my reservation due to my train station being closed and they were accommodating. Not a big deal. I finally arrived and one of my friends was already there. There were 3 ladies today, and sorry, one girl was running super late... but still, half of the tables in the patio area were not occupied, so I don't think we upset the staff too much. <br><br>While we waited, I went down to the restroom. It was a total mess. 3 of the 4 stalls were not flushed. 2 of the 4 stalls did not have toilet paper. On top of it, no paper towels. Ok, no big deal... I told the hostess in the front. This stuff happens. Maybe there was a herd of sloppy drunk ladies. I told the hostess up front and she apologized so many times for that.<br><br>Shortly, the hostess took us to our seats. We saw two open tables in the front under the shade, which were open the entire time we waited. She was about to seat us on one of the tables, but hesitated. She offered for us to sit under an umbrella. We followed her, to sit in the middle of the patio, which there were no umbrellas and have only two seats. Oh my goodness... I was so confused like the hostess. She mentioned we would be reseated. Ok? <br><br>Five minutes later, I had enough. I went to the front to go back and sit there, so our third friend would not be confused when she came. She actually arrived then, and was confused. I complained a little to one of the guys in front, and to the same hostess.. just to nudge them, but I didn't get a single apology. Maybe this is their normal seating process -- to seat the guests anywhere until you give them their final seat. Anyway, we finally got seated at the same table we ALMOST got seated in, until the hostess took us to the table for 2. <br><br>As for the food, it was ok. We ordered the following: <br><br>1. Chicken fried lobster - It's lobster tails fried like fried chicken... with similar breading. No chicken included. <br>2. Smoked salmon<br>3. Duck enchiladas - this was my least favorite<br>4. Mac n cheese <br><br>The food was ok. Nothing memorable. Drinks were good and memorable. Our service was satisfactory. Would i come back? Never. Go to Piccolo Sogno instead. <br><br>P.S. <br>I went to the restroom again before we left, and there were no paper towels.", "pics": null}}, {"review": {"des": "I came here with a friend for a brunch! I made a reservation for Sunday  through Open Table!  We had a nice welcome and they sat us right away! <br>I love the decor and kind of modern style! And wooden pieces which is my fav! A+ for the style! <br>We both ordered egg benedicts with lobster, mimosas and a coffee. They were just ok but not the best tough! I wouldnt order it for the second time! The couple next to us got burgers and fries and even though I am not a burger person they looked amazing!!! So I will be back for sure just to try it! <br>Still loved the place and service was really nice too!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4OUryaJ7pbHdKPndCKJQTQ/168s.jpg", "caption": "Mimosa"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Z184fd8hWHHVVSzBmEwTxg/168s.jpg", "caption": "Egg benedicts"}]}}]}