{"name": "the-angry-crab-chicago-3", "reviews": [{"review": {"des": "I love this place. The food is always delicious and the manager is very friendly. The decor is unique and fun. It's great for a Cajun seafood night out!", "pics": null}}, {"review": {"des": "I ordered dinner via Grubhub. I got the Jonah crab claws and an order of snow crab fried rice with a side of corn on the cob. Everything was dry. The crab meat was overcooked and the fried rice had virtually no moisture to it. I was glad I ordered melted butter with my meal or I might have choked. <br><br>My husband does not like seafood at all. He was not home, so I thought I'd take the opportunity to check the restaurant out. I doubt I will ever order from here again.", "pics": null}}, {"review": {"des": "What happened to the sea of people waiting outside for a table on a Friday night?  Well, it worked in my advantage so why am I questioning?<br><br>I met an old friend who has never been here and she loved it!  We ordered an ultimate eat combo which consisted of shrimp, mussels, snow crab legs, lobster tails, corn and sausage.  It also came with a side of fries.  The seasoning was just perfect and although we both love spicy foods, we opted for ferocious bear level of spiciness (3 out of 4 level).<br><br>Service was friendly and the noise level was way down from lack of customers.  By the end of our meal, a group of 12+ patrons cane in.  I only noticed when the host started to dragged the tables together told them \"no splitting checks\" in a very loud voice.  Granted, I'm sure it's a policy, but, there's no reason to be rude.", "pics": null}}, {"review": {"des": "When you order off the grilled menu, maybe think again. I ordered the grilled shrimp with vegetables. I guess I think vegetables means more than bell peppers and onions. The shrimp were tiny with their shells still on and grilling them made the shells stick to the shrimp. Really hard to remove. This came with white rice. For about $15, there was about 2 tablespoons of shrimp because it was basically glued to the shell. <br><br>I don't quite understand why there are not at least paper plates and plastic ware for all. We had a group of nine and we ordered a number of appetizers. Nothing to pour a little sauce that came with the appetizers on except paper towels or the paper on the tables. Also, when you order rice to share (garlic and plain rice) it is difficult to eat that off the table with your hands. :( <br><br>If I had participated in the \"bag o' seafood\" I don't think I would want to share with with the others at the table. Eight shared this. The crab legs came out of the bag (with 3\" or more of soupy liquid at the bottom) without much problem. The shrimp, scallops, potatoes, sausage and corn however had to be scooped with hands to get onto the table. Everyone is sifting through the bag, not the most sanitary thing. The soupy mixture, is garlic, lemon, pepper, and a spicy mix of other ingredients. Our table was overwhelming with pools of this sauce and broken crab shells, etc. You are basically covered from your wrists down since you had to swim in the soup to get your catch. I tasted it, not for me, but I am not saying that it was not good, just not for me. Others liked it. <br><br>Fried calamari was good, corn bread was excellent. Garlic fries - so so much garlic. <br><br>We washed out hands in the dining room because the ladies room was out of order. $375 for 9 people.", "pics": null}}, {"review": {"des": "Being a huge Cajun fan and a huge seafood fan, even though I've been to several other Cajun seafood places, this one was high on my list because of all the hype. The line is usually out the door whenever I drive by, so I made sure to get there right at open on a Saturday. It was perfect, there were only three tables there so no wait. Service was good. Ambiance was okay, very chill and comfortable. It is messy, I mean real messy. I was surprised that they didn't have bowls for shells and heads and such, just pile them up on the table. I didn't love that aspect - feeling a little gluttonous once I realized the aftermath.<br><br>Food was good. Although, shrimp clearly aren't cleaned prior and while I still ate them, I detest the vein and other stuff in there so I had to clean them properly prior to eating. That wasn't my favorite part of the meal. We did the $79 deal with a side of garlic noodles. Loved the noodles and if I returned, for sure would get them again. I liked the food, but think I may try a different location because I walked out content and full, but not over the moon like I have been at other restaurants of this type.", "pics": null}}, {"review": {"des": "Angry crab is another restaurant with a seafood boil theme and Cajun flavor profile.<br> <br>I've been here so many times now that I wonder why I still haven't written a review. I think one of the top things it has going is that it is very consistent. Every time I have been here, the service and food has met the standard expectation.<br> <br>With that being said, I think their prices are a bit inflated compared to some other similar style restaurants and their sauce is always a bit on the oily side.<br> <br>Here are a few other things:<br>It's BYOB but they do not allow you to bring in hard liquor.<br>Their Cajun garlic fries are the best fries ever.<br>They will only seat you when your entire party is present.<br>Regardless of how large your party is, they will only accept a maximum of 2 cards for payment.<br>They play really upbeat music- mostly soft, harmonic EDM music or top pop hits.<br>It's pretty easy to find free parking nearby if you know how to read your city signs.", "pics": null}}, {"review": {"des": "I had a good time and the environment was cute. The waitress was fantastic and very attentive, I appreciated the frequent check ins and drink refills. But the food just didn't do it for me. I spent $140 on an appetizer (the soft shell crab with fries), a pound of crawfish, and the $76 meal for two platter. It was a lot of food but I didn't really enjoy the crab and lobster that much. Maybe there was too much sauce and not enough natural flavor I'm not sure. I wanna kick myself for saying I prefer the taste of Red Lobster's crab and lobster but I do. That being said, the scrimps, mussels, and andouille sausage were off the chain good. <br><br>Bottom line, I don't think I'd go back unless I suddenly became rich. It was ok average seafood. Fun experience though.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/O2WLLvYR7CMJBPgiZKco4w/348s.jpg", "caption": "The exterior of the restaurant."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zZaApG42uD24qLTKqCCpIg/168s.jpg", "caption": "The soft shell crab wth fries and a medium level spicy sauce. It was good!!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/54MmkzD_qVkRoOAUtIbVSQ/168s.jpg", "caption": "Lobster tails crab legs mussels and scrimps in a bag with spicy sauce, garlic, sausage and potatoes."}]}}, {"review": {"des": "This place needs an inspection by the City. No plates or silverware, just a pile of seafood and sides in a bag. Groups of people just grab and eat with their hands. Very unsanitary.<br>Stay healthy and find a better dining experience! Will never go back!", "pics": null}}, {"review": {"des": "I've been wanting to try this place for a while now since all my friends go here.Came in on a Saturday around 7pm With a friend, when we walked in we gave our name and we waited about 30 minutes.After we got seated we waited another 15 minutes for the waitress to bring us the menus and Our waters. After she explains to us the menu we decided to share a pound oh Shrimp, oysters, crab legs. We had picked lemon pepper for the flavor and a mild sauce for the spice.I wasn't a fan of the flavor it was just ok, could of been better. This place didn't suck but it wasn't the best.", "pics": null}}, {"review": {"des": "Came to Angry Crab because Lowcountry wasn't open for lunch. Won't be doing that again.<br><br>Ambiance was severely lacking. Seafood came out lukewarm. Sauce didn't have much personality. Presentation left a lot to be desired and it was a pain to actually to eat the food. Lowcountry cuts the bags for you so you can actually get at it. Service was piss-poor. Our server clearly gave zero #$&@s and obviously didn't want to be there.<br><br>It's a shame because I heard good things about this spot. However, I don't think my friend and I will be back when there's a much better option in town, despite not being open for lunch on a Saturday.", "pics": null}}, {"review": {"des": "I love this place. Very casual. Be prepared for a messy delicious meal, and only go with fun, adventurous friends. You order your food by the pound, and it comes to your table in a large plastic bag, and you dig in with your hands. You can add separate sides like fries or rice. For example, one pound snow crab, add corn on the cob, sausage, potato, choose garlic and spice level and yum! The king crab is delicious, too. Mussels are good size. Lobster, too. The cost per pound varies, i.e. King crab is a lot more than Jonah Crab. <br>Enjoy!", "pics": null}}, {"review": {"des": "The only reason I didn't give it 5 stars is because sometimes the crab doesn't have a lot in it and I feel like<br>I'm paying for a pound of shells instead. <br><br>Delicious food though and ok service! I would never rate a restaurant bad just because they hired a crappy server!", "pics": null}}, {"review": {"des": "This place is awesome!! Super casual, plastic bib type of place with the freshest most delicious seafood. <br><br>Highly recommend going in a group so you can sample as much as possible. We started with the fried calamari (tender and some of the best I've had), corn bread (good but nothing special) and the Louisiana oysters (outstanding). <br><br>All the seafood mains are sold by the pound and you choose the flavor and level of spice. You can add corn, potatoes and andouille sausage to your bag. <br><br>We shared crawfish and mussels with the level two spicy and their maniac flavor mix. They were so good but the heat definitely crept up after a few bites from that bag. Then we did a bag of garlic butter and level one spice with head off shrimp and Jonah crab claws. My hands-down favorite on the table. The butter with a hint of spice was insane and so good. Our third bag had snow crab legs with their maniac flavor and no heat. The crab was great but I wish we had thrown them in the garlic butter and level one heat bag. <br><br>The potatoes were all tender and the andouille had a nice kick. The seafood was all outstanding. <br><br>A few tips - order 1-2 pounds of seafood per person and don't be shy with the potatoes and sausage. It's BYOB so definitely bring something to wash down the deliciousness. Go with people you are comfortable with because the sauce from the bags gets EVERYWHERE. DO lick your fingers constantly and have a sense of humor.", "pics": null}}, {"review": {"des": "Very disappointed :(. The food lacked flavor. Why place seafood on a platter of plastic day old white rice? I feel like ppl who write good reviews for places like this do not know what good food tastes like. Just because the decor is good doesn't mean you should leave a good review. Brought leftovers to my mother. She gave it back said it tasted like flavorless plastic. My food was served 15 before my sisters food arrived. The server was nice tho ( only plus) <br><br>Do yourself a favor and eat somewhere else. Most ppl do not know good seafood or dont eat it often so they have nothing to compare this place to and leave good reviews. <br><br>Save your money and eat somewhere else. Believe me Red lobster isn't that great but its 1000x better than this place without the trendy decor that the Angry crab has. They only item half way ok were the garlic fries. The owners must be new to the restaurant game. Frozen seafood is not yummy  Sad", "pics": null}}, {"review": {"des": "Food<br>               It was my first time to try out but I don't think I will have second visit. I would say food itself just ok. What I experienced just sauce over seafood, and it was salty.  Also we had blue crab fried rice but just rice. My rating only for fries. Nothing more than that. <br> <br>Service <br>             I totally understand the gratuity included for party of six since we all work as a server. But it does not mean that I agree their service worth 20%. Tips are reasonable for amount of people not for the service. We do not expect very good service but at lease show us some caring. Please do some job, collect those garbage instead of standing. I can't image leave us keep eating at the messy table without any space.", "pics": null}}, {"review": {"des": "We did a big group dinner here for a friend's birthday.  Wasn't too excited about going as I was sure there would be a long wait for a party of 13, but the place was surprising empty on a Wednesday night.  Not sure if that was because the Cubs were playing or what.<br><br>The short and sweet of it is I will be back here for the Lemon Pepper Wings and the Oyster Sampler.  Those two dishes were outstanding.  The Oyster Sampler was great and was a lovely presentation.  There was a presentation of three types of oysters: raw, Louisiana and California (both were grilled).  All three were great.  They nailed the Louisiana ones...so awesome and delicious.  The California ones were grilled to perfection and topped with what looked like a salsa with avocado, cilantro and tomatoes. <br><br>I also got the Lobster Roll.  It was ok, but not $18 ok.  It came with fries...it was ok, just not $18 tasty.  Not a dish I would repeat.  <br><br>What I like about this place is that they do have options for folks who don't eat seafood.  As strange as it sounds, you may have someone in your party who does not eat seafood.  There are chicken tenders, noodles and hot dogs.  My husband got the Alligator hot dog...it was good but honestly I could tell that there was that much gator it in.<br><br>Another friend order an appetizer of garlic noodles.  Man that thing is a meal in itself.  Lots of garlic, so if on a date, make them eat it as well.<br><br>The rest of our party all got the bag and boils with various seafood.  Me personally, I am not a fan of having all my food in a bag with a lot of grease, no utensils other than a claw cracker, and a roll of paper towels.  Too much work for me, but my friends seem to enjoy it.  All of the seafood, corn, potatoes and sausage were in the bag.  Fortunately there was a sink nearby so they could wash up.  Be prepared to drop some cash if you are doing the boils as they are at market price.<br><br>For me, waiting in a line for an hour to get wings and oysters ain't gonna happen, but I can definitely see going back for at least take out.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7A7ZftYLw8GIabRLcQH0zQ/168s.jpg", "caption": "If you do a boil bag, you will need this sink"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8AMJnfNfZcL8PSraKtIR5Q/168s.jpg", "caption": "Bag of crab legs"}]}}, {"review": {"des": "As many times as I've been here, I've never been as irritated as I am today.<br><br>My friend and I came here to have dinner. I've been here about ten times before this, and I've even been to the location in wicker park. Normally, a great experience, minus the overcooked shrimp on occasion.<br><br>Unfortunately we are back to the issue of horrible service. We were sitting by the door, and there was a drift. With the restaurant being mostly empty we requested to move to a table away from the door, the hostess agreed and we gathered our belongings along with all the things on the table, then the hostess moves us directly next to another table of people... with the restaurant being empty, my friend asks if she can move us over to the other side of the restaurant so we aren't so close to another family, in a tight space. She ROLLS HER EYES and finally, agrees. It's been thirty minutes and no one new has come through the door. Who is she saving seats for? Her imaginary friends?<br>Then, another group of people come in and she tries to seat them next to us in a tighter space than before. They asked to move because they didn't want to be \"tight on top of us\" the same thing we asked. And surprise! She had an attitude.<br><br>We ordered \"The Ultimate E.A.T\" which is an order of fries, rice, and a half order of each: shrimp, snow crab, mussels, Jonah claws, and lobster tails, including 2 corn, 2 potatoes, and 2 sausages. We asked for the mussels to be in a separate bag, and our server said \"well I'm not sure but we can try\" when he came back he said they would make a one time exception, when I asked why he told me because the chefs are \"stingy\" with the bags they put the seafood in due to them being expensive. LOL why do you have a restaurant if you can't afford to maintain it. Spending $80 on seafood but you can't provide us an extra bag. Especially when the reason why is due to an allergy.<br><br>Table next to us asked for a pair of gloves... they charge $0.50 a pair, doesn't seem like a lot but the wicker park location doesn't charge... I'm surprised we weren't charged for the paper the receipt was printed on.<br><br>Best part: the host had such a hard time moving us to a different table, but when we got here there were 4 tables, when we left an hour and a half later there were five (including us). Oh and her imaginary friends we can't see of course.", "pics": null}}, {"review": {"des": "Quite an experience, getting take-out from this place! We ordered headless shrimp and the Lobster claws. I also got a Cajun Andouille sausage \"hot dog,\" which was a good sized Andouille sausage on the sort of bun that they give you for a lobster roll, and it was very good. Your condiments come in little separate containers so the \"dog\" doesn't get soggy.<br><br>For the rest - two huge plastic bags of crustacean goodness swimming in boatloads of sauce, with your sides (corn, potatoes and sausage) thrown in for good measure. The lobster claws were only partially cracked, and I had to get a hammer to complete the job. In retrospect, lobster is too delicate for this head-on full-garlic treatment, but we managed to eat them all anyway. The shrimp were also pretty good (we got them in the \"everything\" sauce, and it was delicious).<br><br>The mess was considerable, and they don't give you any of those little wipes, but I guess they figure you're at home, and you can go sluice down in the kitchen (which is what we did). Next time, I'd like to try more of their non-plastic bag items, like the fried oysters or garlic noodles, or grilled lobster tail - or just get a few of those delicious Cajun Andouille hot dogs!", "pics": null}}, {"review": {"des": "A must go if you like seafood a plus if you like it spicy! I would recommend placing an order and eating at home, it's a messy meal and the place is pretty small. You can't go wrong with the Cajun seasoning and level 3 spicy", "pics": null}}, {"review": {"des": "We ordered crab claws, wings, & oysters. Very disappointed.  Can't believe I'm about to say Red Lobster is better. :(", "pics": null}}, {"review": {"des": "I'm giving this place a 3 star rating only because the food is good.<br>The reason I am upset is due the fact that Angry Crab has disappointed me... twice. <br>Let me explain: the first time I ever eaten at Angry Crab (take out) I ordered a pound of shrimp and a pound of crawfish with calamari and fries. My only issue was that my family and I were served with 2 pounds of crawfish and 1 pound of shrimp(not overly charged).<br>Second issue was TODAY. I ordered a pound of crawfish and a pound of shrimp, and the cashier said crawfishes are seasonal, so no crawfish for the family. When we got home to eat our pound of shrimp we've notice there was a crap load of butter and hardly any maniac sauce, so the food and satisfaction overall was a ‍ slap in the face.", "pics": null}}, {"review": {"des": "Great place to go with friends! You order seafood by the pound and they mix everything in spices and serve it to you in a bag. A very fun and interactive experience!", "pics": null}}, {"review": {"des": "We went to the Wicker Park location.  It was very spicy, and we ordered the \"mild\" snow crab legs with garlic butter and lemon pepper seasoning, the fried catfish with plain fries, garlic noodles, one with shrimp, one without, and corn on the cob.   <br>The crab was outstanding, but the further down the bag we got, the more spicy it was.  They even washed the spices off the corn for me.  OMG, one bite of the washed corn was super hot!  I didn't enjoy getting all the butter, garlic and spices all over my hands while I ate the crab legs.  (Free garlic & spice hand treatment.)  No paper plates?  I can eat with my hands, but I feel like a slob putting all the shells on the paper table cloth.  How about some greens, people?  A salad?  Coleslaw?  Mustard greens?   Lots of fried, fried and more fried food.  If you like very spicy and fried food, this place is for you!", "pics": null}}, {"review": {"des": "Last night's Angry Crab dinner was our worst meal of 2018 (and its Nov). It was our first and last visit. Snow crab was stringy, headless shrimp were small and not very fresh- not spoiled, but 1 day away, andouille sausage was very average, even the French fries were poor quality. We ordered the two sauces mixed and a couple of the spices on the side so we could taste them and adjust ourselves. We specifically asked not to have the garlic sauce (I'm allergic to raw garlic). From how I am feeling, I know there was raw garlic in my bag. We came here spontaneously on a Saturday night, 5:45, we were hungry, driving by, no line, and we were willing to get messy if the food was worth it. We hated the presentation of your food sitting in a pool of oily wet seasoning in  a plastic bag and dropped on the table with a single sheet of butcher paper to eat off of. No plates. Again it could be overlooked if the food was delicious. It wasn't. We didn't even finish it. There are so many better choices for crab in Chicago, including some neighborhood joints at a similar price point.", "pics": null}}, {"review": {"des": "I have tried similar stuff in other places,so I knew what to expect. Parking can be a challenge here. We parked in a residential area where parking till 4 pm, without permit, was allowed. <br>My husband and I ordered 2 lbs king crab legs and a pound of crawfish. Service is efficient. We chose raging bull with maniac. The sauce tasted good and seafood tasted fresh. Everything about this place was great except parking.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6OGMmHU_ZoMOocImpsRuZg/168s.jpg", "caption": "King crab legs"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SpmC8wvW57jJgVtT64E2AQ/168s.jpg", "caption": "Crawfish"}]}}, {"review": {"des": "I finally came to this talked about place my friends love to go to. It was on a Saturday around 2pm, so fairly empty. <br><br>A girl came by after a bit and asked if we've been helped yet. I said no, and she passed out menus and left. At that point I was unsure if she was our waitress or not because she didn't say. When she came back, she asked if we've been here before. Again, I said no and she left, without explaining how ordering works. Luckily I've been to other Cajun seafood boil restaurants and knew how to order. <br><br>That being said, we ordered 2 lbs of headless shrimp with Maniac sauce and level 2 spice. We also ordered calamari, one garlic rice and one steamed rice.<br><br>The calamari was great! Love the two sauces it came with. Big portion and soft, not chewy. The shrimp was good and big. Definitely enough for the 3 of us. The garlic rice was pretty oily (not all fried rice is oily). We ended up ordering another steamed rice because we needed more, and the garlic one was a smaller portion (but still a higher price). <br><br>This is the third Cajun seafood boil restaurant I've been to but the first time I tried a mix of the sauces. I read it was the most popular so we got the Maniac sauce with level 2 spice. It was good BUT the spice overpowered the flavor. I couldn't taste any lemon or garlic. After a while it wasn't as spicy, but I'm pretty sure my tongue was just numb at that point. <br>I can handle level 2 at other places, but this one was too much.<br><br>If I come back, I'd try a single sauce or maybe the lower spice level.", "pics": null}}, {"review": {"des": "This location is just a little better than their Milwaukee Ave location. Didn't overcook my 1lb crawfish and 1lb be shrimp. But again, the flavor just isn't there. Their sauces just aren't a good ratio. Most of the seafood is just coated in oil instead of the spices and herbs, and the water they boiled it in from not straining well enough. Maybe I'll come here again and update.", "pics": null}}, {"review": {"des": "If you come here during the winter, make sure to dress warmly, as getting a seat in this place might require some waiting time outside. We arrived on Sunday before the restaurant even opened, and the line had already begun to extend down the block. However, the wait is definitely worth it!<br><br>If the exterior of the restaurant appears dreary and dull, the interior is the complete opposite. Bring sharpies if you'd like to add to the signatures and scribbles covering the walls, and don't forget this place is BYOB! The paper-covered tables inside are packed into the small space, and the place is buzzing with conversation and nostalgic throwback music. Dining at The Angry Crab is definitely hands-on, for those not afraid to get messy. Your seafood arrives in large, clear plastic bags. Everyone is given complimentary bibs (you can ask for gloves as well), paper towel rolls are mounted next to each table, and no plates or utensils are given.<br><br>All of the seafood is sold by the pound based on market price, with selections including crawfish, whole or headless shrimp, clams, mussels, lobsters, and various species of crab. After selecting the seafood, you can choose a sauce (lemon pepper, garlic butter, angry Cajun, or maniac, a combination of all three and the most popular) and one of four heat levels. Although seafood is the focus here, meals can be supplemented with appetizers or extras, such as corn and sausage. The no-frills menu is simple, but it offers plenty of flavor opportunities. We ordered their Cajun fries to start, and a pound each of whole shrimp, crawfish, and snow crab legs soaked in maniac sauce with level two Ragin' Bulls spice.<br><br>The fries were yummy, crisp and golden, but not something that I couldn't get elsewhere. Surprisingly, I thought the crawfish were mediocre. They were tougher than the shrimp, harder to get the meat out of, and had less flavor. The shrimp were so juicy and fat--you are missing out if you get the headless shrimp, because sucking on the heads that have absorbed the deliciousness of the sauce is the best part. The sweet and succulent snow crab legs were the star of the show though. Definitely recommend getting a pound of these! The maniac sauce might seem like a lot of flavors that would mask the shellfish, but it actually works really well. The sauce also makes the add-ons like the corn yummy, but in my opinion I could have done without add-ons because they really seem like fillers not worth the additional money. Also, the Ragin' Bulls spice was actually quite mild, so don't be afraid to test your Cajun spice limits.  <br><br>All in all, The Angry Crab was a fun, hands-on experience with great flavor! The only drawback is that it's quite far from the center of the city, and there isn't really anything to do in the surrounding neighborhood if I make the long trip.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GprM9i2_yGuG5D_IFjGZKg/348s.jpg", "caption": "crispy cajun fries"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TEY6PFJ5di2tFV100b3ywg/168s.jpg", "caption": "snow crab legs in maniac sauce--super messy to crack open, but a lot of fun and delicious!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/X_WMB7rRZqqhYJilEOkQCQ/168s.jpg", "caption": "bags of steaming hot seafood!"}]}}, {"review": {"des": "This place has an excellent choice of seafood options with varying degrees of spiciness and flavor. You choose your pound of seafood and choose the flavor, which is then steamed in a bag full of seasoning, marinade and potatoes. The flavor is the best. This place is also byob. Awesome al around.", "pics": null}}, {"review": {"des": "If you are looking for a messy delicious meal with friends, don't hasitate to come over to this restaurant. Anf you should not be afraid to use your fingers to eat. Everything we ordered was cooked to perfection. Shrimp, crawshrimp and sausage are baked in a sauce flavored with lots of spice, garlic, lemon juice, and green onion. They are buttery, spicy, and good. Love it very much!", "pics": null}}, {"review": {"des": "It's a rainy Saturday night, and we're hoping the weather conditions and early dinner time of 5:15 work in our favor for no line at Angry Crab! And yes! We didn't have to wait for a table for 2. Score!<br><br>If you haven't been to a dining establishment like this, it's a no-utensils-wear-a-plastic-bib joint. You get your seafood by the pound served to you in a bag full of delicious juices and spices. We gorged on a whole Dungeness crab (about $40), scallops, deveined shrimp, and a lobster tail. I enjoyed the ease of eating those scallops. My mini epiphany was my, Dungeness crab is a lot of work for what little meat there is. A first for us: we cracked open the body shell of a crab (and had to ask an employee how to do so!). <br><br>Best decision ever was to get a side of rice, and spoon the maniac sauce onto said rice. Mmm mmm mmm! While I was skeptical about the maniac seasoning (a combo of lemon pepper, garlic butter, and Cajun spices), it was by far tastier than each of those flavors alone. It took 30 minutes or so for our food to be served. Finger licking good! Our bill was about $65pp after tax and tip. <br><br>The hand washing station in the back corner of the restaurant is ingenious! Very useful... even though your fingers will smell like a wharf for the next day anyway. <br><br>Those who are sustainability minded will not be happy at the amount of waste churning out of this place, between the plastic bags, plastic bibs, paper \"tablecloths\", plastic cups, and all the shells and stuff from the seafood. Oh! And the rolls and rolls of paper towels! <br><br>Atmosphere is energetic, with upbeat, club-like music to get your adrenaline pumping and roaring to dig into that seafood! We will definitely be back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gV-QOzpTKHRZz-M3Et5ETw/348s.jpg", "caption": "Market pricing, Mar 2017"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cvLQOgLjT8lGjBv_DUs1kg/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/isQZl_hxF7VI95uWo3L6ug/168s.jpg", "caption": "Interior"}]}}, {"review": {"des": "My first and only time at the Angry Crab here is why.. First and foremost they are way to expensive, i had the maniac flavor which is all three and it wasn't that good, I've had better. I went with a group of 10. Our bill was over $600 and they charged us 50 cents for gloves to eat our seafood with. Never been to a seafood restaurant that charges you for gloves especially if you're spending that much money. The service was poor. Overall a bad experience and i will never go back. The Crazy crab is better in my opinion", "pics": null}}, {"review": {"des": "This was our second and last visit.  We tried it once before and found it to be about a two star restaurant but were passing by and thought we'd give it a second chance.  We stopped in again and found the televisions not working, some temporary florescent lighting in place (terrible) and just plain bad food.  Shrimp tasteless and the \"famous\" garlic noodles were nothing special.   <br><br>And the club music played too loud and totally out of place.", "pics": null}}, {"review": {"des": "My boyfriend and I loved Angry Crab! The deal for $79.99 was too amazing to pass up and we decided to get cornbread and calamari too. <br><br>Definitely a spot bring your friends when they come from out of town! <br><br>The owner is very hands on and even answered some questions about the menu for us. The food is so good you'll be licking your fingers and really getting in there.<br><br>Disclaimer: This is not the place for a first date!", "pics": null}}, {"review": {"des": "I love the Angry Crab. A table full of seafood yumminess. <br>They give you these unattractive bibs but trust me. Wear them.<br><br>Not cheap but worth every penny. Every penny.<br><br>The bathrooms are clean and the workers are so nice. Myles was our server and he was exceptional.", "pics": null}}, {"review": {"des": "I love coming here with friends. It's a fun experience to make a mess and eat delicious food with one another. Also, it's BYOB!<br><br>If you come here with a group, you need to have your whole group there to be seated (which can be frustrating with latecomers).<br><br>Also, the last time I was here, they were out of one of the crabs, but the server recommended another positive option instead.", "pics": null}}, {"review": {"des": "This is a really fun, unique place to spend an evening out. You can bring your own drinks. The restaurant doesn't use any dishes or silverware. It is very interesting....and messy for those who are worried about being neat. The food is delicious! It is a little confusing ordering and figuring out prices and quantities. We ordered shrimp and scallops along with sides of potatoes and corn. The service was great. The atmosphere is very casual and loud. All in all, we had a great time!", "pics": null}}, {"review": {"des": "The Food. Awesome! <br>I suffered from shock and awe since the place is graffiti fill and every ones eating with their hands. But a moment after it all made sense. It was perfect <br> (the waiter) give us some bibs and a bag full of what we ordered. Yep, that wasn't a type O. A bag fill of sea food. It got to the point I forgot I wasn't at home and it did bring back the fun of eating once again. Why does this place gets a 4 star?!?! NO PARKING LOT.", "pics": null}}, {"review": {"des": "Angry Crab never lets me down. Ever. The flavors are amazing. I taste the garlic and the butter on everything.  I always get the Maniac, level 2 and a side of their spiciest.  Even the Level 4 has amazing flavor and doesn't just rip your taste buds a part. I've had the mussels, crawfish, csnow crab legs, shrimp, and lobster tail and nothing ever disappoints. I make it a goal to go at least once a month.", "pics": null}}, {"review": {"des": "A great spot!! Very reasonably priced, I get the head on shrimp and one lb was $13 and plenty to eat with no sides or anything else with it. This is the closest place we have that compares to the boiling crab on the west coast. I tried a cpl others and didn't like them. I am excited to return here. The only thing that isn't ideal is the seating it is a small place and since it's so good it's overcrowded so it's kinda like you're sitting with everyone around you but it's fast and the food is so great that it's well worth it!!", "pics": null}}, {"review": {"des": "I got 2lbs of snow crab in the maniac sauce. Yummy!!! I wanted the crawfish, but they were not in  season :(. 10/21/17 I took the food home with me, so I didn't eat there. It looked like a small eating area, but I'm sure some people just take it to go. For 2lbs of snow crab and an order of garlic fires my price was $65.  at first I was sorry for paying for this order, but once I ate my food, I was super happy for paying for it. I wish I lived there, cause I would go back. I tried to order un-shucked oysters and they wouldn't sell them that way. No big deal though. Good seafood! Parking is tricky though <br>Y'all should go at least once", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/U2uSwYvI1ralE_YnBSPdWQ/348s.jpg", "caption": "Snow crabs in a bag and garlic fries"}]}}, {"review": {"des": "The 3 of us dined here on Friday evening an hour before closing. Usually, there's a long line but since it was 9pm we were seated immediately. We've eaten here before and although I like spicy foods, I scale back the spice level here. The 'pinch of spice' option provides just enough kick to be spicy yet you can still enjoy your entire meal without numbing your taste buds. You probably want to go 1 spice level below what you're used to. We got 2 pounds of headless shrimp ($17 per pound). Of course you have to go for the 'maniac' flavor. One thing I like about this is the addition of the garlic butter sauce-it gives the sauce a thicker, chunkier feel that coats the shrimp and also tastes great on a side of rice. My daughter got the fried soft shell crab which she loved and the fries were fresh and tasty. And, BYOB!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FZLk6DQxcOqcg3DRqL8n6w/348s.jpg", "caption": "Fried soft shell crab & fries"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6EH27ZB3MorWcJBuoV-HBw/168s.jpg", "caption": "2 pounds of headless shrimp (deveined, e-z peel)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qCKKEZkbaaip6uYZ-0LaHQ/168s.jpg", "caption": "Menu side 2 8/11/17"}]}}, {"review": {"des": "Overdue review. <br><br>If you can't tell by previous reviews, this is probably my guilty pleasure cuisine. I live for a good seafood boil and Angry Crab did not disappoint. Came here on a Tuesday with a friend and it wasn't too packed but that did change around 7:00pm. We had a garlic cornbread to start which I do recommend and then I had a shrimp and corn bag for my entree. I did forget which seasoning combo I used but it definitely involved a lot of garlic, haha!<br><br>Also, I'm pretty sure it's a BYOB restaurant.", "pics": null}}, {"review": {"des": "I have been to this spot a few times and boy is this delicious!  It is not the cleanest and there are ALWAYS a ton of patrons partaking the the deliciousness so keep that in mind.  Other than that it is a bit costly but you know what the flavors make up for it!  Great place to go to get some true authentic southern/Louisiana style sea food.  There are no plates and your food does come in a plastic bag so be prepped...  Don't wear your sunday best.<br><br>Bring some markers or pens something you put your mark on their wall with!", "pics": null}}, {"review": {"des": "1. Loved the seasoned fries! Possibly the best I've ever had. <br>2. We ordered the shrimp boils. My wife ordered like a mild flavor, I ordered the hottest flavor (I don't remember what it was called.) my wife's lacked salt.<br>3. The waiter warned me several times that there were no refunds for the hottest flavor level. *Do I'm expecting to be crying almost* but when I got it. There was barely any flavor. It was spicy but not at all as much as it was hyped to be. Everything was a bit disappointing other than the fries.", "pics": null}}, {"review": {"des": "I've eaten here maybe 5 or 6 times now and this place never fails me. The price is amazing for seafood AND it's BYOB!<br>I always start with some fried calamari to share and then follow up with the main course consisting of headless shrimps and mussels, maniac seasoning, and raging bull spice level. Then if I'm feeling like Mr Money Pants on that particular day, I'll throw in some crab legs and/or lobster tails.<br>Regardless, pick your favorite shellfish and have at it. Just remember, they don't do half-pounds so make sure you find people to share with if you're a light eater.", "pics": null}}, {"review": {"des": "A modest storefront hides a gem. This place is great for fresh seafood and there's so many options--it's tough to narrow them down! There's something about eating off of a picnic-style table with a bunch of friends that's oddly appealing and makes for a great experience. This restaurant is also BYOB and there's a liquor store across the street, so you can't ask for more than that. A great place for seafood and spice lovers.", "pics": null}}, {"review": {"des": "This is an updated review:<br><br>We placed a carry-out order in person, was told it would be an hour, so we went to wait in our car to watch TV on our phones (it's too crowded to wait in the restaurant). <br><br>After the hour, I went back to pick up the food & was turned away because they don't take American Express. I told them that my boyfriend was in the car (they saw him place the other) and he has a Visa on him. I went back to the car, got his credit card & attempted again to pick up our food. <br><br>They would not give me the food because I didn't have his ID. They saw him place the order! Why didn't they tell me that when I said, \"my boyfriend is in the car, I'll go get his Visa\". They could have said, \"bring his ID\". <br><br>I was so mad after waiting an hour, and 3 trips into their restaurant! And, they think I stole the credit card!<br><br>The manager was rude and acted like he caught me trying to pull one over on him! Why would I wait an hour to steal a carry out order!? <br><br>I would have been fine if they told me, \"please remember to bring his ID\" or didn't act like I committed a terrible crime trying to pay for take out.", "pics": null}}, {"review": {"des": "Ordered: Lobster tails, lb of shrimp, bread, potatoes, sausage, corn, garlic fries.<br><br>FOOD:  The food here is very flavorful and fresh. I would suggest going with the waitress suggestions, which are to do Maniac flavoring with Ragin' Bulls spice. And when ordering, the prices are not on the menu, but they ARE on the chalkboard overhead. We wished we had seen that before or were notified. <br><br>A pound of shrimp with two lobster tails, two corns, two sausages, and two potatoes were enough for two people. I would think getting much more than that would have put us out of commission for the rest of the day.<br><br>The potatoes are small, red potatoes. So keep this in mind when ordering. The corn prices are about half of a Cob. The sausages are thick and about the length of a pinky finger. The garlic fries were also awesome, and come with a LOT of minced garlic on top, so if you were just looking for garlic powder, look else where.<br><br>DRINKS: This place is BYOB and the nearest liquor/ beer/ wine store is a little drive from here. <br><br>SERVICE: The service was quick and the waitress had no problem explaining the concept of the dining experience. <br><br>Unlike other similar-concept restaurants, there are paper towel stands at every table for easy access. There are also crackers and crab splitters given to every person at the table. <br><br>ATMOSPHERE: This place is very casual, with sharpie graffiti all over the walls and booths. There are wax paper \"table cloths\" for easy clean up and paper towel stands between each table. There are no plates here, just a bag of seafood and the wax paper serves as your plate.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Qzme-Y82p9_ABOyFZHt6cA/348s.jpg", "caption": "Get crackin"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IvP1lds_RT8YXWUNjkKf5w/168s.jpg", "caption": "Bag of food"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Y5NVJse5KDXdLM1INRcTng/168s.jpg", "caption": "Writing on the wall"}]}}, {"review": {"des": "The food was 5 stars all the way!!!!! Jus the first girl waitress that took our order forgot our snow crabs!! Ughhhhhhh the 2nd woman took care of us very well!!!!!! Thank you!!!", "pics": null}}, {"review": {"des": "Cool place and the food was really good. Totally unique experience for us! Seafood served in a bag, marinated to order (mild butter all the way up the spicy scale to SUPER spicy). Messy eating, but fun!", "pics": null}}, {"review": {"des": "This place is super cool. Nothing fancy or hoity toity about it: butcher paper on the tables, rolls of paper towels next to each table, ready for your mess. <br><br>You order each seafood by the pound - I went with a group of 4, we got snow crab, crawfish, and whole shrimp, with 4 potatoes, 4 sausages, and 4 pieces of corn (STUFFED, SO FULL) - with seasonings - we got maniac, a combo of all 3 - at your preferred spice level. It comes to you in a GIANT plastic bag, all bathed in ridiculously tasty sauce. You smell like garlic and sauce for days after, but it's worth it. <br><br>It's BYOB so make sure to ask for an ice bucket. Also, super appreciate the hand washing trough in the back, so you don't have to worry about getting any of the sauce that inevitably dripped down your arms on the bathroom door. Make sure to wear clothes you don't mind getting dirty because the bibs don't do shit. <br><br>Was pleasantly surprised at how cheap the bill came out to be: less than $70 total, with 3 pounds of seafood, sides, and 2 cups of rice. EPIC.", "pics": null}}, {"review": {"des": "You just can't get enough crab legs!!! Amazing seasoning! Amazing place! We had the ultimate E.A.T. for 2, but it wasn't enough!! When you start eating crab legs, shrimps, lobster you just can't stop!", "pics": null}}, {"review": {"des": "First time tying Angry Crab and it was good. I got a lb. of Cajun crawfish which was about $13/lb, my bf got a lb. of headless shrimp which was $17/lb. He absolutely loved his shrimp. I lived in Texas for 3 years so this crawfish definitely had nothing on our TX crawfish. (Also crazy I paid $7 more for a lb. of crawfish out here, I usually only pay $6. I hate how expensive things are in chicago)<br>We also went around 4 PM (they open at 3)  & it was nice & peaceful. Plus the workers were very nice & social", "pics": null}}, {"review": {"des": "The louisiana crawfish had very funny smell so we ate a few and discarded the rest.  The scallops were good.  Crablegs were just like anywhere else.  Fried Calamari appetizer was pretty good too. All in all, for the two of us it was about $116 with tip. We ordered a beer and iced tea. Most of the dining room was setup so your sitting directly next to someone else so no privacy in your conversations.  It was a first time experience & interesting getting all of your food thrown together in a plastic bag with sauce  but personally, for the money ,will probably opt for more comfortable and traditional dining experiences at that price point. Recommend if youve never tried it but there were not really any wow factors to keep you coming back.  :/", "pics": null}}, {"review": {"des": "This was my second time going. First time had to wait more than two hours for a table but food was pretty good. Second time going it was a nightmare. Waiter got food order wrong and charged us $70 for something we never asked for. Waiter insisted we had asked for it and we were wrong. Spoke to owner or manager who also insisted we were wrong, yelled and insulted us. Very unprofessional. He eventually did only charge us half. My brother ordered the Cajun chicken and the garlic noodles and got sick minutes after leaving the restaurant. Unprofessional staff, sub par, overpriced food. Don't waste your money.", "pics": null}}, {"review": {"des": "Had brunch here and it was so delicious.<br>Everything was seasoned and cooked to perfection.  The corn, and potatoes were good too.  Every time I eat here it's always good plus I love writing on the wall.  It's such a treat being able to bring your own bottle.  Of course I had to bring along my Moet.  I wouldn't have brunch without it.", "pics": null}}, {"review": {"des": "Long wait. Messy eating but good.  Not my type of dining but if you love seafood with a little kick GO FOR IT!", "pics": null}}, {"review": {"des": "This place is awesome!! I am a huge seafood fan and spicy food lover and this took care of both of those!<br><br>There were 3 of us and we started with an appetizer of the garlic noodles (SO GOOD) and cornbread (also amazing). For the main meal we ordered Louisiana Char Grilled Oysters and a sampler meal that included shrimp, lobster tail, king crab legs, and jonah crab with the Maniac sauce and Level 3 spice: Ferocious Bears. The food was incredible. The level 3 spice definitely had a kick but wasn't overwhelmingly spicy and didn't overpower the taste of the seafood. <br><br>You will definitely need the bib they bring out for you and all of the paper towel that is provided. The hand-washing station in the back is also super convenient!<br><br>FYI it is BYOB so definitely bring drink to quell the spice of the seafood. I will definitely be back to this place!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Ec2RjwW9G-Gq3WbyoGBUrA/348s.jpg", "caption": "Louisiana Char Grilled Oysters"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/m9qI5WH6dE55yvEGssdhJA/168s.jpg", "caption": "Garlic Noodles"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TNrqI6Ah1M6H0m61uJn7qw/168s.jpg", "caption": "Corn Bread and cajun-garlic fries"}]}}, {"review": {"des": "The crabs are long, the crabs are wide, the crabs are short & fat orrrrrrrrrrr big boned (for all you politically correct goody Miss two shoes).<br><br>The crabs, especially the snow crabs are the tastiest. I found the King crabs rather unstimulating, & of course waaaaaay pricier as they usually are. However, I'd stick with snow crabs for overall goodness whilst playing in the snow, in winter or in the snow! ;) <br><br>Taking that crab & playing with it as you crack it open amidst the surroundings, & the very loud music just makes one eat especially rapidly. Akin to clothes shopping with loud pop music to persuade the shopper to make quick emotional decisions. <br><br>Moreover, bumping into others in this tight space is also fun yet very easy to converse about nothing over banter, & keeping with the crabs! <br><br>We ordered the special which is a mix bag of snow crabs, lobster tails, corn on the cob, sausages, potatoes, shrimp & mussels. And, a pound of the King crabs which were nothing to twiddle our thumbs around errr claws around. <br><br>The sauce was a stimulus of a long sparky, spicy wait of 50 minutes to get our table, but well worth it. <br><br>Next time, I'd prefer to just eat the snow crabs by the pound, & skip the mix special with very foul smelling, over-cooked lobster tails, unless you also like the shrimp, which is tasty also. <br><br>The caveat or should I just say, know what you're coming in here for. Because the table next to us was a newly introduced couple on a first date, & one of them said that they don't care for shellfish, & the other was wearing a bodice with very high stilettos, & they seemed miffed!<br><br>Well well well, don't just expect to be catered to a polished cutlery & well carved silverware restaurant - that's another story Morning Glory. ;)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jiNS-3KKYXb66GjuDnoIVQ/348s.jpg", "caption": "Snow crabs are just waaaaaay tastier than the King crabs. Here they are in their crabby glory ;)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EkV-A-WJ1gey05hSrKlYPg/168s.jpg", "caption": "The dinner special that we are sharing with crabs, mussels, lobsters et al."}]}}, {"review": {"des": "The Angry Crab is such a unique dinning experience! The food was delicious and it was kind of fun to just be messy while eating. I don't usually eat everything I order, but I ate everything here AND I didn't feel too full. Highly recommend the shrimp! The only thing I didn't like was how much plastic is used here...but I also understand the difficulty of avoiding it. And anyhow, eating out of a plastic bag was unusual and fun!", "pics": null}}, {"review": {"des": "We have gone two times. We get shrimp and snow crab, so delicious. We also get a side of white rice to mix in with the delicious sauce. Makes my mouth water thinking about it! Cant wait to go back!", "pics": null}}, {"review": {"des": "Came here with a friend who was visiting from out of town. We came on a weeknight around 5 and there was no wait, but I've driven past a few times where people are waiting outside for a table. Got the garlic fries (literally fried pieces of garlic mixed with fried and seasoned with some kind of Cajun spices), headless shrimp with maniac seasoning. I could eat this every day. It's seasoned and cooked to perfection and for seafood, the price is very affordable! Definitely get an order of bread to sop up the juice...I had to restrain myself from picking up the bag and drinking the pot liquor.", "pics": null}}, {"review": {"des": "This is just like being at a backyard BBQ on the coast.  If you love seafood this is a must.  We had the make your own seafood in a bag. You order everything by the pound, and potatoe, corn, sausage by each. You even pick the spices. We had shrimp, crawfish, crab legs, along with vegetables. Spices were raging bull.  Everything was just out fabulous. We had food left to go home.  The price was very fair.  It is bring BYOB, but they do the some drinks. This little gem is definitely on our list to go back.", "pics": null}}, {"review": {"des": "First time here ! It was a great experience our waitress was checking on us constantly that a big plus ! Food was great had the headless shrimp on point.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qQAhzlQ5XOFyFOydBqljsA/348s.jpg", "caption": "BYOB place"}]}}, {"review": {"des": "I came here on a Saturday night around 6pm and luckily the crowd has not lined up yet. Advice: come early before 6pm to avoid the long wait.<br><br>For all the follow seafood, we ordered the maniac sauce (blend of the 3) with raging bull (2nd level of spiciness). The main problem was that the seafood had very little flavor. I had to request the server to bring us two packets of salt to add to the blend, shake it up, and then consume. It might be that the seafood was not shaken well to distribute all the flavoring in the beginning, but it was definitely lacking flavor.<br><br>Head-on Shrimp (3/5): the quality of the shrimp was not very good compared to the other 2 cajun places I've eaten at recently. <br>Crawfish, clams (4/5): these were fresh and high quality<br>Mussels (5/5): I enjoyed the mussels because they were plump and did not have the mucky taste that some mussels have.<br>Garlic Noodles (5/5): now these were delicious; order this! as all the reviews said, these are very good especially if you like garlic, plus the slight sweetness really complemented the garlic taste<br><br>Service was also very slow. I ordered gloves and had to ask the server 3 times to finally get them. After our seafood came, we had to wait about 3-5 minutes to finally get our gloves. Overall, this was kind of a disappointment. I've had better cajun in suburbs of Evanston and Skokie, and there was so much hype about this place.", "pics": null}}, {"review": {"des": "I get the hype. I really do. This place packs out like wow and there is a constant flow of patrons coming and going. I'm not one for large parties, so my sister and I checked it out.<br><br>Spicy Cajun fries with garlic. Crab legs. Lobster claws. Shrimp. Andouille sausage. Corn on the cob. Bread. Rarwww. <br><br>We got it spicy and devoured everything except for the shells. And it was a good idea to get bread for sopping. Forget Chicago hotdogs and pizza, it's on the list for repeat visits.<br><br>Warning: The wait can be long. Don't go with huge parties, expecting to be sat quickly like you have celebrity status.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SfkxOWw7Fe2ioB4ZStwk9A/348s.jpg", "caption": "Bag of Lobster Claws, Shrimp, Andouille Sausage, and Corn"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tLE3glLPJw2T4Fjc77zhtw/168s.jpg", "caption": "Spicy Cajun Fries with Garlic"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/toqP9iEhBksglZY-pouitw/168s.jpg", "caption": "BYOB. Some wine before getting back to business."}]}}, {"review": {"des": "Came to the Angry Crab with 5 family members and decided to get The Feast ($180), which is their best deal. You can also bring in your own wine or beer, or both.<br><br>The first thing the servers do when they come out, is give you a high quality plastic bib, which you will definitely need! Our feast started with soft shell crab and fries. The fries were amazing and so was the soft shell crab. Their dipping sauce was really flavorful and spicy, just the way most of us like it.<br><br>Then, we got our oysters, they were amazing as well. Squirt a little lemon juice, some Tabasco sauce or cocktail sauce, and in they go!<br><br>Now, for our main course. We got this huge bag filled with seafood goodness, corn, and sausage. In it, it had lobster, king crab, snow crab, and shrimp; all covered in garlic butter seasoning. It was such a messy meal, but a great experience. The food was fresh and deliciously good! Portions were great. Again, it was 6 of us and the food was enough for all of us.<br><br>This experience was so different and satisfying. I will definitely come back again!<br><br>Oh yea, I forgot to mention, I wasn't a big fan of sea food before this experience!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Vz26PUxSTqSaMgKwbhajzA/168s.jpg", "caption": "We were too excited and forgot to take a picture before."}]}}, {"review": {"des": "My boyfriend and I went here for his birthday dinner. This was my second time and this was his first. <br><br>The wait staff was very friendly and checked up on us frequently. We got the maniac sauce and raging bull spice. The food was amazing (just like I remembered it the first time I had it). My boyfriend said this exceeded his expectations and recommended it to his friend. This place does not disappoint!", "pics": null}}, {"review": {"des": "This place was  Unusual for me I told myself  I will try. the food was very good if you like to eat out of a bag . the place was very noisy if you are looking to have a romantic dinner this not for you but if you looking for good food   Not bad for 3 people we spent  $130 if you ask me would you go back there again I will  Say  Yes", "pics": null}}, {"review": {"des": "As a crustacean lover...I wanted to check this place out for a while now..but decided to go once some of the hype had died down a bit.. (not a fan of hour long wait times to get seated)<br><br> As soon as you walk in to the vestibule area, the wonderful aroma of spices hits your senses..<br><br>So it seems to be off to a great start. Its only 30 min after they open and the place is quite empty..didn't realize how small the place actually was..its rather long in space but narrow in width..<br><br>The host asks us how many..I respond 4 adults two kids..My husband is looking for parking so she goes on to say that only complete parties are seated..REALLY?? OK -super-annoyance no. 1..<br><br>I always found that rule so silly and anti-customer like..I think it makes good business sense to seat your customers as soon as possible especially when the place is near empty...I know higher end places do that but usually its reserved for ppl with reservations...since the reasoning is ppl won't order until the full party has arrived.<br><br>it's a major turnoff.<br><br> When they tell you that you can't sit down, even though there are empty tables, it immediately signals that the restaurant's owners are more interested in maximizing profits than in making their guests feel welcome and comfortable..<br><br>2nd thing that was kind of annoying is how they will add the 20% gratuity themselves for parties of 6 or more even though two of the guests were kids under 5 who only consumed the rice that came with the order....<br><br>The food itself is good and I enjoyed the spice to it. I do feel the prices are a bit exorbitant for the per pound prices but then again its seafood so of course it'll be pricey..<br><br>Because of the prices and  anti customer policies, I think it'll be a while before I return. It was good food but it was also a bit overrated and not $240 good for a group of 4 adults for their supreme feast bag. I'll stick to Bob Chin's in Wheeling.", "pics": null}}, {"review": {"des": "This place was good, but it wasn't that good. <br><br>When we were waiting over two hours to get in starting at 3:00 pm we discussed how we'd better live it up because we'd never be back. <br><br>Then we got the food and M got drunk off of our BYOB and she insisted that we absolutely would be back. She absolutely loved the juices and sauce. She had fun conquering the crawfish and getting all kinds of messy. <br><br>Me? I don't like being messy. I also don't really like noisy places or communal tables. So... it's not for me. But it was tasty and good quality.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/i4Y-qLKti31EFmvl2KoHig/168s.jpg", "caption": "What was left when we finally finished eating with our hands and no plates."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZtxD2gwdCC6rjxFQ7gogMA/168s.jpg", "caption": "Serving the bags"}]}}, {"review": {"des": "Spicy and delicious, just the way I like my seafood. I went here for a friend's graduation lunch and before the food even came out I knew it was going to be good. They seat you at a picnic table and give you a bib because they already know it's going to get messy. The staff is friendly- my waiter helped me figure out a good beer to try as well as the best combination of flavor styles for my food. <br><br>I ordered crab legs and crawfish which came with the usual sides-corn on the cob, potatoes and some sausages. The food is cooked creole style so they're generous with the spice, but there are other flavors you can order and always just put in if you want it milder. The portion sizes are large so the prices make sense. I find it's best to mix and match with the people you're with otherwise you'll end up with a massive amount of left overs.", "pics": null}}, {"review": {"des": "Be ready to mess your hands when you get here. Wash your hands very well and wear your plastic bib provider by the place. <br>This place is so crowded and busy at night and weekends. Communal tables and casual seating. Their garlic pasta is to die for. Ordering is per poundof whatever seafood you want. You can add corn, sausages and potato too for extra price. Then choose your sauce, i recommend Maniac sauce then fire it up with their chili sauces. <br>If youre into fork and knife dinner then this is not your place.", "pics": null}}, {"review": {"des": "If you love seafood and spicy food, this is definitely the place for you! I read the reviews and was instantly interested in giving them a try. The place was packed, barely no room to move. The tables are so close together that we could hold hands, lol! It took me a while to look over the menu. I was taken aback because of the high prices, but that didn't deter me from eating there. I ended up getting the pound of snow crab legs with the sausage and corn pieces. I got the maniac flavor with the Cubs spice.  I also got the orange drink. All together, it was $34 and some change. While I was waiting, I was preparing my taste buds to be slightly disappointed because of the price. I was wrong! The food is so delicious, I was totally blown away! Worth every penny! Everything was perfect! The spice was perfect. The crab legs were tender. The sausage was juicy and full of flavor. The corn was slightly sweet and very tender. The spices went well with everything that was in my bag. I may be late in discovering this place, but this is my new favorite place for seafood. I will be back...again, again, again and again, lol!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/brFU_iMIQNWEu23NW80krg/348s.jpg", "caption": "The menu with the current prices"}]}}, {"review": {"des": "Awesome food! We were there on 05-27-18 celebrating my nephews birthday. There were 7 of us. We were seated by an african american host. The waiter came over to introduce himself and welcome us. As he began to speak, the host felt the need to interrupt the waiter (as he was speaking to us). The host proceeded to tell us no separate checks and he repeated it again. Then walked off. We all looked at each other including the waiter and were all stunned. Everyone was speechless and embarrassed by the host behavior. Besides, that the food was the best and the waiters were extremely nice. By the way we paid cash ;-)", "pics": null}}, {"review": {"des": "Came here at 7 on a Saturday night (prime dinner rush time) and was told about 90 mins but we actually got in after an hour!<br><br>We got ever runtime in the maniac sauce the the raging bull spice level, but from best to least favorite:<br><br>Headless shrimp - so meaty<br>King crab - nice amount of meat and really soaked in the sauce<br>Garlic noodles - just a must have<br>Calamari - good light coating and good sauce it comes with<br>Andouille sausage - good kick to it<br>Blue crab - these are served as two full crabs and not by the pound... A lot of work for not much in return", "pics": null}}, {"review": {"des": "This was my 3rd visit and probably my last. The first time food and service was great. I have never actually stayed to eat, I always order to go, parking is very limited. The lady at the counter explained how to order, flavors and cost. I throughly enjoyed my food and it was so DELISH. Second visit I consider myself a pro, I order my usual 1lb of headless shrimp, 2lbs of snow crab legs, some sausage, corn and potatoes. I chose the mixed sauce and a medium spice level. Great food and both times my husband and I had leftovers for 2 days. This time I go to pick up my order and make an inquiry about the Jonah crab claws and the woman ringing me out was just not very courteous. I ask another question and she's like \" some people like, some people don't, I don't know what to tell you\". I was simply asking about the difference in the crab claw meats. The food was not as flavorful this time, not enough lemon pepper seasoning the shrimp are undercooked and I'm just not feeling the sausages this time. Considering I spent $101, very disappointing!", "pics": null}}, {"review": {"des": "I've had good and not-so-good experiences here, but my last visit was AMAZING!! <br><br>First, I want to point out that the service gets better every time I visit. Our waiter was very nice and our food came out really fast. Second, OMG the garlic sauce..it's so garlic-y and buttery. Don't forget to BYOB! <br><br>In the past, there were some occasions when the garlic butter sauce seemed to be swapped with the maniac sauce. Lately, that hasn't been a problem at all. I've also seen some inconsistencies in spice levels. I almost died a couple times from level three spice, and other times I'm just sweating from it. <br><br>The wait can be a pain in the butt, so it's best to arrive before 5pm on a weekday. I can't image the wait time on the weekends.. They've added more tables and it's a bit crowded, so hope you don't mind your neighbors listening to your conversations! Oh and always look out for claws flying at your face from the next table! I was an inch away from getting smacked by a crab..<br><br>Also, I would recommend ordering togo!! Call a few minutes ahead and walk right to the back swinging doors to pick up your order! My sister and I always order a couple pounds of shrimp level 2 spice and a couple pounds of level 3 spice, then mix it up at home. We find that this is the perfect spice level for us. :)", "pics": null}}, {"review": {"des": "I'm giving them 5 stars for the food, but deducting 3 stars for the service.<br><br>My wife and I got to The Angry Crab just over an hour before close on a Sunday night.  We were seated immediately but had to wait about 10-15 minutes before a waiter was available to take our order.  We had never been before and wanted to try a little bit of everything so we opted for the Ultimate EAT (check the menu, but it was $70 and more than enough for two people), maniac style with Ferocious Bears spicy level.<br><br>Our main order took about 15-20 minutes to come to our table, but the fries were served as an appetizer.  Everything else comes in a giant bag, filled with whatever you've ordered, mingling all together with the flavors and spices that you've chosen.  I think my favorite was probably the sausage and the shrimp.  The shrimp comes \"peel and eat\" style, but they pre-slice it so it's easy to take off the legs.  No typical utensils (fork, knife, spoon), just a seafood cracker and sheller.<br><br>After our order was dropped off, no one came back to our table until we asked for the bill.  Approximately 15 minutes before closing time, a server came around to some of the tables to announce that it was last call, though they never stopped at our table to ask if we wanted to order anything else.  Our drinks were empty half-way through service.  Our waited never came back to our table after taking our order, someone else dropped off the food and the manager came by to drop off the bill.<br><br>Immediately after the servers came around to the other tables to announce \"last call\", they started cleaning the restaurant.  At this point there were maybe 6-7 tables with guests remaining.  One employee was sweeping, another started running a vacuum.  Imagine trying to have a conversation as a vacuum cleaner is being used 3-4 feet away.  By the time we left (9:15 at the latest), every table had been pushed against a wall, each chair was stacked upon a table except for the 3 tables of people remaining in the restaurant.  It was clear that they wanted us to pay and get out.  I did end up tipping, but for what?  I didn't get any service.<br><br>I might go back for the food, but I doubt it.  This place will probably be closed due to the attitude of the management and employees.", "pics": null}}, {"review": {"des": "I had been wanting to go to this place for ages and one of my brothers treated me to dinner here! I love trying new places on some one else tab, ammirite? Lol.<br><br>When we got in there was no wait to seat 2, but it was a week day. Don't get me wrong though the place was JUMPING and I presume they are like this most evenings. The seating areas are super duper cramped. <br><br>Aside from the seafood we had in our boil bag, shrimp, crab legs, crawfish, we also tried the fried shrimp and garlic noodles (OH EM GEE....put some of the shrimp from your boil bag in your noodles and it'll change your LIFE). It kinda peeved me that the potatoes & corn were also carte but they were tasty. We should've gotten 2 corn each because they were halved. <br><br>The food however did not disappoint aside from the frozen crawfish, which I knew would be a toss up. Everything was delicious and I will definitely be back and this time I won't forget drinks since this place is BYOB.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Sb9OpyW5KjH8P_pk4QMdjw/348s.jpg", "caption": "Trying to crack my crab legs!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JGpvByYHFuMx00nLWawbow/168s.jpg", "caption": "Frozen crawfish, because they weren't in season on this visit, 2 thumbs down"}]}}, {"review": {"des": "Left an angry crab because of empty wallet. Although fun and good food the prices have gotten out of control.", "pics": null}}, {"review": {"des": "Have been going here ever since they opened and still till this day their lines are ridiculous!!  <br><br>I normally get a pound of crawfish and a pound of head on shrimp, all the flavors plus bulls or sometimes bears spiciness level.  I feel the spiciness level is sometimes inconsistent but that doesn't bother me too much since I love hot stuff.  Since seafood is a little pricey I normally get rice to help me fill me up and its good to put the sauce on top.  <br><br>They know me as the guy who lines up my crawfish heads all over the table but its cool to always have a chat with the employees and owner.  Service has always been good its just the waiting time that will annoy most people.  If you plan to go on the weekend, better be prepared.  Try to go early and since its BYOB bring some drinks to help occupy yourselves.  <br><br>If you plan on going during the week, try to get there early before they open and you should be good.  Also check out rowie's right across the street! They have good sweets and drinks.", "pics": null}}, {"review": {"des": "The shrimp was cooked right. May it be with the head or not. Snow crab was also juicy and not dry. <br>I had high expectations with the place. Hoping I will have the same experience when we ate at Hot and Juicy, Virginia. The shrimp were cooked the same way but their sauce were to die for. The shrimp has its natural sweetness. That's what I'm looking for with my experience here at crazy crab.", "pics": null}}, {"review": {"des": "This place is awesome! Came with my brother on a Tuesday night, didn't have to wait to be seated, food was delicious and fast service. I was a little disappointed with the parking situation...basically street parking only.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KEWfIdFdKDYfbRKbBCm1Ig/168s.jpg", "caption": "Meal for 2 ppl- so delicious!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yesN8Qdp2edCfEF1xbVZSw/168s.jpg", "caption": "Best shrimps ever!"}]}}, {"review": {"des": "I was very upset tonight. I have been a long-standing customer but tonight when I went into eat, the food was way overcooked. The manager did not care and re-fused to make it right. I own a business in the area and I have no problem spending a lot of money on a great dinner but it was just really really terrible. Horrible management lacking in customer service skills. I will not ever be returning", "pics": null}}, {"review": {"des": "I had tried one of these west coast seafood bags at a different restaurant in Chicago and I thought this type of eating was not for me.   The Angry Crab changed that perception.<br><br>We came on a Sunday night around 7 PM and the wait was not bad at all (10 minutes).<br><br>Seafood boiled in a bag with a sauce that you customize (lemon pepper, garlic Cajun, level of heat).   That's it.<br><br>One caveat: Be careful mixing different types of seafood in your bag.   We had snow crab and lobster claws in one bag.   The crab was cooked perfectly, but the lobster was overcooked an a little rubbery.<br><br>Add a couple corns on the cob or potatoes to your bag (or get the delicious Cajun fries).<br><br>Note: This is a BYOB restaurant.", "pics": null}}, {"review": {"des": "This place is phenomenal. Get ready to get filthy indulging in some seriously hardcore seafood!", "pics": null}}, {"review": {"des": "Can food make you happy? 'Cause this place made me really happy. I only write reviews when there's something good to say, unlike those Yelp trolls that feel they are such conoceurs; and here's a place indeed for anyone. I have OCD and forgetting about utensils or manners was such an experience, you'll see what I'm taking about if you come here", "pics": null}}, {"review": {"des": "I was way too generous giving angry crab 2 stars.  This place is too trendy NOT to have its own parking lot.  Good luck finding parking w/o warning all over angry crab that you will be towed.  This restaurant is too crowded no elbow space and extremely LOUD.  I had a son and mother date.  We both did not like the service.   There is not utensil, no paper plates and you eat like the cave men with your hands.  No wet towels either offered to wipe your hands.  <br><br>The server does not explain nor gives you suggestions as what to order or what is the best item.  Is a hit or miss on your part.  We did order a bag of shrimps that comes with a half of potato, half of sauce and a half of corn on the cob.  The shrimp are not deveined so you have to do that job or eat it.  Every item on the bag was charged individually it is NOT complementary.  We could not eat the sides because they where too oily and the potato was not cooked properly too hard to eat it.  What a shame.<br><br>We order calamari to me they were too well done and the crust burnt.  I asked for extra Lemon they do not have it only lime that becomes bitter when you cut it.  No extra line was given to me.<br><br>The only item I liked was the garlic fries.  This place is too over rated not worth the drive unless you live in the neighborhood.  The service is horrible no one greets you and no one say thank you for stopping by.  Too disappointed,  I feel bad for my son that was starving he had volunteer in his school.  Just to come and clean those shrimps .  No thank you", "pics": null}}, {"review": {"des": "My favorite crab restaurant! No one can duplicate their garlic butter i always get a pound of snow crab and a half a dozen Louisiana style grilled oysters. The staff is friendly. You have to get the garlic noodles, sooooo good.", "pics": null}}, {"review": {"des": "When: Sunday around 6pm<br>Who: 9 peeps<br>Service/other: meh, checked up on us once, no wet naps, no lime or lemon on side. BYOB (beer and wine only, no hard liquor)is a plus!<br>Food: seafood boils avg for midwest, not as good as west coast. Other food decent. <br><br>First, service: we mainly go to these seafood boil restaurants for crawfish. Came on a Sunday around 6pm. We waited for our table for 20ish min and when we were ordering, THAT's when they tell us that there is no crawfish (fresh or frozen). You mean you couldn't tell me that while we were waiting for that 20min? Or they could have crossed it off on their giant board or put up some signage...all of us were disappointed to say the least, but since we were a group of 9, decided to try the other choices. <br><br>Food: Cajun fries-are delicious. Freshly fried with a nice crisp. Cajun fried can get overly salty sometimes but the seasoning was perfect. Wings -Cajun style, crispy, nice size, taste was alright. <br>Clams- Hella spicy, maniac style , good spiciness for the spicy lover. Lacked enough seasoning to do anything for the seafood. I had to really dip my Clams in the sauce. Corn was juicy, not as sweet as I would like, but I enjoyed the corn. Sausage - nothing special.<br>Shrimp - same thoughts as above but rage spicy. The shrimp are on the smaller side.<br>Crawfish - didn't have any :(  <br><br>Bottom line: ok seafood boils, above average pricing, I'd give it another try with the crawfish but call ahead if you don't want to waste your time.<br><br>Tip: Go to Saigon bistro (10min away) instead for crawfish- frozen is 9.99/lb vs 11.99/lb here. That's what we ended up doing after in the same night.", "pics": null}}, {"review": {"des": "I've heard a lot of positive things about the angry crab and so I've decide to come on Valentine's Day. I knew it would be packed so we decided to come 15 minutes before opening. Boy, am I glad we did because there was already a line. <br><br>We got seated at 1pm sharp and ordered the head on spicy shrimp, garlic mussels, and some Cajun fries. Everything was soooo delicious. I loved everything about this place. (The gentleman next to us was so in love with the lobster that he started singing to it) <br><br>Overall, great staff, place, and fooood!! It's byob too.<br><br>Definitely recommend this place if you love seafood.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/P1PjjCt2AZGiDXu5OBR-rg/168s.jpg", "caption": "Clams with crawfish"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/STMYKjR8gXmPYDndebtjiQ/168s.jpg", "caption": "Best Cajun died everrr"}]}}, {"review": {"des": "Food, YES!  Service, Lacking.  We went here the other night on a Monday and filled ourselves to the breaking point with shrimp and crab and corn and potatoes.  Everything was flavorful and tender.  Be prepared to get messy and a little disgusting.<br><br>I think we may have had \"The Angry Crab\" as a waiter though.  He acted like we were an inconvenience being there and ordering food.  We saw him when we sat down and ordered food and then not again the rest of the night.  Thankfully it was a slow night because other servers took care of beverages, left overs, and the check.  The experience was enough to come back but hopefully the service will improve.  Kind of a shame.", "pics": null}}, {"review": {"des": "A+ Angry Crab. Tasty food, fun and unique experience, generous portions, reasonable prices, lively atmosphere. Loved it!", "pics": null}}, {"review": {"des": "Good to try one a while . The seafood is oily and over spiced it loses it seafood flavor. Great staff . If you like spicy this is the place .", "pics": null}}, {"review": {"des": "Ohhhhh man. Seafood served in a sack. This place is amazing. Get a side like garlic noodles or rice to go with your sackful of seafood.<br><br>Came here on a Sunday evening with a party of four and had a short wait for a table.<br><br>Good service. Decent ambiance. Amazing seafood. Not quite as good as Glenn's, but still amazing.", "pics": null}}, {"review": {"des": "4lb bag of whole shrimp ($12.99, head on ftw), mussels ($10.99, pass), and snow crab ($17.99) in maniac lvl 3 spicy. Delish. Garlic noodles also enjoyed, but overpriced at $8 for that small portion.<br><br>Already looking forward to returning. Not willing to wait more than an hour though.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kWEXGsoz-DxaT1UvF-dtlg/348s.jpg", "caption": "Prices"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xLWt4t79sMhx2XML_F4pjg/168s.jpg", "caption": "Pound of whole shrimp in maniac ($12.99) and snow crab in lemon pepper garlic ($17.99)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/niTzDWh12Pmds5YClj9_vA/168s.jpg", "caption": "4lb bag of shrimp, mussels (pass), and snow crab in maniac lvl 3 spicy"}]}}, {"review": {"des": "Not what I expected. Was pleasantly surprised took my daughter here for her 25th birthday this was amazing and truly it was a bag of loveliness I'm going back with multiple people it was worth every penny", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/O3fVv_aZcYmi0Ga2DAYUzw/168s.jpg", "caption": "You"}]}}, {"review": {"des": "Certainly, the shell fish is the star and they made justice to this beautiful creatures with great seasonings.", "pics": null}}]}