{"name": "the-bristol-chicago", "reviews": [{"review": {"des": "Wow what a great brunch.  I had something with pork eggs and greens in a bowl.  It was great.  The spice was nice not to hot but good flavor.  <br><br>Great bloody Mary's. <br><br>My kids had the biscuits and gravy.  They loved it but it was an adult portion maybe they could add a smaller one for kids....<br><br>Service was good an all around pleasant experience.", "pics": null}}, {"review": {"des": "The Place<br>The Bristol is an American restaurant located in Chicago's Bucktown Neighborhood.  Reservations are a good idea as it fills up quickly.  Table seating available as well as bar.  Private events are held upstairs but I haven't been up there so I can't comment.  Very nice ambiance a little on the loud side.    <br><br>The Menu/Food/Drinks - Dinner Menu<br>We choose monkey bread with dill butter and brussel sprouts made with duck confit, mustard-chipotle vinaigrette, cornbread crumbs for our starters.  Both were very good!  For our main courses we ordered half chicken with mustard & dill spätzle, crunchy salad, chicken jus.  This chicken was prepared excellently 5 star entree.  Our second main was a butcher steak prepared with broccoli rabe, smoked onion, mushroom powder, red wine sauce.  I found it to be flavorful but chewy.  Overall this main was a little disappointing a 3 star offering. The third main was a basic double quarter pounder burger with cheese, garlic aioli, and duck fat fries.  This main was a shocker wow what a great burger.  If there were 6 stars I it would have scored them.   Another Yelp review commented \"The most underrated burger in Chicago hands down\" totally agree mine burger was the best ever and the duck fat fries were delicious as well.  Dessert was snickerdoodle sundae chocolate & vanilla gelato, hazelnuts bananas, zabaglione.  It was different, fun and very good.<br><br>Drinks order were a couple smoked sicilian manhattan's which were excellent!!  We also had 2015 Smith & Perry Oregon Pinot Noir which was just ok for a Oregon Pinot Noir.<br><br>The Service/Experience/Value<br>Our service was very good.  Our orders were taken and delivered in a timely manner.  Our water glasses never emptied and the plates were cleaned promptly.  Overall we had a very nice experience and the prices while high were not out of line for the value presented.  I recommend you give the Bristol a try.", "pics": null}}, {"review": {"des": "FIRST comes Bucktown. THEN comes Bristol. THEN comes a food baby in the food baby [carriage?]...<br><br>My husband and I made a reservation for Saturday at 11:45AM, and good thing we did. Without one, you will be happy to get a vacant spot at the bar. Noise level is very loud here. Mostly, people talking about how good the food is. This Gastropub has white linen napkins, tight seating, casual vibe, inattentive service, and the kind of food that will keep you coming back.<br><br>THE BAD NEWS, FIRST.<br>The service of a restaurant should always match, if not exceed, the quality of the food. In this case, Bristol fails, miserably. The Host and Bussers were the only redeeming part of our experience. Upon arrival, the Host greeted us and kindly acknowledged that she remembered taking our reservation. We sat down in some very tight seating. Our Server didn't bother to communicate to us that it would be a few moments. When he finally did come to our table, his demeanor was quiet and annoyed. My husband had to crack a joke to get him to smile. We ordered right away and our food came out in a considerable amount of time. The Bussers always made sure our waters were filled and plates cleared. They should have received our tip. It was more difficult to get our Server's attention. We told him that we would like our check early. We found a slight error on our bill. My husband had to part the red sea to get his attention, and still nothing. We crazy person waved him down. Instead, he was committed to cleaning off a table, standing around a table that had already received their food (in which another server was taking care of them), and cleaning glasses at the bar. It should not have been a task to track down our server.<br><br>NOW, THE GOOD NEWS.<br>Basque Cake $10, seasonal fruit jam that tastes like homemade apple sauce with candied walnuts. The Cake tasted light, semi- sweet with an almond hint. It crumbled fast, but had a lot of moisture in it. The couple of candied walnuts added some crunch to the ensemble. A small serving, perfect for two people. If you've never had Bristol's Basque Cake, you are in for a sweet treat. <br><br>Biscuits & Gravy $13, creamy sausage gravy with a sunny side egg. So much gravy. Slightly spicy. If you are a Biscuits & Gravy person, don't pass this up!<br><br>Braised Pork Chilaquiles $15, fried egg, lime, cilantro, a little queso fresco. Non traditional Chilaquiles. Bowl full of tortilla strips, braised pork, and a brown sauce. Hefty portion, but TOO MANY tortilla strips. <br><br>TO TOP IT OFF,<br>Disappointing service. Crowded location. The food is above average. HUGE portions. Great food presentation. BRUNCH GEM!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CUF-FA668bNv_-Lm3ySPqA/348s.jpg", "caption": "Basque Cake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GeGu3GVeiO5Us6elC8RlbQ/168s.jpg", "caption": "Menu as of 11/17/18"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Yja2RjvmoGGifBbHA28oyw/168s.jpg", "caption": "Chilaquiles and Biscuits & Gravy (in the background)"}]}}, {"review": {"des": "Great little dinner spot! We came here with friends and got a last minute spot on open table. The food was delicious! It's a dim, cozy atmosphere. We started with monkey bread and pig ears and both were fantastic! The dill butter was creamy and went perfect with the salty bread. The pig ears sounded not too good but wow. They were crispy and salty and tender! First time having them. I had the Cacio e Pepe and it was good, but I ended up stealing a lot of bites of the burger and fries from my friend. I would get it next time it was soooo good. The basque cake was my favorite part! The nutter butters were tasty but wow the cake was buttery and crispy and moist and just heaven. Would definitely go back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bytFN0OHWDJctfbGnkRaUQ/348s.jpg", "caption": "Cacio e pepe"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KtR_EHWSluUEPcVz4zFzQQ/168s.jpg", "caption": "Monkey bread"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eIWc_VPV5wbI6Q9qZNDWQw/168s.jpg", "caption": "Basque cake - MUST GET"}]}}, {"review": {"des": "After winning an Instagram contest (I know, so millennial of me) I was gifted $50 to The Bristol. I'd never heard of it, but am not one to turn down free food or new restaurants. Here's why The Bristol is a 4/5 in my book.<br><br>Food: <br>- Smoked Brisket Hash - 3/5 stars - it was really good but sooo spicy that it was hard to finish. It was also mostly onions + cabbage.<br>- Breakfast Porchetta - 5/5 stars - my bf loved this dish and it appeared to be a good portion, too.<br>- Side of Sausage - I didn't like this at all, so I only had a bite. Unique seasoning, but my bf enjoyed it. Also, it comes in patty form, not links (heads up).<br><br>Staff:<br>- 5/5 stars, everyone was amazing! Our waiter was the perfect amount of attentive, funny and professional. The manager, Pablo, also came over and introduced himself. Overall, everyone was very attentive and polite. <br><br>Ambiance:<br>- It was very quiet during brunch hours (mind you, it was rainy and cold out) which was perfect. The food took a little longer to come out, which was surprising due to the low occupancy, but it wasn't anything outrageous. A comfortable and cozy atmosphere.", "pics": null}}, {"review": {"des": "They have a gluten free menu! You have to ask but they have one. <br><br>We ordered the duck fat fries and chicken liver for apps and loved them. I ordered the whitefish and my friend ordered the pasta. All perfect. The drinks were great as well. <br><br>The service was exceptional. I love this restaurant!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/j4_EJ9jjWwrjD8txhw49Zw/168s.jpg", "caption": "Whitefish"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BavjJzcKRi3MxiJlBOCKYg/168s.jpg", "caption": "Pasta"}]}}, {"review": {"des": "The Bristol continues to be one of my favorite restaurants in the city! My family and I had a wonderful dinner last weekend. The food was exceptional from start to finish! Something stood out to me this most recent visit: while the standbys such as the monkey bread with dill butter, the Amish chicken with mustard dill spatzle, and the basque cake continue to impress, the seasonal items such as the bacon beer cheese tartine, brussels sprouts with duck confit and mustard-chipotle vinaigrette, the fennel-garlic sausage-stuffed porchetta, and the snickerdoodle sundae also wowed. I love how the dining room glows and think it would be a perfect choice for date night. The service has always been fantastic. The staff are friendly, and little details such as periodic changing of plates and silverware throughout dinner are much appreciated. One of many restaurants in Chicago that deserve more praise and recognition. Congratulations on 10 years Bristol! Highly recommend!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0pVa_QZW5RMA1XLJUJDsvA/348s.jpg", "caption": "Fennel-garlic sausage-stuffed porchetta, shaved brussels sprouts, apple, sesame seed dressing."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-zMKnHQAHr-oAhCa5YrIPw/168s.jpg", "caption": "Amish half chicken with mustard dill spatzle, crunch salad, and chicken jus. Highly recommend! One of the best chicken dishes in Chicago!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_2-pr_w_lRXe26niWj0q8g/168s.jpg", "caption": "The famous raviolo filled with spinach, ricotta, egg yolk and finished with brown butter."}]}}, {"review": {"des": "My date and I had the chilaquiles and the french toast and both items were really delicious. I really liked the interior, the overall environment when entering, the quality of the food, and the service.<br><br>The staff was both welcoming and helpful as it was our first time here and we both enjoyed the experience. We had seating right along the window which was later opened up so we could enjoy the breeze coming from outside during our meal. Admittedly it was a little weird at first because it was open and people from the sidewalk were basically walking directly beside us as we ate, but once you get used to it, it is actually pretty cool. <br><br>The one thing about the place is that the aesthetics of the food and interior are definitely factored into the price. The prices, while not necessarily steep, don't directly coincide with the quality of the food and the wait we had for our table, but the interior was really cool and the food came out looking even better than it tasted. <br><br>Therefore, I definitely recommend this place. I really enjoyed my experience here and I really like what they offer. It is definitely a place you should check out and it is somewhere I would like to return again in the future. While it may not be in my top 5 spots, it is definitely a spot I would still like to return to nonetheless.", "pics": null}}, {"review": {"des": "We went here for brunch this past Saturday, and I have to say I was quite amazed. The food was amazing, but what stood out to me the most was their cocktails. I got a sour, and let me just say... hearing that an egg white is in my cocktail at first is a bit of a turn off. After trying it, wow! I'll definitely be getting another the next time I come here. We will absolutely be coming back by the way. Our service was excellent. Everyone loved their food, (the BLT is huge, so almost a good option to split that).", "pics": null}}, {"review": {"des": "The dinner menu of small plate staples, seasonal items, unusual flavor combinations and crafted cocktails makes this a 5 Star rating for the Chef! It's a little too dark and a little too loud but if neither of those things bother you add back the star I took away. <br><br>We tried the steak tartare with quail egg and cheddar dusted Chicharones. I'd prefer a vehicle less overpowering for the tartare, and to skip the cheddar dust, but overall a tasty dish.<br><br>The Seasonal Salad with Peaches and Tomatoes was fresh, delicious and perfectly complimented by the blue cheese cream in the bottom of the bowl.<br><br>Curry roasted cauliflower with sultanas and burnt oranges was fantastic! Lovely combination of curry and orange flavors.<br><br>Overall wonderful food! Can't wait to try other menu items, desserts and even breakfast at The Bristol!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/B23xcWk0kuZsxTclUBOYXA/348s.jpg", "caption": "Steak Tartare with Cheddar dusted Chicharones."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GedFCwhxrDpns6rOuRfO4Q/168s.jpg", "caption": "Curry roasted cauliflower, sultanas and burnt oranges."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bpjM49O0dAPZE6DNasmrFQ/168s.jpg", "caption": "Seasonal salad with tomatoes, peaches and blue cheese cream."}]}}, {"review": {"des": "The most underrated burger in Chicago hands down. Do yourself a favor and take a trip to the Bristol to check this burger out! Oh and the duck fat fries that come with it, delicious!", "pics": null}}, {"review": {"des": "I am a longtime lover of The Bristol - it's been my go-to for ambiance and quality for many, many years. Which is why I was disappointed by my most recent excursion there. My husband and I recently visited for our anniversary (it's our annual spot and where we went the night we got engaged).<br><br>All of the food we had was as good as usual - the prawns and the Brussels sprouts were major highlights, but a few service issues really cut the mood. First, our cocktails took 20 minutes to get to our table. After those, we ordered a bottle of wine that the server said would be great with our prawns, but they couldn't get the wine to us until the entire dinner was over, so we ate several dishes with empty glasses. Finally, we ordered the nutter butter dessert and they brought us one cookie on a plate. We tried to flag down the server, but again, that took ~15 min. <br><br>They were apologetic, but the host (manager?) said as we were leaving that he \"forgot\" our wine and they didn't offer to comp anything, which I thought was kind of odd given that our bill was pretty steep. Anyway, maybe it was just an off night, but I don't think we will rush to visit again.", "pics": null}}, {"review": {"des": "The Bristol is a great find!!!  I come to Chicago in November each year and this year I found the Bristol and I love it!  I do a lot of traveling around the country but this is one of my favorites.  <br><br>They have a Manhattan made with smoked Bourbon that is truly the best I've ever had.  Their menu is varied from Butcher Steak to burgers, dinner salads and appetizers that are excellent.<br><br>Their desserts are amazing and the Basque cake is home made in their kitchen that we loved!!!<br><br>Next time you are in the Chicago, I recommend you be sure to visit The Bristol.", "pics": null}}, {"review": {"des": "1. order the chicken liver mousse<br>2. ask for extra bread<br>3. get the basque cake for dessert (w/o the sauces)<br>the rest is up to you<br><br>the salmon is delish!", "pics": null}}, {"review": {"des": "The Bristol is like that awesome sweater that you keep, even though it's like 5-6 yr old already. You know the one that your significant other hates, but you can't give it up. There's nothing more comfortable than pulling that sweater on, and knowing you still look like a million bucks. The Bristol is kinda the same. It's in the 'hood, so maybe you pass it up while headed outside the 'hood for drinks and/or dinner. It's also a cool bar where you can sit and view the room, and enjoy a damn fine drink. Additionally, The Bristol can be low key for a burger, or intimate for a nice date. Want al fresco, but don't wanna sit in the sun? Take a table by the open windows that allow you to catch the breeze from the outside.", "pics": null}}, {"review": {"des": "High quality restaurant with high quality food! A group of good friends and I came here on a weeknight and were easily able to get a reservation. We were sat immediately and the service was amazing. Our waitress was particularly helpful and had great suggestions for our meals!<br><br>For appetizers we got the monkey bread, the curry cauliflower, and the pig ears. The bread was fantastic and if you're a curry fan definitely get the cauliflower. I enjoyed the pig ears but wouldn't be dying to try those again. <br><br>For our meal we shared the raviolo which is one large single ravioli that was super rich and perfect for sharing so we could each try a bite! It definitely would have been too much for me to eat solo but I would have been disappointed if had I missed out on it! I ordered the chicken based off of another yelpers review and was so glad I did. It was absolutely amazing! Perfectly cooked, crisp skin, and all of the complimentary flavors on the plate really made it a great meal. My friends loved their pasta dishes as well! Highly recommend.", "pics": null}}, {"review": {"des": "It's been many many years since I enjoyed a meal at the Bristol, but the difficulty of getting a last minute res on a Saturday night led me back here. <br><br>7-8 years later I noticed some of my old time favorites on the menu (hooray for monkey bread). We ordered family style from a menu and somehow figured out a variety of dishes that would be good for vegetarians and allergies. Our waiter was attentive, but seemed confused/overwhelmed by all our requests which seem to be pretty typical when dining out these days.<br><br>The food was great, although not quite as good as what I remember...maybe my taste as just improved with age. Favorites included the monkey bread (still amazing) and duck fat fries. The pasta dishes were tasty, but also very heavy and salty. And the absolute best part of the meal was (as always) dessert. It would be a shame if I had to wait another 7-8 years for another piece of basque cake.<br><br>Service continued to be spotty throughout our meal. While the first course came out relatively fast there was an unnecessary very long pause before the next course. We also had to ask our waiter several times for utensils, for both serving and eating.<br><br>We're lucky to have so many amazing restaurants in Chicago so not sure I'll rush back again soon (besides for the basque cake), but a good option when looking in the area or need a last minute reservation.", "pics": null}}, {"review": {"des": "Delicious! Came here for brunch last weekend and it was fabulous. Flavorful dishes and reasonably priced - can't go wrong.<br><br>I got the mushroom toast, which is sourdough bread covered in creamy mushrooms with a sunny side egg on top. So simple yet delicious - that cream sauce was killer. My friend and I also split the duck fat fries - absolutely AMAZING (I'm talking the butteriest and crispiest fry you'll ever have the pleasure of devouring), but it was way too much for 2 people. Order this as a group appetizer and you'll be set!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uY0-pruLGa3Co7ucE144rg/348s.jpg", "caption": "Mushroom toast! Delish"}]}}, {"review": {"des": "From my 5 year old son:<br>Q1: How many stars do you give this place?<br>A1: 5 <br><br>Q2: Why?<br>A2: The bacon is delicious because it has oil on top. <br><br>Q3: What else?<br>A3: The burgers are toasted very well. You should try it!<br><br>From me:<br>We rented a house nearby when we stayed in Chicago for a couple days on vacation. Today we are leaving for Michigan and decided to try this local restaurant for brunch. We ordered salmon benedict, mushroom toast, duck fat fries and burger on the kid's menu. I was most impressed by the fries and toast. The fries has the right balance of crunchy exterior and fluffy interior , garnished with cilantro it looked very appetizing and tasted amazing even without ketchup. The mushroom toast was surprisingly good: the mushroom has been cooked perfectly with the right firmness and full of flavors. The service was also good. Our waitress was very attentive and patient. Next time we are in town, we will come back.", "pics": null}}, {"review": {"des": "Went on Saturday at 1300<br>Had the burger (wow!!!), chicken hash(wow!!!)<br>&<br>The super awesome basque cake(wow!!!!!!!!!!!)<br>Great service and a friendly atmosphere. <br>Would definitely come back!", "pics": null}}, {"review": {"des": "I love this neighborhood spot! The food is fantastic. The service is so friendly; our server came and checked on my table multiple times, even the bartender did as well, and when my party left we were given a \"thanks for coming'  from every employee we passed on our way out, waitress, bartender, hostess, other waiters, manager, you name it! I came here last week for their amazing happy hour specials and they did not disappoint. The curried cauliflower was my favorite of the snacks we ordered.  The all star dish of the night was the tarragon tagliatelle. I HIGHLY recommend this dish.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0zU3dhE9dEMLAuBmPRwsqw/348s.jpg", "caption": "Tarragon tagliatelle"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zGP5MiJyinN9SVMJVwcU4A/168s.jpg", "caption": "Pig ears"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FD5xJd76bJFeO9DriWeeGQ/168s.jpg", "caption": "Curried cauliflower"}]}}, {"review": {"des": "Went with a girlfriend and the food was so so, steak was tough and the pasta was pretty meh. Cocktails took a while, whatever I know that happens. But our server was clearly working her hardest to make sure we were well-cared for. I think her name was Jaime? She made the whole experience so worthwhile. She not only paired wines with our courses, but made SUCH good recommendations... attentive, funny, and super knowledgeable about the menu. I think I might request her section next time I go in! Not crazy about the crowd, might go in early next time. Overall good atmosphere.", "pics": null}}, {"review": {"des": "I can't say enough good things about this restaurant. Staff is welcoming, food is delicious, and just when you think it can't get any better... here comes the basque cake.<br><br>Service: This topic most times makes or breaks the restaurant. Fortunately for The Bristol it always makes my night. Jesus is especially wonderful and makes sure he checks on our table throughout the night. Waiters are very attentive and make sure to double check if they aren't sure of something. It makes dinner a thousand times better.<br><br>Food: food here is SO good. Especially their raviolo, duck fat fries, burger, and basque cake. If you order any of these things you will not be disappointed. I've been there a few times and ordered the chicken once. It has wonderful flavor but the one I got was dry. Still didn't bother me because of how phenomenal everything else was.<br><br>Cocktails: cocktails are wonderful, and they have a great selection of wines. One of the managers (Jesus) told me he makes sure to keep a bottle of my favorite wine in stock! How could I not come back?!<br><br>All in all, it's a wonderful restaurant and I'll be bringing more people here to experience it too.", "pics": null}}, {"review": {"des": "Those fries though! Seriously - best fries I've ever had.<br><br>We came early on a Sunday morning without a reservation and split two brunch dishes. We live right next door and it is always busy for both brunch and dinner, which has to mean something. Love the intimate atmosphere. Would be a good date spot!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VmT7KxpjeVj1_uTaSVV80g/168s.jpg", "caption": "Mushroom toast"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jQYi5s3VF-SQrB4aHG-0-w/168s.jpg", "caption": "Chicken 'n a biscuit with the duck fat fries"}]}}, {"review": {"des": "Ok, from the service to the last bite of our dessert was heavenly. You do not want to miss this gem - a group of 4 is the perfect combination for they tasting of several different wonderful starters and salads, oh and the main dishes were also to die for delicious. <br>Do not skip the Basque cake !!!! We will be back for sure.", "pics": null}}, {"review": {"des": "I am giving The Bristol 5-stars because it was an incredibly pleasant surprise- accommodating and delicious. I am going to throw out perhaps an inflammatory and bold opinion: The Royale burger is the best burger I have had in Chicago. More on that later. Some of the reviews I have seen here have been a little baffling. However, I will admit, The Bristol does not seem very vegan or gluten-free/celiac friendly. I do not abide to either of those diets. Another reviewer here mentioned the servers will accommodate individuals with those restrictions, but I would call ahead and make sure. I did not find The Bristol to be unfairly priced, and I would have given it $$ rather than $$$. However, maybe brunch is much cheaper.<br><br> I went to The Bristol for brunch. The portions were just right (a little too much if you gets appetizers) and the food was flavorful. I was able to get reservations for 6 the day of for brunch on a Sunday. No small feat in Chicago, especially in the area The Bristol is located. The service was fast and relatively friendly. The Bristol is a small space. If you get claustrophobic, it probably is not the best place for you. The interior is stylish and modern but rustic. One thing I did not like were the chairs. They were crammed together and not very comfortable. Let's get to what really matters though: the food.<br><br>The six of us shared a pastry board the featured the cinnamon roll, coffee cake, and the basque cake. Each pastry was flavorful and delicious in it's own diverse way. The coffee cake looked plain (almost like a muffin), but it had a rich, deep cinnamon flavor. The texture was delightful. The cinnamon roll was soft and sweet. The basque cake, which I had never had before, was nutty and cinnamon-y. It was like eating a cloud with a perfectly crusty outer shell. The basque cake had cream and fruit as both decoration and flavor accents. We were all extremely pleased with the pastry board. If you liked sweets, I recommend getting this. It is a lot. There was enough for us to have 2 or 3 pieces of each pastry.<br><br>I love hamburgers. I try not to eat them too often to avoid red meat and all the bad that comes along with it, but I love them so much. When a hamburgers is good, it is like a little peek into heaven for me. I have had a lot of good hamburgers, but there are a few that will forever be ranked at the top in my heart: 1) Bud's Broiler in New Orleans and 2) JJ's in Guntersville, Alabama. I find most hamburgers are too charred, to soggy, to chewy, and any number of things. The Royale at The Bristol is by far the best hamburger I have had in Chicago and in a long time. There are two patty with a special sauce and pickles with the perfect meat to bread ratio. I don't remember what sauce was on the burger, but it was delightfully sweet. The bread seemed to taste slightly sweet as well (maybe it was brioche?). The patties were perfectly cooked and tender but not too soggy or overly juicy. I had already had too much pastry and some of the duck fat fries (very good but nothing overly noteable). So, in a rare turn of events, I was unable to finish my burger :(. I didn't want to ruin a good thing though. So I stopped. My husband also got the Royale, and he loved it too. <br><br>I will definitely be back here to eat the whole burger. I haven't stopped thinking about it since!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kxsianeh-I_Ll9d3wgzfgw/168s.jpg", "caption": "Royale with duck fat fries. Best burger I have had in Chicago."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/asicd3a-Urv3qkzLYLLQ9A/168s.jpg", "caption": "Pasty board at brunch. Recommend."}]}}, {"review": {"des": "Every time I get dinner or brunch at the Bristol my experience is better than the last. The service is attentive and fast and the food is unbelievably delicious. The mushroom toast is heavenly and is a huge portion. The pasta is fresh and seasoned perfectly. The scallop ceviche.... i would eat it every single day!", "pics": null}}, {"review": {"des": "This place has been on my bookmark list for over a year. I hate to say that it was a little underwhelming and a bit of a disappointment. <br><br>The place: it does have a romantic vibe. Service was mostly pretty attentive. I think it'd make a good date place, thought tables are of course quite close together. We didn't get cocktails and it wasn't  super crowded the night we went, so we were able to hear each other across the table, and I was glad for that. <br><br>The taste: here's really why it's not getting 4 stars. There was barely a bite that I wanted to keep going back for, save the dried orange on the charred cauliflower. That was a delightful bite of autumn, by the rest of the bites, all fine, not outstanding. We shared the monkey bread (Good, but wayyy too rich with butter for my taste), the apple salad (fine, dressed decently, not amazing), charred cauliflower (decent, the dried orange made it better), the burrata (I've had better burratas. Was good, not exceptional. They also kept asking us if we wanted more bread, and when eventually we did ask for more, we saw that they charged us for it. It was only $1 so we didn't say anything, but it would have been more respectful to let us know there would be an upcharge). The basque cake was good, buttery, nice textural contrast between the crust and the cake, but do I need to go back there to eat it again? No. <br><br>My face: a half smile, but that's also partly due to spending this meal catching up with a dear friend. the quality of the food was solid, so $33 pre tip (per person) is reasonable enough. No cocktails, and a shared dessert. <br><br>I would return if someone wanted to take me there but not sure I'd go back of my own volition. And that is not the takeaway that I thought I'd have from this evening.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/msIdZhBB3KoVuFx1Q35jVA/168s.jpg", "caption": "Burrata today and tomorra"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pzKXGF7upmPuR8bemJZldg/168s.jpg", "caption": "Basque cake; one of their specialties. Tastes like butta"}]}}, {"review": {"des": "Great atmosphere and friendly staff! We loved the craft cocktails they served, I highly recommend the Black Diamond which Katherine our bartender suggested. <br><br>We started with the Elotes which tasted so fresh and very flavorful. I had the Risotto with spring peas and chiles, it was very light and a great healthy but delicious option. The waiter was very nice and recommended the Amish Chicken which my boyfriend had. Safe to say there wasn't a bite left on the plate!<br><br>Overall it was a great experience and I look forward to coming back!", "pics": null}}, {"review": {"des": "Decided to make a reservation at The Bristol for restaurant week! I was looking over their menu on Choose Chicago and everything looked amazing! Got to the restaurant around 5pm when they're open for dinner and our waiter was attentive and explained the menu throughly. Started off with the Moscow Mule (GET THIS) <br>First course was fried oysters, second course was cacio e pepe, third course was Amish chicken, and last but not least the BASQUE CAKE! The Bristol made my first restaurant week experience a one to remember. Can't wait to come back", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bruErFYNgWff5j5Czp20Gw/348s.jpg", "caption": "Amish chicken"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Nk9geQcue9pMhw6oWhfKsQ/168s.jpg", "caption": "Cacio e pepe"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Lm2Eoxi83WCZbsvjd39JQw/168s.jpg", "caption": "Basque cake"}]}}, {"review": {"des": "I love everything about this spot, the open brick and wood ambiance with exposed lightbulbs for lights, windows that open up in the summertime for the fresh air, the friendly waiters and servers who take a few moments to give honest suggestions and make some jokes. Above all that the food was tremendous- huge portions! The duck fat fries and the burrata are must haves, as are the head on prawns. We also had the signature dessert, the basque cake made with strawberries and rhubarb from a local farm and it was amazing!! Definitely date spot, a gem in this neighborhood!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Z7zptDJFuaFSMyvE0blWTQ/168s.jpg", "caption": "Burrata be kidding me with this amazing dish"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bgFHYFl0cqZyVR7-rdGKaw/168s.jpg", "caption": "Strawberry rhubarb Basque Cake"}]}}, {"review": {"des": "Are you the kind of person who enjoys paying $15 for a single oversize ravioli that is described on the menu with a list of three ingredients and no other information? Do you think $17 is a good price for an unexceptional quarter pound hamburger? If you bought monkey bread for $8 and it was enough for three people to have one small piece each, would that please you? Do you think that it's good when waiters offer refills on soft drinks, then charge you for every one without mentioning it?  <br><br>If you answered \"yes\" to any of these questions, The Bristol may be for you!<br><br>Also, from the bottom of their menu:<br><br>\"The cook county department of health would like to inform you that consuming raw or uncooked foods may, in fact...be liberating\"<br><br>Ah, yes. Truly the chef here is a hero.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5CKAijpdUWv08by2AcKE7w/348s.jpg", "caption": "Yum, a single large ravioli for $15. You may as well just throw your money in the garbage."}]}}, {"review": {"des": "I'm biased because I had a lovely birthday dinner here on Thursday 9/14/17 with my best friends here but I loved it. I was worried my vegetarian best friend would have an issue finding food but she didn't at all - not only was the regular menu full of good options but our gem of a waitress (wish I remembered her name!) offered to get her a menu of only veg options! So cool. I had charred cauliflower, green beans, and the tagliatelle. Fiancée had the pork shank which I also tried. Everything was phenomenal - esp the pasta and pork. I will say though that the pasta was a smidge small which is fine because it's so rich! Thanks for a great dinner, Bristol! Please send love to our waitress.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_IS2mFh77XqvANhNcbYW7g/348s.jpg", "caption": "Free bday yum yums"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YVo2So_Ym_txglhdJIigZQ/168s.jpg", "caption": "My drink was so good I don't even remember what I ordered"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5cM4PtttL00eOpH5C-rFlQ/168s.jpg", "caption": "Killer green beans"}]}}, {"review": {"des": "Oh man, I think I found my new favorite brunch place. I went there with my dad when he was visiting from Wisconsin and we both loved it. The Basque Cake is basically what dreams are made of. It's face-meltingly delicious! My dad had the mushroom toast as well and he snarfed that down in about 5 minutes. The service was excellent too- not too much and not too little. The only complaint I have is that the server said the bloody mary's were 'a little spicy' when they were actually esophagus-on-fire level spicy. Just a word to the wise- don't order one unless you are prepared for this!", "pics": null}}, {"review": {"des": "It's pretty good food but for quite a hefty price and pretty small portions. I don't mind spending more for high quality food, but it really irks me when they skimp on the portions. Otherwise, the service is attentive and the environment is dim and romantic, not too loud. I wish I had been more impressed with the flavors that we tried.<br><br>What we tried:<br>Apps: pig ears were surprisingly tasty for pig ears, green beans were underwhelming, monkey bread and dill butter was super good<br>Pastas: not bad, flavors weren't impressive<br>Entrees: Amish half chick was the best dish on the table all night by far, Hanger Steak's broccoli was better than the steak itself which was too chewy and just okay, Pork Shank was fine<br><br>I wouldn't come back unless I'm trying to impress someone who is paying and wants multiple courses of New American dishes. They do take reservations thought which is nice.", "pics": null}}, {"review": {"des": "We last ate at Bristol years ago when it first opened and the farm to table movement was gaining traction in Chicago.  I used to drive by it every day on my commute to work and have wanted to return when I noticed they had cacio e pepe on the menu.  So we finally made it back on a bustling Friday evening.  I thought I made a reservation via Open Table, but it may not have been confirmed since the host wasn't able to locate it.  Luckily they had a table for use and it was one table away from the front where the large front windows were open.  I'm glad they have separate tables now since I thought they had more communal seating during our initial visit.  The staff were super friendly and welcoming, accommodating our toddler with crayons and a coloring sheet.<br><br>We started with a round of drinks then proceeded with a few starters, 2 pastas, then the burger with the duck fat fries.  The Head-On Prawns were so flavorful and delicious.  I wish there were more than 4 pieces.  The Monkey Bread came out with the Raviolo as recommended by the server so we could dip the bread in the brown butter sauce...a winning combination.  The dill butter was good, but the dill bread soaking up the brown butter sauce was a flavor explosion in the mouth.  The cacio e pepe was decent and the pasta was made fresh.  The burger was good.  I'm glad it came with duck fat fries so we could taste them.  Since the raviolo was so decadent and rich that it'd be hard on my heart to order a separate order of duck fat fries, which were also decadent.  For dessert we ordered the much lauded Basque cake.  It's the perfect size for 2.5 people and I can see why it makes it on many a \"Best of Chicago\" dessert lists.<br><br>The cocktails were also very good.  I started with the Poire & Elderflower, which was a refreshing summer drink as also tried the cocktail special featuring cherries, which was the ingredient of the month at that time.  Both were delicious and packed a punch so I was definitely buzzed by dessert.  Thankfully I still remember what a lovely time we had that night and hope to be back again sooner than the last time.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DUcteYdef20GALw8o9ZNiw/348s.jpg", "caption": "Head-On Prawns"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WDVjqzKWQJ0GgXwJX_Y2sQ/168s.jpg", "caption": "Clockwise from Top Left: Cacio e Pepe, Monkey Bread, and Raviolo"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/oVXrp_fJ4uxEXfoChDxfgg/168s.jpg", "caption": "Burger w/ Duck Fat Fries"}]}}, {"review": {"des": "Brunch was Ok. They have a great BLT and Bloody Mary. The salmon board was good too. I think there are better brunch spots. The service was very good and we had kids with us so that made me bump this review to a 4. I would come back for dinner but not brunch.", "pics": null}}, {"review": {"des": "We had a whirlwind, 9 week engagement and held our wedding ceremony and reception at The Bristol in late July.  It was a magical, amazing day.  We worked with Ashlei and Monica, Events Managers, and with the restaurant managers Jesus and Alex.  Everyone was prompt in their reply, attentive to detail, and extremely courteous to us and our vendors.  We ended up visiting about 4 times before the wedding to work out all of the details.  Our florist also visited several times.  They were more than accommodating to her, clearing their items off of shelves and taking artwork off of the walls.  They also met with our photographer about a week before the wedding.<br>The team problem solved with us when we talked about changing over the private space from the ceremony to the reception, with our music hookup, with a craft table for the kids, and with a few other concerns.  Ashei created a detailed BEO for me (she laughed because it was 10 times more detailed than most other events) and was patient enough to go back and forth with me several times before the wedding so that everything was perfect.<br>The day of the wedding is a blur, but it was flipping amazing.  The room was set up just as we had asked.  Ashlei sat with me before the ceremony and made sure that everything ran on time (we actually started everything AHEAD of schedule!) and then the event staff transformed the room for us.  The service was impeccable.  I had asked that the children be fed first, I had special requests in for vegetarians, we had special meals for the babysitter and the photographer, we had a request for no seeds for one table.  Originally, I started to check on each of these details, but the staff quickly assured me that everything was being taken care of, so I just forgot all of the details and had fun!<br>The food.  The food was beyond amazing.  I can't even describe.  We had truffled deviled eggs, flatbread, and salmon carpaccio as passed apps.  During the dinner, we had monkey bread, an endive salad as starters.  We had a carrot sugo pasta, Amish chicken, and steak as main courses, and then the basque cake for dessert.  We served late night bites (duck fat fries and beef sliders).  All of our guests were full and happy.  We had mac and cheese and grilled cheese for the kids, and special vendor meals for our vendors.  We had tasted everything ahead of time, and were pleased that the food was as good for 46 people as it was for the 2 of us.<br>The drinks were spectacular.  The craft cocktails were delicious- we worked with the bartender ahead of time for signature drinks, and mentioned some of the drinks we knew our guests would be ordering, so they had egg whites on hand for whiskey sours, diet coke for my dad, etc.  There was never a wait at the bar.  There was never a wait for food.  The staff was kind and gracious and fun- they were rocking out behind the bar as they cleaned up at the end of the night.<br>It was NOT a cheap wedding, it ended up costing about $220/person.  However, the good food and amazing cocktails were our top priorities, along with a really fun party atmosphere.  The Bristol helped us accomplish this and more.  I would also like to mention that there were no hidden fees- they were clear ahead of time exactly what we'd be charged.<br>I would recommend the private room at the Bristol for any celebration!  My husband and I are so grateful to the entire team!", "pics": null}}, {"review": {"des": "Came here for brunch on a Sunday at 1230. They take reservations. Very loud. Parked about 2 blocks away. I ordered the Bristol breakfast- 2 over easy eggs, hashBrowns, bacon for 13. So delicious. The basque cakes is unbelievable. You have to get it. We shared one order with three people. Menu is rather small and unique. Not ur typical brunch menu. I'll definitely be back!!", "pics": null}}, {"review": {"des": "I love this place, I'll just start with saying that. It's been good for years and they just don't quit. <br><br>I'm not going to research which chef came and went, but you can tell that while the menu options stick to a similar style of cuisine, you definitely get a variety of flavors from each new menu. Most recently there was a nice salty sour touch on many of the fishes. <br><br>Standouts for me were the ceviche (fresh fish being the key ingredient) and the scotch olives. The scotch olives were cooked to crispy perfection without being too heavy like a scotch egg can be. I'm also just a big fan of fun finger food. <br><br>Their ambiance is always on point, the staff is lovely and the food has been and continues to remain delicious. <br><br>Cheers to as many more as we can ask for.", "pics": null}}, {"review": {"des": "We came here to try out the restaurant week menu. There were so many courses that hubby and I decided to share. We had the apple salad which was AMAZING. The cheddar was a nice addition to the salad. Next we had risotto which was also good but the portions were small. Our next course was the amish half chicken which we didn't enjoy as much because the chicken was dry and it didn't taste like anything special. Our friends ordered the quarter pounder burger which they devoured and shared some of their duck fat fries with us which were delicious. I regretted ordering the chicken and immediately wished we had the burger instead. We finished up with citrus and chocolate (chocolate crunch bar, winter citrus sauce, and raspberry granita) which was also tiny and could be eaten in one bite but we both thought the flavors meshed well together.", "pics": null}}, {"review": {"des": "I had Sunday brunch here with a group of friends in the upstairs dining room. Service and food was mostly prompt, except for not being able to find our server for quite some time when we wanted to pay the check and go, but everything ran smoothly up until the end. <br><br>My husband had the Royale burger with duck fat fries, which was delicious. I had a cinnamon roll, a side of bacon, and an order of breakfast potatoes. FOLKS. Be prepared for the breakfast potatoes! I assumed it was like home fries, you know, the small squares or triangles of pan-fried potatoes. OH NO. These people served me a literal BOWL of whole potatoes. Like, at least 10 of them. Like, a whole bag you might buy in the store. Don't get me wrong, they were delicious, and for $4 for the side was absolutely a great deal, but you could have solved the Irish potato famine with the comical number of potatoes I got. Our friends also enjoyed the chilaquiles, and the chicken and biscuits, so there isn't a bad choice on the brunch menu. This is a place we'd eat again.", "pics": null}}, {"review": {"des": "We chose The Bristol for a birthday meal.  The service was outstanding - to the level they had printed customized celebratory menus for our dinner without us having asked!<br><br>Our waitress provided excellent guidance on the menu.  Noteworthy items included the chicken liver mousse, whipped feta, and the restaurant's signature pasta dish, which is a large ravioli that is truly exceptional.<br><br>Highly recommend trying this restaurant.", "pics": null}}, {"review": {"des": "We went to the Bristol for our first time during Restaurant Week. We did the Restaurant Week menu along with the wine pairing. We got there a little early before our reservation and grabbed a drink at the bar. It took a very long time to get a menu and our drinks at the bar but they were tasty once received. Everyone was very busy and they do have a happy hour special. The food was extremely good! Both my husband and I had the fried oysters as our first course then shared everything else on the menu. The pastas were superb. The wine also paired very well with the different courses. It's not a big place but it felt nice and cozy. Don't go here if you are in a hurry, but if you are there to enjoy a good meal, drinks and company then I'd highly recommend it!!! I'd go back in a heartbeat!", "pics": null}}, {"review": {"des": "Impressed by my first visit to Bristol! Love the vibe inside: lots of exposed brick, back bar display & lots of natural wood surfaces. Comfy.<br><br>Huge shout out to our server, KC (sp?). He patiently helped me with my issues of indecision, confidently recommended the salmon board (a new-ish addition to brunch), and maintained perfect timing (never hovering, always available). Thank you for such a nice weekend lunch experience!<br><br>The duck fat fries are impossible to stop eating, the gravy on the chicken & biscuits is so flavorful and interesting & the pickled accouterments on the salmon board were a huge highlight for me. Can't wait to check out the dinner menu.", "pics": null}}, {"review": {"des": "Okay, I change my review. Fantastic. Absolutely, fantastic. We came here for dinner tonight. When we arrived, we had to wait 10-15 min. past our reservation time so they gave us each a glass of prosecco to start . We ordered the duck fat fries (obviously) and the chicken liver mousse to start and both were great! I ordered the pan seared salmon (amazing) and others in my group had the duck confit and whole chicken and said it was great! We had dessert and coffee to finish. Overall, service = great, food =even better! Main staple in the neighborhood going strong and I can see why! Simply great!", "pics": null}}, {"review": {"des": "Now that's what I call a good brunch. Besides the fact that our meal was on the house courtesy of Samsung (thanks to them promoting at Lollapalooza), I would've gladly paid for everything. We ordered the chiliqueles along with the chicken and biscuits w/ gravy; both were extremely tasty. Their house coffee was bold and strong, just the way I like it to kick start my day. Been meaning to go back to try other items but Bucktown is a bit out of the way. Someday, hopefully soon. <br><br>Two floors, relatively spacious for a Bucktown venue.", "pics": null}}, {"review": {"des": "In our long weekend in Chicago, eating our way through the city, this was my favorite meal of the weekend.  We were there for a wedding, and while it wasn't the biggest party, it's still a huge challenge to cook quality food en masse.  Yet somehow, they nailed it.  The flavors were developed and complex, using fresh ingredients in a familiar yet unique way.  Every side dish and every entree, along with the dessert and drinks were fantastic.  The bartender was awesome, too, making drinks as complex as the food, complimenting the meal perfectly.  They offered the full drink menu and took requests for the entire party, and were nice and friendly the entire time.  My friend getting married was so excited about this place and I see why!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CclFkpxF29VrjlMohVFrgQ/348s.jpg", "caption": "Fruit tart & nutter butter"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/N1avDWojXpeic-JDQevtpA/168s.jpg", "caption": "Brussel sprouts"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VFjsxAtRRkarFcCezhG7cA/168s.jpg", "caption": "Chicken"}]}}, {"review": {"des": "This place was awesome. <br><br>I have been wanting to come here for six years since I moved to the city <br><br>Chicken liver mousse and spring pea risotto was delicious <br><br>Ravioli was unique <br><br>Wine list had a little bit of everything <br><br>Ambience was excellent <br><br>Pig ears or whatever were super salty", "pics": null}}, {"review": {"des": "We recently had our wedding here, and it was absolutely perfect. The team at the Bristol took care of everything, were so attentive leading up to the event and on the day of. And our guests keep raving it was the best food they ever had at a wedding. We love it there so much!", "pics": null}}, {"review": {"des": "Hip brunch place- awesome interior and environment. The pastries were also delicious! Especially the berry tart.<br><br>Unfortunately the main food and service was pretty subpar. Ordered the chiliquiles and was very disappointed. It was basically a bowl of chips with very little sauce and no egg mixed in. Also the latte I ordered as soon as I sat down didn't end up coming until all the food was out. I asked the waitress about it once and she seemed upset and short with me. Overall, I wouldn't come back here again in my next trip to Chicago.", "pics": null}}, {"review": {"des": "Delicious food and extremely attentive service --- I cannot say enough good things about our time at The Bristol!<br><br>We went on Valentine's Day and it was a full house but the vibe still felt cozy since there were dimly light candles on every table, exposed brick walls, and a chill playlist in the background.<br><br>We loved the monkey bread (especially the dill butter dipping sauce that comes with it) and both pasta dishes we ordered (cacio e pepe and tarragon tagliatelle) were amazing! The drink list was moderately priced with a nice selection of wine, I ordered the malbec and was very happy with it.<br><br>Also, Chef Joel Heseman and Manager Alex Cuper, are two of the nicest and most knowledgeable people I've met working in the restaurant industry. Joel came to our table and further described how the pasta dishes are prepared, and Alex gave us menu recommendations throughout the night, and even let us sample a new sparkling wine. <br><br>We will return, hopefully for brunch, since we've heard great things about that menu, as well!", "pics": null}}, {"review": {"des": "Had an excellent evening at The Bristol. Everything from the ambiance to the service was spectacular. In a city with so many restaurants it's nice to eat at a place where  you can tell the management is passionate about their restaurant. This is a tapas type place where everything can be shared. Recommend ordering a number of dishes and having a bite of each. It's one of those places where as each dish comes out it gets better and better. We tried a number of items. Here are my highlights:<br>Starters: order the head-on prawns (my personal favorite dish of the evening), apple salad (light and refreshing), and chicken liver (seriously, just do it... it's delicious)<br>Pasta: the raviolo is so rich and buttery. Pro tip-ask for the monkey bread to come out with the pasta. That butter sauce that comes with the bread...mmm I am still dreaming about it<br>Mains: the chicken was so flavorful and melted in your mouth. I am not one to usually order chicken for dinner but this might change my mind. The hanger steak was cooked perfectly and was cut up nicely for sharing. The trout was delicious- skin was nicely crisped but the presentation was a bit off putting even though the flavor was on point.<br>Sides: duck fat fries- need I say more <br>Dessert: the basque cake was delightful <br>Drinks: Ask nisha for a wine recommendation- she won't lead you astray(picked out the perfect bottle for our evening)  But the gimlet americano and black diamond cocktails were also both amazing. <br>I will definitely be back. Ive heard great things about their brunch so that is next on my list!  <br>If you're looking for a cozy evening with delicious food and friendly service you've found your spot!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qP3SpbChB1r7Duzstp1LNQ/348s.jpg", "caption": "Raviolo"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iCnugq3LcByNw3HaItJ9Bw/168s.jpg", "caption": "Monkey bread-sauce is to die for"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JZf8scMUKsSVLW4ZRNAp4g/168s.jpg", "caption": "Head on prawns- they cut them in half so they're easier to eat"}]}}, {"review": {"des": "Delicious food is obviously important for a restaurant and The Bristol has that in spades. I have eaten in many of the finest places in the country as well as in Chicago and have worked as a server in every type of restaurant, from crap holes to the highest rated places in Chicago. I say that only to clarify that I know how the restaurant world works. <br><br>Having a great dining experience with no hiccups is very important today with yelp and online reviews. But what happens when something goes wrong? Because every business will make a mistake at some point and how they handle that mistake is equally as important if not more to me than having a perfect dining experience. <br><br>Most places will try and minimize when something goes wrong. I have worked in places where the management has told waiters they are not allowed to say \"I'm sorry\" to a table and if you are anything like me and never complain (I can't tell you how many times I've picked out a hair of my food and just kept eating....don't judge me) you may leave feeling unsatisfied if not pissed. The sad thing is, it's the people who raise holy hell that get the comped meals or the grand apologies. Not the nice people who understand that $**# happens and let the mistakes slide. <br><br>Rant over, let me get to why The Bristol is great. <br><br>I ordered food from them and it was running late. As far as I know it was no fault of the restaurants but the delivery service. I called up to make sure it was on its way and would have been happy just to hear that it was and just running late. The person on the phone immediately apologized saying that it was made and just waiting to be picked up. We were fine with that, saying that we just wanted to make sure it was coming. They said it wasn't acceptable that we had to wait and that they would comp the meal and give us some gift cards. We told them that wasn't necessary but they insisted. Not long after the call, the food was delivered by a man with a Bristol shirt on saying that they were sorry about the delay and handed me a gift card. I found out later that they personally drove it out to our house. I got a voicemail from them today saying that they refunded the meal and it should be finalized in the next couple of days...I got a text a short time later saying it was refunded. <br><br>The food was super delish and I'm still amazed at how they went above and beyond to make sure we were taken care of. I think I may be jaded by the normal way most businesses handle these types of situations but its really special how far The Bristol went to take a common mistake and make it right. I am a fan.", "pics": null}}, {"review": {"des": "The Bristol is one of the best meals we have had in Chicago (and my husband says it was his favorite)! Everything about the restaurant is top-notch! The atmosphere is cozy, dimly lit and loud. Although, not too loud. The service was impeccable - our water cups were always filled, plates removed, silverware brought and the server was attentive and informative! She was also friendly! We ordered the green beans - excellent, received a complimentary monkey bread - the dill butter and bread was amazing, the mushroom risotto- maybe the best risotto I have ever tasted, the skirt steak - very good and apple pie with caramel gelato - excellent - simple and perfect apple pie! I would highly recommend the Bristol and look forward to returning!!", "pics": null}}, {"review": {"des": "This was one of the better dinners I have had in Chicago. I had two very delicious cocktails -- one was lemony, while the other was similar to a whiskey sour but much better than I've ever tasted before. The duck fat fries were very tasty with a delicious garlic aioli. I also had the tagliatelle which is served in a lobster broth with crab -- it was comforting and scrumptious. My husband said his chicken (the amish half chicken) was probably the best he has ever had. I am inclined to agree -- it was extremely flavorful and crispy with a really interesting bit of salad/garnish. Also, the service was impeccable. Our waiter made a point of not rushing us (he'd say \"just let me know whenever you want to put in food\" as opposed to \"are you ready to order\"), but we never had to go looking for him, and our places were cleared/glasses refilled/etc. seamlessly. We sat right by the open door, which was perfect for the warm breezy evening. Definitely a memorable evening.", "pics": null}}, {"review": {"des": "Nice, small restaurant in the Bucktown area. I went with my parents while they were visiting. Very good food, but probably a bit over priced for what you get. I think they take themselves seriously, if you know what I mean. The service, however, was top-notch. Would recommend the cacio e pepe- an Italian classic. The risotto was also fantastic. We were informed that many people do the food family style so everyone can try everything. Good call. Overall good experience and good food.", "pics": null}}, {"review": {"des": "Hubby and I enjoyed a marvelous dinner here.  Each dish was better than the last.  We dined here during Restaurant week and it was our favorite of the six restaurants we visited.  <br><br>Although the noise level was a bit on the high side, we loved the decor with a modern yet cozy ambiance.  <br><br>Dinner started with baba ghanoush, which was excellent but didn't taste like your typical eggplant mash.  Not sure exactly what they seasoned their dish with but we both loved it!.  For my next course I had the chicken liver mousse on toast.  I know not everyone loves liver but I actually do and this did not disappoint at all.  It was excellent and I hope to go back and be able to order it again!  Hubby had a salad which also enjoyed but agreed that mine was outstanding and he doesn't love the liver the way I do.  For his main, hubby had the chicken, which evidently is their signature dish.  I tasted it and it was excellent.  Super juicy and flavorful!  I had fish that was done perfectly!  I loved the crispy skin that they left on.  The dish was subtle and simple but perfectly done.  For dessert we both had the Basque cake. Loved it!<br><br>We also ordered the wine pairing which was a bit of a disappointment because we went at the end of restaurant week and the wine pairing was more popular than they had expected so they were out of three of the four pairings so they had to substitute.  The substitutions were fine but we would have liked to have had what was planned.<br><br>All said I think that we will be back and we are looking forward to sharing with our friends!", "pics": null}}, {"review": {"des": "The duck fat fries are a must. The Amish half chicken lacked in flavor. The rolls are to die for. The wait staff are decent. Decor is rustic chic. All around a good dining experience but I was not WOWed.", "pics": null}}, {"review": {"des": "Pablo was an amazing server. Everything we tried was great. A few highlights were the risotto, salmon and beets. We will be back!", "pics": null}}, {"review": {"des": "Amazing fries, cinnamon rolls and nutter butters! <br><br>Ambiance: Very roomy, with lots of natural light coming in on a sunny day. They also have those large windows that open up to make it feel like you're outside, which they opened while we were there, it was nice. It was very roomy for a Saturday morning/afternoon. We made a reservation for 10am thinking it would be super busy (as is any Saturday or Sunday around brunch time), but it wasn't. And throughout our time there business was pretty steady and never got packed. The fact that it wasn't super packed or busy made it feel very roomy. With the amount of space, I'd say it's a good brunch spot if you have kids and need high chairs. <br><br>Food: <br><br>HIGHLIGHTS: <br>Cinnamon roll, doughnut, duck fat fries, pork chilaquiles, and the \"hangover.\" <br>Main plates average $15 a plate and sides $6<br><br>DETAILS: <br>The cinnamon roll was amazing, words can't justify or describe how delicious it was. It's not like a Cinnabon roll (one of my favs!) with a ton of icing and overpowering cinnamon flavor. It's light with the perfect amount of icing and the texture was fluffy and basically melted in your mouth. The doughnut was a vanilla custard filled one with blueberries and lemon flavoring, covered in powdered sugar. It was similar to that of a paczki (the Polish doughnuts pronounced \"pon-chki\"). I didn't really taste the vanilla or lemon flavoring, but definitely the blueberries. It was yummy and I'd recommend trying it especially if you love doughnuts like I do! Both the doughnut and cinnamon roll are good for sharing between 2-4 people. <br><br>The duck fat fries, wow. These are honestly the best fries I have ever had. They tasted amazing and were super crispy. You get alot for your money, good for sharing for a group of 4. I ordered the pork chilaquiles and they were good. I was a little disappointed that there wasn't some more meat, but otherwise the meat was very tender and tasty. It was my first time having chilaquiles so I have no basis of comparison. But it's good for sharing or for one person, I finished all of it. My friends got the \"hangover\" ramen and they weren't wowed by it. They said the noodles were really good, but the broth was just ok. Lastly, since it was my birthday they served me their homemade nutter butters. I love peanut butter and cookies so needless to say I really enjoyed them. My friends don't like peanut butter, but liked the cookie. Even though I got it as a birthday surprise, I'd order them again. <br><br>I love that the brunch menu is on the smaller side compared to most so it doesn't make your decision too difficult. I would definitely come back to try some other things or for dinner. <br><br>Service: Our server and service overall was great! She was very attentive and quick.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WULeUj-KWAvIg34B5SRo0A/348s.jpg", "caption": "Braised Pork Chilaquiles"}]}}, {"review": {"des": "The food was was very good; minus 2 stars for the service.  We arrived on a Saturday night with a 8 pm reservation, and were told that our table was not ready. When asked how long it would be, the hostess refused to give any time, saying that she didn't want to underestimate.  As the bar and dining room were packed and there was no place to wait, we asked if there was a bar nearby, to which the hostess shrugged her shoulders, and said \"Not really.\"  Our party of four then had to wait awkwardly by the bar and restrooms for over 20 minutes while a four top sat empty.  No one offered us a drink, and when one of us was finally able to flag the bartender, it took a good 15 minutes for 3 cocktails and a club soda to arrive.  While the manager was apologetic (as he had to keep walking past us), no one offered to comp our drinks, and, mostly, we felt like unwelcome guests, always in the way.  We enjoyed the monkey bread, salmon, and Brussels sprouts, among other dishes.", "pics": null}}, {"review": {"des": "I drive down Damen avenue all the time, and easily drove past the Bristol everyday without even knowing it is there.  A small quaint, yet busy restaurant is always a good sign, especially when it is difficult to book a reservation or change it.  Arriving for dinner with friends, we were politely greeted by the hostess, and asked to wait for a bit, while they cleared a table.  We were offered a drink at the bar.  Making our way over to the bar, we noticed how crammed this restaurant really is.  If you're not sitting at the bar, you're taking up an entire aisle.  Constantly being asked politely to move.  My Boyfriend and I opted to wait outside until our friends arrived, and our table was ready.<br><br>When our table was ready, we were seated and greeted promptly by our server.  She made the rounds and was never away for maybe 10 - 15 minutes.  The busboy constantly filled our drinks, and the food came out to the table with good timing.  The service was impeccable, and a good enough reason to come back.  Our friends, did make one comment about how hot it was in the restaurant.  One of them even stayed in the bathroom longer just because it was much cooler in there.<br><br>The food was unique, and well prepared.  All the dishes we ordered were good; Duck fat fries, burrata, and asparagus as appetizers, tagliatelle, raviolo, and finished with the burger, and half chicken.  Ultimately, I was put off by their concept that their dishes are made to share.  I personally feel it is quite the contrary, and that it is a marketing tactic to accrue higher tickets from patrons (a statement not meant to be malicious, just my opinion).  The portions on the plate are not large enough for two people in some cases.  Also, I don't understand how a burger and fries are shareable either.  We reviewed the bill, ordering 3 apps, 2 pastas, and 2 entrees, almost two dishes per person, which is unusual if one thinks about it.  When was the last time you went to a restaurant and everyone ordered themselves each an app and an entree?  Doesnt happen often.<br><br>This is a spot worth trying for those that have not.  I will try to return for their brunch, because that is what everyone else raves about.  Good restaurant and good food concept, just wouldnt market my product as shareable.", "pics": null}}, {"review": {"des": "Not only was the food outstanding, but the service was also very accommodating.  We were entertaining our friend from California  and he wanted to try several local craft beers.  The staff created a sampler for him that he loved.  They also went out of their way to have us taste some of their best dishes.  We highly recommend the pasta and the homemade butter butters!", "pics": null}}, {"review": {"des": "Ok, two things that really bothered me. First, I hate communal seating. It's very difficult to have a private conversation without feeling or actually being listened to by other patrons. Second, the food was just okay. Nothing stood out as excellent or memorable. For the money, not a great value. <br>Oh, one other thing. The bathroom door lock was broken and my wife had someone walk in on her in the middle of... not great for a positive experience.", "pics": null}}, {"review": {"des": "I have never written a Yelp review, but last night's amazing dinner and service warranted a post to encourage others to go to The Bristol.<br><br>I came in with a party of four and unfortunately experienced a service blunder in which our three pastas were forgotten. While most places would have apologized and moved on, The Bristol staff tackled this head on. They apologized, rushed the pasta and informed us they would be complimentary. The staff continued to follow up and even offered a complimentary dessert (to go along with the three others we ordered...). I work in a five star hotel in Chicago and this was exactly how I would have recovered with one of our guests and I was extremely impressed with the team's poise and genuine nature to find a resolution. To the manager on duty last night, you handled it all with grace and you are the reason that I will continue to recommend The Bristol to guests at my hotel as well as my friends in town.<br><br>And of course... the food is fantastic...and I mean every, single dish. Usually, when you order as much as we did, one dish falls short, but not the case here. We enjoyed the crispy pig ears, deviled eggs, endive salad, monkey bread, cacio e pepe, papardelle, raviollo (MAKE SURE TO GET THE MONKEY BREAD TO SOAK UP THE SAUCE), whitefish, duck confit, and all four desserts. Each one either met the previous dish in flavor or surpassed it. <br><br>If you are questioning where to go for dinner for a great drink list, great meal and great service, please go to The Bristol. You will be happy.", "pics": null}}, {"review": {"des": "Service was super attentive and friendly. Interior decor was clean, new & had a great vibe. Duck fat fries were delicious- had a lemon zest flavor. Downfall- the rest of brunch. I ordered the pork hash. Tasted like under seasoned pork stew with a perfect cooked egg on top that had too much pepper (they had no problem taking it off the bill). Non crispy bacon & over cooked scrambled eggs. Over peppered soggy hash browns. Will not be coming back for brunch but maybe dinner if someone wants to meet up there.", "pics": null}}, {"review": {"des": "Portions were WAY too small for high prices (I am a 115lb. Female and was still hungry after eating a pasta dish), stay away from their lobster because it gave my friend food poisoning! The service was good.", "pics": null}}, {"review": {"des": "Had a great dinner in this neighborhood place<br>We were seated on time and staff was friendly <br>We started with drinks and wine <br><br>The appetizer Portions are large<br>We tired the mushroom toast which was great <br>The roasted cauliflower was ok not my fav.<br>The endive salad can feed three people<br><br>We enjoyed the white fish and the Pepe pasta( butter and black pepper)<br>Dessert was flourless chocolate cake which was good too- not huge <br>Dinner w two drinks each cost about 140.", "pics": null}}, {"review": {"des": "What a great local spot, great decor and an even better menu! I've had brunch and dinner at the Bristol, and I'd have to say I was more impressed with dinner! \"But you only got the burger?\" You may ask...while you make a point, this burger was pretty out of this world. The waiter, when I asked for a recommendation, said the burger is rivaling one of the best in the city right now, and that does not surprise me! Simple, perfectly cooked and incredibly flavorful. If you're looking for an appetizer, you have to give the savory monkey bread a shot! <br><br>Great wine, great food and perfect date night spot (even if it is just with your mother in my case).", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/opci4hcXfBG6-ysPdr3PGA/348s.jpg", "caption": "Monkey bread FTW"}]}}, {"review": {"des": "KenScale: 8.5/10<br><br>During my trip to Chicago, my friend that I was visiting asked around for the best brunch spot in the city and came up with The Bristol, a New American gastropub that has been winning praises for creative dishes and cocktail menus. On a gorgeous Sunday (unusually warm for the beginning of November by Chi-town standard), I thoroughly enjoyed the brunch at this place. I'm by no means a brunch aficionado, but the execution of dishes was great.<br><br>If you had had too much to drink the night before, you can't go wrong with hangover breakfast dish in the form of noodles and vegetables in pork broth. It is definitely not the ordinary dish, but beats many other ramen dishes I've had before, with aromatic flavor that was very soothing without overpowering your palate. I don't think I've had the Mexican traditional dish chilaquiles before, but the one with braised pork at The Bristol was simply amazing. Combined with fried egg, lime, cilantro and queso, I'm ready to declare this dish the best brunch dish I've had this year, with decadent flavor that somehow maintains nice balance without over-seasoning. I could seriously eat this dish for every brunch! Add in sides of crisply cooked bacons and duck fat fries, and your brunch has become suddenly wonderful. Cranberry coffee cake at the end capped a memorable brunch at the restaurant.<br><br>The restaurant has a full bar with some creative brunch cocktails such as bourbon sour (I haven't tried just because I don't like its flavor, but I saw so many other tables ordering their Bloody Mary). Getting a reservation wasn't challenging, but it was nearly packed in the course of my meal, mostly with young, hip crowds looking to have a good time in the suburban neighborhood of Chicago (yes, the restaurant isn't located in downtown). If you're looking for a nice brunch option in Chi-town, The Bristol won't disappoint.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MVyg5f44rOYp4B-lOqZaRQ/348s.jpg", "caption": "Nueske's Bacon"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ubpZYIua0RXU7AtKSXedLQ/168s.jpg", "caption": "Cranberry Coffee Cake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/whfA-NUUV511KaFwU5zJgg/168s.jpg", "caption": "Hangover Breakfast (Noodles, Pork Broth, Aromatic Vegetables)"}]}}, {"review": {"des": "I've been meaning to make it to The Bristol for awhile, so when my friends bought a condo a few blocks from the restaurant I was finally able to go. Me and three friends decided to share a couple of plates and then get our own entrees so we could sample as much of the menu as possible. Overall, nothing stood out to me that would make me want to come back to The Bristol.<br><br>*Parker House Rolls - the top of the rolls were so good, but the rest of the roll was a little dry.<br><br>*Duck Fat Fries - amazeballs!! Highlight of the meal.<br><br>*Octopus - just OK.<br><br>*Raviolo - definitely worth trying.<br><br>*Prime Skirt Steak - good, but nothing special.<br><br>*Frank and Beans - the bratwurst was delicious, but we weren't a fan of the beans. <br><br>*Lemon Tart - really good. Recommend trying this dessert.<br><br>* Blueberry Cobbler - too sweet for my liking. Felt like there were packs of sugar poured into this dish. <br><br>*Basque Cake - can see why so many people have mentioned this dessert in their reviews. Good and enough for two to share.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SFKGvD7IDE4X8ViS_8X66w/348s.jpg", "caption": "Basque Cake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7v-CaxkUMPdz_gnQuNmDbQ/168s.jpg", "caption": "Blueberry Cobbler"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4358RGZ4KjdDvxhuitSdZQ/168s.jpg", "caption": "Lemon Tart"}]}}, {"review": {"des": "Is it just me or is this place over rated? From the doors being completely jacked at the entrance to the valet guys looking like they're there as customers and not helpers. Oh and did i mention they tried to charge us $25 for parking \"after hours\" are you serious!!! Our waiter was so high strong that he made my date and I feel extremely rushed. After the valet guys tried to over charge us by $12 dollars we are so turned off to this place. We called the manager and Alex did help to address our experience. The guy outside w curly hair tried to make up for his lying co-worker which made things a fraction better. The whole experience was a turn off on returning. We won't be back.", "pics": null}}, {"review": {"des": "I went here with a group of friends based on yelp reviews.<br>It was A-OK.<br>We arrived on a Sunday evening at 7:30pm.<br>Our waitress came and got our waters, then explained the menu to us a little.<br>She recommended 7 appetizers for 5 people and 5 entrees.<br>She didn't come back for a good 20 minutes.<br>We ended up choosing 2 appetizers and 4 entrees. (She seemed disappointed)<br>Duck Fat Fries were amazing. It was perfectly fried with the duck fat, it was neither over/underwhelming.<br>Monkey bread also, amazing. The sauce for this was so freshly flavored. very addicting. Bread almost melts in your mouth.<br><br>We got a Pork shoulder roast, salmon, half a chicken, and parpardelle.<br>They were all very tasty.<br>The portions are small, so no wonder she recommended more.<br>I was with a bunch of girls who get full easily, so we were satisfied.<br>We didn't know the restaurant would close at 9 on a Sunday.<br>So they were practically shooing us out.<br><br>No upsell on dessert. <br><br>This was a pleasant experience but I wouldn't come back, only because there are so many other food spots to try.", "pics": null}}, {"review": {"des": "Hadn't been here in more than three years; just came back for a brunch last weekend.  It was good to be back since the food this time was a more positive experience than my last run here.<br><br>Tried the Poire & Elderflower cocktail, the duck fat fries, the pancakes, the Basque Cake and the Chicken and a Biscuit entree.  The only minor miss here was the Chicken; tasty, not overly juicy and tender, and there wasn't nearly enough gravy on the dish to make me happy (one of the people in our eight-person party also got this, and we both had to ask for extra gravy).<br><br>Otherwise, a great time, and the prices were more reasonable than I was expecting given The Bristol is in Bucktown.  Looking forward to a return visit!", "pics": null}}, {"review": {"des": "The customer service was good, but I'd to say the food wasn't good. I don't remember the name of what I ordered but it was seafood pasta (with crab, lobster, and garlic bread crumb) . I don't recommend that to anyone. I'm not planning on coming back", "pics": null}}, {"review": {"des": "I loved what i had that i would have gotten a double portion of I wouldn't be judged. The braised pork belly melted into my mouth but was crispy to bite into. My friend's order had these delicious potatoes that were fried to perfection. The only drawback was their poached egg was a little more done than what i personally would have like. But since i didn't have any eggs on my dish, I care not. I especially love their warning on eating raw food.", "pics": null}}, {"review": {"des": "5 stars says it all!   Food, service, ambiance.   Really, I can't say anything over other than great restaurant.  Everything is perfect for sharing.  We had a party of four - we shared 3 apps, 2 pastas and 2 main courses.   Yum-o!", "pics": null}}, {"review": {"des": "I've been meaning to go to The Bristol for a while--I'd heard great things about the brunch, so I was extremely excited to stop by here for brunch one Saturday morning. <br><br>I got the braised pork chilaquiles, which was decent but not amazing--the dish felt a little dry, and I would've enjoyed a little more salsa/braised pork to top the tortilla chips. I also sampled the hangover breakfast, which had a nice flavor and a nice chewy texture to the noodles; however, the portion was a bit on the small side.<br><br>Overall, I was a little underwhelmed--perhaps I had too high of expectations, but I found the food decent but not amazing enough to warrant the hype it gets.", "pics": null}}, {"review": {"des": "I hardly ever review on Yelp but thought this experienced deserved it. We showed up for our 9pm reservation just in time to overhear the host apologizing to two women about the long wait even though they had a reservation. Also heard them say they wait 20 min upstairs for drinks that never came (they asked if they could be brought to their table if they ever were made). At this point we went to check in only to be told they didn't have a table for us and they had no estimate on when we would be sat. No apology. <br><br>We found a spot at the bar and planned to get drinks and apps while we waited. We waited 15 min and no bartender even said hello to us. At this point we left and decided we would never be back. Also there are only 4 other people at the bar and we saw the bartenders talking to each other for quite a while. <br><br>Stay away. <br><br>I can not speak to their food but I can say their service is awful. Too many great places in the city to even try this place again.", "pics": null}}, {"review": {"des": "I've been looking forward to coming here for so long and was expecting a great meal. Unfortunately that's not what we experienced during our most recent brunch outing. <br><br>We had reservations and were quickly seated. The decor and ambience is awesome with a big open door to the outside and exposed brick.<br><br>After waiting for a good 10 minutes before anyone even greeted us at out table, we were able to order our drinks. From then on, our our server was completely absent. We watched group after groups around us get their meals and then their bills before we even received our appetizer. We could hear the tables next to us also complaining about service. Empty drinks and empty waters were ignored, time after time, until they were pointed out by us...<br><br>By the time our Chicken 'N A Biscuit and Braised Pork Chilaquiles arrived, they were cold, almost to the point of being inedible... Clearly not how the were supposed to be served. The chilaquiles were too salty, but did have really great flavors. The chicken and biscuits were delicious but not worth all the other disappointments.<br><br>I'm sorry Bristol, I had hoped for so much better but was met with such disappointments", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vP1I2hB_EEzxqdj6s0XUXg/348s.jpg", "caption": "Strawberry creme doughnuts"}]}}, {"review": {"des": "Recently came here for Mother's Day Brunch per my sister's choice.  We arrived at 10AM although reservation was at 10:30, but they were nice to accommodate us.  <br><br>When we got there, I was expecting a different menu than their usual limited brunch menu, but it was pretty much the same except they charged $29 and it included coffee or juice and a tray of small baked goods.  Nothing on their menu appealed to me so I had a difficult time figuring out what to order.  <br><br>Didn't want salad for brunch.  Wasn't interested in noodles.  French toast sounded good, but since we were getting the tray of baked goods, I didn't want more sweets.  I don't like benedicts, chicken 'n' biscuit, nor chilaquiles so my only choice was a quarter pounder with cheese at 10:30 in the morning.  Didn't feel good about the \"healthy\" choice I had to make.<br><br>I ordered regular coffee, but it tasted like water so that was a bummer.  The tray of mini pastries was the highlight for me.  It came with their famous cinnamon rolls along with this almond financier and a chocolate chip-like scone.  <br><br>My cheeseburger was okay, but nothing special.  It had pickled onions, but no other vegetables so pretty plain.  The duck fat fries were good, but it wasn't the best fries ever as other Yelpers claim.  <br><br>Service was attentive although I was getting annoyed when they kept refilling my water and all I kept getting was more ice every single time and hardly any water.  <br><br>Overall, I was not impressed.  Perhaps, dinner is better.", "pics": null}}, {"review": {"des": "Look. We've all been there. It's Friday night and you're just gonna go out to a nice little bar with your friends, get some drinks and then head home for a good night's rest because it's been a long week. Harmless, right? <br><br>But before you know it, your buddy from forever ago shows up and buys a round, and you're having the best time, and then another round, and another one, and this continues, and the next thing you know, you're waking up on your couch with string cheese wrappers scattered all over your lap. <br><br>It happens to the best of us. That's when you crawl to The Bristol to revive yourself and become a functioning human again. <br><br>Kudos to Chef Chris Pandel for creating this dish and aptly naming it Hangover Breakfast because this concoction is EXACTLY that. This dish is probably responsible for preventing many dysfunctional weekends. This dish is probably the reason grad students pass their classes. I mean, this dish should probably win the 2016 election honestly. <br><br>So if you were an idiot last night and you're hungover and need to get your life back together (like I did), go eat this right now. <br><br>It's rich, savory, lemongrassy, warm, and you can literally feel the moment that it goes through your veins and turns you from the Walking Dead back to being a mortal again. <br><br>Not pictured: chop sticks and spoon. Also comes with a poached egg (obviously I got it without that).<br><br>P.S. Best coffee in a restaurant I've ever had. Also best Happy Hour deal in Chicago--but it is truly only ONE hour (M-F 5:30-6:30). 1/2 off small plates, beer, and wine. UNREAL.<br><br>P.P.S. Lauren is a fantastic server. I keep getting her section, which is lucky for me because she's super patient with my indecision over food choices.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fFodf4-QZIbNPTY7lRXW2w/168s.jpg", "caption": "Important."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/W0oei3t2o2ZfOxEwCJ4o6Q/168s.jpg", "caption": "Hangover Breakfast (without poached egg). Not pictured: chopsticks and spoon. Also this is the best coffee I've ever had in a restaurant."}]}}, {"review": {"des": "This placed was good for brunch, a little overly hyped but still good.<br><br>For a starter, we got the cinnamon roll and it was so sweet and delicious. Definitely one of the best cinnamon rolls I've ever had. <br><br>The \"Chilaquiles\" wasn't too bad, it's a different taste for brunch. Along with the Chilaquiles, I got the \"French press coffee\" which was delicious!! <br><br>My date got the French toast with a side of bacon and that was sweet and delicious. Really loved the strawberry cream that it came with. <br><br>Overall, the environment of The Bristol is so nice and calm. Really enjoyed eating during the day with doors opened. Servers were so friendly and great about recommending what to order.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5l2hWNA4nuwkjedPliw1PQ/168s.jpg", "caption": "Chilaquiles with French press coffee (bottom) and French toast with a side of bacon (top)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yot5J9-2IaTKeQc7pmFU3g/168s.jpg", "caption": "Sweet and delicious cinnamon roll!"}]}}, {"review": {"des": "Literally just came out of this place. Two words. LOVED IT!!!<br><br>Service was impeccable! Our server (didn't catch his name) was very knowledgeable of both food and drinks and knew exactly when to come check on us. He didn't interrupt us constantly and came two minutes after we've finished our dishes. <br><br>Food : where to begin. First, we started off with the mackerel dish and shrimp cake. The mackerel was cooked perfectly and seasoned so well. I am pretty good at pin pointing the spices in a dish, but the chef did a good job at keeping me guessing with this dish. The fish was delicate and paired well with the tangy fruits on the plate. The shrimp cakes were good. A flavor that is pretty new to my palette, a little bit of shrimp flavor and everything else that I cannot point my finger on . However, I can probably skip this dish the next time I come. Then we tried the lambs hearts and parts and the beef fried rice. The hearts and parts were served with a yummy jam and crostini with the hearts and parts in a \"spam\" like cut. IT WAS DELICIOUS! If you've ever had Banh mi, it tasted like the pate that's used as spread. The beef and rice dish with kimchi?<br>Was good. The beef was very tender and delicious with a bit of sweetness from the marinade. NOW, the part of the review I've been waiting for is the BASQUE CAKE! The hype? Yes, it definitely deserved it. I am NOT a fan of sweets whatsoever, but this soft poundcake-ish of deliciousness paired with candied almonds and creme frache ice cream was seriously to die for. It is, no exaggeration needed, one of the best things I've ever eaten. (P.S, I believe the waiter said one of the dishes we had was the chef's grandmother's recipe, amazing!) <br><br>After hitting some of the tourist food spots, Chicago Dogs & Deep Dish pizza, The Bristol's dishes should be the staple of this city! <br><br>I seriously love this place. 10/5 stars.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FTG9RMNQjfJqIJltviWUqg/348s.jpg", "caption": "Top: shrimp cakes and onion rings (delicious batter for the rings)  Bottom : Mackerel with salsa"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/f77FWhEUpHycFfaaMe-IIA/168s.jpg", "caption": "Lambs hearts and parts."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/l6m8XSn_pK0800lCVSyD0Q/168s.jpg", "caption": "Beef fried rice."}]}}, {"review": {"des": "We started by sharing a lot of apps. My favorite was the mushroom toast (a rather big portion). The mushrooms were super fresh and the creme fraiche was so good. The burrata was good, but pretty typical. The chicken live mousse was really good, and the red syrup (in a circle in the middle of the bowl) was a great compliment. They did not skimp on the bread with any of the dishes, and brought out some lettuce for our gluten free friend to use instead of bread. The beets with pistachios were really good, too. By then I was pretty full, but I did try a bite of each entree: the whitefish, farfalle, and hanger steak. All were good. The servers were very attentive and service was quick, but not rushed.", "pics": null}}, {"review": {"des": "Did not meet our expectations. Way too pricey.  Quality should be better for the price I'm paying.", "pics": null}}, {"review": {"des": "Yesterday, I took my son for a celebratory brunch and we had a wonderful time.  I wish had followed my instinct and made reservations.  While we did not have a wait in front of us, had we waited 20 minutes to arrive, we would have waited to be seated.<br><br>The room was very warm and inviting with low \"lightbulb\" drop lighting, throughout the space, with natural lighting coming through the street-facing windows. I also enjoyed the bulb terrarium hanging from the ceiling as you enter near the hostess station.  Not sure if the plants were live or faux, but was a very nice touch. <br><br>Neither my son nor I have large appetites, so we decided to try a little of this and a little of that.  We started with the sugar-coated doughnut holes which were served warm and very tasty...not doughy like yeast doughnuts and not cakey either, but somewhere in between.  $4 for 5.  I will say, I WISH we tried the cinnamon rolls, like the table next to us...they looked divine and large enough to share.  <br><br>I ordered the Seedling Farm Apple Salad with Hazelnuts and Manchego,which was served with an apple cider vinaigrette. The salad had an abundance of delicious micro greens and granny smith apples.  However, the dressing wasn't as flavorful as I'd like and on the acidic side.  Perhaps a touch of dijon mustard or honey/ agave nectar would have brightened it up. I also ordered a side of bacon which was cooked very crisp, the way I like it.<br><br>My son ordered the pancakes.  I have to say, my 17 year old is a pancake aficionado.  He took one bite and insisted I try it, which usually means \"WOW\".  I would agree, someone in the kitchen knows what they're doing in the pancake department. The cakes were moist with hint of vanilla, or at least that's what my palette tasted. The serving, three in all, were plentiful and filing.  <br><br>Next time we will definitely go for the duck fries, as I hear they are amazing!  As far as our service, our server \"Kelly\" really made us feel welcome.  Not only was she pleasant, she was very attentive and expedient.   <br><br>By the way, the music...was unexpected.  Lots of R&B which gave it a cool and upbeat vibe for brunch.", "pics": null}}, {"review": {"des": "If you're lucky you'll find 1 or 2, 5 star restaurants in a year.  Last night we got lucky at The Bristol on Damen.  We got there shortly after 5:30 and sat at the bar which we frequently do (bartenders tend to be some of the greatest people on the planet).  Pablo was one of the greatest of the great.  I'm a curious drinker, looking for new tastes all the time.  Elderflower and pear vodka, a white negroni, a few other mixes and we were starting to get happy.  This kid's really talented.  We looked over the menu which is limited in the number of items but generous in variety and preparation.  Pablo asked us what we liked and we then placed ourselves at the mercy of the court.  <br>Started with the endive salad, whipped feta, the crispy pig ear and monkey bread with dill butter.  I'm adventurous but my fiance's reserved (sic).  She inhaled everything and is still raving.  For entrees we had the raviolo and the chicken (both orgasmic) with a scoop of ice cream and the Basque Cake for dessert.  All washed down with a sweet \"DASHE\" Zinfandel.  Thank you, Pablo!<br>The place is small enough so the kitchen can really attend to the food, and it shows.  The quality is there, the value is there and if you're looking for something special, you should be there, too!", "pics": null}}, {"review": {"des": "Eat here, it's really good. High quality neighborhood spot.<br><br>Cocktails - A<br>Focacia - A<br>Apple salad - C (way too much apple)<br>Whitefish and roe - A<br>Linguini and egg - B<br>Porchetta - A<br>Basque cake - A", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lI11IUnOjYtajifeh12UDg/348s.jpg", "caption": "Whitefish and black roe"}]}}, {"review": {"des": "The Bristol is one of those restaurants that is obviously trying to appeal to a certain caliber of person, which is fine because \"different strokes for different folks.\" However, I personally felt the place was a little too gimmicky for a restaurant that is serving subpar food. Tasted the raviolo, the brussels and the duck fat fries. All three left much to be desired.", "pics": null}}, {"review": {"des": "Wonderful cocktails and food. We had fried oysters, burrata, and whipped feta as appetizers. The whipped feta was especially amazing! For dinner, my daughter had the raviolo with ricotta, farm egg, and brown butter, which was mind-blowingly good. My amish half chicken and my husband's whitefish were also wonderful. We would definitely return.", "pics": null}}, {"review": {"des": "Food was subpar and missed the mark, as did the service. Ordered both salad options, and the caesar was overwhelmingly dry and covered in parmesan cheese. Endive salad had little to no flavor, and no cheese at all-must've used it all on the caesar. Also $15 for a glass of sonoma cabernet is a little outlandish. Service wise, our waitress Jesse was just plain awkward. She was nice, but did a poor job of representing the restaurant to new diners and made it uncomfortable, we often found ourselves waiting for her. We were excited to try this place from the rave reviews, but to be honest the food was nothing special and prices don't align with the service you receive. Felt too much like going to goddess and grocer down the street.", "pics": null}}, {"review": {"des": "Had dinner here on Saturday evening and it was the perfect fun and delicious reason you go out on Saturday kind of experience.  Terrific food, great drinks, good service, and a lively room.  <br><br>The menu is eclectic and requires a little thought to order appropriately if you want anything approaching a balanced meal.  It's the usual small plate conundrum - everything looks so good so you want it all.  And it is all good, so order wisely but you can't really good wrong.  Here's where we landed:<br><br>Country Pate - really delicious, and excellent example of the art.  Better than at many French places.<br><br>Endive Tarlet - warm and savory. Great winter comfort food, could have used a bit more crisp in the crust.<br><br>Bristol Fried Rice - really outstanding.  Nice tang from the sauce and bite from the kimchi.  We should have ordered two of these.<br><br>Duck Fat Fries - 'nuff said.<br><br>Sticky Toffee pudding - don't even debate it, just get this.  Warm, gooey, great flavor and shockingly light pudding.  I don't like caramel or toffee and I love this thing.<br><br>Basque Cake - like super rich pound cake with outstanding accompaniments (marmalade, candied almonds, and crème fraiche ice cream (!!!!!)).  This is another outstanding dish.<br><br>But enough about the food - let's talk about the cocktails.  Interesting menu with a good balance of new and old.  Plus, plenty of boozier drinks without fruit juice, which I always appreciate.  I got the Sicilian Smoked Manhattan, which would clearly be Tony Soprano's drink of choice should he ever dine here.  This is like my dream drink - Smoked Bourbon, Amaro, and Orange Bitters.  The smoked Bourbon is kind of like drinking a cigar along with your Bourbon.  Only this way there is no ash tray needed (and you don't taste like a cigar the next day).  I highly recommend this one.<br><br>Service was outstanding.  Our server was very helpful and accommodating and the bus team was right on it. Plate cleared and set at exactly the right moment.  Shout out to this usually under appreciated team.<br><br>My old house used to be just a few blocks from here, we may need to move back just to have this be our local place.", "pics": null}}, {"review": {"des": "I was disappointed. I would like to say that the service was 5 Star. However, everything else was disappointing. We got there and waited 20 minutes beyond our reservation time for our table. Normally this would not be a big deal but it was so crowded that my wife and I were getting ping ponged around. We finally get seated and order. They bring out all three apps at one time and we had no room. The burrata was bad and had a hair in it, the mushroom toast was gross and way salty, but the trout salad was very good.  They did take he burrata off the bill which was nice. I got the crab pasta and it was so salty I couldn't eat it and my wife's whitefish was not fully cooked. Quite disappointing as a whole.  I would have given 2 stars but for the service was good and caring.", "pics": null}}, {"review": {"des": "i co-hosted a bridal shower there on Sunday and it was perfect.  The staff could not have been more accommodating. They also anticipated the needs of the party.  They could not do enough to make the event memorable and comfortable for all; including carrying gifts to the car.  We were able to order off the menu and the food was delicious.  Some of our group had the soft-shelled crab Benedict (rave reviews), and other items were equally tasty.  We did not feel rushed, could visit and generally enjoy this special occasion. Menu pricing was excellent, a real value for lovely food.  I would not hesitate to hold another celebration there, or just stop by for a meal.   Thank you to all the staff from the front door to the kitchen and all between!", "pics": null}}, {"review": {"des": "Delicious! Although it seems like this place has some hit or miss tendencies, it seems we came on a \"hit\" night. <br>I had the \"Painkiller\" cocktail which was rum based, with coconut milk and tropical juices. My wife had the Moscow mule; both cocktails were strong and flavorful. We started with the focaccia bread, served with a whipped honey ricotta spread. It was fine, nothing too special but tasty enough. Then we had the duck fat fries, served with a homemade ketchup and a garlic aoli. These were delicious, crispy on the outside and tender inside and the garlic aoli was delicious. Next, we had the raviolo, stuffed with a runny egg yolk and a cheese and herb filling, sitting in a sunny lemon butter sauce. Delicious! The textures and flavored of this dish were very rich and satisfying, and the slight acidity helped tamp down all that richness. Super tasty. <br>Next we had the escolar with red quinoa. Although I could see describing this as \"bland\" I personally don't mind something simple. The fish was buttery and perfectly cooked, the quinoa lightly crunchy, and there were a few crispy onions that added a little punch of flavor. Very enjoyable, and I'm not even a huge eater. We finished our savory endeavor with the kielbasa- yes, a splurge from our typical fish only eating style, but since they ethically source their pigs, we went for it. The cheddarwurst was salty, fatty and delicious, and was served in top of a pea purée. The one issue I had with this dish is the bacon in the pea purée, which I thought took the dish into a slightly too salty direction. It was still mighty tasty, but a touch too high on the salt. <br>We had the basque cake for dessert, which I enjoyed immensely. A very rich cake with buttery flavor, served with honey, crushed almonds and orange marmalade. The crunchy parts on the top of the cake were my favorite! <br>All in all we had a great meal and really enjoyed ourselves. The place was a little crowded and uncomfortable (hard metal chairs that bob precariously when one sits down) also, it was very loud because people are packed in there so tightly. <br>4.5 on food, 3 on ambiance- since food carries more weight for me, I'm giving it a 4.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9hIUD54y_2IpyDGBQdqMlg/348s.jpg", "caption": "Cocktails"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1Wjg44kMYDhbMPQXFpT5mw/168s.jpg", "caption": "Close tables, low lighting"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/A2FUZNDGh-xhiTqIbTDJrA/168s.jpg", "caption": "Basque cake - yum!"}]}}, {"review": {"des": "Out of all the reception venues we looked into, the Bristol was really the perfect place for our 30-person wedding. The staff were very personable, the food was delicious (appetizers, cocktails, dinner, and the wedding cake), and we really felt like Michelle and The Bristol did their best to ensure we had the perfect wedding night. And we did!<br><br>Throughout the planning process, Michelle ensured that we were satisfied with every detail we decided on. Her and the chef were even able to bring in an out-of-season dish we had requested.<br><br>Overall, there is nothing bad I could say about our experience. Every aspect of our wedding reception at the Bristol surpassed our expectations and perfectly fit our personality. We wanted an intimate, rustic, and beautiful wedding reception and that's what we got. Michelle and the rest of The Bristol staff provided us with an opportunity to share an experience with our family and loved ones that truly represented me and my husband's relationship and our life in Chicago.", "pics": null}}, {"review": {"des": "Fantastic restaurant!  <br><br>I enjoyed their very popular Roasted Chicken with Spätzle...wow, so good!  Amazing texture and flavor from the chicken with a subtle and rich flavor from the spätzle.  I also had the Duck Fat Fries, which were amazing.<br><br>I wish I could have tried brunch here and the burger looks impressive...I'm definitely going back!", "pics": null}}, {"review": {"des": "Great atmosphere and excellent service! A small place so tables are pretty close to each other. Pretty dark inside and the candles on the tables make the mood a bit more romantic.<br><br>The menu is small but every dish is great. Wasn't as hungry so I had that Raviolo which was delicious (on the smaller side). Also had the Black Diamond cocktail.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hq4jlDEZKCdqgONoEA_o-w/168s.jpg", "caption": "Raviolo"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OWmBCyZyYYQ03XCd2rtm_g/168s.jpg", "caption": "The Black Diamond"}]}}]}