{"name": "the-chicago-diner-chicago-2", "reviews": [{"review": {"des": "Okay, this is an awesome place. Friendly staff is standard. Big smiles and genuinely \"happy to see you\" people pack this joint. <br><br>And their menu proudly states, \"Meat free since '83\". Yet you can still order a Rubin and get a \"beefy\" sandwich that will satisfy you. <br><br>For your side, please indulge yourself and order the Mac and Teese. The flavor is outstanding and hearty. It's wonderful and that's not even the best part.  <br><br>Whatever you order to eat will be great so just order something and then... order a milkshake. Yes, this is the type of place that you order the meal just so you have something to make it look like you didn't go there just for a milkshake. <br><br>I had a chocolate milkshake. It was beyond amazing. Rich, flavorful and thick. Perfect. <br><br>A really great time with great food and service and happy customers. Love it!", "pics": null}}, {"review": {"des": "I went here playing host to some vegan friends from out of town.  They were super excited to try everything on the menu, and I was happy to come here with them.  They ended up loving everything they ordered<br><br>I tried the Reuben and it's really not that bad.  I wanted to give it the full vegan experience and I gotta say, solid 3/5.  My other non-vegan friend ordered the fries and the fries only- which I thought was super lame, but you can totally get by eating more normal food if you're hosting vegan friends and refuse to play along.", "pics": null}}, {"review": {"des": "This place is really great! I am not a vegetarian, but this place makes their food appealing to people with all dietary preferences. Their food had tons of flavor and the portion sizes were large. My friend and I each ordered one entree (a side included) and split both, but we could not finish them.<br><br>Don't let the vegan or vegetarian label turn you off, because they don't sacrifice flavor at all! There's nothing that tastes \"off\" about it. They have good meat substitutes if you'd prefer that, but they also have other great options that aren't meant to imitate meat.<br><br>I ordered a \"Reuben\" sandwich that had seitan as the corned beef, and it tasted similar to a normal Reuben. They put a ton of toppings on the sandwich, so it was very filling. I also ordered a Buddha burger, which had a sweet potato patty, chimichurri, and sprouts. Even though it wasn't meant to imitate meat, I thought it had tons of flavor and i liked it more than the Reuben sandwich. Their vegan cheddar and broccoli soup also tasted like real cheese.<br><br>I recommend trying their milkshakes. They are all vegan, but they taste EXACTLY like normal ice cream milkshakes. They are pricey though at $7, but I recommend trying one of them at least once.<br><br>The service was fast even though we went during a peak hour. My only complaint is that they charged me $1 for a side of mayonnaise and didn't tell me there was an upcharge. It's only $1, but I would have appreciated if they told me in advance they charged for extra condiments since most places don't charge you for that.", "pics": null}}, {"review": {"des": "We were only in Chicago for a few days but knew we HAD to find a chance to eat here - the diner is crazy popular and busy allllll the time, but for good reason! <br><br>The wait for dinner on a weekend evening was over an hour, so we decided to stop by the next morning for brunch. We arrived just before noon and only waited about 15 mins for a table. Service was friendly and attentive, coffee refills and extra napkins aplenty. <br><br>I ordered the vegan breakfast combo plate - tofu scramble, potato hash, seitan bacon & sausage with French toast. It was an insanely perfect vegan buffet of breakfast delights. The seitan bacon was sliced super thin, had great smokey flavor, and the perfect chewy/crispy textures. The French toast was thick cut and cooked well. My bf had the vegan Monte Cristo sandwich, which was also amazing. Everything we ate was so delicious and filling! Our portions were beyond generous and kept us full for the rest of the day while we explored the windy city. <br><br>We can't wait to come back and try some more fantastic vegan grub!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YWsUuZHHLHSbu2ysbvqqSg/168s.jpg", "caption": "vegan monte cristo"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZID8NG16pOe6Cc7v6Xycrw/168s.jpg", "caption": "vegan breakfast combo"}]}}, {"review": {"des": "Disclaimer: I am not a vegetarian or vegan<br><br>I  do, however, enjoy vegetarian dishes and veggie meat. My husband and I ordered the Reuben, country fried steak and \"milk\"shakes. The shakes were good but our main dishes were not great. The country fried steak, in particular, was very hard to chew (too thick to make it appear like steak) and the gravy was really over salted and had way too much black pepper.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EDUhJYW6VpBH3Xvul9oxzw/168s.jpg", "caption": "Country fried steak"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Bnkinyp3uhF5BacBgTyuCw/168s.jpg", "caption": "Reuben and waffle fries"}]}}, {"review": {"des": "Their vegan chocolate peanut butter milkshake is so thick and satisfying, the texture is probably better than some non-vegan milkshakes. A must try!", "pics": null}}, {"review": {"des": "We heard this was a vegan staple of Chicago so it was our first meal. We came in for a slightly late lunch on July 4th and ordered everything vegan. It was busy and the location isn't huge so we waited for a little while. We also had our luggage with us since we came straight from the airport. Our hostess was nice enough to offer us to keep our luggage in a little closet next to her while we ate. It was much appreciated since the tables were small and we consequently were able to eat with space. <br><br>We started out with a carrot cake shake to share. I had heard good things about their shakes and wanted a good vegan one. We ordered this flavor on the basis that carrot cake is our favorite and the rest of the flavors seemed pretty common.<br><br>The vegan whipped cream was good too. It wasn't as light and strongly coconut tasting as ones I usually have.<br><br>My sister thought the shake was too sweet, which I guess I could see, but I liked it. I was truly amazed by the taste. It literally tasted like carrot cake. I couldn't believe it. How did they get that taste so spot on? I was very impressed and recommend this shake. If anyone finds out how they make it, definitely let me know.<br><br>For our entrees, we ordered a chicago style hot dog which came with fries and country fried steak which came with mashed potatoes and steamed veggies. <br><br>We liked the hot dog but there were too many fries, and the fries weren't that good.<br><br>The country fried steak came with steamed veggies which were a great addition to the plate. I enjoyed the veggies a lot and wished there were more. The mashed potatoes were good. The steak and gravy were also good. My sister said it tasted like chicken to her but i think that's because it's fried. This was a super heavy plate with a lot of carbs so it was a struggle to make it through the entire dish but we did it.<br><br>All three items we ordered were great (although the hot dog at $10 considering we wasted most of the fries felt like a waste). My tip is to consider portion sizes when you order items. Some ladies next to us were each drinking their own shake and each eating their own entree. We had no idea how they had space for it but kudos to them.<br><br>Hit up the Chicago Diner when in the windy city!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jiykiqkLdClQ1buvrMwjlg/168s.jpg", "caption": "Chicago Style Hot Dog & Country Fried Steak"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/je58c72Xt8i4I3Y3xBvh1A/168s.jpg", "caption": "Vegan Carrot Cake Shake"}]}}, {"review": {"des": "Came here twice in 3 days :)<br><br>This place does not disappoint!<br><br>First night was spinach artichoke dip, potato leek soup & pumpkin milkshake. All were tasty & very filling <br><br>Second dinner was the incredible chicken fried steak (super garlicky sautéed veggies, yum) & pumpkin cheesecake <br><br>I AM HERE FOR THE PUMPKIN  <br><br>Friendly staff. Simple, comfy decor.", "pics": null}}, {"review": {"des": "I always stop here<br>when I'm around Chicago.<br>Amazing milkshakes.<br><br>This is one of my single favorite vegan restaurants in Chicagoland. Their milkshakes are absolutely amazing - they're the perfect consistency and very flavorful. A little on the expensive side, but it's so worth it. I would highly recommend the chocolate peanut butter milkshake or the strawberry milkshake.<br><br>The portions here are generous and the food is so rich and flavorful that one order usually turns into two meals for me. I personally think their lunch options are better than their breakfast options, but that may just be because the tempeh reuben here is so good. The tempeh reuben and the veggie sandwich are my go-tos, with a side of mac and cheese. If you're traveling near the area, Chicago Diner is a must-go.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TLv_xzGvlezNu0rNYpTxoQ/168s.jpg", "caption": "Reuben w Mac and Cheese"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JZ2C7fEj8eJ6o1MO77PGCQ/168s.jpg", "caption": "Chocolate Peanut Butter Milkshake"}]}}, {"review": {"des": "We came in for dinner on a Thursday night and the place was very busy but our group of 4 was seated right away.<br><br>The menu has a great variety of options, so much that I couldn't decide for a while what I wanted to try. <br><br>We ordered the buffalo wings and the Thai chili wings to start with. Both were extremely flavorful and maybe the best vegetarian version I've ever had. My husband agreed too.<br><br>I had the quinoa chili with avocado and cheese. Overall the dish was yummy, I personally loved it more with hot sauce when I had leftovers the next day. The fritters were yummy and a nice crispy texture with the chili.<br><br>My husband had a sandwich which he said was the best vegan/vegetarian meat substitute he has tried (I forgot the name!) Everything from texture to flavor was spot on. I knew he really loved it because he said this dinner was a highlight of our trip! <br><br>Highly recommend this spot for anyone looking for flavorful vegan/vegetarian food!", "pics": null}}, {"review": {"des": "Phenomenal! Great atmosphere, staff was friendly, affordable rates, delicious food! <br><br>Visiting from San Francisco, this place is a real gem <br><br>My only recommendation is to keep coming back so you can try everything on the menu- that's what I'd like to do !", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/miBtLTlF4gLQncEx-CxBpQ/168s.jpg", "caption": "The Radical Reuben Sandwich"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/b7p4HVxvlkv-3GcBJS7eNg/168s.jpg", "caption": "Chocolate chip cookie dough milkshake"}]}}, {"review": {"des": "Tried to go to this restaurant this morning for my friends bday - but it did not work out, we waited for 57 minutes for a table of 8 and the hostess decided not to sit us in the booth we were waiting for and sat a party of 2 - never again!!", "pics": null}}, {"review": {"des": "I stopped here on a Thursday afternoon. Staff was friendly, and they even offered to hold our luggage in a little employee area, which was so nice.<br><br>But the diner was really only a-ok to me, likely from what I opted to get. The sandwiches all looked good but I wanted to be healthier so I tried the soul bowl. There is no reason that should be 13 dollars. Greens, sweet potato, black beans, quinoa, and tofu. I just... don't understand. It was also bland as hell so the fact that I paid 13 for it was blah. Meanwhile, my husband got the avocado black bean tostadas and said they were freakin' great. Beers are 7 bucks which is kinda high. IDK, I wasn't anticipating paying 50 on lunch. I've been to other vegan diner/casual restaurants in other states and this was the most overrated, I'd say. <br><br>Still, if given the chance I'd absolutely try the diner again and I would undoubtedly take vegan friends here.", "pics": null}}, {"review": {"des": "Chicago Diner has the best plant-based menu in town. They've been around since the 80s serving yum vegetarian and vegan food. This is a great place to bring your carnivores to and show them that plant based food can be filling, delicious, yet nutritious at the same time. <br>Favorite things on the menu: Buffalo seitan strips (\"wings\"), tostadas, chilli, and of course regardless if you have room for dessert or not, you absolutely have to have a shake (chocolate peanut butter is in my last meal list). <br>If you want homey comfort food, try chicken fried seitan dinner. The sides are also great and at this place they won't overcook your vegetables.<br>It's always busy here and that's for a reason: you'll find good, honest food here.<br>Oh yeah, you won't notice service here - you'll be too busy enjoying your food.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DEMeImE0xNxmZ-AGKGwX0w/348s.jpg", "caption": "Thai \"wings\""}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/x6s5TdPwopJn2vyuiAN8UA/168s.jpg", "caption": "Spicy Crispy Chick'n Sandwich"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/daPGuuQC-Wy5bzug2BHzTQ/168s.jpg", "caption": "Buffalo seitan \"wings\" are my favorite"}]}}, {"review": {"des": "This place is way over rated. I've had vegan/ vegetarian food before this was by far the worst I've had. To top off terrible food, terrible service to match. Anytime I visit a restaurant I try to order a popular item that most people like.<br><br>Went to Chicago Diner on a Wednesday evening. They had a good crowd for a Wednesday. They cleaned a table and we were seated right away. Menu was easy to read. <br><br>I ordered the sweet chili wings for an appetizer. It was not what I expected. It was a very large serving but setain is very chewy it caught me off guard. The sweet chili didn't taste like sweet chili to me. Then my bf ordered the gyro and I ordered the poutine with out the gravy. The fries with vegan cheese were good. I also ordered a cookies and cream shake recommended by the waitress. Shake taste like diabetic food and it was not very cold also the consistency was very watery. Oh yea they forgot my bfs order so he never got his food when we asked how long it would be they asked what was the order. There were so many people that came in after us that were gerrymandered their food right away. Then they said they were waiting on the greens then at that point they brought it to the table we no longer wanted it. The waitress did apologize but honestly that was a terrible experience. How do you forget someone's order?<br><br>I do not recommend and I will not be returning. This place is probably for real vegans not for people wanting to try something different.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ybQPOfdMqZxnN-J7u5J3Dg/168s.jpg", "caption": "Sweet chili wings"}]}}, {"review": {"des": "Good vegan options. Their sauces really complement each dish well. I ordered the crispy chicken sandwich with sweet potato fries. I think the patty was a little too oily, so I'd recommend trying something else from the menu.", "pics": null}}, {"review": {"des": "This place has such a cool vibe and delicious food!! I got a peanut butter cookie dough shake and it was one of the best shakes I ever had. I got a veggie burger which was very tasty. They used a tofu and sweet potato patty, which I've never ha before, but it was delicious. The waffle fries were seasoned to perfection. Even my non-vegan friend loved the food and has been raving about it to her friends. <br>Outside of food, the atmosphere was really chill. There was cool art work along the walls and I appreciated the mood lighting. The staff was friendly and attentive. Overall it was a great experience and I'd love to go back if I come back to Chicago.", "pics": null}}, {"review": {"des": "I can't believe I was ever so short sighted to give Chi diner less than 5 stars! I'm mortified! <br>I order take out or visit their Boystown location at least once a week. <br>They have so many of my favorite dishes:<br>Caesar Salad (which can now be gluten free with their new tempeh)<br>Soul Bowl (just, yes) <br>All their fries + sides are amazing<br>Their gf chili and cornbread are so great. <br>And the shakes! The shakes! <br><br>Inventive and flavorful vegan comfort food in a quaint environment. Service is always good. I'm sorry for my less than 5 star review a few years ago Chi-DINER!", "pics": null}}, {"review": {"des": "Yes!<br><br>Come here. Eat all of the faceless, meat-flavored foods.<br><br>The gyro was on point, sweet potato fries are perfect without being overly thick, milkshakes are delightful. (omg that peanut butter cookie dough...)<br><br>Wonderful service from authentic, friendly folks in an adorable space.<br>Will be back for more comfort food adventures!<br><br>Bring your veggie-skeptical carnivorous friends here, they'll be just as happy.", "pics": null}}, {"review": {"des": "An awesome experience for vegan/vegetarians and just as cool for your standard omnivores like myself <br><br>I'll start off by saying this was the first time I went to a vegan friendly diner, so I didn't have any previous expectations other than good vegetarian places I've been to. And boy was I overwhelmed, there were just so many mouth drooling choices that I really didn't know what to choose.<br><br>Eventually I ended up going with the ruben. That sucker was super filling and was unique in every way. <br><br>My date, who is a vegan visiting town, was in tears of joy as she had all the potatoes and hemp she could ever want.  To top it all off, the desserts were fantastic. So from start to finish the experience is truly a unique and joyful one.", "pics": null}}, {"review": {"des": "This place is vegans' heaven!!!! The food is delicious, huge portion for everything, the service is fast and friendly!<br><br>I got one for each course: an appetizer, entrée, dessert, and a milkshake. Everything was so good! I can usually eat enough for 2, but the only thing I could completely finish was the milkshake, ended up taking half of the appetizer and half of the dessert to go.<br><br>If you're in Chicago, definitely try this place out, even if you're not vegan. You won't be disappointed ;)", "pics": null}}, {"review": {"des": "This is in my top three vegan places to eat right now. I prefer raw vegan food but when I need something that will hold me down for a bit I have little hesitation to go to Chicago diner. I haven't been able to explore the menu too much because I keep getting the same thing lol. The \"country fried steak\" and the \"Reuben\" (both made from seitan) are my go-to dishes. Also tried the Thai chili wings this visit. Will have it again. Will be back soon", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vVsQrPOhYN9SxOs9cEMqSA/348s.jpg", "caption": "Thai Chili Wings"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XK9RodYAizffyKdPtGhLeg/168s.jpg", "caption": "The Radical Reuben Sandwich"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7PZzplMUgipFhOFUejAI5Q/168s.jpg", "caption": "Country Fried Steak"}]}}, {"review": {"des": "A very convenient vegetarian option for most people. Last time I went with some friends, I was craving a grilled cheese. When I asked the server if they had any, they said it's only on the kids menu and I can't order it as an adult. <br>I was very disappointed that I couldn't get grilled cheese. So minus one star for that.<br>Their wings are pretty tasty as are their food options.", "pics": null}}, {"review": {"des": "If you're not used to vegan & gluten free foods, I don't think this place would be right for you. I decided to check it out and got buffalo \"wings\", mac and teese, an order of fries, cheese on the side, and an \"award-winning milkshake\" in the mint cookie dough flavor because they ran out of vanilla, which severely limited the milkshake options (I had wanted carrot cake). In all honestly, everything just tasted... weird. I don't think I would want to come back. Was not worth the money. Especially $7 for a small milkshake. Also, the service was not good... very long waits.", "pics": null}}, {"review": {"des": "Looking for an awesome restaurant that serves comfort food? Look no further than Logan square, meatloaf, burgers, nachos.. they have you covered. Did I say that the best thing is.... wait for it..... it's VEGAN. <br>As their signage says, \" meat free since '83.\"<br>We have been here over a dozen times and it never disappoints. It baffles me how they can make this all vegan. But I don't care how just keep doing it. <br>Oh, you want brunch? Their pancakes are fluffy and airy...<br>Do yourself a favor... try Chicago Diner. You're welcome  <br>James has to be by far the BEST server / manager there!!!!", "pics": null}}, {"review": {"des": "The vibes are hipster with healthier options in a casual diner setting.  Everything I have ever had here has been good.  The first time I came I had the famous meatless Rueben and yesterday when I came I had the black bean burger; both was excellent!", "pics": null}}, {"review": {"des": "My favorite place in Chicago by far. They do vegan food right and it shows since they've been around for quite a while. This place has the best vegan comfort food. We stopped in here and it wasn't too busy, we were able to get a seat right away. Service was awesome! She made great recommendations and was super friendly. We started off with the Poutine - so delicious! The cheese was melted perfectly and the waffle fries were a mix between soft and crunchy. We also ordered shakes since they are known for them. I got the Chocolate Peanut Butter one and my friend got the Vanilla one. I wish I lived in the area solely for these milkshakes. We ended up stopping there because we were so full. This will always be a stop I make when in town.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xbtsantHzoOT5fQN4ewxOg/168s.jpg", "caption": "Chocolate Peanut Butter Shake and Vanilla Shake"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/n1m4EmjQ0s1-ikuI8eSTHg/168s.jpg", "caption": "Poutine"}]}}, {"review": {"des": "This is comfort vegan food at its finest! It's a very cozy place to sit and eat thanks to the quirky decor and friendly service. The menu has a ton of options for vegans and non-vegans, and the portion sizes are very generous. I got the Buddha's Karma Burger add avocado and subbed lettuce for the bread. The grilled pineapple in it perfectly complimented the curried sweet potato tofu patty and it was very filling (even without the bread) - I had enough to take home with me for the next day. The chimichurri sauce that came with it was also amazing and perfect for dipping sweet potato fries into. I have yet to try their famous vegan milkshakes, but I tried a little of my friend's chocolate peanut butter shake and it was bomb. They are a little heavy though so if I went again I would split it with a friend. Would definitely go again!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ksTnPxMlZiZnjtRfMY5kjQ/348s.jpg", "caption": "Buddha's Karma Burger with lettuce buns, add avocado, and sweet potato fries"}]}}, {"review": {"des": "This place is ok.  Parts of the meal were ok, ​and other parts were delicious.<br>We loved the waffle fries! They are delicious on their own (as they have a Cajun​ spice on them) or obviously, with ketchup.<br><br>We both tried the curry cauliflower burger, and it was ok. <br><br>The service was friendly​ and attentive.  There are communal tables in the middle and smaller, 2-4 people tops with a shared bench on the sides.<br><br>I did not get dessert but they looked terrific​, and I am sure that if I would have gotten one I could have quickly given five stars.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JXdZoJFVXop9K-3vM24Ylg/168s.jpg", "caption": "Waffle fries- best thing on the menu!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/D3h1K4t4vHd84VxV3yn3Iw/168s.jpg", "caption": "Cauliflower burger with brussels sprouts side."}]}}, {"review": {"des": "I'm not vegan, but I would be if I had access to this kind of food all the time; or even knew how to make it. My friend from England flew in for a visit and I was really trying to stay mindful of his food preferences. It made me smile to watch him take to the restaurant like he just arrived home instead of just arriving to Chicago. <br><br>Chicago Diner in Logan Square has a more stylish presence than the one across town. More like a Bar, you walk in and there is a large selection of liquor on the wall sitting under a retro collection of VHS tapes, awaiting your selection to help you unwind. The seating is toward the back, but I felt less crowded sitting at the bar. I always love how there are little hooks for you to hang your purse in front of your knees. <br><br>I got slightly embarrassed when I went to order a Jack and Coke without realizing that perhaps cola was not a substance generally embraced by the vegan community. I didn't bother to ponder that possibility before ordering. I settled on a Vandermills cider on tap.<br><br>For dinner, I got the spicy crispy chicken and my friend decided on the same. The order came out with a bunch of waffle fries. The mock-chicken was delicious and I could not tell the difference between the seitan and poultry! Well done!<br><br>As if 2 adult beverages and a dinner weren't enough, my friend decided to go for some kind of vegan brownie ice cream Sundae and of course I had to try it for my review! I could definitely tell it was different from real dairy, but the dessert was still amazingly delicious. <br><br>I will come back here in the future, but only if my company is vegan. Otherwise there are places much closer that turn out tasty pub food in a pinch for the less discriminating palate. Yes, I know that's bold to say for the vegans who are reading this, but you never know, I might find myself someday looking between the thick buns of a burger, proclaiming \"where's the seitan!\"", "pics": null}}, {"review": {"des": "Another placeholder so my pictures link. I'll update with details later, but the 4 star rating holds true.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2ijvpmzKl5JJZyIVgfReAg/348s.jpg", "caption": "Chopped kale and spring mix - pomegranate vinaigrette, grape tomatoes, red onions, shredded turnips, watermelon radish, sunflower seeds."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7c7GidCIm9qRX47T3soWzQ/168s.jpg", "caption": "CRISPY CHICKEN CAESAR SALAD - Romain, house vegan Caesar, artichoke hearts, sundried tomato, panko-cayenne breaded chicken style seitan."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/e8Isw-Ne2RS38qTDzFctMw/168s.jpg", "caption": "Vegan Carrot Cake Shake"}]}}, {"review": {"des": "The customer service is AWFUL!!!! My high school besties and I came here to celebrate our vegan friend's birthday. One of us drove 3 hours from the Wisconsin Dells to enjoy what we thought would be a great time and meal, but we never got to do either. After one round of drinks which included an $11 shot sized mimosa, we waited over an hour for our what was told a 30 min wait, we watched in horror our table of 8 be given to a party of 2 who just walked in! We told the hostess that we had been waiting and she was very rude. She actually told us that we got there at 10:16am and the 30 min wait meant we would be seated at 11:20am. After the manager offered us a free appetizer to wait longer we left. A very frustrating and disappointing experience.", "pics": null}}, {"review": {"des": "Chicago Diner was suggested by people from an FB group I'm a part of.  So it was already on my agenda from the beginning. Being from CA and being a maximum failure with public transportation, I knew it was going to be a bit of a journey to get here from our hotel. But idgaf lol<br><br>OMG. The food was AMAZING. I haven't been to a restaurant like it yet in CA ( someone please tell me if you know of one!). The vegan poutine waffle fries was delicious and their country fried 'steak' was just like the 'real' thing. The gravy was on point also! It's a DEFINITE must try when you're in Chicago. The fact that I didn't have to look twice and screen the menu for what I can and can't eat was just amazing in itself", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Gu6Jh8spW6rHoEAQkUwruA/348s.jpg", "caption": "Meat Free Since '83!!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QzFH5-zuk-G5Zdmt80rA9g/168s.jpg", "caption": "Country Fried 'Steak'"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kmF7YRE4KvZJJBBeufvozw/168s.jpg", "caption": "Vegan Waffle Poutine Fries"}]}}, {"review": {"des": "Great place to dine at. There is limited parking in this area so public transportation or lyft/Uber is best. The place is typically crowded, but once you eat there I realized why. Upon entering we were greeted and waited 15 minutes on a Saturday night before being seated. The staff were friendly and knowledgeable of the offerings. I got the BLT burger which was delicious. I tried some of my friends pasta which was pretty good. The drinks we're nice as well. I had the Girl Scout which was sweet and refreshing. For dessert we ordered a milk shake peanut butter chocolate which was thick and tasty. I wasn't left with a bloated or gassy feeling after dining here. The seating is tight so you will get to know your neighbors. I definitely recommend.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4iIYZ4U9_6hgBy4JUfQNIQ/348s.jpg", "caption": "Chocolate peanut butter"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/oi65b5pfdF5Q29f1k7X-VQ/168s.jpg", "caption": "The BLT"}]}}, {"review": {"des": "It was good. You're going to pay a little extra here but good the portions are amazing! The people are nice and the food was really good. Don't try to reheat the food later it's still good just not nearly the same. I will be going back for sure!", "pics": null}}, {"review": {"des": "Jason (the hottest bartender in the world) was amazing. He in himself would get 6 stars but yanno. <br><br>I got the poutine today and I was told they weren't made with waffle fries. It's so sad. I don't know if I'll ever get them again. Bummer. <br><br>Bring back waffle fries plz", "pics": null}}, {"review": {"des": "The rumors are true: this place is good.<br><br>Prior to this year, the idea of being a vegan repulsed me (even if it was one meal.) Well 2018 is a new year! And while I won't go full blast with it, I had to find restaurants that would satisfy my vegan cravings. What I like most about Chicago Diner are the plethora of options to choose from. Many times when you think of vegan dining, you think it'll be a plate full of undesirable vegetables... And that's just not true.<br><br>I tried 4 things: vegan gyro (awesome), the vegan poutine (liked it), the Mac n cheese (this I could do without; I think Upton's Breakroom has wayyy better mac), and my favorite... The strawberry milkshake. I haven't had a ton of vegan desserts that I've liked, so this was a pleasant surprise.<br><br>I'll be back!", "pics": null}}, {"review": {"des": "I really have mixed feelings about this place.  First off awesome that it's meat free.. but everything here is super unhealthy, salty and just seems weird. Going vegan was a choice I made to be healthier and I don't exactly like the texture of meat anymore.  When I ordered some of the things it still had that weird chewy texture and almost tasted like rubber. <br><br>Also..Everything's made from Seitan. \"A definition of seitan: Although it is made from wheat, seitan has little in common with flour or bread. Also called \"wheat meat\", \"wheat protein\", \"wheat gluten\" or simply \"gluten\", seitan becomes surprisingly similar to the look and texture of meat when cooked, making it a popular meat substitute.<br>Seitan is also high in protein, making it a popular protein source for vegetarians and vegans. Asian restaurants often use seitan as a vegetarian mock meat, and seitan is also the base for several commercially available products such as Tofurky deli slices and other vegetarian meat substitutes.\"<a href=\"/redir?url=http%3A%2F%2F-thespruce.com&s=3ede5cc976b23544fe2e4f9260cb43ef40942c3e7414c8cd06267f0569ec4d34\" target=\"_blank\" rel=\"nofollow\">-thespruce.com</a>. <br><br>If you're looking for healthy options this isn't the place...  This is defiantly, dive bar type of feeling and total chill spot.  I won't be returning.. I drank almost a gallon of water and I'm still thirsty from all the sodium I ate with my dinner last night.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tuQKAHNMHyPTXXpzI24uGQ/168s.jpg", "caption": "Wings"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6O33db3SdRDr40Bgprfcrw/168s.jpg", "caption": "Reuben, quinoa chili, wings"}]}}, {"review": {"des": "I visited this place this past Saturday, 8/5/2017, because some lovely vegetarian pals were in town and suggested it. I'm assuming the place occasionally has a long wait or a wait of some sort, but luckily when we walked in, a table had just opened up. The menu here is full of insanely delicious creations, from vegan pancakes to meals where you can substitute tofu for eggs -- which, as someone who isn't the biggest fan of eggs, is a game changer for me. <br><br>Everyone on staff here dresses cooler than I could ever dream, and they're all my heroes for that, but along with their incredible senses of style, the service is definitely high-quality. Our waiter was very attentive, and the kitchen was quick and without flaw when it came to our food. I ordered the Mexicana bowl with tofu instead of egg, and it was deeeelicious and filling. I scarfed that bad boy down and felt amazing. <br><br>I also ordered a mimosa, and here's where I am dinging a star -- it was sooooo tiny. :( For $6 plus tip, I was pretty disappointed by how small the cup was. I often choose mimosas as my brunching drink of choice so I was surprised at how small this one was. <br><br>Otherwise, everything else here was fabulous: The prices for the food are fair, the staff is fantastic, and the menu is killer -- but not killer to meat-providing animals. I think I'll come back if the opportunity arises. :)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/z5EvjalUKCppb8m3oAX-WA/348s.jpg", "caption": "the Mexicana Bowl with tofu instead of eggs  still dreaming of this magical creation 2 days later!!!!!"}]}}, {"review": {"des": "AMAZING! My daughter & I drove from Milwaukee. The milkshake in itself was worth the 90 minute drive! Seriously one of the best things I have ever had - the cookie dough peanut butter milkshake. We ordered the gyro & the reuben, all vegan, of course + waffle fries & cheese. Everything was delicious. This is vegan comfort food at its finest. Will definitely return the next time Im in Chicago. <br><br>Vibes - a bit too hipster for my liking but overall a clean, fun diner feel.", "pics": null}}, {"review": {"des": "If you are vegetarian, vegan or even an open minded meat eater.... This is your place to give meatless dishes a try! You should be pleasantly surprised by the flavors being so similar that you may think someone fed you meat. The place is casual, and layer back. There is a bar as well located at the front of the restaurant. From downtown it is about a 20 min drive depending on the traffic of course. <br>We tried the nachos, Reuben sandwich, crispy chicken sandwich, Mac n tease, taco salad and the meatball sliders. All were good except for the taco salad. Think the sodium may be high, we are a little extra thirsty, however it was all worth it. The people next to us had the vegan shake and it looked great too! They reported that it was good, however we had no more space for it. Maybe we will return tomorrow to try the wings. Enjoy!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eDxlp-GwiUx_bBwT_kWJhw/348s.jpg", "caption": "Crispy chicken sandwich"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4R-1L6lV3CygllGsYwRWDw/168s.jpg", "caption": "Taco salad"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/M7EEaQIHveac1W8Fdu3rhg/168s.jpg", "caption": "Meatball sliders"}]}}, {"review": {"des": "I haven't been to the Chicago Diner in a couple years, and even at that it was the other location. Living not-in-Chicago is not as glamorous as one might think. <br><br>Anyway, my wife and I were in Chicago for our honeymoon and a concert in Logan. So we made a point to stop by Chicago Diner for dinner and MY WORD the food is so good. <br><br>Busy, bustling place, of course, but we were nonetheless seated quickly. Our waiter was great, charismatic, attentive without being burdensome. Ideal. My wife isn't vegan and I am, so this experience afforded us a really wonderful and gross/adorable opportunity: we got to eat a meal out, share bites with each other, double dip in the sauces, etc. It was amazing! I felt like a real adult human being with a real adult marriage! <br><br>A favorite sandwich of hers in the omnivore variety, my partner got the Cuban Sandwich. I went with the Titantic BLT Burger (oh gosh, that seitan = the best thing before or after sliced bread). Obviously, we both got waffle fries. SERIOUSLY, why do so few food establishments traffic in waffle fries? They are the absolute best version of fries out there. SO GOOD. And that Burger comes with the most dreamy and delicious chipotle sauce in the world. Next time we go, I might just order a vat of it and drink that for dinner. Yum! <a href=\"/redir?url=http%3A%2F%2FHow.to&s=a41f3073bc4ceaebcc01eb1a23bb7332ff2299fc4bd892a43728348380e044dc\" target=\"_blank\" rel=\"nofollow\">How.to</a>.even. I also have to say, the Cuban was great. Perfect burst of pickled flavor from the pepperoncini really rounds out the melty gooey Teese (I live in Michigan. Help! I NEED more Teese in my life.), yucca, and seitan. We both thoroughly enjoyed both sandwiches.<br><br>The milkshakes were super appetizing (to look at - we didn't order them because we were way too full, but we totally creeped on them at the next table) and we are going to make a point to save room for those next time. That or START with those next time. <br><br>So... this place is great, basically. Great price-point for the indulgent flavors and quality of meal that you experience here. I loved it. Of course, I'm vegan, so I'm biased. My wife also loved it, and she is definitely not vegan. She was really blown away by the texture of the seitan and the Teese (she's not a fan of most vegan cheeses or meats, on account of unconvincing textures), and she has fully supported routine Chicago Diner visits when we're in the city.<br><br>Highly recommended.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iSbiXjJtRrZUy3vSgcZmHQ/168s.jpg", "caption": "Cuban sandwich with Teese (so good) Mozzarella."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0T5u8z46Rgw3Npefdo3nMw/168s.jpg", "caption": "Titanic BLT burger."}]}}, {"review": {"des": "Good spot! But I didn't need to tell you that - all of Chicago loves this place!! And for good reason. The food is fantastic, and the prices are great, too! I had the gyro and fries and they were out of this world. Flavorful and the portions were huge. I left waddling - lol! <br><br>Deducting a star because the staff were a little off-putting. I came in alone for a quick dinner and there were about 4 girls at the front hostess stand gabbing and being loud while working. Felt really weird. <br><br>Other than that, I enjoyed it. Would prefer to come back in a group. Parking was a little bit of a pain, but it ended up being fine.", "pics": null}}, {"review": {"des": "Be carful if you have food allergies!<br>For a vegan, eco etc restaurant they do no like allergies on their menus. <br>I.E. the vegan shakes are made with soy milk but it is not listed. Not all vegan milkshakes are made with soy. It would be great if they could warn people before hand. To be fair, yes, if you allergic to something you should ask if its in the menus.", "pics": null}}, {"review": {"des": "I would become a vegan in a heartbeat if it meant I could eat here everyday. The food is simply delicious and so creative- I'm impressed whenever I come here. <br><br>Highlights:<br>Milkshake (duh) - can replace the soy milk with almond milk upon request, but why mess with perfection?<br>Classic Cajun Black Bean Burger <br>The Radical Reuben - enough food for lunch and dinner for later<br>Waffle Fries as a side - deliciously seasoned <br><br>They don't take reservations from what I was told, so prepare to wait a bit on weekends.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7uk9Um2Jbu2hfjrS_f6DXQ/348s.jpg", "caption": "Classic Cajun Black Bean Burger"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vzvSRRs2guUdYTxGzOAazA/168s.jpg", "caption": "SUV (Straight Up Veggie)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pFlYf0Pkx7FBeeNFR9gn8g/168s.jpg", "caption": "The Radical Reuben"}]}}, {"review": {"des": "Being plant-based, I am just happy in general that there is a restaurant that caters to us.<br>Food:<br>The Thai Chili Wings felt like seasoned rubber. The spicy chicken sandwich was okay and so were the waffle fries, but nothing spectacular. I feel as if the fries would go better with a different seasoning. My boyfriend ordered the Reuben and I had a bite and it was horrible! I honestly don't know how he ate it, but then again, he'll eat anything (and we were walking all day).<br>The portion sizes were pretty big, so there's that.<br>Service:<br>The server was really nice and friendly, but didn't refill my water once. The food was really salty and I ended up drinking my boyfriend's water and we asked for the check early because our server apparently didn't know that refilling water was a thing.<br><br>Overall, the food was very filling, but the sodium made us feel bloated and put us in a food coma. Won't recommend and probably will not be back. However, some people really seem to enjoy it, so kudos to them.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0pyv8IS5nZm1Ww-oTBTyRw/348s.jpg", "caption": "Spicy Chicken Sandwich, Thai Chili Wings, and Reuben."}]}}, {"review": {"des": "This is the best restaurant in Chicago. End of story. Get the BBQ wings. Get the Milkshake. Leave happy as F@#$.", "pics": null}}, {"review": {"des": "One of the oldest original steadfast and stoic vegan/vegetation strongholds in Chicago. I have loved this Restaurant for years and years. Their food is non-meat, just like me, and they rely heavily on tofu, seitan and other fantastic, delicious meat substitutes.<br><br>I love 'em!", "pics": null}}, {"review": {"des": "I usually don't venture out to vegetarian or vegan places (since I loooove meat, sorry), but I always wanted to try this place out since I heard it's one of the better vegetarian/vegan restaurants. Thankfully, my co worker decided that she wanted to try this place out. Who can say no to food?<br><br>We got the nachos to share which were absolutely delicious. I'm not entirely sure how you can remotely manage to mess up nachos. This plate felt really fresh if that makes any sense at all. <br><br>I got the portobello mushroom sandwich which was delicious! Sometimes you just know that the ingredients on your plate were older or not fresh. It was great to see the colors of the vegetables actually bright (if you know what I mean). I have had my share of portobello mushroom anything in the past and they always seem to skimp out of the mushroom. Not here, they really packed a whole lot of them on it.<br><br>Also, hello! A side of waffle fries were the best especially with the seasoning they had on top. Gave the fries a bit of a kick.<br><br>I would love to come back here and try their milkshakes. I was too full on my way out to try it. I will come back, you hear me!", "pics": null}}, {"review": {"des": "Had early dinner here during my Chicago trip. I've bookmarked this place for awhile as I've heard the vegan awesomeness is aplenty. I was told correctly! <br>Upon entry I liked the dimly light dark woody chic vibe of the place. <br>It wasn't busy so we got seated right away and our food came out quickly. I ordered the Buffalo wings, Rueben, Mac tater boats, & peirogi quesadilla. Everything was really good, & quality and presentation were nice. Very good sized portions. The best item I can say was the Ruben hands down. Really hearty and oniony. The marble rye was an excellent bread!<br>I would definitely come back here next time I'm in Chicago!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tPdsy84-WwyJmll-C-2yKw/348s.jpg", "caption": "The Rueben!! :)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/E5AcJbh_z9zj4gPp1ddsTQ/168s.jpg", "caption": "Peirogi quesadilla"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OpDrNCOqvoAqgTgykV_zCg/168s.jpg", "caption": "Rocking Mac tater boats"}]}}, {"review": {"des": "This place lives true to the hype!  I normally can't eat Cuban sandwiches because I can't have pork, but their Cuban was on point!  The faux meat tasted like the real thing, the bread was toasted to perfection, and the cheese substitute was phenomenal.  I also got waffle fries with cheese - the melted cheese had a distinct consistency that differed from nacho cheese, but I actually found it to be richer and better tasting.  I was too full to try the famous shakes, but will be back to try them next time!", "pics": null}}, {"review": {"des": "I stop by the Chicago Diner every time I am in town and have never been disappointed.  The Reuben, gyros and routine are some of my tried and true favorites but on my last visit I fell in love with the BBQ wings as well.  I had been eyeing up the pierogi quesadilla for a long time and finally tried it.  It was good but there are much better items on the menu.  I finished up with a chocolate peanut butter shake to go.  I'm already dreaming of my next visit.  Thank you Chicago Diner!", "pics": null}}, {"review": {"des": "Stopped by for breakfast over the weekend, ordered the tempeh hash. My meal was so overpowered by pepper I couldn't taste anything else. I think this came from the gravy, but it could have been the entire meal was doused in pepper (most of my meal was covered by the gravy - they put the biscuits and gravy on top of your entire meal). Both my friend and I could hardly finish our meals.", "pics": null}}, {"review": {"des": "This is the place to be...vegan, vegetarian or meat-eater! The Reuben sandwich with seitan is full of flavor and will probably leave you with leftovers (the sandwich is so big). The Gyro also has seitan and the tzatziki sauce is made well, but you also might need a to-go box. Both types of fries (waffle and sweet potato) are seasoned well, so grab a friend who will do halfsies with you! <br><br>To top it off, the current cookies and cream milkshake (vegan friendly!!) is on point. My friend and I asked to have a regular split into two cups and it was a perfect amount for the both of us. Yum!", "pics": null}}, {"review": {"des": "Meat Free Since 83! I got the Titanic BLT burger with sweet potato fries and a chai milkshake. I love that Chicago had a variety of vegan eats to try and this place was vegetarian/vegan heaven! The neighborhood was pretty hipster, but this wasn't extremely hipster ( like Lula's) haha. Good vibes. Friendly service. Great food! The burger was massive and so satisfying. The chai milkshake was perfection! Even if you're a meat eater, I promise you'll enjoy this diner!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6ClTWtOpP9wlSpmNsOPgRA/348s.jpg", "caption": "Delicious chai milkshake featuring a paper straw"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SZ8JSFPotuELhb5WtLw9vg/168s.jpg", "caption": "Titanic BLT burger with sweet potato fries"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9WzRExcQP_F9610fFrqVkQ/168s.jpg", "caption": "Front of menu"}]}}, {"review": {"des": "The restaurant was pretty hip. They had a collection of VHS tapes lined up by the bar and had a cool hipster vibe to it, probably because we were in Logan Square. I decided to try the famous Reuben Sandwich. I am a huge fan of meat and honestly this sandwich freaked me out with how good that corned beef seitan tasted. The vegan cheese had an interesting consistency. It tasted a lot creamier than regular cheese. I had the sandwich with a side of seasoned waffles fries, can you say yum. My roommate had the side of mac and teese with her Reuben. Again, the cheese had a different taste but still very yummy. We also tried their milkshakes. We had the strawberry and cookie dough peanut butter shake. They tasted like regular milk shakes. A little pricey for what you get but still tasty. <br><br>Overall a great experience. Didn't think I would enjoy vegan dishes so much. I want to come back to try some of the other things on the menu.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1PGDnI7KysS0Z2pUE54KIA/348s.jpg", "caption": "Strawberry Milkshake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lN2N4-08iXrt8e3a-AyIdQ/168s.jpg", "caption": "Cookie Dough Peanut Butter Milkshake"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/flr5avvjgrTzhDyoYq98Yw/168s.jpg", "caption": "The Radical Reuben Sandwich with Waffle Fries"}]}}, {"review": {"des": "Always a place we eat at when we visit Chicago! This time we tried the other location. Just as cozy and tasty! Great vegan foods that you can even fool a meat eater with. How do I know? The guys next to us got their food and his buddy said \"yeah it's all vegan\" - guy responds \"really? Well I don't know about it then...\" and then they tortured the word seitan. But, after all was said and done, the guys cleaned their plates. Tasty goodness. Apparently non-vegan approved too. <br><br>We order vegan foods we can't or won't make ourselves at home. I tried the BLT burger with the Mac n cheese. Partner tried the \"chicken\" ranch sandwich. We both loved our meals.<br><br>The Mac n cheese is nothing special - just white noodles with their cheese sauce. Still good, but reminiscent of kraft Mac .<br><br>Service is excellent. Laid back. Friendly and attentive staff. <br><br>Absolutely love this place and it's a treat to visit every time we're in town.", "pics": null}}, {"review": {"des": "the Chicago diner rules! <br>Super friendly service, delicious food. <br>We got the Thai wings, bean burger and Cuban. <br>Prices were as expected. <br>I wish I could say more but I just realized my leftovers are in the fridge. BYE!", "pics": null}}, {"review": {"des": "The Buddha Karma Burger was a bit salty, but the waffle fries are very soft and crunchy. The cinnamon french toast was a bit dry and the presentation was lacking.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6DoaB4M9kLnEFNs4OLIyEQ/348s.jpg", "caption": "Buddha 's Karma Burger and Cinnamon Roll French Toast"}]}}, {"review": {"des": "I finally got around to trying it for the first time after hearing vegetarian friends rave about this place. This place in Logan Square was pretty busy for a Thursday night around 8pm. I waited about 15 minutes before getting a table. The menu was very seitan heavy which I was hesitant about since I've never tried it. All of the dishes were HUGE GIGANTIC portions. They all tasted unique and different but each dish had their strengths and weaknesses. Take note that my viewpoint is from a omnivorous perspective.<br><br>Thai Chili Wings: Seitan was surprisingly good and the Thai sauce was delicious. They somehow managed to get a little bit of a crunch on the seitan which mimics real wings so super awesome plus! The downside is you have to eat this while it's hot because once the seitan gets cold, the texture changes to be a bit rubbery/stiff and is difficult to cut through. Would get this again. <br>Thai Basil Friend Rice -  flavor was good but the dish was way too oily. The rice was packed with veggies and tofu and it had a slightly sweet savory flavor, but the oil really overwhelmed the dish. Least favorite of the night.<br>Blackened Tofu: Really great attempt at replicating blackened catfish with tofu. The spices on the tofu was good but overall it seemed to be pretty simple. There were 3 different sides that came with it: sweet potato mash (so so), greens (really really good and the best thing on the dish!), black beans (I didn't try this) and quinoa (this in my opinion did not fit well with the dish and lacked flavor to stand up with the rest of the sides. <br>Mushroom Lentil Meat Loaf: Felt like Thanksgiving in this dish. While it doesn't replace meatloaf for me, it did taste like a really delicious stuffing with gravy (again this is from a omnivore viewpoint). The potatoes and string beans were also solid sides and again huge portions!<br>Chocolate mousse cake: dry compared with other vegan cakes I've had. Pass on this. <br><br>Service was fantastic and speed of which dishes came out was really fast. For those celebrating birthdays, they offer 1 free slice of cake with a candle to help make the dinner extra special!<br>Overall, these dishes definitely don't make me think I'm eating meat but as standalone veggie dishes, they held their own. It's a place that I would suggest to/come with my vegetarian friends but not sure if I would come on my own.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YZxWKJbB-ZIPOHqYmqXdqQ/348s.jpg", "caption": "Chocolate mousse cake"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vjOt5SQt9-A3qY_bKuJaJA/168s.jpg", "caption": "Mushroom lentil \"meat\" loaf"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Yr5nxqsOqOhu9xmFPoC3EA/168s.jpg", "caption": "Thai stir fry"}]}}, {"review": {"des": "So happy to have gone here on my trip to Chicago! Went here for my birthday breakfast, it was amazing! Cinnamon roll French toast with potatoes and seitian sausage. I wasn't a huge fan of the sausage but the rest made up for it! I mean who doesn't love cinnamon rolls!?<br><br>Also went here for lunch another day! It'd been a long time since I'd had poutine and it was everything I remembered! I had the mac and cheeze as a side and it wasn't as good as I was hoping but decent. I also had the karma Buddha burger which was great!", "pics": null}}, {"review": {"des": "First off, I'd just like to say that my husband and I are very new to eating vegan (it's been 4 months) and at first I thought I could never do it (I was such a carnivore lol) but I have to say that it's been an amazing transition for me health wise and I love that I can come here and have my \"meat\" cravings satisfied!  I wish we lived closer, but it's probably safer that we    don't, cause I would totally be there every week.  The food is great! We especially love the famous Reuben sandwich and the gyro! The waffle fries and teese cheese are amazing. There's not many vegan cheeses that I care for but this one really hits the spot. The milkshakes are so good.  My favorite is the chocolate, hubby loves strawberry.<br><br>The environment is really fun, it reminds me of a scripture from Proverbs 15:17 \"Better is a dish of vegetables where there is love, Than a fattened bull where there is hatred.\"  We've gone here a handful of times and everytime we go we meet great people, both workers and customers alike. I'd definitely recommend this place to everyone!", "pics": null}}, {"review": {"des": "I like burgers, brats, pork, chicken, and breaded steak. I'm not a vegan nor am I a vegetarian but, I am a big fan of the Chicago Diner. It's actually pretty good. To all my carnivorous brothers and sisters, give it a shot. It might not knock your socks off, but by the end of the meal they will be carefully folded in a pile on the floor. #bigfakemeatguy<br><br>P.S. Their shakes are expensive but worth it. Get the cookie dough one.", "pics": null}}, {"review": {"des": "I love the diner. What's not to like? Great vegan comfort food, best vegan milkshakes on this planet. I've been coming here for years and have probably dined in as many times as I've done takeout. They do a good job - takeout orders are typically ready quick. <br>Must get: wings! Milkshakes!", "pics": null}}, {"review": {"des": "If my food could be prepared like this all the time, I could easily go vegan. <br><br>Ambiance: Casual restaurant with old school diner like feel. <br><br>Food: Buffalo wings, chocolate peanut butter milk shake, caramel crunch torte and gyros with sweet potato fries. <br><br>Buffalo Wings: Great starter! Seitan can be a hit or miss depending on how it's prepared. While this doesn't exactly resemble the texture of wings, it definitely hit the spot for that craving. It was lightly breaded tossed in a buffalo sauce that had a bit of a kick to it. Perfect for sharing, but could also be an entree with a side. The ranch sauce especially really made this dish delectable!<br><br>Gyros: For the carnivores out there, it was prepped so well you wouldn't even know that it wasn't really lamb. It was exactly like eating a lamb based gyros. The sweet potato fries were good, but could've been crispier [for me at least]. <br><br>Dessert: Seriously couldn't decide! Everything looked amazing! Luckily my gf eats alot like I do so we got a milkshake AND cake. Peanut butter and chocolate has to be one of the best combos out there, you can't go wrong with it so we ordered this shake. The caramel crunch torte had a crunchy layer to it as well as a moist and spongey texture, bursting with flavor. We only finished 75% of the shake and almost all the cake in addition to finishing our starter and entree..... and we didn't feel disgusting. It was either attributed to the fact that the desserts weren't milk based or we're just not human fat asses. <br><br>For all our food, we paid about $40 total with tip. Not bad at all for the amount of food you get!<br><br>Service: It was good. The server helped us make firm decisions on our food choices and none were disappointing. Food came out pretty quick for being pretty busy. <br><br>Definitely recommend this spot for anyone, even the meat heads!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/p-OyXcOALLWJCK-BPnVTrw/168s.jpg", "caption": "Caramel Crunch Torte"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qUaHK7UfWzPMsTK6dktogw/168s.jpg", "caption": "Chocolate Peanut Butter Milk Shake #noms"}]}}, {"review": {"des": "I am writing this with the caveat that my vegetarian friend set the star rating for me on the basis of tonight's meal and service while I wrote the comments. I'm a meat eater, so forgive me my sins, I had a hard time choosing a meal that was filling. The staff wasn't very accommodating, either.<br>What crappy attitudes and lack of customer service. La de da, we are soooo special...our cuisine cannot be altered- you have real cheese, I have REAL MONEY, I want to GIVE you that money to PUT THAT real cheese on my food. WHY WON'T you do that- it's not that you can't , as you say (only sandwiches, blah, blah, blah, but not on my guacamole and chips? You'll put it on some weird avocado tortillas with cimicirsomething that I don't want, that you insist is close to guacamole and chips , (but a lot more money , plus icky stuff like quinoa and cilantro, jalapeño and cimisomething-whatever-that you'll stick real cheese on)! Just because the kitchen is really picky what looks good on what where when why?<br>Gee, is ice so costly that your water is served initially lukewarm? That's a real treat! It's annoying to ask for ice more than once, and especially when you need to ask a different server.<br>My vegetarian friend did enjoy her faux country friend steak, though she felt the original sauce that accompanied it was horrible. She had originally asked for bbq sauce to accompany it and the waitress had to be reminded to bring it to the table, and then it was a teeny amount.  The sweet potato fries were very good, however, and apparently redeemed the meal to the extent that she was willing to leave a 20 % percent tip. <br>I did enjoy the guacamole and chips, but not to the extent that I would ever go back. The portion was not very large, nor was it the quality of a fine Mexican restaurant; the consistency was thinner than what I would consider normal and did not appear to be freshly made to order.<br>On the whole, my friend  felt limited because many of the menu choices seemed to lean towards the \"spicy\" side. She did appreciate having a vegetarian restaurant to dine at while visiting Chicago from New Jersey.<br>I will not be returning without her. I'm sure they will not miss my meager business.", "pics": null}}, {"review": {"des": "I;m a fan WHO KNEW!!! This was my second time being dragged to an all vegetarian/vegan restaurant and WAY BETTER THAN THE FIRST ONE! I came here against my will and left saying I would for sure consider coming back. <br><br>My friend and I split waffle fries with ranch ( really good ranch), spicy chicken sandwich (really spicy and I love heat. impressive), pirogi quesadilla (yum) and finished off our meal with a cookie dough pb milkshake (holy cow it was amazing and I don't even prefer dessert). <br><br>Everything was really good and I left not craving meat ( unlike the last place I went to).", "pics": null}}, {"review": {"des": "This is my favorite restaurant in the WORLD!!  I've been eating at the Chicago Diner for 10+ year -- before I was Vegan. <br><br>I have dreams about the Radical Reuben (tm). Seriously, it is that good, and yes, it is deserving of a trademarked name. Even our carnivore friends agree this the best Reuben -- EVER. <br><br>The Vegan desserts, milk shakes, drinks, everything are equally good. You don't have to be a vegetarian to love this place.", "pics": null}}, {"review": {"des": "Upon my arrival to The Chicago Diner it had become obvious of how hip of a vibe the location was portraying. You have to get through two doors which were a little difficult for me to maneuver. Immediately to the right when you walk in is the bar, there's also a tv and the wall is lined with bottles and VHS tapes. It took about three minutes for me to be seen & seated. I was seated between two chatty couples so I immediately asked the server if I could move to a different table and they escorted me to one more fitted in a comfy corner. I ordered the SPECIAL RECIPE WINGS it came with celery, lettuce garnish, ranch, bbq sauce or spicy sauce, I asked for all the sauces on the side. I didn't really like this meal. It was very tough and I had to thoroughly chew the seitan to get any flavor. I could only eat one before I gave up on it. I do not recommend this meal at all. I also ordered two sides of fries with cheese, one sweet potato and the other regular. I wanted them both to be waffle cut fries but when the server came out with regular cut fries I explained to them that, yes I wanted both fries, just waffle cut style. The server came out again with two regular waffle cut fries, by this moment the server was obviously frustrated with me, I then asked her if the option was even available for the sweet potato fries then she said no. She asked me to wait for my order to be fixed, I told her to take her time, she seemed like she needed to take a break & I understand because she had a boot on. As time passed I had a clear view to a hallway which leads to the kitchen, I can see my server discussing with some other employees and soon after a different server brings me the same regular cut sweet potato fries that I received in the beginning, I can tell they were the same because they were cold. Nonetheless, I enjoyed the fries. The waffle cut regular fries with cheese was delectable. I used to be all bout cheese before I went vegan, this cheese really hits the spot! After all of this I still paid in full price and tipped nicely. I don't like to waste food so I got a to go box so I could give this SPECIAL RECIPE WINGS to my little sister. I will be coming back to The Chicago Diner to hopefully receive a better experience and  to order one of their famous shakes.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/t7Dtvbt5jSDSGsYJYS_t4A/168s.jpg", "caption": "Side order of sweet potato fries and waffle cut original fries, plus cheese! Cheese and waffle fries is great!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HJ0Xnyx7QssrtJCPKyDVMg/168s.jpg", "caption": "The Special Recipe Wings. I dog not recommend at all )):"}]}}, {"review": {"des": "The Chicago Diner is the perfect meat free place for comfort food.  Great for breakfast, lunch or dinner. I love their burgers and they have a super delicious chocolate cake.<br><br>The restaurant is pretty normal looking, nothing special. The staff is friendly, they could be a bit more attentive. They get pretty packed on regular meal hours, it can be a little annoying, but there's a reason for that, where there is good food... people go.", "pics": null}}, {"review": {"des": "You might have thought you were getting a no-frills vegan diner that would show you the true wonders of the vegan diet, finally demystifying this lifestyle choice of millions of Americans once and for all. Instead, you will receive waffle fries for $10 that clearly came out of a Costco frozen pack, thrown hastily onto a plate with some disturbingly gray gravy squirted all over them. I know now what disappointment tastes like.", "pics": null}}, {"review": {"des": "Definitely a place that makes being a vegan easy!! If only everybody in this world knew how good vegan food is. I love this place and wish there were more vegan diners in this world.", "pics": null}}, {"review": {"des": "I'm not a vegan but this was the best casual vegan experience I've had. If you ever stop by here, make sure to get the reuben sandwich! And don't worry... It's 100% meatless and vegan. The \"meat\" was soft, tender, and juicy. I'm not sure how they did that, but they definitely nailed it. I also had the truffle mushroom lentil loaf, which is basically a vegan version of meatloaf. I'm a meat eater, but I'm not a huge fan of meatloaf because of the texture. But I really enjoyed their lentil loaf. They add a lot of white truffle mushroom sauce on top so it adds some moisture to the meat. Portion is also huge. An entree is enough to feed 2 people. Whenever you eat here, you'll forget that you're not eating meat.<br><br>Also for the seatings, I recommend this location than the Halsted location because it's not too busy in here. The one in Halsted is always packed and there isn't much space. This one is way bigger has seatings for bigger groups.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kburu3duxAEfqwlyhsnLKA/168s.jpg", "caption": "Truffle mushroom lentil loaf and reuben sandwich"}]}}, {"review": {"des": "I love this restaurant so so much! I've been to this location twice. Tonight, our server, Lauren took excellent care of us! She was so friendly, made excellent recommendations and did a great job. I work in the hospitality industry & she is a rockstar! I ordered the lentil & mushroom loaf & it did not disappoint. Their cake and milkshakes are phenomenal. This is the best vegan restaurant in Chicago (also I do prefer this location to the original one-more dining space and overall better service in my experience) anyway check it out!!", "pics": null}}, {"review": {"des": "So good.  I'm not even a vegetarian but I love this place.  Their taco salad gives me life.  And the shakes/desserts are shockingly good.  I would highly recommend this place, you'll be glad you gave it a try.", "pics": null}}, {"review": {"des": "I've been coming here for years now (first started going to the Lakeview one) and now I never need to go to Lakeview again (j/k).  This place is a staple for vegetarians and vegans in a city that seems to be obsessed with burgers.  Everything I have had here has been hearty, delicious, and satisfying.  My go to is the radical reuben and I never get sick of it.  Their seitan corn beef is made so well and they put so much of it in there with the vegan thousand island, grilled onions and peppers, and vegan or regular swiss cheese (I prefer the vegan for this one).  It comes with a generous portion for whatever side you choose.  I love their waffle fries as they are seasoned quite well.  <br><br>I also love their buffalo tofu wings, they are crispy and it's a huge portion with their delicious vegan ranch.  Their vegan cuban sandwich is really good with the banana peppers.  For desert, get the vegan cookie dough shake!  It is so decadent, but less guilt-provoking that a regular one.  I love how they put the chocolate drizzle all over the glass and it just tastes amazing.  They have a great selection of shakes.<br><br>Their brunch is also delicious and affordable.  I like getting their veggie Monte Cristo sandwich.  The french toast bread is not overly sweet but nice and crispy with their melted swiss and tofu scramble.  The breakfast potatoes are decent but I think they could be seasoned better.<br><br>Meat-eaters that I have come here with like this place too so you can take them here too.  The only negative I have to say is that I wish they were open later.  They close too early in an area filled with bars.", "pics": null}}, {"review": {"des": "We pretty much only go to the Milwaukee location out of convenience, but the atmosphere is so different. Thankfully the food is the same. The desserts/shakes are the standouts and we make sure to visit as many times as possible every time we're in town!", "pics": null}}, {"review": {"des": "First of all, the service is impeccable. I called on my lunch and asked the bartender to recommend a dish.. I already had my heart set on the country fried steak, when it came out of his mouth, I chuckled and went with that and the caramel apple pie. Best apple pie I've ever had! it reminded me of my deceased Grammy's dish, the caramel was rich and bold. The gravy was to die for.. the \"steak\" was a bit chewy but I never would imagine this vegan dish to be so tasty! Try this place out guys, you wont regret it (I'm not vegan btw)", "pics": null}}, {"review": {"des": "I don't take 5 star reviews lightly but this place deserves it!  There are not many vegetarian restaurants that impress my carnivore husband but this place was so good he's dying to go back.  We went for brunch on a Sunday.  We started with the vegan cinnamon roll-- so good you wouldn't know it's vegan.  Next, we shared the special recipe wings (bbq)-- ORDER THESE-- the texture of the seitan was absolutely perfect-- crispy outside and soft inside, and the sauce was to die for.  For the main course, i got the Cajun black bean burger, which was spicy (in a good way) and had a really great mustard sauce.  Got the waffle fries with Cajun seasoning for my side--would also highly recommend.  Husband got the titanic but burger and was enjoying it so much he didn't want to chat at all during the meal so he could savor every bite.  The only thing I wouldn't give a solid 5 stars to were the Brussels sprouts-- still very good, just not as unique and memorable as everything else we got.  Service was great as well.  We will be back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5VBns81rYEKQ7Zc43va8Vg/348s.jpg", "caption": "Vegan Cinnamon Roll... so delicious!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XPbWW2TDXaxr5pt2vvTkrw/168s.jpg", "caption": "The Special Recipe Wingz... get them now!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IivGUjhJAZYi-G1WscjO7Q/168s.jpg", "caption": "Spicy goodness of the Cajun Black Bean Burger (with the delicious Waffle Fries)"}]}}, {"review": {"des": "I was in Chicago for a weekend and I couldn't resist myself visiting this place twice.<br>I am a vegetarian and I have had the best vegetarian American food here. <br>I tried Buddha's karma burger and Thai stir fry. They are out of this world. Must try place. Staff is really friendly", "pics": null}}, {"review": {"des": "This place was really cool and vibrant. I loved the decor of the place and the vibe was very laid back. The waitress we had was also the hostess and she was awesome. <br><br>I went at lunch time with both my mom and my sister. I got the Orange Chicken, my sister got the basil stir fry, and my mom got the chili. All three were good but I wish I had gotten the basil stir fry as well. The orange chicken was good but sometimes wasn't super flavorful. My sister requested the basil stir fry spicy and it was superrrrr mild but still yummy. And the chili was also good.<br><br>I would love to come back here and maybe dabble in some of there other menu items, but overall it was a really nice experience.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bQGtUQIpwKHffLkM57QNUg/348s.jpg", "caption": "Orange Chicken"}]}}, {"review": {"des": "Been to a few vegan restaurants but I have to say this place is by far the best. I ordered a lot of food here and everything I ordered was amazing. The Rueben sandwich was a hit and gyros sandwich is worth tryin. Good food, good atmosphere, great service", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FdszpJ7b1kRCggBsiZAxnw/348s.jpg", "caption": "Heaven right now"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2P5ZnVvqFzrqPSOT4NNypg/168s.jpg", "caption": "Vegan Nachos"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/l4Ley5IWQbtDzv1jk3VV_Q/168s.jpg", "caption": "Omg I love this place, everything vegan"}]}}, {"review": {"des": "Amazing vegetarian and largely vegan diner which has been meat free since 83. There is a large menu with most of the typical diner fare. Everything is vegetarian and most things are vegan or can be made vegan. I got the Radical Reuben. I've never actually ate a Reuben before so I wanted to try something new. This was amazing. The corned beef seitan tasted exactly like what I imagine corned beef tastes like (TBH I never ate corned beef before so I can't compare to the real thing). If this wasn't a vegan restaurant I would've double checked with the waiter they brought the right food because it was so meat-like. I obviously got it with the vegan cheese which melted nicely. The sauerkraut and vegan thousand island were delicious and tied everything together nicely. I got is served with some delicious sweet potato fries. My dad who I was with, and is not vegetarian, got the gyro and he really enjoyed it too. We got the vegan apple pie to split for dessert and it was the perfect way to end. Will definitely be back next time I'm in Chicago. This is a great place to go before or after a Cubs game", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sChp46m5PZg4hn7AXoH6LA/348s.jpg", "caption": "apple pie"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DBcv6CjWjsQa7uXLEn5UtQ/168s.jpg", "caption": "Gyro"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ewLQgxuwdiUzQ89ORbFOBQ/168s.jpg", "caption": "Radical Reuben"}]}}, {"review": {"des": "A hesitant and part time vegan eater, I was brought here by my daughter in another one of her feeble attempts to show me hat healthy food can taste just as good as the stuff I'm used to. Upon arriving to Chicago Diner's Logan Square location, the outside is seemingly inconspicuous. With a vague name and normal front, you'd think it was a classic diner serving steaks and burgers. Walking in, the decor is refreshing, with dim-lighting and beautiful artwork from local schools. And then you see it: in bold neon letters- \"meat free since '83.\" You are not in Kansas anymore. <br><br>Chicago Diner is everything appealing about diner food, and everything appealing about healthy vegetarian and vegan food. Fake meat meets quality recipes and sandwiches that replicate the real thing: from a Reuben sandwich made with seitan and vegan cheese to a tempeh stir fry. Out of the many dishes I have tried since my first visit, I have not once been disappointed. The shakes are to die for- you cannot believe there is no dairy product in these creamy delicious treats. From your first bite into your meal of choice you will be hooked: this place has reasonably high prices but the product is well worth it. <br><br>All in all, the only thing to complain about is the staff- they are curt, quick, and sport a no-frills attitude. But despite this little downside, the food and drinks overpower anything wrong with this place. The food is incredible, the shakes and desserts are amazing, and the fake meat will not leave you missing the real stuff. <br><br>Pro tip: Scared to take the dive into the vegan waters? Ask for dairy cheese when applicable. In any dish where vegan eggs or cheese are used, the dairy substitute is available to ease your taste buds in slowly.", "pics": null}}, {"review": {"des": "I've recently adopted a vegetarian/pescetarian diet, and it was a real treat to visit the Chicago diner and be able to choose from a wide range of typical greasy spoon comfort foods, all meat-free.<br><br>We tried the country fried seitan \"steak\" with gravy and the Reuben sandwich.  The seitan was chewy (as seitan is!) and tasted appealingly fried, which is exactly what you're looking for with country fried steak.  It was served with delicious (although very peppery) mashed potatoes and sauteed (and not under-cooked or over-cooked, which is sometimes a rarity!) veggies.<br><br>The Reuben was also great.  Reubens are one of the few meat-y things I actually miss.  Did it taste identical to a real pastrami Reuben? No, of course it didn't (and don't let reviews to the contrary make you think otherwise, or you'll be disappointed.)  The vegan Reuben \"meat\" looks like the real deal, and tastes like basically nothing.  But was it an excellent sandwich, that had all of the important non-meat features of a Reuben (good marble rye bread, sauerkraut, cheese -- available in dairy or non-dairy versions), and therefore tasted all-things-considered very like a meaty Reuben sandwich? You bet!  The Reuben came with excellent and nicely seasoned waffle fries, and it's well worth the $1 upcharge for a little cup of cheese (I assume it's vegan cheese?) to dip them in.<br><br>You can find lots of non-super-processed-fake-meat food on the menu as well.  But I can make a good tofu quinoa veggie bowl at home; at a place like the Chicago diner, you come for the *unhealthy* vegan food.<br><br>The Chicago diner has a nice list of craft beers on tap, as well as cocktails.  Food prices are a tad higher than typical diner fare (entrees around $13 - $14), but that's to be expected given the city location and the niche market.  Portions are also huge.  I'm not one of those people who usually says \"Oh I had a big lunch, so I'm not eating dinner.\"  But after eating at the Chicago Diner, I didn't need dinner.  (I did eat a big donut at dinner-time instead.  But that's dessert!)  <br><br>Vegetarians/vegans, be sure to check this place out when you're in Chicago.  I  bet even your carnivore friends will enjoy it!", "pics": null}}, {"review": {"des": "Hands down my favorite restaurant, period.  I've been here countless times.  Amazing menu and great staff.  My only complain is that there's often a long wait.  I wish there was one of these places in my backyard.", "pics": null}}, {"review": {"des": "One of my chicago vegetarian favorites;<br><br>Got the cookie dough peanut butter milkshake (my favorite) it is to die for.<br><br>For dinner we got the mushroom meatloaf and the blt titantic burger with sweet potato fries. I liked the burger better than the meatloaf but they were both good. The burger was crunchy and the fake bacon was amazing. I would probably ask for more of the sauce on the burger next time.<br><br>Service was good as per usual.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6Dkm94DHyG6oso02dTjFWw/348s.jpg", "caption": "Biscuit & Sausage Gravy"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0k4pMHmJeI1OGixRKG0wzg/168s.jpg", "caption": "Special Recipe Wings with sauce on the side"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BkXdAz9dLKHbt9h9yvAimw/168s.jpg", "caption": "lettuce wraps with thai chili"}]}}, {"review": {"des": "Ive been following The Chicago Diner instagram for so so long and have wanted to try this place for years and it truly did NOT disappoint. We ordered the spinach and artichoke dip, the thai chili wings appetizer (which was my favorite thing i tried), a peanut butter cookie dough milkshake, and a caesar salad. Everything was so beyond delicious and really can't wait to go back to Chicago again just to come back here and try more dishes!", "pics": null}}, {"review": {"des": "This is the most intense vegetarian restaurant I have ever been to! I like their bacon (I have no idea how they make veggie bacon taste so real) cheeseburger. They also do vegan milkshakes which are shockingly good. Basically this is a good place to go if you're a vegetarian or vegan and are craving meat or cheese or just generally want to pig out. But if this is not the mood you're in, I would steer clear. No point in going to this place for anything even remotely healthy. Decent prices and service. Come here with your vegetarian buds!", "pics": null}}, {"review": {"des": "Fair warning, this place is packed. Like ALL THE TIME. Do expect to wait at least 15 minutes for a table. And service is slower than molasses.<br><br>I have been wanting to scope out the Chicago Diner for years, and just happened to be working up the street from this location a few Sundays ago, so I decided to have my mother meet me here for a late lunch/early dinner. I wasn't really sure what to expect, but I left feeling kind of disappointed.<br><br>We walked in to a VERY hipster bar feel, which was fine. Tight seating quarters, and the majority of the restaurant is family style seating, so expect to get comfy! All of the staff was relatively friendly, with the exception of one, and the vibe was very relaxed ... almost too relaxed.<br><br>We waited in line behind two women at the hostess counter as we overheard the male working at the counter tell the female hostess that she could seat the two women at a table set for 4 due to the wait. We thought \"great, we will be able to do the same, and we won't have to worry about waiting\". We were wrong. Just because those women were seated at a four top, didn't mean we had the same privilege. We gave them my name, and were told we'd have a 20 minute wait. Neither of us had eaten that day, and it was creeping on 4, so we asked if we could start at the bar and move to a table as it opened. The RUDE male host told us that they don't move customers from the bar to tables. We explained that my mother cannot sit at the bar the entire time, as she has bad hips due to a double knee replacement. He didn't care. At all. So, we decided to suck it up and sit at the bar, hoping for fast service and to get out of there as quickly as possible. WRONG AGAIN!<br><br>We sat at the bar and had the bartender look at us a few times as he scrambled to look busier than he was, but it took him at least 10 minutes to  actually acknowledged us (the actual bar is quite small). All he had to do was hand us menus, but instead, he focused on everyone else who still had food. By the time we received waters and menus, the nice female hostess came over and asked if we still wanted a table. So we grabbed our bags and ran from the bar area as quickly as possible, only to be seated at a table that would be more fitting for my two teacup dogs than for two grown women. And oh, we were also sat next to the ladies who had been in front of us prior, oh how I envied their spacious table. <br><br>It took ANOTHER unacceptable 20 minutes to finally meet our waiter as they were switching shifts, and he didn't really seem like he wanted to be there. Anyway, we ordered our drinks and food (I had the titanic burger with waffle fries and a mimosa, and my mother had some sort of a mule and the avocado tostadas), and at least that came out in a timely manner. However, we only saw our waiter once more when we flagged him down for the check - very poor service, even for a busy Sunday. Food was good, wasn't as great as I had hoped, and definitely didn't make up for all of the drama. Perhaps next time, I will be ordering to go ...", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Y5PZ-iyLMN5wmAgiuagxfA/348s.jpg", "caption": "The titanic burger with waffle fries and a mimosa"}]}}, {"review": {"des": "As always; my experience is 5stars. This time I decided to try something different... Cup of Quinoa Chili w/ jalapeño corn fritter.  It beautifully gorgeous. It had everything.. vegan sour cream, fresh sliced jalapeño, 3 beans etc. it was off the chain!! Makes a fat man happy. I'm not fat but I'm happy. <br><br>The Quinoa Chilli is great for lunch especially in the winter", "pics": null}}, {"review": {"des": "Good tasting vegan and vegetarian food. The service was great and plenty of drink options.  if you stop by try one of their shakes. They also have a good bar selection. Will definitely come again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/URpAMLr-XMhF41JW5x5ooA/348s.jpg", "caption": "had to get these too"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QCtEy9aV6yG5RpZ42DR0Fg/168s.jpg", "caption": "yummy"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/614EVrNEB5FCMiTlGQp9iA/168s.jpg", "caption": "deliscious"}]}}, {"review": {"des": "This is by far one of the best vegan restaurant I have been to in town from the appetizer to the entrées. Highly suggest it for all my vegan people.", "pics": null}}, {"review": {"des": "I'm not a vegan or vegetarian by any means but my god do I love their food! Country fried steak is amazing. Their Bloody Mary's are on point and the milk shakes are delicious.", "pics": null}}, {"review": {"des": "The best vegan/vegetarian food in Chicago.  Gyros and the Reuben are fantastic.  You won't notice the difference between the seitan and real meat.  Great flavors.  Salads perfect.  Hard to screw up a salad.  Always fresh.  Mac and Teese is an acquired taste, but after two or three tries I am addicted to it.  Mash Potatoes, Perfect.  BBQ Burger right on! Great. <br><br>Quick service.  Great overall.  Polite staff.    <br><br>Note:  Ask for extra napkins!!!!!   Gyros and Reuben can get messy.", "pics": null}}, {"review": {"des": "Yum! I am not a vegan or vegetarian but I love eating those kinds of foods, especially when it goes beyond just veggie burgers. The Chicago Diner has an extensive menu with plenty of fun, vegan/vegetarian dishes to choose from. I got the Mushroom Lentil \"Meatloaf\" with garlicky green beans and mashed potatoes instead of roasted potatoes. It was delicious, super flavorful, and a ton of food. My friends enjoyed their dishes as well and the service was great.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/p9ZTowES52mveYjVHNoPTQ/348s.jpg", "caption": "Mushroom Lentil Meatloaf with green beans and mashed potatoes."}]}}, {"review": {"des": "Holy cannoli! The shakes alone were bomb-diggity! Out of this world delicious! The waffle fries were so amazingly seasoned and had perfect crispy outside, fluffy inside texture! If I lived in Chicago I would get sooo fat eating here all the time. Solid service despite being quite busy. <br><br>Atmosphere: hipster.<br><br>Negatives: parking was pretty difficult to find.", "pics": null}}, {"review": {"des": "What a great experience here. An all vegan restaurant!  The Buffalo strips we're good! I'd recommend the milk shakes and the Ruben sandwich, which will leave you a full happy vegan that will later fall into a food coma.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zUFLggR8sMD0TRgLHiqgHw/168s.jpg", "caption": "Ruben Sandwich = full belly &"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6B8P14DiZoAXC3Zt_GddmQ/168s.jpg", "caption": "Strawberry Shake  -free"}]}}, {"review": {"des": "-Quick, cheerful, attentive service <br>-DELICIOUS food (you really can't go wrong, the only thing I didn't like was the vegan cheese but I personally don't like vegan cheese as a general rule so I shouldn't have ordered it), make sure you try the barbeque seitan wings and the cookie dough shake. The house-made ranch was so good we bought it in bulk to take home.<br><br>The best vegan meal I've ever had! This is a don't-miss for omnivores, vegetarians, and vegans alike!", "pics": null}}, {"review": {"des": "As a meat eater, I have to give props. The Dagwood sandwich was out of sight. For an extra special treat you got to get the vegan peanut butter chocolate chip shake. Meat-free since 83, it's a way I could never be, but if you find that you might be, looking for get here if he can't lie", "pics": null}}]}