{"name": "the-franklin-room-chicago", "reviews": [{"review": {"des": "Loved this place! A very extensive drink menu, and the food was excellent. Only issue is that it seems a bit small inside, but if you get a table it's definitely worth it.<br><br>They have great drink specials (check out their \"Whiskey Boys\") and if you like oysters they have specials on those as well. Their Old Fashioned is a bit pricey but one the best I've had!", "pics": null}}, {"review": {"des": "Stopped in for the 50% off Pappy Van Winkle promo. I knew the experience would be a good one when upon walking in and seeing all the rare/harder to find bottles stocked within their cabinets. Bourbon selection was top notch. Tried the Pappy 15 year, William Larue Weller,and Micter's 10. <br><br>Grace was my bartender and she was delightful to talk Whiskey to. She knows her shit. #respect. <br><br>Ordered a side of Rosemary nuts which were delightful. It's a large order of nuts you get. Definitely enough for 4 people. Get those damn things away from me. Didn't get a chance to try the other food but the menu looks enticing.<br><br>I would come back if another promo were going on or if I was in the area. <br><br>#RefereEats<br>\"I call it like I eat it.\"", "pics": null}}, {"review": {"des": "The food was good but NOT GREAT.  The aioli was amazing but not on the frozen French fries.  Also the steak was great but not worth $45. <br>My boyfriend came here to indulge in the special for the Pappy Van Winkle glasses.  <br>But we ended up spending over $200 and being quite disappointed. <br>I did enjoy the atmosphere and the service was decent.", "pics": null}}, {"review": {"des": "Nice place tucked under the L has a great vibe and cozy atmosphere. Drinks were interesting and the beer list extensive.<br>This was my second time the first time the place was super packed the second was a only a few customers I liked it with less people.<br>The food was good and the service was excellent <br>April my waitress was very attentive and made the experience one I'll be back for", "pics": null}}, {"review": {"des": "Came in on a Saturday night to grab a drink and had a great experience at The Franklin Room. This place is great if you're avoiding the crowds and loud music at nearby clubs and looking for a more laid back bar to catch up with friends and enjoy a nice craft cocktail. The Franklin Room is an easy crowd pleaser with sports playing in the background, live music, a wide variety of cocktails, and their full menu.<br><br>I would never expect to see a Mezcal based drink in the Midwest and was very excited to get the Wrongfully Accused ($14). It was a well crafted drink. Smokey from the mezcal with bright flavors from the Grapefruit Shrub and lime. It was a delicious and enjoyable drink.", "pics": null}}, {"review": {"des": "Honest review: (review of burger n service only) <br>Ambiance: its cool really tiny though. It looks like a prohibition  type of vibe. Service this is where the place needs improving. The hostess didnt want to sit me down when there were alot of seats open n im like ok whatever ill sit at the bar. Then got at the bar like this was the worst bar service i ever had like its up there with three dots and a dash bad their unnattentive just really bad. He messed up my order then messed up the persons next to me order theyre were 3 bartenders so theres no reason for service to be so slow or bad <br><br>Surf and turf $20: wasnt good. If ur gonna do a fancy burger dont use amarican cheese. Wish it had blue cheese. The actual burger was tender but was bland needed seasoning. The actual softshell crab was very bland it didnt have seasoning on it. The black truffle aioli was gross it didnt taste like truffles and wasnt decadent tasted like it was mayonnaise and balsamic. The bun wasn't toasted so the burger was falling apart. Arugula should be used instead of lettuce. Loved the egg though. Wouldn't order a burger here. Fries lacked seasoning but like how their was cheese on them.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/403VBQCkqD8Fjy5jhCSDMQ/348s.jpg", "caption": "Surf & Turf Burger $21"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2w2dkb6SHRElaXhgMYnImA/168s.jpg", "caption": "Surf & Turf Burger $21"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9B_qPpuFDpDkWSGit5apXA/168s.jpg", "caption": "Surf & Turf Burger $21"}]}}, {"review": {"des": "Had lunch here and I loved so many things:<br><br>-Nice vibe and decor<br>-Friendly bartender<br>-Happy hour drink prices!<br>-Delicious regular priced drinks<br>-Amazing fried cheese curds<br>-Steak<br><br>This is winning, baby!  If you go here, you'll feel like a winner.  If I had free time, I'd go here for lunch and stay until happy hour ended.  Love it!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9SHFxTjkmKbJMp_J1JtALg/348s.jpg", "caption": "$3 Manhattan"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CBY98cZ_fPyVhGtspAIQGw/168s.jpg", "caption": "1/2 steak frites"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OktIaRYhrDu05becQbo1vg/168s.jpg", "caption": "Amazing bourbon battered cheese curds!"}]}}, {"review": {"des": "What's better than a dozen fresh oysters? Three dozen! Oh, yes we did! The perky pickled cucumber balls, spicy chili sauce and crisp yuzu ice put these gorgeous oysters over the top - briny, sweet, salty, chilled and tongue numbing. The medium-sized bivalves hit all the right buttons, platter after platter. Sadly, the seasonal price spike had just kicked in, elevating them to $1.50 each - but they are worth every penny! Go ahead and order two dozen. You can thank me later! <br><br>During our three rounds of oysters, I sipped on a perfect Old Fashioned - probably the smoothest I've ever enjoyed. Fortunately, before I ordered a second $20 cocktail, our dinner guest, and amazing waitress Apryl, suggested the house blended \"Whiskey Boy\" - these little medicine bottle-sized cocktails have a flavor that suggest an Old Fashioned just hooked up with a Manhattan - boozy, breathtaking, with a hint of spice and perfect sweetness. These pint-sized $12 bottle rockets are served ice cold and as frequently as you can nod at the attentive waitstaff. Brace yourself!<br><br>Following the oysters, our four-top launched into a near-perfect meal; the Slow Roasted Short Ribs ($26) were ridiculously tender, served with tiny, tart apple dices, a miniscule dollop of celery root and carrot puree (more, please!!!) all buried under a completely unnecessary handful of watercress greens. The deep, dark beef reduction, lovingly ladled upon the melty meat during its five-hour braise, was worthy of bottling. Hands down, the best short ribs I've ever sampled!<br><br>Not to be outdone, the Surf & Turf Wagyu Burger featured a perfectly medium rare patty of flavorful beef, topped with a deftly fried whole soft-shell crab that reminded me of fall fish frys back in North Carolina. To add to the indulgence, the aromatic black truffle aioli saturated the super soft pretzel bun, allowing the perfectly-frizzled sunny side up egg to top the madness. Truly the richest, juiciest, most luxurious $21 burger you wife will ever devour - all by herself.<br><br>The Colorado Lamb Shank, $28, was simply massive and had a pleasantly mild, gamey flavor, but lacked the richness of the short ribs. The fingerling potatoes were nicely roasted, along with knobs of carrots and charred pearl onions. <br><br>An individual tin of Chocolate Pecan Pie (properly pronounced \"PEE'can\" by our lovely waitress) and a trough-like serving of gooey Deep Dish Chocolate Chip Cookie ($7), both topped with vanilla ice cream, made for a perfectly shared ending with our dinner guests. <br><br>Go often. Go early. Ask to sit in Apryl's section. Order mightily.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-cb0Uf2upqdvAux4Un0wmg/348s.jpg", "caption": "Colorado Lamb Shank, $28, was simply massive and had a pleasantly mild, gamey flavor"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WJLF_s0EEV_u25HiQHTeGA/168s.jpg", "caption": "Surf & Turf Wagyu Burger- the richest, juiciest, most luxurious $21 burger your wife will ever devour - all by herself."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/r5ipzrr4h_SaYsTrRb6zxQ/168s.jpg", "caption": "Chocolate Pecan Pie, properly pronounced \"PEE'can\""}]}}, {"review": {"des": "This speakeasy styled bar in bar is hopping. Granted, it is not that large, but I came here with my significant other around 9 PM or so on a Friday evening, and there was still a wait to get in. We did manage to get a standing room spot to start out with as we dived through the menu looking at all of the cocktail options and of course the extensive list of whiskey. <br><br>By the time we finished looking over the spectacular drink list, a table opened up for us which worked out well. I ordered their version of the Vieux Carre, which is basically the kitchen sink of drinks. Pretty much throw any kind of alcohol into it and it sticks. The drink was potent and was the only beverage I needed that evening. They definitely don't skimp out here.<br><br>We were ordered some cheese curds to split and enjoy. They were very crispy on the outside and gooey and cheesy on the inside. They were a little too salty for my liking, but otherwise, it paired with the drink very well. Their food menu looked really good and I wish I was hungrier as I would have ordered more food. Oh well. It was great.<br><br>Overall, I'd definitely come back to the Franklin Room again. It has a great vibe, great variety of drinks, and good eats. Service was good too.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/M4uROBsnQDXbHXD7DJuJ3A/348s.jpg", "caption": "One of the many Whiskey cabinets."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oV2iD5dBf9_9kFrgQQsyqw/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xlka8EfYy7-EtO7Hk4x-uw/168s.jpg", "caption": "Cheese Curds"}]}}, {"review": {"des": "I was excited to try this speakeasy since they are affiliated with Union Sushi around the corner. Their food and service did not disappoint. They were able to accommodate our party of ten comfortably on a Friday night and sat us down even though two of us were running late.<br><br>If you like whiskey then this is definitely a place for you. The house old fashioned was so smooth and tasty. Even my wife who doesn't like whiskey enjoyed it.<br><br>I wanted to try all the food on their menu, but I ended up with this mushroom pasta. It was so simple, yet so delicious. It's all about the hand made noodles. I can't wait to come back to try everything else on the menu!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mQUYiW32loXbS_-9cSrqsw/168s.jpg", "caption": "The Franklin Room Old Fashioned // Angels Envy Rye, Demerara, Angostura, Orange Bitters, Cherry Bark Vanilla Bitters"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/A0P-0noy_tmzMVlFQ9a3aA/168s.jpg", "caption": "Truffle Mushroom Pasta // handmade pappardelle, black truffle, parmesan"}]}}, {"review": {"des": "I've come here for happy hour about once a month. Easily one of my favorite spots in chicago.<br><br>Service is always top notch. I came straight from the airport and they checked my luggage for me at the door no problem. I also enjoy how at the bar you have hooks for your bags so you don't have to sling it over your seat or put in on the ground l. <br><br>They stopped adding the fire cube to the Lost N Paradise cocktail. There have been liability issues with certain patrons. I really wanted my friend to get that full experience so the bartender was a true bro and torched a cinnamon stick for the cocktail to add in that essential aromatic touch. <br><br>The happy hour deal is very good. The oysters are just a buck and have not made me hug a toilet yet. They have some rather unique accompaniments with the oyster. The lightly pickled green onion on the oysters makes the flavor of each one pop. Also I really like the seasoning that comes in snow/ice form. <br><br>Whiskey boys are a must. You can tell it's good stuff since they don't spell it \"boi\". They are an extremely good value at 5 bucks. <br><br>Most recently got the burrata too. Almost all the food I've had here is delicious and portion sizes are not tiny.", "pics": null}}, {"review": {"des": "Chicago in the summer is glorious!!!!! But it's short: so like Ferris once said, \"Life moves pretty fast. If you don't stop and look around once in a while, you could miss it.\"  So in that vein.... don't miss this basement like speak-easy that touts a formidable whiskey menu, with bar-bistro offerings (I will not use that shitty \"gastro-pub\" moniker) that hold up to the better restaurants around town!! Behold:<br>On the whiskey menu was my beloved Noah's Mill which comes as an ounce pour or as shown: a 1/4 bottle which I shared (kind of) with my colleague.  Drinking bourbon in this establishment seemed fitting as the ambience gives off an old fashioned whiskey hall feel with exposed ceilings and a loud acoustic design.  While that may take away from a romantic feel, it's certainly kitschy and entirely unpretentious.<br><br>Apps consisted of the mussels which were steeped in a bourbon based sauce with roasted grape tomatoes, greens and dusted with cheese.  Also contained in this savory sauce was a generous portion of roasted garlic which served almost as the dessert for this dish when spread on the accompanying toast points.  The burrata was another standout as it was served with yellow tomato slices, dressed arugula and toast points.  The truffle seasoning paired so well with the creamy filling of the cheese and the acidity ofbthe tomato and greens.  Other apps were just as strong and they included the fried cauliflower, cheese curds and popovers (which I did not try as per my no bread jihad)<br><br>My main was simply....... decadent:  a wagyu beef Patti topped with cheese, soft shell crab and a truffle aioli.  My goodness.  Sounded like madness in a surf and turf kinda way but oh was it a flavor blast of savory goodness!  This one might be etched on my palate for some time to come!  Other mains were enjoyed by my crowd like the Scottish salmon and squid ink pasta etc.  and though I'm not a dessert fan, their key lime pie, bourbon milk shake and pecan pie were all scratch made and a welcome pairing with the round of Hungarian dessert wine that we splurged on!<br><br>Great job, great surroundings, great food, great service!<br><br>All in all..... well done Franklin and thank you!!!!<br><br>Robbo, Parker, CO", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uz32LlBYVSaKnFjZkE9soA/348s.jpg", "caption": "Oh the wagyu cheeseburger (no bread)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hCdxiGIPFHk-4HU4Uf3ssg/168s.jpg", "caption": "Scottish salmon"}]}}, {"review": {"des": "Loved it! I was a bit skeptical when we first got here as the noise level was super high and the place seemed to be crowded. As the night progressed the people were leaving and The Franklin Room finally transformed into a cozy restaurant rather than a bar with bunch of bros. I ordered FR cheeseburger, my husband got steak frites and I still can't decide which dish I liked the most because both of them were mouthwatering and extremely well balanced. My husband even commented that Au Cheval has a major competitor now because of how delicious that burger was. I think The Franklin room will be one of my favorite places to go to from now on when I am craving a burger and don't want to be on a 4 hour wait list! Well done guys!", "pics": null}}, {"review": {"des": "This place has a great cocktail menu and the service is great.<br>Make sure to make a reservation as it isn't the biggest place on the block....but they have good food and it worth the wait.", "pics": null}}, {"review": {"des": "This is an awesome, almost secretive place to bring people. <br><br>The ambience was just perfect. It has almost a prohibition-era, classy feel to it. The inside is small, so I highly recommend making reservations. We went on a Tuesday night, thinking it would be dead, but every single table was packed.<br><br>The drinks are incredibly fun. Their happy hour features $1 oysters and a $5 cocktail of their choosing. The table ended up getting a dozen oysters and the bourbon battered cheese curds as starters. All of it was gone within seconds of hitting the table! I ended up ordering the steak frites. It came with a roasted head of garlic, drool, and fries on the side. Also in their containers were the truffle sauce and béarnaise sauce. Was it the best steak frites? No. But it got the job done.<br><br>Overall, great environment, helpful servers, classy drinks and good food.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/i7EpkZUdtZsFGmu02UIrmQ/348s.jpg", "caption": "Butcher's steak frites."}]}}, {"review": {"des": "It was such an AMAZING experience! Really cozy and comfortable restaurant, supper attentive and knowledgeable server, who gives wonderful advices on the menu. <br>The food was just fantastic! We had a raw wagyu beef starter, that was one of a kinda, never tried anything like that! The idea of eating raw meat was super weird to me, but I am so glad I tried, it was very very delicious. <br>Then I had a lamb knee and it was also really freaking good! The meat was falling off the bone and so yummy!!! <br>My husband had a steak and he said it was the best one he's ever had, and we're regulars at Brazilian steakhouses! <br>For dessert we had a deep dish cookie and OH MY! It was just a \"must try\"!!! <br>The drinks were also very good, especially if you're into whiskey! I, personally, am not, so I had some sweet cucumber drink and it was good, while my husband was trying their sour drinks and they were very well done as well! <br>The point is! This place is a must go! We've lived in the neighborhood for a year and I don't even know why we had no idea of this place!!! So far it is literally brought to our fave places around!!! Make a reservation, you will thank me later", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0fG1_VgftL7BnuQ2qx1Crw/168s.jpg", "caption": "Steak"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5tDPcOCYoUh93-drDuykcg/168s.jpg", "caption": "Wagyu raw appetizer"}]}}, {"review": {"des": "Classy, retro ambiance. Loud volume. Good, but expensive drinks and food. Okay service.<br><br>The Franklin Room calls itself a speakeasy. It does have an old-school 1920s clubby look to the place, but with a noticeable storefront, it isn't exactly a \"hidden\" speakeasy.<br><br>We went later on a Friday night with 8:45 reservations and the place was crowded and loud. We arrived 15 minutes early for the reservations and waited at the bar, which was so crowded, it was difficult to find room to stand. <br><br>The Old Fashioneds were very good, but at $20, they better damn well be. I'm sure I've paid that much for a drink in Manhattan, but I don't think I've paid anywhere close to that in Chicago.  <br><br>The food was good. My Steak Frites was very good--tasty and tender. My wife was somewhat less thrilled with her slow roasted beef short rib. It was good, but not great. The dish was supposed to come with potato puree, but either they forgot about it or the amount was so modest it was difficult to find. Most of the dinners are between $26 and $33, although you can select from a selection of upscale burgers in the $17 to $21 range. <br><br>Service at the bar was great, especially considering how crowded it was. But service at the table was fairly slow and inattentive. We wanted to order a dessert, but after waiting ten minutes to order, we decided our patience with the service (and the din in the room) had worn a little thin, so we skipped the Apple Crisp. <br><br>If you like your 1920s-style bar with loud, pop music, pricey and tasty drinks and food, and packed with a noisy crowd, then Franklin Room will be your kind of place.", "pics": null}}, {"review": {"des": "The Franklin Room is your posh uncle's favorite place to get abundantly sloshed, in between stops at Cartier and your older sister's baby shower he showed up late to. It's got a muted yet lit feel -- a little showy and self aware like an Instagram eyebrow, and much like an Instagram eyebrow, it doesn't come cheap. <br><br>So, to start the tale of the night, I got a whiskey connoisseur ticket for me and fellow drinker/eater. We divided each drink up with each course. The drinks were: <br><br>Glenrothes Bourbon Barrel Reserve, Single Malt Scotch: I'm no rah rah whiskey fan, but this one had notes of coconut and vanilla that escaped like grace notes on a piano score. Now I'm getting poetic and that's probably because I'm thinking about this drink. <br>Balblair '99 Single Malt Scotch: So I don't know if I've ever mentioned that I'm no rah rah whiskey fan....but boy....this one stung me like a Hungarian Horntail, and Harry Potter wouldn't stand a chance with this drink either (I don't suppose). It sunk its barbs into my tongue, and I felt like it had a weird, gross taste. <br>Ballechin 11Yr Manzanilla, Single Cask Scotch: I like my eyes smoky....and my whiskies smoky. I learned that when I drank the Manzanilla. More like God-damn-zilla.  <br><br>Lamb shank: Could have notched it up with flavor but I pressed the ignore button as soon as I felt how tender it was. It practically oozed its way past my fork and into my belly faster than you can say \"lambo-ghini\". <br><br>Cauliflower tots: Avril Lavigne would probably say \"what the hell...all this place has been is good but now whoa what the hell\" because this one was a little disappointing. The bleu cheese tasted more like ranch than anything else -- I don't know why. The table next to me got the bourbon battered cheese curds and I felt #ragrets looking at it. <br><br>Short rib: This was truly the star of the show. Spices were on point, as well as the veggies and the potato mash at the bottom. Bobby Flay would have chanted along to the rhythm of mouths chewing (no talking, only sounds of eating) in an exquisite, harmonious symphony. Could John Cage pick this one up? <br><br>I docked one star because the lamb shank and tots could have been better -- and the $ spent was comparable to that of a Michelin restaurant. I guess I could have ordered less food...but really, who would do that.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZP3vEruYPkhW88vsRMFIsA/168s.jpg", "caption": "Heyyyyaaaaa"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XucEbBDC1swccDb7AJ2COw/168s.jpg", "caption": "Unique whiskey experience and gr8 food"}]}}, {"review": {"des": "What can I say that people don't already know about this place.<br><br>My wife and myself were celebrating multiple things.  Had made a reservation about a week in advance.  Loved the service.<br><br>When we arrived at our table, there was a \"happy birthday\" card from the restaurant for my wife.  <br><br>Our server and the hostess both congratulated us for our celebrations.<br><br>Pretty good selection of whiskies I will say.<br><br>Loved the cauliflower taters.  Beautifully done batter, light yet crispy.  A lot like cauliflower pakodas.<br><br>We had some salads which were well salads.<br><br>My burger was good.  I wish they offered steak cut fries.<br><br>My wife's mushroom pasta was EXCELLENT.<br><br>Sure to come back again with friends.", "pics": null}}, {"review": {"des": "Come for the cocktails, stay for the food!<br><br>This is a great spot whether you're looking for a good time on a date or if you're hanging out with a big group! We live nearby and they have always been very honest when we've called about wait time and very accommodating of our giant group of Warriors fans who flew in for our wedding and took over their bar area for a night. <br><br>As for cocktails, some of our favorites are the Long Train to Fresno (if you like a tequila cocktail with a kick!), The Aviation (gin with creme de violette), and the Royal Mai Tai, but we love experimenting and trying new cocktails!<br><br>As for food, get the cheese curds!! They always come out right away and lightly fried and always steaming hot. They serve them with a chipotle aioli which adds the perfect kick to the curds. <br><br>As for entrees, both the Surf & Turf and spicy bourbon burger are great and made with wagyu beef patties on pretzel buns. My personal go-to is the Truffle mushroom pappardelle, which is loaded with creamy truffle sauce and loads of different kinds of mushrooms-- right up my alley! <br><br>Shout out to the great wait staff for always keeping our drinks flowing and bringing us our food piping hot!", "pics": null}}, {"review": {"des": "Between the rude server and the TV screen ads, our party's experience was sub par.  It took 22 minutes to get our first round of drinks on a Saturday night when the restaurant wasn't at capacity. <br><br>I'd try the Franklin Room again, but my first visit was a let down.  I wish management would get rid of the people with bad attitudes,and turn off the TV's.", "pics": null}}, {"review": {"des": "Couldn't have asked for a better meal and drinks!  I started dinner with the winter daiquiri and it was so perfect.  It had a nice little spice to it that reminded me of fall.  For dinner I had the fried cheese curds and the steak frites.  The cheese curds were so delicious, just little mounds of beautiful fried cheese.  The steak frites was delicious as well!  The steak was perfectly seasoned and cooked.  It came with a whipped bearnaise sauce and a bulb of roasted garlic...Yummm.  Service was great as well!  The atmosphere was intimate and really lovely.  There was soft jazz playing in the background which I enjoyed.", "pics": null}}, {"review": {"des": "Book of Booze + 1 page of Static Food Menu. Mishmash of expensive ingredients = Nothingness.  What a waste!  A BUT establishment. :-D<br><br>PRICING -- easy $60 pp plus tip for 3-Course meal + 1 Cocktail, No Brown Bag.<br><br>COCKTAILS are well-balanced, nicely priced, 2 oz of primary booze, BUT it's the standard these days.<br><br>Literal interpretation of FOIE GRAS MOUSSE is $1.70 per teensy weensy black baguette slice.  Eat immediately before it deflates.  Excellent dish for foie beginners that packs flavor without being overwhelmed.<br><br>CHICKEN DRUMETTES are really good for $2.30 a piece.  BUT, for $1-$1.50 a piece, you can go around the corner as Hooters Chicken grew.<br><br>WAGYU BURGERS are excellent value as they are competitively priced, but better quality ingredients.  BUT, Wagyu is exquisite by itself that is best enjoyed in simplicity.<br><br>Strong and too much truffle aioli (I can't believe I'm complaining about it, as I should be happy BUT...) in SURF & TURF it's an unnecessary ingredient.  SOFT SHELL CRAB shrank in half compared to its initial promo photos!<br><br>NEW ZEALAND LAMB SHANK only serves 1, no brown bag.  BLAND, but pouring salt is appropriate for the Sinatra vibe as it was common at that time.  BUT, well-seasoned cooking and salting after is NOT the same.<br><br>Disgusting bananas in BANANA SPLIT.  Outsourced cheap tasting ice cream is beautifully plated with interesting combinations.  You pay for presentation.<br><br>$7 BOURBON SHAKE was really good, BUT you can make this at home.  Or, get a $3 Potbelly Shake and pour your own bourbon...it's only $5.<br><br>VENUE is relaxingly nice & romantic.  A contrast to the stressful menu.  At least the booze calms you down and balances everything out.  Your Company and Staff May upset your equilibrium.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PqEhIC1QEQm1VNuA19j4Ow/348s.jpg", "caption": "Dessert Menu (12.2017)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hg_a-mB-K46pi-r_5VNobw/168s.jpg", "caption": "Re-usable Blue Bag instead of Recyclable + Reusable Brown Bag"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uQc3hNa1TyKrXyLwZHyG2A/168s.jpg", "caption": "Overpriced tasty DRUMETTES"}]}}, {"review": {"des": "It was a great experience eating at the Franklin Room while visiting our daughter in Chicago.  We had a great server. ( shout out to Allassan)  We started out our meal with a beef tartare and drinks.   Then two of us ordered the surf and turf burger with the truffle fries.   Amazing burger!!!   Melted in your mouth with waygu meat.  Unbelievable flavor on a pretzel roll.  The other two ordered the squid ink pasta with seafood.  Another hit.  We ended up sharing everything!!!   Highly recommend this place for the speak easy atmosphere and bar, service, and food!", "pics": null}}, {"review": {"des": "Two words: dollar oysters. That is what got me to the Franklin Room the first time and what keeps me coming back for more. I am an oyster fiend and the happy hour deal of one dollar oysters is fantastic. The oysters are fresh and dressed well. You can easily devour 2 dozen quickly. I am sad to say that the cheese board and charcuterie board are no longer on the menu (I'm a bit late to this change, happened about 6 months ago). I distinctly recall that I tried nduja for the first time here. But despite the heartbreaking news of the change in menu, we were able to rally and tried some other items off the menu: cheese curds, fries with black truffle solo, house salad, and NZ lamb shank. The lamb shank was particularly good - tender and it fell off the bone.<br><br>Service here is great, attentive and friendly. The vibe is also cool, with a speak-easy-esq look to the restaurant. Overall, I enjoy the Franklin Room and will keep coming back, especially for the oyster happy hour.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/o_KdWGxWCNEiBeVUVn1WqA/348s.jpg", "caption": "Happy hour dozen Oysters"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1vdcb_Q4UU5tWYYZrMMNEQ/168s.jpg", "caption": "New Zealand Lamb Shank - super tender!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JZ4ocbDJNIw_x9zhkIaGQw/168s.jpg", "caption": "House Salad"}]}}, {"review": {"des": "Had a planned night out in River North and made reservations via OpenTable a couple nights before. Got there a couple minutes early and we were seated shortly after.<br><br>The inside of the place is pretty cool, it's kind of like a basement, but it doesn't feel dingy or anything, it's nicely decorated and feels a little like a speakeasy kind of thing. It's also not very big, but I liked that because it wasn't super super loud in there and I could hear myself talk, although some of the seating is close quarters.<br><br>I would describe the Franklin Room as a whiskey/cocktail bar. They have a HUGE drink menu that features a ton of obscure/small batch/expensive whiskeys that a connoisseur would surely appreciate. They also have food, mostly sandwiches at around  $15 but also some entree items at $25-30. <br><br>We opted for 2 cocktails, the Vieux Carre and the Blood & Sand. Both expertly mixed and tasted fantastic. The Vieux Carre was potent and I liked it a lot.<br><br>We kept it simple and got 2 sandwiches and a dessert for dinner. We had the FR burger and the Cod sandwich. They were both very good! Pricey at about $15 each, this was definitely a very very good burger that was simple in a good way. Super rich, cheesy and cooked to perfect medium, it also came with fries which were delicious as well. I paid the  $3 up charge for truffle fries, which I could taste a difference between the regular fries, but I'm not sure was worth $3. The food was all very good here!<br><br>The pumpkin frozen yogurt was delicious too. Large shareable portion  for $7, nice way to end the meal.<br><br>Our server Dan was quiet but nice. Our dinner was super straightforward and he did a good job.<br><br>Overall a really cool spot for cocktails and whiskey, the sandwiches were also very good. It is pretty pricey, but there are many much more expensive options nearby that make the Franklin Room a good choice. Also worth noting they have a ton of happy hour specials that make it a pretty good bargain if you make it in during those times.<br><br>Cool spot!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/g6wzsFDAGggLjn9cx-pMTQ/168s.jpg", "caption": "FR burger, cod sandwich"}]}}, {"review": {"des": "Cool speak easy for a Saturday night hangout spot. There was kind music playing as well.  Drinks were stiff and well balanced.  Decor is really nice as well.  Their selection was quite intensive, so you can find a lot of stuff here.  I saw papy there but didn't feel like splurging.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kjmjSl7S5Ip8RjlEsX7RTg/168s.jpg", "caption": "Whiskey boy"}]}}, {"review": {"des": "Amazing whiskey and bourbon selection. Helpful and informative bartenders. Try the flights! <br><br>I tried the small batch flight and bartender/mixologist Peter took the time to explain the story behind each of the bourbons poured, which was super cool.<br><br>While mixing their signature drink, an old-fashioned, he explained to some other guests what he was mixing in and even had them smell a bit of the cherry vanilla bark.<br><br>Very cool & hip place and interior. Highly recommended!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MLEbYokx7_QyWpgQstNMPA/168s.jpg", "caption": "Just a trick, a taste of the bottle on the left is actually $100/oz!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/R-4fEiFCKRKuZUE5JKL0dA/168s.jpg", "caption": "Small batch bourbon tasting"}]}}, {"review": {"des": "A cool, classy place with great drinks, food and ambiance. Was meeting a coworker here on his rec (good call, Alex!) and arrived a tad early so I plopped down at the bar and ordered a Whiskey Boy cocktail, which was only $5 during happy hour. <br><br>After migrating to a booth to catch up with work bud, we ordered some $1 oysters and cauliflower tots. Slurpy good on the oysters. Tots did not disappoint either. Even tasted a tad healthy. For my main I ordered the duck sausage and, oh man, it was seriously savory and delicious. The secret might be the foie gras mousse.<br><br>The Franklin Room is great. Go here for great cocktails, an extensive whiskey collection, top-notch gastro eats and one helluva killer happy hour.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/v32nnr7sR3R7j07P0YsNhA/168s.jpg", "caption": "Whiskey boy - $5 during happy hour!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oYKBOtF_BomVKPxJG2guHg/168s.jpg", "caption": "$1 oysters for happy hour!"}]}}, {"review": {"des": "They have $1 oysters from 5 to 6:30, the oysters are so so, not the freshest (but it's $1, so can't complain). They also have house made whiskey for $5 during the same period for happy hour, I don't drink, but my friends loved it.<br><br>The food is pretty good too for bar food. The spicy shrimp appetizer is great, liked the spicy kick. The heirloom carrot is good too, with bourbon sauce.<br><br>The squid ink pasta is good. The lamb shank is so so, a bit too bland.", "pics": null}}, {"review": {"des": "Love!!!!!!! Their happy hour was great. The $5 whiskey boys and sparkling wine were yummy and a good amount of strong. I'm craving their oysters just thinking about them. Their unique accoutrements took them to the next level! <br><br>We also tried the truffle fries (YUM) and the crispy rock shrimp (also tasty!). The atmosphere is classy but not stuffy or uptight. Would absolutely return on our next trip to Chicago.", "pics": null}}, {"review": {"des": "I'm almost afraid to write this review because I don't want this restaurant to get any busier, but:<br><br>Their ribeye is hands down the best steak I've ever eaten. The first time I had it, I thought it was a fluke, so I tried it again... this time delivered on postmates and it was still the best steak I've ever eaten. I'd choose it over RPM, Mastros, Chicago Cut any day and they are known for their steaks. I was simply mind blown.<br><br>My SO had the burger which he found incredible, as well. We also split the shrimp appetizer and cheese curds which were both exceptional. Luckily, I preferred the cheese curds while he preferred the shrimp. <br><br>Nice wine list, good appetizers, but the steak truly deserves all the praise. Hats off to the chef!<br><br>I'd comment on the service, but I don't remember anything exceptional or anything that irked me so that's good overall. <br><br>Ambiance is very cute.", "pics": null}}, {"review": {"des": "Really sexy/intimate ambience located downstairs. It was not overly crowded for a Saturday night, so we were easily seated. Though we mainly cane from drinks, I tried the Crispy Rick Shrimp and I'm a fan. Can't remember which drink I tried, but we all had something different and enjoyed. <br>It's also in a great location if you're looking to go dancing afterwards.", "pics": null}}, {"review": {"des": "Like I had mentioned before, I knew I had to come back and try either a cocktail/whiskey here or some food. And we ended up trying both! Anyways, fiancee ended getting off work at a decent hour last Friday and it had been quite the busy week at work so we decided to go out and try to catch the last 30 minutes of happy hour at The Franklin Room and ended up having dinner as well.<br><br>First thing is first, Franklin Room happy hour is a bit complex but as I recall the specials were...<br>-$1 oysters 5pm to 6:30pm everyday<br>-$5 whiskey boys or sparkling wine 5pm to 6:30pm Tuesdays - Saturdays<br>-Sundays 25% off your bill 5pm to close<br>-Monday half price bottles of wine 5pm to close<br><br>Being Friday with half hour to go during happy hour, I ended up trying their whiskey boy cocktail which is their premade concoction with bourbon, sherry, demerera, & bitters and served in a take home souvenir glass flask. Essentially their spin on an old fashioned, and it was delicious and awesome for $5. And ended up being able to put in one more order just before happy hour finished. Whoop whoop, TURN UP.   <br><br>For food, we shared short rib poutine ~ braised short rib, beef jus, fries, feta, pickled red onion, and top with some spice for a little kick. The short rib was super tender and had a sort of korean style sort of marinade to it as I recalled and the pickled red onion gave it some freshness. All in all, excellent for sharing. We also shared an order of their Surf & Turf burger ~ wagyu beef patty cooked to perfection, soft shell crab, whiskey balsamic, cheddar, provolone, sunnyside egg, on a pretzel bun. This burger was bangin' and our server Dan even had the chef split it in half on two separate plates with our subbed side salad without us even having to ask. So thoughtful!<br><br>Anyways, when ambiance, service, and food all hit the mark for ya, you end up leaving with a great experience overall. Franklin Room is a great spot for happy hour and even date nights I would say. I'm sure we'll be back again soon!<br><br>All in all, 5.2 stars / 5 stars. Bonus .2 stars since me and Franklin Room got the same initials. =P<br><br>'Til next time, cheers!<br><br>195/365", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lyPWxvGgfPXHc2UtrPwfeg/348s.jpg", "caption": "Splitsies on the Surf n Turf burger... excellent for photos"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nLEfqxLWjPv-vP7VcJszUw/168s.jpg", "caption": "Short rib poutine! Do you even diet bruh?"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cQddMq9h4tK-LQk4TScA_w/168s.jpg", "caption": "Whiskey Boy with take home flask... $5 during happy hour! Whoop whoop!"}]}}, {"review": {"des": "I had a meeting with my team this week at The Franklin Room and liked it. I sat at the bar first planning to grab a drink pre-meeting as I was a bit early. I was given water by the busser but sat for a few minutes without ordering and wondering if I should flag someone down. Before I could do that though, one of my coworkers showed up and we grabbed a booth instead.<br><br>The server at our booth was awesome! She was so nice, made recommendations, checked in on us the perfect amount and was very accommodating. Boss man wanted to come here for the $1 oysters and the others feasted on those. This shellfish-allergic chick ended up with a grilled chicken sandwich and I thoroughly enjoyed it. A bit smaller in size than what I'm used to, it was quite thick and topped with tomato, lettuce, bacon vinaigrette, pickled red onions, honey mustard and provolone cheese. Yep, all of that. Smooshed between a pretzel bun. It was thick and I liked it! The fries it came with were cooked just right and tasty, too. Not too shabby for $14. Plus they packed my leftovers in an awesome carry out bag. <br><br>They have a huge selection of whiskey, whiskey cocktails and other alcoholic drinks including various specials. I'm boring and went for my usual - beer! They didn't have any beers I haven't had before on their which was sad for me, but I did see quite a few I enjoy. Had to go local and went with a Solemn Oath brew.<br><br>All in all, regular prices can add up but if you hit up their happy hour specials or lunch deals, your wallet and tummy will thank you.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8fTs3_okBe7ybplCqJ2edg/168s.jpg", "caption": "Grilled chicken sandwich"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/diGrN5zvXN3FIU3c2kk9uQ/168s.jpg", "caption": "Inside"}]}}, {"review": {"des": "Love the atmosphere here! Definitely need a reservation as it's got a small dining room. Excellent food! Didn't have drinks this time since we did HH prior to arriving. I had the New England seafood roll (OMG)! And hubs had the corn chowder followed by the French dip. Absolutely decadent!! Will come back for sure.", "pics": null}}, {"review": {"des": "$5 Whiskey Boys! $5 Sparking Wine! $1 Oysters! In case you didn't guess it, that's what their happy hour consisted of.<br><br>What's a whiskey boy, you ask?  I sure did. Well, it's somewhere between a Manhattan and an Old Fashioned that the Franklin Room bottles up in these mini-glass flasks (which they let you keep, by the way). Amazing.<br><br>We ended up ordering a short rib poutine to share and the Surf & Turf burger. The poutine, man oh man! If you dont' order anything else, order that! The surf & turf burger was good but the soft shell crab was a little under for me...<br><br>All in all, a great date spot.", "pics": null}}, {"review": {"des": "What a nice experience. From the hostess to our waitress we felt very welcomed. <br><br>We tried the Ahi Tuna Tartare & it was a decent portion for two and very delicious. <br><br>My honey had the Salmon and I got a taste and it would be something I would definitely order. <br><br>They had me at Truffles and I had the Truffle mushroom pasta with a side of chicken. Super good. <br><br>The only negative is their wine list. Which I get it... Speakeasy theme & all... all about the booze. We are wine drinkers & meh. We are a mixed wine couple as I'm into white and he's into red. Get pretty much any Sauvignon Blanc from New Zealand & you cannot go wrong (anywhere else is just flat & doesn't have the crisp fruitiness). A solid Pinot Noir is Meiomi. Wanna get crazy, Prisoner is a great red blend. You are welcome!", "pics": null}}, {"review": {"des": "This place has AMAZING food with a swanky and intimate atmosphere to match. We had a party of 4 and went to celebrate the engagement of my fiancé and I. I even received a congratulations card from the server upon her seating us. What a kind gesture. We ended up ordering a ton of different appetizers and splitting them all. Along with a dozen oysters. The only complaint my friend had (I don't eat oysters) is that they did not have horseradish or cocktail sauce for the oysters. Apparently that's a must. Other than that, we ordered the truffle burrata, fried squash blossoms, cauliflower tots, hot crab dip and the crispy rock shrimp. All of it was absolutely delicious. There wasn't anything we didn't love. The truffle burrata melts in your mouth. It was my first time trying fried squash blossoms, as I've always wanted to. They were so flavorful and unique tasting. The inside is small and cozy yet not crowded. The service is excellent and the drinks are strong and tasty. I even tried a few drinks I normally would not order, including a drink with egg whites and whiskey, and thought they were delicious. We will definitely be coming back in the future!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Sd5g2GrKzAkSBQc8YQehDg/168s.jpg", "caption": "Top left: truffle burrata. Top right: cauliflower tots Bottom: fried squash blossoms"}]}}, {"review": {"des": "I loved it here! We went for $1 oysters (5:00-6:30 every night) and they were awesome!<br><br>All of the employees were so friendly and routinely checked on our table throughout the meal. This restaurant drew a decent amount of people in for a Monday night. Very impressive!<br><br>The atmosphere is really cool. I felt like I was hiding from the city in an environment that was still urban in some ways. The restaurant and bar are located down a flight of stairs upon entry to the venue. Super cool!<br><br>I would totally come back here to try out some of the awesome menu options. I saw short rib poutine on the menu so I will return to see what that is all about. :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/d9RWSCizyXMFYCMw5Ohi9g/168s.jpg", "caption": "Mmmmm"}]}}, {"review": {"des": "Came here for a night cap after a<br>Rehearsal dinner ! Did not disappoint. The old fashion was one of the best I've had. <br><br>Was there with a friend who really knows and loves whiskey and bourbon. Even he was impressed with their knowledgeable bartenders and expansive list of available brands. <br><br>Didn't try food as we were just there for a<br>Drink before they closed but the food looked great as it was around us. <br><br>Must stop for anyone who enjoys hand crafted cocktails especially with a bourbon or whiskey twist !", "pics": null}}, {"review": {"des": "Food was pretty good but we had slow service and this place is LOUD.   DID I MENTION HOW LOUD IT WAS!!!!!!!! So loud, we almost left even after ordering.", "pics": null}}, {"review": {"des": "Wow this place exceeded my expectations and I only got take out! I have a lot of positive things to say...First, I put my order in around rush hour so I thought it would be forever, but it was only 30 minutes! Second, the two items came packaged very nicely in a reusable bag, I love when restaurants do this! Third, I ordered the cauliflower tots and truffle mushroom pasta. Both were very very good. The tots tasted great along with the perfect texture. The pasta noodles, sauce, mushrooms, all of it was high quality and delicious! Lastly, there was so much food! I am thoroughly impressed and hope I get the opportunity to eat in restaurant sometime!", "pics": null}}, {"review": {"des": "I got the FR Cheeseburger without the pretzel bun. They put some salad in place of the bun. The burger was ok-nothing too special. The fries were steak fries!", "pics": null}}, {"review": {"des": "All I can attest to is the oyster happy hour at the bar but it was truly an awesome experience. Heavenly $1 oysters accompanied with pickled cucumber pearls, chili sauce, and yuzu shaved ice.  If you're an oyster purist, then maybe you'll grumble about the unnecessary flare, but I like fun accompaniments to go with my oysters and this is a unique but subtle option.  In addition to $1 oysters, they have brilliantly paired a Tues-Sat happy hour from 5-6:30 that includes $5 cava.  So when I checked this place out with some co-workers a few months ago, we enjoyed many (MANY) dozens of oysters with many (MANY) glasses of cava for about as reasonable a bill as you can hope for.<br><br>The restaurant is below ground so it's a combination of elegance with a bit of a divey feel just due to the lack of windows and sunlight.  The bar area was very fun (which is where we sat) and we had a great time interacting with our bartender through the evening as we ordered dozen after dozen oysters.<br><br>Oysters are pretty good quality. Not huge but not tiny and tasted fresh.  I can't remember what kind they were that night (on account of the $5 cava) but I remember enjoying them and maybe eating 2.5-3 dozen all by myself.  <br><br>By the end of the night, we needed something with a little more substance (again, see $5 cava above) and ordered the truffle fries and cauliflower parmesan tots.  Both were fantastic and just the fried unhealthy food we needed to fill up our bellies.<br><br>I've tried a number of happy hour oyster spots in the city and Franklin Room might be one of my favorites, if not THE fave, mostly due to the discounted sparkling to go with the discounted oysters and the fun and tasty unique way they serve their oysters.  Can't wait to come back!", "pics": null}}, {"review": {"des": "Loved this place!<br><br>Excellent assortment of craft brews, and the menu offerings, while eclectic, seem to be all entrees that the chef knows well - nothing that is outside of his/her depth!<br><br>The bar staff is attentive, and helpful, with excellent advice - my original choice for craft-brewed ale was The Velveteen Habit, was unavailable at the time, so, it was Dust Bowl Brewing's Eruption, instead - I was NOT disappointed.<br><br>Great location, and I would gladly meet friends for drinks after work, again!", "pics": null}}, {"review": {"des": "Such a beautiful place with impeccable service! Gabe, the GM made it a point to visit our table to see how everything was. The food was phenomenal, and the whiskey selection... unlike anything I've ever seen! Try the cauliflower tots especially- you will not be disappointed. <br><br>Will be bringing all of my out-of-town visitors in for a swanky vibe, good food, great service, and a fun crowd. The live Jazz band was the perfect touch to our pre-game.", "pics": null}}, {"review": {"des": "I was looking for happy hour oysters and came across this place. They have HH everyday from 5-6:30, offering $1 oysters.<br><br>My boyfriend and I came on a Saturday night at 6:00. We had reservations, but the place was still pretty empty. I saw 2 tables seated and a handful of people at the bar. <br><br>We had 10 oysters which comes with pickled cucumber on top. There's a spicy chili sauce (instead of cocktail sauce with horseradish) and a yuzu ice (instead of a vinegarette). The chili sauce was indeed pretty spicy and paired nicely with the oysters, as did the yuzu ice. One disappointing thing, was that there are no selections of oysters, nor does it say what oyster is being served. <br><br>We also got the Steak Frites and the Halibut as our entrees. I thought the portions were appropriate. The steak was very tasty and cooked perfectly. My boyfriend enjoyed his halibut, but the lemon sauce was very sour. <br><br>Our server, Dan was awesome. He was sure to check up on us but wasn't intrusive or too pushy. Overall, I was very happy with my experience and would definitely love to come again.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3mZx9WIQlu-HEqXUjSvwYw/348s.jpg", "caption": "Halibut"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/17CTV3yeoYymFK5l3-csAA/168s.jpg", "caption": "Steak"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gJaynzWU00GBG-j3cywAnQ/168s.jpg", "caption": "Oysters"}]}}, {"review": {"des": "Now what exactly is there not to like about this place? Incredible selection of whiskeys, ranging from bourbon, Scotches, Irish whiskys, single malts, Japanese whiskey, and blended whiskeys. <br><br>The bar itself is beautiful. Dimly lit, which just adds to the beauty of sipping on drams.<br><br>What's special about this place is that not only do they focus on booze, but they also have incredible food. I started off with a simple order of truffle fries. DELICIOUS. Cooked to absolute perfection. Topped with a generous, but not overwhelmed amount of freshly grated parmesan. For my entree, I ordered the squid ink pasta. Holy (insert string of expletives here.) Pasta itself was cooked PERFECTLY. Mixed together with the best pesto I've ever tasted: so flavorful, seasoned just right, and not at all greasy. Topped with plump, juicy shrimp that were also of course, seasoned perfectly. The crab meat was so. Goddamn. Fresh. I can't. So flavorful. I might cry just thinking about it. <br><br>Full disclosure: I seriously cannot remember the last time I enjoyed a meal so much, in case you couldn't tell.<br><br>Wtf are you waiting for? GO THERE.<br><br>Also, make sure you try their deep dish cookie. My eyes were rolling to the back of my head.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/srECdnvAM0VSm3KX6yEzag/348s.jpg", "caption": "You make my girlhood tremble."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RmhY5f9Iy9E8ayvhe2xMjQ/168s.jpg", "caption": "Squid ink pasta. A MUST."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZnjCVMzHP6M0cvZ7iUbs6A/168s.jpg", "caption": "Aww yiss. Deep dish cookie."}]}}, {"review": {"des": "Ambiance was great.  And the menu had me excited.  The server was a little overly attentive, coming back every 4 or 5 minutes.  Drinks were great and the bourbon selection is second to none.  My major disappointed was with the food.  The $100 tomahawk was poorly seasoned and fattier than anything I've ever had (and I've had a lot of Ribeyes in my day).  And the fingerling potatoes were undercooked.  I'd go again for bar food, appetizers, and maybe the burger.  But not somewhere I'd drop $100+ per person again.", "pics": null}}, {"review": {"des": "Fun restaurant. Good food. Good drinks. <br>Would have given 5 stars but waitress not the friendliest.", "pics": null}}, {"review": {"des": "Overall, really, really good.  Try the whiskey boys during happy hour.  A great drink and an adorable little bottle to take home!<br><br>We went on a Friday night, about 5:15pm and had no reservation.  The hostess was straight up honest with us (love that!) and said, if you want a table I can give you one now if you think you won't stay past 6:30.  The table has a reservation at 6:30.  Done!  We happily took it and slid out at 6:28.  Score!<br><br>Onto the food - we had a dozen oysters, which we love.  They were respectable but not the best I've had.  Still, for a buck a pop during happy hour, that's pretty good in my book.<br><br>For entrees, we tried the steak salad and the drummettes.  I never would have thought to order drumettes, but a woman at the table next to ours ordered them and they looked and smelled divine.  So we did .... and guess what?  The table on the OTHER side saw our drumettes and did the same.  Total domino effect of drumette goodness.  Try them - you won't be disappointed. <br><br>The salad was good too.   Next time I really want to try their mussels - for sure I will be back.<br><br>The ambiance is lovely - classy, rich wood bar setting with gorgeous high tops and a really creative solution to showcasing fairly industrial lighting above.  Cool idea that I am thinking of stealing for our loft kitchen.  The only downside?  It was loud, loud, loud and we had to yell a bit to hear each other.<br><br>Still, great ambiance, delicious food, 4 drinks, a dozen oysters, and 2 dinners for $65?  This place is amazing for happy hour with dinner and I can see it will be a regular thing.  May try to check it out mid-week to see if the volume is less, but I have a sneaky suspicion the Franklin Room will be hot any night of the week.", "pics": null}}, {"review": {"des": "Beautiful atmosphere and cozy too. Monday night is half off bottles of wine. Happy hour for lunch is a good deal too! Try the oysters. We had the ribeye and it was not that fatty like most. We also tried the burrata, and the crab dip. The key lime pie was great!", "pics": null}}, {"review": {"des": "Happy hour is amazing! $1 wine and beer and 3$ cocktails/martinis <br><br>Must try the cheese curds. One of my favs in the city. And the Rueben Sandwich is to die for! Great for lunch and dinner. The atmosphere is so vintage chic.", "pics": null}}, {"review": {"des": "This is one of my favorite places in Chicago! The 1$ oysters cannot be beat! Every time I come here the ambiance is wonderful and the food is to die for. Service is impeccable. I have come here quite often and have had quite an array of things from the menu. I have never had one bad experience with anything that I have ordered. From the mushroom soup, sandwiches, and oysters. This is a must try.", "pics": null}}, {"review": {"des": "We just moved to Chicago, and live a couple of blocks from the Franklin Room.. boy, are we in trouble!<br><br>Walking into the restaurant, you're taken back in time by the speakeasy feel -- the space is cozy, trendy, and inviting. Nothing about their menu is \"old-timey\". Think classics with a modern twist.<br><br>We started out with the cauliflower tots, which were refreshing and crispy. Somehow made me feel sliiiiightly less guilty, so that I could order the TFR Burger and truffle fries. <br><br>Everything was delicious! Highly recommend. Haven't been there for their Happy Hour deals, but I have a strong feeling we will be back.", "pics": null}}, {"review": {"des": "Honestly this place just had such trash oysters that I can't get past two stars. The cocktails were good and the fries were fine but the oysters were just so bad! It was dollar oysters but a lot of places do dollar oysters for happy hour that are delicious! The oysters first off only came with cocktail sauce not the mignonette sauce that other places usually offer. On top of that the oysters just weren't wet. I don't know how else to explain it! It was not a salty refreshing snack but more like a dry mussel. Look elsewhere for your oyster happy hour places", "pics": null}}, {"review": {"des": "This is, without doubt, the best restaurant I have ever been to in Chicago (a few business trips through the past few years).<br><br>I came on a Tuesday night, and the service was sincerely some of the best I have ever had. Their $1 oyster and $5 whiskey boy happy hour is unreal on its face, and the taste of both are completely out of hand too. The oysters are completely done up, and the whiskey boy was basically the best old fashion I've had in my life. And the lamb shank was fantastic.<br><br>All in all, if you live in Chicago, or just passing through like me, you owe it to yourself to check this place out. You will not be disappointed.", "pics": null}}, {"review": {"des": "There were mixed reviews from the group on this one, but I really enjoyed our time. We came in for happy hour (specifically the dollar oysters) on a Saturday. It wasn't THAT packed but our group of four was told that yes, we could be seated but needed to be out by x time, which was fine. I was with an oyster loving group so we just went right in with two dozen. If you're an oyster purist, which most of the group was, these probably aren't for you. I'm into lots of flavor and these were topped with scallions (which I don't usually like) and some sort of shallot sauce. We also got the king crab dip which was out of this world! My only complaint was too much dip, not enough bread to dip...as for cocktails, we all got the whiskey boys - $5 - you cannot beat that and they come in these cute flasks. Cute little place!", "pics": null}}, {"review": {"des": "The Franklin Room is definately a place to which I will return. The speakeasy vibe is not as strong as Untitled, or even a spot like The Cherry Circle Room, but it's comfortable down there and they do have some tasty offerings.<br><br>I'll start by saying I'm a huge fan of single malt scotch and oysters (not necessarily together). The $1 oyster happy hour is one of my favorite in the city. There are plenty of them, but the Franklin Room is easy to park or access by train... unlike some other alluring after work establishments. The happy hour goes from 5 - 6:30pm the oysters are delish!<br><br>The single malt selection is solid. I prefer the smokier scotchs and they sling my favorites; such as Balvenie Doublewood, Ardbeg, Laphroaig and Coal Ila.That's for the day to day drinking. They also offer an interesting take on the Whiskey Keep. FR isn't the only speakeasy to stowe away a private selection of hooch. Untitled has a similer concept with their whiskey vaults. FR offers $300 - $800 bottles of privately selected whiskies. They'll let you taste a 1 oz pour for a rather rediculous price... but you're flying blind about the flavor unless you happen to have already tried the rather obscure list of reserves. The good news is access to a bottles in your keep is assignable to friends, clients... anyone who you choose to experience a tasty twist on the speakeasy theme. I'm tempted to purchase a bottle myself...<br><br>The food was good, though not overly memorable. The ambiance, oysters and drinks are the reason to stop by. I hear the disabled entrance (they do have one) is off the alley behind the bar and provides access to an elevator that opens to the back of the place. If I did have a super expensive bottle of scotch waiting for me in a swanky whiskey keep and could access the place off a nondescript alleyway and a secret elevator... I might consider the experience worthy of a Chicago speakeasy title.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5RMQMeJ672AFBn21XKBoaQ/348s.jpg", "caption": "$1 oysters on the half shell alongside the very tasty wrongfully accused."}]}}, {"review": {"des": "This review is for the whisky drinks. THE F-ing BEST OLD FASHIONED EVER!!! They have the franklin room old fashioned--it's just amazing. It has Angels envy rye, vanilla bark and cherry bitters, and other unique stuff--but amounts to the BEST. Plus I tried their whiskey boy drink and Ima hit that again next time.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EJukSbdzajllrociG7wTxA/168s.jpg", "caption": "Franklin room old fashioned"}]}}, {"review": {"des": "Went there yesterday afternoon to have lunch with my mom.. We wanted to try a new place and made a reservation at this place. I regret having stayed... We were sat by the bar on their super small and crowded high top tables.. These small tables are so tiny and to top it off we were sat in between two couples of loud business men. Very uncomfortable lunch. <br>We were served by the bar tender who had a full bar to take care of and several other tables, so we obviously didn't get great service. <br>What appeared to be the manager (by the host stand) seemed to be annoyed to be working there and didn't approach any of the guests at any point to see how we were doing.. definitely not worth my money or time.", "pics": null}}, {"review": {"des": "My crew of four friends came to Franklin Room for their happy hour $1.00 oysters. <br><br>Apparently, a Tuesday evening was a \"reservation only\" night, so the receptionist offered to seat us for 45 minutes, OR have us STAND at a table for the duration of our stay. We chose to stand, which was rather insulting, but not as awful of an experience as you'd assume. <br><br>The $1.00 oysters were bland, most likely a week old, and were accompanied by a disgusting \"clementine smelling\" relish. We didn't have high expectations for the mollusks, but loved our dollar oyster experience at Hubbard Inn SO MUCH more. We did order the $5.00 \"whiskey bois,\" which came with take home glass containers. I highly recommend this cocktail. <br><br>Seriously, if you're wanting a \"dollar oyster happy hour evening\" in Chicago, go to Hubbard Inn directly down the street.", "pics": null}}, {"review": {"des": "I have been to Franklin Room several times and had a so-so experience. The most recent trip was fantastic though. We snagged seats at the bar which is KEY. Our bartender Peter was amazing - friendly, helpful and genuinely seemed to love being there. He also happened to make the most delicious dirty martini I've had in a long time. <br><br>The food was delicious. Their fish sandwich was made with flounder and was so fresh. I would compare it to the comforting McDo sandwich but with all fresh top notch ingredients. Probably one of the best fish sandwiches I've ever had. I swapped fries for the cauliflower tots - definitely the right choice. The truffled burrata with fried tomatoes was also amazing. <br><br>I'm officially a fan now and can't wait to go back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/H6wwsMRayHS2sRRsMJ5r_g/348s.jpg", "caption": "Burrata and fried tomatoes"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fh5aGKQNCFbO3k8Dv1n_HA/168s.jpg", "caption": "Fish sandwich - I was too excited and had to taste before I snapped a photo"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2DUV4aICl6bBxq4aTmCcYw/168s.jpg", "caption": "Perfect dirty martini"}]}}, {"review": {"des": "Cold, Greasy Food; Nasty Service<br>This was our second visit to Franklin Room. Our first visit was very good, so we were looking forward to returning. Unfortunately, the second visit was nasty: the entrees were cold and greasy (one had to be sent back and got returned warm [not hot] but still greasy), the second one probably should have been sent back but I didn't want to make a big scene. <br><br>The service (\"Ashley K\") was terrible -- completely indifferent. Never said hello, goodbye, thanks, how is everything, just annoyed to have to do the job. <br><br>We will not be back to the Franklin Room for dinner, and neither should you. It is a good choice for an after-work drink, and actually the cauliflower tots are very good. But these can be easily had as an hors d'oeuvre or snack, and then you can go to a real restaurant for dinner after. <br><br>It's a real shame. Franklin Room had a lot of potential but fell completely flat on the second try. Fool me once, shame on you, fool me twice........", "pics": null}}, {"review": {"des": "This was such a good spot, which is exactly what I expected after reading the reviews. <br><br>The waiter, Dan, was very attentive. Atmosphere is clean, with a retro-whiskey vibe of a clean, urban basement. It isn't that large of a space, so I would definitely recommend making reservations before attending.  <br><br>I had the spicy bourbon burger with fries as well as a local beer and I could not be happy enough with the outcome. My partner had the Alaskan halibut which he loved and I tasted a bite (I am not a seafood dude) and it was great. <br><br>Overall, I will be back for sure. And to check out their happy hour which appears to be a hot spot for this place. <br><br>Definitely commend and five stars!", "pics": null}}, {"review": {"des": "I went here over the weekend to celebrate my birthday with 6 of my friends.  We had reservations at 7pm, and went at 6pm to have a drink in the bar before dinner.  The staff couldn't have acted more put-out with us.  And so the night begins...<br><br>Not only did several different employees act annoyed with us, it was hot as blue blazes in the establishment.  We were told we were in the way of the waitstaff getting through the bar area, even after we moved. We aren't the folks who just go into a place and act like we own it, for the record; we're genuinely considerate people who try to do just the opposite. One of my friends ordered a red wine, and couldn't drink it because it was apparently that bad.  Ugh.  My apologies for bringing 7 people to your restaurant to spend money, and behaving a tad more politely to you than you did to us. Did I mention we were all sweating?  I'm from Alabama; I'm used to hot.  But in a short sleeved, above the knee dress, I was smoldering.  Including a little steamed about the service.<br><br>7pm rolls around, and our table isn't ready. 7:15- same story.  7:30- same story.  At which point several different employees start apologizing to us, and all of the sudden we aren't such an annoyance any more.  <br>Almost 40 minutes past our reservation time, when the restaurant is still uncomfortably hot, we get our table.  At which point service improves.  Our waitress was super sweet.  The manager sent over a couple of appetizer plates of the fried cauliflower, which arrived immediately when we sat down.  And it was delicious.  We received another apology for the wait time.  P.S.  What's the point in having a reservation?<br><br>So, aside from there being no blue cheese olives for my martini, I did get blue cheese swapped for fontinella in my steak salad.  (Hey, may I please have some extra blue cheese? I'm happy to stuff my own olives.)  The salad was delicious, and the steak on it was perfectly cooked.<br><br>We also had crab dip, and the black truffle burrata, both of which were delightful.  Everyone said their entrees were great.  And with all of us being foodies, this is what mattered to us most, outside of just getting to hang out with each other.  By the time we were nearing the end of our meal, the temperature seemed to get under control in the restaurant.  Hallelujah.  The restaurant was kind enough to bring over a key lime tart with a candle in it for me for dessert.  We all shared it, and everyone agreed that It was also delicious.<br><br>Go here for the food y'all.  I'm still a tad irritated that my birthday dinner had such a rough start, courtesy of the treatment we received.  Perhaps when I cool off, pun intended, I'll go back and see if I can have a different overall experience.", "pics": null}}, {"review": {"des": "Quick update now that I've indulged in their delicious food a couple times...<br><br>Oysters on the half shell: Delicious! And only $1 each from 5-6:30 pm everyday. My husband and I enjoyed 12 and it was the perfect amount along with our other small plates.<br><br>Wagyu Beef Tartare ($18): Such a great shareable plate! The beef tartar was SO good and combined with the Foie gras butter, quail egg, and capers this was a match made in heaven.<br><br>Sliced Pork Belly ($10): Very flavorful! The pork belly itself was juicy with white wine, ginger, and chili oil with micro greens on top.<br><br>Crab Dip ($12): I could have eaten this whole thing with a spoon! Blue crab, mascarpone, fontinella, shallots, and toasted baguettes for dipping.<br><br>Duck Sausage ($14): Literally still drooling over this. My husband and I split the sandwich and I ate mine without the bun. The duck sausage is served with caramelized onions, foie gras mousse, and sweet chili sauce and boy is it juicy. Just heavenly I tell ya!<br><br>Cauliflower Tots: The sandwiches are served with waffle fries, but they do have a few healthier options to choose from, one being the cauliflower tots. They were really good! I was actually surprised at how good they were. It comes with blue cheese, but we opted for ranch instead since my husband isn't a fan.<br><br>Seared Tuna Salad ($19): A great lunch option since it's light and healthy. The salad includes Albacore tuna, boston lettuce, tomato, fennel, and pickled red onion with sweet-miso vinaigrette. I got my order delivered when at the office, and while I did enjoy the salad I'd say $19 is pretty steep for this dish.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UH8GxO7F6RQ8oS53Vn8iVw/348s.jpg", "caption": "Oysters on the Half Shell"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sXiDgTS2ZoARPYfGqj7tbQ/168s.jpg", "caption": "Wagyu Beef Tartare"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4bGQ2G70DecPqlf0tSPNPg/168s.jpg", "caption": "Sliced Pork Belly"}]}}, {"review": {"des": "I came here for drinks last week with a friend.  It was busy during happy hour, though the specials weren't all that special.  I did enjoy the $5 cava, but didn't like that they only had standing tables open at 6 pm.  I need to come back and try the food.  I'd suggest making reservations for a table if you'd like to sit down and enjoy your drink.  It's not a huge place, but it does have a lot of character.", "pics": null}}, {"review": {"des": "My rating is actually somewhere between 3.5 and 4 stars.<br><br>We went here on a Friday night and made a reservation through open table. When we arrived, we were quickly taken care of and led to our table. The restaurant has a nice and intimate ambience while playing some old-school hip hop. Our server was incredibly helpful and nice from the moment we sat down. <br><br>We weren't in the mood to drink so we ordered one cocktail to share. We ordered the Madame Chareau. Not only was the drink beautiful, it tasted so good! It was probably one of the best cocktails we've had so far this year. It was refreshing and sweet. I will definitely come back to try more of their cocktails. <br><br>We started with the calamari, crab dip, and chicken drumettes. I thought the crab dip was the best out of all three. It came piping hot with tons of crab meat inside and enough bread to dip with. The calamari was standard, the tatar sauce it came with was good but the breading could have been more seasoned. I had high exceptions for the chicken drumettes as there was many great reviews on it. However, I did not really enjoy it. It did not come out hot, almost like it has been out of the fryer for about an hour already. The sauce was nothing to write home about and the meat was not juicy. <br><br>For our mains, he ordered fish and chips and I ordered mussels. The mussels is actually listed as a app to share but I knew I wasn't going to be able to finish a main. To my surprise the dish was actually huge! For $14 they sure give you a ton of mussels and bread to soak up the sauce. The sauce is not your standard garlic and white wine. Instead, it was miso based and had cherry tomatoes in it. I am a fan of miso, but some of the miso paste wasn't properly dissolved into the sauce and I found chunks of it that went away with some stirring. The mussels were fresh, the bread was perfect for soaking, the sauce was a bit on the saltier side but overall, delicious and totally filling for a main or an app to share. <br><br>The fish and chips is where I had to knock a star off. The breading was very heavy and the fish was under seasoned. Again, it tasted like it came out the fryer a while ago. However, the portion was huge, two big pieces of fish. I wish they used a lighter and crispier batter. I love fish and chips but I did not love theirs. However, their fries stood out to me. Not usually a big fan of steak fries (they used to have waffle fries but the server said they no longer have them), these steak fries were delicious! I couldn't stop myself from eating off my boyfriend's plate! They were fresh and crispy on the outside, well seasoned and soft on the inside. <br><br>Although we were super super stuffed, we couldn't leave without getting some dessert. We decided to go with the ice cream and waffles. It was a small portion but perfect for two to share if you just wanted something small to satisfy your post dinner sweet tooth. The waffle came warm and had bits of strawberry it in. The ice cream paired perfectly and it also came with some fresh berries and bananas. Perfect way to end the night! I was expecting our bill to be well over $100 but it was just under at around $96. A great deal for River North. <br><br>Next time we come here, I definitely want to try their surf and turf burger and their $1 oysters for happy hour!", "pics": null}}, {"review": {"des": "I'm rating this off a Postmates order of their roasted beet salad. I ordered it without the goat cheese, and it was still so amazing. The serving size is phenomenal; the beets are fresh and cut to a perfect size; and the candied walnuts are so amazing. The salad was also super fresh even with the delivery time. I definitely recommend!", "pics": null}}, {"review": {"des": "Everything was perfect - service, cocktails, apps, entrees, and dessert. We had lamb shank and Scottish salmon. Both cooked perfectly. This is my new favorite.", "pics": null}}, {"review": {"des": "Great food, drinks and and classy environment with good music (low key hip hop when I was there). And it's a whiskey keep bar (you can order a bottle, cheaper than usual, and whatever you don't drink they'll save the rest for you for another time). Great service too. Will be back.", "pics": null}}, {"review": {"des": "This review is for the oyster special. <br><br>ordered: vieux carre, $1 oysters<br><br>DRINKS: Extensive drink selection. I ordered the vieux carre, which was a rye/ cognac cocktail with vermouth, bitters, and an absinthe rinse. Great cocktail with attention to balance. Definitely a bit sweeter/ citrusy than I thought it would be, but it maintained a heavy booziness.<br><br>ATMOSPHERE: Hipster vibe, with old fashioned touches. Dimly lit with modern, pop/r&b playing. (JayZ, Big Sean, arianra<br><br>OYSTERS: The oysters were East Coasters from VA. They were large oysters with a soft meat. A pretty beau real taste, with an ocean finish. <br>Served with Cucumber, scallions, pickled onion, and a Japanese sauce. On the side was a lemon flavored snow and a spicy cocktail sauce. The cocktail sauce had a wonderful sweetness.<br><br>This has moved up to one of my favorite oyster places. Here, Union Sushi, and Roka Akor might just be my New trinity for oysters. I think Frontier moved off the list, but those oysters are still pretty good. I just like places that incorporate their own flavor profiles into the order. <br><br>SERVICE: Bartenders were attentive and clearly cared about the quality of their products, making sure to check in for my opinion.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fIio6TsulNrgm6Pl-MAz4g/348s.jpg", "caption": "$1 oyster special"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IQ2vWyTSRQAQjH792Ulr2Q/168s.jpg", "caption": "All dressed up"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OOcnOptoK7rVlR3KzIlY5Q/168s.jpg", "caption": "Lemon snow"}]}}, {"review": {"des": "This is one of the best experiences for reasonable prices in Chicago's downtown.  Fantastic drinks, food and service. All were awesome. <br><br>I met my son for cocktails and dinner.  We started with a cocktail. I had their signature Old Fashion. It was sooooo good. Well balanced, no muddled fruit that overpower the bourbon. Not too strong. Just wonderful. My son started with a short pour of 1792. Wonderful. <br><br>Our waitress was fantastic, patient and helped explain all the dishes. Wasn't hovering but always there to help make the evening great. <br><br>They have an amazing cocktail menu with a great choice of bourbons, whiskeys from around the world, great wine and more. <br><br>For food we started with their Oyster special during Happy Hour. $1 each.  They are presented beautifully, they are really fresh and meaty, and the condiments including the cucumber balls are amazing.  You have to try these. Definitely worth coming just for these. <br><br>We decided to split several small plates for dinner.  We ordered their Mussels and the Pork Belly.  The Mussels were flavorful. Good amount, plenty to split. The Pork Belly was good and the order is huge. <br><br>We also split Cauliflower Tots and the Wagyu Beef Tartare.  Wow. The Cauliflower is really good - flavorful and filling.  The Tartare is prepared so fresh and was perfect. <br><br>Not a bad dish all night. <br><br>We finished up with desserts (yes we over ate).  We had a Bourbon Caramel Shake and the deconstructed Banana Split. The Banana Split was good but that Bourbon Carmel Shake - HOLY COW. <br><br>A wonderful night thanks to the Franklin Room. We will definitely be back for more.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UDN_wfvkWFUnX2Qa0tKKWA/348s.jpg", "caption": "A single barrel bourbon flight.  Four Roses, Knob Creek and Evan Williams."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/am5kdDuTUuMvWgr2oaRnKw/168s.jpg", "caption": "Their signature old fashioned, and a Taiwanese single malt."}]}}, {"review": {"des": "We have a new mission!  Next few months we'll be visiting every Oyster bar / happy hour in Chicago.  Join us or keep in touch to share this journey with us thru Yelp!!!  <br><br>1st stop <br>No. 20 The Franklin Room <br>Specials:  daily $1 oysters from 5:00 p.m. until 6:30 p.m <br>(p.s we hit no. 20 purposeful to avoid high expectations). <br><br>------in short-----<br>What's Missing??:  not enough oyster liquor, and I enjoy them  brinier!<br><br>Didid it well!!:  lemon ice, and scallions!<br>-------<br><br>Well here goes for full journey with Franklin Room--  We arrived sharp at 4:38pm on Saturday afternoon/evening!  We should have know that restaurant like Franklin Room would be punctual and open doors at 5pm.   No worries we walked over to (Cafe Iberico) my favorite and as you would know one drink led to another at (The Boarding House). Those two for later!<br><br>Back to our mission!  We arrived back at 5:45pm and surprisingly there were plenty seats available.  Hostesses looked bored and made it a point to inform us they are expecting more guests under reservations; we had our eyes on bar seats anyway!!  Keeping with our mission only Oysters... &&  Oysters...  only!!<br><br>Got our beers and 6 of $1 specials for our first order!  on my first shot/gulp/slurp I was disappointed!  :( We thought it's probably a good idea to order Rockefeller (not offered with $1 special) but we have a mission so we didid it!  <br><br>Oysters cooked like pizza 'hummm' I wasn't a fan but he was! We decided he will eat rest of Rockfeller and I'll have the original!   I got creative with some hot sauce and lime.  Interesting fact they have special lemon ice you can add that instead of lemon.<br><br>All in all---worth $1 Oysters not the $16 regular price.<br><br>Enjoy!  Till we meet again.... happy yelping!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LRJHbsF8e1y02pPW1bjmhA/348s.jpg", "caption": "See that lemon ice in a bowl??  How cool is that?"}]}}, {"review": {"des": "Great staff, excellent service, delicious food. Glad we came, we'll definitely be coming back!", "pics": null}}, {"review": {"des": "Great vibe, with shelves full of whiskey all around, nice lighting, and a chill soundtrack.<br><br>The whiskey flights are interesting, and there is an extensive list of well-made cocktails. Wines by the glass are limited, but are stored at the right temperatures.<br><br>We grazed on small plates and liked everything we had.<br><br>The smoked fish board included three kinds of fish, but the standout was the trout pate, which can also be ordered separately. <br><br>Cauliflower \"tots\" were actually cauliflower florets tempura fried. They were nice and light. The accompanying blue cheese dip was very mild; horseradish would have worked even better.<br><br>The highlight of the meal was the mussels (which I forgot to photograph). They were served in a spicy miso broth that was great for dipping the accompanying toast. Best mussels I've had anywhere!<br><br>We split a Smokehouse burger, which was good, but the \"bacon\" was a delicious chunk of smoked pork belly that was far too thick to eat in the burger.<br><br>Service was friendly and knowledgable, with real enthusiasm for the  whiskey list.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zZlBgCH7qxq6senA7zLFJg/348s.jpg", "caption": "Smokehouse burger"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/X03MyxzcS6iZbLeQR3i_3g/168s.jpg", "caption": "Cauliflower tots"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DZMZXev9q7s-gqRf3TN3_Q/168s.jpg", "caption": "Exterior"}]}}, {"review": {"des": "Not working across the street from the Franklin Room (which I did for two years) is the worst thing about leaving that job. I miss it regularly. I miss it at least on a weekly basis. <br><br>Lunch at the Franklin Room is superior to lunch anywhere else and that is because the lunch happy hour is ridiculous and makes work worth doing. $1 wines and beers and $3 manhattans for lunch. YES PLEASE! <br><br>The food is also always amazing. The burgers and other sandwiches are always perfectly on point and waffle fries to top it all off. They have a squid ink seafood pasta that is the stuff dreams are made of and I can't get it out of my mind ever. <br><br>If you haven't been to the Franklin Room you are seriously missing out.", "pics": null}}, {"review": {"des": "Great spot for early in the game dates or to catch up with a girlfriend. They also have a great bar /standing room where you can get full food and bev service.<br><br>Food was decent, atmosphere was chill and encouraged communication.<br>They have happy hour which I appreciate. $1 oysters, $5 whisky cocktail, etc. (Wednesday night).", "pics": null}}, {"review": {"des": "I really love this place. The food is always excellent and the atmosphere is fun. Whenever I have people in town we always take them here, especially if we want to go out to eat last minute - they usually always have reservations available! There is something on the menu for everybody and I have never been disappointed with an item I ordered. They also have a large selection of whiskeys to sample and you can even buy a bottle!", "pics": null}}, {"review": {"des": "Came here for the first time with a girlfriend for some after work drinks and dinner. The staff was very friendly and attentive. <br><br>I ordered a spicy tequila cocktail which was delicious- perfect balance of sweetness and heat. My friend got a cucumber cocktail that was also really good. <br><br>For food, we spit the crab dip which was super light and delicious. My entree was the most underwhelming part of the meal. I got the mushroom sandwich which was super hard to eat and messy. There was a fried egg advertised on it but the yolk was cooked through- not sure if that was on purpose or just overdone but it really didn't do anything for me without the runny yolk.  The sandwiches also all come with steak fries which is exactly how you'd expect them- under seasoned and some are borderline mushy, just like when you were a kid. <br><br>So all in all- I would absolutely go back here for cocktails and apps.", "pics": null}}, {"review": {"des": "I really liked this place! A friend brought us here for lunch while were visiting Chicago. It's all dark wood and upscale casual; just what I love. Also lunchtime has $1 wine and beer!!! What's not to love?! We all shared the cauliflower tots(which I was surprised were just ok; given the great reviews), and the cheese curds,(which were better). We also shared a cheeseburger and fries. They cut it for us, which was a nice touch. The burger and parmesan fries were really delicious! Everyone agreed. Service was friendly and attentive. Located just west of downtown, but I guess still considered downtown for sure, I'd love to try it here for dinner also. It's s fairly large place and likely able to accommodate large groups so would be great for parties etc. in fact there was a large party next to us while we were there. Would definitely recommend!!", "pics": null}}, {"review": {"des": "I've been to the Franklin Room numerous times and it has been amazing every. single. time. Their cocktails are amazing. Their bartenders are amazing. The atmosphere is amazing.<br><br>This was the second stop on a Saturday night bar crawl with my girlfriend (see my Green Door Tavern review for part 1). We got there around 7:30 without reservations, so it was packed and the wait wasn't short. Luckily, we were able to snag two seats at the end of the bar. I ordered the Lost N Paradise specialty cocktail which is a tasty rum based drink.<br><br>The coolest thing about the Franklin Room is their speakeasy vibe and the bottle keep program. That's right, you can buy a bottle and they will hold it for you, free of charge, in their cabinet.", "pics": null}}, {"review": {"des": "Solid experience but wasn't amazed. Cool ambiance and standard expensive drinks. I like that it's a well lit speakeasy type place. I didn't give 5 stars because bartenders could have been a little more professional and more inclined to teach about whiskey versus making fun of my original choice. Also if I'm paying that much i would like it made in front of me just a thought. I would go back to try again.", "pics": null}}, {"review": {"des": "I met up with some coworkers recently for some drinks and dinner. Our server was extremely helpful when it came to picking beverages. She had a great handle for the different flavor profiles of their large cocktail menu and pushed me in the right direction.<br><br>We were excited to find out they were serving $1 oysters, and ordered 15 for our table of 3. Normally, I could eat 15 oysters myself, but not these. They weren't all that flavorful and were covered with chopped pickled cucumber that really didn't enhance the taste at all.<br><br>As for dinner, we settled on a pile of appetizers to share. We ordered the cauliflower parmesan \"tots\" expecting they would be shreded and more \"tot like\" but instead they were just deep fried nuggets of cauliflower. Delicious none the less. <br><br>The chicken drumettes were sweet and delicious as well. Same with the duck liver pate. Very nice! That said, the brussels sprouts were REALLY tangy and kind of off-putting.<br><br>For me the highlight of the meal was the short rib poutine. The flavors and textures just came out perfectly and I love that they use feta in this dish. I secretly wished I had ordered it for myself as it felt like a tragedy to share. <br><br>All in all, the great atmosphere and service coupled with mostly solid food and beverage should make this a go-to if you're in the area. Just avoid the brussels sprouts. :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/r22VTeBMAmI4-j9tYuKujQ/348s.jpg", "caption": "Short rib poutine = heaven."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YDNHb7lPZEhkFSp9kZpllA/168s.jpg", "caption": "Duck liver pate"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/l3QbbXcMEr1TN9Z_a1a4zA/168s.jpg", "caption": "pass on the oysters"}]}}, {"review": {"des": "Ordered the steak tartar as my appetizer and the southwest salad as my entree. Both were fantastic, but the southwest salad was a standout. The food was a great value but drinks were somewhat overpriced (but will still come back).", "pics": null}}, {"review": {"des": "My boyfriend and I enjoyed the food here. We ordered over a dozen of oysters because they have $1 oysters from 5-6:30PM everyday. We got beef tartar and crispy rock shrimp which was very delicious! My boyfriend ordered the lamb shank entree and I got the surf and turf burger. Everything was great and I would definitely come back for the $1 oysters!", "pics": null}}, {"review": {"des": "Great decor and ambience.  Great food: bourbon cheese curds and crab dip were the best!  Most enjoyable whiskey drinking cocktail experience for a whiskey bar.  The best old fashioned I've had! Classy and casual attire allowed.  Kind staff service.  Don't get the lamb it was not seasoned, very bland.  The braised short rib was perfect!", "pics": null}}, {"review": {"des": "We have been meaning to try this place for quite some time, and finally got to it- what a terrific find! As is obvious, the alcohol choices are amazing. The staff will makes some great recommendations too- I really had my eyes opened to some amazing new scotch. <br>The food was delicious!  Between the butternut shrimp bisque, the parmesan cauliflower bites and the main fare, a bourbon-sauced hamburger and a cajun fish sandwich, it was difficult to tell which was more perfect. Great atmosphere too. This place easily became a new favorite!", "pics": null}}, {"review": {"des": "We ate here this past weekend for my girlfriends bday!<br><br>We had a reservation for 9 people. Before we were seating we were shown to a highboy at the bar. A waitress greated us and asked for drink orders even though we waited until we sat down.<br><br>Once seated our waitress was GREAT! she was patient with our large party and offered great suggestions for apps and drinks. Once the food came we all were pleased. We did a table share and were all pleased with our choices. I am a whiskey drinking so the craft cocktails were on point!<br><br>I can't wait to go back and try this place for dinner. It is a good place for a date as well as girls night out! <br><br>Oh and how can I forget this, The music was FABULOUS!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rr6UvCYD4biq5wDWZicx9Q/168s.jpg", "caption": "Shrimp bisque and French 75"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bjO4FQCjNdtcGVHYCbkhoA/168s.jpg", "caption": "Very diverse menu"}]}}, {"review": {"des": "This place is a hidden gem in River North. Lying mostly underground, the Franklin Room was an intimate and tasty experience, I'd definitely recommend it for a date, dinner or just drinks. <br><br>To start off, they have a phenomenal happy hour. Unlimited $1 oysters! We got 12, and if you ask my boyfriend, should've gotten 12 more. They were so fresh, served with lemon ice and a spicy chili sauce, really kicks the appetite into gear- which is perfect considering that the rest of the menu is also amazing. To top off the awesome oysters you'll have for happy hour, this place has pages upon pages of whisky along with a solid list of cocktails, which the waiters were very knowledgeable about. <br><br>To eat we had the smokehouse burger and the squid ink pasta. The burger was juicy, cooked to perfection and oh so flavorful. The pesto squid ink pasta was unexpectedly light and fresh! The pesto sauce was thick but really complemented the sea food in the pasta perfectly. <br><br>Price wise, this place is a solid middle ground. Not expensive but definitely not cheap. Most importantly, totally worth it!", "pics": null}}, {"review": {"des": "And the award goes to...<br><br>Trendiest plating job: that deconstructed banana split dessert on a chilled platter!  So pretty and so healthy (bananas AND strawberries, hello!).<br><br>Highlight of the meal: the rich, creamy parmesan black rice mushroom risotto!  I added lobster, which was a great decision.  Note that you will get 5-6 bites of lobster for $12.<br><br>Most forgettable dish: the brussel sprouts side.  Just kind of boiled and bland.<br><br>Biggest service surprise: the waitress automatically split our checks for our party of 7!  Nice!<br><br>Most pleasant bargain: $1 oysters were available from 5-6:30pm!<br><br>Most misleading menu offering: the cauliflower tots.  We were expecting shredded cauliflower (or a blend of shredded cauli and potato) fried into the traditional cylindrical tot shape, but these were just like cauliflower tempura.  The little heads were lightly battered and fried.  Tasty, but not necessarily tot-like.<br><br>Shameless plug: Spot Hero, for having $10 multi-hour parking spaces available in the lot across the street!<br><br>For the price point and overall quality and taste of food, this one'll have to be 3 instead of 4 stars.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ag7oTY1OHG4_0swUH6pwDw/348s.jpg", "caption": "Oysters"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Bf7pJrn41ktxgHAbbpVjCw/168s.jpg", "caption": "Cauliflower tots"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hoF25ot_Pr9D3KSg35WmsQ/168s.jpg", "caption": "Cauliflower tots"}]}}, {"review": {"des": "Never had a bad experience, good food, good drink, nice environment. Most recently I placed an Uber Eats order and the driver forgot two items. I called the restaurant and they handled it without hesitation.", "pics": null}}, {"review": {"des": "We had a fantastic meal at The Franklin Room! The place is small and has a sexy speak easy feel to it. Our arrival during their daily happy hour meant we could enjoy the $5 sparkling wine along with the most delicious $1 oysters...the oysters were perfection! The steak frites were cooked exactly as ordered and had excellent flavor. Will definitely return when in Chicago!", "pics": null}}, {"review": {"des": "Update: Shortly after posting my review, the manager called me offering a gift card to come back again and show me an improved experience.  I lost his number, so didn't take advantage of that amazing offer, but I think that shows some awesome customer service and I think The Franklin Room deserves another star for that.", "pics": null}}, {"review": {"des": "What's not to like here. Nice atmosphere with a great happy hour deal on oysters. These $1 oysters aren't your typical HH, they come dressed to perfection. <br>Drinks are great here as well. A++ job by the bartenders.<br>We tried the cauliflower tots and the mussels as well and wow I have to say I was blown away. Wasn't expecting much but these were phenomenal. Portion size is great too. <br>Will definitely be back for happy hour and apps but after that stellar first experience I'm more looking forward to trying them for dinner!", "pics": null}}, {"review": {"des": "I ordered through Uber eats. A burger with side salad and cheese curds. I received fries instead of the salad and a TINY order of cheese curds.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6mq2Ud0jsHxY3oid8Igcmg/348s.jpg", "caption": "This was my $7 order of cheese curds!"}]}}, {"review": {"des": "Came here for happy hour oysters based on a recommendation from a friend and they didn't disappoint. Franklin Room is a casual, dim-lit space that's in the basement. Tables are close together, so not one of those romantic date places. Oysters were great, they were fresh and tasty! I honestly don't remember what else I ordered, but I had a great time and look forward to coming back.", "pics": null}}, {"review": {"des": "I am at a loss for words. This place is nothing short of amazing. Started out the cauliflower tater tot's which was heaven in the mouth. Then we decided to split the king crab dip as well as the surf and turf burger. Im not a beef burger person, but omg. This was amazing. I highly recommend. The staff was also great. The lunch specials look great soooo we will be back.", "pics": null}}]}