{"name": "the-art-of-pizza-chicago", "reviews": [{"review": {"des": "My favorite deep dish pizza. There are several things I love about this pie, including: 1) good ratio of bread, cheese, and sauce meaning there is a lot of all three; 2) a sweeter sauce than other restaurants; 3) good use of herbs and spices - definitely not bland here. My personal favorite is the spinach stuffed pizza. <br><br>The slices are large and prices are low. Highly recommend coming with a group. Pizzas normally take about an hour to bake, so I recommend ordering ahead of time. <br><br>After reading other reviews, it seems that the pies are significantly better than the individual slices - and this makes sense since pies are served straight from the oven. If you come, get the whole pie to get the best experience. <br><br>Art of Pizza is a much more casual restaurant than other deep dish pizza places. You order at the counter (or call ahead) and grab a table. There's minimal table service. As a note, they have nine parking spaces right out front.", "pics": null}}, {"review": {"des": "We accidentally ordered a thin crust pizza, when in reality wanted a stuffed pizza.<br><br>Either way, was not disappointed. Their thin crust is so good, i cannot wait to try to the stuffed pizza.<br><br>Definitely recommend this pizza place to everyone.<br><br>Thanks,", "pics": null}}, {"review": {"des": "Ehhhhh... okay so I know I might be skinned alive by Chicago natives for saying this but as a Bay Area native and current resident, I can tell you that there are A LOT of good deep dish pizza restaurants coming up in the Bay Area that are pretty darn good, so maybe my standards are getting higher... but overall, I was pretty underwhelmed by this place...<br><br>I was staying nearby and a friend recommended this place so I thought I would give it a try. I was happy when I saw that they had pizzas by the slice but quickly learned that they only had the basics (sausage, pepperoni, or cheese) by the slice and everything else including their special had to be ordered as a whole pie. I didn't want to be basic so I got the special.<br><br>Although you can't really go wrong with pizza, especially deep-dish pizza at that, I was quite let down with what I ordered. It was basically a glammed up-deep-dish version of a simple takeout pizza with sausage, onions, and green peppers. The taste was no different than what you would expect from a pizza at a chain-pizza store. I left thinking of this place as the Domino's of Chicago deep-dish pizza. Ironic, considering that this place has been recognized by several newspapers as being the best deep-dish pizzeria in Chicago. I was honestly irritated by the fact that I had leftovers... something that never has happened to me before... which actually brings me to my next point which is that this place should seriously consider offering their combos/specials by the slice. I would have definitely preferred getting a smaller amount than a full pie and I would say more people enjoy the combos than only sausage, pepperoni, or cheese.<br><br>It concerns me a little that this place in a town of deep dish pizza lovers has such glowing reviews. Again, maybe I have just gotten more picky about deep-dish pizza since I can get a good quality pie back home, but I'd definitely go to Lou Manalti's over this place any day I'm in Chicago.", "pics": null}}, {"review": {"des": "I am very surprised how many great reviews this place has, I went there and I ddi not think that the good reviews were translated to truth here. <br><br>it is a spacious place and has nice ambiance and sitting for a grab and go pizza place.<br><br>we saw that there is plenty of street parking here so we were able to drive and park with no issues. <br><br>the pizzas here are sold by the pie and slice. <br><br>we got one of the deep dish slices and we were not happy about it. the pizza was not fresh at all. <br><br>I have not much to talk about we just had the slice and were unhappy and left.<br><br>the pizza sits around in the heater and that is it. not impressed.", "pics": null}}, {"review": {"des": "Art of Pizza is great. <br>They have pasta, pizza, salads - you name it. Its fresh and delicious every.single.time. I have been here probably 10+ times. The only place I see room for improvement with this place is the cleanliness of the tables and bathroom but it's really not bad..... There is usually pizza and crumbs on the tables but there really is no wait staff. The employees behind the counter are great and always friendly. I will keep coming back for sure. My kids love this place too!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4wC7PDWZDVz0dd0vAsRUcA/348s.jpg", "caption": "Stuffed pizza, a caesar salad with chicken and regular cheese pizza. Yum! The perfect lunch."}]}}, {"review": {"des": "Fyi came here after a booze filled St Pattys Day. So my judgement might have been skewed by a couple Irish Car bombs, and Jamesons. Although what I do remember from this Saturday is \"The Art of Pizza\" is pretty damn good. <br>      We were about to call in an order but they said it would take an hr, so we went there hoping they had some ready to eat slices,and they did. Had the deep dish sausage, and thin pepperoni. I'm more of a deep dish guy, but both were great. <br>     No disrespect but no one has mastered the art of pizza like Lou Malnatis, then Peqouds, although this spot can very well come in third. I will have to come back here again sober, but Art of Pizza was a deff hit!!", "pics": null}}, {"review": {"des": "The best Deep Dish pizza in Chicago by a *distance*. One of the best by-the-slice Pizza shops you'll ever find. If you only eat pizza at one place in Chicago - eat it here.<br><br>There's even a prayer about it:<br><br>Our Father, who Art Of Pizza,<br>hallowed be thy taste, <br>thy crust is browned, <br>thy will be done, <br>on earth as it is in Lakewood. <br><br>Give us this day our daily pizza bread. <br>And forgive us our past visits to papa johns, <br>as we forgive those<br>who visit pizza hut. <br><br>And lead us not into chuck e cheese's, <br>but deliver us from domino's. <br><br>For thine is the crust, <br>and the pepperonk, and the gooey mozzarella, forever and ever. Amenu.<br><br>No really, could I get amenu?<br><br>*** There's also a rap about it ***<br><br>If you like pizza chains, please don't even START<br>You'll come here instead, at least if you're SMART<br>If you think Chicago Pizza's NYC's crap COUNTERPART<br>It'll pull your preconceptions APART<br><br>Sure the locals treat deep dish like a FART<br>And haven't taken their own city's Pizza to HEART<br>Uno's bad, Giordano's good, Lou's is a work of ART<br>But Art Of Pizza makes them all taste like WAL-MART<br><br>Papa John's is Mr.Burns, this place is BART<br>Pizza Hut is prudish, this place is a TART<br>Domino's is dishonourable discharge, this is PURPLE HEART<br>DiGiorno missed the hot 100, this topped the CHART<br><br>Cici's was an extra, this was the LEAD PART<br>Little Caesar's soiled its pants, this didn't even SHART<br>Red Baron's pop Philosophy, this place is DESCARTES<br>CPK's Dover Delaware, this place is STUTTGART<br><br>The best part is, a slice just $3 A LA CARTE<br>Bigger than Roseanne, or the dragon in DRAGONHEART<br>So big it makes The Rock look like NAPOLEON BONAPARTE<br>If you want Chicago Pizza, you must go to THE ART<br><br>WHART!<br><br>Speaking of big, after food, you can ride my love DART<br><br>What to get: A Slice - all of them are amazing. Meaty Delight is my fave.<br>What not to get: Sucked in by the 3-part miniseries about this place, which spawned several seasons of a mockumentary-romcom-sitcom on TNT (\"The Story-Arc Of Pizza\")<br><br>The best slices of Deep Dish Chicago Pizza you will ever eat. Makes the hipster places (Pequod's, Martino's, etc) seem bland AF. Makes Giordano's and Lou's embarrassed they don't serve slices. Makes Uno's feel worthless and suicidal.<br><br>If there were 2 slices of every kind in here, to preserve the existence of those pizza types after the catastrophic flooding, then it'd be \"The Ark Of Pizza.\" And Harrison Ford would show up and whip everyone into shape. But it's not.<br><br>Art is a very good way to describe this incredible pizza. It's thick and it's tasty, and everything that goes into it seems to be perfect. My only complaint is that it's a tiny bit dry, but then so is your sister when I'm not around, and then so is all deep dish pizza. <br><br>If it were in St. Louis, it'd be \"The Arch Of Pizza.\" If it were in a church, it'd be \"The Arch-diocese Of Pizza.\" And if it were a salad bar, it'd be \"The Arch-Enemy Of Pizza.\"<br><br>If you're really not a fan of deep dish pizza as many local Chicagoans are not then they do have regular type Pizza that you can enjoy which honestly I have yet to try because every single time I end up eating a slice of the deep dish because it is so damn good and they have about 10 different types of it and I just can't get enough of it or of run on sentences for that matter but yeah I just can't get enough like Depeche Mode said.<br><br>If Paul Simon used to be co-owner, and then quit, it'd be \"The Art Garfunkel Of Pizza.\" And if it were full of old people, it'd be \"The AARP Of Pizza.\"<br><br>Other than the amazing quality and taste, the best part is that they do offer pizza by the slice and it's very affordable. Chicago does not have a lot of pizza-by-the-slice places, especially not the good ones, or the deep dish ones. For what you get (the size and standard and filling-ness) when you order a slice, it should be more like seven or eight dollars, to be consistent with Chicago prices. But it's more like four dollars, and one slice will totally fill you up, and might even be enough to share.<br><br>I wonder if they have any artichoke slices. I only ask because I'm allergic to them, and I'm also allergic to classical paintings. When I see Art, I choke.<br><br>Most places around here are too pretentious or traditional to offer slices of deep dish. Not only does Art Of Pizza have the slices, but they happen to be some of the best deep dish slices you will ever taste. Right up there with Lou Malnati's. When you are in Chicago, if you only try pizza at 1 place, try a slice from here. If you try 2 places, then give Lou's a try... the best of the chains. A deep-dish personal pizza there is under $10. But nothing will ever compare to Art Of Pizza.<br><br>And if it were Turkish, it'd be \"The Ankara Of Pizza.\" And if it it sold rice balls, it'd be \"The Arancini Of Pizza.\" OK, this is getting stupid.<br><br>And if if it were named after the kinds of scenes my gf gets paid twice as much for when shooting porn in London, it'd be \"The Arse Of Pizza.\"<br><br>Ahem.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vxV4BpbxDjlIpUvhhzE5Yw/348s.jpg", "caption": "The art of photographing pizza"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OD6vMDAjfNKoLiaMU8HiCA/168s.jpg", "caption": "Now that's what I call art"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/H-qtnu7b8-NH3VWEbCcR9w/168s.jpg", "caption": "The colours are so coordinated"}]}}, {"review": {"des": "I love the art if pizza...<br>The managers have to go...<br><br>I've tried not to order from them.<br>I'm running out great pizza places. <br>We've ordered  and have received wrong order...they refused to fix the issue ..<br>I order according to the taste of my husband and granddaughter..<br>1/2 cheese..1/2 sausage..<br>Never happened..<br>Their justification was that we received a bigger pizza  pepperoni...<br>My granddaughter finds it too spicy..<br>It's not the money..I would rather pay for quality..then get garbage...<br>The pizza is not the issue..its the quality of service..<br>It's horrible...<br>Oscar is the manager...who really needs to step it up as a manager.<br>Businesses are crumbling..its all to do in part of management and employees...<br>Today we waited an 1 hour and 1/2..for a medium thin crust pizza and 1 liter of pop..<br>Shame...shame...shame<br>Ps..never received our soda", "pics": null}}, {"review": {"des": "A wise man once said \"One does not simply leave Chicago without devouring deep dish pizza.\" After countless subpar deep dish pizza experience in Seattle, I ventured out to the windy city where the unique pizza was invented 7 decades ago. <br><br>Chicagoan yelpers had come to my aid and suggested numerous places. One of them was \"The Art of Pizza.\" I later found out that this place was voted as #1 Chicago deep dish pizza by Chicago Tribune and Thrillist. <br><br>What I love about this place is that you can just purchase pizza by the slices. No more arduous 30-40 minutes wait when your tummy is growling out of hunger. At the same time, you can also try different flavors/toppings with each slice. And that's exactly what I did.<br><br>I got pepperoni, sausage, spinach and mushroom, and just cheese. They all got me hooked at the very first bite. The golden thick crust was perfect but ultimately the sauce from this place did the trick for me. It's subtle and herby yet packed with flavor. Sauce from other joints is usually either too sour, bland, or overpowering. I enjoyed all 4 slices but my personal favorite is the spinach and mushroom! <br><br>If you're looking for authentic deep dish pizza experience, \"The Art of Pizza\" is the answer!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RYjsa1oxgpoD0mG1KHhrAw/168s.jpg", "caption": "Spinach and Mushroom"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8A9eAnzXySp_-2D6K9W-CQ/168s.jpg", "caption": "Sausage"}]}}, {"review": {"des": "The pizza here is divine.  This location is a little outside of the city, but the drive is worth it.  This place is so much better than all of the franchise spots around the city.<br><br>The tomato sauce taste homemade.  The toppings and cheese are outstanding.  The crust is buttery and cooked to perfection.  One large pizza was more than enough for the two of us.<br><br>We got the Art's Meaty Pizza.  Everything taste homemade and the meats all worked in harmony with the cheese and sauce.  I would definitely go back again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MBHOsZJRHuYtfnxhT_IqwQ/348s.jpg", "caption": "Art's Meaty Pizza"}]}}, {"review": {"des": "I'm so mad at you, Art of Pizza! So mad because I live in Orlando and you're all the way in Chicago!<br><br>This deep dish pizza is marvelous, chock-full of cheesy goodness and great sauce! We ordered bacon and pepperoni, and while I wish the toppings were a little more abundant, the pizza itself was terrific!<br><br>Even better was the fact that it was about 17° in Chicago and they delivered right to my door!<br><br>Thanks, Art of Pizza! Now, if you wouldn't mind, would you please deliver to Orlando...?", "pics": null}}, {"review": {"des": "I can say with all honesty tht I have never tasted a pizza this good in my natural life. I got the deep dish and I was not expecting to like it Bcz it seemed to be something tht I usually wouldn't go for but keep in mind I'm not from Chicago and I grew up on Pizza Hut and dominos. Let's just say tht I can never look at Pizza Hut the same Again. This has been the most delicious place I've been to since here. I want to come back everyday before I leave town lol the cheese ws so stretchy the bread soft but crisp and the sauce ws just perfect. Tht I didn't add a pic let's u know I couldn't even wait to devour it lol if ur looking for yummy pizza in Chicago. Come here. U won't regret the deep dish. I got the Italian sausage deep dish btw.", "pics": null}}, {"review": {"des": "The Art of Pizza conveniently offers deep dish pizza by the slice and it is an amazing pizza. I like sausage and my wife likes pepperoni, so instead of ordering an entire pizza half and half, we can just order by the slice. And then everyone's happy. Everything about this pizza is just simply amazing. The crust was delicious. The sauce was perfect. It was also very cheesy and decent amount of sausage. What's great is that they're already made so you also don't have to wait 45-60 minutes for your pizza to be made in which you're going to only eat a couple of slices from anyways. <br><br>If you haven't tried the Art of Pizza I would highly recommend them. Trust me. You won't be disappointed!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EF00X22qhz3wz1hAsAm6XA/348s.jpg", "caption": "Sausage slice"}]}}, {"review": {"des": "I want to say as a caveat that I did not order a whole pizza but got a few of their premise slices.<br><br>This has been rated number one deep dish pizza in Chicago. One of the pluses of this establishment is that they sell deep dish by the slice which means there is no associated typical hour long wait we usually have to suffer through before digging in.<br><br>That being said I thought the pizza here was just okay. I didn't think it was particularly fantastic and found that the sauce was a little more on the sweet side that I personally would have liked. <br><br>I also got a slice of thin crust pizza which I felt was also pretty standard. It was good but definitely did not live up to the hype generated by all the rave reviews here.<br><br>I really this place is not bad. If you're in the area and want a slice of deep dish definitely stop by but I think there is better in Chicago that is probably worth the effort and wait.", "pics": null}}, {"review": {"des": "Darn good piece of pizza. I like that they sell by the slice because 1 slice of deep dish is all I can handle. Only ding is the crust is a little bit thicker than I like. Pizza is always consistent though. They have a parking lot which always earns a star from me. The service is friendly. There's lots of seating inside.", "pics": null}}, {"review": {"des": "So this is a long overdue review. But after running the Chicago Marathon and eating 3 different deep dish pizza's this week already (Pequods, Giordano's, Gino's East); I figured I should review The Art of Pizza. I have ordered delivery and carry out at this place twice before, but I have never dined in so this review is for food only. <br><br>In my opinion for the search of the best deep dish pizza place in Chicago, I have ranked the Art of Pizza the best. I still have a few other places to try, but here are my rankings to date: The Art of Pizza, Pequod's/Lou Malnati's, Giordano's, Gino's East, and Nancy's Pizza. Piece Pizza might be my favorite overall, Roots and Connie's Pizza are very good as well. <br><br>My last order was a spinach, green pepper, and tomato pizza as I was trying to eat \"healthier\" before the Chicago Marathon back in September. I think The Art of Pizza has the best tomato sauce, 2nd/3rd best toppings, and 2nd/3rd best crust. The tomato sauce is thick enough that it won't make the pizza messy or fall apart. That's what is great about The Art of Pizza, Lou's, and Giordano's. You can definitely taste the basil in the sauce and I think the sauce is sweeter than other places. The crust is flaky/crunchy and the toppings are fresh. I did notice that when I had Pequod's this week that the bottom crust was quite dry so I decided to knock a star off since now I don't think it deserves 5 stars. But don't get me wrong, Pequod's is still solid overall. <br><br>I have never ordered pizza by the slice, but yes, you can order slices of deep dish pizza here for about $4, which is quite a bargain in Chicago. I will have to come back and dine in at some point and I highly recommend eating at The Art of Pizza.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PqYNISPcVuR8fRDYQRMLQw/348s.jpg", "caption": "Medium Pepperoni and Spinach Pizza"}]}}, {"review": {"des": "This is hands down my favorite pizza place in the city. I'm actually a little more upset with the fact that it took me so long to leave them a review. I come here every chance I get. I actually found this place completely by accident as I was in search for a baccis pizza. Bit that's a story for another day. I don't care what anyone says but I truly believe the deep dish pizza at Art of Pizza beats out all of the rest. It is better then Lou Malnatis, better then Ginos East, I will also say it is better then Pequods. Giordanos is not even in the same ballpark as Art of Pizza so I won't even entertain that argument. But anyway, back to the pizza. The sauce is a bit tangy and sweet but not too sweet, the cheese is consistent throughout the pizza, and the dough is not overdone. There is the right amount of sauce, cheese and crust in every bite. I live on the northwest side of Chicago, and I will drive out of my way for this pizza. They even sell deep dish pizza by the slice which I think is awesome. My go-to is a deep dish slice of spinach and mushrooms with a thin crust slice of pepperoni. You can't go wrong there. The service is always quick, and friendly.  I have always had a good experience here. I will continue to bring my business here, and I highly  encourage anyone who loves pizza to give this place a chance. They will not let you down and you may just have a new pizza place.", "pics": null}}, {"review": {"des": "THANK YOU ART OF PIZZA. Before you, I had lost my faith in the holy mecca that is deep dish pizza. Every single place had been a disappointment and the deep dish I imagined in my mind was nowhere to be found. But good fortune favors the persistent - I stumbled upon you (ie: bookmarked you on Yelp).<br><br>First, I love that you can buy deep dish by the slice. For $4, you have the option of going with just 1 other person and not have to argue over which toppings you want (you can even bring that vegetarian friend!). The options are pretty solid: meat lovers, sausage, pepperoni, cheese, mushroom + sausage, mushroom + veggies. The slices are kept warm so no wait required, unlike when you order it by the pie and have to wait 40 minutes for it to cook.<br><br>Second, the pizza is actually really good. The cross section shows a beautiful layer of ingredients in their perfect proportions. I got pepperoni and meat lover's. I preferred the pepperoni because I realized that the bacon + sausage in meat lover's was just too heavy for me to enjoy in deep dish. The tomato sauce on top was just amazeballs. Towards the end of the 2 slices, despite my overwhelming fullness, I found myself still scraping up the leftover sauce on the plate with each and every bite. I liked the crust here much better than other deep dish joints as well. It's not too thick that it's overpowering the main attractions, while at the same not too thin that the sauce and cheese on top can't hold together. <br><br>Seriously - my only complaint (surprise surprise) is that the slices could be served a tad bit hotter. I get that they want to keep it warm so that it's ready to eat ASAP, but by the time I finish my 2 slices, the cheese was starting to get cold and that's no bueno. <br><br>I really appreciate what they've done here. Differentiating themselves from the typical Chicago deep dish joint through its fast food vibe, they're really catering to a loyal and local crowd. As long as they keep up the quality ingredients, respectable ratio of crust to sauce/topping, and no-nonsense approach, I will be back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wanQRMwmn4tCBqumBjmh3g/348s.jpg", "caption": "$4 for a slice of deep dish! Has my stamp of approval"}]}}, {"review": {"des": "Food great deep dish by the slice and offer options not just cheese or sausage. Was hot, good, service was excellent, they have a parking lot just was full when I got there but the place wasn't full.. place was also clean.", "pics": null}}, {"review": {"des": "I've been here about a dozen times since I moved to Chicago, including three times in the last six months...this is my steady go-to for both pan pizza (kind of a tweener between thin and deep dish) and proper deep dish, as well as slices and lunch specials.  And the pan that is my favorite?  Art's Meaty Delight...there's WAY too much meat on this thing, but somehow, the crust holds it all up and the taste is amazing.<br><br>Already looking forward to winter, since that's when I make more trips to this spot.  Now with a friend living around the corner, I've got more reasons to come through!!", "pics": null}}, {"review": {"des": "Im the owner of Pizzeria about 3 miles north of here. I dont make deep dish. When friends come in town, i take them to Pequods. Well after attending a Cubs game, we headed on over to Pequods where there was a 35 min wait. So i finally got around to trying Art of Pizza, which has a stellar reputation in the business. Loved it..Stuffed Pizza on par with Pequods. Amazing sauce and crust. Great friendly young crew..this is no frills place..which is my style. Prices are solid. PORTIONS are generous. Cauliflower in a chopped salad?? Love it. Guys like me who have been making pizza for a living 20 yrs dont pass out pizza compliments easily. Art of Pizza is legit great. Recommended.", "pics": null}}, {"review": {"des": "Terrible service.  Ordered a stuffed pizza and waited an hour and a half.   Some guy from Art of Pizza calls me 90 minutes after I order telling me they aren't delivering my pizza because they screwed it up.   Do I want to wait another hour and a half and they'll send me another pizza?   Gee seriously?   No can't wait another hour and a half.   <br><br>Art of Pizza didn't even bother to have a manager call me.  Just some non empowered employee who can't answer any questions and doesn't know anything.  These guys really don't seem to give a damn about customer service as the manager can't be troubled to talk to customers because he's very busy.<br><br>Plenty of pizzerias in Chicago that don't screw up the basics and understand basic customer service.   First time and last time customer.", "pics": null}}, {"review": {"des": "Ordered a whole stuffed pizza with my group (of 3). We were told it would take about 45 minutes to make, and it was ready in the dot.<br><br>The pizza was great, but we definitely couldn't eat more than one slice each. With eyes bigger than our stomachs, we boxed it up and hoped to hand it off to a homeless person but didn't find any and had to toss it (tragic).<br><br>Moral of the story, go here but buy it by the slice if there's only a few of you.", "pics": null}}, {"review": {"des": "I was a frequent customer for some time, their pizza is above average but seemed to vary by the night. However, they once delivered meat sauce to me (I'm a life-long vegetarian) and agreed to resend the dish with marinara sauce, but it came with meat again. They agreed to give me a credit/refund but never did, even after I called to speak with a manager 3 times. Will never order again from here, not worth the risk.", "pics": null}}, {"review": {"des": "Ok, so the pizza is good. Nothing special, but it's feed the kids. Let's talk about the real deal breaker...the service. There was no one around when we walked in for a solid 3 minutes (see picture of us waiting for someone). Someone finally came up and seemed annoyed to even help us or even give advise to a first timer. So it's a pan pizza, and he said it would take about 50 minutes. 75 minutes later they finally roll out the pizza. Never would come here again! Not worth the wait.", "pics": null}}, {"review": {"des": "When I first moved to Chicago in 1999 I lived just down the street from Art of Pizza, and it was my go to for a quick slice, either thin crust or deep dish.  It was one of my first Chicago food experiences and it was amazing.  I was a convert and regular.<br><br>Eighteen years later, I live farther West and don't get over here so often, and more's the pity.  The pizza hasn't changed at all.  In fact its as good as the day Art birthed it into existence.  <br><br>What makes the pizza so good is the slightly sweet sauce, the massive amount of cheese, and the big hunks of toppings - earthy mushrooms, crunchy pepper, fennel flecked sausage.  All surrounded by a crust that has the chewy and the crunchy harmonizing exquisitely.<br><br>The pan pizza is one of the best in Chicago, but their thin slices are just as good, with a chewy substantial crust that is crisp around the edges. <br><br>Over time the Empire of Art, like its reputation, has grown.  It has expanded from its original tiny walk-in to overtake the entire mini-strip mall, like a mozzarella octopus.  Additionally, now the South Loop gets to experience the bounty of Art.  I for one welcome our new pizza overlords.", "pics": null}}, {"review": {"des": "Deep dish pizza by the slice!! Yes that's right - no more waiting an hour for a table and then an additional 45 minutes for your pizza to come to you.<br><br>My boyfriend and I went here and got 2 slices of the Art's Meaty Delight deep dish ($3.95 each) and a piece of french bread ($1.75).<br><br>Since it was a Tuesday, their special was a meatball sub for only $3.99!! I was so excited because I love a good meatball sub. I asked the cashier what I should get, a meatball sub or a slice of deep dish. He replied in his naturally monotone voice \"well, we're known for our pizza so...\" haha I love it. So honest.<br><br>All in all, the pizza wasn't piping hot - or even hot. It was just warm.. I would have loved to take it home and pop that sucker in my toaster oven (that I just bought from FB marketplace for only $10! I'm sorry, I'm so excited, what a steal that was) to make it more hot and have a crispier crust. For only $3.95, the quality of meat and sauce was definitely there though. Only complaint was that it wasn't hot but just barely warm.<br><br>The garlic bread consisted of butter and garlic powder. Not too much of a fan since I prefer real garlic but the boyfriend had no complaints.<br><br>Would definitely come back here for a slice to-go! So inexpensive!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0gASuDY-oxB5cSh2mNSDlg/168s.jpg", "caption": "garlic bread $1.75"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EKHaOyYPo-d7FkjTPA90wQ/168s.jpg", "caption": "$3.95"}]}}, {"review": {"des": "I like the stuffed puzza here, but I won't get the thin crust pizza again.<br>There are slices always fresh and hot here. It's convenient and quick. If you drive, there's a loading zone a block north where you can park for 15 mins.<br>Bottom line is thin pizza crust is doughy and chewy, not crisp and thin. <br>The stuffed pizza is really good though. I always get an extra slice to throw in the freezer for a good gut bomb snack.", "pics": null}}, {"review": {"des": "And the winner of the Matt's Choice award is The Art of Pizza. <br><br>Unbelievable pizza that lets you order by the slice. Always has a good variety of pizza by the slice or wait and watch some family feud on tv while your mouth waters. <br><br>If you want a quick slice and aren't looking to impress someone with a fancy scenic dinner Art is the spot. When pequods has a 3 hr wait... you can either go to the movies with your buzzer hoping it will not go off when Thanos is fighting the Avengers... or you can blow that fish tank and head to art for a slice! <br><br>Pepsi Products on fountain<br><br>Super fast Delivery times(great estimations) and the food has always been fresh. I've order 10+ times roughly 3 miles away and they always hit the nail on the head<br><br>Available on Food Delivery apps and Delivery is confirmed.", "pics": null}}, {"review": {"des": "Pretty legit deep dish pizza.  They do have slices of deep dish you can buy.  We wanted our own toppings though.  We got pepperoni, bacon, and jalapenos.  The jalapenos were fresh and spicy.   The pizza was fantastic.  The cheese was so good.  We're definitely coming back here.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eCE3lSc8ZfJIiErE1VTE0g/348s.jpg", "caption": "Our own toppings deep dish"}]}}, {"review": {"des": "I used Art of Pizza for my daughters' birthday party and everyone loved their food.<br><br>I have been in love with their pizza but I ordered their fried chicken, mostacolli, and lasagna. Oh  my gosh it was so good. <br><br>People took home leftovers.<br><br>Love this place :)", "pics": null}}, {"review": {"des": "Holy expensive salads!  $17.00 for a Cobb salad with chicken!  Portillo's only charges 8 bucks, and it's ten time better.  <br><br>No thank you", "pics": null}}, {"review": {"des": "I love this place. Probably my favorite deep dish in the city. It's so decadently cheesy and saucy, you'll be in the happiest little food coma in no time. Bring a bottle of wine and some good company for the wait. You won't regret it.", "pics": null}}, {"review": {"des": "This is a hidden gem in Lakeview (Chicago, IL). Very delicious location to eat at if you are craving pizza; whether it is deep dish or thin crust, they do an amazing job with their pizza. <br><br>The do offer a per slice option for those who are just stopping by for a slice or two. Since deep dish does take awhile, they already have some made in advance. Might not be fresh out of the oven but it is still very delicious! <br><br>Great spot for lunch and dinner. Haven't been there for breakfast so I do not have an opinion on whether they have any break items or not. <br><br>Their lasagna dinner special on Monday is very delicious! Lots of food for the price! Haha. It comes with a salad/coleslaw and soup with bread.", "pics": null}}, {"review": {"des": "I've heard this place makes delicious pizza and just had to try it myself during my last Chicago trip. Unfortunately, they don't deliver to Downtown and their downtown location hadn't open yet. So my friends and I decided to order an uber to go to Art of Pizza, pick up a pie and head back to our hotel. It sounds like a lot of work, but honestly... it was SO worth it! This place knows how to make delicious deep dish pizza! <br><br>Once we finally got to enjoy this pizza, it was everything I wanted. It was delicious, hearty and cheesy. Just so dang good! So good, we saved the few slices we had left and brought it back to Madison, WI with us to enjoy later. Again, really good! I can't speak to their downtown location, but if it's anything like them, it's worth checking out!", "pics": null}}, {"review": {"des": "Have been coming to Art of Pizza for a while, but never ate in. Super good! Nice casual eatery and can't beat the pizza by the slice options!!! Got slice of stuffed spinach and mushroom, and everyone in our 8 person group got a different slice. For $4 each,  either thin or stuffed, you can't go wrong. My uncle loves the rib dinner special on Thursdays. Really great prices... will definitely come back!", "pics": null}}, {"review": {"des": "Your pizza is delicious.<br><br>My employer ordered several pizzas for a group/team-building shin-dig.  Yummy pizza.  I never had your pizza before that.<br><br>I went to your website a few days later, pondering maybe ordering for dinner... But sorry to say, I passed on it, because of the price.  Yeah, it's delicious.. but it's just flour/dough, tomato sauce, moz, and toppings.  You sure have it nailed down on how to make it delicious, but I just can't bring myself to part with $20-$25 for a pie. Sorry.", "pics": null}}, {"review": {"des": "This review is regarding the pizza by the slice - bottom line: not worth the calories. We went here on a Saturday afternoon for a few slices of the deep dish. The pizza is very bready, and the toppings, particularly the sausage, lacked flavor. I love a good crust so this was a big disappointment. I love the outer crust, however on this pizza it was nearly inedible. My husband and I did agree that the sauce was pretty solid. <br><br>Giving them the benefit of the doubt, I would hope that ordering a fresh pie would be a lot better but based on my by-the-slice experience here, I will never find out- I'll  be waiting in line at Pequod's.", "pics": null}}, {"review": {"des": "I am vegan, so I got the vegetable salad with the balsamic vinaigrette. I was with a group so I didn't want to get a pizza with no cheese, just for myself. My salad was a great portion for one person and it was actually pretty good. Won't lie, the pizza looked pretty good as well. They ordered both deep dish and thin crust. Hopefully, in the future I will have an opportunity to try the pizza without cheese!", "pics": null}}, {"review": {"des": "O Chicago deep dish pizza,  how art thou wonderful!<br><br>Had lunch here with my family on the day before Thanksgiving in between touristy activities in good ole Chi Town.  <br><br>I went with the spinach and mushroom slice since I usually take vegetarian options (or pescatarian) when eating out. WOW!  Delicious and gooey cheese.  Delicious sauce.  Perfect crust.  If I'm not mistaken, my host family member's paid 3.99 each for the slices.  My sweetie had some type of meat lover's slice and was so impressed with it.  One of my nephews ordered an Italian beef sandwich.  We waited quite some time for it.  When we checked on it, they had forgotten all about it.  They apologized and took care of it quickly.  <br><br>If I am visiting this part of town again, I would love another slice here!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Nr1hA9GNaBECPxKE0925SQ/168s.jpg", "caption": "Yummy slices of deep dish pizzas!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/R1Zhzjd5hpNGv4EUsQ7nBQ/168s.jpg", "caption": "Spinach and mushroom deep dish slice!"}]}}, {"review": {"des": "I'm so lucky to live close to The Art of Pizza. I'm no critic, but the artistry of their pizza is aesthetically yummy. The atmosphere is chill, the folks behind the counter are always cool, and the selection available for slices is stocked.<br><br>It's a go to spot for folks visiting who want deep dish, so that should say something!", "pics": null}}, {"review": {"des": "Really good deep dish pizza. The service is not great and it took awhile for us to get our food. We had the Art's Special.", "pics": null}}, {"review": {"des": "Art of pizza is really good. Like really damn good. I love this place. Affordable prices for deep dish by the slice???? That makes this place an anomaly, not to mention the deep dish is top quality, my favorite; perfectly thick and homogenous sauce, none of that watery ish that Lou's uses. Never too crowded and it attracts a working class customer base. If this isn't enough they also have delicious Italian-american dishes like spaghetti & meatballs or chicken Parmigan (all topped with their perfect sauce). Art of pizza is no frills and really damn good food. <br><br>Tip: if you're planning on coming here for pizza by the slice, the closer you come to 11am (when they open) the better. Deep dish doesn't age as well in a hot box because it's so thick that it's hard to keep warm throughout without drying out the crust (this is probably why most places don't do stuffed/deep dish by the slice), so if you want the best experience get there within a half hour of 11am, or just order a whole pizza so it comes out fresh.", "pics": null}}, {"review": {"des": "This place is AWESOME!!!!! You get pasta with a salad, bread and soup for under $10!!! Great pricing! And the food is delicious!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DYJ2b5aWSBODKYOKxV5lcA/348s.jpg", "caption": "The delicious spaghetti!"}]}}, {"review": {"des": "Through our exploring of Chicago we came across this place. And based on the reviews we had to try it. Its deff not downtown or near the attractions. When ubering it might be much from downtown with traffic.<br><br>Food: We got the spinach which was good 7/10. And the sausage and pepperoni which was also good 7/10. The crust was nice and crunchy. Unfortunately the night before we'd had Lou malnattis so this one fell short for my taste. <br><br>Service: Place wasnt full so we got a table and our food very fast. They wete very polite and recommended they're favorites.<br><br>Overall I would recommend but if back in town i am not sure i would go out of my way to get it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/s5JKq0FZhMETn7efFAFmww/348s.jpg", "caption": "7/10"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/aI97C8YzI1fJXmss26AUOQ/168s.jpg", "caption": "Spinach 7/10"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RI__HXrykB0oJuIaS9Aykg/168s.jpg", "caption": "Sausage and pepperoni 7/10"}]}}, {"review": {"des": "My first trip to The Art of Pizza was nothing short of traumatic. In a life of grand symphonies, 'twas a minor composition, but I remember it vividly. My usual dining partner was out of town, so I had the fourth floor apartment (our hobbit penthouse, if you will) to myself with nary a morsel of food about. I took it as an opportunity to eat the most unhealthy meal I could conceive, and deep-dish pizza immediately sprang to the front of my mind. Years ago as a tourist, I'd tried mainstays like Giordano's or Lou Malnati's. Both have their place, but I wanted a bit more of the local je ne sais quoi. <br><br>Climbing the steps back to the apartment with my 12\" Stuffed Meaty Delight (sausage, bacon, ground beef, pepperoni and sliced beef), I felt like an 18th century pioneer returning with an assortment of animal skins sure to delight the family. I was already dreaming of the food coma and quadruple bypass that was to come. The box had a good amount of weight to it and the warmth radiating from underneath promised my fight with rush hour traffic to pick up the pie wouldn't be in vain. I stepped into the kitchen, placed the pizza on the counter and opened the box to reveal my massive bounty. I peeled away a layer of aluminum foil and there it was. Its elegance made me want to weep, but I pulled myself together and reached into the cupboard to retrieve my sturdiest plate. Then, a sound I'll never forget and in an instant my perfect meal was ruined. In my mind's eye, I remember seeing the pizza hit the floor and hearing the thwack of cardboard against hardwood. The weight of the box that made the pizza inside so inviting was also its literal downfall. Just a few inches of the box hanging off the counter was all it took to create enough of an imbalance to plant it topping side down onto my kitchen rug. I sprang into action, threw the box aside and attempted to scoop up the slices. \"It's not too bad. I can save it,\" I foolishly tried telling myself. Each slice was hotter than the next and trying to rescue the fallen comrades barehanded was an exercise in futility. I fashioned some nearby dish towels into makeshift gloves and transported the slices as carefully and quickly as I could. It didn't matter the speed, for the damage was already done. With each slice I pulled from the kitchen floor, dirt and pet hair came along too. I fell to my knees screaming! Why had life dealt me such a tragic blow? I sat and cradled my precious pizza for what seemed like hours, the salt of my tears would be my only sustenance that day. I yearned for the chance to do it all again. But would it ever come?<br><br>I got lucky. After months of twice-a-week therapy, I gained the courage to order from The Art of Pizza a second time. Fingers trembling and voice unsteady, I made the call and again requested a Stuffed Meaty Delight. I knew if I drove to pick it up myself that I would likely have a panic attack along Ashland Avenue and swerve straight into oncoming traffic. I made the brave decision to have Art of Pizza deliver to me. When the driver arrived, my heart was beating so loudly I was sure the neighbors down the block would call the police to report a noise disturbance. I threw money at the driver, snatched the pizza away and clutched it to my chest.<br><br>I arrived in the apartment as the beads of sweat begin falling from my forehead. I placed the pizza on the counter and quickly backed away. Everything was steady. So far, so good. One wrong decision or minor oversight would result in yet another trash pizza. I crept slowly toward the box and opened it like a bomb squad diffusing an explosive. The aluminum foil was there just as I remembered. I carefully peeled it away as if undressing a faberge egg. Steam rose. It was nothing if not piping hot. I picked up the nearest slice, slightly burning my hand but still finding the strength to press on. Endless strings of cheese held onto the adjoining slices, but my other hand acted as a machete in the jungle and freed my chosen piece. It was thick in all ways and means with a slab of bacon laid across the top. I took a bite and was struck by the realization that months and months of hard work had finally paid off. To say my dream had come true would be a vast understatement. The gravity of the situation hit me and I began to sob uncontrollably.<br><br>Yes, dear reader, I understand that this tale may seem like the stuff of legend. I understand that what I was chosen for would be more than most men (mortal or otherwise) could achieve in 10 lifetimes. I understand that what I have accomplished will live on eons from now. There's no need to thank me. All I ask you for is a new kitchen rug. You see, my current one has a big, red stain on it. <br><br>Food: ****<br>Atmosphere: ***<br>Service: ****<br>Overall: ****", "pics": null}}, {"review": {"des": "We stopped in Chicago on our road trip out west. Of course we needed to get deep dish and The Art of Pizza was exactly what we were looking for. We got a delicious, filling slice for less than $5! If you're looking for an upscale restaurant this probably isn't your spot. They don't lose any stars though because they nailed the pizza joint aesthetic and taste they were looking for.", "pics": null}}, {"review": {"des": "While the pizza was certainly yummy, I was not a big fan of the crust.  Perhaps, I'm still thinking of Pequod's version.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DicyDF4-4NoRqRB-IDgBLw/348s.jpg", "caption": "Yum,  \"Art 's Special\" !"}]}}, {"review": {"des": "I love this place!!!!! They serve pizza slices ALL DAY! So whenever you get hunger pangs, you can get yourself a slice and not feel over full/too stuffed. They serve thin, pan, and deep dish slices of all varieties. Make sure you try the spinach and mushroom deep dish if you go. <br><br>They also have daily specials and I've tried the ribs (Sunday special) and even those were good and saucy + very tender. <br><br>I'm so happy to have found Art of Pizza!", "pics": null}}, {"review": {"des": "Loyal customer to this restaurant for 3 years and then one day an employee named Oscar tells me he made a mistake with my order and sent money into my account rather than out and could I make amends of the account and give him back the money he accidentally put in and pay for my bill the bank when I call the bank and then what else so because he did this 24 hours later or made a mistake the money I put the money in your account which rent money was paid to the restaurant my order was paid in full but this trying to tell me I needed to pay for the money they sent back and it still pay for my order essentially trying to get me to go pay for that order so I said they got the goods this conversation is over", "pics": null}}, {"review": {"des": "Review #1000 is a 5 star rating! The service folks were very nice and helpful with menu suggestions. They brought waters and food right to your table.<br><br>I ordered spinach, mushroom, and onion deep dish and it was very tasty. It was tastier than Lou's deep dish. I liked the variety in topping options. Pricing is very reasonable.", "pics": null}}, {"review": {"des": "OMG Im shocked I haven't written a review about my fav pizza place in the city!! Wow kinda disappointed in myself, maybe I'm trying to keep the gem a secret for myself, lol. This place is amazing! Much better than lous or giordanos in my opinion. Its always fresh and hot. We have tried everything from pan crust, to thin crust (which my kids love) to our fav which is deep dish. There is always a ton of cheese and the sauce is unbelievable, so sweet and fresh, I love it. Best pizza in Chicago and that says a lot!!!", "pics": null}}, {"review": {"des": "THE BIG: Pizza is art. Art is Pizza. I eat Pizza. So does that mean I eat Art? Regardless, I found this place on the thrillist as one of the best pizza joints around and do I agree? Yes. Yes I do. Located right off the Ashland Ave, this joint is super roomy inside with ample seating and take out options with a private parking lot.<br><br>THE BLACK AND WHITE: I am super surprised how bikeable Chicago is. I took a Divvy bike (the Chicago Bikeshare program) from Edgewater all the way down to Art of Pizza. It only took 30 minutes and the roads were in good shape. I can respect it since being tourist and lugging all of my luggage, the commute was actually pretty nice. <br><br>Going inside, the service was amazing. The front guy explained the difference between pan and stuffed (stuffed is the one you want to get FYI) and helped me choose the right volume of food. <br><br>I got the 10' stuffed pizza (half pepperoni, half spinach). AND it only counts as 1 topping. Each additional topping is $1.95 extra. Choose wisely. I also got for apps: fried calamari, and garlic bread.<br><br>The garlic bread was super garlicky and awesome. The calamari, I originally thought were onion rings because it literally had no flavor. It tasted like fried oil. However that's not what this review is about. It is about the deep dish pizza! Sauce was rosy red and just the right sweetness and acidity. Cheese was super gooey and tasted so fresh! I was very impressed by the execution of the pizza. <br><br>P.S. If you need WiFi, just ask for it. They'll hook you up.<br><br>THE FINAL BAMBOO: I think by far this was the best deep dish pizza I've ever had. Spent $26 for a 10' deep dish and 2 apps. Not bad. They do sell individual slices for $3 if that is ever an option.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fsP03z9fyJBWSM4W7Bs-8Q/168s.jpg", "caption": "Garlicky bread and calamari"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hetO271EfsmvO0mnMbhHHw/168s.jpg", "caption": "Half pepperoni, Half Spinach, Full Stomach"}]}}, {"review": {"des": "Great pizza and salad.  Fresh and flavorful. Truly one of the best meals in Chicago.", "pics": null}}, {"review": {"des": "I have not tried other pizza places in Chicago so I have no comparison.<br>We enjoyed the pizza by the slice. The service was fast even though they seem to run a bustling take out business. <br>No complaints. Pizza was delicious and decent place to sit and eat.<br>Would recommend if you are in the area.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fzb80ZG7FCyRUdNu2e0jTg/168s.jpg", "caption": "Cheesy"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0tPD7yUVvSmYAvXpJFThpg/168s.jpg", "caption": "Meaty"}]}}, {"review": {"des": "There's no holding back on the cheese - if you like a super thick Chicago 'za, AoP is on the list. Part of me wants to bring it down a notch to maybe a 3.5, because it's not close to being a favorite... but maybe I'm feeling a little bit generous today and the pizza was too - generously loaded with cheese and bready crust all baked together. Fair warning to lactose intolerants, AoP is not the one to start with.<br><br>It is hard to beat my local joint Nancy's or my go-to chain at Lou's - the difference is always in the sauce and bread. I just prefer a buttery crust and sweeter sauce.<br><br>Also very nice is ordering a $4 slice instead of a whole pie. Perfect for feeding that crave or for folks who think they don't like Chicago style, but are willing to give it that second or third or fourth chance.", "pics": null}}, {"review": {"des": "Amazing pizza,had the veggie deep dish pizza,the sauce was rich like homemade ..and very cheeze", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2i_cK_adEjJ0a3BVrvkKHw/348s.jpg", "caption": "Veggie deep dish"}]}}, {"review": {"des": "Ordered a pizza from here for the first time & the person that delivered the pizza was rude & disrespectful. Called them & informed the manager of what happened & their response was \"it's not our driver\" at the end of the day whoever it is they're delivering your pizza with your name on the box. <br>Manager didn't even apologize & deflected the blame!", "pics": null}}, {"review": {"des": "To me, the best part about The Art of Pizza is that it's one of the very few places in Chicago where you can get this style of pizza by the slice and without the 40+ min wait for it to cook. For that reason alone I really should give them 4 stars. The reason I'm not is because ultimately I felt the pizza was just ok. It wasn't bad by any stretch of the imagination, but in a city with some of the best pizza in the world, I just don't think the pizza here is on that level. No question I'd return though and would recommend it to others.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rLIn_RYVqVjXt-rvpfjW-g/348s.jpg", "caption": "Spinach (top) Mixed Meat (bottom)"}]}}, {"review": {"des": "Absolutely awesome! Traveled from Kentucky and knew we had to try this place first. We had the pepperoni/cheese stuffed and my husband had sausage/pepperoni/bacon. Great picks. <br>Pass on the garlic break tho. A great bang for your buck!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FRlrwHdQZw0dxHr7jLCAaA/348s.jpg", "caption": "Cheese stuffed! Yummy!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mOVoJjwWStB4nD4qz94j2Q/168s.jpg", "caption": "Both pieces. Pepperoni/cheese."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ENmIlc__FtUeai43ywDhzg/168s.jpg", "caption": "Cheese and pepperoni stuffed!"}]}}, {"review": {"des": "I love their pizza! So so good. <br><br>Ordered delivery which took about an hour, which was the original estimate so no complaints. <br><br>Pineapple and bacon thin crust, good! <br>Italian sub-- meh. I expected toasted and it came cold, not a big deal. But when I ordered thru the app slice it gave the option for onions but the sub came with pickles instead... and not with the dressing I selected, which is why I knocked a star off.", "pics": null}}, {"review": {"des": "Only been here a few times. For a slice or two. If you are from the north shore this places deep dish is almost identical to Viccinos. Parking is easy since they have a lot. Prices are reasonable.", "pics": null}}, {"review": {"des": "30 min is all it took for a pick up order of a half and half (veggie/meat) thin crust pizza. Great customer service when I wanted to add on a chef salad at pickup. They didn't even blink. Made it fresh for me! The 16\" \"large\" is very similar to an xl everywhere else. They also have an 18\" Pizza but ginormous for a party of 6!", "pics": null}}, {"review": {"des": "After a recommendation from a coworker who claimed this was the best deep dish pizza he has had, I had to track it down.  <br>So after going to Lincoln Park Zoolights and being in the mood for pizza, we decided to find it.  We got there quickly and glad to see it had its own parking. For a weekend night, it was pretty empty.  This made me nervous if it would be any good.  They sell pizza by the slice, which made it quick. <br>I got a deep dish pepperoni & my daughters got deep dish cheese.  They liked the cheese but thought it was just \"good\" but like Lou Malnati's more. <br>My slice of pepperoni was good, not much pepperoni in the slice to make me happy. <br>Overall, the pizza was good.  The price was good, under $4 a slice.   I would like to try it again just to see if it gets better.", "pics": null}}, {"review": {"des": "Yeah this place is the goods! Great pizza! And they sell deep dish by the slice. I don't know anyone else that does that!", "pics": null}}, {"review": {"des": "Perfect place to go if you're looking for deep dish pizza by the slice. We ordered their wings too but they're okay. My favorite was probably the veggie one. The classic one always sold out quick!", "pics": null}}, {"review": {"des": "Real good.  We stopped at The Art of Pizza because we were in the neighborhood and because of their excellent reviews.  We had a really good lunch.  I liked the idea of pizza slices because my husband, son and I all prefer different types of pizzas.  This way we got what we wanted and no one had to compromise. I got the a slice of stuffed pizza with sausage.  Very good.  My husband and son both got a slice of thin crust cheese.  My son loved it but my husband rated it a 'just ok'. <br><br>Prices are very reasonable.  I was glad that they have their own parking lot.<br><br>We will return.", "pics": null}}, {"review": {"des": "Love this pizza! We ordered a variety of deep dish pizzas... the veggie with spinach and broccoli was amazing!! I have a list of places in Chicago that I must try every time I visit and The Art of Pizza has just been added to the list. There is something truly special and unique about Chicago Style Deep Dish. And The Art of Pizza has really mastered the technique. The slices are huge and delicious. The crust is simply amazing and the cheese incredibly cheesy. Love.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xwDCdquRPCy_Cl2IjrdwSQ/348s.jpg", "caption": "Yummy deliciousness"}]}}, {"review": {"des": "I guess this place is known for its deep dish, but I lust after their thin-crust-by-the-slice - so much so that my husband and I called an audible on birthday dinner plans at a fancy restaurant to nab a few slices of cheese and veggie pizza when we were walking our dog nearby prior to leaving for said dinner plans. Anytime I walk by (often with my dog), I feel either happy for, or jealous of, the patrons waiting in line to buy pizza. Yumyumyumyumyum.", "pics": null}}, {"review": {"des": "Hands down my favorite pizza - and I've eaten a hell of a lot of pizza.  Stuffed pizza is on point.  Never had an issue with delivery, always on time and hot.", "pics": null}}, {"review": {"des": "I've been here twice. The pizza is pretty good. I recommended deep dish. The thin crust is also good.", "pics": null}}, {"review": {"des": "My favorite pizza in the city!  Not much for ambiance or dining in but really good for a slice.  They're very filling!  One slice is usually not enough but two is way too much.  Someday I will actually take my own advice on this.", "pics": null}}, {"review": {"des": "I'm a simple person. There's nothing I like more than a piping hot deep dish cheese pizza with strands of cheese that stretch endlessly. The sauce here is flavorful and just darn good. <br><br>Compared to Pequod's where I have waited three hours for delivery, Art of Pizza deserves 4 solid stars for fresh, hot, delicious thin and deep dish pizza by the slice without any of the wait and fuss of the other guys. <br><br>I'm a fan!!", "pics": null}}, {"review": {"des": "Hands down the best deep dish pizza in Chicago! The sauce is amazing and so is the crust! Used to live across the street from them and had the pizza by the slice a couple times a week, now we're in the burbs but still make the trek to the city for it once in a while. My father-in-law still talks about this pizza on a regular basis, in fact it's his birthday today and I'm driving to the city to get some for him!! PS- I never write reviews so trust me!!!!", "pics": null}}, {"review": {"des": "Finally made it here and glad I did. I ordered for pick up and the pizza was ready right on time and the service was friendly. We ordered a large stuffed pepperoni pizza honesty it was the heaviest pizza I ever lifted each pc was enough to fill a hungry person up but it was so good I had another half pc. We ate some for left overs and froze the rest for 27 bucks its a steal if you consider how many meals you get out of it. The pizza was also great sauce was super tomato-E and the cheese was stringy like good mozzarella should be. There was a ok amount of pepperoni but I would of liked a little more. Crust was crispy tasty. I like this place a lot will come back for pizza and to try other dishes. The eggplant parm sounds good. They have a real nice menu with a lot of other Italian dishes. I'm glad I finally made it to The Art of Pizza i will be a regular now.", "pics": null}}, {"review": {"des": "To go pizza has never been easier. While I've never dined in or ordered delivery, I have hangrily picked up a slice or two. Popped in the oven for a few minutes, it's traditional Chicago Deep Dish.<br><br>While I prefer a slightly less cheesy deep dish (if that's possible) I love the crust on this one, and for the price by the slice how can you not indulge.", "pics": null}}, {"review": {"des": "The pizza are smaller and smaller each time I go in ! And the prices are up not by much but at least keep the slices the same size !! They are charging more and cutting back the slices ! Those picture on yelp are old very old ! I'll post a current slice so everyone can see the difference", "pics": null}}, {"review": {"des": "I very much enjoyed my slice of pepperoni. The crust was perfectly crisp. There were some spots that were a little more greasy but the crust was the perfect help so it didn't become overly greasy. I got a salad to go with it which was nice and fresh and quite good sized. While I'm not a deep dish fan I think it's fantastic that they have it by the slice. Since I prefer thin and my husband prefers deep dish it worked out perfectly.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ACXFiw_Bgj_JQKSP7cPbBA/168s.jpg", "caption": "Deep dish sausage"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/x3BFSImmJbmWmx8MQz-TVA/168s.jpg", "caption": "Thin crust pepperoni"}]}}, {"review": {"des": "Got the vegetarian pizza stuffed pizza. The gentleman on the phone for delivery said they are known for their stuffed pizza. <br>The pizza sauce was just the right amount. However, the pizza would probably have been better if it wasn't delivered. It was a little cold upon arrival.", "pics": null}}, {"review": {"des": "Their deep dish by the slice can't be beat!  So good and always fresh. Reasonably priced as well. Frequent stop of mine on the way home. Only suggestion is open up more locations in the city!", "pics": null}}, {"review": {"des": "Thin crust or deep dish, this is some of the best pizza in all of Chicago, if not the best. I've only ever had delivery from these guys, and their delivery staff is consistently excellent, consistently getting you your pizza not long after you place your order, and they're super friendly to boot. The quality of the pizza is, and this cannot be understated, top notch. This is in the conversation for both best deep dish and best thin crust because of the sauce. The crust on the thin crust as well is perfect -- hefty enough to hold up against the toppings, not too doughy. My personal go-to is the Art's Meaty Delight, which has five different kinds of meat on it. Fat kid's delight. If you're visiting Chicago, this is the place to order from.", "pics": null}}, {"review": {"des": "My favorite deep dish of all time. Gotta try it. Should be ranked within the top 5 of Chicago. Best place about this place is possibly that they have deep dish slices available as counter service. They also have a large selection of other entrees and appetizers. Very Chicagoan. Been coming here for over 15 years. Will always return.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8eLrz9fVeCfwUkM85aOBZw/168s.jpg", "caption": "His first Chicago deep dish experience"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jv7_cTSpB62WZpPsf-O9CQ/168s.jpg", "caption": "Oscar runs the show. And remembers me when I use to come in as a college student(15 yrs ago). Friendly straight up staff. Love these guys."}]}}, {"review": {"des": "Hands down the dankest Za in Chicago.<br>Stuffed pizza is absolute fire.<br>The chicky parm parm at its price point automatically qualifies it as a Power Play.<br>Oh, and did I mention that the savings are incredible? If $3 off the chicky parm parm on Wednesdays isn't enough to get you going, then you must be in the 1% that senator Sanders is always going on about. Enjoy your Rolexus while you can, your existence is only fanning the fires of the revolution to come.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bfagCEEbLCIJPI1KxbRQ9A/348s.jpg", "caption": "Chicky chicky parm parm"}]}}, {"review": {"des": "Not impressed. Decided to go here instead of Giordanos since Gio's is such a large chain. I was disappointed with the pizza being barely warm. Location wasn't too nice either. I won't be going back to TAOP nor recommend to first time visitors either.", "pics": null}}, {"review": {"des": "This place is right down the road from our house. Took almost 1.5 hours to deliver and the crust just isn't good. Not ordering from this place again.", "pics": null}}, {"review": {"des": "The pizza was amazing, no complaints here, just a word to all the Veg-heads out there as a warning, the mozz sticks come with meat sauce so be careful when ordering, otherwise this place was fantastic!", "pics": null}}, {"review": {"des": "Had a friend in town and wanted to treat him to the local slice but not at one of the chains. This place was perrrrfect. Had \"Art's Special\" stuffed pizza and absolutely housed the whole delicious thing. Pizza joint vibe w tables instead of booths and such, so feels very casual. 45 minutes of cooking time can pass easily at this BYO, so bring in some brews and enjoy!", "pics": null}}, {"review": {"des": "Great! Definitely exceeded my expectations... First time being there and the pizza has absolutely risen among the ranks of my favorite deep dish! Got a slice of the spinach, mushroom, onion... It was fantastic! The crust is focaccia-esque and the sauce is really wonderful.", "pics": null}}, {"review": {"des": "The Art of Pizza is located @ 3033 N Ashland.  I was here once before many years ago after seeing an article in the Chicago Tribune.  The first time there was a line out the door with people wanting to try their pizza based on the Tribune article.  I wanted to give the pizza another try.<br><br>This time I got 2 pieces of their deep dish stuffed pizza.  1 sausage & 1 spinach, onion & mushroom.  The red sauce, seasonings & flavors on the pizza were very good.  The sausage was pretty good, but the spinach, onion & mushroom stuffed pizza was delicious.  The blend of spinach, mushrooms & onions enhanced the red sauce flavor.  The crust on the pizza was nicely cooked, but a little to doughy for my personal taste.  <br><br>Still they produce a very good pizza and if you're a foodie or just like a good pizza it's definitely worth checking out", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/n50WwZDWO66ikMRp9KJ2yQ/348s.jpg", "caption": "The Art of Pizza"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/t7wofWuDF6vmN0-YbHu4-w/168s.jpg", "caption": "Deep dish sausage pizza"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mlYuFgFWp3EudzotJGUsZw/168s.jpg", "caption": "Stuffed spinach, mushroom & onion pizza with an excellent tomato sauce base.  DELICIOUS!!!"}]}}, {"review": {"des": "Really good pizza, that should pretty much sum it up. I met up with my acting buddy Ed for lunch and conversation at The Art of Pizza, and it was one of the best dining choices I made last week. Deep dish sausage pizza was my pick for the day and it didn't disappoint. It's good pizza, plain and simple. Now my friend Ed said I should checkout the various Daily Specials (for lunch or dinner) that The Art of Pizza offered, and they all seemed very interesting. I'm gonna need to come back and try the Chicken Parmigiana with Spaghetti on a Wednesday, or the Cheese Tortellini on a Saturday.<br><br>If you're wandering around Ashland (between Belmont & Diversey ) drop in and grab a slice. They do thin crust & deep dish, too.", "pics": null}}, {"review": {"des": "Really good thin crust pizza. I was told it was all the rave in the neighborhood and was not disappointed. However I have re-read the reviews and have found that I absolutely must try the deep dish pizza. <br><br>A little on the pricey end.<br><br>The garlic bread side was crap.", "pics": null}}, {"review": {"des": "I had a very poor experience as a first-time customer. Their wonky online ordering process resulted in me submitting an incorrect carryout order. Upon discovering the mixup at the restaurant, I offered to pay for a new pizza and wait the 45 minutes. But they refused to refund me for the incorrect pizza, saying I had to take it up with the Slice app. Sorry, there's too much good pizza in this city to patronize a business that doesn't value its customers. And the pizza I was stuck with was meh.", "pics": null}}, {"review": {"des": "Rosa J. likes Chicagoan food.  She may be a self-proclaimed connoisseur of Italian beef sandwiches, but she hasn't had much footprint on deep dish pizza.  <br><br>We chose here tonight because hubby was finishing up work, and he immediately expressed the dire urgency of his hunger level.  I knew feeding my hungry hubby was the priority.  I grabbed my phone, went to my Yelp bookmark, and found the Yelp page of \"The Art of Pizza.\"  <br><br>The Art of Pizza has a plenty of customer parking in their lot.  We placed our order of 10-inch vegetarian stuffed pizza with a friendly young man at the counter.  He kindly informed us a forty (40) to forty-five (45) minutes of wait.  We agreed and went to do some grocery shopping in the meantime.  <br><br>Miraculously, hubby endured his hunger the entire time, even though he really wanted food in his stomach.  As promised, we picked up the pizza after the estimated-waiting time and headed home.  <br><br>If you're a human being with a normal appetite, go with the 10-inch.  Hubby and I each had two (2) slices and were comfortably full afterward.  In other words, for a little more than $20, it's enough to have for four (4) individual meals.  <br><br>Hubby and I were also pleasantly surprised by their stuffed pizza.  The cheese and veggies were certainly \"stuffed\" for its full capacity without a doubt!  Sometimes the marinara sauce can overwhelmed the entire pizza and make every other ingredient taste flavorless.  Their pizza definitely accomplished the \"art\" by having a balanced level of sauce, cheese, and vegetables.  Their crust wasn't stiff and was pretty easy to cut with a regular butter knife.  <br><br>Although we don't normally crave for pizza as there are too many choices in the city of Chicago, we will be back for other items on their menu.  <br><br>For some reason, I kept getting menus from them in my mailbox, yet they don't deliver to the west side of Albany Park.  Please don't entice me anymore (hehe...saying it in a jocular manner).  <br><br>They have a \"mini\" call center for pizza deliveries at the restaurant.  Yeah, having food delivered to the door front curtails the death rate in the winter season in Chicago.  <br><br>Anyways, enough nonsense!  The Art of Pizza is a neighborhood gem in between Lakeview and Lincoln Park neighborhoods.  The CTA bus 9 (Ashland) can take there.  I believe \"Wellington\" is the nearest stop to the place.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jWCN2wHqRJ5fLdB3tF-iWQ/348s.jpg", "caption": "Stuffed veggie pizza"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PGiPVml_ZLtQRsrXggFUgQ/168s.jpg", "caption": "10-inch vegetarian deep dish pizza"}]}}, {"review": {"des": "Yummy stuffed pizza. They sell by the slice too and usually have a veggie option or two. I think it takes about 40 minutes for them to cook one up for you. I'm always in a hurry so I haven't had it this way but I'm sure it even better fresh!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SFRuxoEbmQ4WGlfqG-jliQ/348s.jpg", "caption": "Holy cheese"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1-HU05UmZqRK8vqIp71jsA/168s.jpg", "caption": "Sausage and pepperoni stuffed - delicious"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YlCSqehP5qkZApNFIqnY3g/168s.jpg", "caption": "Sausage and pepperoni stuffed"}]}}, {"review": {"des": "Overly hyped. Not bad but definitely not great.  In a nutshell: Sauce is nothing special, dough is good but too much of it which the raw portion throws off the flavors of the rest of the pizza, the cheese isn't bad.  It's overall lacking something, doesn't have much depth in flavor.  Maybe it's the salt in the dough that is needed or possibly the sauce lacks in flavor but ultimately the dough should be a slight bit thinner and be more cooked..<br><br>Really not a top choice for stuffed pizza and the high ratings are probably keeping them from ever making better changes to the pizza recipes.<br><br>Really,  really,  nothing special but the portion size and they don't lack in cheese. <br><br>A well made deep or stuffed pizza always is when it's we'll balanced and this one just misses that mark.<br><br>Definitely not a place to recommend to people who haven't had Chicago stuffed pizza or really to anyone at all.  It's more of a place to try if you just want to really get it out of the way and know what it taste like...  That's about it.", "pics": null}}, {"review": {"des": "The food is very good here I've been here a couple times and I've seen Barack Obama eat here it is very funny lots of Secret Service", "pics": null}}, {"review": {"des": "Awesome pizza, one slice is more than enough to get full. Downside of this place is that their fountain drinks taste horrible (it's like only Pepsi & Dr. Pepper) and they don't serve beer or other alternatives. The the pizza is bomb and the price is great. Also you have to eat it fast as it's kinda coldish.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yDnKqR8XNOTRkcKsvIEHiA/348s.jpg", "caption": "Veghie pizza to die for, btw one slice is more than enough"}]}}, {"review": {"des": "This is not only great pizza but the whole menu is amazing. I work close by and don't like spending a lot of money so the fact i can get a meal for two pretty much on their daily specials always keeps me coming back. Keep up the good work and great food!!!!<br><br>Love your girls from Lincoln Dental Care", "pics": null}}, {"review": {"des": "I ordered from here last night for the first time. We ordered a large thin crust of Art's Special and the Supreme Salad. The pizza was good, salad I could have done without but what was nice but slightly irritating is that they don't tell you that you get a 2 liter with a pizza/salad combo when ordering. They just bring the 2 liter (along with French bread) but don't allow you to specify the kind of 2 liter. As much as I appreciate something for free, it would be nice if they asked regular/diet so you're not left with something you won't drink. Pizza was a solid 3.5/5 I just prefer Lou Malnatis at the end of the day but Art is certainly worth a try!", "pics": null}}, {"review": {"des": "Still good pizza but it used to be great pizza. Unfortunately quality is sliding while prices are rising. Just a couple years ago a slice used to work out to 3 bucks including tax. Now a slice is up to 4.65 (give or take a couple cents) including tax. I might still stop by if I'm in the area on other business, but it's not worth the drive past a dozen other pizza places just to eat here any more.", "pics": null}}]}