{"name": "the-cloud-gate-chicago", "reviews": [{"review": {"des": "Yet another must-visit site in Chicago, located in Millennium Park. Unlike many must-visit sites, this is one you'll want to visit on every trip to Chicago. <br><br>The reflective panels are oddly mesmerizing. You feel compelled to take multiple photos and selfies. The reflection of the downtown skyline is also very special. <br><br>Go underneath and look up. Trust me. <br><br>Also be aware it can be really crowded at all times. Just be patient and you'll be able to get the perfect photo!", "pics": null}}, {"review": {"des": "THE BEEEEAAAANNN!!!!!<br><br>It's selfie-central here, but a total and complete necessary Chicago experience. Make sure to get a good look of the under-bean: it's really trippy when you get under there and look up!", "pics": null}}, {"review": {"des": "AKA \"The Bean\"<br><br>A great spot to see and take some pictures.  Make sure you also get to explore all the other nearby places in Chicago as well.  You can spend a whole day exploring Millenium Park and Grant Park.", "pics": null}}, {"review": {"des": "Ok, so I heard of the Bean but I really didn't know that it is really called the Cloud Gate (sorry to the artist). Well, it does look like a big silver bean. It's very shiny and huge and you can see yourself in it in various poses and shapes.<br><br>It's a touristy attraction thing, ok, I get that. But take away those throngs of people and I can imagine it being really peaceful to sit at or under it and watch the clouds go by, projected back at you.<br><br>It is beautiful.", "pics": null}}, {"review": {"des": "Finally got to visit the bean! And after visiting it, it literally is just a big bean. Which I thought was pretty funny. But its a touristy spot in Chicago and my friends and I aren't from here so of course we had to visit it and take pictures with it. Most of our Uber/Lyft drivers in Chicago pretty much told us that the bean randomly just appeared there out of nowhere with no historic background so I thought that was funny as well. But it was just alright for me I guess. But if you are really curious on going, then you should! Just to say you've seen it in person. It is pretty huge too. And its in Millennium Park if you can't find it!", "pics": null}}, {"review": {"des": "I always thought this sculpture was called The Bean - I learned something new, haha! Every time I see pictures from Chicago, this definitely shows up every single time...so when we decided to visit Chicago with our newborn baby, we just had to come here and take some pictures as well! We had a lot of fun hanging out in the Millennium Park - definitely will be coming back again on our next trip!", "pics": null}}, {"review": {"des": "Tourist attraction place. This is a must come sight see location. <br><br>Every one knows about the bean in Chicago which is also known as The Cloud Gate. I had to come to the Millennium Park to see The Cloud Gate. Yes great for picture taking. <br><br>There are security guards guarding The Bean day and night. If you come in the morning its less busy. Once the after noon hits, The Bean is surrounded by people.", "pics": null}}, {"review": {"des": "Being a Tourist in the state of Chicago, you have to make it to The Cloud Gate aka \"The Bean\". We made the mistake of coming here late in the day and on a weekend so it was pretty packed. It is definitely a must see landmark. Plus, you're in Chicago so why not?! We wanted to take pictures with our legs on it but several parts of \"The Bean\" needed to be cleaned and wiped down. It's still worth it plus you can walk around Millineum Park for other things like rock climbing and etc! But foreal go because it's truly beautiful.", "pics": null}}, {"review": {"des": "A unique piece of \"Art\" like nothing you've seen, within Millenium Park, AKA the Bean. Another token tourist spot in Chicago where you must get a \"bean selfie\" at. It looks really cool on a nice blue sky day the way the sky reflects off of it. You can even go underneath. It is always a crowded spot, but worth stopping by at least once!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NSToVhe0gdeTuPEuTt1Qjw/168s.jpg", "caption": "The bean"}]}}, {"review": {"des": "So Much Fun to Visit Cloud Gate<br><br>There is something magical about Cloud Gate that draws crowds to gaze intently playing with the reflections that it creates. Designed by Indian-born British artist Sir Anish Kapoor, it is an artistic and architectural masterpiece. Although it is constructed of almost 170 stainless steel plates welded together, the highly polished sculpture appears to lack any visible seams. <br><br>Also known as \"The Bean, \" Kapoor's design was inspired by liquid mercury. Visitors can see themselves and the Chicago skyline reflected and distorted along the smooth surface. Walking through the 12 foot arch gives another unique perspective. The concave underbelly , or \"omphalos\" which means navel in Greek, is another interesting place to take twisted candids.", "pics": null}}, {"review": {"des": "The Bean, as the Cloud Gate sculpture is better known, is one of those attractions like the Willis Tower / former Sears Tower, that everyone who comes to Chicago feels they must visit and have their photo taken in front of.  <br><br>We arrived here relatively late in the day on a Saturday - around 5:30 and the square surrounding the sculpture was packed with people as was the void space under The Bean..But we still managed to get the prerequisite photos of us in front of The Bean, our reflections in The Bean, and the reflection of the Chicago city skyline in the background.<br><br>There's plenty to do and see in other areas of Millenium and Grant Parks, and if you don't mind a short walk, there's a great rooftop bar at the top of the Chicago Athletic Association building which features a great view down onto The Bean and other artworks and sections of Millennium Park that I'd highly suggest checking out.", "pics": null}}, {"review": {"des": "Super Duper Cool at Night. The reflection of the city in the bean is breathtaking. Even the homeless people were nice.<br><br>I've been throughout the day, but this was a first at night. But who doesn't love Chicago on a warm summer's night?", "pics": null}}, {"review": {"des": "It's funny that this park is so big and impressive that some of its features have their own Yelp pages. This one is definitely a top attraction and is as iconic as it is picturesque.", "pics": null}}, {"review": {"des": "It's the BEAN! Not my first time seeing this reflective marvel but each time I get to be in its presence it always seems to take my breath away, even if just for a second. How, HOW I say, can they make something so pleasing to the eye that is seamless in design and aesthetically perfect.<br><br>So after all that... it's THE BEAN. A glassy, metallic, mirror-like permanent art installation in Millennium Park. As you can tell, and as you've likely heard from friends and family when they refer to it, it's affectionately known as the Bean because of its familiar shape, but The Cloud Gate is it's actual name.<br><br>A must see when visiting Chicago", "pics": null}}, {"review": {"des": "As a tourist in Chicago, a stop by \"the Bean\" seemed necessary. I'm not sure it's a particularly innovative in design, but the Bean (\"Cloud Gate\"... whatever) is still entertaining and a staple of a visit to the Windy City. <br><br>Since my hotel wasn't too far away from Millenium Park, I wandered to the park one morning before visiting the Art Institute of Chicago. The Bean is easy to find... and though it would have been nicer to take photos if the weather had been more cooperative, there were still a number of people checking out the Bean, taking selfies (some setting up more professional shots), and generally enjoying themselves even though it was still somewhat early in the morning. <br><br>I'd love to make it back to Chicago... and if I do? I'm hoping for better weather and an early morning wakeup call in order to get to the bean for a more opportune photo. <br><br>TL;DR  Somewhat corny, but also captivating at the same time... the Bean is a Chicago icon.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wyuP-EggfTIUBzyQf_ddjA/348s.jpg", "caption": "Under the Bean!"}]}}, {"review": {"des": "Go here, take some selfies, enjoy life. <br><br>I recommend going earlier in the day when there are swarms of people. Really cool that they have plenty of places to sit and people watch.", "pics": null}}, {"review": {"des": "You go to the big city and you visit the Arch, Space Needle and The Bean.  You take your video, portrait or whatever.<br><br>Is The Bean worth a visit?  Absolutely, assuming you visit other nearby attractions or your hotel is close.<br><br>Having said all that, The Bean is cool looking and it's fun to be around people having fun.  So definitely spend a few minutes walking around and take lots of pictures, etc.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sv8JO4aESMSJF0LsylILGQ/168s.jpg", "caption": "Zoom in and find photographer and associate"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Owr2yZq_xMDim4VrmmV_ow/168s.jpg", "caption": "Blob misses O'Hare, lands downtown"}]}}, {"review": {"des": "I refuse to call this \"Cloud Gate.\"  It sounds like some sort of political scandal.  Everyone knows this statue as \"the Bean,\" and if you come to Chicago, it's probably been recommended to you by fifty different people as a \"must see\" tourist attraction.<br><br>So you're probably thinking, \"it's just a stupid mirror statue.  What's the big deal?\" while rolling your eyes at the insane crowds.  Well, you wouldn't be wrong.  BUT, I still think it's worth checking out if you're in the Windy City.<br><br>For one thing, it's nice to appreciate the sheer craftsmanship that went into creating something like this.  For another, it's pretty trippy to walk around the Bean and see your reflection mirrored in ten different angles simultaneously.  And lastly, it makes a pretty cool picture to post on Yelp/Instagram/Facebook/whatever (which is what I'm sure 95% of the people gathered here care about anyways).<br><br>It's worthwhile to come to the Bean early in the morning, at like 6 AM, when there are zero crowds.  It's kind of nice to sit alone by it and gaze pensively into its metallic depths.  But be wary, for if you gaze long into the Bean, the Bean also gazes into you.  /unexpectedNietzsche<br><br>OVERALL: 4/5.  Joking aside, it's a pretty cool attraction, even for someone like me who usually doesn't understand art.  If you visit Chicago, you should definitely check it out, preferably early in the morning to beat the crowds.", "pics": null}}, {"review": {"des": "Have you flicked the bean? <br><br>The Cloud Gate is a sight to see, despite the mass crowds and photos being taken. Be sure to get a selfie to document your visit, but know that thirty other people might be in your photo, as well. This outdoor minimalist sculpture is comprised of stainless steel (and iconic Chicago moments), by Kapoor. The Cloud Gate is the focal point of Millennium Park. Afterwards, take a breezy walk through Maggie Daley Park or take the Lakefront Trail to Grant Park. <br><br>\"I think I might.... Ooooh, ssshiny object.\"", "pics": null}}, {"review": {"des": "Anyone who calls the Bean by its original name, \"Cloud Gate\" is a snob. They're also probably the same people who prefer Hydrox over Oreos. <br><br>Sure, it's an outdoor sculpture and sure, upon closer inspection it's a little grimy from the millions of fingerprints but it's an iconic piece of Chicago everyone should see. It definitely helps that there's a lot of other attractions nearby in Millennium Park (Crown Fountain, Jay Pritzker Pavilion, Lurie Garden).", "pics": null}}, {"review": {"des": "After standing in front of \"The Bean\" for under two minutes, my mother turned to me and said, \"So... this is it?\"<br><br>Yep, it is what it is- a giant, shiny bean shaped piece of metal. At first glance, it seems quite boring. But when one considers the elements of design, space, and pure artwork that went into this piece, it becomes exceptionally more impressive. That's why I gets five stars. <br><br>\"The Bean\" falls into the category of those landmarks that you only need to visit once in order to cross it off the bucket list.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4fIHSast_aP5MfIFnhfvKQ/168s.jpg", "caption": "\"I don't get this?\" - Mom"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Eib8Si-KMvirDTpJxP5_Rg/168s.jpg", "caption": "Tourist."}]}}, {"review": {"des": "Cloud Gate is a MUST when visiting Chicago for the first time. Whether visiting during the day time or at night, Anish Kapoor's creation is a sight to see. If you want a picture with no one else in it, go super early in the morning, or really late at night. It's a touristy spot, but I never get tired of seeing it! PLUS it's free to visit so I don't mind going time and time again with visitors each time they come!<br><br>Make sure to view it from all sides. You can get the skyline in the background, the skyline in the bean, your reflection in the bean, or many reflections of you when you go under!", "pics": null}}, {"review": {"des": "The Bean.  It's the Bean.  You go up to it, you take your selfies or mirror shots off of it.  Oh boy, it sure is reflective and shiny and bean-like.  Have you ever wanted to jockey for position with other tourists to take a picture with a freakin' shiny metallic BEAN?  Neither did I, but I got dragged to it.  The freakin' BEAN.<br><br>Anyway, I got my Bean pic.  It was ok.  My friend loved it.  The angle made me look less fat.  2 stars.", "pics": null}}, {"review": {"des": "A must see while in Chicago. I was fortunate to visit \"the bean\" during a recent trip and even with rain falling there were people all around capturing pictures (myself included)!", "pics": null}}, {"review": {"des": "Anyone en route to Chicago is (or should be) excited about seeing \"The Bean,\" It's an iconic monument, filmed in many movies, and well-photographed. It's a tourist attraction, yes, but in my opinion, it's also a lot more. <br><br>Millennium Park, and really, the whole little mile radius around \"The Bean\" is just quaint and beautiful. You can rent bikes for about $10, the only issue being that you have to check them in every 30 minutes or you get charged extra, but a perfect little day was well spent riding the bikes and becoming familiar with Chicago, Navy Pier, etc. <br><br>Overall, you can't miss this spot. <br><br>P.S. - Houston has the sister-bean, if you're ever in Texas to check it out!", "pics": null}}, {"review": {"des": "Greetings, from the other \"Beantown\".<br><br>Cloud Gate or The Bean as it is also known is as tourist trap as you can get but did you really visit Chicago if you don't grab a selfie?<br><br>The Bean is in Millennium Park and is surround by many other attractions that you can go to and look at. It's quite the structure to look at. It's big, shiny, reflective, and it's just there. <br><br>Don't be shy - take out your camera and snap a few photos of yourself. Everyone else is doing it!", "pics": null}}, {"review": {"des": "Ok, it's cooler than I expected.<br><br>The Cloud Gate (aka The Bean) has become an iconic Chicago attraction since 2006. The city, cloud, and selfie reflections are all part of the lure. It's so simple, it's genius.<br><br>Kudos to British artist Anish Kapoor and the software that designed the precise cuts required for 168 pieces of stainless steel to be seamlessly connected into a beautiful and communal shape. <br><br>The shiny polished metal sculpture looks like liquid mercury impersonating an elliptical water drop. The Cloud Gate is 66-feet long, 33-feet high, and weighs 110 tons. A concave chamber at the center forms an arch \"gate\" 12-feet above the ground reflecting back your image from a variety of perspectives.<br><br>It's also free ... and was built by 100% private donations making it even cooler.<br><br>You can find the Cloud Gate in downtown Chicago's Millennium Park between Michigan Avenue and Columbus Drive.", "pics": null}}, {"review": {"des": "This is a total touristy thing to do while in Chicago, so of course I had to go! The day my family went, is was windy and snowy, but that wasn't going to stop us from seeing The Bean on our trip!<br><br>When we got to the park and saw it from the distance I was thinking \"What's all the hype about this? It's not that impressive.\" <br><br>But than we got closer and it was bigger than I thought it was and it was actually pretty cool. It was shiny and looked like a bean. It was quite satisfying.<br><br>The park it was in seems nice too. If it had been a nice day out, I can imagine that coming to the park here would be much more enjoyable. It must be fun to live in the area and talk by this sculpture in your walks or run in the park.<br><br>I would defiantly come back to the park again and see The Bean again! I think that it is something that is just cool and fun to see.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kamEW30RDznmORfePZQlMw/168s.jpg", "caption": "The Bean"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZPDhql_Mwj3gglkXb06h2Q/168s.jpg", "caption": "Entering the park"}]}}, {"review": {"des": "Am I the only one that thought it was actually called \"The Bean\"? And how does Anish Kapoor feel about the fact that a lot of people call it \"The Bean\"?<br><br>Regardless... you gotta do it. At least once. And if you can go during the winter, get yourself out on the ice skating rink.<br><br>We went on an overcast day and while it wasn't raining at the time, it was both cold and humid enough that the entire reflective surface was covered in the type of wet that clings to glass surfaces... the type of wet that your mirror usually experiences after a hot shower. But my pictures still came out pretty cool so I'm not mad at it.<br><br>And if you're going to check out Cloud Gate, walk under it and look at it from every angle.<br><br>Surprisingly I haven't really seen it ridiculously packed, but I haven't spent a summer here yet so it may not be peak \"Bean\" season yet. I will say that there were some characters around while we were there like a lady who briskly walked passed us and shouted (while never stopping) \"WANT ME TO TAKE YOUR PICTURE FOR YOU GUYS!\" Not a question, more a statement... an invitation to steal one of our phones most likely since neither of us were even taking selfies or pictures at the time. It made me chuckle a little when she did the same to someone on the street taking photos of the city-scape with a seriously professional camera setup.<br><br>It's definitely a must and is so much more massive that it seems in any picture I've ever seen.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mZf21ghmTlX6scaeMyd0sg/348s.jpg", "caption": "Inside cloud gate"}]}}, {"review": {"des": "Beautiful must see in Chicago! <br>Get there early and beat the crowds!! <br>IG @comeflywithmel", "pics": null}}, {"review": {"des": "I lived in Chicago for 20 years. Much of that time before \"the Bean\". When the Bean was installed, I was critical of it (as many Chicagoans still are). I couldn't believe people (not tourists) would make it a destination for wedding pictures, engagement photos, etc. <br><br>Working near the Bean in 2015-17 changed all that. On many lunch strolls through Millennium Park I saw all manner of tourists enjoying themselves by the Bean, laughing, doing peace-sign selfies*- pure joy. Also, the best works of art start a conversation, and Cloud Gate has done just that. <br><br>Also, what's not to love about all of the hilariously named recent fake Facebook meetup events at the Bean? <br><br>*Tourists- get the Cityscape to reflect in your Bean selfies, otherwise it's just another non-descript picture in a mirror!", "pics": null}}, {"review": {"des": "We enjoyed ourselves so much this trip. One of your favorite places to visit was \"the bean\" which we did the first day we landed in Chicago. <br><br>Of course tourist like me love coming here but unlike other tourist-like places this wasn't so obnoxiously packed as the other places. We actually got to enjoy it and take lots of pictures too<br><br>And our last day here it snowed! So we got to take a stroll through the park and see The Cloud Gate covered in snow. One of my favorite parts about this trip. <br><br>Definitely a must see when visiting Chicago!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iaP-bMm9UKWaIlH-0jZEsw/168s.jpg", "caption": "Me & Crys at The Cloud agate"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/otaKq_s3vG7qQSV3oERXfg/168s.jpg", "caption": "Far view of The Cloud Gate covered in snow. Love it"}]}}, {"review": {"des": "Always a fun stop when I'm downtown Chicago! I can't believe I've never been in the summer! We come a lot in the winter. So many people but still a really fun time!", "pics": null}}, {"review": {"des": "We saw the bean from a bar across the street. Since it was right there, I decided to dragged the roommate here. This was on Tuesday, December 5th around 1:15pm.<br><br>I've seen Cloud Gate before, so this was more for the roomie. He didn't see what the big deal was, but I think the structure itself is kinda cool. Fun walking around and seeing your reflection from all the different angles. Luckily, since it was cold AF, there weren't a lot of people here. We got a pretty good unobstructed picture. I've been here during warmer weather and it was super crowded. People everywhere! I guess that was one plus about going on a freezing day. Less people.<br><br>One of the touristy things you should do when visiting Chicago.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NB-TpoV3Ev9GO4mUE699-A/348s.jpg", "caption": "Cloud Gate aka The Bean"}]}}, {"review": {"des": "Cloud Gate is necessary.<br><br>I usually cringe when friends recommend certain places in Chicago (Navy Pier, Rainforest Cafe, etc.), but Cloud Gate is one thing I can get on board with to recommend to locals and tourists alike.  Why?<br><br>1.  It's free<br>2.  It's a fun photo op<br>3.  There are plenty of other things to do nearby<br>4.  Truly enjoyed by all ages<br><br>I have two very memorable visits here.  My cousin, who was 15 at the time, moved here from a small town in Kansas.  I took her to \"the bean,\" we took some memorable photos and then headed to an art event on the south side.<br><br>Last weekend, I brought my son (6 months) here.  You see, I live in the suburbs.  I know too many people who live in the suburbs who are terrified of going to the city.  So I'm trying to break him in early.  The problem is, what do you do with a 6 month old in the city, when so much time is spent driving to the city?<br><br>Answer:  Brunch.  Then take them to the bean.<br><br>We had brunch at Beatrix and then did the typical stroll along Michigan Avenue, ducking into a few shops here and there like Zara and Dylan's.  My son fell asleep in the stroller by the time we got to Millennium Park, so I did the unspeakable:  I woke him up.<br><br>I lifted him up, facing the bean, and - HUGE SMILE.  He absolutely loved looking at himself and everything happening around him.<br><br>Worth every moment.", "pics": null}}, {"review": {"des": "When in Chicago, go to The Cloud Gate. I mean, pics or it didn't happen right? Of course on my first trip to The Windy City I had to walk over to Millennium Park to see this giant mirror of beauty. Since it's right in the middle of downtown it's really accessible to walk to. Once I found out it was called The Cloud Gate and not The Bean I decided I would only call it what the artist intended! There will most likely always be people here with their cameras and cell phones but it's still a good photo op and a really cool piece of art. It sits with the beautiful sky scrapers on one side and the green tree lined park on the other side. You can walk underneath and see the cool mirror effects it makes. There are some benches to hang out on and do some good people watching. You'll see the insta-models looking out into the distance with one hand on the sculpture while their insta-boyfriends snap a shot of them. You'll see parents wheeling their sleeping children in strollers to sit in front of the sculpture so they can post it on their Facebook and Aunt Kathy can comment, \"Awww cute!\". You'll see groups of friends squeezing in for selfies while trying not to hit anyone with their selfie stick or not caring if they do hit someone. You'll see couples kissing and making sure to get the right angle so they both look flattering for the #couplesgoals Instagram post. Oh yes, you will see it all!", "pics": null}}, {"review": {"des": "MR. BEAN<br><br>One of the Windy City's most popular (free!) tourist attractions produces some extremely cool photo opportunities.<br><br>Cloud Gate has become synonymous with Chicago's array of eclectic public art, now in the same class as Alexander Calder's \"Flamingo\" (the big red-orange metal arch thingy in Federal Plaza) and of course the famous Picasso \"anteater\" in Daley Plaza, which -- did you know? -- is actually the French surrealist's take on a woman.<br><br>This glistening landmark is easily spotted from Michigan Avenue and is accessible to anyone visiting Millennium Park.  There's generally crowds surrounding the massive 100-ton stainless steel oddity, guys taking selfies and girls Instagramming their lives away.<br><br>Inspired by the properties of liquid mercury, British designer Anish Kapoor came up with the idea for this highly unusual but very much loved piece of art, located near the ice rink during the winter and next to the Crown Fountain (the spitting mouths) during the spring and summer.<br><br>Though the typical basic bitch reaction is to have your picture taken with the shiny structure in the background, the REAL visual treat comes from when you're standing *directly underneath* it.  At a focal point called \"the omphalos\" (Greek for 'navel'), your reflection gets shrunk to a fraction of its size and distorted.  Super cool effect.<br><br>Stunning snaps can be taken from both the east and west, as the skyline reflects nicely off of the giant metal bean.  It's truly fascinating how the exterior shell shows ZERO sign of any seams; a 5-stage process was used to eliminate all weld marks from the sculpture using grinding, sanding, and buffing.<br><br>All in all, this flawless Fabaceae (google it) is an iconic part of the city's landscape.  At a final cost of $23 million, this is definitely the most expensive legume in the world......and it won't give you gas!<br><br>Highly recommended.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vhmpw_v_EsHSbqWQhm-OZA/348s.jpg", "caption": "A view of Cloud Gate as seen from the east! Definitely the most recognizable shot of Da Bean ;)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Kzt8lkwRBKkvYSyYH8satA/168s.jpg", "caption": "The elliptical nature of this unusual piece of art yields some seriously cool photos. What dimension are we in?!?!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2Db_hWEz17eyTEsg3LDVmg/168s.jpg", "caption": "A view of the bean, reflection facing west!"}]}}, {"review": {"des": "It's taken me a while to sit down and gather all my thoughts about this place, and I think there are several reasons why. Maybe is because I think I have to do justice to the awesomeness experienced. Or because the breath of all available at Millennium park and the Cloud is so much. Or maybe is because what I experienced are things I've written down in my bucket list and finally seeming it has to be digested, discussed, and examined. Or maybe just maybe, is because the Cloud has become so an enigmatic emblem of Chicago you see in every movie, picture of friends visiting the city, and just the sight of it elicits a smile on your face and a feeling of I made it too.<br><br>Artistically, the Cloud - or the bean as many call it - is flawless. A perfect example of artistry to be placed next to the Arts Institute Museum. It's round surface brings back memories of the bubble in \"The Abyss\" or the extraterrestrial technology in \"The day the Earth Stood Still\" - but it's in Chicago and we know it's man-made. It's methods used by the artist will definitely be discussed and googled, because its smoothness seems to defy reality. The reflection of the city on its surface is magnificent. No one can't resists taking a picture, not just of their own reflection on the Cloud but of the city reflected in it. And maybe that's what the artist intended. Maybe the Cloud is a reflection of Chicago itself, with it's sunny days and cloudy ones, with people of all colors, creeds, shapes, and sizes walking it's streets, either for work or leisure, but walking together.<br><br>In conclusion, it's a piece of art that has to be seen. Not in pictures, magazines , or movies. It has to be experienced in the flesh in order for its magnitude to be throughly understood. And I hope it's also in your bucket list!", "pics": null}}, {"review": {"des": "It's the BEAN! A must do attraction in Chicago even if it's one of those \"for the 'gram\" things. <br><br>Me and my friends got to the bean pretty early on a Friday  (around 8am) and there wasn't that many people around which was a plesant surprise. (it was also december)<br><br>It's a massive reflective sculpture and it's fun to take pics near it or of your reflection. A solid 10 mins is all you'll need to get those pics in and move along to the next thing in Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Maq89YK-a8CXVZ6i44VqqQ/168s.jpg", "caption": "Bean!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/966A9Ffr_-TVJAOVuBtdrQ/168s.jpg", "caption": "Bean!!!"}]}}, {"review": {"des": "It's a giant shiny bean in the middle of a city that has so much to offer. And yet, I gave it 5 stars.<br><br>\"The Bean\" is one of the touristy things that you simply have to do. Looking at the photos, it's easy to write it off as simple a big shiny object. Well yeah, it is exactly that. But somehow it is incredibly captivating. It has this funhouse mirror effect, and the reflections of the city in the background make for some really awesome photos. It also happens to be in a great location, so you're surrounded by a ton to do. That's a huge plus, so you really don't need to go out of your way to stop by.<br><br>While you're visiting the bean, you'll find yourself pondering lots of deep questions. How heavy is the bean? Did they build it right here? If not, how did they transport it? How often do they need to clean it? I'm sure all of these answers and more can be found online, but what's the fun in that?", "pics": null}}, {"review": {"des": "Knowing that The Cloud Gate looks like a bean, and seeing it, are two different things. This thing is so cool. I wonder how many people takes to polish it? <br>We came on our last day in Chicago because we knew we could not leave without taking a few pictures here. Is is the park's main attraction and so it was a bit crowded, but in a good way. There are so many great angles in which to take photos. We had a lot of fun coming up with creative ways.  <br><br>Pretty cool to visit while in the windy city!", "pics": null}}, {"review": {"des": "Fun fun fun, great time playing around with our reflections and photography. A must see when in Chicago!", "pics": null}}, {"review": {"des": "Everybody and their mother has to see the \"Bean\" when they're in town, though very few people know it by it's official name, the Cloud Gate.  Maybe it's the narcissist in all of us that we have to snap a pic of ourselves reflected in this crazy 3D funhouse mirror/alien spaceship.  Or is it a window into the deepest reaches of our souls?  The Bean inspires all kinds of feelings from all that come to visit and touch its surface from elation to flatulence.  And that fulfills its purpose as art, to evoke a response or an emotion.<br><br>In my warped dreams or in an alternate universe, I would be expecting Keanu Reeves to morph out of the end of this thing in a slimy sac of ectoplasm and say \"Klatu barada nikto\", \"Nanu Nanu\" or \"Take me to your leader\".  Being the head narcissist, I would point towards Trump Tower and hope he would take a bite out of his orange head.  This country is going to need serious therapy after this administration.  Pardon the segue.<br><br>With all the people placing their hands on it, I wonder if the Bean has more bacteria and viruses than are stocked in the vaults of the CDC.  They need to put some Purell dispensers all around this thing or hose it down with alcohol every day.  There's also got to be a team of elves that come out every night to keep this thing polished up.  I want that job.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1rso_Q_iCZ7yRrSgSlGXTg/348s.jpg", "caption": "I knew the Bean was an alien spaceship sucking up the dregs of humanity!"}]}}, {"review": {"des": "Bottom Line:  A large, interactive and strangely captivating sculpture in Millennium Park.<br><br>Admittedly I appreciate Cloud Gate, aka The Bean, more after seeing a documentary on it and the artist.<br><br>On my first visit I noticed how funny I looked in its reflection.  On my second visit, years later, I was more interested in how the highly polished stainless steel sculpture reflects the famous Chicago skyline and momentarily transports me to the clouds.<br><br>I'm impressed at how this mercury bead like sculpture is assembled to have such a smooth monolithic surface.  And I appreciate the effort the goes into polishing this famous Chicago landmark every night. <br><br>This is a super popular site in Chicago so be prepare to be surrounded by masses of people.", "pics": null}}, {"review": {"des": "I had been wanting to see this for quite some time. I had the unfortunate fortune to have an emergency landing of my plane that left me in Chicago so I decided to make the best of the situation. Rounding the corner after coming up the steps that lead away from the Crown Fountain, my mouth kind of dropped at how large it actually is. I don't know why that took my breath away, but it did. Even with all the people swarming around like busy bees snapping photos and others slowly walking the perimeter to take it all in, it's still a massive piece of art. <br><br>I love how you can't tell that it's made up of several core structures and panels because of the amount of buffing and polishing that has been done to make it seem like one cohesive shape. It really is beautiful. The huge mirrored cloud gate reflects everything high and low and and as you walk closer and closer you see the reflection of your self. <br><br>I assume everyone has his own reflection (no pun intended) from visiting the cloud gate. I took it is as you see your reflection from the outside which is the same that is reflected to the world around you & as you enter the gate, all the reflections meld together in almost a oneness where we reflect upon ourselves introspectively and outwardly. We all may be the same when we see ourselves from inside and on the outside we so visibly see our differences, as does the rest of the world. Light on the outside, dark inside the gate, but we all bring a little light in with us. We just have to choose to see it.<br><br>Anyway, it's something free to do and there is plenty of people watching to be done if you just want to sit and watch. Head over to the Crown Fountain which is just down the steps.", "pics": null}}, {"review": {"des": "Cloud Gate and Millennium Park can be confusing as they are at the same location.  I visited Chicago in February and there was a snow storm during the time.  The snow made the park so majestic and white.  We came after dinner so the crowd was small, which is a bonus for extra time taking instagram worthy photos LOL The \"bean\" itself was huge and on one side, it reflects the city, which looks so beautiful.  It's best to UBER/LYFT to the park or park on the streets.  We decided to park underground and it was a BIG mistake.  Staying at the park for a good hour costs us almost $30 for parking. NO THANKS. So save some trouble and park on the streets or get dropped off if you can!", "pics": null}}, {"review": {"des": "What's not to love about this place. Actually, what's not to love about Chicago?! <br> Everyone from out of town comes here at least once. Millennium park and the bean are like go-to spots for people out of town. Quite honestly, for people that love in the chi as well. <br><br>The bean is great for pictures and the surrounding areas are great too.millennium Park is great as well, although for me it's better in warmer weather, specifically in the summer. <br><br>You get great views from cloud gate and the bean. Even better is that it's free. && for all is basic girls, it's great for pictures for ig, fb, or snap. <br><br>Don't miss out and get down to cloud gate on your next visit.", "pics": null}}, {"review": {"des": "The Cloud Gate or The Bean is a shiny bean-shaped art sculpture in Millennial Park that is iconic feature of Chicago. <br>I loved coming here to take pictures, people watch and see the reflections in the Bean.<br><br>On sunny days, you get to see the sky and part of the Chicago skyline. The reflection is beautiful with the sunny blue sky, the sun and park. <br><br>Coming to Cloud Gate is fun to watch families, partners, friends take photos of themselves! You get such creative and interesting poses and angles! <br><br>If you don't want to take a picture, you can come just to look at the different angles of reflection from the Bean. The bean looks more like a globe from one angle. And underneath the bean it looks like hall of mirrors with holes. It was so fun! <br><br>Come early in the morning and you get less people in your photo.", "pics": null}}, {"review": {"des": "Cloud Gate is a beautiful art piece that is famous worldwide. It's obscure shape mixed with its reflective surface warps the cityscape with a whole new perspective. It lends itself to great photo opportunities whether it's of the piece itself or in the reflection it omits. And no matter what time of day or year it is, \"The Bean\" always radiates beauty. Just be aware that the park technically closes at night with roaming security near by.", "pics": null}}, {"review": {"des": "Who knew that something that resembles a fun house mirror can be so captivating.  I had to make my way here and take the obligatory picture in this.  <br><br>This place can be quite busy at times, so plan accordingly if you want to hit this place up at a less busy time.  However I don't think that is really possible as this is quite the tourist destination.<br><br>It's kind of weird.  It's one of those places that people become friendly.  Without asking people will automatically take that picture for you.  You see tons of smiles on random strangers.  It's quite a gathering place.  As oxymoronic as this will sound, it's a peaceful mess.", "pics": null}}, {"review": {"des": "this is a must when in Chicago, the bean itself is nothing super crazy impressive, but for the brag rights it is a must for sure. <br><br>there is a whole lot of people here during the day time and it is not easy to take photos while everyone is swarming about however it is worth the visit. <br><br>the park where the cloud is located is also amazing in itself, this is a place where you can walk around and see so much more art and fun, there are faire happening close by and some amazing things all over, the view of the city surroundings is pretty great around here. <br><br>just come by when in Chicago.", "pics": null}}, {"review": {"des": "Must see in Chicago!!! Spent a good 2 hours there trying to take some decent pics. As you can imagine, there were lots of tourists from all over the world. Have patience and try a few different \"photographers\" to get your best shot!! <br><br>The park it's self is also beautiful. Great landmark in the middle of the city.", "pics": null}}, {"review": {"des": "It never gets old! In the center of Millenium Park, it is easily accessible.<br>My fourth time to go here as a tourist and I am still charmed. The place was busy, lots of people doing selfies. Fun to watch things happening around it. <br>I like how it reflects the buildings around it.", "pics": null}}, {"review": {"des": "AKA THE BEAN! <br><br>One of the top places you gotta visit if you go to Chicago! <br><br>Great place to take pictures at and great place to chill with your friends. Probably don't chill with your friends on a busy day because you will be surrounded with tourists lol<br><br>Love the design. Real nice smooth sculpture.<br>Love all the angles you can look at. Nothing too special if you go underneath. Just another mirror you can look at and take pictures. <br><br>Don't forget to use the snapchat filter if you snapchat ;)", "pics": null}}, {"review": {"des": "Who doesn't want to see a big shiny bean? <br><br>It's pretty awesome. I had to hold in my excitement as my boyfriend and I walked towards it. It surprisingly wasn't as big as I envisioned it would be, but it was still nonetheless amazing to look at. Go early if you don't want a lot of people in your photos. Hashtag photobomb central. I got stuck with a lot of human shadows in our pictures and this was probably around 10:30AM. Plus, I think there were like 2 field trips since there were many kids. <br><br>Parking was easy, but expensive. Welcome to Chicago!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VRx49M6V3jqZrbFu4FwjZg/168s.jpg", "caption": "Inside"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gi1SFgBbSbUHKKivfZx_uw/168s.jpg", "caption": "Can finally say I've bean to The Bean."}]}}, {"review": {"des": "It's everything you want and more. Maybe I'm thinking too much into it but I believe it promotes self love. Everyone around was smiling, the atmosphere was happy. The bean was mesmerizing. The Weather was out of our control but that's nobodies fault.", "pics": null}}, {"review": {"des": "I remember when I first came here.....it was like downtown Richmond at Chas Chas cantina on a Saturday night, PACKED. Couldn't really take any decent pictures because you would either have a bunch of strangers in your photos or be in someone's way of taking a picture. It was also difficult to get around to go through or underneath the bean because of everyone trying to see\\take a picture. It is definitely better to go during the week if you can as it is less cramped and packed. <br><br>It is a more pleasant experience, still difficult to get a decent picture of whoever you're with and the entire bean. One side there is not enough space behind the bean to capsulate the entire bean and on the other end there are a row of picnic tables that gets in your way but it still makes for some decent pictures if you're able to angle it right with the right time. <br><br>It's pretty cool to look at and take goofy pics looking at the reflection off \"the bean.\"  Quick tip, on the back end, do not sit on the ledge of the gate outlining the cloud gate. There are security guards that come around every few minutes and will yell at you to get off. This was quite amusing to watch for a few mins, anyway. It's definitely a must see for first timers!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/o848BoH6-3jGs2mnbkON9g/348s.jpg", "caption": "Cloud gate aka the bean"}]}}, {"review": {"des": "It's worth seeing at least once, even if you're already from Chicago(land). <br><br>It's really pretty. It's always photographic. (If you see a Jones Soda bottle with the bean on it- that's my photo!). It's massive. It's shiny. It's full of people trying to take selfies and snaps and instagram photos but people are always having fun. <br><br>I made fun of it when it was first built.... But I've been to it a few times since then. Best of all- it's free :)", "pics": null}}, {"review": {"des": "Chicago is fortunate to have this amazing sculpture that was designed and constructed by Indian born sculptor, Anish Kapoor who is now based in London.  It was designed to reflect the city skyline including the clouds thus the name \"Cloud Gate.\" (FYI-Mr. Kapoor does not appreciate the alternate name \"The Bean\")....<br><br>Interesting details include that it is wiped down and power washed daily to keep it sparkling clean!<br><br>For more fun facts about Cloud Gate see:<br><br><a href=\"/redir?url=http%3A%2F%2Fmentalfloss.com%2Farticle%2F79961%2F9-reflective-facts-about-chicagos-cloud-gate&s=950e1beef706138a454c129c15cda5ff0f2aaeedcb231bdf6c87c68ea7294652\" target=\"_blank\" rel=\"nofollow\">mentalfloss.com/article/…</a>", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xHuDuOBDRE8IDRVN9SrX1g/348s.jpg", "caption": "Cloud Gate reflecting the clouds and Chicago Skyline=its intended purpose as stated by Sculptor Anish Kapoor."}]}}, {"review": {"des": "The Cloud Gate or The Bean is definitely a must see when you are in Downtown Chicago in Millenium Park. <br><br>People come here like crazy and visit and take funky pics. It's a lot of fun and super artistic. The mirror in it makes everything look multiplied and geometric.<br><br>Don't forget when you are here to see the two tower waterfalls with images of people's faces spitting water at u. It's really the water fountains/water falls doing it. It's a lot of fun especially when it's summer time and it's super humid out. Yes it does get that hot in Chicago. <br><br>I want to go back again. I also have a fun memory of taking pics in my wedding dress here!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lSWoy_IMB71enZqza46A-w/348s.jpg", "caption": "Definitely an impressive piece of work in the middle of Millennium Park"}]}}, {"review": {"des": "It's mostly fun to come by, take a few pictures to just say we did it. Lol but if you walk inside right in the middle it's pretty cool to see how many times your reflection shows up!", "pics": null}}, {"review": {"des": "It's a bean.  A very large shiny silver bean.<br><br>Surprisingly quiet park dispite how many people are there. It was very crowded when I was there. But if you sit at one of the many benching and look around you. You really don't hear anyone. Unless they sat right next to you. Enjoy the people watch. It's very interesting to see what everyone around you are up to. <br><br>It's almost impossible to take a picture alone with the bean. There's always someone near you. You can even go under the bean for a photo op. But don't stare at it for too long you'll get motion sickness. Since it's a reflection of another reflection and another.<br><br>The park is very beautiful. Plenty of flowers, lots of trees and grass. Come here to just take it all in and feel nature.", "pics": null}}, {"review": {"des": "Like the soul of the city. <br>The smooth surface reflects the mood of its  people; the energy of a morning sunrise, a festive late afternoon or a romantic scene under the moonlight.<br><br>It reflects the image of the city surrounding  the park in a wonderfully distorted way.<br><br>Designed by British artist Amish Kapoor, Cloud Gate is a large public sculpture located in millennium park, Chicago, Illinois.<br>The structure was completed before Kapoor named it; by then, Chicagoans already nicknamed, \"The Bean\".<br><br>Beside its beauty, with a Weight of about 110 tons, is a marvel of engineering. It is installed above a restaurant and a two storied car garage. <br><br> Before construction, it was studied by a group of engineers, some of then thought it could not be built. <br><br>So, visit Chicago and \"The Bean\".<br>See it in the morning, mid afternoon and after dark. Take a picture, take a thousands pictures; no 2 will be the same.", "pics": null}}, {"review": {"des": "This is also something that I visited on my first trip to Chicago but who wouldn't want to see this thing every time you're in town?!!!! <br><br>It's fun to look at and take pictures with/of. Brilliance is how I define this piece of art. It's really left it's mark.", "pics": null}}, {"review": {"des": "While the bean was a bit undercooked, and the service was slow....just kidding. The bean is an excellent tourist experience. There are so many different things to do at the bean. You can take selfies under the bean, take selfies beside the bean, take selfies standing far away from or close to the bean, lie on the ground and take selfies, and much more. To enhance this experience, wear vibrant pink gloves so that your reflection in the bean is easy to spot. A good time was had by all. 10/10 would visit again", "pics": null}}, {"review": {"des": "Cloud gate is pretty cool. It's a public art piece in downtown Chicago that's in a park (there's more art pieces in the area if you wonder around). It does bring in a lot of tourist so be mindful it does get rather busy. But it's a pretty cool place. I went on a Tuesday and they had a musical event going on by the water so I was able to listen from the cloud gate and down bellow they were having a good event where some pop ups pitched tents and you could buy different foods.", "pics": null}}, {"review": {"des": "Essentially this place is pretty much a place to take pictures at and take in the art. Closest parking is the underground Millennium parking which is cost about $35.  No immediate covered area for the elements or rest rooms.", "pics": null}}, {"review": {"des": "I was told to check out the glass mirror bean thing while in Chicago, and was not sure what to expect until I saw it.  Truly is a glass mirror bean thing.  Don't expect people to clear out of your way while you take pictures.  There were tons of people there trying to get the perfect reflective shot, and almost every angle has a good one, even from underneath looking up, which was rather trippy.  I can't tell you much about where the bean came from, or what it's purpose is, but I will say that you have to visit it while you're in Chicago, or you never truly visited Chicago.", "pics": null}}, {"review": {"des": "The Cloud Gate was a must see while in Chicago! It was very cool. I had no idea you are able to go underneath it. Don't forget to look up when under it! It was really busy so unfortunately all of my photos have a ton of people in them. Make sure to see the bean!", "pics": null}}, {"review": {"des": "What's not to love about the \"bean,\" a.k.a. Cloud Gate? Not only is it perfect fodder for all the selfie-obsessed Instagrammers out there, but it's a gorgeous work that gorgeously reflects the Chicago skyline and its Millennium Park surroundings. It truly gives the impression that the sky's the limit, as the saying goes. <br><br>Definitely worth a stop just for the photo op if you're a tourist, but don't just come here for the bean itself. Do explore Millennium Park and the surrounding area, especially if you're on your way to the Art Institute.", "pics": null}}, {"review": {"des": "Went bears thanks giving night after dinner with the kids, the absolutely loved it had a lot of fun and took some great photos they also enjoyed the Christmas tree that is there it's very large and beautifully decorated. Great place for the family and for pictures and memories just dress warm at night it was freeeeeezing! Will visit again", "pics": null}}, {"review": {"des": "CLoud Gate aka The Bean.<br><br>A must visit whenever your visiting ChiTown.<br>The Ginormous bean is Located in the infamous MiLLennium Park and you reaLLy can't miss it.<br>SimpLy foLLow the crowds!!<br><br>There is aLways a cLuster of peopLe attempting to take the same exact picture as yourseLf & any attempt to maneuver in a soLo picture is pretty much impossibLe.<br>[Come by super duper earLy or Later on in the evening if you're that person who absoLuteLy wants|needs a photo without random strangers photobombing or hanging out in the background]<br><br>Visiting CLoud Gate is the thing to do and see at Least once!! Not being a big fan of crowds, one visit is more than enough for me. I don't have the patients to stand around taking a miLLion and one pictures in hopes of getting a \"good one\". <br><br>ALL in aLL, Two thumbs up for foLLowing the hype and checking this Location off my List of destinations to visit.", "pics": null}}, {"review": {"des": "The cloud gate is pretty awesome. I did not know that this was made of stainless steel. It is so well polished that it looks like a mirror.<br><br>We did not get a great photo since someone or the other kept photobombing! But we had a great time here and we walked over to other areas in Millennium park.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cqh91fWLrvEwgZmBmza1Yw/168s.jpg", "caption": "Cloud Gate from under"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/C8r4Uo0NFbVRrOdRALjonw/168s.jpg", "caption": "Cloud Gate"}]}}, {"review": {"des": "The bean, yes! Definitely my favorite while visiting Chicago! Had me in awe. Braved the rain to see it the first time, which wasn't all that bad...less people and cool photo ops. Another time during the night, again, very few people and great photos ops. And again, during a nice day...and it was packed! Definitely enjoyed coming here, again and again!", "pics": null}}, {"review": {"des": "It's a giant bean. People take pictures of it, with it, for it, to it... Lol it's alright. You should see it just to say you're in Chicago but otherwise the crowds are just ridiculous. I'd suggest going early in the morning if you don't want people in your pictures or late at night if you want less people in your Chicago skyline bean picture.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yGmNf1sJFf2KxBTWJ8umNA/348s.jpg", "caption": "Frosty"}]}}, {"review": {"des": "Such a simple monument - the Bean - but so much fun and energy surrounding it... Always love seeing this, no matter what temperature. Impressive skyline reflections and fun photos to be taken by all.", "pics": null}}, {"review": {"des": "What a unique design, great place to take your family and friends. I'm amazed at how beautiful the architecture is and how the reflection of the city was well thought of. Plenty of small restaurants to grab a bite to eat.", "pics": null}}, {"review": {"des": "If you go to Chicago WITHOUT seeing The Cloud Gate, aka \"The Bean\", then your visit never happened. It's pretty much an absolute must to see, no matter what season it is. Rainy? Great pictures. Snowy? Great pictures. Sunny? Great pictures. <br><br>It's massive size, silver, mirrored infrastructure and cool shape, makes it so incredibly unique compared to anything in other big cities in the U.S. <br><br>If you're wondering if you should add this to the list....YES, 100% go. <br><br>Enjoy!", "pics": null}}, {"review": {"des": "Yes, this is a basic tourist thing to do in Chicago, but hey.. it's free, and it's pretty cool. On a Saturday afternoon, it is impossible to be around this thing without tons of other people around you, so if you have the choice, maybe go during a less busy time. I saw some folks mention the views of the bean at night are pretty epic, as you can see the reflection of the city lights in it. That sounds pretty cool too. Overall, it was nice to walk around the museum grounds, see the bean and some other interesting sculptures and take some pictures. If time allowed, I would have loved to have actually gone in the art museum, or tried to take a photo with the infamous bean with less people around.", "pics": null}}, {"review": {"des": "\"The Bean\" or I quickly noticed it's also called Cloud Gate (note to self). It's a beautiful architectural, art piece surrounded by trees, buildings, and amazing food spots. <br><br>Did I mention it's FREE?! haha I don't know about you guys, but when I hear \"free\" I get   butterflies in my stomach. Eeeeee. <br><br>Being under the sculpture is really nice. You can see a reflection  of yourself and all the people surrounding you like little ants . It was snowing when I went, so people were ice skating. It reminded me of Home Alone. I live in CA, so I get excited over snow. Haha<br><br>Def a tourist attraction you want to visit if you come to Chicago, IL.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/K2ZAepwvPcomeH5d-msbeg/348s.jpg", "caption": "The OGs"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ReWL3ezK2IJBShZH--D0aA/168s.jpg", "caption": "Beautiful"}]}}, {"review": {"des": "Can get some pretty cool photos with the famous Bean, it's a must see when visiting Chicago.", "pics": null}}, {"review": {"des": "Beautiful! I've always wanted to visit The Cloud Gate aka The Bean. So cool to look at and the skyline behind it is even more beautiful ! definitely suggest on checking it out if you're in town !", "pics": null}}, {"review": {"des": "Love love love THE BEAN!!!! Not a proper visit to Chi town without a photo op at the bean. Beautiful reflections of the amazing architecture of the Windy City. Take a pic of yourself holding up the bean.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1rTnXK8hrJU9EgWOifSuSw/348s.jpg", "caption": "Under the Cloudgate or as we call it THE BEAN with my hubby. The Bean is a must see."}]}}, {"review": {"des": "This mirror bean is really magnificent. You can't come to Chicago and not come here. I came here 4 times during my 4 day trip here. All at different times of the day. It makes for some really great photos, especially shooting from the east to the west for the city skyline as a backdrop. It can get really crowded in the evening. Come in the morning for least amount of tourists. Also, it's dirty. Doesn't make for the best close up selfies.", "pics": null}}, {"review": {"des": "It's one of those really cool things to see, but I have no idea of the significance!  Haha! Whatever that is, I'm really glad that this is there to see! The way it reflects the beautiful skyline of Chicago is magnificent! It's like looking at Chicago from a different perspective! It gets crowded and a little difficult to get a nice picture without being photobombed left and right! Even with the crowds, there's plenty of room to snap a pic of this interesting piece!", "pics": null}}, {"review": {"des": "I never knew the bean was actually called Cloud Gate. Certainly a more fitting title for what it is in person. Some might gawk and brush off its existence but Cloud Gate is a beautiful structure in the middle of Chicago. While pictures certainly would pique your curiosity, seeing it in person makes a big difference. You appreciate its enormity and its design. Walk different sides of it and walk underneath it and you will realize why it is called the Cloud Gate.<br><br>This is a must see as you're walking through Chicago. It's located in the Millennium park which is surrounded by a ton of public art. Love it. Come early in the day otherwise there will just be a mad rush of people interfering with your perfect picture.", "pics": null}}, {"review": {"des": "Loved it. No trip to Chicago is complete without a visit to The Bean<br> There is a debate about the name. It looks like a bean, the natives call it that, and so do I. End of denate.  Get there if you can!", "pics": null}}, {"review": {"des": "The Bean (Cloud Gate) is a fun attraction - worth checking out on the fly - when walking through this part of Chicago on the lake. I would plan to stop on by when doing other things in the area rather than make this into a special trip, but yeah for sure, this is a fun art instatllation to check out, super interesting and different.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pUa3qNj3F8UHbCzQBDnVHg/348s.jpg", "caption": "In the eye of the Cloud Gate - can you find me?"}]}}, {"review": {"des": "Tips: <br><br>Go early in the morning to beat the rest of the tourists. I went on a Tuesday morning around 8am during a small snow storm and there were about 20 people also visiting. <br><br>Be sure to walk all the way around the bean when taking pictures. Both sides, the ends and underneath are great for pictures! <br><br>A must see when in Chicago", "pics": null}}, {"review": {"des": "I hosted family from New Jersey and they wanted to see the BEAN. I was actually surprised they mentioned this spot, did not know it was such a part of our tourist attractions. They loved it! So, yeah, when hosting family/friends take them to the BEAN! Millennium Park is a spot to see, WHO KNEW?!", "pics": null}}, {"review": {"des": "The \"Bean\" is probably one of Chicago's most iconic spots. And of course, since we were playing tourists for the weekend, we had to go! <br><br>We got here about 9:00am-ish and there was a healthy crowd around it. You'd have to go super, duper early if you want some solo shots with the gate. <br><br>It's a pretty cool spot - and we tried taking selfies with it several times but they always came out funny. I'm not sure how to properly do this, but bravo for those people who can! <br><br>It's pretty cool that you can see yourself in multiple points if you go under the gate. But I wonder...where is the seam??", "pics": null}}, {"review": {"des": "A giant shiny bean! Such a tourist spot. The weather had warmed up the day we went, so naturally, there was a huge crowd there. Go early if you don't want a huge crowd or go during the week. I'd say go at night too, I bet it's just as pretty with the night lights. Otherwise go with the flow and go with the crowd. Hard to get a good picture without randoms in your shot. Oh well. But fun spot to see when in Chicago.", "pics": null}}, {"review": {"des": "We go to Chicago almost every year to visit my in laws. They suggested we should go and see the Bean in downtown Chicago  When we saw it, we just said 'wow' . Its a beautiful sculpture, like a center piece in the Millennium Park.<br><br>Its huge, stainless, very beautiful,  Its not just ordinary sculpture, its unique, designed by Anish Kapoor , a British born Indian artist. Lots of tourists take pictures, and all pictures look different from all angles. Its like a reflection mirror. You can see the skyline, you can see the buildings around it, sometimes it feels like a 3D picture. Lots to see in Chicago, will write more in my next review.", "pics": null}}, {"review": {"des": "A must do when visiting Chicago and its FREE! The Bean is a beautiful piece of artwork alongside of Millennium Park. <br><br>Try to go 1st thing in the morning or right before sunset. There will be less of a crowd. Also, I recommend checking out the pictures here from our fellow Yelpers for unique pictures ideas. Pinterest is a good one too! <br><br>The Bean will definitely be on my to-do list the next time I am in Chicago.", "pics": null}}, {"review": {"des": "Bean is another most iconic spots in Chicago. It's one of the free places in Chicago. You can view your image in the silver cloud. <br><br>Must see places.", "pics": null}}, {"review": {"des": "Cool place to visit since it's attached to millennium park and take a few photos, fountains are not to far off and sometimes they have festivals right across on the field. Rumor has it Chicagoans find this an eyesore but I found it to be pretty cool. Pay a visit and look at your reflection : )", "pics": null}}, {"review": {"des": "Cloud Gate, or what is commonly known as \"The Bean\", is a Chicago staple. Conveniently located in Millennium Park, The Bean is a huge tourist attraction. Luckily, it's FREE & easily accessible. No lines to see the architecture, but crowds are a given. So many people trying to take selfies and pictures of the bean. My dad and I didn't spend more than about 10 minutes there, but we walked around taking pictures of the city reflection on the bean, our reflection on the bean, and any other pictures we though looked cool. One of the best parts was being under the bean because there are reflections from every angle and if you look up you will see yourself in a tiny hole because the reflections are upside down. It's super neat, but I should've read more about it beforehand to better understand the architecture and uniqueness of it. <br>Overall, 3 Stars because there's really not much else to do besides walk around and look at it.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lE5y3AOppCZnZXFKSqiLsg/348s.jpg", "caption": "City Reflection on The Bean"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/68UeozAV0FzV-1Z3TqoPVw/168s.jpg", "caption": "City reflection on The Bean"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/f21NoMK_TPvuazKUKR0Cdg/168s.jpg", "caption": "The Bean"}]}}, {"review": {"des": "You must definitely go here at least once so you can add the perfect hashtags to your Instagram post. #wheninchicago #beantheredonethat<br><br>Kidding aside, there's a lot more here than just the Cloud Gate. The Millennium Park is filled with enormous art pieces by various artists - all of walking distance to each other. The area is definitely attractive for tourists and art lovers. Art Institute of Chicago is also just a couple blocks away.<br><br>It's rustic and modern; serene and chaotic. It's such a beautiful place to be in.", "pics": null}}, {"review": {"des": "This installation is pretty straightforward, it's a giant bean-shaped object that you can walk under. It is seamless i.e. you don't really know how it was constructed. It is reflective at all angles which doesn't seem impressive, but watching your reflection change at every angle and even disappear under the Cloud Gate is actually pretty cool, and a lot of fun. A necessary stop in Chicago.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7dWIgYyKPceLiyPkeMzDGQ/168s.jpg", "caption": "Cloud Gate a.k.a. \"The Bean\""}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gJxemjAzf7NWR_J0n7jDxg/168s.jpg", "caption": "Cloud Gate a.k.a. \"Cloud Gate.\""}]}}, {"review": {"des": "So cool and so fun with interaction! A bit scuffed in some areas underneath, but this is a key spot to visit if you're a tourist. Pretty crowded but it's in a great area and you can get pretty artistic. Bring your hand sanitizer!", "pics": null}}]}