{"name": "the-tamale-guy-chicago", "reviews": [{"review": {"des": "Best f'in tamales ever!!! So cheap he could totally charge way more. We paid $6 for 6!", "pics": null}}, {"review": {"des": "My hot date and I ordered a delicious pack of chicken tamales. The four red tamales had what I thought a generous amount of chicken. He gave a tasty green salsa to accompany. I would definitely purchase again.", "pics": null}}, {"review": {"des": "You haven't had a solid night out on the town in Chicago unless you have run into the tamale guy! Seriously, he is a damn hero.", "pics": null}}, {"review": {"des": "The Tamela Guy came through when I was drunk and hungry. He's a God send. He come down from the tamale heavens when one needs his help. Every time I'm in need on tamales I pray to the Tamale Guy and he answers my prayers. They should build I shrine to him. Amen", "pics": null}}, {"review": {"des": "I'm drunk right now and these tamales taste good like a mother. These little hot sauces are good as hell. This guy just walked in here and walked straight to the Mexican knowing damn well we were gonna  buy some. Yo too good soaked up all the alcohol!", "pics": null}}, {"review": {"des": "This guy is a Chicago institution. Delicious tamales at a great price - I paid $7 for 1 set of 5 tamales. He came to the bar I was at and I couldn't say no. I would totally do it again - I can't think of anything I'd rather eat during a late night out.", "pics": null}}, {"review": {"des": "Never disappoints. I always order cheese tamales and even if he's out he will come back to fill my order when he reups. Every gig I go to I hope and I pray that he comes. I often have luck at the Hideout and Empty Bottle but not always. I'm always so disappointed when a friend wants to leave a show early before the Tamale Guy comes. Even if I'm not hungry I always keep 6 bucks cash in my pocket because I know I will eat them later and they are just as good reheated. Great salsa that comes with it! I'm glad he gives plenty of napkins, I'm always a mess by the time I finish em. Give the man some love, he and his wife that cooks them work so hard and are as much a part of the machine that keeps the Chicago music scene going as any musician or club.", "pics": null}}, {"review": {"des": "You haven't experienced Chicago until you've tried Claudio's tamales at some random 4am bar. I've only encountered him in Wicker/Bucktown/Logan square establishments and every time his tamales had been great. It's a far better late night snack option than greasy pizza or hot dogs. <br><br><a href=\"/redir?url=https%3A%2F%2Ftwitter.com%2Ftamaletracker&s=51186747f0715ac0bbb8c7c800869f77a50dec940b765226741479713a07329f\" target=\"_blank\" rel=\"nofollow\">twitter.com/tamaletracker</a>", "pics": null}}, {"review": {"des": "Ever been drunk in a Chicago bar that doesn't serve food and thought \" Man i'm hungry AF and I'm drunk \" well guess who walks in just moments after that  thought ? His name is Claudio (just like my late fathers ) and he is some kind of a magical tamale fairy god father who magically appears if you wish for him hard enough (Its happened to me twice ).Not only are his tamales ALL that and a bag of taki's but hes a super cool dude . <br><br>Beware of the imposter (he exist !) who kinda looks like him and sells tamales in bars as well .<br><br>There is only One Tamale guy ...and his name is CLAUDIO !", "pics": null}}, {"review": {"des": "I don't even like tamales.. but these are amazing.  The tamales are smaller so the dough to meat ratio is more balanced than most others I've had (it's about 50/50 dough-meat).  If you see this guy walking around get some from him!!! The only downside is they are a little pricey, but when you're out and drunk, these make your night!  All meats and both sauces are legit!!", "pics": null}}, {"review": {"des": "Heard all about him and finally experienced the beauty of this man's work last night at Rose's.", "pics": null}}, {"review": {"des": "Consider your night complete once the Tamale Guy shows up.  <br><br>It's one of those things that you can't plan and it is all up to chance.  But if you frequent the Wicker Park area enough you will be lucky to run into the late night tamale that you desire.  Stocked with tamales, sauces, napkins and more this Tamale Guy has got the system down. I don't understand how these bars just let him in as there is no real benefit to them but maybe he just slips a few tamales to the guys at the front door.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RaILW0TFLnUMWr9TFRd39Q/348s.jpg", "caption": "Tamales..."}]}}, {"review": {"des": "The sheer number if bars that the Tamale Guy is able to visit on the North side of Chicago is impressive. Just when you're sitting in a bar thinking, \"I'm getting a little hungry, and I shouldn't drink anymore without eating,\" the Tamale Guy will come through like a refreshing zephyr. He is quick and doesn't dawdle around, so if you think you hear someone announcing, \"tamale tamale,\" that is him and you'd better act quickly: he has more bars to hit and he doesn't go from person to person so be on the lookout. In his little cooler are ziplock bags filled with 5 tamales each; he has several types available. The tamales are quite tasty. Cash only.", "pics": null}}, {"review": {"des": "I always have an eye out for Tamale Guy when I'm out. <br><br>I am forever indebted to him for the time when I didn't have cash and he bartered tamales for a Starbucks giftcard.", "pics": null}}, {"review": {"des": "Oh, Claudio, my 2am hero. <br><br>For $5, I get my fill of drunk food, and usually have enough tamales left over for lunch the next day. My coworkers are usually green with envy when this happens. <br><br>Please never stop coming to Archie's!", "pics": null}}, {"review": {"des": "Has saved my life multiple times. I saw him once pull a baby from a car wreck. <br><br>One time, his tamales stopped a gang war. It was the al pastor, both sides stopped arguing and started eating. I'd highly recommend it. <br><br>Anyways, flag him down. Tamales are life changing, and they support world peace.", "pics": null}}, {"review": {"des": "Ghadi, Mother Teresa, Princess Diana, The Tamale Guy. Some people are put on this work to do the lord's work and my friends, my countrymen, my fellow Chicagoans...this man is doing just that! Who else would heed the desperate hunger cries from boozed-up bar patrons? Who can say if there is a heaven or a hell...but I have no doubt that saints walk among us my brothers and sisters because this man, this keeper of corn husks, this sultan of salsa verde, this CHAMPION of late night drunk food is a SAINT!<br><br>The world looked up and slurred out \"I'm s'hungry!!\" And The Tamale Guy answered \"..tamales...tamales...\"<br><br>Thank you, Tamale Guy. You are not the hero we deserve, but the one we certainly need.", "pics": null}}, {"review": {"des": "Most of the summer I spend in a stupor, hiding in one of the stalls at work or making clay paws for animals who haven't died yet, in my apartment watching Bojack Horseman or movies I picked up at Redbox, on a divvy going nowhere, at food festivals where I don't eat or in movie theaters. I left Village Tavern and it's night out, the cars and pavement are slick with rain and reflecting light from the street lamps. I'm stuffing goji berries into my mouth that I carry around in a damp paper bag from Mariano's. The berries don't satisfy me, but anything I add will only make them worse.<br><br>At the bar I sat at a table and checked my emails (Urge Ugandan President Museveni to Pass the Acid Attack Bill Now, Chip in and Help Fight the NRA, Find a Home for Syrian Refugees). Seated at the opposite table from me was an older guy, slim, wearing a dark suit and a fedora, and his face was hidden in the darkness except his mouth when his lips peeled back into a smile. Pretty sure he's following me now. I turn the corner where moss has overtaken the brickwork and cascades down the pavement. When I'm halfway down the block I look back, and there he is, the brim of his fedora shadowing his face except for that pearly white grin. I don't know who to call. This doesn't feel like a 911 call, he can still break off and then I'm left trying to convince the cops he was here. The sky fractures with a big, thick bolt of lightning, but no thunder follows it, and this buildup fills me with a nameless dread that makes my chest cavity cold. An ambulance races and flashes its siren lights down Thomas Street, but again, no siren. The lack of noise is deafening. I turn on Division, which is usually a busy street with its bars and outdoor seating, but the earlier rain has turned everyone away. I think I hear laughing behind me but don't want to look. I'm calling everyone in my recent call list. No one picks up. I go into my contacts and try to decide who will answer. Then I see it, a contact I've tried maybe twice before, but who always picks up no matter how late: The Tamale Guy. We stumble through a conversation because I'm breathing heavy and he doesn't speak english. Finally we agree on an intersection three blocks ahead. I drop the paper bag of goji berries and run. He's waiting for me there, with his patented blue cooler, hunched over and spitting in typewriter bursts if I want cheese, pork, chicken. I look back and the man in the hat is gone. It's 6 tamales for 5 bucks but I give him a 10 anyway. The plastic bag is stretched thin, melting slightly from the condensation that builds inside. Before I can tell him how thankful I am, he's gone. I eat my tamales on the hood of someone's car. The tamales are geared to a more American palate, but the masa is wonderfully soft and chewy, steam rising as soon as I bite into 1. Al pastor juice streams down my chin and I'm nodding reverently, moaning to myself. Tamale Guy, you've done it again.", "pics": null}}, {"review": {"des": "This man is a Chicago legend for good reason. <br><br>His tamales are spectacular, and not just because it's 2 a.m. and you're tipsy. Whenever I see him I buy two bags. The first one I eat on the spot, the other I take home and toss in the fridge for the next day. (Okay, I may have woken up with them in a jacket pocket once or twice.) Even reheated and sober, these tamales rule.", "pics": null}}, {"review": {"des": "Sometimes it's 3am and you need some corn and cheese-filled goodness to keep you from going over the edge. Sometimes it's only midnight and you just really wish you had eaten that extra slice at dinner. Like magic, Tamale Guy is there. Even though he reaches an incredible number of bars per night, a tamale guy sighting is just rare enough to be exhilarating.<br><br>If you you're lucky enough to find him, don't miss your chance. One order is 6 warm tamales in a plastic bag. They're smaller than traditional tamales. Instead, they're about the size and shape of half a tube of gogurt --perfect for eating with your hands. Prices vary across different bars - I've seen $5 and $6 - but it's totally worth either price. (Plus that's just smart economics so I'm not even mad about it.)<br><br>(For tamales stored in a small cooler and lugged across the city), these tamales are delicious. The chicken or beef options were a little dry when I tried them, but cheese is always a good bet. And the salsa is great! I'm on team green salsa, but I guess reasonable minds can differ.", "pics": null}}, {"review": {"des": "I have seen a vision. A vision of hope and joy. Of life and happiness. I have seen a light shine in the darkest of times. Times when my stomach aches and the hangry takes hold. <br>It's these times my champion, my hero appears. His red cooler is a beacon of glee. His wares a symbol of unfettered bliss. <br>TAMALES! TAMALES! <br>It is sweet music that calms my fury and fills my soul. <br>Tamale guy, may you ever be blessed and live on forever, for all of us.", "pics": null}}, {"review": {"des": "Some say Legend..... Others use Savior..... I happen to agree with both.  There has been too many times where I needed a late night snack and popping out of nowhere was The Tamale Guy!  I love you Tamale Guy..... Keep doing what you are doing.", "pics": null}}, {"review": {"des": "Everyone knows about the Tamale Guy's superpower of bringing magical tamales to the drunken and wretched of Chicago. But what many people don't know is that his magical tamales respond to the individual soul of the person eating them. Look at the reviews: Good people loved their tamales. Douchebros (of both genders) hated them. <br><br>Such is the power of the magic tamales!<br><br>So if your a good guy or good gal, get yourself twelve great magical tamales for just $10. But don't waste your money if you're a douche.", "pics": null}}, {"review": {"des": "Hark! The Tamale Guy sings. Advertising wondrous things....<br><br>\"Tamale! Tamale! Tamale!\"<br><br>You don't find him. He finds you. A mystical Chicago legend that just appears making you realize you are in the midst of something unusual yet, compelling like: Puppet Bike, The Singing Cabdriver, Ferrari Guy, the silver painted mime who's a living statue, the guy who rides a dog sled in Lakeview....<br><br>Anyhow, he pops up and you are instantly impressed by his efficiency and business acumen. He doesn't mess around and skates through tons of places quickly. He hits all the bars that don't serve food in the many neighborhoods each evening with his cooler full of bags of piping hot \"Tamale!\"<br><br>Speaking of the treats they are temperature wise HOT! $5 for 6. Pork, chicken, or cheese in Oaxacan banana leaves made by his wife. I always get the chicken. They're meaty and the masa smooth. My dining partner finds them bland, but I find them satisfactory.  The green sauce is the shining star! Oh sooo hot and delicious. <br><br>It is a touch strange for some maybe to buy food from a stranger in a bar but infinity people ate them over the years, as well as me several times so it's legit. Don't be fooled though there are more than one Tamale Guy. Claudio is the one with curly hair and not as thin as the other guy. <br><br>Next time I'm trying the cheese and pork \"Tamale!\"", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VF_BvZjUoeqM3vSfVRDBCw/168s.jpg", "caption": "Chicken Tamales. The green sauce was hot as hickory heck"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Raq7kx1iRfjGgu_dWJV_cA/168s.jpg", "caption": "Chicken Tamales"}]}}, {"review": {"des": "Let's start with a caveat - I've never eaten these sober. I've never bought them sober. I can't remember if it's a good deal or what's in them, but I do know every time I see the cooler it is essential that the tamales enter my body as quickly as possible. As a matter of fact, I might not even be talking about the right tamale guy. There seem to be a couple clones, maybe they work together, maybe they're competitors. Either way, this is manna from the gods when you're bopping around west town-wicker-Ukrainian.", "pics": null}}, {"review": {"des": "It's Friday night.  You've been out drinking with your friends for the last few hours, and you feel yourself getting to that point in the night where there is that perfect balance of alcohol in your body, and you think to yourself, \"I am starving.  I could really go for some--\" <br><br>SUDDENLY...The Tamale Guy appears like an angel from heaven with a cooler full of tamales!  He politely enters the bar, wielding his handheld cooler like how the mighty Thor wields his powerful hammer, Mjölnir.<br><br>Faintly, you hear his call from the front of the bar, \"Tamales...? Tamales...?\" and you scramble for your wallet in the hopes that you have some cash left.  Behold! There is a five dollar bill, just waiting to bring endless amounts of joy and deliciousness to your alcohol-filled stomach!  You stumble up to The Tamale Guy, with a smiling Abraham Lincoln in hand, and you exchange it for a warm bag of homemade tamales.<br><br>As you take that first bite in to a warm, steaming tamale, you look up with a single tear in your eye, as the magical Tamale Guy walks off in to the night to spread joy to others.  He's the hero we need.  The hero we deserve.  He is...The Tamale Guy.<br><br>So, yeah.  He makes good tamales.", "pics": null}}, {"review": {"des": "Okay my first Tamale Guy virginity taken at The Map. Omg amazing. It's worth your money. That is all. Good day.", "pics": null}}, {"review": {"des": "I lived next to an amazing tamalería in Mexico for a year.  I didn't have a properly working stove.  Or refrigerator.  I am ashamed to admit the quantity of tamales I consumed for basic sustenance mostly every day.  But it does make me something of a connoisseur.<br><br>Don Claudio is one of the best things about Chicago.  He is the jovial benevolent cherub of greasy salty spicy carbs who appears when you've had just enough beverages (PBR, probably) to need him.  He knows, and he'll be there.  His tamales are not gourmet, but they are awesome.  And you do not need gourmet when he shows up and saves you from blathering too much about the new Animal Collective (though it is pretty good).  You need him.<br><br>(Although Claudio is El Rey, I do want to give props to the \"other\" guy José [Juan?].  His tamales are just fine, and if he happens to show up before Claudio does when I am in need, Claudio does not have my sword that evening.  I will say that his \"TAMALES TAMALES JEFES JEFES TAMALES MISS\" battle cry can be pretty fucking grating, though.)<br><br>Claudio and I talk sometimes.  Usually it's just pleasantries: \"¿Qué onda?\" \"¿Como estás?\" \"¿Algún día vas a traer tamales de frijol negro o tal vez champiñon o calabaza?\"  And though I admire his consistency, since I went vegan my relationship with Claudio has been strained.  It is totally possible to rock vegan tamales, and unfortunately there's just not enough drunk demand for it.  Seriously, though.  Black bean tamales.  Mushroom tamales.  Zucchini tamales.  Oaxacan banana leaf tamales with silky-ass masa.  Daiya tamales (be still my heart)??  Maybe one day he and his wife will relent and we'll reap the spoils.<br><br>That said, I will love Don Claudio forever.  He is the goddamn patron saint of Wicker Park (and its surrounding areas) and I hope he always will be.  I hope murals and tattoos of his visage will sprout up all over the place.<br><br>I have to get this one thing off my chest though.  The singular of the food item we're talking about is: TAMAL.  The plural is TAMALES.  He's either The Tamal Guy or The Tamales Guy.  Claudio probably doesn't give a shit just like most of America but I can't help but whine.  Sorry.<br><br>Also, this one time in the Hungry Brain Claudio stopped in for a drink.  I mentioned to him (in Spanish) that he had a Yelp page.  He didn't know what Yelp was since he didn't have internet.  I explained it was a website where people reviewed businesses and that there were lots of people extolling his virtues, including many women soliciting marriage.  He chuckled sagely, \"Ay, gringos...\"", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oofixDsjJthRzIOyy0v60w/348s.jpg", "caption": "FUCK YOU I'M A TAMAL"}]}}, {"review": {"des": "The Tamale Guy is an underground legend in Chicago. He's just as legendary as The Walking Dude, The Bright Suit Guy (Vincent P. Falk) and the Downtown Black Preacher who stands in front of the Old Navy on State Street.", "pics": null}}, {"review": {"des": "I've just experienced the magic of the tamale man for the first time.  Yes, I am at a bar.  No, I am not drunk.  Honestly, I'm not a fan of tamales.  But I've heard of this tamale legend and have sought to find him.  It's true what they say.... If you seek him out, you won't find him.  Let him come to you.  <br>My rating of 5 stars is based on a few things.  This is, of course, not a Michelin rated meal.  For what if is- a tamale when your out at a bar- it's pretty delicious.  The sauce gives it a little more spice and has a garlic flavor.  The legend, the man, the setting, the tamale. These are the mystical elements that merit a score of this stature.  Kudos tamale man... Brava!", "pics": null}}, {"review": {"des": "We were going out, and we were all like 'I HOPE WE SEE THE TAMALE GUY TONIGHT, HE HAS THE BEST TAMALES!'<br><br>And then the universe, in her all powerful and caring way, said 'Children, I shall align you and the tamale guy at the California Clipper this wonderous evening'. <br><br>And so it came to be. And we had tameles and whiskey and listened to the sweet twang of an old beat up six string.", "pics": null}}, {"review": {"des": "I know people are going to hate me for this.....but I was SO excited to finally meet the Tamale Guy....and I was SOOO disappointed! :( I think the problem was it was not midnight yet and I was clearly too sober.<br><br>He struck Mulligan's in Roscoe's Village and despite being stuffed from the Burger Fest I HAD to try the tamales. I also accidentally got TWO which ended up being two bags of 5 tamales. It made me feel better about spending $5 per bag though :)<br><br>I asked him which were the best, he said pork. But sadly, the pork was extremely bland. Overall super unseasoned and the salsa could've had more kick too. <br><br>One nice thing was the actual tamale was well cooked (I've had some dry/crumbly/flaky tamales) but it just needed more flavor overall.<br><br>Fast forward two hours at closing and I probably would've been leaving a 4-star review. Sorry to burst the buble....", "pics": null}}, {"review": {"des": "What's not to love? This guy has been there when I needed him most. Specifically after a Halloween party in October 2012.", "pics": null}}, {"review": {"des": "OK if I'm lying I'm dying. We were at the HIDEOUT tonight and a guy named bob called a guy named tim cause we needed the tamale guy. Tim says I'm kind of busy cause katie and I are meeting the president tomorrow, I'll see what I can do. 7 minutes later, we're in chicken, cheese and pork tamale heaven - big clue here my friends. He shows up in a blue 4 door beat to shit car with 4 spare tires and no hub caps. He only speaks spanish so of course I give him all of my money cause I do not have clue what the bill is. If this is what does not make Chicago COOL, then I have no idea what does.", "pics": null}}, {"review": {"des": "Whenever the Tamale man finds you, always get some if you're hungry. His tamales are awesome! Making me hungry just thinking about it..", "pics": null}}, {"review": {"des": "Found us at the Happy Village! We bought chicken and cheese. Enjoyed the whole experience and the tamales! Note to my un-tamaled friends; don't eat the husk! :)", "pics": null}}, {"review": {"des": "Here's your cheat sheet: It's $5 for six tamales. Some day I will get this equation right, but I'm usually ordering under duress. Okay, inebriation. And what does this self-induced condition typically produce? A surplus of tamales! You see, I naively order 3 tamales (because that's all I want) but end up with 3 BAGS of tamales (18 total) and spending a whopping $15. Mostly because I feel much too badly about returning the unwanteds to a member of the Tamale Guy cartel. And this brings up an important question: Does the outfit charge a red cooler re-stocking fee?<br><br>Enough digression. After the Tamale Guy moves on, I become the girl in the bar who everyone wants to talk up. Nope, not because they want to get into my pants... rather, they're spitting game at my stash of tamales! No surprise I give it up, every time. Because who can eat eighteen tamales? EIGHTEEN!<br><br>And  - who can give a gallant army of foot soldiers, committed to bravely delivering such a labor-intensive product deep into the night at bars that don't serve food anything less than five stars? Get the cheese, by the way... they're the best.", "pics": null}}, {"review": {"des": "Yep, This review is more like a thank you! You have always been my savior! Delish and cheap with a side of spicy salsa. Please continue to do what you do best, which is delivering tasty treats all over the Chicago-land area!", "pics": null}}, {"review": {"des": "I met my fiance thanks in part to the Tamale Guy. If Claudio hadn't been outside the Continental that night, I wouldn't have gone in.", "pics": null}}, {"review": {"des": "Tamales are great, you can't get any better. This is the best street food i think around.", "pics": null}}, {"review": {"des": "I must say, for a street vendor, The Tamale Guy offers up quite the delectable treat. As a fan of Mexican food (both fine dining as well as smaller establishments) the Tamale Guy stands up quite well to many sit down restaurants. For street fare, you simply cannot go wrong with a delicious pork tamale.", "pics": null}}, {"review": {"des": "I don't understand all the love for this guy.  I mean other than how he pops up when you are drunk hungry and least expecting it.  Also, his tamales are reasonably priced.  But they are coming out of a cooler... so they better be.  However, I find his tamales to be dry and lacking in taste.  Maybe I will buy them again if they come smothered in sour cream next time, because they need it!!", "pics": null}}, {"review": {"des": "Tamale Guy, you make me proud to be a Chicagoan. My fiancee and I love your tamales so much, we'd be honored if you made an appearance at our wedding reception on Sept. 6th at the Zhou B. Art Center in Bridgeport. I know you don't typically make house calls, but it would make our day complete, so I thought I'd just put it out there and see what happens! There will be plenty of tamale-hungry, tipsy folks there come 9:00 or 10:00. So, consider this your official invitation to our reception! Hope to see you there! :)", "pics": null}}, {"review": {"des": "This, in my opinion is all bullshit. It is a classic example of food tasting way better when you're drunk and should not be this highly regarded on Yelp. <br><br>One night at the Innertown Pub in Ukie Village, my friend bit into her tamale and there was a metal shard like spring inside?!? Thankfully, she did not pierce her cheek or slice the roof of her mouth.<br><br>However, being that we were beyond intoxicated, she continued eating her mysterious mechanically-powered Mexican meal anyway. <br><br>Alas, the paradox of the drunk food from the Tamale Guy.", "pics": null}}, {"review": {"des": "The Tamale man is everyones best friend. <br><br>He's short, chubby, and just a round ball of laughter.<br><br>He will bring you hot goodies when you least expect it, and on the cheap. I have learned that you cannot summon him though as I have tried for many years, but that you have to just keep drinking and not even think about his existence in order for him to appear. When he does, even if you have just eaten a late dinner, don't be fooled into thinking you are full and just buy a sack of Tamales with verde and rojo, preferably the pork. At this point you should hold out and try to save them for home as they go great with a cold coke in front of the t.v. If you are truly forward thinking, buy an extra sack and cook up some eggs in the morning and have them on the side. Straight money way to go!!<br><br>Enjoy Suckas'!!!", "pics": null}}, {"review": {"des": "TAMALE GUY FOR (tam)ALDERMAN! <br><br>Minus one star, because sometimes I long for him to appear and he doesn't. What gives?", "pics": null}}, {"review": {"des": "Who doesn't want a delicious tamale after a night of drinking or bars? He's always there when you need him with delicious tamales and salsas.", "pics": null}}, {"review": {"des": "I first heard about this \"Tamale Guy\" a few weeks ago when browsing for new restaurants on Yelp.  So many five star reviews piqued my interest, but the lack of any definitive location had my hopes for actually meeting this legendary master in the gutter.<br><br>Enter the Map Room on a Thursday night, an impromptu stop to say hi to a friend on her birthday.  I'm sitting at the table drinking the only beer I plan on having there before going home.  A man enters the bar touting a small cooler, takes a few steps, glances around before uttering the word \"tamales\" twice.  My hand sprung up into the air and I yelled for him to come over.  <br><br>My friends looked at  me like had gone nuts.  Buying tamales from a stranger at 11:30 without any hesitation?  I told them that we must show this man respect, that he is a legend spoken of far and wide, and that they should be happy to just be in the vicinity of his box of Mexican greatness.  It was awesome, definitely lived up to all of the hype, something that just doesn't seem to happen very often these days.", "pics": null}}, {"review": {"des": "The Tamale Guy is always there when you need him.  Personally, I never know I need him until he appears in the bar at 1am chanting \"tamales tamales!\"  But at that moment, he becomes my favorite person in the bar.<br><br>Don't hesitate to bum a dollar off of a friend or coworker because you know you need a tamale.", "pics": null}}, {"review": {"des": "Love the tamales. Especially the cheese one. Yummm. I had them sober and I've had them  under the influence. Boooo to all the hater's negative comments made and Yey to the tamale guy!", "pics": null}}, {"review": {"des": "One of my favorite places in the city is The Hideout.  They have great music, cheap beverages, and is simply a great place to be with friends.  One of the things I have enjoyed the most is I can always depend on the Tamale Guy to show up around ten each night.  I get 12 tamales for $10 and my friends and I can enjoy these tasty treats together.  There truly is not better food deal in Chicago.", "pics": null}}, {"review": {"des": "Unstoppable!<br><br>[into: Enrique Iglesias Hero]", "pics": null}}, {"review": {"des": "Aptly named.  This guy, whoever he is, knows his tamales.  <br>I almost never order tamales in restaurants because nobody seems to be able to make a real tamale in a restaurant setting.  Not enough of  a cook to understand why but so it seems.<br>Not true any longer.  Enter the Tamale Guy.  I suppose it helps to specialize.  All kinds of tamales.  I went here with a group of 8.  We were all soon stealing bites off of one another's plates to taste them all.  Delicious and priced right.  I will return repeatedly.", "pics": null}}, {"review": {"des": "\"Someone Saved My Life Tonight (Sugar Bear)...\"<br><br>Oh yes he did.<br><br>I was on drink number 18342 at Cole's and feeling roped and tied. At that point, I would have killed someone for some food when TG showed up with his delicious booze-absorbing corn-y delights.<br><br>There is a God. This is proof-positive.", "pics": null}}, {"review": {"des": "Tamales! Tamales!  Music to my ears and stomach.<br><br>I wish I could give him 1,000,000 stars...or his own restaurant. <br><br>Latest run-in was on Saturday - Wicker Park on Milwaukee.<br><br>This was just one of many, many times throughout my barhopping career, but it's been a while since our last encounter, years actually.  And the tamales are still that great and Claudio just as friendly.<br><br>He was out of cheese, though, and those are the best ones.  No complaints on the pork/chicken that we had on this night though.<br><br>1,000,000 stars.", "pics": null}}, {"review": {"des": "I've had some crazy incidents with the Tamale Guy. Once, my girlfriend and and I were at a random bar and I said to her, \"I wish the Tamale Guy was here.\" POOF!, he magically and instantly appeared! Another time I was out with my best friend at another random bar. I got some tamales, but he passed. However, as soon as he smelled mine, he changed his mind and wanted some. The Tamale Guy was about halfway out the door and we went after him. By the time he got out the door, we were maybe 3 steps behind him. We get outside and POOF!, he's magically gone without a trace! Another time I was at one random bar with a couple friends and the Tamale Guy showed up. The bar was dead, so we left about 2 minutes later. We drove to another bar 5 miles away, walked in and THERE WAS THE TAMALE GUY!", "pics": null}}, {"review": {"des": "I am at a bar. I am very likely drunk. HOWEVER I can attest to at least five occasions where I have been served DELICIOUS tamales for $5 by the tamale guy. He is efficient and ruthless and I love his style.", "pics": null}}, {"review": {"des": "When you are drunk at a bar and the Tamale Guy arrives, it's a great thing.<br><br>That is all there is to say.  Just buy them.", "pics": null}}, {"review": {"des": "After years of hearing of the \"mysterious tamale guy\" and keeping my eyes peeled for him, I FINALLY ran into him last night. My boyfriend and I were about to leave The Long Room and I was in line to the restroom. He walked in with a cooler yelling \"Tamales!!\" and immediately caught my attention. Me, standing in line, wide-eyed and mouth gaping, points at the guy and manages to yell two words--my boyfriend's name (DREW!) and tamales (TAMALES!). I rush in and out of the bathroom in a manner of seconds to dash back to the bar and pull out $5 for the pork tamales.<br><br>For some reason we didn't know that we'd be getting more than two tamales, so we were pleasantly surprised when we had seven in the bag! We immediately sat down at  a table and opened up the bag of tamales. They were piping hot (how does he keep them so hot?!) and we dipped them in the green salsa. These tamales were absolutely fantastic, and they reminded me of the authentic tamales of my childhood when I lived in New Mexico. They were wrapped in corn husks, and the meat packed a spicy punch and was well flavored. The spiciness seemed to grow with every bite and definitely stuck with you, but in a good way. I would've loved to have gone back for more, but the Tamale Guy made a quiet exit.<br><br>The next time I run into this guy (which I hope isn't in another 5 years) I'd love to try the cheese and the chicken.<br><br>No matter how full you are, if you see this guy do yourself a favor and buy some tamales.", "pics": null}}, {"review": {"des": "The Tamale Guy is a legend.  Not only are his tamales delicious, but he is literally a part of redefinining food experiences in Chicago.  You don't have to go to a restaurant to have cheap and good quality food, it can come right to you!  The best part of it is the unpredictability...when he does come to the bar you're at, you know you've got to buy tamales now or you might not have the chance to again for a while.", "pics": null}}, {"review": {"des": "Btw, I've had these amazing tamales on and off for 20yrs!!!! I've had them drunk at 4-5am. And have had them sober. And I've eaten them cold the next afternoon. They are ALWAYS amazing !! I don't know what these people do differently than all the other amazing talmales around the city. But in my book. They ARE number 1 !! Run when you see them. Once they are gone. They are gone.", "pics": null}}, {"review": {"des": "Claudio, you are my hero.<br><br>When I long for a tasty and portable snack you appear like a cheerful oasis in the desert of Wicker Park. Somehow you are not put off by me running into traffic on Milwaukee Ave whilst screaming \"HOLY HELL TAMALE MAN\", thank you for never judging me and my antics. No evening is complete without coming back from a blackout by finding a bag of tamales and verde sauce in your purse. <br><br>Claudio, I'm not sure if you're the Walter White or Jesse Pinkman of this whole tamale operation but your product is just as addicting as the stuff on Breaking Bad without all the nasty aftereffects.", "pics": null}}, {"review": {"des": "Fantastic tamales and this guy is literally everywhere in wicker park and no one can turn him down its fantastic. Not sure what ingredients he uses but everything is fantastic", "pics": null}}, {"review": {"des": "YES, YES, YES! I was heading to a bar to watch UFC and I ran into tamale guy outside on the street. Unfortunately for me on that go around I had just eaten a giant slice of pizza. Thankfully he came around again and one of the guys in the bar watching UFC bought several bags of them. All I can say when I found that out was: SHIP IT!<br><br>So, my chance didn't pass afterall. And boy was I happy. These were flat out some bangin tamales. Actually, they were the best tamales I've had. These tamales were somewhat spicy and I'm not sure what the actual tamales were since I wasn't the one who bought them. Thankfully I was just a lucky bystander and got to sample the wares. <br><br>Hopefully I run into tamale guy again and have not just gorged down some pizza. I knew it was him the second he was offering tamales an rued my  luck (at the moment at least). At his price these were great, at the free price I got, they were even better! So, if you're drinking around bucktown/logan sq/wicker park and a guy asks you if you want tamales, you say yes and bust out the cash as fast as possible.", "pics": null}}, {"review": {"des": "I remembered every fall my great grandmother would be slaving away until spring making tamales, hundreds of tamales for our large family and friends. Growing up in California, you could have your door knocked on by a kid asking if you want tamales, who'd run and gather however many you were asking for.<br><br>My girlfriend, of German descent, has never ever had tamales. I kept telling her how amazing they are, how great they are, and that when we get the chance, I'll make sure she gets them. We had read on the Tamale Guy before, so we were always anxious for the chance that he may show up at a bar we are at..<br><br>Fast forward, nine months later, the night of my girlfriend's birthday. As we are leaving the bar, I spot a man half my size with a bag and an ice chest. I knew who he was before his word left my lips. He spoke first, \"Tamales.\" My girlfriend screamed in excitement. I gave him twenty dollars.<br><br>We ate half of them, her drunk, and myself partly sober. She was in love.<br><br>We ate the other half for breakfast and they were still great. So they passed the sobriety test.<br><br>It isn't my great grandmother's tamales, it isn't the best, but god damn when you need tamales and you see him, you're a fool to not take that chance. <br><br>They're small, but tasty.<br><br>The verde is only spicy if you think taco bell hot sauce packets are spicy. It is flavorable, but spicy? No.<br><br>Should it be covered in sour cream? Do you think desecrating all that is holy is okay?<br><br>The only thing that needs to be on those tamales other than ingredients is my mouth.<br><br>It is roughly a dollar a tamale, maybe like seven five cents. Worth it. So worth it.<br><br>He's also really nice. We came across him in the Innertown Pub.", "pics": null}}, {"review": {"des": "An itinerant, I consider myself lucky to have sampled fare - completely by chance - from the legendary Tamale Guy.  You could be at a bar, and he's there. I had the chicken tamales, which were just awesome with the salsas!", "pics": null}}, {"review": {"des": "I ate a large dinner before heading out with friends, and then... The Tamale man appeared. I couldn't resist his tamales and they were just what I needed. I thought he was a legend, but he is real.", "pics": null}}, {"review": {"des": "After hearing all the hoopla and praise for this local phenomenon, I finally got a chance to taste the famous Tamale Guy's tamales. I've seen him before, but never had the desire to try one of his late night saviors.<br><br>The last time I had a tamale was 1988 at the tender age of 8 and I came to the conclusion I did not like tamales. I heard this guy had some good stuff, so I gave it a shot last night at the California Clipper when he showed up. Such a disappointment! I did not really care for the tamales at all. I was nice, but i was not wasted. Maybe I have to be wasted to enjoy them, at least thats what I was told.<br><br>Why 3 stars? Well I commend a guy that runs around selling tamales, $5 for a bag of 6 to drunkards like myself in various areas. I think he is really a cool guy, but I'm just not into tamales", "pics": null}}, {"review": {"des": "Hilarity.<br><br>Last night at Goldie's I witnessed the Tamale Man in all his glory.  He was walking around, pitching his usual \"Tamales, tamales, tamales!\" and this crazy drunk girl was just like \"What?!\"  <br><br>He proceeded to get really close to her face and just yell \"tamales\" at her until she just turned around.  <br><br>I love you, Tamale Man.", "pics": null}}, {"review": {"des": "The tamale guy is one of the reasons I enjoy living in Chicago. Twice I have gone to the California Clipper late after some drinking and having fun, and both times he appears as if by magic as soon as I am really wanting to have a late night snack.  We get the cheese tamale's and they are moist and flavorful.  They even come with sauces.  Our table was much happier after his visit.  We even took a couple home and warmed up the next day.", "pics": null}}, {"review": {"des": "If you ever see the Tamale Guy roaming your favorite neighborhood tap, make sure to take him up on his offer of tamales. They're inexpensive, delicious, and perfect after a couple drinks. And you will wake up with super powers. He's that good.", "pics": null}}, {"review": {"des": "Visit <a href=\"/redir?url=http%3A%2F%2Fnocronies.com%2Fcampaign%2Fstreet-vendors%2F&s=0d3a887e851d9b52be2d9c986a25f8dc53e25474e34e9d3addf62cf207e9f0be\" target=\"_blank\" rel=\"nofollow\">nocronies.com/campaign/s…</a> to sign the petition to legalize street vending in Chicago, and check out the documentary \"Una mujer y su carrito\"(<a href=\"/redir?url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DbajmdHt-Dyc%26feature%3Dyoutu.be&s=ce7f10998532c7f2b88b3cb2f00ff52062b206f9872d9035476c49149cffa2e0\" target=\"_blank\" rel=\"nofollow\">youtube.com/watch?v=bajm…</a>) to learn more about street vendors like Claudio and Claudia.", "pics": null}}, {"review": {"des": "The equivalent of the Tamale Guy when I was at SIU was the Bagel Man and you can scarce tell the difference. Different foods obvi but the outcome is always the same....and you're always a victim of circumstance in that it's impossible to pass up when you happen to be at an establishment when he arrives.  <br><br>Inebriated or not, they are very good tamales imho.  When I think of what a tamale should taste like, this would be it.", "pics": null}}, {"review": {"des": "I first experienced a Tamale Guy attack at Guthries on Addison. We'd been drinking for several hours and were elbow-deep in a highly competitive game of Monopoly. Guthries has no food available, so when The Tamale Guy swooped in at around 11pm with his cooler, we were thrilled with the sudden tamale availability! <br><br>Each of us bought a bag of 5 or 6 for $5 and suddenly, tamales were the new currency of the evening. Owe $1250 on Illinois Ave? No problem, slip them a $500 bill and a beef tamale. Want a beer but your cash is low? Two tamales and a promise to wash your friend's car gets you more.<br><br>The best part was that aside from being there and edible, they were really tasty. Granted you can easily get to the point where you'll eat cardboard with Cheez Whiz on it when drinking, but these were just the right amount of meat/cheese to corn meal ratio, and they were moist and hot. Plus, beer and tamales is like a power recipe for a partying second wind.<br><br>I hear The Tamale Guy phenomenon happens elsewhere on the city, specifically around Wicker park. I need to check this out.", "pics": null}}, {"review": {"des": "Must recommend the cheese tamales - love them.  Cold, they even make a good breakfast the next morning.<br><br>I suspect that behind every Tamale Guy is a Tamale Lady not getting her due.  So, I raise my glass (and btw, that's a Blue Moon wheat ale) to the Tamale Ladies.  Thanks for your hard work that cold, winter night in Humboldt Park or Ukrainian Village or wherever.  Sure, the Tamale GUY delivers the goods, but you make it good.  You rule.<br><br>The west burbs need a Tamale Lady like Mars needs chicks.<br><br>Unionize?  Just askin.", "pics": null}}, {"review": {"des": "What everyone below says is true. This magical man appears without being summoned and his tasty delights will satisfy your desires. Buy enough to have left overs, you'll be glad you did. Thanks Tamale Man.", "pics": null}}, {"review": {"des": "The chances of running into the Tamale guy are slightly higher than catching a chupacabra. However, I would imagine the joy that would come from actually catching the chupacabra is on par with the joy people feel when they realize the Tamale Guy has arrived in their bar. <br><br>As a purveyor of masa based deliciousness, I highly recommend anyone who does see the Tamale Guy in their bar to try out his tamales at least once. They're almost as good as his legend.", "pics": null}}, {"review": {"des": "Yes! This guy is a Chicago legend! Few things make me happier than when I am out at the Tamale Guy shows up.", "pics": null}}, {"review": {"des": "-  a dollar you find in a pair of jeans out of the wash<br>-  a piece of chocolate at the bottom of your purse<br>-  a bird pooping on someone walking in front of you that you miss by a hair<br>-  the tamale man showing up at the bar you're at<br><br>all things that you don't expect which result in fat toothy grins.", "pics": null}}, {"review": {"des": "He did it again!! The tamale guy showed up last night right when I needed him to!  I was hungry, thinking about pizza, but wanting more beer... and all of the sudden... there he was... his gorgeous self walked into the beer garden and had fresh, hot tamales for sale!  Not sure really what he looks like, nor his personality, but, his tamales make him beautiful to me!!<br><br> <br>OK, so the 1 of my cheese tamales was not his normal quality (had almost no cheese), but the rest?  Perfect.  <br><br>Thanks to the tamale guy, I made my 7:30 appointment this morning!<br><br>By the way, is he married to the muffin lady?  I have not seen her for a bit... What a marriage that would be, the tamale guy, always there when you are hungry, and the muffin lady, with her special ingredient muffins...", "pics": null}}, {"review": {"des": "Every time I am at a bar, I hope the good Tamale Guy walks in with plenty of tamales rajas con queso.", "pics": null}}, {"review": {"des": "I have to admit I had no idea who this guy was when he walked up to me in the middle of my game of darts and asked me if I wanted a tamale.  I was unsure if I would be poisoned or what I was buying, but I decided that I had enough Miller Lite antibodies in my system to battle even the most vicious food.  There was no stomach warfare!  The tamale guy delivered a wonderful treat.", "pics": null}}, {"review": {"des": "I hadn't seen him in FOREVER and then one night he popped into Delilah's......my friend & I were standing outside, but we knew to act on it while he was there.  SO GLAD WE DID.  While my other friend laughed when we walked in with our bag of tamales, she was happy we bought them as she ate half of them!  <br><br>I can never find a tamale vendor when I need one during the day, but at night...I know I can count on Claudio at some point in time!  Sober.  Drunk.  They're delicious.  Plus, he's a really nice guy.  How can you NOT like him?", "pics": null}}, {"review": {"des": "Does the thought of expensive, underwhelming fruits and vegetables worry you?<br><br>Does the thought of a questionable-looking dude in a hat and sunglasses hanging around make you wonder what kind of neighborhood you're living in?<br><br>Have no fear, for the Edgewater Produce Tamale Guy is here to dispel BOTH of these urban concerns.<br><br>For almost a year, I swear this guy was committing felonies in broad daylight. Turns out he's selling amazing tamales for a buck each! Get your cheap, incredible produce schwerve on; exeunt le market de produce and grab a sack full of tamales (it's true, try the pork), then saunter home with a spring in your step. Your friends and significant other(s) will fall to their knees and worship you just to get a bite of these tasty comestibles.<br><br>He even gave me three tamales when I only had two bucks, saying, \"For you, take three\"<br>Will I be back? Indubitably.", "pics": null}}, {"review": {"des": "just had my 30th bday.  the last thing I said (to a bunch of out of towners and locals) before going out for an expensive, fancy dinner and lots of drinks to follow it up was, \"the one thing that would complete my bday evening and end it with a bang, would be I'm drinking cheap beer and the tamale guy would show up at whatever bar we're in at the end of the night\".  Well, guess who's 30th ended perfectly?!?!  MINE!!  Was at Inner Town Pub to end the night, and like Jesus descending upon his disciples, lo and behold the Tamale Guy appeared....and I said unto him, \"I would like 2 packs of queso tamales, por favor\".  And he then bestowed upon me the greatest of the lords gifts....12 tamales with salsa verde (for a mere $10).  And I lived happily ever after.  The end. <br><br>Moral to the story: Never pass this sh*t up people.  Never.", "pics": null}}, {"review": {"des": "It's not drunk food because I've eaten my share of the tamales while sober.<br><br>$5 to make ya holla!<br><br>Hell.. he even has a myspace profile: <a href=\"/redir?url=http%3A%2F%2Fwww.myspace.com%2Ftamaleman&s=f3661567285ea7adef78d2718e0065bd082318598714920b880d0b8dea29f98d\" target=\"_blank\" rel=\"nofollow\">myspace.com/tamaleman</a>", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/A6dTPs3UewtIP7ZQI2K42g/168s.jpg", "caption": "5 Dolla Holla!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RLTmNOEBbcPtANLgSFtqtQ/168s.jpg", "caption": "hell yeah!"}]}}, {"review": {"des": "The best mind-reader ever, when it comes to knowing the right time to hit bars, and when people will suddenly be hungry for food!<br><br>Anyway, I'd kept sadly thinking I would never get lucky and see the Tamale Guy, until I was at Cody's last night, so I ran right to him and got some queso tamales. Loved them, and how his cooler can somehow keep them so warm after all the time it takes to drive to various bars in the city!<br><br>Too bad I doubt he'd ever venture all the way north to Edgewater or Rogers Park bars, but I won't deduct him points(erm, stars) for that. I still love his food too much to give him less than a cinco review!", "pics": null}}, {"review": {"des": "Dear Tamale Guy, <br>THANK YOU. THANK. YOU. T.H.A.N.K.Y.O.U. <br><br>Thanks for stopping into Lottie's last night. <br>You walking into the bar was the only thing that made my night good. We just got killed in softball and our season was cut short due to the fact that we sucked. Your tamales talked me off the ledge. I'm in love you with and your cooler full of little delicious rockets.  <br><br>P.S., you're just as spicy as your green sauce. ;)<br><br>Your biggest fan, <br>Christine", "pics": null}}, {"review": {"des": "Seriously, dude...you were my first tamale. <br>You came when I needed you. You were my hero that night.", "pics": null}}, {"review": {"des": "Love these tamales!<br>So exciting whenever he rolls up to a bar with those cooler beacons of hope!<br>I happened to be a the fireside bowling alley bar even a few saturday nights ago and he SHOWED UP THERE TOO!<br>Guess he ventures out and enjoys a good bowl too!<br>THey were delish too,.....however does he still have the salsa? havent see that of late or maybe since i always seem to be handed tamales and dont actually purchase them, maybe i wouldnt know.", "pics": null}}, {"review": {"des": "Remember when you used to be able to brighten up a boring story by saying \"and then I found $5?\" Claudio is like that, \"Oh I just went to a bar last night, BUT THE TAMALE MAN CAME.\" (Sidenote: I feel 'Tamale Man' has a better ring than 'Tamale Guy')<br><br>I just had leftover tamales from Thursday for breakfast (it's Monday). They were still awesome. It's not just the novelty of Claudio's entrepreneurial spirit (and the fact that you're probably drunk). These tamales are delicious even removed from the context!  <br><br>Get the pork.", "pics": null}}, {"review": {"des": "The tamale guy came up to us while we were at Nick's Beer Garden.  This was probably the best thing that could have happened.  We ordered 1 sack of 6 for $5, quickly devoured it and ended up getting another.<br><br>I dunno if it was partially due to the amount of alcohol I had consumed that night, but those were probably the best tamales I've ever had.", "pics": null}}, {"review": {"des": "Re: the sanitation comment.  That's one thing that's just wrong in this country.  People have become so mallified and germaphobic that they can't see eating outside of a restaurant or strip mall, as if that gives them some kind of feeling of security that their food will be somehow better or safer.  <br><br>Go to any country in Asia and for less than $2 you can get a meal on the street better than most Americanized asian dishes served in restaurants here.  If you want real color, flavor, and culture you can leave these folks  w/an entrepreneurial spirit alone who are bringing a true taste of their culture to our midst, or instead legislate them out of existence.", "pics": null}}, {"review": {"des": "Oh, Tamale guy. This wandering vagabond, with his blue cooler laden with delicious, authentic, cheap beer-soaking masa of dubious FDA approval, is like a strange, beloved visitation at any bar. <br><br>He appeared on my very first night out with co-workers in chicago, and ever since he's sort of been this ghostly legend. I imagine if he appeared in a different time, we would have Saint Claudio, whose miracles include feeding the whole bar from a single cooler. <br><br>His tamales are some of the better I've had, but he knows his market well, as really, I was pretty drunk, and it doesn't take much to make a drunk happy at 1am. <br><br>I only hope that I may one day soon encounter the tamale man again before I must depart chicago.", "pics": null}}, {"review": {"des": "Dear Tamale Guy, <br><br>You are awesome.  I still recall the first time I met you at The Map Room.  I was sitting there drinking delicious beers at my favorite bar in town, and I was saddened at the fact that I may need to walk to Arturo's Tacos in the cold and leave my beloved bar.  Right as I was about to leave...in you come like a superhero whispering \"Tamales...Tamales!\" ...<br><br>Tamales?  Hell yes, I'll take a small bag of 'em.  Complete with their little salsa and napkins.  They totally hit the spot and were delicious.  I was going to order more, as by this time, everyone had started eyeing and stealing my tamales :(  However, as stealthily as you came in, you left :(  Awww...<br><br>You've been a pleasant surprise during many nights of debauchery with friends :)  I hope to see you popping in once again Mr. Tamale Guy.  <br><br>Love,<br>Alex", "pics": null}}, {"review": {"des": "A few friends were in town for the weekend when I had my back turned to grab our beers. <br>\"A guy just walked back with a case of tamales....\" <br>My roommate and I took one second to look at each other before running after him screaming TAMALE GUY!!! Literally stalking him outside of the bathroom, waiting, waantinggggg. Because that's what you need to sop up that whiskey you're already regretting. Because if the tamale guy shows up, it's much less likely that you're going to have to go home and try and figure out how long pizza rolls take in the microwave, if you have the patience to get them out of the bag. Because they are delicious and beautiful and everything you wanted all night.", "pics": null}}, {"review": {"des": "Don't try to find the Tamale Guy... he finds you.<br><br>You're at the bar. You've had a few drinks. You don't even realize how bad you want -- nay, NEED -- a tamale. <br><br>And then... the humble man with a cooler full of delicious warm awesomeness appears out of thin air.  <br><br>This guy covers some serious ground over the course of a weekend. Is there, in fact, only one?", "pics": null}}, {"review": {"des": "This has gotta a biased set of reviews - I mean, what percent of people buy food from the Tamale Guy when they are sober?<br><br>That being said, Tamale Man's Tasty Treats will help you out. Honestly, the tamales themselves maybe three stars, but he gets a four for two reasons<br>1) Already mentioned, everyone eating these things is drunk<br>2) Food is good for drunk people, it absorbs alcohol and eases hangovers, therefore, this guy is more like a public health official.<br><br>If you have the good fortune to see El Senor, I recommend los tamales.<br><br>Also, the first time I had these, on the feet of El Senor came a woman who was selling cupcakes, including one which had actual bacon on top. Does anyone else know who this mystery stranger is?", "pics": null}}, {"review": {"des": "I've had the Tamale Guy's food once.  I don't know where, or how, but it surely went down.  I yearn for the night that I can taste those delectable treats once more.", "pics": null}}, {"review": {"des": "Dear Tamale Guy,<br><br>I realize that you are probably already married. I'm sure your current wife is lovely and helps you make all those magic tamales you shill to drunks in Bucktown, Ukie Village, and the Wickaaaaa.<br><br>Hell, maybe you beat the crap out of your current wife. Maybe you force her at knifepoint to make those tamales. Maybe she cries at night because her hands are rubbed raw from folding the corn husks around the magic tamale goodness and you keep her chained in a basement cell with only corn husks to eat.<br><br>But I do not care.<br>Because I love you Tamale Guy. And no amount of violence or husks or tiny cages will temper my love or cause me to forsake you.<br><br>Tamale Guy, run away with me. Run away with me and we will be married. And if you are already in a loveless marriage but don't want to get divorced because your Catholic relatives will shun you, then just run away with me in general.<br><br>Please bring your little insulated bag of hot, fresh tamales - $5 per bag  of 6 tamales with napkins and salsa verde and that red salsa that isn't as good but comes with just the same.<br><br>And we will ride off into the sunset.<br><br>I love you,<br><br>Stacey", "pics": null}}]}