{"name": "the-bad-apple-chicago", "reviews": [{"review": {"des": "We initially went here because of the Friday happy hour burger and drink special for $10. Starts at 2:00 on Friday. Ok, you're thinking the same thing I did - a burger, fries and a beer for $10? Really? How good could it be? Well, it can be EXCELLENT!! It's the Bad Apple Burger with any beer $5 or under on their extensive beer list, with fries which you can get plain or seasoned. <br><br>After our first visit, I had to go back to make sure there is consistency. You understand. It's called research. And boom. It was fabulous again!! Cooked to perfection at medium/medium rare with that coveted pink center every time - how often does that happen? So many places cook them to well done no matter how you order it. Not here. I even made a comment to our server. She said they take great pride in their temperature control. It shows. <br><br>Beer selection is really impressive as well. The atmosphere is \"neighborhood pub\" and that's my kind of place. Servers/bartenders have always been first rate. <br><br>I've not tried anything else on the menu yet. If I can ever convince myself to not order that burger, perhaps I will. But that burger is awesome!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hFTpQ10otbr5Tu6FpNQiGg/168s.jpg", "caption": "Kidnapped by Vikings IPA. Delightful"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/F8vRzSPaPSfXLzxPIcSluQ/168s.jpg", "caption": "Great beer selection and awesome food!"}]}}, {"review": {"des": "If you're looking for somewhere with a long list of delicious beers on draft and good poutine, this is it! They have traditional and funky beers, so no one is left out, and their prices are very reasonable. <br><br>The team supports each other, so you always get a wonderful customer experience. Tip sharing FTW.<br><br>P.S. If you're not into beer, they also make amazing margs.", "pics": null}}, {"review": {"des": "I went to this for dinner with a friend last night, we both ordered a drink and an entree each. I think the prices for drinks are really decent, I had a four roses on the rocks and it was only $6. The food was pretty good too, although I wish my sandwich was not over stuffed since it made it really difficult for me to eat it, but I enjoyed the taste.<br>The place was decorated with dim lights that gave it a really cozy look, they had these cool paintings or more like art stuff hanging all over, and some crafty items everywhere, which I think was a nice addition to the decor. <br>Overall, it's a good place to checkout for a casual night!", "pics": null}}, {"review": {"des": "I'm all about the burgers. I'm always down to try new burger places whether they have 1 type of burger or 20 types, give me that cooked medium rare! So if you head to the Bad Apple you will have plenty of innovative Burger options to choose from. For my 1st (and long overdue) time here, I chose the \"DA BEARS BURGER\": CUSTER'S LAST STAND which is topped with smoked brisket. chipotle cheddar sauce. on a pretzel bun. It's a meaty sandwich and you'd better be hungry. It comes with fresh cut fries which was amazing. While the burger was juicy and delicious, the brisket was a tad dry. There are plenty of beer options as well so there is no shortage on that subject at all. I do look forward to coming back and trying another burger here as it's a great location and parking can easily be found on Lincoln Avenue.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CvxTgxQL-9ZkOPl6hIuMNg/348s.jpg", "caption": "This is \"DA BEARS BURGER\": CUSTER'S LAST STAND. It's accompanied with my pal Surly."}]}}, {"review": {"des": "The Bad Apple is definitely becoming one of my favorite spots in the city. They have some of the best burgers in the city with amazing flavor! Also, it's some of the best service I have received in the city! They have a ton of beers and good whiskey selection at reasonable prices. The bar is cozy and is open late on weekends. I will be coming back as I have to try every burger they have to offer. Yes, they are that good!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Qcl6niOqMNUCqUjmmcwTRA/168s.jpg", "caption": "Roman Patty Melt"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/b6rbqseKZLPdhDot39HtWQ/168s.jpg", "caption": "The Suffering Succotash Burger. Delicious!"}]}}, {"review": {"des": "Came here for a Sunday afternoon birthday lunch. They don't accept reservations but were absolutely able to accommodate a party of 5. What really impressed me what the friendly and collaborative nature of the staff. Everyone on the floor was willing and able to help, instead of the \"assigned\" staff member. Absolutely no complaints. We ordered grilled cheese and the bad apple burgers and they were more than happy to take modifications and substitutions. Everyone's food came out at the same time (quickly) and everything was hot. We moved over to the bar after our meal and had drinks/dessert. I will definitely be going back.", "pics": null}}, {"review": {"des": "GREAT BURGER! I came here for a co-worker's birthday for lunch last week and ordered the bad apple burger with firecracker fries and a beer. Needless to say i cleaned my plate! The burger was cooked well and had a filling amount. The fries were crispy outside, fluffy inside. I really enjoyed my basic order because if you can't get the basic burger right, i'm not going to order a complex burger from you. Truly will be back to try all the flavor combos here. <br><br>A friend ordered the meatless meatball sub and I snuck a taste. I couldn't tell that no meat was involved! I truly thought that there was sausage of some sort in it, but nope! Coated with tons of cheese and giardenera, you can't go wrong with such a solid meatless option.", "pics": null}}, {"review": {"des": "Bad apple is always great! The burgers are always fresh and the combo of ingredients are unique and thoughtful. <br>Today I tried the buffalo veggie wrap. I love buffalo sauce! I would have liked more buffalo sauce. But overall it was a nice sandwich. The truffle fries were a nice compliment.<br>We also tried the wrath of Julia child burger. Medium rare. A great combo of salty and sweet. As mentioned, all burgers are great so you can't go wrong. <br>Their patio is also spacious and inviting!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kMvzLcVAIgjHCDy0X-ZHzQ/348s.jpg", "caption": "The wrath of Julia childs"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WlMtJJE6zy7n2TnCGGE3WQ/168s.jpg", "caption": "That's a wrap"}]}}, {"review": {"des": "Honest review: wasnt the worst burgers i ever had but the food isnt good think its more of a place to drink beer n hangout then anything because most people here were drinking not eating. Ambiance its big theres a lot of parking theirs a patio. Service: its typical bar service not attentive not helpful just wasnt good service forgot things had an attitude . Food: there were a lot of issues. One thing i hate is to be charged like 25 cents or 50 cents for everything its annoying. The buns were not toasted like none of them were toasted so the burger was falling apart. The burgers needed seasoning. The burgers weren't executed correctly like the way their described on menu seems amazing then when ur taste it n ur like ya this was a fail. The fries were crispy but needed salt and pepper badly tried the truffle salt old bay and curry. The truffle salt was a joke their was no truffle flavor. The old bay had no taste whats so ever n the curry tasted weird. One of the biggiest issue with the burger was in the thunderdome there were 3 bones. Thats the first time there were ever bones in my burger <br><br>Special poutine $10: fries were crispy. There wasnt a lot of cheese. The pulled pork was on the salty side the gravy wasnt that flavorful <br><br>Thunderdome $14: i liked the addition of onion rings for crunch liked the horseradish sauce just put more wasnt that flavorful honestly and there were bones in my burger<br><br>Elvis last supper $12: love peanut butter and bacon together but this wasn't executed correctly. The issue was the peanut butter it was so dry so it was difficult to eat like u know when u run out of jelly so u just eat a peanut butter sandwhich and its so dry n gets stuck on the roof of ur mouth it was like that.<br><br>The figs is in $13: in theory a good idea but the execution wasnt there. The figs werent sweet enough. There was no bacon it needed that salt component and there wasn't enough goat c", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/s3AYYmkgm62NtsEyX1fagw/348s.jpg", "caption": "Menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SJv8dJbG0z4ybGhcwr67vg/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VAEDjVDcqvrCavuGuBVG6Q/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "I'm so happy that I stumbled across The Bad Apple while out and about in the North Center area. The outside of The Bad Apple is beautiful. The signage is very rustic looking and the giant apple above the door definitely stands out.<br><br>The Bad Apple is the ultimate neighborhood bar and restaurant. The inside was surprisingly spacious and the wait when we got in was very short. I love that the inside decor is very random because there is an assortment of murals and iron artwork. The Bad Apple is very woodsy and the ultimate place for people that love quirky decor.<br><br>I fell in love with The Bad Apple because the staff is so awesome. My fiance and I arrived at the restaurant ten minutes before the happy hour special ended. The hostess made sure to inform us of the special before we missed out on the great offer. I was able to get a delicious burger and glass of apple cider for $10. <br><br>The menu is not that extensive so I would not expect anything that would blow you away. They have a nice selection of burgers, it seems like they specialize in burgers, and other items are things you would typically find in a neighborhood bar. I love the vibe that The Bad Apple has and visit when the weather is nicer so I can enjoy the outdoor patio.", "pics": null}}, {"review": {"des": "I wanted to give it 5 stars for the ambiance and the food but my burger had too many bones that thank God I did not damaged my molars.  I had the short rib hamburger with regular bun so they made it just the way I like it medium well no pink.  I loved the hint of wasabi and the huge fried breaded onions made my hamburger very delicious .  The fries were amazing.   Our server was ok just the fact that many places charge you extra for every little thing you ask on the side is ridiculous because if I wanted a pretzel  bread was an extra dollar but I don't like pretzel burger but wanted mayo I was charged extra for flavor salt and extra for mayo.  <br>The ambiance is great you can have fun in the patio or a great time inside and have a drink in the huge bar", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5uP_MCi740jHBidHBApl-Q/348s.jpg", "caption": "Inside"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/np519ZG3NjXficl0kcKzOg/168s.jpg", "caption": "Inside"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hKWZAWUyQpmGvAkRDyl6Jg/168s.jpg", "caption": "Patio"}]}}, {"review": {"des": "Went here on a recommendation from a friend who lives in Chicago. We stopped in on a Saturday afternoon ... with luggage as we were waiting for a flight... and it was not that crowded. Had no problem sitting at the bar. <br><br>Bartender was super friendly and attentive. The Bad Apple reminded us of a bar from back home but we couldn't recall which. So it's just that kind of place. Homey. Even if Chicago isn't your home. Their beer and food menu is expansive. We enjoyed the brews we tried and the food was also great, although I wish you could have made any of the burgers (since there are so many) into veggie or turkey burgers. The fries were the bomb. <br><br>We'd be here a lot if it was our corner bar.", "pics": null}}, {"review": {"des": "A really great neighborhood joint. Not fancy or anything. You don't need a reservation. But a great place to meet friends after work, have some good food, and a great selection of beers and liquors.<br>I met a friend here after work. We were seated right away. It's lively but not loud. We were able to hold a conversation without any issue. <br>The staff is attentive but not annoying. <br>My buddy ordered a burger. There are countless combos of fixin's, seasonings, buns, cheeses etc. I got the fancy grilled cheese and added some truffle seasoning to it. It was so good. I would categorize it as unconventional with its cheese, figs, and truffle. Very satisfying.<br>My friend enjoyed his burger. He selected this place so he knew what he was going to order before he got there.<br>If I lived closer to Lincoln Square I would pop in here more often.", "pics": null}}, {"review": {"des": "Caution, review from a self-acclaimed burger aficionado. <br><br>I've been to The Bad Apple 3-4 times and had different burgers each time. They are some of my favorite burgers in the city- the chef cooks a perfect medium that is insanely juicy.<br><br>Last night, my bf and I found ourselves starved at 12AM - when he mentioned Burger King, I thought surely there must be a better burger in the late hours of the early mornings... <br><br>I was so delighted to see that The Bad Apple is open till like 3AM or something. We ordered the \"The Fig is in\" -- fig, goat cheese and onion jam on a burger is everything it sounds like. <br><br>I highly suggest the chipotle seasoning on the fries. Their homemade ketchup is an interesting combo of super vinegary and sweet- but in weirdly good way.", "pics": null}}, {"review": {"des": "Amazing amazing first I debated if I should get just the poutine special and under good council I was told I need to get a burger.  I got the even cowgirls get the blues and it was amazing the sautéed onions and brioche bun is on point.  The special poutine had all the elements one wants cheese curds, gravy, pulled beef.  <br><br>The service is great and perfect selection of beer, this place is a must.", "pics": null}}, {"review": {"des": "The Bad Apple is so versatile. Great for a date, night out with the girls, catch-up session with the bestie, or a family affair. Lots of TV's showing the current baseball and football games, quirky art scattered all over, and best of all: delicious burgers! <br><br>Their food menu isn't massive by any means, just a nice, neat one pager, but they certainly have something for everyone, including vegetarians! I ordered \"The Figs Is In\" burger and my fiancé got \"The Southern Dandy\" burger, both being too big to finish in one sitting because we started with their totally bomb fried cheese curds. I also completely love their chicken thigh sandwich on homemade ciabatta bread (an autumn offering only. BRING IT BACKKKK!). It is SOOO good with their honey mustard BBQ slaw!!! I'm not a huge fan of their fries (or homemade ketchup), so next time I might try subbing them for another side at just $1 extra. <br><br>Although their food menu is small, they boast a very, VERY large cocktail/beer/cider menu! We skipped drinks this time, but I have my eye on the Apricot Cider for next time. I'll be back!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/81G56GRms0BHRLzjv7nQdA/348s.jpg", "caption": "\"The Southern Dandy\" burger"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OZpoBaGTMqZWyplnDp9pGQ/168s.jpg", "caption": "\"The Figs Is In\" burger"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zg423zQulJGS2LfkVsXKNQ/168s.jpg", "caption": "Cheese curds $8"}]}}, {"review": {"des": "I started writing yelp reviews in attempt to find some of the best burgers in Chicago. I cant believe it took me years to finally come here. The location is great, you have Wild Goose, Half Acre Brewery, Gannons, even a Lou Malnatis in the area. <br>  Beers: They have one of the most impressive beer lists in the city. <br>  Burgers: Theres around 14 diff burgers which all look great, I went with <br>                 \"The Figs is in\",  it was different but good!<br>What stands out to me about The Bad apple is the beer list and variety of burgers they have. This combo really makes them standout, even though there are better burgers in the city. If I am ever in the area this is will be somewhere I will hit up for sure!", "pics": null}}, {"review": {"des": "Cheese curds are just about PERFECT!  They are lightly battered, squeaky, and delicious!  Wisconsin, move over, we just might have better cheese curds here in Chicago.  <br>The burger was just as tasty.  The Slow Burn included some hot peppers that snuck through on some of the bites.<br>The service was second to none!  <br>Definitely worth another trip to try more.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rukYpa08jacfuFXoUzTH2A/348s.jpg", "caption": "My share of the Slow Burn burger."}]}}, {"review": {"des": "I can't say enough good things about The Bad Apple. They do it all well: the food, the service, and the pricing.<br><br>The Food<br>*As a person who eats mostly veggie, I really appreciate the delicious veggie options on their menu. Both the \"meatball\" sub and the buffalo cauliflower wrap are SUPER tasty.<br>*When I feel like treating myself to a burger, this is the spot because the meat is high quality and you can tell. I like the Slow Burn and the classic Bad Apple Burger. (There's a great deal during the workday...$10 for the Bad Apple Burger + fries).<br>*They also have some of the best fries in Chicago!<br>*Homemade ketchup!<br>*The beer list is LAAAARGE, which I used to find pretty overwhelming and unapproachable but I now know what I like there so I appreciate the options. (You have to try the Boulder Shake Chocolate Porter if you haven't yet.)<br><br>The Service<br>Everyone who works here is attentive and friendly. You can tell this is a tight operation with higher standards for staff and that employees like their jobs. They make you feel good about being there and I would be proud to work there. <br><br>The Pricing<br>In Chicago, it's so easy to get tricked into paying $14+ for a \"fancy\" burger. I've left these fancy burger spots so many time swearing to never go back because you just feel ripped off. The Bad Apple provides great value for money, which is rare and appreciated. It's now just one of the two restaurants on my list when I have a craving for beer & fries.", "pics": null}}, {"review": {"des": "In the mood to explore outside of the downtown area and craving per usual bar food, came across The Bad Apple in the North Center. Came here on a Saturday night around 11pm. Not crowded at all and plenty of open tables available. Looked at the draft menu. Just came from Dovetail Brewery nearby and was not in the mood for a beer at all but still, YOLO, ordered the Orange Sunshine. To be honest I didn't really like the beer selection. But I'll have to come back again because the food was pretty solid. <br><br>For food we decided to split an appetizer and an entree. Started off with the cheese curds. The curds were delicious. The Ranch that came with it was a bit more thicc than I liked but the cheese curds itself was delicious. I'm always looking out for cheese curds. Would go to first draft because they are super close by, but the cheese curds are much better at The Bad Apple. They actually give you a decent amount as well. Could not finish it between 2 people! For burger we got the Southern Dandy. It was delicious! I enjoyed the patty, couldn't really tasted the bacon to be honest, but the onions were surprisingly perfect with the patty. I was definitely a fan of this place. Got the habenero fries with that, costs .75 extra to get seasoning, should of stuck with something else. Definitely a fan of this place. Atmosphere was very chill, great place to come as a group, not crowded on a Saturday night. 4 stars!", "pics": null}}, {"review": {"des": "Hundreds selection ( well maybe i'm exaggerating but close) of awesome beer. Lindemans apple lambic and uncle john's apple blueberry cider are my favorite. Love their beer cocktails too <br>Their burger is a Wow!!! Highly recimmend the hashtag brisket with beef patty. Omgawwd!!! <br>They have different seasonings for fries too: love the firecrackers and curry seasoning!<br>Will definitely come back!! Nothing can beat a late night feast with beer and burger.<br>Btw they have some photos from local photographers for sale/display too! Love them!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QvwKtKxAC7s3AbIM8Cj_4g/348s.jpg", "caption": "Featured menu"}]}}, {"review": {"des": "Came here with a friend for a weeknight dinner. The Bad Apple has a cool casual vibe. The service was good and food A-OK in my book. The type of place you could see a lot of regulars coming here to grab dinner each night.<br><br>We both shared:<br>- a sampler that included The Bad Apple Burger, a hotdog (forgot what it was called), and the wagyu beef burger<br>- Southwestern Cobb Salad<br><br>The salad tasted great and had a ton of avocado on it, I'd recommend. The sampler is a great selection to make if this is your first time at The Bad Apple. It gives you a taste for the type of food that The Bad Apple has to offer. The burgers were alright, pretty standard. Surprisingly the Bad Apple burger tasted juicier than the wagyu beef one so I would recommend getting that if you're craving a burger.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/77XPfttc2qJRfHtot0v9Xg/348s.jpg", "caption": "Southwestern cobb salad ($7 small / $11 large)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5YvD2m0RR-WP4wdSTO25Tw/168s.jpg", "caption": "Bad Apple Burger, hot dog (forgot what it was called, wagyu beef burger. Special sampler"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RSf9HSAwCfh-ghJIHorCaw/168s.jpg", "caption": "Bad Apple Burger, hot dog (forgot what it was called, wagyu beef burger. Special sampler"}]}}, {"review": {"des": "This is one of the best burgers in Chicago! A fantastic beer selection and really reasonable prices make this a 5 star review. The bar was comfortable and the service was very attentive. This is one of my new favorite burger and beer places.", "pics": null}}, {"review": {"des": "This is my new favorite bar. They have a large beer and cocktail menu and many of their beers can be sampled for just $1. I had a handful of samples and all of them were some of the best beers I've tried in a long time. The S'more Money, S'more Problems was particularly delicious. I also tried their version of a spicy margarita, the Calvin and Habanero, and it was excellent: a perfect balance of heat and sweetness. I only sampled their pickled platter which was good, but I'll definitely be back to try the rest of the menu.", "pics": null}}, {"review": {"des": "A real modest hidden gem.  Tucked away in Ravenswood, I've passed by this place a bunch and finally popped in.  Staff was extremely friendly and welcoming.  Great value for a great burger.", "pics": null}}, {"review": {"des": "My last night in Chicago (08/17/2018) my friends decided to take me here. They both have been here one other time. First off... they have a very, very, extensive beer list. Like it will take you a good 10 minutes to look at their drink menu. This place specializes in hamburgers with major flair. It must have been a cheese curds week.. since we ordered their Fried Cheese Curds and Olives to start off. Yum! Yum! Yum! I tried their Beer Cocktails. The Strawberry Field ($9) If you aren't a beer lover, you may not appreciate this cocktail. There is a beer finish to it but very fruity drink with a believe they dusted the rim of the cup with fruit punch kool-aid. <br>The burger I decided on was \"The Southern Dandy\" ($14)- Sweet onions, pepper jack cheese, molasses bacon, and a Dandy Sauce with a side of their house cut fries. I would love to try the \"Elvis's Last Supper\" ($12) which has bacon and peanut butter. <br>Great atmosphere, it is on the loud side but nice place. Will most likely revisit when I am back home.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Km8a0kuWeeWzXB3ioS2gvA/348s.jpg", "caption": "The Southern Dandy Burger with house cut fries"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ayLxijp_fmpwLAQ2968Xyw/168s.jpg", "caption": "Drink coaster"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FfEb1usw5QR3u30-ZRv38A/168s.jpg", "caption": "Appetizers: Fried Cheese Curds and Olives"}]}}, {"review": {"des": "Went there for a friend's birthday last Saturday, but I've been to the Bad Apple many times before.  I'm a big fan of their cheese curds, quite possibly the best in the city, and you cant go wrong with any of their burgers.  The only thing I dont like about a lot of these gastropubs, are that they dont carry any of the macrobrews. Dont get me wrong I love craft beer, but they are so carb heavy sometimes I just want to drink a Modelo that's light on the calories and carb content.", "pics": null}}, {"review": {"des": "I stopped by one night with a group of friends & had the best truffle fries I ever tasted with some amazing cheese curds. 2nd visit the truffle fries didn't leave an impression. I am hoping the 3rd visit is as good as the first.<br><br>Staff the staff is always looking around and trying to help. Although I came one busy evening when it took a bit longer to get service.<br><br>Ambiance imagine a small local bar with some unique art work and a fun decor. It is a good place to meet up & grab a beer plus with the added advantage of good food.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EltuuYvQRyymfvcD6nARZw/348s.jpg", "caption": "not so great truffle fries with amazing French connection another great option"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_-sPCViiFg8S9czTKG4p_A/168s.jpg", "caption": "Thunderdome burger one of the best items on the menu, truffle fries on the day they were perfect & cheese curds"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OEDe0z-_ZFJJmuq2ezmWpg/168s.jpg", "caption": "Cheese curds"}]}}, {"review": {"des": "The Bad Apple is known 'round the city as having one of the best burgers in town. I have to say I did indeed enjoy it. They have a bunch of different types of burgers though so I feel like I need to work my way through their entire burger offerings.<br><br>I met some of my Yelp friends up for a bite & a pint last week and had a lovely time. Solid service, solid beer list, solid food. Beer prices weren't too bad but their $18 beer flight did seem a bit silly. $18 is verging on madness. I tried the flight though and did enjoy it, but wished there was more direction on the beers (brewery only listed for most).<br><br>My friends convince me to get the Elvis Last Supper burger for $11. She's a beast (both me and the burger) with bacon and peanut butter smothered on top. It was real good and I'm glad I started my Bad Apple burger escapades with this one. I *always* have left overs when I go out to eat and though my remaining burger tasted great the next day, peanut butter does not microwave well, ha! So...just a light warning if you get this burger....eat it all fresh & in person!<br><br>Their burgers come with fries and you can upgrade any fries for 75 cents with cool add-ins like truffle, old bay, curry, garlic, ranch, chitpotle or firecracker seasoning. Awesome man!<br><br>I've been here a couple of times for drinks but am glad I finally got to try their burgers. I'l l be back, for sure I'll be back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/plvyn030PjkmTfS0mmfyPA/348s.jpg", "caption": "Delicious nitro stout"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XtC3Q3uKt-0pfTvE5KwVeQ/168s.jpg", "caption": "Drink menu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5ILoLK_091HtZR9OVPelRw/168s.jpg", "caption": "Elvis Burger"}]}}, {"review": {"des": "Came to The Bad Apple with friends on a Sunday at 12:30pm. Surprisingly, the place wasn't packed yet so we were sat instantly. Our server, who was awesome, I'm sad I forgot his name, came over and gave us some recommendations on beers and menu options. We opted for the below burgers/sandwiches and they were all damn good. 4 stars for The Bad Apple with regards to service and food. I'll definitely be back!<br><br>What we had:<br>*Fried Cheese Curds - 3.5 stars<br>*Every Rose Has Its Steak - 4.5 stars<br>*Grizzly Adams - 4 stars<br>*Feta WAP - 4 stars", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TtaLKbBaVQeKbA2BH4tLpg/348s.jpg", "caption": "EVERY ROSE HAS ITS STEAK (thinly sliced steak, Four Roses bourbon onions, aged white cheddar, tangy steak sauce. on a hoagie bun)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TPaNTj8xfnQ2-u1LDWs-Fg/168s.jpg", "caption": "GRIZZLY ADAMS (braised short rib, an ale, stone ground mustard, onion jalapeño & white cheddar sauce, caramelized onion on a pretzel bun)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7ysunPfuZKpZpMJgQbNzYA/168s.jpg", "caption": "FETA WAP (bacon, garlic herbed whipped feta, muenster, fried egg and piquillo pepper coulis)"}]}}, {"review": {"des": "One of my all time favorite places in Chicago, The Bad Apple was one of my first great discoveries upon moving to Chicago, and has been a staple for each visit back ever since. Great beer on tap, an outdoor area tailor made for socializing and dog watching, and the food! Until coming here, I hadn't given the proper respect to American gastropub - I know better now.", "pics": null}}, {"review": {"des": "We. LOVE. The Bad Apple.<br>My partner and I have been here dozens of times. It is such a favorite of ours that we've often brought visitors who have come into town.<br>The reasons that we love the Bad Apple include delectable food, an extensive beer list, and great service!<br>The food is great and definitely the highlight. You cannot go wrong with the burgers. I've strayed a couple of times and gotten chicken sandwiches, and while they are yummy, the burgers are to die for. Tonight I had the Brussel sprout and Brie burger with truffle aioli and I died and went to flavor heaven. <br>Also, let's talk about the fries. They are super yummy, and for less than a dollar you can add different seasonings to them. My favorite seasoning is the 'Truffle oil' and my partner's favorite seasoning is the 'Spicy Chipotle.'<br>The beer list is extensive, including delicious local brews, national brews, and international brews! Coming here is always a drinking delight and we love it!<br>And finally, the service is a great community! Servers are always helpful to the customers, as well as to one another, ensuring that everything gets done efficiently and effectively. Plus the decor is a delightful conglomeration of creepy artwork that generates a unique and creative vibe! <br>You may have to wait since Locals all realize how awesome this spot is, but trust me, it is well worth the wait.<br>Chow down, take a sip, and enjoy the experience of the Bad Apple!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aLGmsys0PMjcFOVFG5UsHA/348s.jpg", "caption": "Chocolate Shake Porter from Boulder, CO"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zVw5c9SfQmLjxOeyqEgA7A/168s.jpg", "caption": "The Bad Apple logo and coaster"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RauR--h31MbZeztqZYIqDw/168s.jpg", "caption": "The Brussel sprout and Brie burger"}]}}, {"review": {"des": "This place was amazing! I would definitely recommend it to anyone who is looking for great American food!", "pics": null}}, {"review": {"des": "The burgers are epic. Good beer selection and a cool atmosphere. I'd definitely recommend this place", "pics": null}}, {"review": {"des": "I am so thankful for this place! Best burgers/food/atmosphere in the neighborhood. Seriously, the cheese curds are out of this world. They pay attention to detail here - even the homemade ketchup is killer. Go get yourself a burger asap!", "pics": null}}, {"review": {"des": "Beer and drink list: extensive.<br>Ambience: cool punk hipster.<br>Burgers: solid, but not the best.<br>Fries: Eh.<br><br>They have beers upon beers upon beers. Whatever country, whatever beer, it's probably there. And that's a great thing. Are the burgers the best I've ever had? Absolutely not. But it's a solid burger, that's about it. <br><br>I had to knock one star because of the fries. I got garlic fries and I don't know if I was expecting garlic oil or more garlic flavor... but it was literally a pile of friends and then a clump of minced garlic in the middle. It wasn't spread out and if you wanted to taste the garlic, you had to dip your fry and scoop some out. Just eh.<br><br>But I'll tell you what was AMAZING: the Montreal poutine fries. Holy smokes, I'm still thinking about them a week later...", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PwbikOt9Cq4NpXhM6sIfKQ/168s.jpg", "caption": "GRIZZLY ADAMS braised short rib. an ale, stone ground mustard, onion jalapeño & white cheddar sauce. caramelized onion. on a pretzel bun"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SGteIbODvCI81PmSvvZYlg/168s.jpg", "caption": "FETA WAP: bacon. garlic herbed whipped feta. muenster. fried egg. piquillo pepper coulis"}]}}, {"review": {"des": "The bad apple, is well bad. Owners are mean. Place is kind of dirty. I was treated very poorly - would def not go back. Not familiar with the area and they were just kind of rude", "pics": null}}, {"review": {"des": "It's no secret: The Bad Apple's specialty is burgers and they certainly excel at making 'em. Then why not 5 stars? Maybe it's just my palate, but none of the flavor combinations really called out to me. After a somewhat lengthy internal deliberation, I eventually settled on the Southern Dandy, with grilled Spanish sweet onion, pepper jack cheese, Buckboard molasses bacon, and sweet and spicy Dandy sauce. The meat was perfectly cooked and the gluten-free bun was surprisingly good, but every bite just tasted like too much of the same. Too much sauce, perhaps? To me, the flavors were just a bit too complementary, I prefer more contrast and texture. I'll try again, maybe I just chose the wrong burger for my taste buds.<br><br>Fries were great and I enjoyed the addition of minced garlic. Perhaps the best part of my experience was perusing the gluten-free beer and cider list... thanks for thinking of us gluten-free folk! The Vander Mill Totally Roasted Cider is totally my jam - a medley of cinnamon, pecan, and vanilla in a glass that tastes just like fall. Highly recommend!", "pics": null}}, {"review": {"des": "Good burgers, good service, good customers, good menu choices, great staff.<br><br>The burger was really good.... Not life changing, not amazing, but really good. Better than any burger you would get at a generic restaurant. I ate the thing really quick and enjoyed every bite. Also interestingly, their french fries choices were refreshing.... I tried both the garlic and the truffle and both were better than any generic french fries.<br><br>I recommend you go and try their food. I will go there again as they might be the best burger in Lincoln Square.", "pics": null}}, {"review": {"des": "We stopped in to the Bad Apple after an absolutely exhausting day searching for apartments in the area. The welcoming, warm vibe of Bad Apple was just what the doctor ordered. The burger options here are extensive, as is the beer menu. As a burger minimalist, I opted for the simple Bad Apple burger. The burger was cooked perfectly medium, and came with an order of fries on the side. I added chipotle seasoning to the fries for a small upcharge. The seasoning was pretty bland, so I wouldn't add it again in the future. <br><br>This is definitely a very accessible burger (i.e.: you do not have to unhinge your jaw to manage a bite...at least if you order their more basic menu options). It's tasty and comforting, and will certainly hit the spot if you're in the mood for some junk food and drinks.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UN8J07DCd8ZJJuCMC13-XA/348s.jpg", "caption": "Bad Apple burger and fries with chipotle seasoning."}]}}, {"review": {"des": "I wanted to love this place based on other reviews but I just didn't!  I appreciate the variety of burger types on the menu but I felt like it misses the mark on a lot of them.  Out of four of us with four different burgers, we were all underwhelmed.   <br><br>Our table ordered medium/medium-well burgers and we all received medium rare at best.  Something about mine tasted really off which was a turn off from the experience in general.  I ordered the \"The Fig is In\", which has figs and goat cheese.  Great in theory but beware - it's just a huge chunk of cold cheese on top with two dried figs mixed in there somewhere.<br><br>Wasn't the worst, wasn't the best.", "pics": null}}, {"review": {"des": "The veggie burger with truffle fries made my eyes roll back like the girl in Im Gonna Get You Sucker. I'm really not sure how else to convince you to come here. Serving is great. Perfect for a date night, girls night, guys night or even to bring the kids. Drinks are heavy, refreshing and have awesome flavor marriages. <br><br>Parking can be difficult but not impossible.", "pics": null}}, {"review": {"des": "FORBIDDEN FRUIT<br><br>This North Center burger bar doesn't fall far from the tree.<br><br>In fact, I'd say this particular apple is the most succulent variety you'll find anywhere in Chi-town.  There's absolutely nothing bad or rotten about it.<br><br>After hearing positive things from fellow Elites (and recommendations from Chicago Eater and Thrillist) I made the trek here on the eve of 4/20 with a hungry dinner companion.  We were seated immediately on a weeknight around 7pm at a table in the back.<br><br>Right away I noticed that the dimmed lighting conditions would make it tough on photos but added to the trendy vibe that Bad Apple gives off.  With a solid 4* across nearly 1,300 reviews to date, my gut instinct told me that I was in for a treat, and boy was I right.<br><br>Once we picked brews off of their extensive beer & cider menu, we shifted our focus to the big draw: their burgers.  I counted 13 speciality beef sandwiches, ranging around $10-13, most with clever names like the 'Feta Wap' (whipped feta cheese, pepper coulis) and '#hashtag' (smoked brisket hash on an english muffin).<br><br>I vacillated between a few options, finally settling on the 'Slow Burn' (stout sautéed hot chilies and onions, bacon, white cheddar).  My +1 ordered the 'Little Champion' (chili mac, pepper jack, crispy tortilla strips) and both came with fries; I added firecracker seasoning on mine for an extra 75¢.<br><br>Having asked for my burger to be prepared 'medium', the kitchen rolled out the most picturesque patty I've ever seen.  Cooked around the exterior with a large band of pink and slight tinge of red, you couldn't ask for better preparation.  This was crucial, because the burger itself was a goddamn inch thick.  lolwut<br><br>A juicy patty griddled to near perfection with simple yet effective toppings.  As tasty as the fries were, the burger was unquestionably the best I've ever had.  Better than Au Cheval's, superior to Kuma's, trumping even Lockdown (which now gets runner-up marks in my book).<br><br>We also ordered the poutine special (bbq gravy, pulled pork) which was delicious.  Each of us received a different dipping condiment: a homemade honey mustard (really good) and sweet hot sauce (really spicy).<br><br>The men's room is slightly larger than your household microwave oven.  Even though it's communal, in reality only 1-1/2 people can fit in there at a given time.  Also, either the bathroom mirror was some modern art piece intended to be ironic, or it was just some kinda hipster joke that I don't understand (see photo).<br><br>Our server was nice, but she definitely started off on the wrong foot.  Moments after greeting us she blurted out \"if you're thinking of getting beer tonight, DON'T GET.......(long pause)\".  Uhhhhh wtf??  She then listed off a handful of taps that'd run out, which happens, and I get it.  But the way she worded it sounded brash, erratic and a teensy bit odd.  Not a huge deal but still a peculiar way to introduce us to the beer menu.<br><br>Bread = 5+<br>Circuses = 3.5<br><br>*TL;DR*<br><br>Despite a goofy restroom situation and some weirdly uncouth service at the outset, Bad Apple bounced back with a vengeance thanks to their absolutely KILLER food execution.  All it took was one bite to know that I'd just encountered the best burger in Chicagoland.<br><br>If these burgers grew on the trees in the Garden of Eden and a booming voice from above was like \"hey listen, plz don't eat that\" I'd go \"shut it pal, you don't know nothin!\" and devour the living bejeezus out of each and every one.<br><br>Fortunately, dining here isn't a damning offense....but even if it were, I'd commit 1001 Original Sins so long as I got my Bad Apple burger.  #going2hell   #worthit", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Oy3iQ1qCNTIO1OvI-YEDfA/348s.jpg", "caption": "Hard to tell, but this is the 'Slow Burn' made with stout sautéed chilies and onions, bacon, and white cheddar ($12). It was TRANSCENDENT!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6J5AGRmhckShR79hRp5OJA/168s.jpg", "caption": "The poutine special was fashioned with bbq gravy and pulled pork!!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/O_IRmnqmRpL4MwJrld_GEQ/168s.jpg", "caption": "I....honestly can't tell if this is ironic artwork, or a total joke. Either way, the men's restroom is MINISCULE."}]}}, {"review": {"des": "Wonderful service. Excellent food. Even the left overs were boxed with marking of the date and the food type. <br>Service is seamless; everyone is working on the team. Dirty napkins are removed as a server passes by; or a manager or a bus person. The selections of beer and sandwiches and burgers should satisfy most pallets. There were six of us, ages 10 - 70; we all walked away satisfied and feeling happy we came. Thanks to the staff.", "pics": null}}, {"review": {"des": "Five stars for the amazing, friendly, kind staff here! We went in for a bite with a friend and our kiddos before a concert last night and had the best experience. The staff could not have been nicer and were super accommodating to our kids (putting in the kids orders first, moving us to the game room so they could play pin ball and pac man, making recommendations, etc.). Everything we ordered was perfectly cooked (talk about an amazing burger!) and the cheese curds were worth every calorie! We will definitely be back!", "pics": null}}, {"review": {"des": "Came here as a \"solo rider\" so I knew I wouldn't have any issue grabbing a seat. Around 6pm on a Saturday, the place was definitely starting to get packed, but I was able to sit right at the bar. Service was great, and I had multiple people behind the bar check in with me, which I always appreciate.<br><br>I was overwhelmed by the burger choices but everything sounded sooo good. I was very tempted to try the elvis (with peanut butter and bacon) but I got nervous last minute and pivoted. I opted for the \"grizzly adams\" instead. A perfectly cooked medium burger, topped with braised short rib, caramelized onion, some kind of perfect sauce concoction, all atop a pretzel bun. I was absolutely starving, but my burger excelled my expectations. I always respect a burger that is cooked perfectly, and the short rib was phenomenal.<br><br>Something you really need to appreciate here is that fries come with the burger! I've found that most places up-charge for that. I had a mini panic attack when asked what topping I wanted on the fries. I was going to go with firecracker, but was told it is incredibly hot, so I played it safe and went with minced garlic. I have no idea what I was expecting, but it was fries with a bunch of chopped up garlic on them, so it was pretty potent. I would definitely go with a better seasoning if I could do it all over again. That being said, I don't always love regular fries, but they knock these out of the park and I ate every last one of them.<br><br>Definitely, definitely recommend The Bad Apple.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FB608grmwNpZXTrhKRbGSQ/348s.jpg", "caption": "Grizzly Adams burger and fries topped with minced garlic"}]}}, {"review": {"des": "Came here a little before 6 on a Monday and the place was fairly empty and I get to choose where I want to sit.  The environment was very friendly and everyone works like a family here.  Through out my whole time eating, there were probably like 5 different people checking on me which was good.  They didn't come too often, but just right enough.<br><br>I started out with the Special Poutine.  This appetizer was delicious.  Had pull pork on top and instead of gravy, they use the juice from the pull pork.  I am normally not a big fan of pull pork, but man their pull pork was very delicious.  I almost at the whole thing before my burger came out.<br><br>For the burger, I got the cowgirl.  Since I don't like blue cheese I substitute that for pepper jack. It comes with a side of fries and I paid a little more to make it truffle fries.  You can hardly taste the truffle, but the I like the fries here.  By the time my burger came out, I was almost full from the poutine.  The burger was cook perfectly and it was juicy.  I was only able to eat almost half of it before I gave up.  I will stuff at that point.<br><br>Overall this is a pretty yummy place and will come back here when I visit Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WCoTn_0KDcy4aruzcgtHMw/168s.jpg", "caption": "Cowgirl Burger"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BleI3rJRNKrxVdXLKWfv_Q/168s.jpg", "caption": "Happy Hour special poutine fries"}]}}, {"review": {"des": "I first went to this place about 6 years ago and loved it then. I finally got the chance to come back, and let me say - that wait was way too long!<br><br>The food is still fantastic, and the drink menu is still huge. I'm not a big beer person, so I really love all of the ciders and fruity beers they have to offer. Rarely ever am I so pleased with the \"beer\" list haha!<br><br>The special poutine was really good! The fries never got too soggy, and the flavors all went great together. I think there was smoked brisket and juices on them. So good!<br><br>We split an Even Cowgirls Get The Blue burger, and chose the truffle fries with them. The burger was amazing. Toppings rocked. I could have gone for a little more of a truffle flavor on the fries since it was just like a small hint, but they were still awesome.<br><br>I'm glad this place hasn't changed in their consistency or quality over the years. It's a great spot!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/q-RFSaZMTptmWjUFnAddCA/348s.jpg", "caption": "Even Cowgirls Get The Blues - AMAZING! And delicious truffle fries."}]}}, {"review": {"des": "Boss introduced me to this place and I love it. Good burgers. Good cheese curds. No. I take that back. AMAZING cheese curds. Get them. <br><br>Staff is super friendly. <br><br>We went on a Sunday night and only waited a few minutes for a table.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TjSPqOan79qwVPayKNjfDA/348s.jpg", "caption": "Chocolate peanut butter mousse. A little too much peanut butter for me. Chocolate was delicious."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mKi9-JUq9zGmW8QHZTp1hg/168s.jpg", "caption": "Elvis burger- my go to whenever i come here."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/L54Ft3Tk4jKvNJmlZYwwsw/168s.jpg", "caption": "Cheese curds. Get them. Do not ignore this tip."}]}}, {"review": {"des": "This is my favorite burger as of now. My coworker, who is a burger aficionado, brought me here as a must try. We ordered the slow burn burger medium rare. Medium rare is key as the meat is supposedly shipped from the famous butcher Pat La Freda. Always cooked to perfection. We also ordered the fast burn sauce with the the fries. It's a sweet and very hot, but enjoyable sauce. Goes great with everything.<br><br>Every ingredient compliments the flavor to perfection from the quality of the meat to the peppers, onions and white cheddar cheese that is all soaked up by the bun like perfectly dipped Italian beef.<br><br>There many options, from adding delicious garlic butter to you fries, to appetizers like cheese curds or poutine. Huge beer selection and great service. Can not go wrong.", "pics": null}}, {"review": {"des": "My friends and I were having a reunion night. We stayed out a little later than originally planned at a bar, namely, The Sixth, if you haven't gone go for the cocktails. Anyway, the original restaurant we had planned on was going to close in half an hour. Bummer. Not to worry! We all like burgers and The Bad Apple has a kitchen that is open late. Sweet!<br><br>Their burgers are great. One of my friends got a slider sampler, my other friend got the one with mashed potatoes and lingon berry jam on it. I was the lame one. I got a small southwest cobb salad. In my defense, I was still kind of full. And that salad was delicious. None of us were disappointed in our choices. And on top of that, their beer selection is pretty great. One of my friends got a mead flight. There aren't too many places serving mead out there, and it was a delicious treat. Do stop by for a late night treat in a quiet neighborhood.", "pics": null}}, {"review": {"des": "Came here one night. Heard the burgers were great. Interesting choices for sure.<br><br>Were they all that? Of course not. Were they good? They were okay.<br><br>I'd come back in a while after i get the nasty taste out of their ketchup. ( I think they make their own)<br><br>If you like burgers, it doesn't hurt to try this place out. You might like it more than i did.", "pics": null}}, {"review": {"des": "Some of the best burgers in Chicago. Take your pick any burger on the menu is great and they will cook it exactly how you want it. The cheese curds appetizer is excellent and actually pretty generous I split them with someone else and had trouble finishing my burger. The seasoned fries are excellent and so many choices its hard to pick which one you want. I really like the drink menu here, excellent beer choices and they make some really good cocktails, and the prices are very acceptable for being in the city of Chicago. Whenever I am in this area of Chicago I make it a point to stop here, I wish I didn't fill up on the great food so many more good beers I wanted to try.", "pics": null}}, {"review": {"des": "We arrived at a great time and were seated right away. No alcohol tonight, so no pictures of martini's - sorry about that.<br><br>First, the service was great. I wish I had the name of our server, but of course, I didn't write it down and if I don't, I can't remember.<br><br>While their menu is not extensive, it does have some great looking items. I ended up ordering the Creole Contender - it is creole crusted fried chicken. chipotle kohlrabi slaw. pickles. chipotle aioli. on a hoagie bun. Being from the East, I would say the bun was a Ciabatta, not a Hoagie but that's okay.<br><br>The chicken was crisp, juicy and tender - being fried I always worry it will be greasy. But, it was not greasy at all. The creole coating was very mild. I expected something spicier, and it was not. I have to say that the flavor was complimentary and did not overwhelm the taste of the rest of the sandwich. The slaw really added to it - it added texture as well as a slight vinegar flavor. The pickle also added to the mix. Even though the bun was not a real hoagie bun, it still made the sandwich a masterpiece.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mcpKqVVAIV6UYZHlgQD7Dw/348s.jpg", "caption": "Chocolate peanut butter mousse."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hoC1VCVWOk5Q7CnPGZJlQQ/168s.jpg", "caption": "The Creole Contender."}]}}, {"review": {"des": "The Place<br>The Bad Apple is located at 4300 N Lincoln Avenue in Chicago and is surrounded by many notable establishments.  They have a very spacious multiple room bar, plenty of indoor seating as well as outdoor seating.  The outdoor seating was nice but little difficult for 4 to maneuver.  We did find a slanted table to sit at . <br><br>The Menu/Food<br>Very extensive craft beer and mixed drink menu with many infused options.  The wine menu is very limited... but it's a burger joint.   It does support a great Burger menu as promised.  I've read all about the special New York beef being shipped in for these burgers.  With all the hype we had to ordered 4 different burgers.  <br> <br>\"ROYALE WITH CHEESE\" - trumpet royale mushroom. roasted shallot & truffle compound butter. arugula. Gruyère cheese, <br>\"THE FIGS IS IN\" Tyranena Chief Blackhawk porter, fig & bacon relish. goat cheese. smoked onion, <br>\"ELVIS'S LAST SUPPER\" bacon & peanut butter...trust us, it's good, and finally <br>\"THE SOUTHERN DANDY\" - grilled local Spanish sweet onion. pepper jack. Buckboard molasses bacon. sweet & spicy Dandy Sauce.  <br><br>The burgers were all good BUT I now understand what killed Elvis.  Overall our burgers were good but I'm not sure the addons lived up to the billing.  Sorry but I didn't find peanut butter enhanced my burger and the trumpet mushrooms were tough.  Our fries were good and the burgers themselves were very flavorful but just not over the top.<br><br>The Service/Value<br>Our service was good and our waitress was friendly.  The prices were reasonable and the venu was fun.  Time to rethink the addons.....", "pics": null}}, {"review": {"des": "Excellent service. Kind of a hipster place that looks a little dive-ish in a great way. The food is presented very nice, the burgers were amazing. We went on a Friday night about 8pm and were in and out in about 45 minutes. Would recommend this place for any burger lovers. Had the poutine which was a first time ever for me and it was awesome. The only bad thing is that the fries are so awesome, that the poutine kind of spoiled the fires that came with the meal cause they're so damn good. Any of the wait staff will help you with whatever you need. It's like teamwork.!", "pics": null}}, {"review": {"des": "Stopped in for a couple drinks and a quick bite. I had the peanut butter burger and the garlic fries,  and she had the veggie burger with the truffle fries. Her fries were better, but they were both good. Everything was good there. Drinks and all. Not blown away 5 star good, but better than average. The bartender was friendly and attentive too.", "pics": null}}, {"review": {"des": "Was excited at the prospect of finding a good burger place that wasn't Little Bad Wolf, but unfortunately I think these burgers are overhyped. They weren't good-- just fancy.", "pics": null}}, {"review": {"des": "I can't stop raving about there fries LOL! Go try this burger spot out, you won't be sorry. Some times there is a waiting time but it's worth it. All there burgers are delicious and the fries are my personal favorite. The portion I would say is your typical burger places. It is loud once you get into the restaurant and the music isn't my choice of music but it works with the atmosphere and the interior design.", "pics": null}}, {"review": {"des": "Very crowded on a Friday night especially for our group of 14. After a little wait, we're seated in he back room. Very attentive wait staff, mixed drinks were good as were craft beers. They have quite the selection of beers as well as rums & tequilas <br>Had pickled vegetables and cheese curds for apps. Pickled veggies were good but you must looove vinegar.<br>Just can't go wrong with their cheese curds: <br>Burgers came out made to order. The Mediterranean burger was outstanding especially paired with focaccia bread, can be on the salty side with the kalmata olives and cheese but was so good. Bread healed up nicely to the sauce and grease of the burger. <br>A friend had the veggie burger and said it was outstanding as was the Thunderdome, Elvis last supper and Mushroom burgers <br>Burgers come with fries with your choice of seasoning. I had truffle fries, perfect! <br>This place has games, makes it the perfect place to hang out with friends on a Friday night or Sat afternoon with drinks and board games.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3UBxUp9_gODPDx9T8sDgkA/348s.jpg", "caption": "Mediterranean Mixmaster burger"}]}}, {"review": {"des": "Hey..... I might have the itis as soon as this review is done, but first I gotta tell you bout The Bad Apple. <br>My homie told me about this place and I'm like why not. Place was really cozy and brought a lot of high spirit. First thing I looked at was the drink menu cuz you know that's how I do. I couldn't decide between two so in the end I went for both. <br>My first beverage was the Horcha-tea. It was a pretty chill drink to begin with; there could've been moments where it can improve, but I'll tell you this, it's way much better than that shit Starbucks tried to do months ago. <br>Next drink I got was the Purple Rain; OOOOOOOOOOOOOOOOOOOOOH LET ME TELL YALL! THIS IS SO GOOD!!! The server said that the grapes they get this come from somewhere in Michigan (Shout out to Michigan: y'all the real MVPs). Mixed with daiquiri, cane syrup, and a touch of rum and you got here a well deserved trophy nominated drink. <br>Now we move on to the food; main thing is burgers; my burger was the Southern Dandy and I was impressed. The burger had mixtures of flavor that went well together that it was a tragedy when I finished it.  The burger did it's job: it was great and gave me the itis :) <br>The one thing that was different from other places was that the fries came with different flavors of spices. I recommend between the chipotle or firecracker fries. <br>Finding parking isn't too bad; they have free parking spaces around, you just gotta hope they're available. Definitely ask the bartender for  some recommendations for drinks (Purple Rain!) and get ready cuz there's a good amount to choose from. Get ready for a good time", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SPkkVyVUKDZz8oqv_slX-w/348s.jpg", "caption": "That egg tho!!!!!!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Si2r6979aELoUuy2I9wnYg/168s.jpg", "caption": "Just drinks folks"}]}}, {"review": {"des": "So I'm sort of a burger snob. I have my go-to places for delicious burgers, and I'm so happy to include the Bad Apple to my list, specifically for one burger in particular - the Elvis's Last Supper. Peanut butter and bacon on a burger is stupid-good, and I highly recommend giving it a go. <br><br>Place is large and the decor is cool, good customer service. <br><br>Reason it's not getting 5 stars is A. their house made ketchup is weird. I can't eat fries without ketchup, even with fun seasonings, so I usually try to switch up my side. B. Last time I went there I decided to go against my normal Elvis order and try the Figs Is In burger - was not a fan whatsoever.", "pics": null}}, {"review": {"des": "Wow, what a great outing I had at this place.  I had a catchup session with an old colleague and couldn't have been happier with this burgers/beer venue which has long been on my bookmark list.  The burgers are top notch and reasonably priced and the beer selection is about as good as it gets (eg, 25 diverse taps plus a bunch of diverse canned/bottle selections) and again all reasonably priced ($5-6).  To boot, on this Sunday evening. there was easy free street parking (I parked on Cullom Ave about 20 feet away from their door) and no waiting for a table.  Afterwards, I said to myself, there's just no reason to even think about say a Kuma's Corner anymore with a place like this available.  The place has a friendly chill vibe, and our server Megan was also friendly and knowledgeable on the brew selection.  There's actually a back room that is used for families with kids and I saw it was fairly busy there as I arrived at 5:30pm.  For ourselves, we sat at a 2-person high top table near the bar, enjoyed the music and view, and were able to comfortably converse with music in the background.  We had the fabulous cheese curds ($9) which upon biting oozed gooey cheese and were every bit as good as many have noted in their reviews.  I also had the Elvis's Last Supper burger with bacon and peanut butter ($12, and all burgers come with fries) and it was subtle on the PB and delicious.  I would happily order it again.  My colleague had the Just Beyond the Thunderdome burger with braised short rib ($14) and he said it was also top notch delicious.  They will prepare the burgers rare if you want them that way as they use quality beef (I had mine medium anyway).  They also make their own peanut butter and ketchup.  I also had a couple of delectable servings of their Short Fuse Loosy Juicy NEIPA (6.4% ABV) and colleague had their Around The Bend Mr Marmalade DIPA (8.8% ABV) and a Victory Brewing Mighty Things DIPA (8.3% ABV).  Many samples are free for their draft offerings, but some are noted to be at relatively pricey $1 per 1 oz sample, so just an FYI.  In any event, can't wait for another excuse to revisit this place!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ag6bcpc6z1s2P813eECwlQ/348s.jpg", "caption": "Rear pub room view"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SyfORGr0t9oAYLTbGBTbUg/168s.jpg", "caption": "Elvis's Last Supper burger (with bacon and PB)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hbhGVxtgzr5cxEo2ey64vg/168s.jpg", "caption": "Delectable cheese curds!"}]}}, {"review": {"des": "Love this place, the hamburgers are amazing they have a lot of options for vegan, vegetarian, carnivorous, the are super friendly and open to do modifications in their menu. <br>I simple enjoy this restaurant", "pics": null}}, {"review": {"des": "\"What the frig'?\" you'll say to your friends as you attempt to process the amazing dining experience that is The Bad Apple. Your friends likely won't be able to respond because they'll be in a food-induced high, and trying to think of a valid reason as to why they hadn't made it out to this place sooner.<br><br>Want some suggestions? <br><br>Start off with their cheese curds<br>-- Battered and fried to perfection, perfectly paired with their homemade ranch, will have you on cloud 9, wondering what you ever did to deserve something so beautiful <br><br>Get the Elvis' Last Supper burger... seriously!<br>-- Savory peanut butter (made in-house) and fat/juicy bacon on a fresh, quality beef patty? OH, COME ON! NOW THAT'S A BURGER!<br><br>As for drinks, have the lovely staff give you a suggestion because their beer/drink list is MASSIVE - one of the best in the city.<br><br>There's so much I could say about the Bad Apple, but words can't properly express how good this place is. Best burger in the city, WITHOUT DOUBT!", "pics": null}}, {"review": {"des": "Always great service and the burgers and the cocktails are spot on!! I also love that you can get old Bay seasoned fries here.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/heZA3PeQ6b7BnkaSYvTlgw/348s.jpg", "caption": "Burger with short rib, onion rings, cheese, and horseradish cream. I'm dying to eat another one of these."}]}}, {"review": {"des": "Really love The Bad Apple, just a good, solid neighborhood joint. Delicious beers, reasonably priced whiskey, and a tasty rotating menu. <br><br>The staff is maybe the best part of the restaurant, they are all professionals, many of whom seem to be long-term employees. Friendly without being overbearing. And they all contribute, so you have really great service, you really can stop anyone and ask for a drink or whatever you need. <br><br>Food is also great, burgers of course, but the quinoa salad is delicious, as are their sandwiches. We also very much enjoy the hipster ketchup and french fry seasoning.", "pics": null}}, {"review": {"des": "Bad Apple is Bad Ass.  Outstanding flavorful spicy burger.  Strong fries.  Excellent homemade ketchup. That's all she wrote.", "pics": null}}, {"review": {"des": "The bad apple does burgers and beer right. First of all their beer list is extensive and diverse. We sat at the bar while waiting for a table since they don't take reservations, and the service and drinks were on point. Once served the burgers were all amazing and priced very reasonably. If you're looking to eat a solid burger in Chicago this is a great option.", "pics": null}}, {"review": {"des": "Great burgers and drinks. Superior service.<br><br>First, the food... Got the Cowboy Killer Burger, with fried egg, meunster cheese, jalapeño, & bacon baked bean. Flavors were great; I couldn't really taste the jalapeño, so those considering the dish need not worry about tolerating the spiciness. FYI, the meat is mixed with the jalapeño so it cannot be put on the side. (Tho, I would've actually preferred more spice, but understand that they may have been trying to cater to the crowd.)<br><br>Loveed the fries- I prefer mine on the crispier side, and the fries certainly hit the mark while not being too greasy or salty. I wasn't adventurous enough to add additional flavors, but I will have to come back to try again :)<br><br>Just Encased, sausage links with giardianera, smoked beer infused whole case mustard, was also yummy; my boyfriend and I liked 2/3 of the sausages (one of them was a little too dry for us). The flavor and textures were great and I absolutely fell in love with the giardianera! The giardianera was a little on the spicy side, but it was so amazingly sour and delicious! I just had to ask for an extra serving (which you can get for $0.75).<br><br>On top of that, the mixed drinks are great- it is definitely a great venue for a date or casual meet up.<br><br>Beyond the hip atmosphere and the well spaced venue, is their top notch service. You can tell that the staff take their Bad Apple Service motto to heart. Everyone is willing to help each other out, and providing high quality service is a noticeable focus for this group. A few examples:<br>-- While waiting for a table, one of the hosts came over and asked us if we wanted to order something to drink, and ordered for us from the bar<br>-- Seating was arranged to help put more chairs on the side of the table that was facing the TV for a party of 3 so that they could watch the game<br>-- Our waitress was extremely friendly and helpful. This place is the perfect example of employees who are not too pushy, but are always there when you need something.  Absolutely love the fact that we can ask other servers passing by for something<br><br>Overall, the atmosphere, food, and drinks are great... the amazing, notable cherry on the top is its memorable service, which makes Bad Apple truly stand out.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EnrIT5-lYwPobIThwejSXw/348s.jpg", "caption": "Pimm's Copper Cup: Autumn Version"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8zZC1KAGXRXnA0EsIwsiAA/168s.jpg", "caption": "Just Encased (sausage links with giardianera, smoked beer infused whole case mustard)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1zBxt5mTOR6YUnRsnwMg3Q/168s.jpg", "caption": "Cowboy Killer Burger (fried egg, muenster cheese, jalapeño, & bacon baked bean)"}]}}, {"review": {"des": "Food was ok. Service was subpar. After ordering beers off the draft menu, we were told they were out of a couple beers, reordered, then told they were also out of those and the server ripped the menu up in front of us. Came in with a group, told the server we were separate and at the time to grab our checks, was rude and difficult. Really unfortunate for an experience when the food was above average.", "pics": null}}, {"review": {"des": "The Bad Apple is my new Chicago go-to, over Au Cheval, Kuma's Corner, Big & Little's, etc.<br><br>In the burger world, there are generally 2 types of burgers: The Patty Burger and the The Topping Burger.<br><br>(1) The Patty Burger focuses on the meat. The condiments only compliment the burger, they don't take away from it. They don't distract you from what you're there for: beef.<br><br>(2) The Topping Burger is about everything else you can place around the meat. Bacon, truffle, chillies, onions, veggies, funky delicious stuff, etc.<br><br>The Bad Apple presents a third type of burger that marries these two components: quality, well-cooked meat, and topping combos to meet your needs. Plus, no extra cash for fries. No other place in Chicago does a burger + fries like this.<br><br>Oh, and they have an immense beer selection that rivals stand-alone pubs.", "pics": null}}, {"review": {"des": "We came for a quick dinner and drink last night, there were three of us and we sat in the front. Our server was impeccable. Honestly one of the best experiences I've had with a server. He was attentive and knowledgeable but succinct and unobtrusive. It was such a pleasant experience. We'll definitely be back.", "pics": null}}, {"review": {"des": "Came here for lunch after going on a brewery tour at Half Acre which is right across the street! My friends and I opted to sit outside as it was a beautiful afternoon, however they also have plenty of indoor seating as well if this is more your style. I ordered the Creole Contender, when it arrived my jaw dropped. This had to be one of the biggest sandwiches I think I have ever seen, and they definitely didn't go lightly on fried chicken either. I loved the crust on the fried chicken is was crispy on the outside and the chicken was juicy still! The chipotle aioli was delicious as well. Will definitely be back soon!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4Ec2Cb_A4ST-uYf3YypJ3A/348s.jpg", "caption": "The creole contender"}]}}, {"review": {"des": "I had the best burger I've ever had last week - 'The Slow Burn'. I've had plenty of acclaimed burgers throughout the city, but nothing compares. This was the best i've ever had.<br><br>Every burger I've had here is really good. This one was a cut above though.<br><br>All in all, a fantastic place with a tremendous beer selection. Check it out!", "pics": null}}, {"review": {"des": "The Bad Apple burger brought me back to life<br>Fuck you Olde Style. The burgers were absolutely amazing not over seasoned and quality meat was used. The putine gravy fries and curds were a nice dish that I was not accustomed to but definetly enjoyed.", "pics": null}}, {"review": {"des": "Got there at 7:45 on a Saturday. There was a 40 min wait.  It was worth the wait. Ordered medium done and it was on point. Delicious poutine as well!", "pics": null}}, {"review": {"des": "I love burgers and I love beer and these guys make some good burgers and they have plenty of local brews that it was a no brainer for me to come out here and check it out.<br><br>The burger portions are pretty huge, and super juicy for my medium-rare Cowboy burger. The burger was very good. There was just so many to choose from, but I'll be back and try some of the other flavors. And as for the fries...it was decent. I had mine trufflized. Tasty, but the fries did seem overcooked.<br><br>I had to dip my fries on some meat juice to make the fries back to its semi-crispy texture.<br><br>Still a great hangout place, plenty of beers and the atmosphere was fun.", "pics": null}}, {"review": {"des": "This place has some of the best burgers in the city!! They are creative while being approachable as a bar/restaurant. <br><br>I love the setup of the restaurant; it can get quite crowded on the weekend, but it still has a cozy feel even when it fills up. My advice with this place: go on a weekday or weekend off-hours. Friday and Saturday are a pain when it comes to getting a table! <br><br>The beer list is consistently great! They offer a lot of variety, and they change the menu frequently with the seasons.<br><br>The food is awesome! I've only had burgers, but they're always delicious! They use high-quality beef, and they know how to properly cook a burger! Sides are tasty; any unique toppings appear to be house-made...in short, the quality is ever-present. <br><br>Terrific spot year-round for burgers and unique beer selection! Plan your trip accordingly; this is not a \"drop in\" spot!", "pics": null}}, {"review": {"des": "Oh my god, the burgers are so juicy and delicious here. And the BEERS, oh my god, THE BEERS! Great selection of locally brewed and a knowledgeable staff to point you towards the right direction. I had the \"Royale with Cheese\" burger which comes with mushroom, roasted shallots and truffle compound butter. You had me at truffle butter. And just in case that wasn't enough truffle, I added truffle salt to my side of fries. Truffle, truffle, truffle. <br><br>I also highly recommend the deep fried cheese curds!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/B1iodnkXzEAe7psCRPVtfg/348s.jpg", "caption": "Royale with cheese"}]}}, {"review": {"des": "I wasn't super happy with my Bad Apple experience. I sat at the bar and, although two different bartenders made eye contact with me, it took a few minutes for either of them to come over with a menu. I had been told the food here is good so even though I wasn't overly hungry, I ordered the poutine. The drink list was decent if not a little expensive and I ordered a water and a cider. I was there for maybe 30-45 minutes in total and never had anyone ask how my food was or if I needed anything else. My check was ready the instant I asked and I was sent off without even a smile or a thank you. It appears that this is a unique experience here but it was enough to turn me off from returning.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/f3D95V2Fe9pEdAVlc-B7-Q/348s.jpg", "caption": "Montreal poutine"}]}}, {"review": {"des": "Loved this place! They have a nice selection of beers, not the same ones you see everywhere, and really awesome cocktails. The mezcal Old Fashioned was unexpectedly tasty. I had The Southern Dandy burger and it was great- the server told me that this burger is predominantly ground sirloin which gives it that 'steak' taste. I was obsessed. <br><br>Be sure to ask for their house made garlic and hot pepper vinegar when the food comes to your table. I used it on my fries and it was next level. The service was fantastic, we never waited long for anything and the server was super sweet. I would definitely come back here.", "pics": null}}, {"review": {"des": "I heard they have the best burgers, but it really didn't hit the spot for me or my friend. The burger was a bit dry and the toppings were mediocre. The fries are okay as well. I think this is a good neighborhood spot, but I would not go out of my way to come here again. It IS super close to the Northman Cider Bar though (I loveeeee ciders), so I might try out a burger again!", "pics": null}}, {"review": {"des": "This place has such a great, chill atmosphere. I've driven past it many time but had never gone in until now. I went with my family on a Friday night around 6:30. We waited for about 10 minutes. <br><br>Their beer selection is MASSIVE. The menu is relatively small but the food is great. We ordered the soft pretzel appetizer which was surprisingly small (but still really good) so the 5 of us didn't get much. I got the Ruben melt burger which was fantastic and humongous. The others in my party all got burgers as well and had nothing but great things to say about them.<br><br>The food came out timely and correct. The service was great as well!", "pics": null}}, {"review": {"des": "Went up to The Bad Apple after a friend from DePaul wanted to grab a burger and a beer one Sunday night. <br><br>There were only a few people inside and it wasn't crowded, only a couple hours from closing time.<br><br>We sat in the back corner of the place and started out with some beers. I had a Southern Tier 2X double milk stout, it was very creamy and delicious.<br><br>We started with the cheese curds and wow these were amazing. Forget Culver's cheese curds, these things were made in house and fresh out of the fryer. Gooey, cheesy and delicious with The Bad Apple's homemade ketchup, I really really enjoyed these curds.<br><br>I had the chupacabra burger which was white cheddar, braised goat chili, roasted garlic and guacamole. Everything on here blended together wonderfully. The braised chili with guacamole was a particularly good combination that worked surprisingly well with a meaty burger. I personally thought the fries were decent, but not out of this world after paying an extra $0.75 for the truffle seasoning.<br><br>Our server was super down to earth and very helpful in taking our orders and giving recommendations. I forget her name but she was great!<br><br>A good experience here, definitely a great burger and solid beer selection.<br><br>\"The Bad Apple\" should really be \"The Good Apple.\"", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/W8mWX_euF1qXXEKly4W6hg/348s.jpg", "caption": "The Chupacabra"}]}}, {"review": {"des": "Loved Bad Apple! Was visiting friends and family took us here. Great beer menu, separate beer flight selection on a menu. So many burger varieties. Staff is super friendly and accommodating! They have a great knowledge of beer and menu. If you are looking for great craft beer and great burgers try Bad Apple!", "pics": null}}, {"review": {"des": "I always love the burgers here. Got their new one \"under the thunderdome \" and it was fantastic.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SO0FrGvQtx84XMprkj3dHQ/348s.jpg", "caption": "Truffle sprouts in the back and JUST BEYOND THE THUNDERDOME in front. Thunderdome  was amazing! I highly recommend"}]}}, {"review": {"des": "I went here in search of a good burger and a few delicious beers, and I was quite satisfied. They had seemingly dozens of great beers on tap, including a bunch of local beers, which is always a good sign. I ordered one of the burgers, and was very impressed. It was cooked to perfection and extremely well made, I have no complaints. The bad apple also had, most importantly, a bottle of Malort that seemed all too eager to find its way into my shot glass. Will be back soon.", "pics": null}}, {"review": {"des": "I've been coming here for years. The Bad Apple isn't in an area I have much business in, but it's worth the trip. The burgers are great, the atmosphere and crowd is pretty good and the beer options are pretty top notch.", "pics": null}}, {"review": {"des": "Love this place. Such a great environment. Good for families, dates, and friends. They do team based service so you're not assigned to 1 server which was interesting and cool. The food was good, I had the cheese curds and a burger with minced garlic fries. I highly recommend getting minced garlic on your fries. Beer list was long and is constantly rotating. I'm going to be a regular at this place.", "pics": null}}, {"review": {"des": "Appetizing Cheese curds, flavorsome, mouthwatering burgers , delightful environment! Couldn't of asked for a better place to dine. Rate it 5 star for giving me a remarkably amazing Sunday night.", "pics": null}}, {"review": {"des": "Got into Chicago later than we intended on a Thursday but met up with a friend who would be our host while we were in town and he suggested we check out Bad Apple as it was in walking distance and good. He steered us right. <br><br>This place has a good beer selection (though our server did try a little too hard to try and select beers for us. I like suggestions, but I don't need to be told what to drink). My wife ordered the feta wop and I had the Elvis's last supper  (burger with peanut butter). We were both incredibly happy with our decisions.  Burgers were cooked perfectly to order  (medium rare for me, medium for my wife) and served hot and fresh.  <br><br>Prices are good, food is fresh and delicious, and the atmosphere is great.", "pics": null}}, {"review": {"des": "Read a review on Yelp and decided to go. I was not disappointed. Great selection of different burgers. My wife and I shared a beet and walnut salad to start. It was very big and only$11. Overall the prices  are reasonable. One of the top 5 burgers I have eaten in Chicago. I don't make that statement lightly.", "pics": null}}, {"review": {"des": "Years later this continues to be one of my favorite spots in the city to eat and my favorite burger and beer place. I've never had a waiter here that wasn't exceptional at their job and super friendly", "pics": null}}, {"review": {"des": "Great food & great service. Brought my 15 year son and his first impression was this place is cool. Parking is not the greatest but well worth the trip from Naperville.", "pics": null}}, {"review": {"des": "One of if not the best burgers I've ever had \"the hashtag\". <br>They also have a great beers on tab and always great customer service. It's a a spot I always check out when I'm down in the area !", "pics": null}}, {"review": {"des": "Darn. Almost every time I come here I get stuck with a surly waitress. I say waitress rather than server because it's always a female server with the bad attitude. The last couple of years it was the one with lots of tats; recently it's been the one with the dark mole on her face. When my 12 year old says,  \"What's the matter with her?\" I know it's bad. My 12 year old never notices these things. <br>Please, management, do a little coaching for your waitstaff. I like your burgers and your wine and all the fun games, but it's my night out and I'd like to be greeted with a smile, not a scowl. <br>Thank you for considering this advice.", "pics": null}}, {"review": {"des": "The one and only burger place I tried in Chicago. After a pre-meal beverage partaking at Begyle brewery, biked on over here to see if the burger is as good as Yelp suggested.<br><br>After securing a seat at the bar, was daunted by the options on the menu. Finally settled on the Andouille Noted burger with Chipotle fries ($12.75) and a Pipeworks Lupine beer ($5.25). Fairly large burger cooked a little darker than I would like yet still oozing juices. The sausage/cheese/sauce topping are sandwiched neatly into the bun making every bite gooily delicious. Chipotle fries are decent; nothing to write home about - could have used more kick.<br><br>A couple of their drafts on the menu weren't available, so that sucked, though the selection is still nice. Really liked the burger here and they have a lot of other options to want to keep coming back. Hopefully I get to.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xWbfPr_zCsKevdot--ZEkA/168s.jpg", "caption": "Food menu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8OluJpVlCdeSIvIvRhJvGA/168s.jpg", "caption": "Andouille burger"}]}}, {"review": {"des": "LOVE this spot.  The entire space is just awesome/fun.  The waitstaff are incredibly friendly.  That alone would make the experience, but they have an awesome drink menu and delicious burgers as well. Their classic Bad Apple burger is great, but always gotta try one of the fun ones (except Elvis - can't bring ourselves to take on the peanut butter).", "pics": null}}, {"review": {"des": "Cool place, laid back, bartender is fun.....comfortable place....deinks are gooooodddd....", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xl3EbcODUcasRu3MnuhHBA/168s.jpg", "caption": "Bad Apple...Very tasty..."}]}}]}