{"name": "the-pasta-bowl-chicago", "reviews": [{"review": {"des": "So good, huge portions and so cheap!<br><br>I always get the farfalle pollo and my husband gets the gnocchi aurora. The Farfalle pollo comes in a very rich cream sauce with sundried tomatoes, mushrooms and chicken. The sauce really picks up the flavor of the sundried tomatoes and it makes it that much better. It's very heavy and the portion is enough to feed 3 people. I did note last time there was too much sauce so it felt like i was eating sauce with a side of pasta. Some people might love this but for me it was too much. The gnocchi aurora is also a large portion and very heavy. The sauce is not as creamy, it's not of a combination or red and white sauce.<br><br>Overall really good food, fast service and it's consistent.", "pics": null}}, {"review": {"des": "We've passed by the Pasta Bowl for years and finally stopped in a few weeks ago before we saw the Holiday Lights at the zoo.  I have to say that we were a little disappointed in our food.  We got the favorite special of Farfalle Pollo and also the Linguine Pesto.  For the Pesto, I just didn't think it was anything special - and really a little bland.  My husband thought the same thing about his pollo dish.  We also got the Paloma and Limoncello Spritz drinks, and even those were not good enough to order a second round.<br><br>I liked the restaurant and atmosphere and thought it was definitely a family friendly place, but the food just didn't wow me enough to want to come back.", "pics": null}}, {"review": {"des": "Huge portions, delicious pasta, and friendly servers have made this spot a go to choice for my boyfriend and me whenever we're craving a quick dinner and can't be bothered to cook. On most nights, they have really good offers on drinks in conjunction with the bar next door ($4 Moscow mules, half off bottles of wine). <br><br>The pastas are a bit on the expensive side for the fast casual ambience, but the portions are very generous, so two people can split a pasta and an appetizer (shout out to the garlic bread!) and have a filling dinner. <br><br>Our favorites include the Pollo Farfalle (grilled chicken and bow two pasta in their signature creamy sauce, along with fresh and sun dried tomatoes), or the penne puttanesca if I'm craving something a little spicier and lighter. They're very good with customizations, and I love subbing the puttanesca in the Linguini so Frutti di Mare (linguini with seafood). <br><br>The place is almost always full, so you can get your order delivered or as a takeout by ordering online, but Pasta Bowl has such a great atmosphere and service that it's worth the wait to be seated. They have bar stool tables for 2, and booths for 4-6, so it's not ideal for groups larger than that.", "pics": null}}, {"review": {"des": "The Pasta Bowl gets 4.5 stars from me! We enjoyed everything we ordered and would definitely dine here again. I recommend trying The Pasta Bowl out if you are looking for affordable good food.<br><br>What we had:<br>*Fried Mozzarella Sticks - 4 stars<br>*Tuffo Saporito - 4 stars <br>*Bruschetta - 4 stars <br>*Chicken Parmesan - 3.5 stars <br>*Gnocchi Aurora - 5 stars (freaking delicious and a must try)<br>*Rigatoni Bolognese - 4.5 stars", "pics": null}}, {"review": {"des": "This place is really good! So far I've tried the chicken parm--had it delivered, and it held up REALLY well! It's also a huge portion. The pasta is also well-cooked; it was nice having delivered pasta with chicken parm in particular that wasn't super-gummy or over-cooked. <br><br>Round 2 was the rigatoni with bolognese, and I added meatballs. The star of this was the sauce and the inclusion of mushrooms. The mushrooms added another meatier, tasty dimension to an otherwise \"just ok\" meat sauce.   Meatballs were good....a little bit dense, but they had a decent flavor and weren't dried out. <br><br>Another tasty surprise to the second order was the antipasto skewers. It's a nice, unique way to eat an antipasto, and it was really good!! All the ingredients were fresh and good quality, and the skewers were drizzled in a little olive oil. It's a really good hearty start to a meal if you're tired of salads and want something that isn't fried. Highly recommend these bad boys!! <br><br>I'm keeping this place in my regular rotation--only knock is the price; the food is of decent quality, but a higher price point than some other pasta/pizza places in the area. ($17 for some very traditional, rustic pasta dishes....) <br><br>Otherwise, highly recommend for some good Italian food that does surprising well with delivery!", "pics": null}}, {"review": {"des": "This is truly a solid italian restaurant! Great for lunch or a casual dinner. The chicken parmesan is massive and delicious!!", "pics": null}}, {"review": {"des": "I ordered the Gnocchi Aurora and boy that was a pretty decent portion. Taste's pretty good, although the gnocchi does feel a little soggy. Overall this seems like a family-style Italian restaurant/ pasta house. Definitely coming back to try more of their dishes", "pics": null}}, {"review": {"des": "We love, love, Iove Pasta Bowl. We eat here about twice a month and sit at the counter. Service is always amazing, food is wonderful and very reasonable. Highly recommend this hidden gem.", "pics": null}}, {"review": {"des": "I came here with my pasta loving grandma for lunch on a Monday afternoon. She had the spaghetti and meatballs and I had a lunch special (shells, creamy tomato sauce, chicken, tomato, spinach). We both loved our meals and were impressed by the portion size. Mine especially was a great deal. The meatballs were tender and flavorful. Our server couldn't have been sweeter- she kept our drinks filled and was prompt and attentive. My grandma was thrilled! Mission accomplished! I would definitely come back again. I love a place like this that's simple in concept but effective.", "pics": null}}, {"review": {"des": "First off service was excellent! We were greeted right away. Server answered any questions we had with a delightful demeanor. I ordered the Farfella pollo it had cream sauce,mushroom,dried tomatoes and chicken. Yum yum yummy!! Big portions and reasonable prices. I will return.", "pics": null}}, {"review": {"des": "Chicago isn't home for me so unfortunately I don't get to enjoy this place as much as I'd like but every time I'm in town it's the FIRST meal I get. Sometimes when I'm at the airport waiting for my bags I just start my online order so that it gets to me the same time I arrive. <br><br>This visit I finally decided to go inside and to my surprise it was super casual. Based on the reviews and the quality I just always pictured it being some super fancy place but it's definitely jeans and a T-shirt acceptable kind of place:-). Our waitress was very nice and patient since we took forever to pick what we wanted, trying to switch it up for once. She didn't write down our order which always makes me nervous because I'm that horrible person who substitutes a lot :-/ lol. His food comes out first, looks great! My bowl follows and it's wrong. I almost laughed out loud because we called it. She didn't blame me for it like some people do like you didn't tell me you wanted this sauce she nicely took it back and had the correct order in no time. She apologized multiple times and even threw in dessert for the inconvenience. It was super good as always. I love her for wanting to make it right for us and I will continue to come here every time I visit Chicago. The dessert thing was good because we never get dessert from here but now the Oreo whatever it's called will definitely be added to our delivery order from now on! <br><br>P.s. my picture just doesn't do this place justice, just try it ! Lol", "pics": null}}, {"review": {"des": "I'm in town from Austin, TX, first time in Chicago, and without a doubt, this place is AWESOME. Not to mention, the service is platinum! I took my little girl (7 yo) after all day at the aquarium and planetarium, and it was pretty busy on a Sunday night. <br><br>At one point, she started crying because she was tired, and three different staff came over to make sure everything was ok. A bit later, she got pretty cold, so I asked to move over to the bar out from under the AC. No problem at all. Then a bit later the waiter, Patrick, came by and told us we were having dessert on the house because it was taking so long!! I seriously didn't have a problem with the time. I wasn't really concerned to be honest. <br><br>To sum up, the food is amazeballs. The service is unbelievable. The atmosphere is super awesome. And I feel like I'm forgetting something.... <br>Oh yea, this place is badass!! Do yourself a favor.", "pics": null}}, {"review": {"des": "This place is so good! I came here with a group of friends on a Saturday evening and we were seated right away even though the seating is limited. The portions are huge and they have a great selection of pastas to choose from. I tried their house special Farfalle Pollo which was delicious. The sauce was super rich and creamy and perfectly flavored. My only complaint is the bread which was very hard to break. I wish they served it toasted. The Pasta Bowl isn't an authentic Italian spot but definitely the place to go if you're craving Italian comfort food.", "pics": null}}, {"review": {"des": "The flavors of my meal were outstanding.  Homemade marinara sauce is so good.  Service and pricing were excellent too.", "pics": null}}, {"review": {"des": "Fuck. Yes. Feed me more pasta!<br><br>The frutte de la mar was a large portion and was phenomenal. <br><br>Food came to us in lighting quick time. <br><br>Beer was cold and plentiful. <br><br>Will be returning next time I'm in Chicago.", "pics": null}}, {"review": {"des": "I went there on a Sunday night around 7:30 and it was quite busy. We were seated quickly and near the window. My mom had a good meal (pasta putanesca) and I had rigatoni bolognese. The portions were big enough for us to bring back hone to have for dinner tonight ! <br><br>My mom had never been before and raved about it. I've been going off and on for years. The main reason I'm writing is to mention how nice our server Cas was. He was patient, friendly, suggested good menu items and just made us feel at home and most importantly, not rushed. <br><br>Check out Pasta Bowl. The prices are very reasonable too.", "pics": null}}, {"review": {"des": "Came here to carboload before the Chicago Marathon and I'm not a fan. I got the rosemary gnocci and it was just super heavy. I coulnd't taste the rosemary at all, it just was heavy cream tasting.. disappointed for $12. The boyfriend ordered chicken alfredo ($13) but we asked for the chicken on the side since he's reducing his meat intake. The chicken that was given was superrrrr dry and overdone. Even after mixing it in my saucy gnocci didn't save it.<br><br>The cheesy bread was good for $5 though. <br><br>I took my leftovers home and had it for lunch the next day and it was unappetizing and still super heavy. I was disappointed in this place overall. Service wasn't too friendly, basically just took our order and delivered it.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/i6NgK-z6Fwhm53ZDNkajuQ/168s.jpg", "caption": "Chicken on the side."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UGhD__CUifqFfJXzwwWbHA/168s.jpg", "caption": "Fettuccini Chicken (on the side) alfredo $13"}]}}, {"review": {"des": "I got the house special farfalle pasta with no chicken. The cheesy/creamy sauce it was in was very rich but very good. I sat at the bar which was a pretty cool spot because you were able to watch the chef prepare each pasta dish. <br><br>I would recommend this restaurant to anyone looking for a rich and indulgent meal. Next time I go i will try the pesto.", "pics": null}}, {"review": {"des": "I am not one to ever complain about service because it's not a big deal to me if a server isn't A++++, but this is the worst service I've ever experienced. Not only were we pushed to the bar side of the restaurant (which wouldn't have mattered if we had a 5-star experience, or even a 4-star experience), but the male who told us where we were going to be seated handed us ONE menu (between two of us) and told us to just take an open table on the bar side of the menu. It was odd because he was very adamant on making sure we were sat in a timely matter then he handed us a menu and we were on our own with finding a seat.<br><br>Again, this wouldn't have mattered if the service was acceptable. My server did not introduce herself, she took a long time to get us water (my friend ordered a beer which got there before our two waters). It took 40 minutes to get my friend her salad - I ordered a pasta entree and it didn't come until about 15 minutes after her salad was on the table. The waitress did not apologize. She said she would check on my food. Two minutes later she was taking shots with the table behind us. When my pasta arrived, she offered us shots because we were waiting so long. I was running a half marathon the next day so I declined. She did not offer a discount on the meal or to comp my friend's beer after we declined shots. I asked for a knife to cut my pasta. Never got the knife. <br><br>Nothing was wrong with my meal but it wasn't enough for me to ever come back after such bad service.", "pics": null}}, {"review": {"des": "Great environment, great service & fabulous pasta! Farfalle Pollo is very delicious and a large portion. Lobster Ravioli was amazing but not filling! Waitress was very nice and helpful. We had to eat pasta our days while visiting Chicago! It was an unforgettable pasta adventure! Yum", "pics": null}}, {"review": {"des": "No frills pasta joint with great pasta and portions for the price. <br><br>I have eaten in and taken out: both times were delightful. I definitely prefer eating in though. The two pasta chefs tossing pasta behind the bar creates a fun and aroma-filled atmosphere that I haven't found in any other Italian/pasta place. <br><br>Don't doubt the what the menu says, the Farfalle Pollo is far and away their best dish. It's a must if it is your first time here. I have also had their Rigatoni Bolognese as well, which is tasty. <br><br>Also their portions are HUGE, expect leftovers for lunch or dinner the next day. I once ate a whole thing of Farfalle Pollo in one sitting: tasted amazing, but I would not recommend for your skin and calorie intake's sake. <br><br>Easy on the wallet, easy on the taste buds, and easy on the eyes, Pasta Bowl is perfect.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nLtFG6d410ctzzGH4k6TZg/348s.jpg", "caption": "Rigatoni Bolognese, how I love thee"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jxwpQBiO7uhHN4pnikVPJA/168s.jpg", "caption": "serving up smiles since 1996"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qLkTihAeO9I2NjF_htjQOQ/168s.jpg", "caption": "The GOAT: The Farfalle Pollo"}]}}, {"review": {"des": "Pasta is my favorite food (unapologetically love carbs) and so I'm always looking for a bomb pasta place to dine at that isn't crazy expensive. I thoroughly enjoyed The Pasta Bowl- tortellini was great, service was great, wine specials were the best :} Definitely will be coming back!", "pics": null}}, {"review": {"des": "Great food, classy ambience and an amazing service. We had the spaghetti autunno special which is to die for! <br>The cocktails (limincello, aperol paloma) were really nice too, and we wrapped up with a good new york style cheesecake. <br>Cheers to Ashlynn for hosting us for the night!", "pics": null}}, {"review": {"des": "Pasta bowl lives up to the hype. Big portions for a low price. The vibe in the restaurant is casual and perfect for a delicious dinner during the week. I have been here a few times since moving to Chicago and haven't found a meal that I enjoy more than the Pasta Bowl's farafalle pollo. Also recommend trying the house limoncello!", "pics": null}}, {"review": {"des": "Love it!<br><br>deliciously good, fast, and great prices. This is a great place to get great pasta. Their portions are huge and you always have left overs for days.<br><br>Their service is good and food comes fast and hot. When not getting take out I love sitting at the bar to watch everything that is going on, as you watch while their are cooking.<br><br>I am a fan of the bolognese meat, an their not being short on cheese. But I also love their toasted ravioli with marinara sauce, chicken parmesan, and farfalle pollo.<br><br>A really great place for comfort food.", "pics": null}}, {"review": {"des": "Our food was amazing!!  We quickly looked on yelp when we got to Chicago to grab a bite to eat. The Pasta Bowl was walking distance from where we were staying. Everything on the menu looked great! It was kind of hard to decide what to eat because everything sounded delicious. It's a small cute place where you can see the chef cooking your meal. We ended up getting a Caesar Salad which was a great choice. A large was plenty to split for two. We also split the special pasta. Highly recommend! Again we split the pasta, great choice. We also order mozzarella sticks to start our meal. They were good, but I think I would try a different app. If you're in the area and looking for a delicious meal, good prices, casual, and an overall experience, I would recommend trying to The Pasta Bowl!", "pics": null}}, {"review": {"des": "If you are in the mood to dress casual and are craving Italian comfort food and lots of carbs (and you just happen to be in Chicago), then this is the restaurant to come and satisfy your needs!<br><br>I was in the mood for pasta and so my cousin decided to take all of us to her favorite casual pasta location, The Pasta Bowl. The restaurant itself is kinda small, dim, and divey but don't let that fool you. The pasta here is superb. For appetizers, we ordered the Calamari Fritti, which was alright in my opinion. For each of my cousins, we each ordered a different pasta dish so we can try each other's food. I ordered the Conchiolie Al Fuso but we also ordered the Spaghetti Frutti Di Mare, the Gnocchi Aurora, and the Fettucine Chicken Alfredo. All the pasta dishes were really good! I especially liked mine because of the smokiness flavor from the chicken that was in my dish. Also, the vodka sauce in my dish was divine. I mean...it's pasta with lots of heavy, thick sauce so what more do you expect from that? If you want something that's not heavy cream tasting, then I suggest you go somewhere else. Each of the pasta dishes came out in huge portions so it was very, very filling and you will end up with a food coma. Service was attentive and fast. Street parking is really readily available everywhere. Will definitely come back once I'm back in Chicago sometime in the near future!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zGML4qm8B2uwWM18zclQMw/348s.jpg", "caption": "Mmhmmm I was in heaven :3"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6JiiXcEojsPaO4z7y68F1Q/168s.jpg", "caption": "Our pasta dinner party~"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/e5JDTtAMxHEDlAEjY0PqRw/168s.jpg", "caption": "YAAASSSS SO GOOD!!!"}]}}, {"review": {"des": "This is a really fun location to catch a game or ear a casual dinner. We were promptly seated and indulged in a few libations to start. They have drink specials everyday it seems. I got the farfalle de pollo. This was so creamy and yummy! I definitely shared because it's huge. The service was great and the menu offers a great variety of options! I was very content with my dish and so were others at our table. It felt very fun and it's in a cool location at Lincoln Park! I'm very satisfied with my experience. Very generous portions and good prices.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mXKO5RAALg7U0czqtQsIPA/348s.jpg", "caption": "Farfalle de pollo"}]}}, {"review": {"des": "The house Special is my Absolute Fave! Has Huge Portions & You'll leave highly satisfied.", "pics": null}}, {"review": {"des": "Dined here with my mom and had a mediocre experience. <br><br>We came in on a Sunday afternoon and the place wasn't busy so service was fast. Too fast. We ordered bruschetta & cheesy bread as appetizers and spaghetti/meatballs & rosemary gnocchi for entrees. Our server forgot to put the pastas on a hold and sent them straight through because we received them around 3 minutes after we got our appetizers. Not a good start. <br><br>I believe Colton, our server, was new because every question we asked him was followed by him searching for someone else to answer it. He didn't even know what the gnocchi was- and that's what I ordered. I asked if they hand made their pasta and our server said 'no it's from a bag'. We also sat near the POS system where the servers were chatting and hanging out- granted there wasn't a lot of space, but since the restaurant shared space with the bar, it felt like the servers were more interested in themselves than the guests.<br><br>We packed our meals to go and just as we got up from the table, one of the younger waitresss was showing our server some karate kick move while talking about her rent and knocked into my mom.<br><br>I was pissed.<br><br>I told her to watch it - Our server apologized, but I just wanted to get out as soon as possible. It didn't look like there was a manager on duty, but if there was one, they should be more attentive to how their staff acts in the restaurant in front of guests.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Tp_oC7Waxb7KGEmun8hvsg/348s.jpg", "caption": "Gnocchi - super thick gnocchi - not light and fluffy clouds at all"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/la5Ba5KRciBkn3pAywdOtg/168s.jpg", "caption": "Spaghetti & Meatballs"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nMQga5qx3r8LYDdoTSs-qg/168s.jpg", "caption": "Cheese sticks"}]}}, {"review": {"des": "Amazing food and great service!!! On Wednesdays, they have half off bottles of wine which is awesome! Last night I ordered take out and they said my food would take an hour. However it was only 30ish minutes! Definitely recommend this spot. It's one of my favorite Italian places in Lincoln Park!", "pics": null}}, {"review": {"des": "Visiting in town and Yelp guided me to another great decision. Delivery arrived 25 minutes early and the food was fantastic. Huge portion--could easily feed two people and probably still have leftovers.", "pics": null}}, {"review": {"des": "I came on a Tuesday evening around 6:30pm and we were able to seat ourselves right away for a table of 3. Right as you step into the restaurant it has the bar in the front and then when you walk past there are many booths and tables to seat in. We ordered the Toasted Ravioli with Marinara Sauce (6 pieces), Chicken Parmesan, and Farfalle Pollo. Everything we ordered came out pretty quickly and was very delicious. If you are craving some hearty Italian food for a reasonable price close to Lincoln Park this is the place to go!", "pics": null}}, {"review": {"des": "This really might be the best pasta we have ever had! We found The Pasta Bowl on Yelp while visiting the Lincoln Park area and were extremely impressed with the flavor and the service.", "pics": null}}, {"review": {"des": "Stopped in here while visiting family. They were so kind to fit 8 in and the food was delicious. My 5 year old told me the spaghetti and meatballs were better than Arkansas where we live. Friendly staff!", "pics": null}}, {"review": {"des": "We discovered the Pasta Bowl in Lincoln Park on St. Patrick's day 2017. All of the nearby bars were overflowing so we stopped to grab some dinner and were excited to see they also had a full bar. Everything was excellent. After the first visit I probably went 4-5 more times in the month or two before I moved away and had the same excellent experience each time. <br><br>The drinks were average in taste, but the price was excellent for Chicago. The pasta may have been the best I've ever had. I've had the Chicken Parm, Farfalle Pollo, and Fettucine Chicken Alfredo, and a few of the salads. All of it was excellent, the Farfalle Pollo in particular. As many others have said, all of the dishes are heavy, creamy, and HUGE. You'll definitely have leftovers, or if not, you'll be full for the day. The price is also very reasonable for the quantity of food you receive. Each time I've gone the service has been excellent. One time I went with a friend with very specific dietary restrictions. The server was very helpful and the kitchen very accommodating. <br><br>I highly recommend sitting at the bar and watch the cooks if you get a chance, it really adds to the experience. <br><br>I'm moving back to Chicago shortly, and in looking for an apartment made sure that the restaurant was within walking distance. I'm already planning to go back within my first few days back, and am considering whether or not I should wear the Pasta Bowl t-shirt a friend bought me for Christmas (just kidding, that'd be a bit much).", "pics": null}}, {"review": {"des": "I ordered the tortellini crema with chicken, and my bf got the lobster ravioli for us to share. Both were very rich and creamy, and more than enough for us to share with leftovers for the next day. The lobster ravioli was delectable, and practically melted in your mouth. The tortellini crema was good as well, and I'm glad that we added the chicken for a bit more flavor. We also ordered the beer special, which I believe was about $3. We will definitely be back for more pasta!", "pics": null}}, {"review": {"des": "Great place we found by accident. If I lived here, I would definitely be a regular. Service was great, atmosphere was great, but the pasta. Oh the pasta was great. Had the Pollo Farfell and a Shells with crab special. When in town, we will be back. YUM!", "pics": null}}, {"review": {"des": "I ordered the rigatoni bolognese. The pasta wasn't over cooked and just the right amount of sauce. Small restaurant and can be very busy and loud during dinner hours on the weekend. The staff was friendly, quick service.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/z00Enu-Utsb6h8wAGtA_Ew/168s.jpg", "caption": "Rigatoni Bolognese"}]}}, {"review": {"des": "We stumbled upon this place while looking for a casual dinner spot.  It was perfect! Great service, nice portions, inexpensive prices, and delicious food! We had the bruschetta app which was phenomenal! I had the house side salad which was great as well as the Bona Vita Primavera with smoked mozzarella added. The pasta was delicious! I tasted my boyfriend's gnocchi Aurora which was also delicious. So glad we stopped in- what a yummy surprise! We will be back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mB8VH3ka00NBLOV3j3xH9Q/348s.jpg", "caption": "Bona Vita Primavera with smoked mozzarella added on top!  So delicious!"}]}}, {"review": {"des": "The signature dish - Farfalle Pollo - is incredible.  Friendly service, chill atmosphere, and not too pricy for what you get.", "pics": null}}, {"review": {"des": "I feel like you can't go wrong with pasta - especially at The Pasta Bowl. I love getting delivery and eating in the venue. Their pasta menu has a huge range of different pastas and sauces and they're all price very reasonably. Plus the portions are great and I never leave still hungry. The sauces are made in house so it always tastes super fresh and flavorful. You can even see them cooking with their open grill set up which adds a fun flair to the restaurant. <br>The service was fast and super friendly, I liked that I could seat myself but everyone was still very attentive. This would a great place for a date or fun lunch hang out.", "pics": null}}, {"review": {"des": "Highly disappointed. Gnocchi was chewy and dense, I'll take a bet that they don't make it in house. The chicken in both dishes was so dry and the Alfredo sauce was bland. You get big portions but I would prefer higher quality ingredients in a small portion for the same price. Would not recommend, or eat again", "pics": null}}, {"review": {"des": "Last week I tried spaghetti and meatballs for the first time in years. Today I wanted to compare it to another place just for the fun of it. I went to 'The Pasta Bowl\" because of the things I have read about it on sites like this. This place was very good. The coffee was good but not dark and bitter like some. The waiter, Colton, was helpful and helped me to get  what I wanted even tho it was not like the menu presented it. I was able to get my meatball with cappellini instead of regular spaghetti. He said that the house salad was very good and it was. The prices were a couple dollars less than comparable places. I was on the restaurant side, not fancy but they have been open for decades. The bar side was probably fancier but I wanted the food. The place gets an A+ from me.", "pics": null}}, {"review": {"des": "This pasta was pretty bad, good portions- but who would want a big portion of awful pasta.. also a 5 year old could make a better salad then they can.", "pics": null}}, {"review": {"des": "Great pasta. Big portions. Extremely fast delivery. This is my go to pasta place when I feel like staying in after a long day at work.", "pics": null}}, {"review": {"des": "Stopped by thinking this was some fast food joint (think Panera or Cafe Baci) and was fortunately wrong! It may look small and kind of dive-y from the outside but don't let that fool you...the pasta is just as delicious as something you'd find at a \"nicer\" sit down restaurant<br><br>I've had the below:<br>- cheesy garlic bread (YUM! And cheap $5)<br>- lobster ravioli (super meaty and deliciously creamy)<br>- farfalle pollo (their signature dish and rightfully so!)<br>- spaghetti frutti de mari (a generous amount of seafood, love angel hair pasta) <br><br>Staff is friendly and you get to watch the cooks make the food (pretty distracting in a good way). So if you're on a boring date you'll have them as entertainment", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GJFvF4WMFbH7eL8BhLj3EQ/168s.jpg", "caption": "Lobster ravioli! I don't enjoy the sundries tomatoes but everything else is sooo delicious. You can taste the lobster"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BqoPlifGQwAp6U6P7z-OaQ/168s.jpg", "caption": "Doesn't look like much...but it's delicious! Did I mention it's only $5!!?"}]}}, {"review": {"des": "WOW!! Pasta heaven.. can't believe I haven't found this place before! Today was the first time I've visited this place and it was outstanding. Me and my friend ordered 2 different pastas and we split it. I honestly don't know which one I liked more, plus I was eyeing the pasta that the guy sitting across from us was eating too. Portions are big, I only ate half of my pasta and took the rest home for dinner. We will definitely be back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/11gq-WrqNffQXfWDzzxfrw/168s.jpg", "caption": "Farfalle Pollo... delicious!!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/x-a6zkDI1v_Vte0SE1qREg/168s.jpg", "caption": "Conchiglie al Fuso... amazing!!!"}]}}, {"review": {"des": "Amazing food and atmosphere. Christina was such a great waitress- very attentive and fast. All of our food was perfect & timely. Definitely a favorite in Lincoln Park.", "pics": null}}, {"review": {"des": "I had a lovely experience at Pasta Bowl! I went there for a group hang with some friends last week and I was very impressed. I'd never been to Pasta Bowl before but I love pasta with my whole heart so I was very excited to try it out. Before going I was expecting a sort of \"Noodles and Company\" look so when I arrived and saw the very comfortable aura I was surprised. I sat in the back and the staff was very helpful and attentive! My waitress was super kind and delivered our food quickly. The food tasted absolutely amazing! I ordered the angel hair with mozzarella and it was so delicious!! The mozzarella was melty and the sauce was flavorful! I had an amazing time and I would love to come back :)", "pics": null}}, {"review": {"des": "One of my favorite pasta places to go to. I've tried several different items off the menu and each is as good (if not better) than the last. Huge portions, good pricing, and a great ambience! Highly recommend going if you're in the neighborhood!", "pics": null}}, {"review": {"des": "I literally lived across the street from this place for a year and NEVER came, and now that I moved away and have tried it I`m so sad I wasted a year in close proximity! I came here for dinner on a Wednesday night with a friend-- ambiance is super casual, I was able to be seated right away, and the smells are free and unreal! Would also be good for a first or second date.<br><br>Wednesdays are half off bottles of wine, so if you're going to get 2 glasses you might as well get a bottle as it's the same price (very affordable wine all around)!<br><br>I ordered the farfalle pollo but with vodka sauce, and my friend ordered the Conchiglie al Fuso. We both LOVED our dishes. Serving sizes are great! It comes with a piece of bread (very unmemorable- literally just sliced flavorless bread, but whatever). <br><br>Will definitely be coming back here a lot more frequently-- there are so many more dishes on the menu I want to try!", "pics": null}}, {"review": {"des": "Got the conchiglie gorgonzola! The pasta was pretty delicious albeit a tad bit too salty for my taste. But I would absolutely come again because I'm dying to try their other dishes! The portions are pretty large and the prices are fair! Plus the service is amazing and very quick! I don't think the pasta here is particularly \"true Italian\" but it's still worth a trip if you're craving some pasta on a budget!", "pics": null}}, {"review": {"des": "Continues to be my solid go to for food delivered to my door. Food is way above average for delivery, tasting as good as if t was delivered to a table in the restaurant. Serving sizes are fairly generous, so my wife and I order for one and share.", "pics": null}}, {"review": {"des": "Pasta bowl is a great spot to satisfying your carb cravings. I love to come here during the week for dinner with friends. <br><br>The menu is reasonably priced. Most of the bowls of pasta are around $12, and the portion size is legit. I've never left hungry and usually (sometimes not always) have some leftovers to take home. I've had the house specialty, farfalle pollo, and the rigatoni. Both are good, but the farfalle pollo is especially good with mushrooms, chicken, and sundries tomatoes! The place is not BYOB but a glass of wine is only $7 so still better priced than other spots. <br><br>Service is nice but it can take some time for servers to check back with the table. The atmosphere is very casual, almost like having dinner at a friend's home. You can watch the cooks making all the dishes if you sit at the bar counter. <br><br>Don't have to head to the west loop for some legit pasta. There can be a wait on the weekends during the dinner rush but definitely worth a visit!", "pics": null}}, {"review": {"des": "This is such a cute little spot with delicious food! The prices are right and the flavor is great! My fiance and I split the bruschetta (yum), an argula salad, the rigatoni bolognese and the AMAZING chocolate chip cookie icecream sundae. It's a little noisy so if you're looking for something quiet this may not be the place for you. I loved it though! Would highly recommend!", "pics": null}}, {"review": {"des": "Owner is psycho. After I submitted a complaint about poor service, she went out of her way to find my personal contact information and told us we weren't welcome at her establishment again. Um.....", "pics": null}}, {"review": {"des": "A last-minute, wholesome, and pasta-licious lunch and I was bowl'ed over. <br><br>The current lunch specials are $8.99 for an entree and a drink. I had their signature dish, Farfalle Pollo which consisted of grilled chicken, sun-dried tomatoes, garlic-buttered mushrooms, plum tomatoes, basil, parmesan, and house cream sauce. I don't think I will try their other dishes in the mean time, just because I'm hooked on this one. Note: The lunch special portion is just as big as their regular, normal-size entrees. It's a good deal to catch!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GcqNQqcjdhSly6CVPipeeg/168s.jpg", "caption": "Farfalle pollo"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/o72D6n0xqt1ePo98pQrEfw/168s.jpg", "caption": "Rigatoni bolognese"}]}}, {"review": {"des": "Walked in- smelled amazing <br>Server was super friendly and checked on us the perfect amount and always kept our drinks filled at all times <br>I liked how the kitchen was open and you could see them cooking and the food was prepared quickly and tasted amazing I loved how fresh the seafood was and the Alfredo was one of the best I've ever had, me and my boyfriends new fav spot", "pics": null}}, {"review": {"des": "This place is insanely good! From the moment you walk in you are greeted right away with the smile. The staff all works together to serve you and give you an amazing experience. This place in unpretentious. It feels like you are being hosted in someone's home. The pasta is amazing. I've had a few different meatless options and have never been disappointed. I've traveled all over the world and this place might be the best pasta I've had second to actually being in Italy. The tiramisu was also surprisingly good. It literally melts in your mouth. This place is such a hidden gem. I highly recommend you try it. It's adorable, good and sauces are made fresh. The staff has fun and will make you smile. Give this place a go!", "pics": null}}, {"review": {"des": "The Pasta Bowl is one of my favorite spots in Chicago to get inexpensive and delicious Italian food. The portions here are enormous, the pasta and sauces taste incredible, everything is made fresh, so when you're feeling like Italian comfort food, I highly recommend the Pasta Bowl!", "pics": null}}, {"review": {"des": "The food here is amazing. The pasta tastes fresh and flavorful. Ambiance is a little hectic, with a high noise level and lots of chaos. Come here if you just want great food! If you're looking for a relaxing meal, look elsewhere.", "pics": null}}, {"review": {"des": "Our nurse recommended us this place to have dinner after of our appointment and we loved it, we ordered fettuccine chicken Alfredo and my son the spaghetti with meatballs, everything was good and fresh (it's made at the moment you order)  The service was excellent, If you're looking a place for a good pasta. This is the right place!", "pics": null}}, {"review": {"des": "As we drove up, I was nervous about this place. From the outside it doesn't look like much, but the second you get inside it feels extremely homey and comfortable. We went on a Tuesday night, which happened to be half off bottles of wine night so we quickly ordered a bottle of Pinot noir. They had tons of other options, but this one was amazing. <br><br>We started with a large mixed house salad to share between the four of us. It was so good, delicious olives, tomatoes and dressing. When it came to the main dishes, we stuck with pasta because of the amazing reviews and our waitresses suggestions. My sister ordered the gnocchi Aurora, which comes with grilled chicken and a sauce on top. Her dish was really good and the sauce had a great flavor. My mom ordered the classic spaghetti and meatballs. The meatballs were full of flavor and the marinara sauce was delicious. My dad and I both ordered the farfalle pollo, which is their signature dish. After a few bites I understood why. The PSAT had a wonderful flavor and the different ingredients complimented each other really well. Each pasta dish came with some wonderful sourdough bread and our server brought us some olive oil for it. <br><br>Overall this place was amazing! Great food, great atmosphere and wonderful service. The neighborhood is super safe and tons of on the street parking. Spend your money and time here!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Tsp5ZxGv6gOqD_AimTZ-PA/348s.jpg", "caption": "House salad!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YjixJAfMzpGa8VfdwQCpAg/168s.jpg", "caption": "Spaghetti and meatballs!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LuzeT5cvA92ieu8Y-HAxSg/168s.jpg", "caption": "Lots of leftovers!"}]}}, {"review": {"des": "I've been coming here for years and the food has always been consistently tasty. The only thing I ever order is the Farfalle Pollo, but it's so good that I never want to try anything else. It's a farfalle pasta in a cream sauce with basil, sun-dried tomatoes, fresh tomatoes, parmesan, chicken, and mushrooms (I get mine without the mushrooms). At $8.99 it's a very reasonably priced dish that packs some good flavor. <br><br>The service is pretty good. Waiters are more or less attentive. The place has a nice laid back feel that is good for catching up with a friend over a meal. I will say that seating is rather limited though. <br><br>Overall, it's a pretty great place to grab a pasta dish. I definitely recommend it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NU9FMEjd9rbC3Z4krripFg/348s.jpg", "caption": "Farfalle Pollo! A great Dish."}]}}, {"review": {"des": "LOVE. <br><br>Good, fast, cheap pasta every time. I come to The Pasta Bowl pretty frequently and my addiction is the rigatoni bolognese. Oof. I'm, by no stretch of the imagination, a light eater and yet I have to get a to go container every time. They won't substitute a different pasta so don't bother asking but that's no biggie. The bolognese meat is thick and flavorful and they don't skimp out on the cheese either. It's served with a slice of crusty bread that I don't usually eat, if you're curious, and doesn't come with a side. Totally fine by me - the pasta's so filling, I doubt I'd have room for a side anyway!", "pics": null}}, {"review": {"des": "Pasta bowl literally has some of the best food I've ever had. I went on a binge a couple of months ago where I was eating Pasta Bowl for weeks straight, definitely the healthiest choice I've ever made . There was one time there was an issue with my order that I won't elaborate on because this place is too good to say anything negative, but let me tell you what the manager did! The next time I placed an order, he completely comp'd the entire meal and gave me a bottle of wine! EXCELLENT way to bounce back from that little error. I recommend this place 100%.... Get the Chicken Alfredo with shrimp added   so good!", "pics": null}}, {"review": {"des": "Loved the restaurant very nice people, the service was great and helpful.<br>My main course was pasta bolonghse it was delicious! I'm defenatly going to come back here and try it all, yummy!!", "pics": null}}, {"review": {"des": "Great for a really heavy delicious meal (hangover food, cheat meal, etc) I had the Mac and Cheese with Broccoli and it was too good to be true I died and went to heaven. Huge portions and low prices. Really cute spot with little tables or you can hop over to the connected bar and go grab a drink while you eat too! Love it", "pics": null}}, {"review": {"des": "The Pasta Bowl has pretty good food. Their pasta dishes are delicious. Some of their other things are tasty as well.", "pics": null}}, {"review": {"des": "Absolutely great pasta!!! <br>Fast and good service <br><br>Food always comes out piping hot I love this place everything I had there so far so amazing<br><br> I like sitting at the bar where you can watch them cook the pasta very entertaining", "pics": null}}, {"review": {"des": "I am a pasta loverrrr. My husband is the least picky person in the world... but we both agreed this was gross. I've had it twice (once ordered by a friend to her home). TERRIBLE. The shells in vodka sauce taste like very old grease and had an awful aftertaste. The tri-color tortellini with cream sauce was way over-sauced and heavy. The bread is cheap. Do not bother, even for cheap pasta comfort food.", "pics": null}}, {"review": {"des": "Really good service the food is fantastic reasonable price <br>I will come back here for the Spaghetti bologna's", "pics": null}}, {"review": {"des": "First they told us to seat ourselves and there were negative zero seats to sit in. After walking around the place like fools, my party of 3 and I finally found a corner to sit in. We sat there for about 30 minutes until a waitress came to check in on the couple SITTING NEXT TO US and then neglected the fact that we had been sitting there with hands crossed over the menu for about 30 minutes. We stared at her hoping she would maybe come back and take our order. 10 minutes later, nobody had still taken our order so we just left. Sad I didn't get to try the really appealing looking food.", "pics": null}}, {"review": {"des": "I totally love this place... I have been there twice, and I leave 30 miles away but is worth the drive if I go to the city.... it is a small place but really cozy, they make the food right in front of you!.. and it is really delicious!!!", "pics": null}}, {"review": {"des": "Great food and timely, ordered for delivery and the food got here earlier then expected, food was delicious Alfred and farfallae !!! Great job!!! Would order again!", "pics": null}}, {"review": {"des": "Highly recommended! I came in with a party of nine and they were super accommodating. Connor was very helpful and pleasant. The food came out quickly and was nice and hot! I had the gnocchi rosemary and it was amazing! There was a really good mix of sauce and cheese and there was absolutely no way I could've finished the whole meal. That makes it an even better value for your money! I had some apps as well, the cheese ravioli, and the cheesy garlic bread. Both awesome and the cheese in the ravioli was great! You could tell it was real. Definitely recommended if you're looking for a new pasta place, and I will be returning!", "pics": null}}, {"review": {"des": "Pasta Bowl has great specials if you are looking for a good bowl of pasta. The portion sizes are decent although the seating is limited. Sit at the bar to watch them cook.<br>There is a nice selection of white, red sauces and traditional dishes.", "pics": null}}, {"review": {"des": "I love this place. I always enjoy the spinach salad and seafood linguini.  Today I just had the spaghetti and meatballs. You can't lose with anything on the menu. Everything tastes so fresh and if you sit at the bar you can watch them make your meal. If you are lactose intolerant they put cheese on everything ask for no cheese on top.", "pics": null}}, {"review": {"des": "This is the place to be if you're looking for homey, affordable comfort food in the form of a big bowl of fresh pasta! Came here for lunch and it was such a good deal - somewhere around 8 bucks for a pasta dish. I got the Conchiglie Gorgonzola - shell pasta in a sort of creamy tomato sauce sprinkled with generous amounts of parmesan cheese. The portion is generous, but didn't compromise the taste at all, and the pasta is cooked to perfect al dente. Don't expect this to be some fancy, gourmet Italian pasta - it is delicious as comfort food should be. All I can say is that it made me really happy and warm and I definitely would recommend this place.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-59VxD5-keZ2X8ik4gUalw/348s.jpg", "caption": "Farfelle pollo (top), Conchiglie Gorgonzola (bottom)"}]}}, {"review": {"des": "Always friendly service and the pasta is on point! We got to try different pasta entrees so far and they have been phenomenal. Not too expensive and their drink menu is great.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pP-0Y08FgawLpi3wMhONJg/168s.jpg", "caption": "Chicken Parm"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bqFWTl-vFAXuNAtYwoAXtQ/168s.jpg", "caption": "Tortellini Crema"}]}}, {"review": {"des": "Great service! Young crowd here, hip and happening place. The appetizers were on the \"I can make this at home\" spectrum for me but the entrees! That's where The Pasta Bowl shines. Generous portions served! Comfort food delivered to your varnished wood table! I was with friends who took advantage of the $5 wine glass special with dinner. Traveling had me dehydrated so I stuck with lemon water tonight. My bow tie pasta was creamy cheesy goodness with chicken and sun dried tomatoes. Well balanced entree. The tomatoes added nice freshness to the heavy cream. The spaghetti and meatballs hit the spot although the meatballs were softer than I like but great flavor. ALSO!! The staff surprised us with a little dessert on the house! I'd recommend this place for your pasta comfort food cravings.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/P3Wtf_91L-D48YFO--7uDA/348s.jpg", "caption": "Surprise desserts for our little crew. Very welcomed treat for our party and a great meal."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yG1dVdidQD6_VQVC0vEExQ/168s.jpg", "caption": "Garlic cheese sticks minus a few because we ate them!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YhUcdOF9gSD7Icul5mvNoQ/168s.jpg", "caption": "House special Farfalle Pasta (no mushrooms)"}]}}, {"review": {"des": "Great spot. Never knew this place existed. Will definitely be back. Went to a speakeasy murder mystery spot in the neighborhood and got so buzzed i needed to sober up. Ande took care of me right away. Ordered the shrimp pasta and it was awesome. It reminded me of an Italian spot in NYC back in the day. I will definitely be back. Thank you for the great and quick service.", "pics": null}}, {"review": {"des": "AMAZING FOOD, good service!!! I've heard great things about this place and decided to give it a try. I'm new to the neighborhood and I've found my new favorite pasta restaurant. Katlin was our server, she did great.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/g8u-XF6dWSOSx7LJbI8-Vg/348s.jpg", "caption": "Lobster Ravioli is a MUST try."}]}}, {"review": {"des": "Usually not a huge fan of going out to eat Italian, but this place was so good at an exceptionally reasonable price!<br><br>I came with my family & we ordered family style to try a little bit of everything. We ordered 3 pastas (pesto linguini, rigatoni & the lunch special) and an arugula Parmesan salad. The pesto linguini was the best pesto I have ever had - and I LOVE pesto! The lunch special was such a steal, and included a fairly large side salad and mac and cheese with red peppers & shrimp. IT WAS AMAZING! The portions were very generous and the 3 pastas & 1 salad filled a group of 5. The total came out to be around $44.<br>Definitely our favorite food stop so far!", "pics": null}}, {"review": {"des": "Decided to try pasta bowl based on reviews. I'm glad we decided to try this place out because it was quick, and fulfilling. The staff was very friendly and welcoming. Our waiter was personable and good at explaining the menu. We ordered the cheesy bread (which is awesome for $5), I had the chicken Farrelle, and my friend had the fettuccine Alfredo. This is a wonderful place for lunch, or a very casual dinner spot. Im looking forward to go back to try some of the other things on the menu.", "pics": null}}, {"review": {"des": "Had the chicken alfredo and my friend had the farfalle pollo. The alfredo was so fresh, thin (not too thick), and perfect flavor. I tried the farfalle pasta too that was so delcious with the sundried tomatoes and chicken. Great flavor as well:) Definitely plan on going back...", "pics": null}}, {"review": {"des": "I had a craving for pasta tonight although I'm not the biggest fan of Italian food. There was definitely a fast food, frozen type taste to the food. The first thing that came to mind was Fazoli's to be honest.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MnFh1nTARa8KqZd60FK5GQ/348s.jpg", "caption": "Gnocchi Aurora"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PZofLo01oSc66keyM7rkCg/168s.jpg", "caption": "Lobster Ravioli"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tn8-kfxgggA-2pkbQ-UOlw/168s.jpg", "caption": "Farfelle Pollo"}]}}, {"review": {"des": "Decent price with great customer service and excellent food quality.<br><br>I love Italian food, especially pastas and more specifically, Fettuccini Alfredo with chicken. My friends and I initially planned to visit a ramen shop but I was craving my all time fav FAwC (just made that up) so I looked up on yelp. Luckily, I came across this restaurant and scrolled through few pics and read few reviews and decided to dine in. <br>We were seated all the way at the back because it was packed. The booth was bit uncomfortable from my recollection and one side was higher than the other. Nonetheless, I was here for the food so no complains. <br>We ordered bruschetta for appetizer and loveeeedddd it! We also got another appetizer but I can't seem to remember the name. It was good though. Both of my friends ordered gnocchi but different dishes. Both were delish but not at the level of FAwC. I love creamy food! <br>Will definitely visit again too explore more of what they offer. <br>Strongly recommend everyone to dine here. You won't be disappointed.", "pics": null}}, {"review": {"des": "Stopped here in transit to Toronto, CA. The food is excellent, no doubt about that....the intimate and open atmosphere will make you fall in love with this little restaurant in the middle of a busy city.", "pics": null}}, {"review": {"des": "I was introduced to the Pasta Bowl by my dear friend and fellow Yelper Caroline T and we were both SO glad to stop by for dinner! Following her wonderful suggestion we both got the Gnocchi Aurora with 50% marinara and 50% alfredo. BEST suggestion EVER! I loved it so much. The creamy alfredo definitely adds to the gnocchi and makes the dish even more flavorful. Two things that could bump this to a 5: a few pieces of my gnocchi were slightly on the harder side sometimes and the chicken was on the drier side.<br><br>Also, to add some more veggies to our meal, we got the sauteed spinach which besides for being just a tad too salty for me, was a great side, especially to share between 2-3 people. <br><br>Overall, great location, decent prices especially for Italian, and friendly service.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_76wa9tVBfNU0bR7NecfNQ/348s.jpg", "caption": "Gnocchi aurora"}]}}, {"review": {"des": "Delicious! 2 words- Toasted ravioli. Enough said <br>I know you'll be tempted to try the crepe place across the street but trust me.. don't do it, cleanliness is not one of their strong points.", "pics": null}}, {"review": {"des": "Let's just say pasta has always done a number on my large intestine. I'm DEFINITELY lactose and glucose intolerant but life is too short to let something like that hold you back, right folks?<br><br>I've been to The Pasta Bowl twice and ordered the \"macaroni al formaggio\" (fancy pants talk for Mac n cheese) both times because I just couldn't get enough! It has little bits of broccoli so you know it's very healthy. Unfortunately those healthy broccoli bits couldn't save me from tearing up the bathroom as soon as I got home. Yowza!", "pics": null}}, {"review": {"des": "I've seen this place before but never got the courage to go in because I just assumed it was another one of your typical pasta places but honestly, I have no words. This is one of the best pasta places I've ever been to. Pasta had such a great creamy flavor, simply delicious. The service was excellent & food was AMAZING and filling! This place is a must for everyone.", "pics": null}}, {"review": {"des": "This little hole in the wall was amazing, the server was great and very informative. The food was clean the plate amazing! Definitely come in for a bite!", "pics": null}}, {"review": {"des": "I have bought records and hung out in the area for 30 years.  My wife is from Italy and our palette for Italian is quite refined :). I wasn't expecting much, but the yelp reviews looked good and the wife wanted to try it.  The food was very good and quite satisfying!  Caught the $20 wine bottle special (winning) and I bought a daily special (I never do) of pasta and clams.   The wife got seafood fruita de mare and switched to white sauce ($2 extra).  Our waitress was friendly and accommodating (Lael).  We were pleasantly surprised, and I will visit again!", "pics": null}}, {"review": {"des": "This was my first time at the pasta bowl and I couldn't have asked for a better waitress then Amy. She was efficient and kind, everything was so FRESH! My friend and I got salad and an appetizer, it was so fresh the chicken and the lettuce!! Was very pleased. Will be back soon!", "pics": null}}, {"review": {"des": "Best pasta in Chicago would recommend sitting next door at their bar. Super awesome place", "pics": null}}, {"review": {"des": "I went here last night for a girls night with my BESTIE :) I got the chicken parmesan and IT WAS AMAZING. She got the chicken Alfredo. The portion size was huge ! I for sure had left overs. The reason why I am not giving five stars is due to no one acknowledging us at the bar for the first 15 minutes. Staff was walking around us and not offering water or anything. Other than that (typical for a busy Friday night) it was great !", "pics": null}}, {"review": {"des": "Wow! This place never fails to amaze! Great and I do mean great food! Amazing service and so fast. The prices are excellent for the HUGE portions they serve you. This place is a must visit.", "pics": null}}]}