{"name": "the-field-museum-chicago-2", "reviews": [{"review": {"des": "We don't usually like to go to museums when we travel but I LOVE going to natural history museums! We walked through as many of the exhibits that seemed interesting to us to get the most bang out of our ticket, and we had an overpriced (of course, how else do museums make money?) mediocre meal at the cafe.<br><br>This place is HUGE and I would have loved to spend an entire day here if we didn't have our newborn baby with us...we were so exhausted that we ended up passing out at one of the benches while I was wearing the baby for a nap...definitely the most expensive nap we have ever taken, LOL! I definitely would love to come back again next time we visit Chicago!", "pics": null}}, {"review": {"des": "I have been to The Field Museum three times now. I had a great time during my last visit, but only because I paid the extra money to see the paid exhibits. I didn't have a chance to watch the 3D film, but I really enjoyed the Mummies exhibit. The China and Antarctica exhibits were just alright. I think you should at least visit this museum once. You could spend a few hours here, but I won't be going back for a while unless it's with my family who visit me! <br><br>About the memberships... unless you go all of the time, it might be worth it BUT what (sort of) irritates me is that you can't use the membership on museums that are within a 90 mile radius. It's not worth the money to me.", "pics": null}}, {"review": {"des": "A coworker recently mentioned how much he liked the Field Museum and I decided on our next trip to Chicago to check it out. It's huge! It's pretty much impossible to go through it in a day and pay attention to all the exhibits. They have some parking nearby the museum but they share it with the Aquarium. The sign said they were full but we later found out that they did have handicap parking still available. The north parking garage at Soliders Field is not very far away though.<br><br>They have basic admission and all access pass which gives you access to all exhibits plus one 3D movie. We went with the all access pass and saw the movie about Egypt. It was pretty good and informative but I could have done without this particular movie.<br><br>Since there were so many exhibits we decided to focus on the dinosaur exhibit and the Egypt exhibit. The dinosaur exhibit was very impressive! They had so much information from the creation of Earth to the different dinosaur eras and humans. Unfortunately the exhibit to Sue, the largest T-Rex found was not open because they were working on creating a new space for it but they did at least have a window open so you could still see it.<br><br>The Egypt exhibit was pretty neat but they didn't have as much to see as I had expected. If you go into the exhibit from the middle floor, there are a lot of stairs to go down. They also have a special exhibit regarding mummies which you get access to if you have the all access card. It was neat but not mind-blowing.<br><br>They have two restaurants, we went to the Bistro restaurant on the second floor. It was just OK and overpriced as expected but at least it's nice with the convenience. You can bring your own food but you have to eat it at the picnic area.<br><br>We will stop by the next time we're in town and see some of the other exhibits that we didn't get to see this time.", "pics": null}}, {"review": {"des": "I was fueled to put together this review after my most recent visit, which was while casting for the television show Proven Innocent. We just happened to have a scene with Kelsey Grammer being filmed at this site, which brought back memories of my initial visit. It has nearly been a decade since that initial visit to the Field Museum. Back then I considered myself a tourist visiting the city of Chicago, but now as a transplant from Honolulu Hawaii, I vow to make it back out to take in the viewings again. I was mostly intrigued by the exotic animals, ancient Egypt, and prehistoric exhibits featured. The Tyrannosaurus Rex, (Sue) instantly caught my eye upon entering which instantly provoked me to take a goofy selfie due to how it was presented in the museum. As of now, Sue has been moved, but will return sometime early in 2019 at \"The Griffin Halls of Evolving Planet. <br><br>The field museum is kid friendly! Perfect for field trips for students or tour groups. There are free dates that mostly fall on select Sunday's for Illinois residents. I recommend checking the website for those dates.<br><br>Getting to the museum, if you do not wish to drive that is ok because there is a Dvvy bike access, as well as Dvvy bike drop off. There is even the option for CTA train as well, but the walk to the museum is at least a mile from the train stop. Other alternatives are Lyft & Uber. As for parking it is $25 for up to 12 hours in the museum lot, but cars cannot be left overnight in the parking lot. To be quite honest I recommend catching the CTA train to CTA Roosevelt, and either Lyft, Uber, Dvvy, or walk to the museum. With that being said I hope this review assists you in anyway. <br><br>Thomas G", "pics": null}}, {"review": {"des": "Wonderful legendary museum right off of Lake Shore Drive with something for everyone. Mummies, Asian displays, jewels, Native American history, DNA exhibit - everything you could want. Gorgeously ornate design that is easy to navigate and well laid out for easy access for all. Highly recommended", "pics": null}}, {"review": {"des": "Great place to spend an interactive, educationally stimulating day. Museum was clean with well marked signs and a great friendly staff. A volunteer woman downstairs was posed a direction question and she laughed heartily exclaiming \"I don't know\".  Funny.<br><br>Exhibits were well organized with colorful posters, information and artifacts. This is a great family place as many exhibits are geared for youngins. Currently there is a fresh shipment of mummies and the largest intact t-rex \"Sue\" exhibit is being set up as I \"Yelp\".<br><br>The museum houses a massive collection and is only able to display 20% of artifacts. You will not be disappointed as everything was fascinating. Factoids you would never dream of create a sense of urgency regarding disappearing species and a poisoned mother earth.<br><br>Fee to enter was $38 which I felt was steep but it came with access to special exhibits and a 3D movie. There were 4/5 movies to choose from. Downstairs included a food venue but I did not enter. Many exhibits were paired with a corresponding gift shop. The gentleman working in the \"Sue\" gift shop was especially great as he provided useful information regarding local area. Overall great experience.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/44xx7431IPVlH0j46sTSUg/168s.jpg", "caption": "Man eater!!!"}]}}, {"review": {"des": "I can tell this museum used to be epic, but it is sadly in need of a re-fresh and re-do. General admission of approximately $24 pp gets you in to see all of their older exhibits, but the 4 newer exhibits were apparently an additional $16 each to see.  Pass on that.<br><br>We still enjoyed wandering around the older exhibits, but laughed out loud at the once pink, now gray flamingos in the bird exhibit.  Most of the birds in this exhibit were pale copies of what used to be colorful and vibrant. And they made a big deal out of the man-eating lions, but the actual exhibit was dark, and the poor lions were nearly hairless after all this time.<br><br>The dinosaur skeleton in the lobby, and mock-ups of prehistoric birds hanging from the ceiling, were actually the coolest part.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/W5k4A_r4M2VPSHdrwo1_mA/348s.jpg", "caption": "Cool ceiling decorations."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6NZL-ee-j8iS9lzZW3q3fg/168s.jpg", "caption": "Front entrance."}]}}, {"review": {"des": "This was probably our first big museum like this and was awesome. Huge place with tons of animals most of which I didn't even know excised. It was very impressive. Great for the entire family . We spend probably like two hours and we just paid for the regular entrance that is $23 they have a restaurant they sell some burgers  with no French fries. some paninis salad a little bit expensive but at least they have kids menu and that's what we ordered grill cheese cause was the only thing comes with fries . Anyway my favorite part was Grainger Hall of Gems  beautiful place for every women  . This museum is just like the movie Night of the museum actually parts of the movie was filmed there .", "pics": null}}, {"review": {"des": "I spent about 3-4 hours here.  I didn't have enough time to see everything there.  This was a large museum to say the least.  I think the main attraction is the dinosaur exhibit (the kids love this!).  They have multiple dinosaur skeletons and advertise that the room where they have these is 90% real artifacts.  One of the dinosaurs is \"Maximo\", the titanosaur.  A little dino info for you; Maximo is a sauropod, the largest class of dinosaurs.  In fact, Maximo is the largest dinosaur ever; how could you not like that?   <br><br>There is a wide variety of exhibits, not just dinosaurs so there is something to please everyone.<br><br>Last, military members get free entry.", "pics": null}}, {"review": {"des": "Although the field museum is best known for their wonderful collection of dinosaurs, there is so much more to see and do here.<br><br>Egyptian mummies and tombs, fantastic jewelry and jems, plants,  birds, mammals, take a trip to foreign lands, and learn about conservation are some of the many things that you will see and do here.<br><br>The museum is actually three levels, and you probably would need to spend a full day here in order to see everything. <br><br>My recommendation is to do one level per visit,  and come back several times during the year.<br><br>There are a few exhibits that seem dated, but the museum is constantly changing some of the exhibits so there's always something new to see each time that you come.<br><br>A couple of our favorite exhibits are the Hall of Dinosaurs, Inside Ancient Egypt,  and Underground Adventure (especially for the younger ones in your group)<br><br>Maximo the Titanosaur took the place of Sue the T-Rex in the main floor, but Sue can still be seen on the second floor, in fact, she is getting her own exhibit space that opens in March of 2019.<br><br>There are three different ticket options.  The all access pass, the Discovery Pass, and the basic admission pass. Do some research before you go to see which option would work the best for you.<br><br>Also check Groupon or City Pass or just Google for any discounts that are available.<br><br>If you're an Illinois resident, go on one of the many free days that are offered throughout the year.  This is for general admission only not for ticketed exhibitions or any of the 3D movies. Those are all additional costs, but still discounted.", "pics": null}}, {"review": {"des": "Excellent museum!!! It's been a while since I went to a music that I can enjoy and not waste my money on. I literally didn't finish visiting every spot in the museum. It's way too big. Price is great, and with student ID it's only $21 for general admission. I was a bit on time today so I didn't get the ticket with special show and feature. I still enjoyed A LOT! I got tired of walking because it's huge like I thought I was done with one exhibit, but it just keep going. I feel like you might need at least a whole day to finish every one of their exhibits. Will come back in the future to finish the exhibition.", "pics": null}}, {"review": {"des": "For sure, the COOLEST museum in Chicago. We did not have concrete plans to come and visit here, but people kept recommending it to us and they were all right. I only wish we would have had more than 2 hours, because that's all we had before the placed closed for the night. That was on us and we will never make this mistake again. I will plan to be here for 4 hours next time, because, yes, there is THAT much to explore.<br><br>So, if you're a fan of dinosaurs, they have Sue (the most complete and best preserved T-Rex fossil yet discovered). Love mummies? You're in the right place. Want to see the world's biodiversity up close and personal? Yes! Overall, the vast collection of specimens and artifacts is incredibly impressive. The information posted in each of the items is well-written, informative and the entire setup is constructed in a way that makes you understand what life was really like hundreds, thousands and millions of years ago. <br><br>By far, this was such an amazing experience and will be one of the best highlights of my first trip to Chicago. Can't wait to spend my ENTIRE day here next time!", "pics": null}}, {"review": {"des": "Really enjoyed my day at the museum- I haven't been to the Field Museum since Sue was first brought to the museum. I am a Chase Private Client and I can bring my self and up to 3 guests with me for free for general admission. <br>We spend about 4 hours in the museum and this gave us enough time to visit almost all the exhibits that are available in the general admission. <br><br>Will defiantly be returning!", "pics": null}}, {"review": {"des": "Such a cool museum included in our CityPass which also included a movie.  <br><br>There was so much to see you definitely need plenty of time with all the aisles and corridors branching off in every location with new things to look at.  It was really cool seeing all the animals and dinosaur bones, as well as the special exhibits like the mummies.  <br><br>The location is also really cool with the aquarium and planetarium all in the same area and nice green space in between.  You could definitely spend the whole day down there.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/spzB91rlaOn6NxoRCYARzg/348s.jpg", "caption": "Arctic dinosaurs!"}]}}, {"review": {"des": "Chicago resident or out of state visitor, this place should be on everyone's list. I am fairly new to Chicago and am submerging myself in Chicago landmarks and culture as much as I can. On the way over, our Uber driver told us that he's from Chicago and has lived here for over 30 years. He went on to say that the Field Museum is one of his favorite Chicago museums. Ended the conversation with saying not to bother with the Shedd Aquarium (old and quite sad), the Alder Planetarium (okay to see once), and 360 Chicago (underrated and less crowded than the Skydeck). Great advice.<br><br>There is SO MUCH to do at the Field Museum. We arrived around noon on a Saturday. Crowds to be expected, but it was bearable. This is a great place to bring your kids, but also a great place for adults. Each exhibition educates viewers on the nature and culture of our ecosystem back then, today, and in the future. Open in 1921, more than 40 million artifacts and counting have been collected in hopes to better understand and preserve this world. The exhibitions showcase dinosaur fossils, past civilizations and empires, mummies, gems, animals, a 3D theater, and so much more. It is a \"journey around the world\" for the whole family. My favorite exhibition is the Hall of Jade and the Hall of Birds. <br><br>Our visit lasted around four hours, touring three different levels. I would love to return on a free admission day!", "pics": null}}, {"review": {"des": "The African exhibit was quite moving. I couldn't take it. Saw the special mummy exhibit and they did a good job of describing what could not be seen. I didn't know mummys in Peru were a thing before those of Egypt. But now I know! I LOVED the meteorites/meteoroids and gem section. And of course the Dino was cute and huge. Surprisingly the food in the cafe wasn't half bad. I had a bottle of wine and fries and my friend had friend, soup and a coffee and it didn't taste like death warmed over. The special exhibits were $16 each (of which there were 4) which I felt was pricy for a room while one could spend around $28 for the entire place. I wouldn't go back as I have the Met and Natural History Museum in my backyard and kept comparing this to those but if one is in Chitown and wants to do a museum, I'd give it a go. Next time I'm going to check out the Art Institute as that may be more my speed. It I'm glad I did the Field Museum first. NB: parking is right next door so don't go too far", "pics": null}}, {"review": {"des": "What an amazing experience! Beautiful day, beautiful and impressive building!! Our only disappointment was that we only made it to 3 exhibitions due to timing.  Museum closed at 4:30m the day we were there and we made it to the museum around 1:30.  I know I have to go back, but the ones we did get to explore and enjoy were informative, beautiful on their own special way, very interesting and the Mummy exhibition was very impressive to say the least.  They have a nice café, shops, and the outdoors are very relaxing.  Must visit!", "pics": null}}, {"review": {"des": "Pros: Beautiful collection, tons of variety, very well displayed, highly recommend it! Great for children and adults. <br><br>Cons: Many of the exhibits cost extra. I wish they had audible self tours like other museum, to get a fuller experience.", "pics": null}}, {"review": {"des": "Closes 5PM on Fridays so had about 1.5 hours to go through everything. <br><br>Overall, preferred the other locations on the City Pass. This exhibit felt more directed towards families with small children. Definitely more colorful, interactive, and contained great tidbits of information that I'd read from an elementary school textbook.<br><br>American history - Enjoyed hearing one of the museum employees talk about the people who lived in Chicago before the city was built. I liked the life-sized replicas. <br><br>Asian history - Not large enough but enjoyed it. <br><br>Egyptian history - Enjoyed all of the information about their history and what every day life was like. This was something I would not find in a museum. <br><br>Dinosaur exhibit - Loved it. I enjoyed the massive skeletons more than the replicas.", "pics": null}}, {"review": {"des": "My friend really wanted to see the Field Museum so we ventured here on a Thursday. The admission line is long and be prepared to mingle with thousands of school kids, if you are going in the summer.<br><br>When we got in, we hit the African section first where here are many well done taxidermied animals. My favorite were the two man-eating Tsavo lions who terrorized Kenyans who were building a railroad and killed and ate 28 men. What a great and terrifying story.<br><br>The Egyptology wing was also large. You can walk through a tomb and there were many artifacts explaining ancient life in Egypt. <br><br>We stopped at the cafe which had local farm sourced food and it was better than most museum cafes. <br><br>I wish there were more to do at the museum. Although the exhibits were well done, it felt a little lacking since you had to pay extra for any special exhibitions on the third floor.", "pics": null}}, {"review": {"des": "So amazing! So many exhibits so little time! Make sure you leave a full day for this place. We had bought the city pass through Amazon so used that to get our entry tickets plus a special exhibit (Chinese exhibit). I saw so much and was so inspired today. By the end of the day both my feet and my brain were hurting. A lot of kids were throwing tantrums by the end of the day so I know I wasn't alone. You're allowed to bring outside food fyi (and eat it in the picnic area). Not sure how long this has been going on but Sue (the beloved largest carnivorous dinosaur discovered) is on vacay. Her new exhibit is being built and won't be ready till March 2019! So you will only be able to peep at her through a closed door.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jloc-dchxO-CTEYSixzzcg/348s.jpg", "caption": "Stuff of nightmares. Want to pet the cute deer? No! It is carnivorous."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dgKQzgggdFGvg3tfpgDq0g/168s.jpg", "caption": "Runaway Sue is on vacation. Friends are filling her spot."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/d-ILLTUnnuc1c9VrMyD2LQ/168s.jpg", "caption": "Hominid.. Going through evolution..."}]}}, {"review": {"des": "You really need a whole day to see everything here. This place is enormous! Interested in natural history? Chicago's Field Museum has you more than covered.<br><br>The main level is dedicated to animals and people groups of the world. I found the animal exhibits in particular to be very well done. There's a vast number of taxidermied animals, some over 100 years old and still looking very lifelike. I wish I could look this good at 100!<br><br>On the ground level (below the main level) is the 3D theater and exhibits for ancient Egypt, underground creatures and more. And the upper level has exhibits for gems, geology, plants, more people groups, and dinosaurs.<br><br>The dinosaur hall is arguably the museum's most popular. In 2000, the museum unveiled Sue, the best-preserved T. rex ever discovered. The museum paid a hefty $8.3 million for Sue, the highest amount ever paid for a dinosaur fossil. Sue used to be displayed prominently in the main level, but now it's locked away in a new exhibit that will open in 2019. We unfortunately were only able to glimpse it through a window.<br><br>We got free admission to the museum thanks to the Chase Private Client pass, but otherwise a basic adult ticket would've been $24. The all-access pass would've been $38, which covers all special exhibits and a 3D movie. We felt that there was a lot to see even without paying for the special exhibits, but I wouldn't mind ponying up for those if we had more time.", "pics": null}}, {"review": {"des": "I highly suggest visiting this museum as you can seriously spend the whole day here. There were two exhibits I could not see because you had to pay extra - the mummies and the chinese dynasties. I was extremely bummed out to find that out , but I the other exhibits were still more than enough. They have exhibits ranging from Ancient Americas, Evolution/Dinosaurs, Gems, Ancient Egypt, etc. <br><br>My favorite is the gem exhibit because of all of the concise information and the many different cuts of each gem they present. Many gem exhibits showed just the gem after being professionally cut, but this exhibit shows the raw form, the form as jewelry, and as a cut. Many of the gems were donated by a few people and it was amazing to see all of the beautiful forms, cuts, varieties all in one room. <br><br>The other exhibits were great with an abundance of information. Just bring a cup of coffee because my brain started to melt a bit after the first four hours. <br><br>You get a discount if you are a student FYI.", "pics": null}}, {"review": {"des": "Pretty cool museum!<br><br>Love seeing all the dinosaur bones, including Sue the dinosaur!<br><br>Tsavo Lions are here! Gotta watch the movie if you have a chance! <br><br>Very large museum!!! Great way to escape the heat and humidity in the summer. <br><br>P.S. Stay away from the cafe!", "pics": null}}, {"review": {"des": "Field museum = field trip central. We dropped in as admission was included with our City Pass. Exhibits were ok but they were setting up for a private function for the evening so there was that going on. Kind of ruined the experience but we weren't really feeling it anyway. Having been to the Art Institute of Chicago, it was all downhill from there for us. Looks like a great place for the kids.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JNpOSHOzowR1CInadlknSQ/348s.jpg", "caption": "More diamonds not for sale."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WyzWTQk-CSzJDqTOafDB9A/168s.jpg", "caption": "Egyptian exhibit"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ruyc88ETsbGYykagscVllg/168s.jpg", "caption": "Pterodactyl"}]}}, {"review": {"des": "So lucky we got in on IL Resident Free Day! Friends, check the dates on their website to take advantage! (<a href=\"/redir?url=https%3A%2F%2Fwww.fieldmuseum.org%2F&s=6990d0ba8c8b0fc34aeb6e42a85f648679a20a84a855606b58edb0ddb15fc1a4\" target=\"_blank\" rel=\"nofollow\">fieldmuseum.org</a>)<br>We absolutely enjoyed the museum! They have a great selection of exhibits, from everyone's favorite dinosaurs, ancient animals, and plants, to jade, emerald, astronomy, and the famous and one-and-only Egyptian temple! <br>Please allocate at least 3 hours at this giant playground, and there are usually big crowds no matter what time of the day it is.", "pics": null}}, {"review": {"des": "Went for a wedding and it was so cool! Only issue was a mouse ran across a railing upstairs. It was not big and did not freak me out but would freak someone!", "pics": null}}, {"review": {"des": "Came here with my mom and son-such a perfect outing!! <br><br>We arrived bright and early at 8:30am via paratransit early because my son is in a wheelchair and were greeted with open arms and let in early. <br><br>Every exhibit was accessible for my son, and there were elevators to get to every floor. (I did have to carry him up the stairs for the pyramid exhibit, but didn't mind).<br><br>Such an amazing experience and I'm so lucky we live close by because my son adores this place and we will be back time and time again for all the new exhibits and old favorites :)", "pics": null}}, {"review": {"des": "Parent warning: if you do not feel like reading, do not go to this museum.<br><br>There is a lot of good at this museum. However much to learn has to be done so by taking the time to read each and every plaque. I love the Field and do think it is valuable. It just seems like I go w people who do not have the time or inclination to do what it takes to become more learned from this museum. <br><br>My angle is that one should go w the intention of REALLY inventing and reading everything ONE  exhibit has to offer. You will not have stamina for more but will come home w little more smart. <br><br>It is pricey for a family to visit -$35 per person. I recommend going to the Chicago public library and checking out the museum passes for free. Do it over and over and learn about the world and time.", "pics": null}}, {"review": {"des": "Fantastic museum with plenty of exhibit for all tastes and ages.<br><br>We specifically came to see Sue but sadly she was being restored and reassembled near the main dinosaur exhibit however we did get to see her skull on the balcony and caught a glimpse of her new display which held part of the fossils. <br><br>Another attraction were the Tsavo Lions which were, even after 100 years, pretty impressively maintained. I felt just like Michael Douglas ready to be devoured. <br><br>We also enjoyed the Egyptian exhibit and the ancient Roman, Etruscan, Greek and other Mediterranean artifacts. <br><br>Very good commissary with some tasty Field Museum only beers which we both enjoyed. Nothing makes looking a stuffed penguins more fun then a slight buzz.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZZKwO2zL7qEHRi9CuURrRA/348s.jpg", "caption": "The one on the left ate Michael Douglas."}]}}, {"review": {"des": "Had high hopes for this museum after reading about it online. However, left a bit disappointed. Many of the exhibits were not included in basic entrance ticket, had to pay extra to see - major thumbs down for that, I counted about 3 exhibits that were like that. What annoyed me a bit was the fact that some items were taken out of the regular mummy exhibit to be put in the special mummy exhibit that required extra cost. Boo. Plus I disliked the basement level. It was stuffy without food air circulation. And it was dated. Otherwise, this museum is comparable to any other natural history museum. Also, Sue the T-Rex was not clearly on display while construction was happening for a new wing, we only caught a glimpse through the construction window holes", "pics": null}}, {"review": {"des": "My favorite museum. There's a free exhibit usually.<br><br>It's kind of annoying if there is an event at solider field because that's across the street<br><br>There are sooo many dinosaurs sprinkled throughout the museum. There are a lot of cool things to see but I'm never too impressed with the stuffed animal thing. My favorite thing to do is put money in this little plastic mold machine that makes u a toy dinosaur", "pics": null}}, {"review": {"des": "Time stays still here at the field museum.  I was so happy just to return and truly enjoy what Chicago has to offer.  My favorite part in the museum is going to the mummy  exhibits and learn how the Egyptians mummified their pets too.  I enjoyed looking at all those precious stones and gorgeous jewelry donated by so many people.<br> The jade exhibits too are very exquisite too.  I had such a wonderful time.  It brought me back to my childhood when we came in a tour with our school.", "pics": null}}, {"review": {"des": "The Field Museum is an excellent place to spend an educational afternoon.  The large facility is right in the museum campus down by the lake.  There is ample meter parking around if you are willing to take a short walk, otherwise there is $25 parking right near the museum.<br><br>The building is 3 stories and broken up into different wings.  This is all about animals, earth and evolution. Our son loves dinosaurs so we spent the bulk of the time in that area.  Sue, the large T-Rex skeleton, is amazing!  To see how big these beats were is quite shocking!  There are specimens for every era of earth and they are all well preserved.  There is also a fascinating gem exhibit that has some beautiful stones.<br><br>Staff was all very friendly and helped up navigate the exhibits.  The place takes a good 4 hours to walk at a brisk pace - there is plenty to see and do.  Admission is free for IL residents in Feb, otherwise around $25 for adults.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ztAnEeC_Psm7wZVF6C8hVA/348s.jpg", "caption": "Sue the T-Rex"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Gw1t8wkqup3bV0K1Jj7c7g/168s.jpg", "caption": "I would stay out of his way!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_XEM7Q383D3DOjkfi_-a5A/168s.jpg", "caption": "Ancient artifacts"}]}}, {"review": {"des": "The Field Museum is one of the best museums in Chicago! There is a lot of exhibits and you could spend hours going through the whole museum.<br><br>We had taken the taxi here from our hotel we were staying at. It was a very simple and easy to get to and the area around it was beautiful. On a nice day it would be nice to come and explore the area more.<br><br>All of the exhibits are super well done and very interesting! The dinosaur exhibit was awesome and truly worth coming to see. We spend over half the day just going around to all the exhibits. There is so much to learn here!<br><br>There is some food options here as well. The food was pretty good and filled you up so you could continue explore the rest of the museum!<br><br>Overall a fun place for both adults and kids. Worth coming here to see as both a tourist and if you are from the area.", "pics": null}}, {"review": {"des": "The Field Museum was absolutely amazing! For the price you pay, you get a lot of debits to choose from! There are also add ones you can purchase to see more, but if you are there for only one day, I wouldn't recommend it. You're already going to see a lot for the basic price!<br><br>I also believe that if you are a teacher in Chicago or a resident of the city, you get a discounted price! Totally worth going on a rainy day in the city!", "pics": null}}, {"review": {"des": "I'm disappointed by some of the displays and most of the museum is just taxidermy. The dinosaur displays were underwhelming and most of the exhibits need more inspiration.<br><br>Definitely not worth the $38 ticket, but I did enjoy being able to see the scientists/ anthropologist working in their lab. That's a neat idea.<br><br>They did what they could, they just need to spruce it up with a new attraction.", "pics": null}}, {"review": {"des": "This museum blew my expectations that I ended up spending my whole day here. And I'm quite happy with that :)<br><br>From the minute I walked in, I was surrounded by different hallways that lead to hundreds of exhibitions. I honestly didn't know where to start but I decided to dissect every nook and cranny starting from the Hall of Birds, then thru mammals and reptiles, and circle back to the main entrance by going thru the opposite side featuring more exhibits including rare artifacts from around the world and Ancient Americas. It took me about 3 hours just to complete the 1st floor and there were 2 more floors to explore. Wow!<br><br>Upstairs, they have several dinosaur exhibits including the famous T-Rex, Sue. The 2nd floor also has an extensive exhibition of Asian countries including my homeland, Philippines. Yay!<br><br>After another 3 hours passed, I finally made it to the underground level. Thank god it was not as much as the 1st and 2nd level. Mostly theaters plus Ancient Egypt and a pretty cool interactive exhibition called \"Underground Adventure\" which features magnified installations of species living in the soil beneath us.<br><br>The ground level was also the passageway to the limited time \"Jurassic World\" show but I found out it wasn't included in the City Pass when I got in line. It was disappointing but this massive complex had more than enough stuff for me to explore so it's all good. I really enjoyed my visit here and highly recommend to family and friends. Just make sure you have enough time.", "pics": null}}, {"review": {"des": "This museum was suggested by someone else. It was pretty good but I feel like they can do more to be even more interactive. It works for older crowds but may be a bit boring for our younger friends :)<br><br>There are lots of sections to explore and the museum itself is larger than I expected. One thing I didn't like was a separate fee for certain exhibits- which are probably the really good exhibits- when ticket prices aren't cheap. <br><br>Overall there are tons of things to see and read about and again, asan older adult- a lot of this can be found enjoyable and entertaining.", "pics": null}}, {"review": {"des": "This is one of the best museums in the world. Saw it as a kid when we lived in Chicago at ages 2,3 & 4 and remembered it all these years. Can't be seen thoroughly in one day. They had a super Chinese show going. Fascinating. Enjoyed one of the 3 shows available the day we were there. If I lived in Chicago I would have a pass to go back frequently. You can't do it justice in one day. The only other museum I've been to in the US in last few years that stands out as well is in Houston.", "pics": null}}, {"review": {"des": "This museum is AWESOME! If you are a tourist, I highly recommend getting the Chicago City Pass because it is definitely worth it. The city pass field museum admission comes with all the special exhibits and a 3d movie. If you do not have a city pass I recommend getting the all access ticket! <br><br>We came on a Monday to try to avoid some weekend crowds. The line was short when we got there. My mom and I spent seven hours in the museum in all the exhibits!! There is so much to see. My personal favorites is the big evolution exhibit and the mummies. The museum food is okay as well, and is worth it so you don't have to leave and can continue exploring!", "pics": null}}, {"review": {"des": "I love it here! This is one of my most favorite natural history museums ever. We are locals, so we don't visit as much as I would like, but we do take advantage of the \"Chicago resident\" days every so often.<br><br>This is a large museum, in order to really see all of it, it's a solid 6 hour commitment. The halls and displays are really easy to navigate, but I think it's important that people come in with a plan - especially people with children. <br><br>We recently bought tickets for the Jurassic World exhibit. 25.00 a pop. Eek. Well, to say the least I was unimpressed. I was hoping for a actual dinosaur science, not movie \"life will find a way science\". Chris Pratt was also not part of the deal <br><br>The animatronics were great. The staff was awesome. The velocoraptor presentation was my favorite (beware of the jump scare). But again, I was looking for more actual science, especially since I heard a rumor that Sue is leaving the Field.", "pics": null}}, {"review": {"des": "This was the fifth time I've been to the Field Museum, and I never tire of it. It is my favorite museum that I have ever been to and I will keep returning to explore and discover new things. This museum is home to over 24,000,000 pieces and it is almost impossible to take in everything in one visit. I am happy to say they have updated the museum and added new exhibits since my last visit 10 months ago. That is always a breath of fresh air. Sue has been moved to a new exhibit and it won't be finished until the end of the year. Be weary of that if you love Sue as much as my wife and I do. The Mummies exhibit is worth the extra money, but I don't really think any of the other exhibits that cost extra are worth it. I would recommend just paying the regular price of admission.", "pics": null}}, {"review": {"des": "3 1/3 stats. I wish I had a glowing review for The Field Museum. The whole purpose of my trip to Chicago was to see the Jurassic Park Exhibit, which I enjoyed quite a bit, but it was very short. And you cant really take your time, once you did a section, you cannot come back.<br>The museum itself. Unfortunately, because we spent the morning at the Planetarium, which I regret, I wasn't able to spend near as much time in the museum as I would have liked. We did get to see Egypt, but a lot of the mummies were lent out to a traveling exhibit, (MUMMIES) which I happen to catch up to at The Met in NYC a month later. <br>I did see a little bot in the China exhibit which was an add on and not part of the regular admission fee. <br><br>I did enjoyed what I saw, but I wish I'd seen more.<br>My advice would be to give yourself plenty of time.", "pics": null}}, {"review": {"des": "Oh gosh I had been wanting to visit The Field Museum for years and I finally got to do so recently! While we only had around 3 hours in the exhibits in total (darn flight delays) before heading off to other commitments that day, I truly appreciated the time we had. The building is huge and beautiful (gotta love good architecture!) and we made it through the line up to buy tickets relatively efficiently (I went to drop off our luggage/jackets at the coat check while my travel companion saved our place in line). Then we went to visit Carl Akeley's elephants!! I was so excited to see this taxidermy that I had seen celebrated so much on the YouTube channel The Brain Scoop!! <br><br>We then checked out the Specimens exhibit, followed by a number of North American exhibits and Sue the T-rex before checking out a 3D movie (alas we were tired from the Red Eye flight we took to get to Chicago and 3D movies aren't great for that). The theatre for the 3D movie was pretty nice from an architectural standpoint but I was glad that we sat close to the front as the screen was pretty small compared to more modern facilities. No complaints here, though as it was a great experience! We then checked out the Underground exhibit and Egypt exhibit followed by the beautiful dioramas of taxidermied animals from different areas of the world.<br><br>I was admittedly the most excited to see the striped hyena exhibit that I had helped crowdfund a few years back. It's crazy to think that this diorama was the first new diorama in 60 years. It is beautiful to see it in person though! <br><br>As we still had some time, we also looked at a China exhibit and checked out the gift shop (buying a few postcards and other items for people back home) before heading off for the rest of our day. I like the fact that there is a convenient taxi/ride/etc. pick up/drop off area by the south entrance of the facility. I also appreciated the tent in the entrance area because my goodness it was a cold day when we visited! The main atrium can get a bit drafty given the huge height of the ceilings. I think it must be hard to heat/climate control a building the size of The Field Museum! <br><br>I want to return here someday and see more. I loved what I did see while I visited however.", "pics": null}}, {"review": {"des": "I wish I had more time since my group arrived late.  We were told this was one of the biggest museum nationwide!  With only 1.5 hour to spend, it was not enough time.  I literally rushed each exhibit so I didn't enjoy the experience as much.  As always, my favorite part of any Natural History museum would be dinosaurs.  They definitely have a large variety of dinosaur bones preserved compared to other museums I have been to.  The room itself was huge and I was so amazed by how big these creatures were!  The museum was known for the infamous T-Rex Sue, but unfortunately, they decided to move her to her own exhibit so her bones were taken part when I arrived.  I would recommend this museum to any out of state travelers. It's definitely very educational and make sure you arrive early to spend more time!", "pics": null}}, {"review": {"des": "This place isn't as fun as I remember from my youth. Maybe it's because I was blissfully aware of the fact that all the fun exhibits are an extra cost on top of an already $22-$36 a ticket. Pro-tip: if you are on food stamps/EBT/WIC admission is $3. <br><br>I mean, there's some cool stuff. The Egypt exhibit has always been my favorite, and my most recent visit confirmed that that hasn't changed. I was a bit bummed to see so many Egyptian artifacts were missing from their cases, on loan to other museums. I'm glad other people get to see them, but I want to see them too!<br><br>I do appreciate that you can bring your own food to eat, and that they do free days for Illinois residents (but be warned these days are insaaaaaaaane). <br><br>On the bright side though, my most recent visit I got engaged, so in addition to lingering childhood nostalgia, this place will always have a special place in my heart. <br><br>It's fun for kids and it's worth visiting once, but if you're from the area it might not live up to how you remember it.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HLNiVa8GYNOZsdOPJqvYpQ/168s.jpg", "caption": "Lions"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Lk6khW3ycBTLc0A00cU0sw/168s.jpg", "caption": "Lots of stuff empty/on loan in Egypt"}]}}, {"review": {"des": "I was in Chicago for a few days of vacation and sight seeing, and was already at Shedds for a morning of touring.  The main entrance is georgeous, but jam packed with people in line. I came in through the side East Entrance facing shedds, and the line was literally nothing! (the main entrance was jam packed with a line a mile long.)<br><br>After I gave the attendant my City pass, I was also given a map along with an upgraded experience of the goings on at the museum.  There's three floors of stuff to do, and by entering at the East Entrance, I was able to start on the ground floor.  The ground floor was probably the smallest of the three, and I spent most of my time viewing the Egypt exhibit. There's also a lot of childrens activities on this floor, which is great if you are there with younger ones.<br><br>I eventually worked my way up to the Second floor which was amazing!  I tried to hit most of the displays but mostly focused on the ancient Americas and just about everything else. <br><br>As I got up to the third floor, I was totally exhausted! I spent a lot of time up there, and took a rest on a bench by the dinosaur exhibit.  The whole third floor was amazing.<br><br>Also, spend some time in the very large and beautiful lobby if you can.  Ginormous elephants with coat check and an information desk to boot.  They have benches throughout the facility if you need to take breaks like I did, and a diner to grab some food as well (which I did after walking off my breakfast halfway through the tour.)  Make sure to bring good walking shoes, a charged phone and a few extra bucks to check your coat. You will work up a little sweat with all the walking involved here, so take extra precautions!<br><br>I would go back to tour it again since I was a bit run down after shedds, but this place is worth the visit. Also, you can take the bus here and get dropped off right in front, which i strongly recommend since parking is very expensive here in the city.  If you have the energy, I recommend doing it along with shedds since they are on the same campus.", "pics": null}}, {"review": {"des": "I could have easily gotten lost in this museum with all of its different galleries and stories each of the exhibits told. From being transported to prehistoric times, to different continents and their cultures and exploring plants, rocks, fossils and embalmed animals  this was another museum well worth every penny. <br>This museum is another one that is good for people of all ages, out of all the museums we visited in Chicago this was my 6 year olds favorite. There are so many visuals and every now and then there comes a time where they offer hands on experiences for kids throughout this ginormous museum. Definitely a must when visiting the Windy City.", "pics": null}}, {"review": {"des": "I brought my 3 year old son to the Field Museum on Sunday and he was wearing his black jacket and  stroller and when we arrived, we parked the stroller with jacket at the Field museum's Crown family playlab designated stroller parking area. Sadly when we returned, both the stroller and his jacket were stolen and it was very cold outside so without a jacket, we had to wrap our son in dad's jacket and carried him back to the car today. The jacket and stroller were his favorite so it's sad that someone at the Field Museum would steal another families belongings. Needless to say, please do not leave your stroller in the designated stroller areas or beware, they just might not be there when you return!", "pics": null}}, {"review": {"des": "It's hard for me to judge The Field Museum. It's a classic staple which I'd almost deem a requirement for anyone to go visit at some point in their lives. However, compared to some of the other local museums and attractions, this place is certainly a bit outdated. <br><br>A majority of the exhibits consist of stuffed animals and ancient artifacts. One of my favorite exhibits being Ancient Egypt and the tomb. Besides a few unique exhibits and the 3D experiences, there isn't much to do besides pace the halls and read, which can be daunting after an hour or two. During our visit, Sue the dinosaur was disassembled and being relocated upstairs. It's a shame that one of the main attractions was under construction. And the dining area(s) are certainly limited.<br><br>There are major plans in the works to improve this museum. In the near future, there will be plenty of new attractions to see. In the mean time, this type of museum takes persistence and patients to walk through. If you have anxious children, this might not be the place for you.", "pics": null}}, {"review": {"des": "This Museum, located in Chicago, Illinois, is for the Nerds who love Science, History & Taxidermy.<br><br>I was a recent visitor here in May, 2017 with my Son & his girlfriend. We only wanted to spend a couple or few hours here, which is completely doable, but I'd warn it's a rather pricey museum to not spend the whole day. <br><br>My favorite exhibit was a temporary exhibit now gone, called, \"Tattoo\". It entailed real tattoos depicted on glass-enclosed torsos; fascinating, beautiful & sometimes frightening. Interesting prison tattoos, meanings of these & other tattoos more horrifying, due to the nature of them being applied as punishment. We found ourselves completely mesmerized by the film, as well. <br><br>I also really enjoyed the permanent exhibit of \"Ancient Egypt\", which had real mummies, in & out of coffins, some wrapped & some unwrapped, child mummies, pet mummies, too. The mummies were sometimes sad, due to the nature of them. Make sure you descend the pyramid circle staircase, which directly delivers you into the tomb. Fascinating!<br><br>The entrance price is only general admission & doesn't include any extra exhibits, such as the popular permanent interactive dinosaur exhibit. <br><br>I don't recommend this museum for toddlers & younger babes. Unless they are acclimated to being around adults most of the time (read: sophisticated), I think they would find the museum boring. <br><br>PRO TIPS: <br>$28 Per Person<br>$22 Parking<br>Free for Military<br>Senior discount<br>Student discount<br>Free Admission Days for Illinois residents<br>   with valid proof of residency -Check <br>    online before you go<br>Cafeteria-type Dining is pricey <br><br>It's a must-do when visiting Chicago, as The City of Chicago has some of the finest museums.<br><br>60/100", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AIBu-HaL41rgn7kaFKkseg/168s.jpg", "caption": "Entrance"}]}}, {"review": {"des": "The only extra curricular activity we wanted to do while visiting family was the Field Museum. My daughter has been asking to see dinosaur bones for more than a year. If I lived here I would easily buy a membership. We absolutely loved it. The exhibits were phenomenal. Staff knowledgeable. Facilities very clean. Such a pleasurable experience. I can't wait until the Sue exhibit is complete.", "pics": null}}, {"review": {"des": "This was the BIGGEST museum i ever been to in life!! We walked around for hours & still didnt see everything!! We didnt know which way to go lol Theres sooooo much too see!! Every exhibit was done really well, i learned ALOT!!", "pics": null}}, {"review": {"des": "Came in for a quick look around, and only had time to engage in the Egyptian exhibit.  I was fascinated by the quality and age of the artifacts.  I wish I had more time to wander and mentally get lost in the overall trappings of the museum.  From what I saw, this is a good museum and worth several hours of your time.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RB--F84wATsNz9WqfLxfNA/168s.jpg", "caption": "Tribesman hunt a lion, I totally dug this depiction, I could feel the tension."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/52uLrs-1bKw3o9Qzv67zKg/168s.jpg", "caption": "Bushman is now a Field Museum exhibit. He was the first ape in Chicago, before his death in 1951 he lived in the Lincoln Park Zoo."}]}}, {"review": {"des": "My friend and I were in Chicago for a day trip and decided to check out the field museum. The prices were reasonably priced. We both had our college IDs with us, so tickets were $16 each for general admission. I think the only exhibit we needed a special ticket was for the China exhibit. <br>There's a lottttttt of museum per exhibit. It's very detailed and there are some museum workers in certain parts to interact with people. We mainly checked out the Jurassic park exhibit, Egyptian exhibit, and the prehistoric americas. There were quite of few times we got lost through the exhibits and navigating to the next ones. There were also quite a few staircases that were staff only and we kept running into those.", "pics": null}}, {"review": {"des": "Have kids and want to educate them about some science and history.  This is not a bad place to go.  Make an afternoon of it with them.<br><br>But if your just visiting from out of town as adults...MMmm, not sure you're going to enjoy this so much.  The exhibits are as expected.  The 3D movies are kinda fun.<br><br>For me, I like things in motion.  So the Shedd Aquarium and Planterium are a little more my style.", "pics": null}}, {"review": {"des": "If you know me, you know that I am an avid dinosaur nerd since I was a little boy. And I still am to this day. So when I discovered that the Field Museum would be hosting a Jurassic World exhibit, I made sure to schedule a family vacation to go see it. That's right, I'm willing to drive 5+ hours to see some animatronic dinosaurs.<br><br>Aside from the special exhibit, the Field Museum is a gem in the city of Chicago. There is sooooo much to see and do here. My wife can't stand when we go, not because she hates history (she just dislikes it) but because I love to read all the tiny tidbits of information that an be found here.<br><br>Some of my favorite places in this place would be the dinosaur exhibit and the taxidermy animal exhibits. This is the home place of Sue the T-Rex (if you know Dinosaurs, you know what I'm talking about). Basically, Sue is the most complete T-Rex to be found in America. The Field is also home to the Lions of Tsavo. Yes, those are the same man-eating lions that the Val Kilmer film Ghost in the Darkness was based on. Super creepy to stand eye to eye with them and look them right in the eye and know what they had done...spooky.<br><br>Last but not least, how many of you have seen the movie The Relic? It is kinda like Aliens meets Jurassic Park. This film was shot here at the museum. I can tell you that this place would be super creepy at night with the lights off. Watch that movie and then walk the museum, it is fun to see elements from the film in \"reel\" life! Ha.<br><br>This place is a great place to spend a whole day (or two!) and will have plenty to entertain the kids and adults alike. This is definitely a stop in Chicago and usually can be paired with a city pass for a nice discount. Be forewarned though, there is a lot to be seen and you will not see it all in one day.", "pics": null}}, {"review": {"des": "It was ok. I thought it was kinda boring. Kinda see the same things over and over. The building itself is beautiful.  Came because I read all the good reviews about this place. I guess this museum was not my kind of museum.", "pics": null}}, {"review": {"des": "I loved the field museum. We got the tickets with the city pass and had to make our way there. It was so damn BIG we didn't get to see everything but I most enjoyed the African American exhibit.", "pics": null}}, {"review": {"des": "This was a bucket list, must-see for me while in Chicago. I have been waiting for years to see the Tsavo lions in person. None of us realized just how big the field museum was. We ended up spending the whole day there and saw about 1/3 of the museum. The Tsavo lions were amazing to see as well as the millions of other animals they had in their collection. The rock and mineral hall was absolutely amazing as well as the Egyptian and Dinosaur exhibits. I wish I had more time to enjoy this world class museum, Aloha", "pics": null}}, {"review": {"des": "The Field Museum may be one of the most expensive historical museums you'll visit. The good news is that the mix of informative and interesting exhibits alongside dated and corny ones offers some history and whatnot for just about everyone.<br><br>Thing I really liked:<br> * Re-thinking the \"man-killer\" Lions of Tsavo<br> * Exploring the tomb of Unis-ankh & Egyptian mummies and artifacts<br> * Special exibits like the Chinese Qin Dynasty terracotta warriors<br><br>Dislikes:<br> * Separate additional charges for so many exhibits<br> * This museum LOVES taxidermy. I find it creepy and old.<br> * The bug animatronics of the Underground Adventure<br><br>Tips:<br> * Basic admission: $24/adult; $17/child; $21/students-seniors<br> * Full admission: $38/adult; $27/child; $33/students-seniors<br> * That's $136 for a family of four ... sigh<br> * Illinois residents can enjoy \"free days\"<br> * Discounts available for groups of 15 or more<br> * Open daily 9:00a - 5:00p except Christmas<br> * Parking is $20 for 4 hours or $25 for 12 hours<br> * Museum Highlight Tour is daily at 11:00a<br> * Pawnee Earth Lodge open house is various times daily<br> * The Field Bistro has \"gourmet\" food ... and a bar!<br> * The Explorer Cafe has salads, pizzas, sandwiches, & burgers<br> * The Field Museum was founded in 1893 as part of the World's Columbian Exposition.<br> * It's original name was the Columbian Museum of Chicago.<br> * The official title now is the Field Museum of Natural History<br> * The current location opened in 1921 in Grant Park.<br> * The Museum has more than 25 million natural objects & <br>man-made artifacts<br>* The collections spans four disciplines: anthropology, botany geology & zoology.<br> * Over 1.5 million people visit the museum each year.<br><br>Whether you come to see stuffed baboons, bengal tigers, or giant pandas or come to look up at the skeleton of \"Sue\" the male Tyrannosaurus Rex, the pricey tickets to the Field Museum offers Chicago tourists and Chicagoans alike a mix of informative cool modern displays with archaic outdated exhibits.", "pics": null}}, {"review": {"des": "Holy giant museum!! This place is seemingly endless. With multiple floors, multiple rooms on every floor, and tons of exhibits in every room this place takes several hours to get through. Be sure to grab a map on your way in so that you know you hit everything. We had to use a pen and literally mark an x on every room we had seen just to be sure we were seeing at all.<br><br>Parking is public parking that's a little bit of a ways away so you'll want to wear comfortable shoes for plenty of walking around. However, on the upside there are several things to see and do in this immediate area so once you're parked it's pretty easy to walk to all of it. <br><br>The museum itself has tons of exhibits ranging from Egyptian artifacts to animal skeletons from prehistoric times. There really is something for everyone here and all age groups would enjoy coming. We had a City Pass for Chicago that included this Museum which really helped out on both cost and having to wait in line to buy tickets. There is an express pass line for those who have City passes so be sure to look out for the signage and not wait in the general admission.<br><br>Overall: A<br>Wright Museum with plenty to see and do for all ages! I highly recommend that you check this out when in the Chicago area.", "pics": null}}, {"review": {"des": "The Field Museum is a overwhelmingly massive museum, filled with many wonderful fascinating exhibits. It is great for kids and adults who love to learn! <br>The Field feels similar to Museum of Natural History in NYC. I spent 6 hours here and still didn't see everything! You should pick the exhibits you want to go to and plan on coming back. <br><br>Some of the best permanent exhibits were Inside Ancient Egypt, Sue the T-Rex, Hall of Jades and the whole taxidermy area (Hall of Birds, Mammals of the World, Asia, and Africa). I also loved the Hall of Gems and the Tibet exhibit.<br><br>Inside Ancient Egypt showed me looted tombs, mummies, the King's boat and described the Egyptian market and trading system. It was so cool to see the old cat mummies! <br><br>Sue, the T-Rex is named after the person that discovered her. This ferocious dinosaur is massive and majestically terrifying. You can view Sue from two floors! Her real head is on the 2nd floor. I appreciated that the archeologists found and informed us that Sue had broken several ribs with different stages of healing. <br><br>Hall of Jades is beautiful, filled with nephrite and jadeite. It is filled with beautiful shades of greens, pale greys, and white jades. There is such much jade: used as tools, jewelry, urns, incense burners, and shades. You get to see the desk screens that scholars used to block light so they could protect their work from too much sunlight.  <br><br>I just love looking at animals and half of the main floor is filled with stuffed mammals, birds and reptiles. I didn't get a chance to view the reptiles but the mammals were placed in these wonderful dioramas. The mammals were posed in various interactions, as if you caught them drinking water or foraging while you were exploring in Alaska, Africa or Florida. I could have spent an extra hour here.<br><br>The Hall of Gems was short and gorgeous. Beautiful precious stones cut into jewelry. My favorite was the luminescent black Tahitian pearls, the massive blazing Topaz called Blaze, and the gorgeous blue, green and white opals. <br><br>The Tibet exhibit featured a prayer window on the ceiling and a golden Buddhist statue. They were very peaceful to look at. <br><br>If you buy a CityPass, your admission includes a 3D movie and both special exhibits. I chose the Mysteries of China. It was pretty good. I liked learning that the Emperor Qin Shi Huang (the emperor who buried all the Terracotta warriors) was searching for everlasting life. Then he took balls of mercury, which was what eventually killed him. Also that the Xian terracotta warriors were an accidental finding by peasants and not documented in the Chinese history prior to 1974.<br><br>The special exhibits that were offered were Cyrus Tang Hall of China, Tattoo, and Specimens. You have to see the exhibits before 4:30pm or you won't be let in. The two exhibits worth seeing was the Hall of China and Tattoo. <br><br>Hall of China went through the history of China, artifacts, the periods under different rules and ages of enlightenment and religion. This was an impressive and very informative exhibit. <br><br>Tattoos showcased photographs, videos, paintings and sketches of tattoo. Voluntary, involuntary tattoos; religious and jail tattoos. Some tattoos were beautiful pieces of art, others symbols of death and violence. It was very picturesque. <br><br>I would definitely come back and if I lived in the area, I would be a frequent visitor!", "pics": null}}, {"review": {"des": "The Field Museum is a legendary place. Far too much to see in just one day. Come early and well-fed, and stay until closing. Regardless your level of interest in natural history prior to arrival, you will find something to love here. The galleries are amazing with impressive collections of artifacts.", "pics": null}}, {"review": {"des": "<a href=\"/redir?url=http%3A%2F%2FAb.so&s=4167b03e5854142baee99155924055b1c7c730f96b4b6f294dbadaeec5d8eb84\" target=\"_blank\" rel=\"nofollow\">Ab.so</a>.lutely Uhmaze-a-balls. If you can't find something to enjoy at the Field Museum, we cannot be friends. Seriously! What is not to love about the natural history and special exhibits at the Field? Tell me! (I'm waiting....)<br><br>It's a great escape during the winter months, but I like visiting all year round. Get the City Pass from a Chicago Public Library and you'll save. If you're a tourist, make this part of your Chicago experience. <br><br>So, Sue is no longer a part of the Great Hall, but the Field is still a world class natural history museum. Ample parking in the lot across the street, or Uber/Lyft, it there. Simply Amazing.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qKaAlbY45QlScxEjbuXorw/348s.jpg", "caption": "run for it! (RIP Sue)"}]}}, {"review": {"des": "It was just an okay museum for us. We were more bored than anything. The main reason we wanted to visit was 'cause of the huge T-Rex but that was right in front as you enter and because we had the CityPass. We only stayed for an hour and a bit. If you have the CityPass, you get to watch one free show and you still have to line up to get your tickets. There wasn't much of a line. Most of exhibits were included in our tickets except for Jurassic World, which you had to pay separate for. <br><br>Don't get me wrong, there were some really interesting stuff to read and see. After visiting the museum, I would probably only recommend this to people who love history about all over the world.", "pics": null}}, {"review": {"des": "5 Stars for a practically private experience at this famous museum! (Tips below!)<br><br>So, I've read the previous reviews that mention the crowds, but I have a solution! Do what I did and arrive right when they open on a week day. There was no line whatsoever and I felt like I was in a Night if the Museum movie while walking around the taxidermy old-school museum exhibits featuring all the posed animals. It was soooo cool! An hour later there were many more school groups, but by that time I'd had a solid hour to enjoy a very light crowd! <br><br>Besides that, I had a blast checking out the many exhibits and, though I could have spent many more hours there, I was able to enjoy two hours and not feel like I missed out. My favorite exhibits were the taxidermy African animals section, the ancient Egypt tomb, and the exhibit on the Americas which featured voices from all across Latin America.<br><br>There's parking in a garage across the street, but uber/Lyft is easy as there is a pick-up loop right outside at the bottom of the steps. <br><br>I hear they're about to make some changes (including moving Sue!) and I can't wait to return to check them out!", "pics": null}}, {"review": {"des": "We got in for free because we are members of our state museum. Woo hoo! I would have totally paid to visit The Field Museum, but free always beats paying. (If you're wondering how to get in free, too: You have to have a membership to a museum that is listed with the Association of Science - Technology Centers. Then you can visit any museum on that list, as long as it is located 90 miles away from you. The Field Museum was more than 90 miles away from us, so ...)<br><br>There is a richness and sense of history at this museum. My husband remembers visiting the bird exhibit more than 15 years ago, and it is pretty much the same as he remembers. They like to preserve the nice things that they have, but they also offer new and ever-changing exhibits to keep things fresh.<br><br>Typography aficionados will enjoy all of the hand-lettered signs and old-school fonts that are throughout the exhibits. This is especially true in the birds and animals exhibits. They feel like something out of a Wes Anderson film. <br><br>We brought kids on this visit, so we didn't get to absorb all of the information that was provided throughout the exhibits (you know how kids are -- running and touching one thing to the next). I would love to just spend a couple of hours in the dinosaur exhibit and learn about all of the different mass extinctions (I didn't know there have been so many!). <br><br>We were here for about three hours but it didn't feel like nearly enough time to see everything. We will definitely be back!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FD4JEvOQqCb39bJTVSzSkg/348s.jpg", "caption": "Kids area"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3TmmibG0MUhmwVdZiuYebA/168s.jpg", "caption": "Kids area"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iXJ7fNpgei8hFaRHK_anBQ/168s.jpg", "caption": "Kids area"}]}}, {"review": {"des": "Personally, I love this museum. There's  so much to see and learn. We had a good time walking around and exploring the different exhibits. We used the Explorer City Pass and it included the tickets for the exhibits you need to pay for. We chose the Underground. If I had to pay for it, I would've been upset, but it was cool! We enjoyed the animal section a lot. The mineral exhibit is cool too.", "pics": null}}, {"review": {"des": "Pretty awesome. A fun day trip. Beware of the extra exhibits. This will drive up the costs. Easy to find.  Great all around experience.", "pics": null}}, {"review": {"des": "I have been to the Field Museum for private events several times now. Museum campus in general is beautiful and I would definitely suggest for tourists as well as Native Chicagoans to check it out.<br><br>My most recent trip to The Field Museum was for a wedding. What a gorgeous location!!!! Cocktail hour was at the terrace in the back and the reception was held in the main room. It was so fun to see the dinosaurs and exhibits after dark. I highly recommend.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PGGp3uXDAORiiIVkH-IRQw/348s.jpg", "caption": "Attending wedding at The Field Museum"}]}}, {"review": {"des": "Once upon a time amid this girl called Sue. She was tall and had great bone structure. I could not get her out of my mind because she was so elegant.<br><br>Ambience The museum is big with a lot of space for all the individual exhibits. It is a bit dated but part of the charm when you see artifacts from prehistoric times. The Dinosaur exhibit didn't disappoint. I always love going through the ancient Egyptian exhibit.<br><br>Staff most of the staff at the Museum are always quick to give suggestions and great at pointing you in the right direction.<br><br>Food/Exhibits  I didn't eat anything at the museum but I had a great time walking around seeing that ancient artifacts looking at all of this animals the reptile exhibits.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7B_Jj-RNCshH3Fz3seo2gA/348s.jpg", "caption": "True love"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/X6KLVsZcsO7pEE83bhF11g/168s.jpg", "caption": "Jade"}]}}, {"review": {"des": "The quality of the exhibits here are very good! They do have a lot of exhibits but most of them didn't really interest me. We did absolutely love the Egypt exhibit, the dinosaurs, and the traveling mummy exhibit. The 3D show \"Museum Alive\" was cute and very well made. The bathrooms were immaculately clean. What made me rate only three stars was how extremely expensive everything in the museum was and how quickly we got through the entire museum.", "pics": null}}, {"review": {"des": "You gotta see Sue.<br><br>The Field Museum is an amazing place where you can spend hours. I went back and forth and re-visited exhibits multiple times.<br><br>At the front and center of it all is Sue (I went back in May of last year). The world's largest, intact T-Rex fossil. I highly suggest reading about her discovery and how she landed at the Field - the story is quite amazing.<br><br>My ticket was from CityPass so I got access to all the exhibits plus a show. That may be the only downfall of the place - you have to pay extra for every little thing. Which is sad, because that can be off-putting but this is a place worth seeing. <br><br>Overall, an amazing experience.", "pics": null}}, {"review": {"des": "Wow. So boring.<br><br>There's apparently two entrances. The North side with no where to stand. Which is where we entered because it looked like a main entrance.<br><br>Then there's a South entrance which you see after you walk in. They actually let you inside to wait in line and you're not burning up and sweating in the foyer on the North side.<br><br>Don't bother buying online. You still have to wait forever in the line for \"will call\" which is not at all a separate line. <br><br>Do not waste money on Jurassic World unless you like watching cheesy videos and being able to see the people's legs wearing velociraptor costumes. <br><br>I would have rated less stars, but it had some interesting things. Not worth the money .", "pics": null}}, {"review": {"des": "I went to Chicago for business, had some free time in my schedule and wanted to go to the Field Museum. I have always wanted to visit this museum ever since Sue made her debut. Sue is the largest Trex fossil ever found and to see her in person was awesome! We went to the museum with not that much time left till they closed. But, it was perfect timing, not too busy. The only thing I knew about the museum was they had Sue there, but not familiar with anything else. When I first walked in I did not know Sue was right there in the middle, so naturally I ran to her. It was amazing to see her in person, really a childhood dream come true. I did spend a lot time at this one exhibit and headed upstairs to see Sue's skull. The exhibit with Sue overall was amazing! I did have time to walk around some the rest of the museum and, if you are a dinosaur lover, there are quite a few. I wish I had more time to explore other exhibits, but I ran out of time. The museum was a lot larger then I thought, and you could easily spend a couple hours in the there. If I am ever back in Chicago, I will be going back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PnV_QBcemfNTbDx0W-0wsg/348s.jpg", "caption": "She is beautiful!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ys6CuYNRmq3dmzeOz96xqw/168s.jpg", "caption": "Sue's skull"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4JuQ4W0VdfZCshwE5pHRgg/168s.jpg", "caption": "Sue and the entrance to the museum."}]}}, {"review": {"des": "Excellent museum! Huge but everything is so interesting. Lots of benches and seats scattered around, so it's easy to take a little break while exploring. Great information, and the exhibits are well done. However beware of the cafe- we bought a banana that ended up being $2! I would highly recommend this museum.", "pics": null}}, {"review": {"des": "My husband really wanted to see the Field Museum so we went. He read on the website about a basic no-drills rate that was only advertised on the website. It saved us about $10/ticket at the box office even though the rate is NOT advertised anywhere at the museum. Basically it was for the full museum minus a 3D movie and the Jurassic World exhibit which didn't interest us.<br><br>Anyways, I'm more of a medical science fan, but I still enjoyed seeing Sue the biggest, most complete T-Rex, the Egyptian exhibit complete with mummies and tomb matter, and the jewel rooms! We learned a lot of cool facts and saw some very neat things.<br><br>We grabbed a quick lunch in the cafeteria and while it was better than other museums, we would have been just as good packing a few snacks.<br><br>I recommend visiting and make sure you get the lower website rate if you're not interested in the 3D video and Jurassic World.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/P36ES3N8Xd6p698FWeYl2g/348s.jpg", "caption": "Sue, T-Rex"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gEZsr6RMX5S-7pGJRwN9bQ/168s.jpg", "caption": "Tomb"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KuxAkzUZVjSNdNhT61__0g/168s.jpg", "caption": "Mummies"}]}}, {"review": {"des": "This is a big museum. Make sure you have set aside enough time to enjoy all the exhibits and events. The entrance fees is quite high and the city pass does not include everything.<br><br>We loved the giant T-Rex skeleton replica and it is sad to know that it probably died a painful starving death. The Egypt exhibit was good too. Overall, a pretty good place to learn and spend your day.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Er8RajuCQB7qVAcNMhwVcQ/348s.jpg", "caption": "T-Rex"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qZLWKUz2naO-jBRZP-Tz-Q/168s.jpg", "caption": "Getting ready for a 3D show"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dxT4780UktVSx8WqlT4b_Q/168s.jpg", "caption": "Dinosaur exhibit"}]}}, {"review": {"des": "This museum never gets old. They come up with new exciting exhibits to attract people of all ages. I really enjoyed the dinosaurs and was sad when they left... but it's ok because dinosaurs are not real anyway. Some say they were nothing but giant birds.", "pics": null}}, {"review": {"des": "The Field Museum is never disappointing. I try and visit every time I'm in Chicago. One thing that is great during the winter is their coat check.  I would recommend the City Pass if you are wanting to do multiple attractions in Chicago as this is included in that pass. With multiple floors of interesting exhibits, one of my favorite has to be the Lions of Tsavo. If you haven't seen the movie \"The Ghost and the Darkness\" make sure you watch it before you go. It's a very interesting story, and the Field Museum has them on display.  You can see the entire museum in an hour or so if you are in a rush, or you could spend literally the whole day looking at everything they have to offer.", "pics": null}}, {"review": {"des": "I loved my visit here! They have very informative volunteers that are highly friendly and knowledgeable. There is a great variety to see and learn from.", "pics": null}}, {"review": {"des": "This place is like a bowl of ramen: base price is nice, but if you want to add a slice of pork belly, some corn, maybe some bamboo shoots, and an egg...you end up with a price tag that you could paid at a KBBQ.<br><br>Pro tip 1: Good for kiddos<br>Pro tip 2: Spend around 2-3 hours minimum to see 1/2 the exhibits <br>Pro tip 3: If you want to see the extra exhibits (movies, Jurassic Park, etcetera) you will have to pay additional...$7, $10, $15...it adds up!<br>Pro tip 4: you CAN bring your own food! You just have to eat at the cafeteria area downstairs.<br>Pro tip 5: you can get guided tours! Ask for hours.<br><br>They are planning to expand on Sue's gallery by next year! Her story is a lot more interesting.<br><br>Observation: Most of the museum is super dark (lighting). It was an interesting adjustment.", "pics": null}}, {"review": {"des": "Best way to arrive is the bus or taxi/Uber. It's a haul from the train, especially if the weather isn't ideal. Lots of kids and tough to push a stroller with all the madness of pushy kids and grownups. Bathrooms are a little tight if you have a stroller too. There are potty's for tots and 1 changing station in the women's room, not sure about men's. <br>The didactics are pretty incredible. Ideal for both children and adults to engage. Impressive amounts of skeletons, it was incredible. Something for every interests. Reserve 1/2 if not all your day here. There are endless exhibits, it's hard to see them all. You'll probably need to break for lunch in their cafe if you make a day of it. We were beat after the visit. Can't wait to go again.", "pics": null}}, {"review": {"des": "The experience and history alone gives you all the reasons in the world to visit this massive museum.  The biggest attraction that caught our eyes was the Jurassic park exhibit.  <br><br>Walking up the huge stair way entrance is awesome and when you walk in right away you notice the most completed trex in the world. Of course it's in the middle dominating the views and getting all the respect in which I'm sure it did when Alive. <br><br>You can spend all day here and get lost in the history and artifacts and displays. So many different countries, jewels and animals to see and many many more things. <br><br>The Jurassic park exhibit is just like the last movie Jurassic world. I don't want to spoil it much but the dinosaur robots inside look to real and they did a great job to make it like the movie. If this is still here when you go please don't miss out on it.  If you have your children with you they will love it.", "pics": null}}, {"review": {"des": "So, I came here on the City Pass and it was definitely worth the price.  If I had paid for the ticket without the discount I would probably feel a little differently.  Today (on a Monday, MLK day) was free for Illinois residents so that also made a pretty big impact on our trip.  We came around 12:30 in the afternoon and were able to get inside quickly after walking a long 2 miles in the snow.  We loved seeing Sue, the giant T-Rex, right when we walked in AND we got to see the 3D movie and learn even more about her!  It really is fascinating and probably the most interesting piece of this museum.<br><br>We also loved seeing the ancient Egyptian tombs - there are so many in this museum it's quite impressive!  After 2 hours though, the place started to get pretty crowded and also very hot.  Even though it was less than 20 degrees outside, the museum felt like it was 80.  Not only was it hot, but the museum smelled quite a bit!  Not sure if it was from all the specimens (I doubt it), or the more likely cafeteria downstairs...  We wandered through the Native American section in the smell and heat for what seemed like forever before finding an exit.<br><br>There is a TON to look at in the museum and I could easily spend an entire day here (if it weren't so warm and crowded).  I came away with new knowledge and a desire to watch National Geographic!", "pics": null}}, {"review": {"des": "I love the field museum but the admission prices are insane especially if you're taking more than yourself. <br><br>With that said, it is worth it to go here at least once and follow up with their Free days to Illinois residents (honestly these days are super crowded, so just pay if you want to avoid the rush). <br><br>My favorite exhibit at the Field Museum is mummy exhibit. I also remember coming once during a really cool marine biology exhibit. Cafeteria inside with overpriced eats. Really nice place to take your kids if you're interested in an educational family trip. Plan on staying at least four hours here if you like to read every single plaque. I like the taxidermified animals like the grizzly bears!", "pics": null}}, {"review": {"des": "I had such a great time. I wish traveling to Chicago hadn't tuckered us out so much. We didn't get to see everything, but I wish we had. Everything was so informative and interesting.", "pics": null}}, {"review": {"des": "The space itself inside and out is beautiful. I've been here twice now, once a few years back when I was a frequent visitor to Chicago and more recently now that I'm a resident to take advantage of free admission days back in February. I will say this is probably a museum you really only want to see once. This second time around I don't think we wandered around for more than an hour since we had seen everything before and you kind of lose that surprise element.<br><br>I think the one thing that bothers me the most about museums in Chicago is that they don't include full access to all of the exhibits for the price of admission. This applies for The Field Museum and their new/special exhibits or film showings cost additional on top of the general admission cost. Never understood this. <br><br>Anyways, I guess to get down to portions I did like at this museum... Of course got to take a selfie with the iconic Sue the T-Rex once you enter. My favorite exhibit of the general admission is the Ancient Egypt section. Crawling through a make shift pyramid and seeing some mummies!<br><br>This is a great place to bring the kids. Check their website for free days if you're an Illinois resident. Next free days are in June of 2017!<br><br>'Til next time, cheers!<br><br>97/365", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LL494HyecssdiunQUOyq_Q/348s.jpg", "caption": "inside shot"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QRYC-Y6FMXjka1oiDjspew/168s.jpg", "caption": "hi sue"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/K75J2aE59m-pg46VQ4aJCw/168s.jpg", "caption": "caption this: face down ____ up"}]}}, {"review": {"des": "I went there to see the famous dinosaur T-Rex, and it was unthinkable. So huge and powerful creature, was represented in small figure. I was a bit upset, but the collection of mummy made me seem better.  So there some minuses and pluses, I would say that sometimes you shouldn't have a lot of expectations in order not to be disappointed. Generally, museum is worth to visit.", "pics": null}}, {"review": {"des": "I remember coming here as a kid when my parents would drive to Chicago to visit the grandparents. I never realized as a kid how enormous this museum is. Really, you could spend days here. <br><br>The price is not cheap at $36 per adult. You better really like natural history and have lots of time. <br><br>My favorite exhibits are the dinosaurs and the mummies. <br><br>We had other stuff to do so we did not come close to seeing everything. I would say devote a good portion of a day to do it right. <br><br>Would return for sure.", "pics": null}}, {"review": {"des": "This review is mostly for the Jurassic World Exhibition that is currently at the Field Museum until January 2018. It is the entire reason I visited Chicago!<br><br>First, the rest of the museum: I'll be honest, I didn't have a ton of time to spend here. Tairyn and I realized we only had about an hour to spare before our included 4-D movie - naturally, we chose the one about Sue, the museum's resident Tyrannosaurus Rex skeleton - followed by Jurassic World.<br><br>With the hour we had, we chose to check out the Egyptian exhibit. I noticed quite a few mummies were missing, with placards taking up their empty spaces that said they were currently in a traveling exhibition. Interestingly, I happened to check out that very exhibition at the Museum of Natural History in New York at the end of July! I talked briefly with one of the tour guides here at the Field Museum about it, and he told me that, since this exhibit was missing so many mummies due to that traveling exhibition, the Egyptian exhibit here was included with basic admission for now. But once all of the mummies return, the Field Museum will charge extra for visitors to check out this exhibit... a pattern I noticed.<br><br>Now, our City Pass tickets got us the highest ticket you could get, so most things were included for us. But my friend Tracy was in town for the day and decided to join us. She bought a basic admission ticket, only to find it didn't include a movie or many of the museum's exhibits. She had to pay an extra $7 for the T-Rex movie, which, while quite interesting, was not at all worth an additional seven bucks. I wasn't a big fan of how it seemed like half of the Field Museum's exhibits cost extra. Granted, the place is huge, but it just came across like nickel-and-diming someone.<br><br>ANYWAY. Let's get to the important part: JURASSIC WORLD. Anyone who knows me knows I'm obsessed with the Jurassic Park movies. And I legit mean obsessed. My friends threw me a surprise birthday party with a dinosaur theme, complete with Chris Pratt and the velociraptors on my cake. When I heard about the Jurassic World exhibition coming to Chicago, my mind was made up: I'm visiting the Windy City! Total bonus: I'd never been to Chicago before, so this really made the trip worthwhile that I'd get to check out a whole new place.<br><br>We queued up for our 3 p.m. entrance slot (you are assigned to 1.5 hour slots, though I sincerely doubt anyone would kick you out for spending longer in there, we certainly took our time). You start by going into a room that makes it look as if you're traveling on a ferry to Isla Nublar - points for creativity on that one! When the doors open, you hear the soaring John Williams score as your eyes gaze upon the iconic Jurassic World gates. I got yelled at for taking too long with my picture taking since I was keeping the door behind me from closing ;)<br><br>From there, you can freely roam about as a brachiosaurus towers over you in the next room, until you get to the \"Petting Zoo\" area. The animatronic dinosaurs are very well done throughout the whole exhibit. You can tell a lot of time and effort was put into making this look authentic.<br><br>Once you head into the next room, you are in the InGen laboratory, complete with a whole wall of backlit amber, as well as actual props from the movies. In here, you can also design your own dinosaur on one of the four monitors on the opposite wall - naturally, I chose the Velociraptor, because it's my favorite. Speaking of raptors, the next room brings you up close and personal with one - and she'll come right up to your spot by the gate and snap at you. This was all really cool, and realistic enough that the young child some family thought would love this ended up screaming in terror (seriously, don't bring your kids here unless they're total nerds like I was - I have been obsessed with Jurassic Park since 4th grade). Next up: the T-Rex in paddock 9! If you thought that little kid was scared before, he was downright terrified here. The animatronic was AWESOME. For sure take video in here.<br><br>As you head through the gyrosphere room (no real gyrospheres - if only!), prepare to come face-to-face with the Indominus Rex, the T-Rex/Raptor hybrid from the movie. I HIGHLY suggest you take videos with your phone, rather than trying to take photos of the dinosaurs. They move a lot, and besides, the video is more impressive anyway.<br><br>There's one last room with some digital quizzes and stuff, but for the most part, it was over after that. My ONE complaint: it wasn't nearly long enough! Once you went through the raptor/T-Rex portion, you couldn't backtrack. Had I known that, I would've taken far longer in there. I was so sad when it was over!<br><br>We spent the remainder of our time taking pictures of Sue. Since the museum was about to close, we got some great pictures without other people in them. Be sure to check out her actual skull upstairs (at 600 lbs, it was too heavy to mount on the skeleton, so that part is a replica).", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6dwao7dyCXevApUT3LRgLw/348s.jpg", "caption": "\"Petting zoo\" area"}]}}, {"review": {"des": "Well done.... simply well done. We spent hours in this museum and didn't even scratch the surface. It is perfectly narrated throughout. Truly make learning easy. I only wish I had a place like this when I was a kid in my home city.", "pics": null}}, {"review": {"des": "This place was awesome. Tons and tons of things to see. I spent about 4 hours here, that's how big this place is. There was a Ground floor, Main Floor, and Upper floor. You'll see many things here you never knew existed. There is a parking garage across the street, For $20, but it does go by how long you were parked in there.", "pics": null}}, {"review": {"des": "This is an awesome natural history museum with a vast display of animals, landscapes and cultures. The architecture of the building reminds me of a mini version of the Met. I would add this to anyone's list of must-visit places in Chicago, especially if you have young kids who love dinosaurs. It makes for an excellent educational experience for people of all ages and allows you to appreciate the hard and unique work paleontologists, anthropologists and others do to bring these beautiful displays available to the public. The entire month of February is free for Illinois residents, which is amazing! You have to pay extra to see certain exhibits, including the 3D films. <br><br>We chose to watch the 3D T-rex movie and my advice is to skip this one and try your luck with the other selections. The theatre screen was pretty small and the 3D quality felt like something made 20 years ago. The film also paused half way in the middle and we had to wait for the staff had to restart it. I felt like I would have had a much better experience watching Planet Earth at home. Seeing the original fossil display of Sue the T. rex, however, was probably the highlight of my whole museum experience. The rest of the dinosaur exhibit was awesome too. They also have one of the best Polynesian sections as well as an Egyptian section featuring real mummies, not just the sarcophagi. All in all, it was a wonderful experience.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fNBpNcRwSmbxnVK64nBugQ/348s.jpg", "caption": "Sue"}]}}, {"review": {"des": "Fantastic! We visited the Field Museum this morning and it was incredible. We had purchased the city pass which includes general admission, special exhibitions and a 3-D film of our choice. Highlights for me were Sue the T-Rex of course, the Tsavo lions, the Maori meeting house in the Traveling Pacific exhibit, the Dinosaur Hall and the Malott Hall of Jades of course! I also really enjoyed the movie on Ancient Egypt. I don't recommend this film for young kids, but if you are interested in mummies, it's a must! Furthermore, if you are interested in learning more about China, the Cyrus Tang Hall of China is very informative and includes several ancient artifacts and a film. <br><br>This museum is a great experience for children and adults alike. I've never seen so many preserved animals and dinosaur fossils all in one place before. Be prepared to walk! There is so much to see! Also keep your ticket handy as you walk through the museum. You will be asked for it when you change floors and to see ticketed exhibitions.", "pics": null}}, {"review": {"des": "Huge museum with lots of stuff - smelled like an old library and parts of the interior looked old.  This is a Natural History museum with an animal section, native american section, China exhibit was on display when we came, mummies, etc etc and a 3D movie theater.  There was just so much to go through and see and it was a bit hard to find your way in and out of things cause the exits all lead to staircases.  You almost have to go through the whole section before you can exit.  I was underwhelmed by the exhibits though and thought it might be catered more towards children.  You can easily kill hours and hours here though. It is also along the water and you can take a water taxi here AND it is right across the street from the aquarium and Soldier Field!", "pics": null}}, {"review": {"des": "I really wanted to be in Chicago for my 30th birthday, but what do you do when it's always cold and sometimes rainy in January?  Well while waiting around for my dinner reservations, I needed to find something to fill up my day.  And it had to be warm.  It turns out The Field Museum is the perfect spot.   I started by looking at all the taxidermy in the dioramas.  It's amazing how all of this work has held up through the years.<br><br>Of course at the time we visited, Sue the T-Rex was still in the main hall, and it's such a magnificent fossil and really brings dinosaurs to scale in front of your very own eyes.  While in the main hall, we stopped by the cafeteria to grab lunch, which was only OK, but we can't complain since we didn't want to leave the premises to eat.", "pics": null}}, {"review": {"des": "The BF suggested we visit the Field Museum after he found out about my love for totem poles during our visit to the Smithsonian in DC earlier this year. I'm also a sucker for natural history museums everywhere that I go, so I was down. <br><br>We queued up for the Museum at about 2:00pm on a Sunday (3 hours before it closed) and there was a bit of a line. It went quickly though, so we were in and looking around within no time. The Museum has a lot of cool exhibits, including an interesting exhibit on Ancient Egypt and mummies. I always forget there are so many different kinds of birds and deer-like animals until we get to the taxonomy animals. <br><br>We spent about 3 hours here and didn't see everything, so I definitely recommend giving yourself the extra time if you want to see every exhibit. <br><br>A+ totem poles - I definitely got what I came for!", "pics": null}}]}