{"name": "the-roost-carolina-kitchen-chicago", "reviews": [{"review": {"des": "The BEST fried chicken on a biscuit I've ever had!<br><br>My fiancé and I have been on a mission to find the most delicious fried chicken sandwich in Chicago and our journey ended once we came here. We came on a weekday afternoon and it wasn't packed at all. Once we were seated, someone immediately came over with waters and asked if we had any questions about the menu. Knowing exactly what we wanted, we ordered right away. I ordered the original fried chicken on a biscuit with alllllll the free toppings- pickles, slaw, sharp cheddar and chipotle ranch. I love that you can customize the sandwich to your liking without an additional charge. To go with it I got the mac & cheese and green beans. My fiancé ordered the Nashville hot sandwich with mac and potato chips. <br><br>First things first, the chicken sandwich is out of this world. It's so juicy and so crispy and the biscuit is unlike any biscuit I've ever had. I don't know how they do it, but it tastes even BETTER than a southern homemade biscuit. I would eat the biscuit alone and be happy. The mac and cheese was outstanding as well. Super creamy and super cheesy!! Perfectly salted and had great flavor to it. Just the way a great mac should taste. The green beans and chips were both great as well. Everything was just spot on. <br><br>I also really like that they have old school games/board games available for customers. After we were done eating we got some beer and played a few rounds of \"Guess Who\". It was so much fun.<br><br>Nothing compares to the amazingness that is this sandwich. Go get you one!!!", "pics": null}}, {"review": {"des": "My husband will go out of his way to go to Roost whenever possible, we live in Milwaukee, but the lake view location is near my parents house so we're able to go at least 4-5 times a year.  To say their food is good is an understatement! I have always ordered the spicy chicken sandwich on the biscuit.  You cannot go wrong - their biscuits are amazing!<br><br>The Mac and cheese is super creamy and delicious. I've also tried the green beans, housemade chips, and the peach cobbler. All of which are great. Any combination thereof makes for a meal you will not regret and will stay full for hours! <br><br>Since the restaurant in Lakeview has expanded its got an even nicer atmosphere. The old joint felt cramped like you were always in someone's way. With the additional space they have done a great job of making you feel welcome (including having board games) and adding a bar!  I'm not a bourbon drinker normally but the \"Mommy's lemonade\" is great. <br><br>If you like hot chicken and great southern food go to Roost, you will not be disappointed!", "pics": null}}, {"review": {"des": "If the owner ever comes across this review, please realize that the 1 star could have been a 5 star if I had simply been given the same level of customer service as others, but instead I wasn't able to enjoy my meal after the way I was treated. I did not post this review out of spite. I only hope that this never happens to anyone else.<br><br>Here's what happened...<br><br>I walk into the restaurant as a young guy party of one ahead of a group of 4-5 friends. The waitress zips by me to greet the party behind me and answer their questions about wait time while I stand by awkwardly. I noticed the \"Please Seat Yourself\" sign and decided to just find an open seat at the bar. As I ask the server behind the bar, is it alright for me to sit here? How do I order? I get an impatient response of \"Sit wherever. Someone will come by and take your order.\" 10 minutes more of sitting awkwardly at the bar neglected, two middle aged ladies sat down next to me and was IMMEDIATELY greeted and offered menus, napkins, and water. I looked on in disbelief. I made direct eye contact with the server in hopes she'd realize that I have been ignored for the past 15 minutes. She stares back silently and continues to tend to other customers. I get that it's busy, but why is everyone else who came in after me being served and treated with warm kindness but me?<br><br>At this point, the dreadful thought came into my head... Am I being discriminated against? Is it because I'm an Asian male? How could this possibly be? I thought Chicago was a diverse city... Should I just get up an leave? What other possible explanation could there be for what's going on?<br><br>Then when the ladies sitting next to me decided to guiltily hand me one of their menus instead of back to the server directly, that's when she was forced to ask me for my order and offer water...<br><br>That was the most bizarre restaurant experience I've ever had. I really want to give the benefit of the doubt that it wasn't discrimination, but damn, what the eff.", "pics": null}}, {"review": {"des": "Stopped by here for brunch on a Saturday before a Cubs game. It was pretty quiet and I should say kids-friendly. Ordered the chicken and biscuit with a side of mac n' cheese. It took a long time to come out, not sure what the delay was since there were only 2-3 other parties. The foods are pretty decent, not the best Southern comfort I've had but it does the trick. Could've been a 4 but due to the rather slow service, it's a 3.", "pics": null}}, {"review": {"des": "Soft biscuit + Crisp spicy chicken + Cold slaw = a hot mess all over your shirt if you're not careful. While my chicken sandwich was exhibiting disorderly conduct - it was tasty! <br><br>Although the bone-in Nashville Hot chicken was much too spicy to enjoy, it was fresh. I recommend selecting the spicy or original option, unless torture is your thing. If so, add milk. <br><br>Now, the chicken here is a bit pricey for such small portions. When I'm in the area again, I might stop - but I won't go out of my way.", "pics": null}}, {"review": {"des": "Had the chicken, and mac and cheese, and potato chips. Pretty good! I played it safe and got their most mild sauce but would try something with more kick next time.", "pics": null}}, {"review": {"des": "Is this the best fried chicken I've ever had in my life? No. Was it delicious? Yes. Went on a Saturday at noon with 2 friends. There was no wait, got seated right away. I had the original chicken sandwich with coleslaw, pickles and chipotle ranch, with 2 sides for $11.50 which is totally reasonably priced. The chicken was tasty and crispy, however it could've been a little more juicy. The menu has 2 options for bread: brioche bun or biscuit, so I chose the biscuit. Then you get a choice of original, spicy or Nashville hot. I got original, one friend got Nashville hot, and the other got spicy. <br><br>For my sides, I got mac n cheese and the house cut potato chips. The Mac and cheese was pretty good, it was a sticker texture though and had a strong taste of velveeta, which makes me think that was the main cheese used - it also had a lot of pepper which I really enjoyed, gave it a little bit of a kick. Service, as other reviews have noted, left something to be desired. We felt neglected towards the end, empty water glasses, etc. I probably won't be back, but not because it was bad, only because there's a LOT of other fried chicken options in Chicago and this one just didn't blow me away.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ojFI0YYs9HoZFUsJ85RAeg/168s.jpg", "caption": "ORIGINAL SANDWICH MEAL (mild)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iBFexBrmJQF2177KVyrsnQ/168s.jpg", "caption": "ORIGINAL SANDWICH MEAL (mild)"}]}}, {"review": {"des": "It's good to finally write a review about one of my favorite fried chicken joints. I've been to this place way too many times but I had to take an unwilling one year hiatus so it was good to get back. Things have been changed as now it's got waitresses, a bar, an extended menu, more room and increased entrees prices. Definitely a lot of differences and not all of them great in my opinion. But most importantly the food is still amazing.<br><br>I got my go to entree of the 3 piece spicy fried chicken meal with the mac and cheese side and buttered biscuit. The mac and cheese side was very creamy and has great taste with decent seasoning, I always throw in some ketchup or chipotle sauce to add to the flavor but it's good by itself. The buttered biscuit is fantastic it's super greasy and buttery which is great for this sort've food, you can also use it to sponge up some of the mac and cheese sauce and greese from the chicken.<br><br>After that comes the chicken which is the entire reason you came! That did not disapoint either, the chicken had a very crunchy shell but inside the meat is soft and well cooked. They also didn't skimp out on the amount of chicken either which is key.  The spice levels are also pretty good for what they give you and the Nashville Hot is actually very spicy if  you're feeling up to it.<br><br>I was also somewhat in a rush in order to make a concert later so the waitress did a good job making sure that we got everything as fast as possible although the wait time for food was a bit longer than I'm used too.", "pics": null}}, {"review": {"des": "Mmmmmmm....<br>Nashville hot chicken is definitely spicy, and I LOVE spicy! <br>I have only ordered the sandwich and tenders.<br>Both have a great flavor without a lot of extra breading.<br>The biscuit has a slightly crunchy exterior and makes for a perfect sandwich.<br>I loooooove their homemade potato chips!<br>The green beans are DE-LISH! I love that they are al dente! Not too soft and not too firm. And I looooove the garlic!<br>The mac & cheese is a bit bland for my taste, but cavatappi pasta is my fave, so I add some crushed red pepper flakes and a pinch of salt to make the dish divine.<br>I definitely recommend this joint!", "pics": null}}, {"review": {"des": "They definitely serve up some good fried chicken here!<br><br>Per our waiter's recommendation I ordered a chicken sandwich on a biscuit and the Cheerwine because I was sitting facing the Cheerwine decoration on the wall and am easily influenced by visual advertisement.<br><br>The food did take a little while, but honestly that's expected with fried chicken made to order.  They have plenty to keep you entertained while you wait including board games, a bar, and a piano. There was a guy who came in randomly and played and sang a few songs and then left. Dinner and live music!<br><br>The food itself is delicious.  Quite possibly the best chicken sandwich I've ever had.  I had the medium spicy and it didn't have a whole lot of heat, the Nashville Hot though was blazing but still flavorful. From the pictures I thought it would be tiny but it was bigger than I thought.  The biscuits was buttery and held up well to the chicken and cole slaw. The mac and cheese, oh my goodness perfection.  The green beans were okay, definitely garlicky!<br><br>Staff was friendly and helpful, definitely recommend this place!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/C9ChUySVb26nvnLZp-f9IA/168s.jpg", "caption": "Cheerwine!"}]}}, {"review": {"des": "BEST CHICKEN SANDWICH EVER! ! ! SO SATISFYING, EACH and EVERY BITE. YOU MUST TRY THE FOOD! <br>The menu is self explanatory. You can order half a chicken, chicken tenders, chicken sandwich, and chicken tacos. I had viewed the menu on their website ahead of time. Also the pictures convinced me I had to come here and eat. Anyway, I had the chicken sandwich on brioche bread, spicy seasoning, cucumber coleslaw, pickles, and a side of chipotle buttermilk ranch. The meal comes with 2 sides I chose the Mac and cheese which was delicious could have been a little warmer but it was good. I also had the green beans which were also good. When my food arrived I didn't know where to start everything was so delicious and tasty! I think next time I come back I'll order 2 sandwiches because they are just so delicious. <br>The customer service was great. Upon arrival there is a sign that lets you know to seat yourself. <br>The set up the restaurant has a homey feel to it. Music playing is awesome. They had me when a mans, mans, mans, world started playing. <br>There are 3 locations too! Lakeview, River West, and the Loop. Definitely check it out!", "pics": null}}, {"review": {"des": "Giving this five stars, which is rare for me, because I've been here several times and it's ALWAYS good. The Nashville hot chicken sandwich is the best I've ever had, and I've been to Nashville. <br><br>This spot has expanded since the last time I was here and they were busy but still great with their service, timing, and prices. But most of all, the food was still on point. The solo sandwich in a biscuit with the chipotle ranch is one of my favorite things. In life. <br><br>Try this place now. Even if they're closed, just sleep outside till they open.", "pics": null}}, {"review": {"des": "Stopped off here for lunch on a Saturday afternoon. It was decently busy but not crazy. Our server was welcoming and informative, as we hadn't been there before. The true southern touch was the Cheerwine they have available. Overall, the food was great! Took a little time, but it's worth the wait. I ordered the fried chicken sandwich--the only thing I'd maybe change is the bread I chose. I put it on a biscuit, and would maybe opt for the brioche bun next time. The biscuit was fragile and fell apart easily (what else would you expect though?). My date got the tacos and they were excellent! I'd certainly go back for another quick bite and a bottle of Cheerwine!", "pics": null}}, {"review": {"des": "I want to like it more! I really do! This place has potential but something about the chicken is not clicking with my taste buds. I've been searching these Chicago streets for the best fried chicken sandwich, and while their sandwich is decent it doesn't do it for me. I like all things spicy so naturally I ordered the hottest sandwich. The sauce they use to marinate the chicken isn't very good. It's too vinegary tasting. I'd prefer the chicken to be spicy based off of dry seasoning, not the wet marinated hot sauce method. So yeah the chicken is off to me based on the cooking technique. Really like the staff and the place has a nice vibe. <br><br>Wouldn't go out of my way to eat here again and obviously I am still on the hunt for Chicago's best fried chicken sandwich, but this place has potential. Check them out for yourself", "pics": null}}, {"review": {"des": "Normally I'm the one in charge of finding new spots we haven't dined at, but when my fiancé found The Roost I was pleasantly surprised! <br><br>We must have shown up just before the mad rush on a Saturday night, because at 6:00pm when we walked in we had our choice of multiple tables, and less than 30 minutes later there was a large wait time. <br><br>Everything is around $7 for a la carte (aka chicken only), while a meal is around $10.50 (chicken plus two sides or one side and one dessert). Your options for chicken include sandwich (served on biscuit or bun), 1/4 chicken (white, dark or mixed) or chicken tenders. Chicken can come Original, which is rosemary and garlic; Hot, which is a spicy seasoning rub; or Nashville Hot, which is the spicy seasoning rub PLUS a coating of a spicy oil mixture. The only requirement for coming here is you must be a chicken lover, because as long as that is true for you, there is something for every single person's palate. <br><br>Be warned, the chicken takes a while to cook... and by a while, I mean 40+ minutes. Good thing they have Lord of the Rings playing on their TV hahaha. <br><br>Together my fiancé and I shared a Nashville Hot chicken sandwich, 1/4 white meat, macaroni and cheese, green beans, bread pudding and peach cobbler. We fought the good fight, but we couldn't finish it all. There was way too much delicious food. <br><br>Overall, I will definitely (DEFINITELY) be back again. Being so close to home and infinitely better than some of their fried chicken counterparts in Avondale and Lincoln Park, I'll stick to The Roost from here on out. :)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_5zhU61CePzCWLtoIdvPYQ/168s.jpg", "caption": "Chicken sandwich on a biscuit with green beans and peach cobbler $11.50"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UhGqQ3y_OBZadoCZGQd_dw/168s.jpg", "caption": "1/4 white with macaroni & cheese and bread pudding $11.50"}]}}, {"review": {"des": "The fried chicken biscuit sandwich was amazing! What was even better was the peach cobbler! The mac and cheese is good but the other 2 meal took all the wow factor. My cousin ordered the chocolate banana bread pudding. He liked that a lot too.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/el_y5SV8SyoIjEdgeuzhKA/348s.jpg", "caption": "Chicken ORIGINAL SANDWICH MEAL (mild), Peach Cobbler, and Mac and Creamy Mac & Cheese"}]}}, {"review": {"des": "Came here for lunch on a Monday. It wasn't busy like it normally is, as it was Presidents' Day, so I'm guessing most of the people that work in the area had the day off. <br><br>Street parking is free and plenty. Just know that you'll be parking on Irving Park Rd., which is a busy street in the area. <br><br>They've changed up their style a little bit. Last I was here, you ordered at the register and sat down. Now, you can take a seat and there's a server that will come to take your order.<br><br>Ordered just the spicy chicken sandwich on brioche with a sweet tea. I typically order it on a biscuit, but decided to be adventurous with the brioche. I wish they had toasted the brioche a little bit, but it's neither here nor there. The spicy chicken wasn't super spicy, but it had just a teeny bit of kick to it. Nothing your 90-something year old grandma can't handle.<br><br>The sweet tea is delicious, and isn't tooth-rottingly sweet, which is hard to find! <br><br>They also started serving alcohol too!", "pics": null}}, {"review": {"des": "I came here for the second time & was very disappointed to say the least.  Ordered the 1/2 chicken mixed original to go.  Green beans w/ cole slaw.  Was very dry, burnt,  overcooked & greasy chicken.  The green beans were raw like they tipped them in hot water for 5 or 10 minutes.  I think I would give no stars if I only could but cannot.  Just go to Popeyes a block west of here it's 100% better than this overated place honestly!", "pics": null}}, {"review": {"des": "Ok, so I originally posted a review that was pretty short and sweet but after some consideration, I decided to do the place justice. I'll start with my gripes. And if you're reading this, you're probably like, \"why's this dude got gripes, if he gave it five stars ?\" And you know what, that's a good question my friend and imma bout to tell ya that I'm a damn tootin fried chicken connoisseur, if I ever do say so myself, and I've had it from LA to Key west to Memphis, to Louisville and back again. So I happen to just be a smidge persnickety about my fried chicken. So let's lock in: <br>  <br>First and foremost, the bun that my fried chicken sandwich came out in was cold, like the dude just grabbed it out of the reach in cold. <br><br>Second: they did a hella weak justice to that sweet, Sweet ranch they put on the thing. Just a lil squeeze bottle squirt was all I got, I was super bummed and I was too hungry to ask for a extra side. <br><br>Third: And this is a personal discretion, they don't have French fries, which are <a href=\"/redir?url=http%3A%2F%2Fbomb.com&s=bb4f996415a9c2f21137e27cfb68f439a48cec2652b53e9b50dd7e766dbe177e\" target=\"_blank\" rel=\"nofollow\">bomb.com</a> btw<br><br>So... the good:<br>Firstly and epically foremostly...<br>GODDAM if that is not some motha cluckin fine piece of fried chicken. I mean, I've had better fried chicken before, but I couldn't exactly tell you when. Seasoned nicely, super spicy but not overpowering. Crisp, crunchy and juicy all at the same time. It was a fantastic piece of art. Whoever came up with the recipe and to take the time to train and execute that consistently deserves a raise and a beer. Kudos to you sir, I tip my hat to you!!<br><br>Secondly: The Mac and cheese was excellent and I am a hater of all Mac and cheeses, most of the time I hate it cuz I think it's gross, but this was something else. Once again, like with the chicken, whoever came through with the execution for a dish like that on a consistent bases deserves a round of applause.<br><br>It was overall a really good meal, to be certain. The bun eventually warmed up with the bird and I eventually got another thing of sauce, so no biggie. The beer was ice cold and the bartender was super nice. If you're looking for fried chicken in Chicago, this place knocks it outta the park.", "pics": null}}, {"review": {"des": "It's the start of the new year and I had every intention to lose weight but no desire to eat a salad and workout. I would rather stuff my face with fried chicken and that's exactly why I went to The Roost.<br><br>I came here specifically for their Nashville hot chicken sandwich. Deep-fried to order, crispy, juicy, spicy chicken topped with a tangy coleslaw and chipotle mayo on a buttered bun. Yes, that's what my love handles were craving. None of that low fat stuff in this lip smacking good sammich from the south. It was delicious and I was probably moaning a bit while eating. I guarantee you that this is more delicious than the kale quinoa salad that you are trying to make yourself eat.<br><br>Going into 2018, I will now be setting low expectations for myself. This will allow me to be more realistic and not be disappointed on a daily basis for things like going grocery shopping and finding parking at the mall. Look out for my Ted Talk on this mindblowing topic on what keeping it real looks like today. In the meantime, love your body and eat some more fried food.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OefnbLJCUPwxn9XyVrQ-Wg/168s.jpg", "caption": "Nashville hot with all fixings on a buttered bun"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ijHADy0edV_b617rfLtf2A/168s.jpg", "caption": "Nashville hot on a biscuit with toppings on the side"}]}}, {"review": {"des": "The chicken itself is awesome. The marinade/seasoning they use is infused really well, and they perfectly cook the chicken so it's still nice and juicy. I tried both the spicy and Nashville flavors. I enjoyed the spice from the Nashville more, but preferred the crispiness of the regular spicy one more. <br>My favorite side was the hand cut potato chips. I would have liked if them more had they been more flavored or tossed in a Cajun seasoning. <br><br>This place reminds me a bit of Buttermilk. Both take different, successful approaches to fried chicken. Buttermilk has mastered sweet and salty flavors whereas Roost has more spicy, savory flavors.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kHNzPQXDYnmncbQF6kwsbg/348s.jpg", "caption": "Spicy chicken on a biscuit with Mac and cheese and chips"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/17ygcN83yMzbjUIzw8EzVQ/168s.jpg", "caption": "Bread pudding"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/c4DBNejJEt4ye2EsDR0ykQ/168s.jpg", "caption": "Spicy chicken on a biscuit"}]}}, {"review": {"des": "Had our food delivered by Postmates so we wouldn't miss any college football action.  Been wanting to try this place for a bit and I was not disappointed.  The spicy chicken sandwich was delicious as well as the Mac and cheese side.  Biscuit was good too.  Will definitely return for more!", "pics": null}}, {"review": {"des": "I came here today for lunch to meet a friend.  I live close by and have been wanting to try this place for a long time.  I ordered the hot fried chicken sandwich and it was pretty tasty.  I had green beans and Cole slaw as my sides which were also good as well.  You really have to be in the mood for fried chicken as the menu is pretty limited but the service was outstanding- I love how quickly they refilled your soda/water glasses.", "pics": null}}, {"review": {"des": "One of my favorite Nashville hot places in the city.  Everything I've had there has been great, the chicken sandwich, mac n cheese, biscuits, regular fried chicken, etc.  The first time I ate at Roost I ordered the fried chicken sandwich on the biscuit... tip for first time eaters, that biscuit is too fluffy to hold up to the hearty contents on top.  I now order the sandwich on the bun and get a biscuit on the side for extra carb loading enjoyment. Also, their heat level doesn't seem to be consistent, sometimes the Nashville hot level is perfect and sometimes I want to die.  It's so good though, it's worth it.", "pics": null}}, {"review": {"des": "Cluckin good chicken at The Roost. Picked up some lunch here while working near Wrigley. Hot chicken sandwich was great, the mac and cheese was just ok. Kind of bland, and also cold. Peach cobbler shake was just ok as well. Tasted more like pumpkin than peach. No pieces of crust or anything noticeable to make it a cobbler shake. Overall, it was tasty and I would try it again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/r5UjTBCUXbACHKuYKrrZ-Q/348s.jpg", "caption": "Peach cobbler shake"}]}}, {"review": {"des": "Good, Not Great <br><br>The Roost is an alright shop for southern food. I came here because I had heard rumblings around the Chicago food scene that this was the best place in Chicago for a chicken sandwich. I left somewhat disappointed. <br><br>By no means is The Roost Carolina Kitchen a bad restaurant, however its definitely unworthy of the title \"Best Chicken Sandwich in Chicago.\" Their chicken sandwich is reasonably most, decently seasoned, and fairly crispy. However it doesn't really take any of these things to a high enough level to truly standout. Their sides are similarly underwhelming, although their macaroni and cheese was a pleasant surprise, our green were slightly bland. <br><br>When I asked the Chef about their process, he merely replied the secret was marinating their chicken in buttermilk overnight. That's not really a secret at all, that's simply the first step in anyone trying to make dynamic southern food. Their halfhearted effort is reflected in my halfhearted reaction to their sandwich. <br><br>3.5/5", "pics": null}}, {"review": {"des": "This place is A-OK<br><br>Ordered a chicken sandwich on biscuit bun with mac n cheese and green beans. The chicken was cooked fine but was masked by it Nashville hot sauce and the green beans were firm and well cooked but not exactly seasoned memorably.<br><br>The mac n cheese was disappointingly mushy, cooked a bit too far, but the cheese cream was indeed creamy, cheesy, and tasty. <br><br>Service was mediocre. After the half hour wait for my order to be ready, I sat with empty water for 10 minutes before getting it refilled. Was checked on every 10 minutes then after. Once food was done, was just given the check instead of asked how my food was or if I wanted anything else despite letting the server know at the start that it was my first time visit and that I might do a float depending on how filling it was.<br><br>A-OK if you're in the area and looking for something tasty, i'd order ahead of arriving. My companions did share that the food wasn't what they remembered it to be.", "pics": null}}, {"review": {"des": "I have ordered from the Roost countless times but never dined in at the restaurant. The restaurant is more of a takeout place but still can seat probably 35-40 people. The portions are very filling. I absolutely love spicy food so I ordered the Nashville Hot Fried Chicken Sandwich meal with two sides. Let me tell you this, you should be waiting by the water station as you eat this. My mouth was on fire and I had to drink at least 3 cups of water to get my mouth to cool down from the heat.<br><br>For the sandwich meal you get your choice of 2 sides. I order their mac n cheese and biscuit. By the way, you have the option of getting your sandwich on a biscuit and I highly reccomend that. The biscuit is a flakey buttery bread that is absolutely delicious. The mac n cheese is extra cheesy and is almost a whole meal on its own. The mac is very filling. Overall this place is somewhere you for sure need to try.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2VUyqRbFKD1jgbRNg0skTg/168s.jpg", "caption": "Nashville Spicy Hot Chicken Sandwich,  Mac n Cheese,  and their biscuit."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uW4OhgxmecvBEEl4KgGh7A/168s.jpg", "caption": "Restaurant Menu"}]}}, {"review": {"des": "Of course this place is phenomenal! I've been to the West Loop location but first time here. They do chicken biscuit sandwiches right. Be careful when ordering the Nashville Hot, it is more spicy than I expected. Friends were also surprised they served Goose Island Bourbon County(see pics). Sandwiches on brioche or biscuit are $6.50 plus tax, meals consist of sandwich & two sides or one side/one dessert for $10.50 plus tax. This location serves alcohol which is awesome, unlike the other. Definitely a cool southern ambiance here, music & decor. Definitely recommend!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IZwCf3a-Scem0JPi-Lhc5A/348s.jpg", "caption": "Takeout area"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wTimDhLbyfoEEY04VD_pgA/168s.jpg", "caption": "Cool, old school looking bar"}]}}, {"review": {"des": "Absolutely delicious. I got the original chicken sandwich with peach cobbler and Mac and cheese. It's all fresh and just tastes like good home grandmas cooking. I'm def impressed and will be back to try more!", "pics": null}}, {"review": {"des": "The Roost is one of our favorite places to visit in Lakeview. It all started with their food truck that comes to U of C where my wife and I both work and then they opened up shop in Lakeview a few years ago. Our 3 year old son Luke is obsessed with their peach cobbler which he calls \"doh\". We take him here for special treats in the afternoon after school and he just loves the place. Luke and I had breakfast for the first time here today and the experience was amazing. The waitress and the gentleman in the kitchen just made his weekend because peach cobbler (doh) is not ready until 11am and he was pretty upset. We came here to celebrate a special occasion and he expected doh. So we ordered breakfast instead which was phenomenal. All of a sudden our amazing waitress said, \"doh is in the oven and will be ready in 10 minutes.\" This is at 9:55 in the morning.  She brought out Luke some doh at 10am and it was amazing. The chef and her made my son's weekend because we were celebrating something special and my little guy could not have had a better time or experience. <br><br>Over<br>Their food is just awesome and you couldn't ask for a more fun menu. It's just hearty, delicious, comfort food that you can't get enough of. What really makes The Roost awesome and a step above other restaurants is their staff. You walk in the door and the gentleman in the kitchen immediately comes out and welcomes you and the staff all greet you with the friendliest smiles and hellos in the neighborhood. The style and layout of the restaurant is really fun, original, relaxing and welcoming too. You can actually feel and see all the hard work they put into the place which makes it even more enjoyable and welcoming.", "pics": null}}, {"review": {"des": "Absolute GARBAGE!!!! Let's start with that cucumber Cole slaw. It's like they took the worst of 2 worlds and crammed it together and sprinkled pepper on it, then they shoved it in a sauce container and charged $2.50 for it. Ok now let's move on to the chicken. I tried the original and the Nashville hot. I'dve been better off going to jewel and buying a bucket of their stuff for $10.00 bucks. The taste was awful they should be ashamed of themselves for serving this crap. It was like grease and batter having a dance battle in my mouth, No flavor whatsoever. <br><br>So in my opinion the best thing was the mac n cheese and that was mediocre at best. I cant forget about the biscuit it wasn't bad. The young lady who took my order screwed it up and caught an attitude when I brought it to her attention. I couldn't believe she had the audacity to get snappy when I didn't care to tip her, get this for a take out order can you believe that. I couldn't believe it,  you want me to tip you just for taking my order, these people out here are losing their minds.<br><br>They need to pack up and take that shit back to Carolina. I wouldn't hire them to cater my dogs party. Go at your own risk or if you like crappy food.", "pics": null}}, {"review": {"des": "Maybe my expectations were set too high based on reading these reviews beforehand but I found this place good but not amazing. First off, this isn't a pit stop place - the chicken is fried on the spot (big fan) but you will have to wait 15-20min. Although the chicken was fried perfectly, the flavor was far from being \"Nashville hot.\" The biscuit was ok but this sandwich honestly reminded me of a high-end chicfila sandwich (which is not a bad thing).. I just expected more \"wow\" based on the price. <br><br>The sides were also a little underwhelming. The mac and cheese was good the first couple of bites then just felt way too heavy. The slaw was decent but nothing special. <br><br>The place is small (probably can  comfortably sit 12-15?) but the staff is nice and you can play checkers while waiting for the food.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_XaN85JOlH0yAc57CnIhQg/348s.jpg", "caption": "Nashville hot chicken sandwich"}]}}, {"review": {"des": "This place was so slow, even when there was only 2 other table occupied. Took over 20 mins to get our food. It was a bit pricy, so I figured if it took so long, perhaps, the food was incredible. Not the case. The Mac was just ok, the bread pudding as ok as well. The chicken was just meh. If you got 1 main food item, do it right!!!! We went here figuring that chicken is fast, slap some on a plate. Scoop on the sides. But this place is not fast and efficient. 50 cents extra for a dab of sauce....isn't this place about BBQ??? All just overall poor execution of a restaurant. I wanted to like this place. Very underwhelmed by this place.", "pics": null}}, {"review": {"des": "4.5. Came here with my brother. I ordered the Original Fried Chicken Sandwich and he ordered the Nashville Hot Fried Chicken sandwich. The sandwiches themselves are 6.50 each. You can upgrade for a meal which has two sides for 4 dollars more (10.50). We both got the hand cut potato chips and the creamy mac n cheese. <br><br>For the most part, employees were very kind and patient. The reason I gave it a 4.5 instead of 5 would be because the food took quiet long to come out. I'd say about 40 minutes. I feel like it should have came out faster than that. My impatience quickly ended when I bit into my burger. The chicken was seasoned well and juicy. It doesn't look too bad, but it's SO filling. Had to sit there a couple minutes before getting up. The hand cut potato chips were so freaking good. They're so thin and just the right amount of salty. They added a nice texture in between the bites of chicken. The mac n cheese, however, was a different story. I started off by just taking a bit. First thought. YUM. Second thought, DIS TOO THICK! It got to be a bit too overwhelming once I had more. I ended up not finishing it. If you're going with someone else, share one serving of this! It's definitely worth the try, but one serving per person is a bit much.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eyrsBENc39Q5Of5hf2T8fw/348s.jpg", "caption": "Original sandwich with hand cut potato chips and Mac n cheese"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Eq08wm38A-bBrsm9kHEIeQ/168s.jpg", "caption": "Original sandwich with all free toppings"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OK4_Vm-ZJK2RhClckzbTVw/168s.jpg", "caption": "Nashville hot chicken sandwich with all free toppings, and sharp cheddar"}]}}, {"review": {"des": "Roost is superb. It has been my go-to ever since I first tasted its chicken around 3 years ago.<br><br>Call me \"basic\", but I'm okay ordering the same thing every time I go: sandwich meal (with all the toppings) on a biscuit with mac and cheese and peach cobbler, and an \"Arnold Palmer\" to wash it all down. The chicken is cooked to perfection, flavorful and spicy (Nashville Hot is HOT, so beware!) and the biscuit is buttery goodness. You can't go wrong with any of their sides, but mac and cheese and peach cobbler is the perfect sweet/savory combination for me.<br><br>A recent expansion has made for plentiful seating, table service, music, and an ambiance to reward anyone who chooses to dine in. I've never felt cheated at Roost, as the portions are plentiful and the price is more than reasonable.<br><br>Stop in and become a \"Frequent Frier\" today!", "pics": null}}, {"review": {"des": "My mouth is having a bit poplar episode.  Too hot, no more, too hot, no amazing.<br><br>My food was delivered before the estimated time and it was still warm. <br><br>The Mac and cheese was amazing as well.<br><br>The only reason I give four stars is for the $2 portion of chips that were burnt and very small.", "pics": null}}, {"review": {"des": "Stopped in for lunch. I'm not a huge fan of spicy chicken, so I ordered their original chicken sandwich and it was awesome. Asked for their coleslaw and pickles as the toppings, excellent compliment to this great sandwich. The chips on the side were quite good. The unsweet tea tasted like it was brewed and not out of a gun. Always a plus.  The server was very friendly and seemed like she knew what she was doing. <br><br>Food delivery was a little slower than expected but not awful. It could have been that we went on a holiday weekend, but they felt slightly understaffed. Over all, a great experience and I would go back without hesitation.", "pics": null}}, {"review": {"des": "Best fried chicken sandwich in the city.  Best to get the Buttermilk biscuit as the bread instead of the bun.  It melts in your mouth.  May get a bit messy but it's worth it.  Gotta go with the homemade chips and Mac n Cheese as the sides and dip the chips in the Mac n Cheese.", "pics": null}}, {"review": {"des": "My initial experience started on a bad foot with my order being incorrect. However, after speaking with a pleasant Samantha I was told I would be contacted by the manager Anthony. They kept their word and sure enough I received a call from their manager Anthony who was considerate, respectful, and assured me my initial mishap was an isolated incident. This turned out to be beyond true, as I arrived the next day to a completely different experience. Amy and heather were lovely, Anthony is very clearly respected and admired by his team and I can see why! I left with nothing but good things to say. I can't wait to come back and I highly recommend the hillbilly tacos! They hit the spot! Thank you again everyone! The hospitality and comfortability was unmatched, as someone new to the city, I can only hope I find other places just as amazing as the roost.", "pics": null}}, {"review": {"des": "I cannot say enough about this place! If they ever went public I would buy their shares. I have introduced a lot of folks to this spot and they all love it. I also like to think of myself as a founding member of Roost. I was with them when they only had the food truck and then opened the Irving Park location and then the West Loop location. <br><br>On a serious note, this is the best chicken sandwich spot in Chicago. If you go through my reviews and pics you will know so know my chicken sandwiches. You cannot go wrong with the Nashville hot. Yes, it is hot but amazing. My preferred sides are Mac n Cheese and peach cobbler. <br><br>They also now have a full service bar...upgrade!!!! I recommend the Carolina Mule and Sweet Home Chicago.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0mF_qbON52UdvLf9oyIj5g/168s.jpg", "caption": "Blessings.  Nashville Hot Chicken Sandwich Meal. On a bun with mac n cheese and peach cobbler."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nz5wX5W7ksvZAE8-SYvuog/168s.jpg", "caption": "Nashville hot on a biscuit. With Mac n cheese and peach cobbler."}]}}, {"review": {"des": "the original chicken sandwich meal. buttermilk biscuit, pickles, chipotle ranch, and fried chicken that is TASTY AF swear to god. such a nice, friendly, neighborhood place on irving park rd. 10/10 would recommend. while you're there, GET THE GREEN BEANS AND THE MAC & CHEESE. trust me.", "pics": null}}, {"review": {"des": "My favorite chicken place in Chicago. <br><br>FANTASTIC BISCUITS...<br><br>Have a group of friends? They have checkers & other kinds of games to keep everyone entertained, and they have a bar which is also nice. <br><br>Great fried chicken!", "pics": null}}, {"review": {"des": "One spicy chicken sandwich on a biscuit with cole slaw on top.  One side of mac & cheese.  One bread pudding. Dang!<br><br>There are times when a simple meal like this is more satisfying than a fancy dining experience.  The Roost delivered.  They don't pretend to reinvent the wheel.  They offer good food done right.  I lost count of the amount of times I said \"Oh my god, this is soooo good!\"  I'll definitely be going back for more.", "pics": null}}, {"review": {"des": "I LOOOOOOVE this place!! They have some of the best fried chicken on the north side, and you're doing yourself a disservice if you don't try it on a biscuit! I've only gotten delivery from here, and it always holds up incredibly well for fried chicken!<br><br>I always go for their chicken on a biscuit; if you order during the breakfast hour, throwing on bacon and cheddar cheese is always a winner, but it's perfectly fine as is! The biscuit is melt-in-your mouth; it's incredibly flakey and buttery. It falls apart after a while, but the taste is spot-on! For something a little spicier, the Nashville hot chicken sandwich is also a winner! It boasts a really great heat, and has a unique, sour, sweet heat to it. I really like it!<br><br>Sides are also good! The coleslaw is good on its own--nothing to write home about, but it's decent quality. For being secondary to the chicken, the macaroni and cheese is quite tasty as well! Although it can get a bit gummy in certain batches. <br><br>Desserts...peach cobbler is a winner! Not the best, but it's the best of the desserts. Bread pudding...the flavor is good, but it's usually a bit too dense or soggy for my taste, and I'm a big bread pudding fan! <br><br>Knocked off a star, because it can get pretty pricey...even sandwiches a la carte are a wee bit expensive.<br><br>All in all, this place is a staple for me when I'm craving fried chicken! It's especially favorable when you're lazy and want good, stick to your ribs delivery! <br><br>Highly recommend!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GkJhUYEV8zOA5e4lbDNeAQ/348s.jpg", "caption": "Spicy chicken on. Biscuit with cheddar. This sexy little number was delivered! Soo good!"}]}}, {"review": {"des": "Good place for some fried chicken. We had the original 1/4 bird meal with bread pudding & biscuit and then a spicy 1/4 bird meal with Mac 'n cheese & biscuit- both with dark meat. The Mac 'n cheese was spicier than the chicken for the spicy meal. Everything was tasty. Service was a little slow while waiting to put our orders in since there was about 2 waiters on hand for a fairly busy place. Our waitress apologized for not getting to us sooner and she was a good waitress despite the semi packed place. Would go again for tastiness!", "pics": null}}, {"review": {"des": "What a great place! I came across here before heading to an event in the neighborhood and I'm glad I did. This seems like a simple OTC sandwich/BBQ joint, but it's much more appealing. When you walk in you find out its actually a nice, casual, full-service restaurant.<br><br>I got the tacos with medium spicy & a side of buttermilk biscuit and green beans. Excited to go back and try something else.", "pics": null}}, {"review": {"des": "I live in the neighborhood, so I was super excited when they opened up on Irving Park.  I was a frequent visitor of their truck, so now I can get it my Roost fix whenever I want.  The chicken is moist and tender and spiced just right.  Love the cucumber slaw on top with the special buttermilk sauce.  Sides are great, but my favorite is the mac n cheese.  The addition of more dining space and a bar were much needed and appreciated.  Now I can sit and enjoy my chicken with an ice cold beer.  Just wish there were more choices on tap. Espcially local options like Begyle, Dovetail, Metropolitan, Maplewood, and Half Acre.  Best Chicken sandwiches in Chicago.", "pics": null}}, {"review": {"des": "I've been wanting to try Nashville hot chicken for awhile and remembered I bookmarked this spot.  I ordered the 1/4 dark with coleslaw and green beans.  Waited 20 minutes for a to go order.   The chicken was tasty and still hot when I got home.  The coleslaw was awful.  Tiny container and no flavor.   Green beans were basic.  Very expensive for a mediocre meal.", "pics": null}}, {"review": {"des": "Best peach cobbler yum! Chicken is juicy not at all dry. Mac n cheese is cheesy n warm n yummy... this review is horrible for anyone cuz the only thing I can say about everything about this options are yum. yummy, mmmm and omg! pretty sure that doesn't help n e 1.<br>oh crappy street parking btw", "pics": null}}, {"review": {"des": "Highly recommend! I am so thankful this kitchen is next to my house. I don't think I've ever eaten better Fried Chicken in my life. Their sides are amazing too, the cucumber coleslaw and the Mac and Cheese are to die for. They recently renovated as well with a huge extension and bar area now.", "pics": null}}, {"review": {"des": "The service was great, the food was delicious, and I cannot wait to eat here again. This food is so good!!!! I will definitely be going back. Got the original tenders, the mac and cheese (FIRE), and the biscuit. My BF got the spicy tenders, the mac and cheese and the biscuit.  Two thumbs way the hell up! <br><br>Definitely a great Chicago spot, especially if you are looking for <br>food that tastes like genuine home cooking, REAL food. Check this place out if you are looking for something you can't get everywhere! Easily accesible street parking, great location. Go here and you won't be sorry!", "pics": null}}, {"review": {"des": "With a great array of southern favorites, the roost carolina kitchen transports you out of chicago for the brief moment while you are there. Spicy chicken sandwiches with pickles galore and peach cobbler make you feel like you have gone to heaven. I wish I still lived closer so I could go more frequently. Prices are reasonable and quality is high.", "pics": null}}, {"review": {"des": "Fried chicken is on point! Biscuits were good as well. They could step up there mac n cheese game. But as far as the chicken goes, v good!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/46PC3vmsuuIPNCHJMxTwjw/168s.jpg", "caption": "Half Chicken"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uGnMge5cu8Sxn5SOsNSIDg/168s.jpg", "caption": "Original Fried Chicken Sandwich"}]}}, {"review": {"des": "This place is AMAZING. Went here at around noon on a Monday and it wasn't packed at all--yay! Literally everything on the menu is delicious:<br><br>The chicken - Tender, juicy, and cooked to perfection. I got the spicy chicken sandwich on a brioche bun with fresh pickles and a marvelous cucumber slaw. Such a refreshing contrast with the hot crispy chicken. Forgot to breathe while eating at some points because I was so busy scarfing it down. De. Lish. <br><br>The sides - Oh god. Here's where it gets spectacular; the mac and cheese is creamy, a little peppery, and PACKED with flavor. Please don't forget to order it with your meal. You won't regret it. The house-made potato chips are perfectly crispy and not too salty. Really really yummy.<br><br>The desserts - When I die, I want to be reincarnated into The Roost's peach cobbler. It's sheer perfection; warm ooey gooey sweet carmelized peachy goodness with subtle hints of coconut. The raisin bread pudding was also out of this world (and I don't even like raisins!); soft, dense, and cinnamony. Absolutely scrumptious.<br><br>This place is a little on the pricier end but it's SO worth it. Don't sleep on this place -- let The Roost be your new wakeup call.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xKvb33pe3qXL9idTwMXdNQ/348s.jpg", "caption": "Close-up of the delectable bread pudding with raisins. $3.50"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mp5tzgcplgH96SDiifgZFA/168s.jpg", "caption": "Nashville Hot Chicken Sandwich meal on a biscuit. Comes with 2 sides. Bf chose the housemade chips and peach cobbler. $10.50"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aMSwltZ9CAIXPtC6WEMJ6w/168s.jpg", "caption": "Spicy chicken sandwich meal with pickles and cucumber slaw. Comes with 2 sides -- I chose the mac and cheese and the bread pudding. $10.50"}]}}, {"review": {"des": "About as close as you'll get to Nashville hot chicken in Chicago. The bone in Nashville hot had my husband's eyes welling & him hiccupping (and he likes hot). The sides are the real deal: we had the rich  Mac & cheese, green beans & delicious, but sweet peach cobbler & bread pudding. Nice sized portions, friendly service & bang for your buck!", "pics": null}}, {"review": {"des": "I can't believe I waited this long to try The Roost. <br><br>-Great beer selection.<br>-The Nashville Hot chicken on a biscuit w/ the cucumber slaw was incredibly good. The honey on the table was a perfect compliment to the level of spice.<br>-Try the sweet tea, it's exactly like what I grew up w/ in North Carolina. Think bojangles sweet tea.<br>-They have cheerwine and cheerwine floats. If you've never had a cheerwine then treat yourself to the best soda ever.<br><br>My only complaint would be that I'd like a mega-hot option (maybe keep it secret?). Budlong's highest spice level is WAYYYY spicier than The Roost's highest but I prefer the biscuit, toppings, and chicken quality (+ the honey) @ the Roost. A secret level of spice would get a cult following, just my prediction.", "pics": null}}, {"review": {"des": "We stopped at The Roost before a Cub's game. Delicious chicken and sides.  Beers were good too. Service was great.  Try this place. I hope you will like the food as we did. Enjoy!", "pics": null}}, {"review": {"des": "This place is incredible, I live down the street and I come here pretty often. It is definitely my favorite place in Chicago to get fried chicken. <br><br>I usually opt for the \"spicy\"- I personally find the Nashville hot too hot for my preference. I love the mac and cheese, nice and spicy with fresh ground pepper, and the biscuits are home made and super tasty.<br><br>Roost also serves sweet tea, which makes the whole meal that much better.<br><br>I recommend the chipotle ranch if you're going to get a side. I like both the bread budding and the cobbler but I prefer the bread pudding if you are deciding between the two.<br><br>As a heads up, it does take time to prepare your meal to order. So come and expect to wait a bit for your food!", "pics": null}}, {"review": {"des": "Holy chicken biscuit! Having lived in and around Chapel Hill, NC for most of my life I take my chicken biscuits pretty seriously. When my friend from NC said that this place was on point I was skeptical, but had to give it a try. Called in an order to avoid the wait. Not disappointed at all! Heck, they serve Cheerwine in a glass bottle! Tender, juicy, fried chicken on a scratch made biscuit? Sign me up... I could eat this every day. I would fly back to Chicago just for this. Unto the Italian beef, Chicago dog, and deep dish pizza, a new signature Chicago food icon is born.", "pics": null}}, {"review": {"des": "We were looking for a place that reminded us of home cooking from down south. This place hit the spot! The deserts are spectacular! Peach cobbler and bread pudding are wii era for sure. The chicken is even more of a highlight, both regular and Nashville hot. You've got to try this spot out if you want some good food.", "pics": null}}, {"review": {"des": "Review: A pretty awesome Southern restaurant in Lakeview. As a previous resident of Atlanta I think I know my fair share of good Southern food. The flavor on the chicken is Amazing. It is offered in 3 flavors: Original, spicy, and Nashville hot and served 4 ways, taco, sandwich, bone in, and tenders. The Sandwich is most common but having it with biscuit is a most. Great affordable southern food. Desserts are amazing, both are great! OMG the peach cobbler is the best I ever had and the bread pudding is a less sweeter and more filling. <br><br>Budget: $11-$14 per person/meal<br><br>Food: first meal: Original chicken on biscuit with cheese and Chipotle ranch. Sides Mac n cheese and peach cobbler <br><br>Second meal: Nashville hot bone in with Mac and bread pudding", "pics": null}}, {"review": {"des": "If you like Southern Style Hot Chicken Samiches, this place has 'em. Really good with slaw & pickles and a side of the homemade chips. <br>Yum.", "pics": null}}, {"review": {"des": "I feel like this is the closest I'm gonna get to official Nashville hot chicken in Chicago. I only get the spicy version because the Nashville hot is extremely to hot for me. But it's fresh and the chicken sandwich is bomb. Great desserts as well.", "pics": null}}, {"review": {"des": "I love Roost! It is the best chicken in Chicago and possibly the best chicken I have ever had. They redid the restaurant so now it is a lot bigger and the menu has expanded (including adding alcohol). We order delivery from Roost a lot. The food is always as good as it is in the restaurant. Once in awhile they forget a side or two or mess up toppings on a sandwich but they always refund us for the mistake or offer to give us free items the next time we order and they follow through! I usually get the spicy chicken sandwich (the chicken breasts are very juicy and high quality white meat), with everything on it minus cheese and for my sides I get mac and cheese and a dessert. The Nashville Hot is amazing as well. Recently, I had one of their boozy milkshakes- similar to a mudslide, it tasted so good and was strong. Definitely check this place out if you love fried spicy chicken and mac and cheese!", "pics": null}}, {"review": {"des": "I've only ever gotten delivery and it was kinda expensive but worth every penny. The chicken, having traveled quite a distanced, was still super hot and juicy. The Mac and cheese was probably my favorite side but the biscuit was a super close second. I can't wait to actually visit this place #intheflesh.", "pics": null}}, {"review": {"des": "Great fried chicken and i love chicken the sides of green beans and peach cobbler out of this world and the sweet tea was the suger on top", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0RAdRlkpFxLb_wVd0594Xw/348s.jpg", "caption": "Amazing"}]}}, {"review": {"des": "Had to edit my initial four star down to a two. Came in for carry out. They told us 20 min. We were all very hungry. We wanted to get back home to watch the NBA Finals. Game started and we were sitting at the bar very hungry. My girlfriend asked politely if we could change to dine in but apparently we would have to sit in the corner away from the tv if we dined in? An employee walking behind me rudely said this is a restaurant?! Oh really? Apparently they changed it to a restaurant 9 months ago. Not sure what it was before then. She meant you have to order from a waitress now. Instead of how it used to be. Kinda dumb considering people only come here for one thing fried chicken. We ordered our sandwiches 5-10 min before this guy who was also sitting at the bar and he got his sandwich first. I don't like the way the employee said that to me. My meal was about $10. She could have let a couple paying customer eat our meal real quick and watch the game happily but no she was upset because she wouldn't have gotten her $2 tip. By the way the restaurant was practically empty. <br><br>Also the biscuits were dry and simply just not good.", "pics": null}}, {"review": {"des": "Superb chicken sandwich! I ordered the Nashville hot with cucumber slaw and it was great. The slaw added a nice tang. The Mac and cheese was pretty average and the chips were forgettable. Next time I would just get the sandwich.", "pics": null}}, {"review": {"des": "Its so good. Chicken so good make you want to slap your mama. Had the Nashville Hot it was great and they had Goose Island stouts. Wow. Tried it with some mac and cheese with greens beens. I even liked their water lol. Great place try it NOW", "pics": null}}, {"review": {"des": "Nashville hot chickens were super good but it got a little overwhelming towards the end of the meal - lots of flavor and the heat would set your mouth on fire. <br><br>The original in my opinion is even better!", "pics": null}}, {"review": {"des": "A little pricey, but absolutely worth the flavors.<br><br>I took a friend here for his birthday (seems like I only go to restaurants for special occasions) around 2:30 pm on a Friday afternoon. We didn't have to wait to order and the most of the window seats (the only seats, if I remember) were available. I can imagine this place being packed during more regular lunch hours.<br><br>We both had the spicy chicken sandwich on their bun and got the cole slaw, mac n cheese, green beans, and peach cobbler a la mode. EVERYTHING WAS DELICIOUS. I love everything spicy, and the chicken was the perfect level of spice and I'm not sure if I'm imagining it, but the bun has a nice slightly sweet flavor to it. Mac n cheese and green beans are amazing. I do not like coleslaw, but this was fantastic. Pay the extra to get the ice cream with the cobbler.<br><br>I don't have a wide knowledge of fried chicken places, but of the places I do know, Roost is up there with Parson's.<br><br>GO HERE.", "pics": null}}, {"review": {"des": "Wonderful chicken and sides. We have tried the 1/2 chicken and chicken sandwich meals. The mac and cheese side is recommended. They have a dining area, but we've just gotten take out so far. Reasonable prices for the quality of the food. Located on Irving Park road.", "pics": null}}, {"review": {"des": "This place is truly the worst... FOR DIETS!!! because I'm on one right now and it sucks because I get these unreasonable urges to get 20 of these chicken sandwiches for myself.<br><br>I don't really have anything else to say besides these chicken sandwiches are really what (my) dreams are made of.", "pics": null}}, {"review": {"des": "This place was really really good. I loved the homemade biscuits with honey. I tried the spicy chicken sandwich, which was most and tender. The mac and cheese was good, but not on my stellar radar. The service was great, and their lemonade was delish. I would highly recommend that you check this place out when you are in the area.", "pics": null}}, {"review": {"des": "Cock-a-doodle-do, it's time to rise and shine and come get yourself some delicious home-style chicken and biscuits.  Yes, The Roost Carolina Kitchen is nestled in the heart of Chicago, but it'll make you think that you've landed yourself on a farm where the red fern grows and where there's some chicken waiting for you when you get home.  That's a little descriptive, I get that, but that's the type of vibe I got from this restaurant - I quite liked this vibe too.  It was a small, quaint restaurant, but with some big flavor!  <br><br>My fiancé and I actually split the fried chicken sandwich (on a biscuit, of course), along with a side of macaroni and cheese and the bread pudding for dessert.  The chicken sandwich was amazing; I had heard my co-workers raving about this chicken sandwich, and they've said that it was the best they've ever had.  I must agree - this chicken sandwich ranked pretty high up there with all the rest of chicken sandwiches I've had...which I honestly don't think is THAT many.  Either way, this sandwich was the bomb, particularly because the chicken was meaty and juicy - it pulled apart as you bit into it.  It was clearly cooked to perfection.  The macaroni and cheese was also worthy of some acclaim - I'm not the macaroni aficionado, but I can appreciate a good one here and there.  Lastly, the bread pudding was good, but almost tasted more like a sweetened version of corn bread (as if that isn't already sweet).  <br><br>Since I do work just a few minutes away, I am seriously contemplating the decision to come back and get my hands on some of their chicken tenders.  As much as I like chicken sandwiches, I just LOVE chicken tenders...I know they're pretty much the same thing, but I have a soft spot for tenders and I can only imagine theirs are good.  Since I ordered the sandwich without spice, I may even be daring and get some spicy tenders!  I'm such a daredevil, I know.  On a side note, there are three different sauces you can choose from: mild, moderate and spicy (though they're called different things).<br><br>Now, be mindful of this: because The Roost is so tiny inside, and because it is so very good it gets extremely busy during the typical lunch hour.  I've been told by my co-workers that this place can sometimes have lines wrapped around the corner.  Do yourself a favor and go during non-peak hours - your wait will be longer, service is less rushed and that almost always coincides with better quality of food, and it's simply more peaceful this way.  Another positive - if I am correct (and didn't neglect any possible signs outside the storefront) there is free street parking directly in front of this store.  That's a bonus if I ever knew of one.<br><br>Two more things: the service is great - very friendly and efficient.  And on a weird note, the bathroom floors are super slippery for some reason so do be careful in there.  Just make sure you slip and slide your way back out to your delectable sandwich!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hR_tsEQzatPQEIaeDacN1g/168s.jpg", "caption": "Bread pudding"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/myrbM7s2wiwftpaNAAMvYA/168s.jpg", "caption": "Fried Chicken sandwich (original sauce) with Mac n cheese"}]}}, {"review": {"des": "Three of us dropped in for lunch midweek. The cutest place, original wood floors from ages ago and a feast for the eyes seeing all the re-purposed wood used for tabletops as well as an assortment of chairs. Some real craftsmanship in all the woodwork.<br>   Since we all had the same sandwich - the solo on a broiche bun with the three toppings and no sides - can't comment on the other items on the menu. We all agreed that the super crispy chicken with the three toppings was ONE OF THE BEST EVER for such a concoction and holds its own against Budlong's famous creation. Yep, really delicious!<br>Super charming waitress, quick and efficient and a delicious warm chocolate bread pudding for dessert. Life is good!<br>CB", "pics": null}}, {"review": {"des": "It took waaaay to long for some chicken and macoroni to be ready.  like waaaay to long. Really don't care what it taste like if I gotta wait.", "pics": null}}, {"review": {"des": "I had the original chicken sandwich and the chicken tenders.  It was delicious. The Mac and cheese was the best I ever had. This place is the real deal. You must try it.", "pics": null}}, {"review": {"des": "Amazing flavors! I got green beans, Mac and cheese, and a biscuit hot chicken. I'd get the brioche next time only because the chicken was bigger than the biscuit so I counter really take even bites I ended up using a fork and knife which I wasn't wanting. Great southern style sweet tea! Straight from a cold cooler! It's amazing tea.. trust me I'm from Nashville!", "pics": null}}, {"review": {"des": "The hot chicken sandwich knocks it out of the park every time for me though I wish I could get a tiny bit more bang for my buck at this place. Mac and cheese could use a little kick though it's definitely homey and rich. The ambiance is charming as was the service.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/o6doDXRgwl1q7xGpYxEEKQ/348s.jpg", "caption": "Hot chicken on brioche, Mac and green beans"}]}}, {"review": {"des": "Definitely different taste than I had expected. Quite a bit salty for the fried chicken. I would expect it to be better than Chic fil-A but...Coleslaw wasnt bad, Mac and cheese wasnt my favorite.  I understand that running a restaurant is hard work. Maybe I dont like too much saltish foods.", "pics": null}}, {"review": {"des": "I dig this place. Nice concept, cute decor, decent prices and really good food. Three of us got chicken sandwiches and one for the chicken dinner. The food did take about 15-20 minutes to come out after we placed the order but it stayed so hot for the duration of the meal that I almost thought the smoke was simulated because of was floating out of the sandwich in a way that could only be done by a Hollywood special effects master, so you can't really complain about the wait when your food is *that* hot. Plus they have a board with the expected wait time clearly displayed so you know what you're getting into.<br><br>The person who got the chicken dinner said the chicken was fried just a little too hard for her liking but she still said it was good, just wasn't as wowed as she otherwise might have been. One of the original chicken sandwich takers said her sandwich was a tad bit spicier than she was expected so that altered her opinion some but she still enjoyed it. So from the two people who didn't like something their takeaway was still \"good.\"<br><br>The other person who got the original sandwich really enjoyed it with no complaints. I got the spicy on a biscuit. OMG. This was the best biscuit I have ever had in my life. I wanted to sit on the floor in the corner of a dark room so I could be alone with my biscuit. I have never had a biscuit that good. The only bad thing is that it was a bit too perfect for the sandwich and couldn't support the fillings. I don't like messy so I was somewhat taken aback, but if they altered the makeup of the biscuit in any way it would ruin its perfection so my suggestion would be just to eat with with a knife and fork. Problem solved.<br><br>I only have two unfavorable things to say. 1) If the chips are made in house, I would have preferred if they were hot, as they were on the colder side of room temperature. Still good, still ate it, but it would have been a nice touch. And 2) I would suggest adding one more vegetable option to them menu. Maybe fried okra or braised greens or something like that? We had two diabetics in our group and while we expected and respected the authenticity of the menu, the sides were very carb heavy and it would have been nice to have another vegetable option, especially if you are getting a sandwich. We ended up taking the mac and cheese home to eat later because of this (it was fantastic though!!).<br><br>I rate restaurants by if I would come back period, and if I would travel to come back and my answer to both is yes!<br><br>P.S. This is the only place I have been to in my entire life in Chicago that has has 1) direct heat, 2) for people at the window seats and people sitting in the path of the door, which also significantly added to my experience here. Thank you for that!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rZnHTObKLrsCz9B9W2MgfQ/348s.jpg", "caption": "Half chicken dinner"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rTp6FIaU8bkUR84JKvfNBQ/168s.jpg", "caption": "Original Chicken Sandwich on Brioche"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ijdTyPfdiNdJnnp6ABcvSg/168s.jpg", "caption": "Spicy Chicken Sandwich on biscuit perfection"}]}}, {"review": {"des": "I've been to The Roost at 1467 Irving several times due to there tasty food and their amazing staff. I highly recommend The Roost!  This place is taking over Chicago with there chicken and awesome staff service.  I normally try to grab a seat at the bar which is an awesome feature and let Anthony or Heather choose something new for me to try and I have never been disappointed. I love the fact that the staff is so friendly and fun. I have even brought some of my clients to The Roost for drinks and meetings and now they continue to go there too. Their food is great, their staff is amazing!", "pics": null}}, {"review": {"des": "I really wanted to like this place. My girlfriend and I dined in the restaurant last year after graving some Nashville hot chicken, and we really found their food appetizing. It's spicy, but not stomach-churning spicy. We left the restaurant on a positive note. We thought that this would be a business we would frequent.<br>Fast forward to a few weeks after that first visit, around July. Arriving home late we decided to order in and have Roost delivered. Now, for deliveries I typically give businesses an extra 15 minutes to their estimated delivery time. The food came in a little over that, but still not a big issue. Again, I can't stress enough that the food is delicious, especially their Nashville spice. Anyway, the first delivery was fine. I'm not going to complain over a 20 minute delay (15 that I allotted and the 5 that the delivery rang my door). So we order for delivery again a few weeks later. Again, it was over the ETA, but by only 5-10 minutes. <br>The trouble started during our last two orders. Our third order was over 30-35 minutes over. I call,  the person from Roost who answered was very polite, and informed me that the delivery person was on it's way. It eventually came a few minutes after I called. On our last order, though, the food was around 2 hours late. So we ordered for delivery around 1830 (630 PM), an hour pass with nothing. So I give them my 15 minute grace period. After I extended that grace period to 30 minutes extra I call them. The woman who answered informed me that there was an issue, and our order is just being prepared, and would get it to us ASAP. I said that they have 30 minutes, Roost retorted that they'll try. I also contacted Grubhub about this, and they can only offer me a discount and a refund. I accepted Roost's explanation, and figured it's already too late to find discuss other dinner options since it was already 2000 (800 PM). So my girlfriend and I wait. Now she's getting \"hangry\". I'm feeling dumb for suggesting delivery, and also getting \"hangry\".  Thirty minutes pass with still nothing, like an idiot, I give them another 10. A total 40 minutes pass with nothing. I contact Roost again. Again they said delivery is on it's way, and that it will be here in the next 10. It wasn't. We ended up waiting for about 55 minutes to from when I first told them about the issue to the food passing through our front door. Around a 2 hour delay. <br>We didn't bother to scream at Roost as we were too hungry to start yelling and berating them. You can't really yell when you're shoving food down your own gullet. We just gave them a one star rating on Grubhub. My girlfriend and I promised to never order delivery from Roost again. So lesson for me, It would have been quicker to walk to Roost (2.2 miles), pick up the food, and come back. Haven't eaten there since. Which sucks.", "pics": null}}, {"review": {"des": "Being from Florida, I constantly brag about the abundance of Chic-Fil-A locations that are available for me to get a Spicy Chicken Sandwich I'm always craving. To one-up me during a Chicago visit to the BF, BF brought home a Spicy Chicken Sandwich from The Roost - mind & taste buds BLOWN. <br><br>The Roost's sandwiches are HUGE! I didn't want mine to end. I'm still thinking about how flavorful & juicy my spicy chicken sandwich was back home in FL & wish we had a location down here. Okay, okay, I'll admit The Roost's sandwiches are better than Chic-Fil-A's. Happy, Chicago??", "pics": null}}, {"review": {"des": "This is the greatest chicken sandwich money can buy. I would eat this for my last meal in earth. I like things spicy but Nashville hot is slightly too hot for me. I get the regular hot sandwich with an extra biscuit and bread pudding. I wish it was a little bigger but oh well. Much better to eat there as opposed to delivery. 5 stars are not enough.", "pics": null}}, {"review": {"des": "Big fan of this place! <br><br>Must-go if you're in the area!", "pics": null}}, {"review": {"des": "This place is dyn-o-mite! They are often really busy, so come prepared to wait and bring a deck of cards. Free refills on Sweet Tea and lemonade and go for the biscuit side as its so freakin good. And pick a cobbler or Bread pudding as your 2nd side. Totally worth it. <br><br>Really friendly staff and kitchen folks but a bear parking on Irving. I guarantee if you order delivery, the wait will be long, but so worth it, so order more than you will eat.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_O405-YV9wKiQt14SvqmIw/348s.jpg", "caption": "Kevin here delivers chicken with the biggest backpack!"}]}}, {"review": {"des": "First off maybe more like 4.5 stars. <br><br>We ordered to take home and did not order in advance it took about 20 minutes to get our food this was around lunch time on a sat afternoon so advice call in your order. We had a original and a spicy chicken sandwich   even the original has just a little bit of heat to it, not to much though my  daughter  still loved her chicken tender which was big and at $2.75 each a fair price. The sandwich was good size and very tasty the spicy had a perfect heat not to hot but made your mouth burn just the right amount. Super crispy chicken with a lot of flavor. Sides we had are good portions and interesting  Mac and cheese was a big order and one side was enough for 2, same with chips nice and crispy and enough to have a chip or 2 with each bite of your sandwich. We ordered all the toppings on the side slaw,pickles and ranch so it would not get soggy on way home. Seems they ready for this  as everything came in its  own little cup. We also had slaw and a biscuit as side  slaw is good lots of celery seed light dressing no mayo perfect to put on sandwich. Biscuit was great looks kinda like a bisquick drop biscuit but so good crispy butter bottom and a good size. You can get one tender side for $2.75 and make yourself a whole other sandwich with the biscuit. Great place fair price for what ya get we spent 26 bucks for 2 meal sandwiches that came with 2 sides each and one tender. I don't have to drive to Carolina anymore for some tasty chicken :)", "pics": null}}, {"review": {"des": "Smaller place, order at the counter, 2 registers to speed the line up. Simple menu, not many options, not in a hurry. Sign says \"we aren't fast food, we make good food as fast as we can\" but not intolerably slow at all. <br><br>After tax was $11.18 for 3 piece tender with 2 sides, and a water.<br><br>3 pieces of chicken were good size, mac n cheese was good and was a generous portion, the slaw was ok, also came with a good dipping sauce. <br><br>I ordered the chicken \"Nashville hot\" and is came out wetter (more sauce) than what I associate with  Nashville hot chicken. But not dripping like a hot wing. Seasons was a little thick and left a powdery taste/feel on some bites, but the chicken itself was moist and fried only when ordered.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fdloIDuRthUGNLRakm5rcA/168s.jpg", "caption": "Nashville hot chicken"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eiTEh4P9hYlDfW_xfJ3d1A/168s.jpg", "caption": "3 piece meal"}]}}, {"review": {"des": "I discovered this place about two months ago waiting for a haircut. It's become one of my go to places. Great drinks and food. I love to sit at the bar, have a Bloody Mary and chicken sandwich with sides of Mac & cheese and peach cobbler. I've brought multiple friends and all have been pleased. Fun decor and friendly staff.", "pics": null}}, {"review": {"des": "This place is the real deal for true Southern Fried Chicken. I grew up in the south and I know good chicken, and this is good chicken! Sides and Biscuits are great also. I highly reccomend.", "pics": null}}, {"review": {"des": "Best chicken tenders I have ever eaten! All the food I've had here is delicious & made to order fresh. Friendly staff too!", "pics": null}}, {"review": {"des": "Let me just put it this way- I felt very, very sad as I was finishing my meal. <br><br>But that was because it was some of the best tasting food I had ever had, and I live three hours away and have no idea the next time (or if ever) I will be back. I am jealous of all the locals who have this gem in their midst every day. <br><br>Don't hesitate. Just eat here.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/l3XB0udR8gpSmX8OjZPqwQ/348s.jpg", "caption": "Small dining room with plenty of seating. You order first, then sit. Seems like most of their business is takeout/delivery."}]}}, {"review": {"des": "The Roost Chicken Kitchen was very disappointing to me based 367 reviews at 4 1/2 stars I went there.  Maybe my expectations were much higher based on the reviews.  The photos of the chicken looked delicious, but the pictures looked better then the actual product.  It was incredibly greasy.  They served it over white bread and it was saturated with grease.  The paper underneath the bread was also saturated with oil<br>I got the Nashville hot chicken and it was spicy.  It was very tender, but also very greasy (I will pay for eating this later). The biscuits that everyone raves about was just a biscuit.  Very dry and not much flavor.  The Mac & cheese was cheesy, but once again not much flavor.  <br><br>Overall I would probably give this restaurant only 2 1/2 stars.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qHcdnRjlD8t1hWIKoO5s8A/348s.jpg", "caption": "Mac & Cheese - very average"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mWp72xV2tTuGsG7dtT8dzA/168s.jpg", "caption": "Spicy Nashville chicken - very greasy, tender served hot and freshly cooked"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RXd9ICmbfuOuDl9yvaTPLg/168s.jpg", "caption": "Inside The Chicken Roost Kitchen"}]}}, {"review": {"des": "THE ROOST ADDED A BAR! Yes you heard me right, you can now get a bad ass fried chicken sandwich, mac n cheese, and that TASTY peach cobbler all WITH A COCKTAIL. I don't even remember Parson's at this point. I highly recommend the \"Mommy's lemonade\". Beautiful summer cocktail and just light enough to pair with your delicious southern meal. The esthetic of the entire new section is gorgeous; new wood tables, beautiful bar, and to top it all off, boozy shakes!<br><br>The wait staff was kind and courteous, always checking up and thats a lot to say when they've been working with a brand new bar and getting kinks out. <br><br>I don't even live in the area and my boyfriend and I have already made several plans to come back. If I lived next to here I'd be in here with a cocktail and some chicken just about every day.", "pics": null}}, {"review": {"des": "Definitely not bad chicken but awful service. Went in there a few days ago and ordered my food online picked it up and planned to eat there. When I sat down to eat one of the ladys told me that they were saving the tables for people coming in and ordering food. It wouldnt have been a problem if it was busy but there was only 2 other people and plenty of tables open. Seriously irritated after spending $15 and basically getting kicked out. Last time im ever eating at this place.", "pics": null}}, {"review": {"des": "So good!! I went on two separate occasions for lunch. On my first visit I got the Nashville hot chicken sandwich on a biscuit with pickles, no sides. The sandwich is really filling by itself. The biscuit was really crumbly which made this more of a fork and knife situation. The Nashville hot chicken is so good. Really spicy and delicious. I also got a half lemonade, half unsweetened tea and it was perfect. On my second visit I got the spicy chicken tenders, a side of the house made chips, side of pickles, and a lemonade. The lemonade is perfectly sweetened. I'm not a fan of overly sweet drinks. The tenders were delicious but not very spicy so if you are looking to kick things up a notch definitely go with the Nashville hot. My husband had the quarter chicken on the first visit and the half chicken on the second visit and really enjoyed it both times. The spice on the Nashville hot seems to vary a bit since the second visit he was literally sweating and had a few tears but he loved every bite. Wait times on the food can be a little bit long because everything is made to order from scratch. You can order online and pick it up to dine in or carry out which is the best way to avoid sitting and waiting for a while. I will definitely be back on my next visit to Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zdWWo_0L2A1fy4E3GqZHyA/348s.jpg", "caption": "Spicy tenders, lemonade, side of chips"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EJ9tZdmdk3jLDMhO7Tv4LA/168s.jpg", "caption": "Nashville hot quarter chicken"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xgOpM8FP5DND3fP5fe7T9g/168s.jpg", "caption": "Nashville hot chicken sandwich on biscuit"}]}}, {"review": {"des": "The Roost, the Roost, the Roost is on FIRE!<br><br>Delicious, BYOB so take advantage of that, would recommend a biscuit sandwich with a mac and cheese side and peach cobbler dessert. If you eat the bread pudding you will be chilling for daaaays. It's v dense and v intense.", "pics": null}}]}