{"name": "the-violet-hour-chicago", "reviews": [{"review": {"des": "I've had The Violet Hour on my list of must-try bars since before I moved to Chicago. Only problem was that I live in Lincoln Park, and Wicker feels like a great unknown land to those of us on the northside. Are there young people there? Is the food good? Better just stick with the places we can access from the brown line. <br><br>Anyways, my boyfriend and I decided to have a night out in Wicker Park because we're, like, so totally adventurous. We came here around 7 on a Saturday and were seated right away. And immediately blown away. <br><br>The atmosphere is exactly what I'd expected - classy, upscale but still young, and candlelit. There was water waiting on the table and the server came over right away to explain the menu. It's divided between shaken and stirred cocktails, with the safest ones at the top and the stranger, stronger ones at the bottom. I don't remember the names of either of our drinks, but mine was safe and fruity and his was an uncommon mix of tequila and Japanese spices. Both were excellent. <br><br>I wish we could have stayed longer and tried more drinks, but we were off to catch a comedy show. I would be back here all the time if I lived in Wicker. Actually, even though we don't, my boyfriend is still talking about all the people he wants to bring by, and even mentioned this place for New Year's Eve or for a mixology class. Violet Hour definitely lived up to the speakeasy hype, and I'm glad to finally have checked it out!", "pics": null}}, {"review": {"des": "COME HERE ON SUNDAY NIGHT! No lines and lots of empty booths. The bar is a speakeasy, meaning that doors aren't labeled (the outside gets repainted fairly often too!) and the drinks are phenomenal. The menu rotates frequently and is dependent on season. Take note that these cocktails are B O O Z Y to the extreme. I ordered two mezcal drinks, one from the shaken side of the menu and one from the stirred, and was very satisfied. They are nothing short of delicious!<br><br>I would give Violet Hour 5 stars if it wasn't for a few minor mishaps. The chair that I sat in had teared creases and it hurt for me to place my arms down. I quickly realized I was sitting in the only chair in the room that was that run down. Unfortunate, but nothing too bothersome. Our waiter also never introduced himself, which was a bit odd. Overall, though, excellent place for a date... JUST PUT AWAY YOUR PHONE! :)", "pics": null}}, {"review": {"des": "Came here with a group of 8 on Saturday Night. We arrived around 7:15, and there was already a line formed! We were told there was a wedding reception being held there so that's probably the cause of the long wait, but I'm sure there is typically a wait at that time anyway.<br><br>To start, the service was great! From the man checking IDs outside, to the hostess, to our server they are extremely friendly, accommodating, and exemplify what customer service should be!<br><br>Once we got in, we were seated in a back room near the fireplace. It was super cute, very nicely decorated, and had a cozy and romantic ambiance. I LOVED the high back chairs. The noice level was perfect -- no loud booming music requiring you to scream to your friends, but not utter silence where you have to keep your voice down.<br><br>I started off with The Etiquette. It was extremely refreshing and bubbly. Light, with the perfect sweetness to it. I think of it like a fancy spritzer, but better.<br><br>I then had Asta's Square. This one was sweeter, but by no means was it too sweet. I would highly recommend this one for people who don't like the taste of alcohol, because you honestly can't taste anything at all.<br><br>We had an order of fries to share with the table. It was perfectly crispy and the garlic aioli was so, so good!<br><br>TL;DR -- Worth the wait. Just do it.", "pics": null}}, {"review": {"des": "Loving the drinking scene in Chicago! Our friend recommended this speakeasy bar to us. We came here after a disappointing meal at Alinea in hopes to wash the food out of our mouth with something good. <br><br>The Violet Hour didn't disappoint! There's no sign, but it's located in front of a graffiti art door which is camouflage. Once entered, totally different vibe from the street- it was dark and quiet. We were seated immediately (Monday around 7pm) and got a cool long chair seat. The place is big, but only can be seated at the chairs or bar. We ordered some cocktails. My cocktail was good but a bit sweet for me. My BF had them whip up something that we came by in Prague and it was delicious. Good bartenders- they do know how to make craft cocktails.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nSNsrvs5ONUKpj5k4saZGA/168s.jpg", "caption": "Cocktails"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iWck2yQIezjK9HSCJ3YY7Q/168s.jpg", "caption": "Cocktail"}]}}, {"review": {"des": "Our favorite cocktail/speakeasy bar! Get there early on a weekend evening (line starts forming at 5:45 for a 6pm opening, most seats are taken around 7 or so) to snag seats. Dress code ranges from casual to dressy. The entrance is a hidden door within a large mural, across from Big Star.<br><br>My go-to drink is the Juliet and Romeo (it's not listed on the menu but is a classic, a herbal gin-based drink). Hubby thinks they have the best old-fashions ever. Perfect date night pre-dinner drinks place - a must every time we return to Chicago!", "pics": null}}, {"review": {"des": "I found violet hour to be slightly above average at best. I wouldn't dare brave a wait in line in a Chicago winter for these drinks. With that said the drinks are quite tasty but to say I was impressed would be an out right lie. The pomme frites were pretty good as well & a great value for $8. There's a extensive spirit list in addition to the seasonal cocktails & I'm under the impression that they can replicate anything you can think of.  The interior is extremely dim & you'll have to read the menu by mere candlelight. Our first drinks of choice were a classic sazerac as well as a classic manhattan followed by a black manhattan & I honestly can't remember the name of 2nd sazerac. All the drinks has a good balance to them & packed a decent punch. The bathrooms were extremely cleans & even provided luxury hand soap & lotion.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/aljUosNg6QFyDVPToP0_Og/168s.jpg", "caption": "Sazerac on the left & manhattan on the right"}]}}, {"review": {"des": "Despite this being an acclaimed date spot, I've always visited with groups of friends. Last Thursday night was no exception, and even though it wasn't the weekend we still had to wait ~15 minutes to get in. But judging from the 2000+ reviews, you already knew this was a popular spot. <br>One thing not often highlighted is how it works - it's not set up like your typical bar where people might stand around and mingle. You enter with your party and are shown to your seat - whether it be at a table or at the bar. Which is why it's probably more fitting to call it a cocktail lounge. A dimly lit, sexy interior and cool music set the vibes. Service is always fantastic, and cocktails boozy but delicious. <br>The Violet Hour is definitely a mainstay in Chicago, and I hope it continues to be for years to come.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XoBoqJ0_o2hMpmoQtVgnqQ/348s.jpg", "caption": "Lemur's Tail"}]}}, {"review": {"des": "Quite simply some of the finest cocktails you're likely to encounter anywhere.  The hushed atmosphere might lead you to believe that this an uptight, pretentious place, but the bartenders could not have been any friendlier.  The process of finding the door on the outside is a fun little adventure, the no cell phones inside the lounge policy is a nice break from the norm and forces you to really consider what you're drinking since there's not a screen to distract you.  I tried to squeeze as many experiences into my Chicago trip as possible, and this may have very well been the best of all.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rw9pV_LtO7pqYvvmM5w0dg/348s.jpg", "caption": "All of these rules are good rules, especially the \"No Budweiser\" one."}]}}, {"review": {"des": "This was our first stop in Chicago and it didn't disappoint. Secret bars are awesome and we knew when we heard about this one, we needed to check it out. Luckily it was right off our train stop.<br><br>Given that it is a secret bar, be careful or you'll miss it. There's a wall mural with a door that blends in so easy you'd never know. Just looks like you're passing by some Chicago art mural. <br><br>So when walking in, it's very dark. That contributes to the intimate speakeasy you're about to experience. We were guided to a lovely corner booth with a plentiful menu. So many delicious sounding cocktails. I went with the heartbreaker and it was just what I hoped for by the description...fruity, a little tart, and super refreshing. <br><br>The staff was so friendly and helpful as well. It's very small and quiet but the vibe was excellent.<br><br>It's a definite must find. Be careful not to miss it.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7dhp-CftT4509OG5wJ_bFw/168s.jpg", "caption": "Absinthe"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6NGEaY3d0PQX_PG8BVqPLQ/168s.jpg", "caption": "The heartbreaker"}]}}, {"review": {"des": "Came here with a group of friends on a Friday night around 7. Luckily there was no line and we were seated immediately. Oh and make sure to bring your I.D because they check it at the door. <br><br>Walking in you are greeted by almost a complete darkness! They sat us in a corner booth with a few candles that provided dim lighting. The atmosphere here would be great for a first date because of how intimate it is, or just a night out with some friends. There were people around us but none close enough to were we could hear their conversations and vice versa. Also, there was some cool music playing in the background which was a nice touch to the atmosphere.<br><br>I ordered the \"Scho-ka-kola\" cocktail and was pretty amazed at how great it was! All of the flavors just worked together! The cocktails here are pretty strong so take it slow!", "pics": null}}, {"review": {"des": "You will probably find a line forming behind the hidden door in the mural to get into The Violet Hour. You will definitely want to wait instead of going somewhere else; it is definitely worth the wait!<br><br>The atmosphere is very intimate. The lighting is dim and it isn't very noisy. It's a great place to go for a date or somewhere where you want to enjoy a nice conversation with your friends, while enjoying a delicious cocktail. The <br><br>I always prefer to sit at the bar. The bartenders here are expert mixologists and I always enjoy my conversations with them! They are very knowledgeable and I tend to learn something new everything I go. I have never been disappointed by any of the cocktails that I have ordered! The Violet Hour ranks among the top bars that I have ever been to across the country.", "pics": null}}, {"review": {"des": "This place is the perfect date night spot. We went on a Monday night after dinner at big star (directly across). We were greeted by a bouncer who told us to wait a few minutes before entering. We were then taken to our table. The seats are super comfy. The entrance is a door with a huge mural painted on the wall. Our drinks were really good. My friend got an old fashion and said it was one of the best ones he has ever had. I would consider him some what of an old fashion snob so that meant a lot coming from him. Definitely try this place for a date night or just to hang out with friends.", "pics": null}}, {"review": {"des": "Checked out this place with some friends while visiting. Excellent cocktails and bar snacks. This is a great place for a date or for people who are in town visiting. <br><br>We shared some absinthe and also ordered a few cocktails as well as some food. Both the fries and the chickpeas were super crispy and delicious. Perfect salty snacks to go with the cocktails. <br><br>They have a lot of rules like only serving one drink at a time, no cell use in the lounge, and appropriate dress required. If you go to the bathroom there's a list of the rules posted.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iybYiq_7NljjPInzNKJFoQ/348s.jpg", "caption": "Mural outside"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LoIpoBzwxf6Sbfe_PID5zg/168s.jpg", "caption": "Bee humble"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Yyx31iM8tKWVoa8BnSw7hw/168s.jpg", "caption": "Witch departed"}]}}, {"review": {"des": "Hands down, I had the best cocktail of my life here - more specifically, it was a gin cocktail called \"Find Myself Careening\". Just wow. It was just such a complex drink, it's not possible to distinguish what is it in it. All I know is that the flavors work together. The drink is served on the rocks (not a martini) with a big piece of grapefruit peel in the glass, so every time you take a sip you also smell the essential oils from the peel, which complement the drink. I had two of those and they were definitely strong. <br><br>Not to mention, the spot is absolutely beautiful and perfect for a date night or a girls night out. It's very, very dark inside, with just a small candle on each table. They actually have \"house rules\", one of which asks that cell phones not be used inside the lounge. I mean, can you imagine how annoying it would be to have cell phones light up throughout the night in a nearly pitch black space? I like this rule. <br><br>I am already planning my return visit.", "pics": null}}, {"review": {"des": "Hard to find, there is no sign on the door.  Spent 10 minutes walking around the block looking for the place.  Good thing my friends were inside giving me step by step instructions.  When I got to the door, I was denied entry.  Apparently there is a dress code.  No hats, nice footwear.<br><br>It's chicago fam.  In late November.  28 and flurries I'm for sure bringing my redwings and wool knit cap my wife made me in 98.<br><br>Bouncer was polite about it though, he handed me a laminated card with the rules.<br><br>Two stars because of cordial denial.", "pics": null}}, {"review": {"des": "Ever walk into a place and was almost certain that you were falling into a vortex and would end up on the other side of he universe? <br><br>Yeah I kind of felt like that walking in here, especially considering I didn't even know this was actually a place, as MANY times as I've walked by. A friend knew I'm a huge foodie and appreciate GOOD drinks, took me here after being shocked that I'd never been.<br><br>Yes, the entrance waiting to get in feels very time portal/exclusive/secretish.... like you're probably supposed to give a secret password or phrase to even get access. After waiting for about 30 mins, we finally got seating.<br><br>Thick, heavy green curtains, cozy seating, minimal light, candles - you totally feel cut off from the world. In fact, it's what they encourage; they want you to detach from the outside which includes your phone.<br><br>I had to try an Old Fashioned of course - PERFECT and I also had \"Truth Be Told.\" Talk about potent!!!!! Those bartenders know their craft! <br><br>The waffle fries - look, idk what's in that dip but I almost wanted to sneak into the kitchen and steal the whole bucket!!!! <br><br>This place is a MUST TRY!!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/P23p37zU8DC5uIXz_Y_I1w/348s.jpg", "caption": "Truth Be Told.... dark pic.... but delicious and potent"}]}}, {"review": {"des": "The Violet Hour is a perfect place for a date or perhaps a couple of girlfriends going out. The vibe is buzzing with energy, but its definitely a place for a more intimate date. There are several rooms divided by long dark velvet curtains and large wing-back chairs and small tables are scattered throughout the room in groups of two. There is also a large bar in the first main room with stools. The room is lit with candles and has soft music playing. <br><br>The drinks are very strong. If you do not like the taste of alcohol this is not the place for you. The cocktail menu seems to be constantly changing so the drinks I had arent on the menu anymore. Be assured that every one that i tried was very good. We ordered 6 different cocktails between me and my friend, and I tried them all. The food was good, but pricey. I would probably just eat before you come. Overall I would say this place isnt for everyone, but it is a place I would love to go again.", "pics": null}}, {"review": {"des": "Came here on a Thursday night around 7:30 with a friend and got seated immediately. I've been here on a Saturday night and had to wait outside in the freezing cold for about a half hour. If you want to come here on a weekend, highly suggest coming early to get a seat. <br><br>That being said, great cocktails and very attentive and friendly staff. Some of the drinks are very complex so I asked about the ingredients, and the server was very thorough in explaining what was in each drink. I also asked for a recommendation for my second drink and was very happy with what they brought out! We also tried the frittas which was a great snack with the cocktails. Overall, great drinks, staff, and ambiance. Perfect place for a date night or to catch up with friends in an intimate setting.", "pics": null}}, {"review": {"des": "Yessss, where can u take a date this speakeasy is the place. Want a great cocktail this is the place, want intimacy this is the place. What an experience.", "pics": null}}, {"review": {"des": "Came here thanks to finding it through none other than my yelp community. The wall looks just like a mural and I love how hidden it is. People were just walking right past the man by the \"mural\" until they saw us standing there, and then a lined began forming. There was a slight 10-15 min wait but they found us a spot at the bar. I loved everything about this place. The lighting was so sexy and mysterious and the seating so nice and intimate. There wasn't one spot I would have not enjoyed. <br><br>We had ate prior to coming here so this was purely a sip and talk kinda date, which was amazing.  The bartenders were on fire, literally lighting drink on fire and teaching us about the different types of drinks. Superb service and they even gave us some other place to try out since we were interested in a rooftop bar. <br><br>This is definitely a nice spot to come enjoy when in Chicago.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AntzX__WdkFzv1p2ba_Opg/348s.jpg", "caption": "Mural- but it changes so don't rely on this photo"}]}}, {"review": {"des": "This hidden gem (literally) was super gorgeous and classy and intimate with dimmed lights, thick velvet curtains, and tall wing back chairs.  Perfect for date night. The drinks were amazing and the bartenders were all so nice. I think they often update their drink menus. I don't even remember what I got but all I know is that it was good. Definitely check out this place if you're in the wicker park area", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HSCwhKTyYrfDfpbRgAKdYg/348s.jpg", "caption": "Can't even remember what these drinks were called but they were good"}]}}, {"review": {"des": "Every now and again when it comes to writing a review, you hit a crossroad. Do I give a good one and risk the place getting busy or give a bad one so it stays easy to get into. I hit that crossroad with TVH. Then I remembered, I don't live in Chicago so I don't care!<br><br>I loved everything about this place.<br><br>The staff. Check <br>The decor. Check<br>The drinks. Check<br><br>When it was explained as an intimate venue with lots of areas and only lit by candle light, I was skeptical. It's only when you get inside does it make sense.<br><br>My only add would be to grab food at Big Star Tacos before and get there around opening as it can get pretty busy.", "pics": null}}, {"review": {"des": "The atmosphere here is absolutely incredible! The decor is beautiful, the music was great, and the ambiance is so fun. It's also fun that it's so hidden! It's a really subtle door on a mural wall. It's honestly worth it go at least once for the experience, even though we weren't amazed by the food or drinks. <br><br>To drink, we ordered the fruit and brandy punch (which serves ~6 people). It was ok but had a strong alcohol and artifical-ish fruit aftertaste. My friend and I also tried a cocktail with egg yolk, rum, and pineapple. It was ok but wasn't particularly flavorful of pineapple or the other included flavors. The texture was also a little strange and changed throughout the drinking of the cocktail. <br><br>To eat, we got the fries and the spinach dip. The fries were really good, and we loved the aioli that came with them. However, we were pretty disappointed by the spinach dip. It ended up being four slices of a baguette with cold dip spread on top. The cold temperature of the dip was off-putting, and none of us were big on the flavor of the dip either. <br><br>Overall, I would still go back for the amazing atmosphere but will probably look more into what to order before I go next time!", "pics": null}}, {"review": {"des": "If you are lucky enough to figure out where it is, you are in for a treat.  It is dark.  But it should be.  The staff is very cool and they really know their cocktails.  The food was pretty good.  But I wasn't there for the food.  I have been to quite a few craft cocktail bars (speakeasy in this case).  Had some amazingly good cocktails ordering off a very well planned cocktail menu.  While not quite as good as a couple of my favorites, this is still a five star place.  Go.", "pics": null}}, {"review": {"des": "This place was very lame. And customer service sucked. They handed the \"RULES LIST\" to us... I've never seen a list of rules by a lounge like this.. you cant even use cell phones..... Dumb place", "pics": null}}, {"review": {"des": "My favorite intimate bar in wicker park period. The door man is always polite and the bartenders are nice and friendly! The drinks are different yet delicious I've never had a bad drink. Perfect date night!!", "pics": null}}, {"review": {"des": "I've finally made it here. I've been wanting to try this place for at least the past five years. However, the wait due to no reservations have kept me away. This year for my friend's birthday, I decided to take her here on a Saturday night. After reading all the Yelp reviews, I had no trouble finding the door to this place. We arrived just past 7 pm on a Saturday, and waiting for about 10 minutes to get seated. The line was pretty long, but they were all bigger groups, so we lucked out. We had an awesome two seater table next to a fireplace. This place is cute and classy. Our server James, was super helpful in suggesting what to drink after asking our preference. We each had 5 drinks, and James recommended 4 of them. We ordered a bunch of finger foods, but nothing special about them. The cocktails were delicious though.", "pics": null}}, {"review": {"des": "Violet Hour is like a less pretentious speakeasy in Wicker Park.  We didn't have much of a wait (I don't do waits), just a few minutes at 7ish on a Friday night.  My friends and I were seated at the bar, where we were treated exceptionally well (outside of a tiny chastising for taking a straw instead of waiting to ask a bartender).  While the tables are intimate and sexy, there is a show at the bar with the shaking and stirring of the night's concoctions.  <br><br>We ordered the punch of the day, which was absolutely divine.  Sweet, but potent. Well worth the $55.  We also ordered some of the craft cocktails and some snacks (the fries are not to be missed, the meatballs were delicious, but the margharita flat bread fell a little...flat).  All in all it was top notch.  This is a perfect venue for date night, as it was busy yet not very loud.", "pics": null}}, {"review": {"des": "What a cool place by Wicker Park. It is such an intimate and romantic setting perfect for a first date or 10 year anniversary. <br><br>When you first walk in the door is hidden so luckily I went with someone who had been there before or I would walk right past it. The outside looks dingy which I believe is on purpose to mislead you. We got there right at 630 on a Friday and only had to wait about 10 minutes to get a table. Luckily we were inside since it was freezing! I was a little disappointed they didn't play up the speakeasy theme with a bouncer dressed from the 20s who secretly checks Your I'd; however, he was still nice. The inside was beautiful! With chairs placed intimately next to each other. I wouldn't recommend going with a large group though. <br><br>When we went here we only ordered the drinks so I can't speak to their food although I heard it was amazing. They have a cocktail list that changes with the season; though they keep some favorites. I have recently gotten into drinking whiskey which I know contradicts many of my other reviews, but what can I say? ‍... my taste buds are evolving. The waitress was really informative about what good cocktails they served. I was very pleased with my choices. The beverages were sweet but not overly sweet. Just as I like them! I'd definitely go again.", "pics": null}}, {"review": {"des": "Nice little happy hour spot. Interesting drinks. Went here to celebrate my friends bachelorette party for happy hour prior to dinner. Personally not a fan of the dark lightening but to each his or her own for the ambiance. I found it weird that the door is practically hidden in the wall, but I like the graffiti decor on the outside. They have good punch with great pricing to share for large groups which makes ordering easy!! <br> Try it for yourself let me know what you think!!", "pics": null}}, {"review": {"des": "Wow, I must admit that after hearing all of the hype surrounding this place, I left pretty disappointed. I guess you would have to take it at face value - it's a cocktail bar that is best for a date night. After waiting outside in line, freezing, we were ushered in by the extremely nice doorman, and shown to our seats. We were a group of four, and were placed in the front bar area at a small table/cushion surrounded by extremely tall armchairs. The music was pretty loud so it was difficult to hold a conversation, and it was basically impossible to meet other people since the chairs sectioned us off from everyone else. The cocktails were nice and there's a very large selection, but it didn't feel that swanky to me. I don't think I'll be returning.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CsIWDeFQ1BovAQtxW0BGvw/348s.jpg", "caption": "Cocktails"}]}}, {"review": {"des": "What an amazing Speakeasy! I loved the tall chairs - no I don't mean tall height wise but the headboards were tall! So beautiful and classy. <br><br>We reached there fairly early around 6.30 pm on a Saturday so there was no line and got a table almost immediately. When we departed though there was a huge line outside. <br><br>The drinks and the service was spectacular. The servers knew the menu and options really well. When I requested a mezcal drink that they didn't have in the menu they custom made one for me which came with a strawberry and cucumber. It was delicious! <br><br>The ambience is cozy and romantic. It's very dimly lit and that's part of the effect they are trying to create. I would recommend this place to couples who would like to spend an enjoyable evening in a beautiful cozy place with excellent drinks!", "pics": null}}, {"review": {"des": "I've had this place booked marked for awhile, so I was super excited when in the car the my friend did the \"oh hey do you see that wall right there? That's really a bar\" it finally clicked in my head that it was the violet hour! Once he said he's never been to it we had to try it out! The place itself was super intimate and cozy. I ended up getting the bee humble drink from what I remember it had; lemon, honey, amaretto, Wild Turkey, and bitters. Had a great punch and all the flavors complimented well together. I also ordered the cheeseburger sliders and we inhaled them quick! I wish I would of gotten another order of those before I left.", "pics": null}}, {"review": {"des": "Dark and awesome!  I've stumbled upon this place thru Yelp. I was worried about the wait...only to walk up on a Tuesday night 8pm and be escorted right in(I was told there was only seating at the bar! No problem) as soon as I got in I felt a great vibe.  I like crafty cocktails especially when you A)cannot pronounce them and B) you don't know the ingredients off hand.  This place blew my mind I didn't know any of them and also saw spices and bitters I've never heard of. They definitely take pride in each cocktail. I wanted to try them all.  This place is great for a date or to start your night off. The service was great!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/p4UJgw0qIeQG0_UMH_bZwg/348s.jpg", "caption": "Drink menu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4dCXigYvGrX_aZbdEwNCjg/168s.jpg", "caption": "Drink menu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yKbc0pQkZ3PcXdvr_YxAPw/168s.jpg", "caption": "Drink menu"}]}}, {"review": {"des": "I met two friends at the violet hour at 6:30 on a Saturday. They had luckily been in line right when the doors opened at 6 and were able to grab a table for us so I was able to walk right in - otherwise there was already a line of about 20 people waiting for a table at 6:30. I ordered a drink that was no longer on the menu - Parts & Parcel - which was a refreshing grapefruit and vodka based drink. Ended up staying there for about three hours and the servers never made us feel rushed.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NEkuhV_aHx0RyDT-FEv8QQ/348s.jpg", "caption": "Parts and Parcel (off menu drink - grapefruit and vodka based)"}]}}, {"review": {"des": "When I was in Chicago, I had to check this place out. It was a little difficult to look for at first, since there's not really any sign.<br><br>Well, I came during the snow storm so I wanted something warm. Coming from Texas, anything below 60 is freezing, so I was definitely cold. I looked at the menu and decided on the mulled wine, mostly because it was warm. Well I chose the right drink cause not only was it warm, but it was also delicious. Super aromatic and just the right amount of sweetness. <br><br>The interior is just a couple of large spaces that are kind of sectioned off my by the tall chairs. Its super dark and quite intimate. Definitely a great place for a date or to chill with your friends. <br><br>Overall, this place was good. I liked the drinks and definitely the vibe of the place.", "pics": null}}, {"review": {"des": "Overview:<br>The Violet Hour is now on my shortlist of best cocktail lounges in the US<br>It's hidden so I suggest looking at photos of the entrance before leaving<br>Also, read the house rules before going as well <br>HH: Monday - Thursday 6-8p<br><br>I wish the LA cocktail scene would step up their game and learned a thing or two from The Violent Hour because I feel it's one of the best places in The Windy City. When I visit, I stay at The Robey which is within walking distance - bonus!<br><br>Cocktails = 5<br>Atmosphere = 5<br>Service = 5<br><br>Plus, it's across the street from Big Star for late night tacos.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tC1edbXxWsC8UWqueg04GQ/168s.jpg", "caption": "Inside"}]}}, {"review": {"des": "Note: This is a review for the 101 Cocktail Class, rather than for the happy hour or cocktails themselves.<br><br>Initially, we started out outside in 20 degree Chicago weather, waiting to be let in. I looked at my watch, seeing the minutes click down on my uber-splurge-y cocktail class. The fact that I am five starring after only shows how amazing the instruction was.<br><br>Overall, the instructor went through all the specifics of cocktail making - how to get a perfect seal on Boston shakers, # of ice cubes, etc. I'm a huge cocktail nerd so it was super fun to hear exactly how much thought goes into each drink. I was also impressed by the way everything was relatively seamless in terms of our own cocktail mixing. <br><br>I would highly recommend this for anyone who always gets the \"interesting\" cocktail. If you are fine with a rum and a coke or a nice red most days, you will probably be bored with the level of detail.", "pics": null}}, {"review": {"des": "Very sexy, great music, great vibes, and strong ass drinks!<br>We arrived on a Thursday night around 11:00 with a party of 6 and we walked right in.<br>They have a great selection of drinks with equally cool names...for instance, my poison of choice was \"Keeping Up With The Carthusians\" which was refreshing and would have knocked me out if not for the multiple glasses of water I consumed. <br>They also have a food menu with light options. We had fries and bacon covered dates which were just as amazing as their drinks.", "pics": null}}, {"review": {"des": "Yassssss! Finally found someone who'd go with me and it wasn't even planned. It helped that it was a Monday night. There was no line...we did have to wait about 5 minutes, but it was waiting inside...with the heat. <br><br>The cocktail menu \"looks\" small, but that's really just their featured cocktails. If you actually open up the leather-bound menu that is sitting on the table, you'll discover there are probably way more cocktails than you can handle. <br><br>It's a quiet speakeasy-like bar, with a super elegant air about it. It makes you feel fancy. No one is really on their phone because, let's get real, that's not the purpose you're there for. You're there for the experience and the amazing cocktails.<br><br>And...amazing is what they are. I don't remember what I had at the moment, but it couldn't not have been more perfectly executed. I can't wait to go back and try more. The server was great with the suggestions too.<br><br>TLDR: why haven't you been there yet?", "pics": null}}, {"review": {"des": "This was one of our last activities when visiting Chicago. During my weekend visit with my friend, Chicago has not stopped surprising me in a good way. This was no different. First of all, let me say that the charm of this place is its mysteries and secrecy. My friend and I almost passed it. If we didn't see the line outside, we would have never guessed. The entrance door was hidden in a very intriguing mural. <br><br>Once we made our way in this dark corridor, we would never imagine that it would reveal such a lovely, cozy, and romantic place. The room was slightly lighten by candles. When entering you could smell the alcohol, listen to the muttering of conversations with this jazz melody playing in the background. We made our way through those long elegant chairs place in triangle forming a cubicles with  little round tables in the middle. I was totally amazed by the vibe and the vintage feel of the place, and of course the privacy it gives couples. Those long navy blue drapes add to the elegance and high end characteristic of this place. <br><br>I took out one star in my review because, they didn't have the drink that I ordered after which they suggested another option that I ended up not liking. My friend and I had to change our drink twice before we actually got something that we liked. Again depends on the person; it was our first time. Therefore, we didn't really know what was good there.  <br><br>But overall, I was definitely satisfied, and I would recommend it to anyone visiting Chicago. You won't be disappointed.", "pics": null}}, {"review": {"des": "I'm sure I'm one of the many to admit that my very first time here years ago I drove back and forth a couple of times before realizing the door was in plain sight. It was one of my first speakeasy experiences in Chicago and I always make sure to swing by whenever I'm back in town. It's a great place for a quiet intimate date, but also good for groups too. The bar is pretty straightforward about what they'd like from their patrons and I can appreciate that. Have your whole party there, don't be on your phones, no Jaeger bombs, etc.<br><br>The decor makes you feel like you just stepped into another world; the high chairs made me feel like I was in a study chamber in a fantasy novel. They really design to place well enough to give you privacy if you desire. <br><br>Now for the important part: the drinks. Put simply, these guys all know what they're doing and the drinks are all fantastic. The cocktails listed are all unique and have little twists on classics. There's something for everyone, so just tell your server what kind of drinks you prefer and they'll gladly guide you the rest of the way. Then if you get a little too buzzed you can walk right across the street to Big Star to get some tacos to soak up all that alcohol. I absolutely adore this lounge and get excited every time I get to bring a friend for their first time. If it isn't on your list yet, bookmark it immediately!", "pics": null}}, {"review": {"des": "I'm a big fan of this place- Definitely a fun alternative to the bars that are in the area. <br>I love going on a weekday rather than a weekend because my wait will be much shorter. <br><br>Drinks are great. They truly have something for everyone. The servers are really knowledgeable about the drinks, even though the menu seems to change every time I go. <br><br>The small bites are catered to people who are drinking, but do not lack flavor. <br><br>I will say that this is much more of an intimate setting, groups of larger than three will absolutely wait longer than a group of two. <br><br>Worth noting:<br>-Do not use your cellphone in here! (or if you absolutely have to, keep your brightness down) It's technically a rule not to use it but if you're calling an uber, there's no way around it.", "pics": null}}, {"review": {"des": "Cool place to check out. Advanced warning*** it is so dark in there. I know that's what they are going for, like a speak easy vibe. But if it's sunny outside and you walk in here, you will be blind until your eyes get adjusted. <br><br>Drinks are very fancy. Too fancy for my taste, but a cool experience to say the least. Check it out.", "pics": null}}, {"review": {"des": "I'm loving all the reviews? This is the place to come. The house rules is the it. Sho ya Right", "pics": null}}, {"review": {"des": "One of my friends who is from Chicago told me about this place and I am so glad I finally got to go. I really like everything about this speak easy style bar. When we were walking we nearly missed the door, it blends in so well with the wicker park area. We went on a Friday night and we were sat immediately. Very dark and romantic almost with really high back chairs and long floor to ceiling drapes made it very intimate. The drink menu is easy to read, and the leather bound book of spirits was very nice. I had the TVH old fashioned. I have had better old fashions, but that's my favorite drink and I will have one at least once every where I go. I then ordered a French absinthe and it was great. If you haven't experienced a nice presentation and traditional way of drinking absinthe you have got to try it it least once!  This will definitely be one of my stops when I'm in Chicago and showing friends around.", "pics": null}}, {"review": {"des": "Hungry For Apples? Curious about the History of Ungentlemanly Warfare? Looking for the Apollo Star in the Western Skies?<br><br>The answers you seek are hidden in the heart of Wicker Park. Smell the tacos, listen for whispers behind the mural, and look for a lone lightbulb hanging above the entrance of The Violet Hour.<br><br>There are rules. Dress presentably. Keep your phone out of sight. No party add-ons.<br><br>There are three segments partitioned by long curtains, each with varying levels of intimacy. The front and back areas characterized by chairs with high backs and tables with low legs. The middle segment has booths and the bar. <br><br>Consider taking Vitamin A before delving in; it's dark in here. Additionally consider training to become resistant to musical hypnosis; the loud techno/electronic beats are likely to put you in a trance. <br><br>In the unfortunate case that you have not had extensive education in the art of cocktails, consider researching the menu and familiarizing yourself with any ingredients that are foreign to you. (B.T.W. - Cocktails are all $13)<br><br>Hungry? Upscale finger food is available for your purchase. <br><br>Those who visit from out of town and are looking for a classy night out should absolutely consider visiting the Violet Hour.", "pics": null}}, {"review": {"des": "Great ambiance and music. We were expecting some boring jazz or classical music but they had a great playlist. It wasn't hard to find this place. The lightbulb is right in front of a taco restaurant across the street. The wait wasn't too long either. My friends purchased the punch bowl and that was enough to get everyone a little tipsy. In the menu, the punch bowl says it can serve 5-7 drinks. It def can serve more! They also have an appetizers menu if you start getting hungry. I would def recommend coming here before going out with your friends.<br><br>Con: if your whole party isn't there, they won't sit you until they come.", "pics": null}}, {"review": {"des": "I get why The Violet Hour has a line out the door most nights. <br><br>We went to Violet Hour on a Saturday night, around 6 p.m. and did not have to wait for a table, but it was already pretty crowded. <br><br>The cocktail list is extensive and all of the drinks that we tried were all very good. There is a variety of drinks to choose from - more alcohol tasting vs. very sweet. <br><br>The food was surprisingly great as well - we tried the fries, bacon wrapped dates, and spinach & artichoke \"dip\"<br><br>I will say that it's kind of ridiculous they make people wait for a table outside, when there is room inside to wait. It's also very dark inside and the service really wasn't fantastic when we were there. I will go back for the cocktails though!", "pics": null}}, {"review": {"des": "An absolute must! Such a sexy spot for a night of role playing with your date or an intimate catch up. Drinks are adventurous and pack a punch so choose wisely but delicious. Loved everything about it except the hostesses and guy at the door. Didn't get that warm and fuzzy values client feeling if ya know what I mean.", "pics": null}}, {"review": {"des": "Very dark and intimate with candles at each table as the only light. You'll need to candles to see the menu. Large curtains separating rooms. Plenty of high back leather chairs and love seats that give an Alice in Wonderland type feel. They have an interesting menu of drink concoctions made with wide variety of ingredients, including egg yolk. Pretty pricy. They have a snack menu but we didn't order anything. Service was on the slow side, which could be the reason for the long wait to even get in. We actually had to search for our server each time we needed something. We were in and out with 30 minutes with just one drink each.", "pics": null}}, {"review": {"des": "I would never know this bar was here if I didn't go with my friends because the entrance is a brick wall with a mural painted on it and no violet hour sign. The line outside the door should give it away on weekends though.<br><br>It's very dark and cozy inside with tons of low tables and comfy chairs and booths. The bathrooms were clean and they provide nice soap.<br><br>Our waiter was very friendly, shout out to manager Benjamin! He gave great recommendations. I had two sweeter drinks, both were delicious. Plus they were strong as I had a nice buzz after two drinks.", "pics": null}}, {"review": {"des": "This is probably one of the best bars I've ever been to in the world. The drinks were Incredible and very strong - I got one of the bowls Nd shared it and we were both pretty tipsy. The door is so hidden you might have trouble finding it but it's directly in front of big star", "pics": null}}, {"review": {"des": "This was the first speakeasy I've ever been to and I think it set the bar too high for future experiences. <br><br>We came here early (around when it opened) so we didn't have to wait long for a seat. The Violet Hour looks very sophisticated and has classy vibes but it was SO dark. Ordering in here was its own accomplishment. The entire place is huge with tall ceilings and draped with long curtains but only lit with candlelight. I would recommend this as a perfect date night. <br><br>Cocktails here did not disappoint. I got one of the fruitier drinks - (something called summer or elder) and it was delicious. It came in a long cup and I really like how they give you a tall ice block to keep the drink cool the whole time. I thought the food here was so reasonably priced and very tasty. An absolute must is the chickpeas. It was super crunchy and when paired with the drink, goes very well together. I also recommend the spinach dip. It was delicious. Their appetizers honestly blew my mind. Even if you don't want a drink, still come here for amazing food.", "pics": null}}, {"review": {"des": "Say what you will about craft cocktails, mixologists, speakeasy wanna be's, the trends come and go. In the end, the only thing that will probably remain after a nuclear meltdown, sars, the zombie apocalypse will be cockroaches and The Violet Hour. <br><br>After 10+ years, the Violet Hour keeps evolving from a damn fine cocktail lounge to an exceptional destination. This place is always a step ahead of what becomes a trend. Although their rules posted from back in the day may seam archaic in this day and age, they kinda now fit more and more what has become the Wicker Park landscape. <br><br>Come in for a drink, a bite, or for a low key night.", "pics": null}}, {"review": {"des": "Talk about a literal hole in the wall. Almost couldn't find the entrance! The way they escort you in and out of the establishment made me feel like I was part of a secret society.<br><br>As everyone has mentioned, the ambiance is great. High ceiling, huge green drapes that divide the room into three sections (almost like mini-bars), with a small chandelier hanging from each. Restrooms were clean. <br><br>There were groups of friends and people on dates while I was there, and I saw a lot of mingling between strangers and flirting happening in general. The dimly lit room helps. The bartenders are all knowledgeable about the science and flavors of alcohol, and made great recommendations.", "pics": null}}, {"review": {"des": "Very cool ambiance! There's a door camouflaged into the street art on the side of the road-you wait inside (away from the cold) to enter through the drapes to this unforgettable speakeasy. <br><br>It's fairly large inside, with these big green chairs, booming hip hop music, and interesting cocktail menus. <br><br>I tried the hibiscus whiskey drink (all cocktails were only $13) that was way too bitter, and although I only had a sip or two, I still enjoyed my experience here because of how cool it was.", "pics": null}}, {"review": {"des": "Love love love love everything about this place. <br>Would suggest coming here with friends very intimate and great ambiance.<br>Service is outstanding. The soft pretzel was divine", "pics": null}}, {"review": {"des": "Known for its speakeasy vibe, the covert Violet Hour exudes exclusivity. Hidden behind one of Wicker Park's many murals, this cocktail lounge feels like a refined and subdued nightclub. One thing to note- The Violet Hour upholds a set of rules such as: no reservations and no cell phone use (among many). Once escorted through the velvet curtain, you maneuver your way through a maze of high-back chairs. The placement of these paired chairs provide a space for private and intimate conversation. I must say, this swanky venue is extremely dim, as the glowing tea lights placed on each patron's table are the lounge's seemingly main source of light. To match the unique ambiance, their cocktail menu will bewilder you with their one-of-a-kind pairings. The exotic flavors fuse into a refreshing, delightful, and enticing elixir. Trust me, you will not be disappointed! From the sophisticated milieu to the exquisite cocktails, The Violet Hour will win you over.", "pics": null}}, {"review": {"des": "After walking up and down the block a few times trying to find the door, we finally made our way into The Violet Hour. My friend and I got seats at the bar and got two cocktails each. I got an apple brandy cocktail and another one with spiced pear flavor. Great balance of flavors in the cocktails and they were stronger than they tasted! One cocktail was more than enough for me, but it was such a cool place that I decided to persevere and go for round two! The staff is also super friendly - the hostess and bartenders were all very helpful and efficient in service. Would highly recommend to anyone in the area and would definitely take any visitors here for a nice night out!", "pics": null}}, {"review": {"des": "If you want to get into a bar quickly, don't come to Violet Hour.<br><br>If you want to go to a Speakeasy with spectacular cocktails and a unique experience, come to Violet Hour. All the cocktails are $13 and the servers will give you a great explanation of each one or make a recommendation based on what you're in the mood for. My personal favorite is Laid Up in Lavender - slightly sweet with a lot of smokiness. <br><br>A great spot for a relaxed drink with friends or a fun date night.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5wTKhmO6chcYwYRgtq6xEw/168s.jpg", "caption": "Laid Up in Lavender"}]}}, {"review": {"des": "I can't speak highly enough of this place! Making this year a small tradition to go with my boyfriend for a special evening together enjoying their wonderful cocktails and atmosphere! Can't wait to come back! :)", "pics": null}}, {"review": {"des": "Don't give up on your GPS... this place does in fact exist. It may be challenging to find it in the dark with its unassuming, barely marked exterior. But expect the unexpected when you walk into this swanky bar in the heart of Wicker Park. <br><br>Once inside, you'll think you've stumbled into a place fit for Bruce Wayne- The elegant interior is decorated with high-backed leather chairs, long velvet drapes, a fireplace, crystal chandeliers, and small tables lit by candlelight. It creates a hushed tone of awe amongst the newbies. <br><br>You'll lighten up as soon as you see the seasonally created list of cocktails and spirits. <br>And you may want to try more than one because they all sound so classy and pretty. Here's a little sample:<br><br>Eyes, Pasture, and Pine: <br>a jammy sling featuring Buffalo Trace Bourbon, with notes of blueberry, grapefruit, and a hint of sarsaparilla<br><br>Circles of Confusion:<br>A luxurious La Botija Pisco egg white sour with notes of lavender, huckleberry, and a funky nose of grass and sun-drenched shale", "pics": null}}, {"review": {"des": "I like refreshing drinks and do not like the heavy taste of ethanol nor burn of things like whisky. I love violet hour. For $13 the masterpieces they concoct stay with you..I'm still thinking about my two drinks... so refined, so balanced, so pretty! Basically tell your waiter what kind of drink you're looking for \"refined, juicy, acidic, not too sweet\" or \"whisky based, bitter, cynar\", etc. and they will tell you which drink to get, and you will love it. If you're familiar with Violet Hour's past menus, you can order off-menu; they will make it for ya. <br><br>They also serve food till 1:30am. Get a booth, it's a great way to catch up with friends.<br><br>The bouncer at the front is strict and awesome and kind, so treat him with respect!", "pics": null}}, {"review": {"des": "Husband and I visited for our first anniversary this weekend, and it was a great experience. I've been wanting to visit for a while, and it did not disappoint. We just had one cocktail each, so I'd like to return and try a few more. The best part about our experience was the service -- both of us thought we had picked cocktails, but when the waiter described the flavors of our choices we reconsidered. He then picked out what we really would like based on the ingredients from our original choices, and we were both very happy with what he selected. I ended up with a pineapple-flavored cocktail from the \"shaken\" menu while my husband had a classic cocktail that he really enjoyed. The ambience was very romantic and perfect for a date.", "pics": null}}, {"review": {"des": "Six years was too long to wait for a second visit!  Perfect ambiance, attentive service, exquisite cocktails--what more could you want?  Here's hoping my next visit is sooner than 2024...", "pics": null}}, {"review": {"des": "If you are looking for an intimate, unique cocktail experience where you can sit and chat then this is a great place! They have an amazing cocktail list and creative! We had one made with Cumin, vodka and popcorn?!! It was out of the world good! Like all the other reviewers the drinks are strong so beware...two is enough! (for me at least)<br><br>The rules are not that strict as I saw guys in shorts, and women in torn jeans. Bottomline just look presentable, and not drunk.<br><br>This place is a great cocktail bar to visit. Go!", "pics": null}}, {"review": {"des": "Good drinks and tasty snack. Nice booths to sit down  and chat with friends, but there is a fair amount of chatter all around. Cozy and comfortable on a chilly night.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Wc2pU3_jV6SNgXDXwEnnFA/348s.jpg", "caption": "Under the light bulb"}]}}, {"review": {"des": "There is a Very secret-society feel to this cocktail bar. Inside is very dark but music is fun and allows for good conversation with your friends. drinks are delicious. Ask about the drinks not on the menu.", "pics": null}}, {"review": {"des": "I've been to the Violet Hour a handful of times and enjoyed it. Last night was not the case. My sister invited my boyfriend and I to join her along with some of her friends for her birthday celebration. First of all, they were sat at a 6 top and were able to get seated despite my boyfriend and I not being present. My sister was continuously asked bythe server and bouncer repeatedly \"Where your friends?\". They assumed my sister and her two friends lied to get seated sooner. Service was slow. It took twenty minutes after joining the table to order my first round. Also, I call BS that servers cannot split tabs. As I stated prior, I've been to the Violet Hour plenty of times. I've always split tabs previously and had no issue doing that.  I recall splitting a $300 tab 8 ways and making it an even split based on what each person ordered.", "pics": null}}, {"review": {"des": "Lovely spot! <br>There was no waiting time, place was nearly empty due to the fact it was 1am when we got there. <br>Our server Brock was extremely knowledgeable & helpful.<br>The interior is beautiful; high chairs, jaded tones with a delicate vintage touch.<br><br>Tip: Have your ID in hand, pictures of ID's are not accepted", "pics": null}}, {"review": {"des": "The ambience is everything here. The darkness creatives a privacy as do the tall backed chairs. The cocktails are creative and lead with citrus notes. It's a spot worth experiencing but make a reservation or go during off peak hours to avoid long waits.", "pics": null}}, {"review": {"des": "We love nothing more than to visit summer-time Chi and explore the craft cocktail scene and The Violet Hour was truly a unique experience! Walking in felt like walking into a scene from Alice and Wonderland. Our cocktails were crafted to perfection and our waitress was even kind enough to give us a recipe card so we could put our bartender skills to the test at home. Now...for the the cheeseburger sliders....literally one of the most delicious and perfectly charred little baby burgers ever! If you're savvy enough to find the somewhat hidden entry to this whimsically romantic gem, you won't be disappointed!", "pics": null}}, {"review": {"des": "This place was amazing! Walking down the street you wouldn't even know it was there... the door hidden amongst the graffiti. Walking in though it almost makes you feel like you're going back in time and sitting at a hidden bar during prohibition. The place is dark, only illuminated by candles at the table, and there are draperies hanging around each table almost encompassing you in. This isn't a big party place and is actually quite quiet which we enjoyed. It was the first time I ever tried absinthe and was fascinated by the process of pouring the liquor over the sugar to sweeten it. I love the speakeasy feel and this place is definitely at the top of my list.", "pics": null}}, {"review": {"des": "Very cozy and intimate. Loved the setup. <br><br>I'm mostly giving stars here for their awesome interior design skills. This is exactly what I would imagine a speakeasy would look like. Kudos to them for the creativity. We stood in line outside for *literally* 1 hour because 2 person groups were not available. Would like to come back here when it's not as busy, but the experience overall was nice. Our waitress was also very friendly and our drinks and appetizers came pretty quickly for a place with a full house.", "pics": null}}, {"review": {"des": "The Violet Hour is so hilariously pretentious--if you go please don't take yourself too seriously. Once you enter through the \"secret\" doorway, which is not so secret when there are people loitering around outside, \"disguised\" by the mural (the art is legitimately cool though!), you will face the seemingly intimidating sign with stipulations including no cell phones and classy dress. This code of conduct might actually elevate the place if they stuck to it, but the fact that any dirty sandal-sporting, backpack-wearing, twenty-something-year-old i.e. my people can walk right in sorely undermines the drama and allure they are trying to emit. <br><br>Once you are granted access to enter, you may stumble in the darkness, through layers of heavy curtains and over oddly shaped mismatched chairs, to your booth. There is a large binder catalog of drinks, as well as a sheet of current seasonal concoctions available. After each of us relayed our choice to our waiter, he would reliably embark on a mini monologue praising our decision and how such and such liquor was amazing, the history of the drink, the history of the world, etc. Okay, perhaps I am exaggerating a little, but it was like, *eye-roll* continuously. <br><br>I'm not an alcohol connoisseur, but my friends deemed their drinks high quality and I enjoyed my dark and stormy. It didn't seem that strong, rather dominantly tangy and gingery in flavor. The wide variety of cup and ice cube shapes are fun.<br><br>Given my snarky description, you might think my recommendation would be to never come here, but on the contrary I think it's a fun experience (at least once). The Violet Hour is like a parody of itself! Not so much priceless entertainment as each drink will run you ~$15, but it's good amusement. I can't imagine going with a straight face.", "pics": null}}, {"review": {"des": "I have been to The Violet Hour just once. I will start at the very beginning of my experience, where most epics start.<br><br>It was dusk, mid-summer, sticky. I was on a date so I was extra sticky, but strategically letting humidity take the brunt. She wasn't fooled. <br><br>My date and I were searching for the door when we heard a voice from a silhouette figure leaning against a tree like a cool guy: one foot on the tree, probably a toothpick in his cheek but it was too dark to tell. \"You need a spot?\" he says. We weren't sure what to say. \"Do you need to put your name in for a table?\" he tried again. <br><br>It felt like a drug deal... very cool. <br><br>Once we got in, we were seated in these Alice-in-Wonderland-y, high-back, tufted velvet chairs. A little nook to get intimate, and did we ever...<br><br>It was romantic. The drinks were delicious and sturdy. Very well-built. The only thing smoother than the drinks was the conversation. I take credit for that--once the slime evaporated, I was crushing it. I was listening, reacting with quips, and making subtly forward (although still gentlemanly) gestures to demonstrate value (D in the D.E.N.N.I.S. system). The night was on-point, all-around. <br><br>Afterwards, we got empanadas at 5411 and broke up soon after. What a waste of money dating is.", "pics": null}}, {"review": {"des": "This is one of my favorite cocktail bars in Chicago! Don't get there too late into the evening, otherwise you will wait quite a while. It's very dark and minimalist inside. The drinks are very creative. You can also get food here although I never have and it's not so much their specialty. Expensive but worth it. Great service!", "pics": null}}, {"review": {"des": "Love the vibe here and drinks are to die for. Great for a romantic date night - don't forget to try the bacon wrapped dates (they are divine!)", "pics": null}}, {"review": {"des": "After waiting in line, in the freezing cold for 30 mins we were escorted in a dark room with draping....just an ordinary bar. Not sure why the high reviews or the long mysterious wait. We had 2 drinks and a mediocre flat bread. As leaving I held back from telling the poor people waiting in line that it was definitely not worth the wait.", "pics": null}}, {"review": {"des": "Absolutely love the Violet Hour! Husband and I popped in after dinner in Wicker Park, around 7:30pm on a Thursday. There was a short wait, but the doorman was polite as ever, not sure what people are talking about with attitude. We don't find it to be pretentious, just elevated, and since we're not frat boys in our 20's, that suits us just fine.<br><br>Of course I had to have their Old Fashioned, and it's at the top of my list for no frills OF's. Hubby started off with the Stewed Screwed Tattoed since he's on a rum kick, and gave it high marks. <br><br>Twist my arm for a second drink, it's date night! Thank You, Lorraine with Pimm's looked better on paper than it was in my mouth. Maybe I should have just asked them to make me a Pimm's Cup. Points for trying something different with Pimm's. Hubs stayed with his rum drink for the second round (hey, I wanted to try something different!) since it was so good. Service was friendly and attentive and VH was a great end to our monthly date night.", "pics": null}}, {"review": {"des": "This place is pretty dope. If I hadn't looked it up in advance, I wouldn't have known where to enter.  I love that they change the mural. We sat at the bar - the stools are a little weird - they're wide and very close together. The bartenders were awesome. I ordered the drink \"some clever name\" or something like that... it was good!  I followed it up with a drink that wasn't on the menu, a Bees Knees, and it was . Very cool experience.", "pics": null}}, {"review": {"des": "Love this bar so much! I always bring people here when they come visit Chicago!! It's so fun that the doorway is a little hidden and the drinks are amazing! Definitely a bit pricey, but so worth it!!", "pics": null}}, {"review": {"des": "Amazing drinks and great staff!<br>Its kind of exciting when you walk in, do worry about the wait it can move fast however I would come early, 10 min before opening.", "pics": null}}, {"review": {"des": "Started coming here when I first moved to a Chicago in 2010 looking for a good cocktail and have never left disappointed since!<br><br>Cocktails on the menu change every so often but if you can't find something you like, you can just tell them your choice of spirit and what kind of flavors you like and they will make something to your liking.  <br><br>The decor is unique (very tall chairs make it seem a little Alice in wonderland like) and, even when packed, seating keeps it more of a private affair since they make a concerted effort to limit the number of people coming in.<br><br>My personal favorite is their old fashioned.", "pics": null}}, {"review": {"des": "I don't know if I would consider this really a speakeasy since there's a huge line formed right outside but if it wasn't for the line it's a great \"speakeasy\"! I came here on a Friday night which would have probably been a mistake judging from the long line but they take a lot of people at a time so it shouldn't be THAT long maybe 30 minutes which sounds terrible so I suggest coming here with friends or a person you're comfortable talking to for the next 30 minutes! If this was a blind date that might be super awkward standing in line for 30 minutes... <br><br>Anyways, walking inside I didn't know what to expect but I was impressed. I felt sort of like a king sitting in those seats! If you're here with a group of 4 or more you are seated in nicer booths but if it's just you and your significant other your still have a nice intimate space for you to talk. The atmosphere is very dark so it was hard taking gram-worthy pictures because I didn't want to be \"those people\" so I tried taking pictures with the candle that was given to us on the table. I especially like the funny framed picture in the bathroom and appreciate malin + goetz products.<br><br>The waitresses are always circling around so expect to never have your water empty and to get a new drink order in once you're done with it. I don't suggest getting any of the food honestly, this place is cocktail only. I ordered their sliders and for the price and taste it was not worth it. So make sure to eat before coming here there's a bunch of food places where you can grab a quick bite. The drinks thought were so good! They definitely have all different times of cocktails that can appeal to anybody. Whether you're more spirit forward or just want something fruity the waitresses can guide you through it all. I would definitely come back here again but would do less with the long lines and mediocre food. If you're not from Chicago this is a great place to go to if you've never been.", "pics": null}}, {"review": {"des": "Great cocktails and atmosphere. Trendy speakeasy in a cool neighborhood with a semi-hidden entrance.<br><br>One star off for service. It was kind of a hassle getting in (had to wait behind curtains for the host to approve seating--very hipster), and we had to wave over our waitress any time we wanted drinks. <br><br>If you can get over the hoity-toity hipster vibe, and you are looking for delicious cocktails, then def give this placed a try.", "pics": null}}, {"review": {"des": "Great speciality cocktails and awesome vibe!<br><br>Went here with three friends for a few drinks. We decided to get there around 7:30pm on a Friday night. We had to wait about 25 minutes for a place to sit, but it was totally worth it. <br><br>Cocktails are $13, but they definitely do not disappoint. <br><br>I would recommend going early on a weekend night to avoid the line. When we left, around 10pm, the line was out the door.", "pics": null}}, {"review": {"des": "Speakeasy bar awesome for pre-dinner or post-dinner drinks. Cozy rooms divided by velvet curtains. Of course there is a line especially for groups bigger than 4 people. Great lounge-y vibe for catching up or just chilling with your gang after a long day's toil.", "pics": null}}, {"review": {"des": "We went late on a Monday night and were seated immediately at the bar and shortly thereafter at one of the two top tables. The atmosphere is excellent. There isn't a single TV inside and they discourage cell phone use, and it just makes for an intimate and unique experience. The high backed seats give a feeling of privacy even though you're sitting near enough to other patrons. The service was great: bartenders, hostess, and wait staff were all very friendly. The background music was loud enough that we couldn't really hear other people's conversations but not so loud that we had to shout to hear each other. The drinks were fantastic. I got the Hotel Nacionel (twice) and my husband got Gimme All Your Lovin and they we enjoyed them a lot. Definitely worth checking out.", "pics": null}}, {"review": {"des": "Came here for a date night for my birthday. I loved the speakeasy environment! I got the Mint To Be Better on the stirred side of the menu because I heard their Mezcal was really good. It did not disappoint. The presentation was very pretty and the one drink definitely packs a punch. The setting can be very intimate depending on where you are seated... there's bar seating and individual tables with \"throne\" like chairs giving you privacy from other tables. I'll definitely be back!", "pics": null}}, {"review": {"des": "Very good food on their limited menu. Very good hand crafted cocktails. Very good ambiance and theme. This intimate setting is worth a visit, perfect for a pair or group of 4, max. Although our group of 6 was accommodated for.", "pics": null}}, {"review": {"des": "Love this chill lounge where seats are a must, drinks are innovative and food is actually very good. Might be a little challenging to find for non-locals. Worth the effort!", "pics": null}}, {"review": {"des": "I've been to VH many times and appreciate the bartendership and the drink quality is great.  Sitting at the bar watching them make it is half the fun.<br><br>The doorman was way too disrespectful.<br><br>Scofflaw or Whistler is better than this place.", "pics": null}}, {"review": {"des": "I felt like it was tea time in Wonderland. There's a no cell phone rule, so don't ruin the mood with flashes! Nearly every spot in the place feels like VIP! Too bad they wouldn't let us steal the chairs lol.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DyadQTgJ0E51Xyc_akSNiA/348s.jpg", "caption": "No cell phones, but we're rebels! Love this place."}]}}, {"review": {"des": "This speakeasy bar makes you feel like you've travelled back in time to the prohibition era. It's quite an experience.  The seating is private and they keep the place looking upscale.  Perfect spot for a date or a chill night out with friends. <br><br>The menu offers small bites and a large variety of cocktails. It is a little on the pricey side but it is well worth it for the ambiance and drinks.  The drinks I've had here have always been on the strong side, so beware! The service here is excellent.", "pics": null}}, {"review": {"des": "I've been here 3 times now and each visit has been memorable. The drinks are great and the bar has a great ambiance. <br><br>The menu is organized so that the more accessible drinks are on the top of the menu and stronger, more distinct drinks are at the bottom. I got the drink at the very top of the list, and it was light, fruity, and refreshing. <br><br>I also tried the stuffed dates with manchego cheese and basil, wrapped in bacon and they were great. <br><br>Will come again!", "pics": null}}, {"review": {"des": "Great spot for a date.  I prefer being sat at a table over being seated at the bar.  They seat every party so you can't just walk in and grab a drink.  Cell phones are strongly discouraged.  All of that along with the lighting and music helps create an intimate environment that is built to enjoy the company of another along with high quality food and drink.  Food menu is apps meant for sharing, don't come here looking to grab dinner.  A true craft cocktail bar.  Also, don't come here looking to order a vodka tonic or a rum and coke.", "pics": null}}, {"review": {"des": "Obsessed. Concept is amazing here. It feels like such an exclusive place to enter because you walk into what looks like a warehouse, separated by a hallway. You must put your phones away which is the biggest struggle in our generation today. <br><br>There is a cute bar area, seating for two and small groups, two sections to the bar where you go through a dark velvet curtain to the next, a mystery within a mystery. <br><br>The Violet Hour promotes good conversations with a super dim ambiance for you to really get deep into conversations. I really lost count of how many drinks I had because I was so absorbed into the conversation. <br><br>This place was the first where I actually enjoyed a cocktail made with whiskey. Not the biggest fan, but they were able to create something that I would never forget or be able to replicate. Definitely the perfect date spot, recommend all the way!", "pics": null}}, {"review": {"des": "Great private cocktails. Sexy and powerful drinks made by all star bartenders. Concoctions for adults", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hid8K1IAg4YXUxqXfkgKhw/348s.jpg", "caption": "Such tasty libations"}]}}]}