{"name": "the-signature-room-at-the-95th-chicago-2", "reviews": [{"review": {"des": "Spectacular views and fancy Drinks is why you should definitely go to The signature room for once in your lifetime. <br><br>If you wish to go eat dinner I highly recommend you call ahead of time and reserve a table. But if you just want to have drinks and enjoy the views you don't need to have reservations. All you need is some patience as there is a bit of a line to be seated by a windows with the view of the city. <br><br>In terms of drinks they are on the pricey side. A nice cocktail can start at about $16 dollars and go up to $22-25, but they are totally worth it in terms of taste and the view of the city makes up for it. They also have great dessert menu. <br><br>Once you are seated the service is great. You can even walk around and take pictures of the beautiful views. The best time to go is during the day time as you can see the beautiful lake shore line. And the city. Night time is fun too as you can see the night lights. The best time is during the Holidays, as they are playing holiday music  and it's just fun!!!! So hopefully it's a pleasure for all!!! Great place to go on Dates!!!", "pics": null}}, {"review": {"des": "I brought my parents here for Thanksgiving last week - <br><br>I am so pleased about our experience. We had really great service and the food was delicious! It was something different for Thanksgiving this year since we just wanted to have a vacation in Chicago instead of staying in San Diego for the holidays. <br><br>There was a starting appetizer buffet with so many options. I actually got pretty full just from the appetizers since there was prime rib and mashed potatoes. I chose the lamb for main course accompanied with garlic mashed potatoes and lobster mac n cheese. I was very happy with this decision and I forced myself to eat more because it was just too delicious not to eat. <br><br>The view, of course, was amazing! My ears popped when we were going up the elevator but it was well worth it once we were at the top. While waiting for our table, we sat by the window with our wine in hand, enjoying this very low-key but lavish Thanksgiving.<br><br>Also, shout out to the waiters and cashiers! I let them know to hide the bill from my parents because I did not want my dad to pay and they were extremely helpful/flexible to assist me. :-)", "pics": null}}, {"review": {"des": "While inquiring about the questionable elevator route taken, I was told by the young lady at the front desk \"well obviously you don't watch the news\". Instead of enjoying our anniversary, my girlfriend and I spent the majority of our dinner trying to comprehend how a restaurant could make the mistake of hiring such a rude and unprofessional individual. <br><br>Honestly I am not a person to complain, but this lady offended me to the point that after we finished our meal, I had to speak to a manager. Overall, the food was decent, the service (other than the front desk lady) was great, and the view was incredible. However, none of that could makeup for the attitude I was greeted with.", "pics": null}}, {"review": {"des": "Came to The Signature Room with my friend to celebrate our birthdays (Cancers!!). We came on a Sunday at 6pm so the restaurant was 30% filled which I appreciated cause we were seated as soon as we arrived. <br><br>The service we received was 4 stars. The servers that were attending to us were personable, ensured our water glasses were never empty, provided good recommendations on what we should consider ordering and didn't embarrass us with that happy birthday song when they brought out our complimentary birthday dessert.<br><br>The food gets 3.5 stars because everything was good, but not memorable...except the desserts were both BOOOOMB and get 5 stars.<br><br>We were seated at the window which I think they hostess thought was going to be a treat. However, the 900 spiders on the other side of the window did not make for an enjoyable dining experience. Some of those spiders looked to be the size of a Dunkin' Donuts Munchkins. <br><br>Overall, The Signature Room gets an overall score of 3.5 stars.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lWFFYH4i84F3CC_yj8ZehA/168s.jpg", "caption": "Roasted Salmon Fillet"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BCTpUkPBXpI4FS_cZ6EZgw/168s.jpg", "caption": "Shrimp Dejonghe( garlic butter sauce | Parmesan herb bread crumbs | sliced baguette)"}]}}, {"review": {"des": "The wait to get to this place is totally worth it what a view absolutely unbeatable.<br>The staff is great and the drinks are amazing and very reasonably priced.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/O9dxkkDiNvWQ7aKe96pKCw/348s.jpg", "caption": "Bar"}]}}, {"review": {"des": "Best view in town to enjoy a cocktail from. Try their quesadilla, it's yummy!!!  If your a bourbon lover go for their Peach Manhattan($17.50-Chicago prices, get used to it)<br>Knob Creek bourbon | peach brandy |<br>sweet vermouth | Angostura bitters |  maraschino cherry. <br>Also if you can, wait around for a window seat to get the best views! And hopefully your going with clear skies to make the whole trip worth it. I'm not sure of what times are the best to go, but I do know go before sunset to beat the lines to the elevator!!", "pics": null}}, {"review": {"des": "Listen -- <br><br>Chicago is one of my favorite places in the world !!! This view (especially from the women's restroom, just trust me) is one of the BEST in the city. <br><br>The drinks are pricey, the wait to get a table can take a bit of time, but the view and experience from 95 floors up is AMAZING.  I've always found the wait staff to be super friendly and they'll happily help you choose a drink to suit your taste. Appetizers are available too ! <br><br>Check it out !!!  The cost to ride up to the top is free and the elevator goes from ground to floor 95 with no stops. <br><br>Go give this place a try... and bring your camera!", "pics": null}}, {"review": {"des": "I have mixed feeling about my experience here. <br><br>I only come because I wanted to get a good view of downtown but didn't want to have to pay for it.  That part of my experience was great. The view didn't disappoint, it was so pretty.  Oddly enough the best place to view the city was in the bathroom.  ‍  <br><br>The part I didn't like about here was the service/wait time.  We waited well over an hour to get to the elevator and were told we'd be seated as soon as we got upstairs.  When we finally made it upstairs we were seated right away and then promptly ignored.  We had to wave down a waitress and she said our waitress would be over soon, didn't offer to even bring us a menu. We ordered, sat for a while, and then were ready to go.  But we couldn't, our waitress was nowhere to be found and we needed our bill.  So we waited some more..<br><br>If you're just interested in a free view skip getting a drink and just check out the window in the bathroom!", "pics": null}}, {"review": {"des": "***Disappointed & Upset.***<br>BUT! Food was amazing! Atmosphere and service with on par! Everything would have been 5 stars...until our cameras took a picture of something that really made me frown at the professionalism and sanitation of the kitchen.  You may have gotten away with the usual dark atmosphere but when you have foodies who try to find the best angles to picture the food...you really have to be careful of ungloved fingerprints on your desserts.  (Now I question my food too)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4bO3nk24WWsRyUtahLVv2g/348s.jpg", "caption": "Dinner with sis in town."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YP9ffEiQ5PxLvS0H1wuhGQ/168s.jpg", "caption": "Fingerprints on all 3...so sad"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/N_UY1VhXWIFH_sQGF6sa7g/168s.jpg", "caption": "Tsk tsk, ungloved fingerprint? We literally spit it back out."}]}}, {"review": {"des": "My boyfriend and I celebrated my birthday here at the Signature Room. I was extremely glad and thankful for that experience. And I'll for sure carry this memory with me for the rest of my life. <br><br>The view was truly amazing. Where else could you possibly find a place in which you can 1) see the famous Chicago skyline; 2) watch the glowing sun slowly sinking into the Michigan Lake; and 3) enjoy amazing foods? I think you know the answers to all of the questions. Lol<br><br>Environment aside, let's have some food talk. <br><br>We started by sharing the tuna tartare. It was my first time ever tasting tuna tartare with guacamole. And I'll for sure replicate this combination at home. That's how much I loved it. The seasoning on the guacamole was right on point. I really didn't need the aioli on the side. I absolutely LOVE avocados! The chef really read my mind. <br><br>As for the main dish, my boyfriend ordered the ribeye steak, the special of that day. It was absolutely HUUUUUUUUUUGE. Quite enough for two people. In addition to that luxurious steak, the chef layered some lobster claws on top. So extravagantly amazing.<br><br>I had the lamb chop. The cooking on the lamb was perfectly cooked to perfection. And boy was the lamb jus rich and full of that kind of rich and Unami flavors. Unfortunately, I believed the lamb was not rendered enough. I could still find a thick layer of fat, still in white. Like... RAW fat. On top of that, I really wished that I could love the crust, as pesto and lamb were such a classic combination. However, the crust was like ridiculously salty, to the extent that it was literally unbearable. But so what? I was the birthday girl. All I needed to do were to cut off that fat and crust. And Viola, a perfect plate of lamb dish. Birthday magic, huh?<br><br>And here came the best part of the night. When we were presented with the dessert, it came with a candle on top and birthday wished written in chocolate. And of course I brought my tiara. Who says you can only marry a prince to become a princess? <br><br>Looking around. There were at least 4 other tables celebrating birthday and 2 others toasting for their anniversary. I guess... wise minds think similarly? Hahaha It is truly a wonderful place for anyone to write their unique memories. I truly adore, appreciate, and cherish this place.", "pics": null}}, {"review": {"des": "Ahhh Signature Room... the place where you are on top of the world, literally. The food here is very good, but the service could have been better... let's explain:<br><br>So the food was awesome! My boyfriend and I just came here on a date in Sunday at 12:30, and there was no wait and no large crowds. We did make a reservation, too, just in case. <br><br>Backtracking though, we at first got lost downstairs because we saw the signs for Signature Room in the Hancock, and at first, no one was standing by the up elevators, so we went into the elevators on the left instead of going to the ones on the right... well, we went in the wrong elevators, and then we realized none of the buttons said Signature Room, so we came out of the elevator and someone was standing there and told us where to stand for the right elevators. <br><br>Once at Signature Room, we were seated within 3 minutes and they sat us in the 2nd row of tables... we had an awesome view, but it's kind of awkward to sit I'm the row furthest away from the windows because you always want to stare at the window and end up staring at the party next to the window. Also, pictures would be really hard to take because the family next to you is always in the picture.<br><br>Well, we unknowingly came for brunch instead of lunch, and I'm so happy we did because for $55 a person, you get unlimited appetizers that are buffet styled at a table, which included salmon, crab legs, shrimp, salad, chicken rolls, tortilla soup, and tons more. They also have a man who makes omelets for you, and you have a bunch of toppings to choose from right in front of you that he can put in for you (so they're cooked to order). They also have a full table of dessert (cookies and cake). Not only are appetizers apart of your brunch, but they ha e a menu with a bunch of entrees and these are also all you can eat, so $55 is so worth it for all of these amazing foods. The drinks were okay, my boyfriend ordered a $10 mimosa which was very good, but my Bloody Mary was eh.<br><br>One thing that made me a little agitated about my visit was that our waiter was super nice in the beginning, but then our service went downhill as the day continued. When we asked for him to take a picture of us (everyone was asking their waiters and waitresses for that), he said \"Yeah one sec\" and then never came and did it. I do get it way getting fairly busy, but even the way he acted towards us after that was different. He didnt even tell us to have a good day after handing us our bill, and he didn't bother to even say thank you for coming...<br><br>I would definitely come here again, but I'd hope to be seated at a window seat, and I also hope that the waiter is nicer...", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/89OJCQeubPk-KYVak-HL3g/348s.jpg", "caption": "Delicious short ribs that cut so cleanly"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pKUgR9Lf1b75dDaB3FQI1w/168s.jpg", "caption": "Delicious avacado toast with poached eggs"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3oAKZdedGqlloa8pKOxG5g/168s.jpg", "caption": "Inside the restaurant"}]}}, {"review": {"des": "If your looking for dinner with a nice view, this is the place to go. It's conveniently located on Magnificent Mile. Once you arrive, you take an elevator to the 95th floor where you'll find the restaurant and also their signature lounge area. Food and service were great.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GmW5Azcn8M0buTCcs5oKVQ/168s.jpg", "caption": "Great view of the city!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HbF4TwGsNHfrko8lOWTRJw/168s.jpg", "caption": "Half Roasted Chicken"}]}}, {"review": {"des": "We celebrated my friend's birthday at The Signature Room and had a lovely time. We were lucky to be seated near a window seat. We started off with a $54 bottle of chardonnay and a dozen fresh oysters ($40). The oysters were tasty and fresh, though not hugely plump. It did come with horseradish and cocktail sauce and mini tabasco. We were offered complimentary bread and butter. In addition, we also split a shrimp dejonghe appetizer ($20). The appetizer comes with 4 pieces of jumbo shrimp on toast points. This appetizer was nothing to write home about, I feel you should skip it.<br><br>For appetizers, my friends and I got the rack of lamb, 7 oz center cut fillet, and 14 oz strip steak (ranging $43-47 per entree). We also got two sides, the marinated mushrooms and the fried brussel sprouts with feta. These sides were $10 each and pretty tasty. We asked for our steaks medium rare, and they delivered. My steak was missing a crust though which was slightly disappointing for the price. My friend said her lamb wasn't great either. <br><br>For dessert, we tried the key lime cheesecake, flourless chocolate cake, and vanilla bean creme brulee, $10 each. The desserts were all very tasty! Yum.<br><br>Our total bill was a little over $350, but you're paying for the view and the ambiance. I would return only for a special occasion.", "pics": null}}, {"review": {"des": "Very good experience. We went for a Bachelor Party celebration and had a very good time. First off, the view is breath taking! One of the main reasons we went to this place. The service was spot on. It was the exact type of service I expected from a place like this. Knowledgeable servers who knew the food and menu inside out. They had perfect recommendations as well. <br><br>I went with a surf and turf option and was not let down in flavor. Lobster was good but I was slightly disappointed in the size vs price. Steak was cooked very well (it was actually rare) and the mushrooms I got on the side for the steak were delicious. They gave you a huge portion of mushrooms which was great. <br><br>The reason this isn't a 5 star review is that I really didn't enjoy the Knob Creek Old Fashion I ordered. Was very let down by that. The flavor was just not there for what I was expecting and paying for.", "pics": null}}, {"review": {"des": "Loved this place!<br><br>Came here around 10-12 years ago when some friends brought me here.  When planning this trip, I vaguely remembered a gorgeous view and an amazing buffet.  Looked on Yelp and Google and found out that it was this place.  Made a reservation via Open Table for my husband's first time in Chicago.  <br><br>Then I realized that I needed to ask when the buffet was available.  Called and found out that it's only on Saturdays and Sundays between 10am and 2pm.  $55/person.  Open Table only had 1:30pm available for those days, which seemed a bit late, but I took the spot.  I kept checking every day and soon jumped at an available 10am slot.  <br><br>We wanted to get there early to get one of those prime window seats (where you can see a great view of Chicago).  We arrived at the building (same building as the Best Buy and Cheesecake Factory) at around 9:45am. This was later than my husband had wanted, but it worked out because they don't open the doors to the elevator until 10am promptly!  When we got there, there were about 2-3 parties waiting in line.  By the time 10am rolled around, there were quite a few more parties waiting in line on both sides of the entrance.  <br><br>The elevator up to the 95th floor was surprisingly smooth and fast, and didn't feel like we were going up so high at such a fast speed.  I had thought that the place would be filled up to the max at the 10am seating, but it was pretty empty at opening and only gradually filled up in the next couple hours.  It was never completely full, however.  For example, the tables in the middle were never full.  So I'm guessing you could probably get a table without a reservation if you needed to.  <br><br>Fabulous servers Patrick and Damian.  Treated us like royalty.  The buffet section was spectacular.  I loved seeing the reactions to people (especially kids) who would walk to the buffet area and their mouths would hang open and they'd be like, \"WOW!!!\"  <br><br> Loved the fruit (the pineapple and honeydew were so sweet!), the cocktail shrimp, the king crab legs, the Cuban rolls (I don't usually like egg rolls but these are amazing), and the dessert bar.  My husband loved the omelette bar and sundae bar as well.  (I was too stuffed for either).<br><br>In addition to the buffet line, you also get to order from their menu.  We had the short rib, the steak and eggs and the lamb chops.  The short ribs on our first go was great.  Second time it was a bit dry.  The steak and eggs were good, but by the time we had ordered it, we were pretty full already.  The fresh squeezed OJ was delicious.  (Non-alcoholic drinks are included in the buffet).  <br><br>Awesome views.  Fabulous food and service.  Definitely a must do when visiting Chicago.  Previous Yelpers talked about a great view in the women's restroom but either I went to the wrong restroom or they changed the restroom.  Didn't see any view from the women's restroom on the 95th floor.  Maybe in the club level or on the other side perhaps?<br><br>I can also see why Yelpers commented on the spiders on the windows.  :P  I guess it would be difficult to clean those windows so high up.<br><br>We'll be back the next time we're in Chicago!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XC85wbGXdlD6nKY3ZjcSeQ/348s.jpg", "caption": "Omelette station"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2pWk_6n_qfItXpvjjKpJCA/168s.jpg", "caption": "Fabulous sweet fruit"}]}}, {"review": {"des": "Second time here to celebrate Thanksgiving. For $80 + tax and tip, you get all you can eat of the buffet AND a main course. Definitely a ton of food that's very good. Elevators were down due to the breaking of one the other day, so that was a little challenging using the freight elevators. Also, a manager/someone who worked there, ran right into my husband while he was carrying food and didn't say a word. Noticed waitstaff in the way a lot and bumping into people. Overall, food was a big thumbs up.", "pics": null}}, {"review": {"des": "All stars are definitely for the view! Women's bathroom has the absolute best one! Even better than from any of their dining rooms. Food is extremely overpriced and just meh. I mean as underwhelming as it gets. I never had a dish there that I have actually liked: lobster bisque with a 1.5 inch piece of lobster in it, seared barramundi that tasted liked if was defrosted then frozen again 20 times before it made in onto my plate, scallops were rubbery and chewy, steak was very average, drinks were weak and overall the dining experience was a disappointment. I love my food as much as I love the scene so a good dining experience can not exist for me without those two seamlessly blending together. Unfortunately, the Signature Room delivers on just one of those conditions: the view. It is extremely crowded if you decide to go to their lounge so I suggest booking a table instead to avoid all this hassle. I will not be back.", "pics": null}}, {"review": {"des": "The view was spectacular! Do yourself a favor and make a dinner reservation earlier in the evening to enjoy the view of Chicago in both day and night lights. They take window view request upon arrival and based on availability, so if you beat the dinner rush, there is a higher chance you get to enjoy the food, while admiring the skyline.<br><br>Main entrees and desserts were delicious and service very attentive. We ordered salmon fillet, that had the crispiest skin, and the softest duck breast. Toping with the creme brulee for dessert, which disappeared within seconds. The only setback was the size of the portions, so don't forget to order appetizers if you want to walk out feeling full. Highly recommend lobster brisque soup that will exceed your expectations.<br>Cocktails on the other hand were all you want and more: strong and tasty.<br><br>Great experience overall!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NL4FrZrvElDg-DWNLfyzeA/348s.jpg", "caption": "Creme brulee"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/il3AvN_hrdESqgmvQM3fRw/168s.jpg", "caption": "Nightlight view"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GB4Vi4VMNbd4AfthBb-hxg/168s.jpg", "caption": "Daylight view"}]}}, {"review": {"des": "Great place with a great view! Reserved a spot at 5:30, showed up at 5 (when they open) Tables were first come first serve so we got the best window table. Waiters were really good and friendly (they can take really good pictures)", "pics": null}}, {"review": {"des": "We were looking forward to a girl's night dinner with great food and views here, but we were not impressed at all. While I understand that you're paying lots for the views from the restaurant, service was absolutely terrible here. <br><br>We called the morning of to book a reservation for that night around 8 pm. They require you to give your credit card number, because they charge $20 for each no-show. We showed up before our reservation and were seated immediately.<br><br>After perusing the menu, I ordered the Seafood Pasta ($48), which came with Pappardelle pasta, half South African lobster tail, crab, shrimp, mussels, cherry tomatoes, fried capers in a lemon wine cream sauce. We were first served dinner bread, which was pretty standard. 30 minutes passed and our entrees had not arrived  yet. We waited another 20 minutes before asking our waiter, who said the entrees would be right out. We ended up waiting another 20 minutes until our food came. So basically 70 minutes after we were done with our bread! We were all ravenous by this point.<br><br>The Seafood Pasta was nothing special at all. There wasn't much sauce in the dish. While there was a decent amount of seafood, 2 of my mussels were empty... The noodles were surprisingly al dente.<br><br>The food is excusable, as you're paying for the views. But to have service at such a fancy restaurant be that slow is not ok at all. I will not be coming back. I'd much rather grab a drink upstairs at the Lounge and enjoy the same views with better service.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jzCTQfT3FgKxAjAd_9S-iA/348s.jpg", "caption": "Views"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4iSauqmcP6xIw3kj9eADvg/168s.jpg", "caption": "Views"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/H9BUR4GjC6ogRyJH5trjRQ/168s.jpg", "caption": "Seafood Pasta"}]}}, {"review": {"des": "Every building that I go to, (being a structural Engineer) is somewhat reduced to what makes it stand. And in my opinion, what makes the signature room stand is simply being in the John Hancock Building. Sure, being on the 96th floor was incredible, and the view was superb. In fact, the reports from my girlfriend indicated that the best views were in fact from the ladies room. However, I didn't really find anything special other than the fact that it was located in such a recognizable landmark. <br><br>The restaurant and bar area itself was sort of dirty: not like the \"wow they never clean this place\", but more like \"wow this place is touched a lot\", as I'm sure hundreds of people filter through daily and it certainly shows. There are some interesting decor choices, and overall, I suppose, it was just not as classy as I expected. It is a definite tourist trap. <br><br>If you read my other reviews, you'll know I'm a fan of old fashioneds and creme brûlée. I ordered both here, and my girlfriend got a cocktail as well. Both were acceptable, but the creme brûlée was not fresh and was nowhere near as delicious as the price would indicate. The old fashioned was, well, okay. My girlfriends drink, while I can't remember the name, was made of ocean spray cranberry and dole pineapple juices and Bacardi. Both juices were straight from the bottle and can, respectively, and seemed less exclusive than I was led to expect, again, considering the price. <br><br>If you've read to this point if the review, I salute your ability to endure painful rambling. Ultimately, go for the views, stay if your money is burning a hole in your wallet. Nothing other than the view really sets this place apart, and from my experience you are more likely to get a better experience from a lesser known restaurant off of the mile.", "pics": null}}, {"review": {"des": "Fabulous! Simply fabulous! <br>My husband and I were visiting to celebrate his birthday, I had made reservations in advance and asked to be seated at a table with a view. The hostess informed us that it would be about a 45min wait for a table wth a view as opposed to a random table without one, where we could be seated immediately. We decided it was worth it to wait. I think we waited a grand total of 15 minutes. The hostess was extremely accommodating and nice!!<br>A seat with a view is what was delivered! Breathtaking views!! <br>My husband and I both got filet with the whipped potatoes. Absolutely heaven. Definitely top 5 filets that I've ever had, and I've had many. <br>They waitstaff was very friendly and brought crème brûlée to my husband with a birthday candle! It was a birthday dinner to remember!!!", "pics": null}}, {"review": {"des": "Food quality could be better and atmosphere was great up. Everything was okay until we got our dessert. We would have never noticed what was wrong if we didn't take pictures of everything we ordered. They didn't use gloves to plate our dessert because there were fingerprints captured in our pictures!!! Gross. It makes me wonder if the rest of my food was handled properly. A bit disappointed in the service quality for a restaurant on this level/status. Sure, we weren't charged for dessert but we did not even get an apology or any complimentary dessert/drinks or a gift certificate to come back for what they did. I think I will only be back for their drinks and breath taking views at their lounge. Sad to say, if not for that, I wouldn't be back ever again.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WpIn5yy5pjKOGtz5s4WgMA/348s.jpg", "caption": "Duck breast was perfectly cooked. That crispy skin though."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8gW1KuIUTHAjbwHS1CjbgA/168s.jpg", "caption": "18 degrees outside but such an amazing view."}]}}, {"review": {"des": "Wow! One of the most memorable experiences of my life! View is simply breath-taking. Food was great, staff was friendly and attentive. Reasonably priced for the spectacular experience and quality of food.", "pics": null}}, {"review": {"des": "Beautiful view! Food was good but not outstanding- I guess when you factor in the view it becomes a good deal.<br><br>There was a buffet of seafood, and omelette stand. The seafood area had a oysters, crab legs and salmon. The oysters were quite good. The crab legs for interesting-they had been sliced in half so you did not have to crack them open yourself. However, it seem like they were a little bit soggy from sitting on the ice. I was not so impressed. The smoked salmon however was fabulous. <br><br>You could also order unlimited entrées from the menu. Both my sister and I had the lamb chops. Rare. The waiter seem to raise his eyes a bit when we ordered them rare, but we did not care. This was the best part of the meal.<br><br>We we're still a bit hungry, so we looked at the menu again. We had to flag down the waiter to get the menu, perhaps because they were not used to people ordering twice. My sister got the eggs and avocado toast, and I got the short ribs. Both were very good. We had to leave a bit of the food on the plate because we cannot finish it.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_JY_RD47mEabXdVGuzLHlg/348s.jpg", "caption": "View"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1IBL5wFq1l8C3t5y9tJbWQ/168s.jpg", "caption": "Short ribs."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/few8DSSsmwUgJZ2pm7AtpA/168s.jpg", "caption": "Poached eggs on avocado toast."}]}}, {"review": {"des": "I love this place. I was visiting Chicago over the weekend and I really want to visit John Hancock center so I thought the weekend brunch ($55) would be a good idea. <br><br>Right after our arrival, they brought us to our table, with a gorgeous view overlooking the city. The restaurant wasn't busy at all. There are unlimited seafood and desserts at the front of the restaurant and also things you can order off the menu (unlimited as well)! We ordered the short rib, lamp chop, avocado toast, French toast. I know the brunch is expensive but for unlimited seafood, an amazing view and great service, I think the price is fair. Just going up to the observation deck already costs $20! <br><br>All in all, highly recommend this place and I would definitely visit again ;).", "pics": null}}, {"review": {"des": "I can only review the bar not the main eating area.  <br><br>The bar was pretty but cramped with tons of people.  We say facing a window across the bar so we could see a little of the view.  The drinks were good but not 20$ a piece good. My main beef was with how tiny the bar was our knees were in our chest! The chairs are tiny and the bar is super short.  Not bad for 1 drink to see the view but nothing more than that.", "pics": null}}, {"review": {"des": "Now i see why the star rating is so low. I am only giving the 3 stars because of the view.  The service wasn't all that grate had an empty glass for a while the food had no flavor.  If i did come back it would be for a drink and the view.", "pics": null}}, {"review": {"des": "While in Chicago my friend and I booked a brunch at The Signature room for her birthday. The experience was unmatched between the food and the views. We were able to score a table that was by the windows, which made the atmosphere better. They had made to order food from a menu that was included in the price as well as a \"buffet style\" area. For 55 dollars, this high end brunch was worth every penny. The drinks were delicious as well. I got steak and eggs as my starter and everything was fresh and delicious. This is a must see if you are in the area!", "pics": null}}, {"review": {"des": "This was such a classy buffet for so many reasons, including the views, the amazing service, and the atmosphere that they provided for customers. Almost all other buffets pack in people to try to make as much money as possible, but The Signature Room Allowed us to check in and get an early while holding people back to allow for the buffet to be easy to reach. I got to try everything, which included a fresh seafood bar, salads, soups, leg of lamb, and a whole dessert bar of little snacks that would satisfy everyone's needs. They even had crab legs, which I had never had cold but I really loved with lemon. Quite intimate and cute, I can't wait to try it again. <br><br>The free glass of champagne was brut and just alright, but you could order whichever entrees you wanted-- yes, plural! We ate duck, fish, steak, pancakes, chicken, and still got to try crime brûlée and carrot cake on Easter Sunday.", "pics": null}}, {"review": {"des": "For the price of a cocktail you get amazing view from on if the tallest buildings in Chicago. Sunset is a great time to get there and honestly you don't need to wait for a seat next to the window. They allow you to walk around the whole place so if there is a wait just say you don't need a table next to the window. You won't be missing out.<br>Also the view from the restroom is superb. <br>With a visit every time I'm in Chicago.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1DU0yfY9Ladfn9pfupeYGQ/348s.jpg", "caption": "View from the restroom."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/14cwGZmoiLMGiggS7gYi4w/168s.jpg", "caption": "Chicago is beautiful"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eTxriSllOw8t1gaPUXScJA/168s.jpg", "caption": "Looking north"}]}}, {"review": {"des": "Gorgeous sights and delicious food! I've gone to the Signature Lounge a few times in the evening and just recently went there during the day. I think the view is best during the day for sure. This is probably the most photogenic place in all of Chicago! I recommend putting in a reservation before you visit. They don't seem to get overly crowded but it's good to play it safe. It's pretty dead at 11am when they open, so you can get prime seating at that time. Ask to sit by a window. <br>Tip: If you're just dropping in for dessert, don't expect a seat at the Signature Room. They'll tell you to go upstairs to the noisy Signature Lounge. There's usually a line out the door for that and obnoxious music playing. You need to have an entree if you are visiting the Signature Room.", "pics": null}}, {"review": {"des": "What an absolutely breathtaking view!<br><br>My boyfriend originally wanted to take me to Chicago for our first date. Because we met online and that would've been my first time meeting him, I declined. That was over a year ago and we've talked everyday about visiting Chicago since. He always heard about the great view at The Signature Room and instantly knew he wanted to take me there.<br><br>I didn't really think much of it, because no one has ever wanted to take me to a nice dinner before. But he never let it go, even going as far as buying me a new dress and heels for the occasion. Before we knew it we were planning our trip. <br><br>We made sure to make reservations a few weeks in advance and even showed up a tad early on the off chance we got a window seat (Which we did! Absolutely worth it!) <br><br>The space itself is romantic and cozy. Tables are lined up against the walls and the added candles at each table added to that ambience. <br><br>Our reservation was for 9:30 PM and we were seated around 9:10. The hostess was extremely kind and welcoming. Service after was basically our waiter and server being on autopilot.<br><br>My man and I split the shrimp appetizer to start. I'm not the biggest seafood fan, but this was cooked to perfection and spiced just right. 4 shrimps are about $20. From there we each ordered the half roasted chicken, which came with creamy creamy grits and other vegetables. We also shared the mashed potatoes and vegetable sides. Overall the chicken was amazing! Extremely soft and delicate. The sides weren't necessarily worth the additional $10 each, but they were still delicious. We also shared the Creme Brûlée dessert -- which I would highly recommend! What an amazing ending to a fantastic meal! <br><br>Our view, according to my boyfriend, was the best seat in the house. We loved seeing the city so lit up at night. Overall we loved the experience and we would love to return again someday!", "pics": null}}, {"review": {"des": "Atmosphere: phenomenal with spectacular views! You are absolutely paying for the view more than anything else. <br><br>Service: the hostesses were nice enough and attentive, and the assistant waiter was very attentive and hard working; however, our waiter lacked personality, appeared somewhat pompous, and was a little rude to us. He seemed annoyed by us, and appeared to have little interest in us once we did not order an expensive bottle of wine and asked if he would take our photo. After asking, he abruptly walked away with a distasteful look on his face and had apparently asked the assistant waiter to take our picture since he rushed over to do so. I completely understand that being a fine dining waiter is a career and taking photos of patrons is not the most glamorous of roles, however it should be expected in a restaurant that is clearly known for its views and not its food. <br><br>Food: Since the menu had multiple items we wanted to try, we decided to share multiple items (our waiter was not pleased by this either). We started with the gnocchi, then each had a Caesar salad, then shared the filet and potatoes. All of the food was okay. The gnocchi wasn't quite like your typical gnocchi and seemed to lack flavor. The Caesar salads were decent, but the dressing tasted like kraft and we expected better for a fine dining restaurant. We've definitely had a lot better at similar restaurants. The steak on the other hand was cooked perfectly and we enjoyed it! It wasn't the best we've ever had, but it was definitely enjoyable. The potatoes were also good. <br><br>Drinks: my husband and I both had the blood orange margaritas which were delicious! Not $17.50 delicious (this seems to be the going rate at fine dining restaurants or hotels in Chicago though), but strong and tasty! <br><br>All in all you are paying for the view when you come here. The food and service could be improved. I recommend going here for brunch or going upstairs to the lounge to have the similar views at a lower cost.", "pics": null}}, {"review": {"des": "I been going to this restaurant since 1993 at least twice a yr. Today On Columbus Day we had reservations for 4 people with a special friend that has not been to the Signature Room ever. I requested a widow table which I didn't get but other guests did with out waiting for one. Lola the Hostess had extremely bad attitude and I know on purpose she didn't give us a window table. I requested the manager and  he didn't do anything to make us happy or about the bed customer service from Lola. We still had a great lunch and spent $220. So disappointed that in high end restaurant to have a hostess treating guests with a bed attitude.  So sad, after coming here for years and years we get treaded very poorly. Te waiter was amazing. <br>Thanks <br>Donna", "pics": null}}, {"review": {"des": "Nice place lots of history great view. Unfortunately the drinks are mediocre. Old fashioned with regular maraschino cheap cherries instead of luxardo cherries really makes the drink dull and cheap. Its like a fruit salad.", "pics": null}}, {"review": {"des": "I loved my surprise birthday dinner at The Signature Room! I hadn't moved to Chicago yet so the views were extra breathtaking. That is definitely the reason people dine here.  We got to our reservation early for drinks at the lounge beforehand.  There was a line to get in but if you have a reservation you are allowed to skip it. The cocktails are pricey but again its the view you are paying for.  Once we sat down for dinner, I was taken back when the menu said \"Happy Birthday Mikayla\" at the top of it! My boyfriend said that this is something offered for special occasions and staff at The Signature Room was easy to work with. They also give you a copy of the custom menu to take home with you, that is a nice touch! The food was good, not the best steak I've ever had, but by far not the worst.  We also tried the seafood pasta, potatoes, and a shrimp appetizer that was yummy.  For desert they brought out chocolate covered strawberries and who doesn't love those?!  All in all, it was an awesome dining experience at The Signature Room.  I have and will continue to bring friends up for at least a cocktail when they come to Chicago!", "pics": null}}, {"review": {"des": "After years of dying to come here it finally happened and it made celebrating my 32nd birthday feel oh so right. So adult, so mature, so fancy and classy. =-) I decided to book a reservation for the weekend brunch because it seemed most cost effective and more bang for your buck. <br><br>I had never been that high up in a skyscraper before so I was beyond nervous and wasn't sure if I would notice. The elevator goes 20 floors every couple seconds I believe, which is crazy. The beautiful John Hancock building will be turning 50 and still looks as glorious as ever. Our reservation was for 2 PM, assumed it would be packed but to my surprise there were maybe 7 other groups there, we even got to sit by the window!! I honestly can't even begin to describe how incredible the view was from Signature room but you can kind of get an idea via my photo's. <br><br>The buffet options were glorious! danishes, bagels, seafood section ( I tried my first oyster and hated it haha) yummy salads, coleslaw, cheese platters, fruit platters, and assorted desserts. We loaded up our plates and returned to our table and hadn't even thought about ordering entrees, the only downside is the fact that we had to hurry up and order because the kitchen closes at 2:45 and the buffet closed shortly after 3pm I believe. For our entrees (you can get as many as you want!! drools) I went with French Toast Bread Pudding and the steak/eggs. Firstly, the steak was cooked to perfection and was sooooo juicy. My date went with Bananas Foster Pancakes and the Brunch Burger, both were heaven in my mouth. <br><br>I am 100% addicted to Signature Room and CAN NOT WAIT to have a reason to return. One of the best experiences of my life.", "pics": null}}, {"review": {"des": "Love this place. It's amazing. The view is simply beautiful. Get to spend my last night in Chicago w my bff, enjoy some cocktail while observing the nice view. It's a lil pricey but you get what you pay for. I would still come back. And bring family members to come out for a nice drink w good view.", "pics": null}}, {"review": {"des": "I had lived in downtown Chicago for 6 years before I came up here.  It was always on my city bucket list but not very high.  I took a friend who was visiting because there was nothing better to do on a gloomy, rainy winter day.<br><br>The views can be a hit or miss depending on your luck.  We got lucky and were able to be seated by the window facing west which isn't much.  Also, the seating area is a little crammed.  The weather wasn't the best when we went so it was partly foggy.  <br><br>Drinks are pretty pricey for average quality/creativity but the customized napkins and drink tipper are a nice added touch.  If I remember correctly drinks averaged $16 + tax/tip.  You're paying for the view.  It's a good deal if you're opting to do this instead of paying for Hancock tower tickets.  <br><br>TIP: The women's bathroom had a better view than the seating area.  You can see the Sears/Willis Tower.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IWSRsbWJD7X1C6JjbvZhDQ/348s.jpg", "caption": "View from the women's bathroom"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BQdUVsLvpZIF1JHvACH_UQ/168s.jpg", "caption": "The dining area if you want to actually eat and not just grab a drink"}]}}, {"review": {"des": "Came here with my parents (and my 3 school aged children + infant), who were in town for a visit from California. Lucky for us it was a clear day, and the views were great. The restaurant itself is gorgeous, with floor to ceiling windows and Art Deco interior, and our table for 6 was at the back corner overlooking Navy Pier on over. <br><br>**Be aware that to make a reservation you are required to provide a credit card number, they require 24 hour cancelation notice, and if you make a large party reservation and someone doesn't come you are charged a fee for each person in your party who doesn't make it. <br><br>Service: Service, although friendly, was very slow. This was a two hour lunch, and not because we wanted it to be. The restaurant was not full (several empty tables), there appeared to be plenty of staff, but everything just took forever. We ordered beverages, and those took 20 minutes. We ordered an appetizer, and that took 20 minutes. Lunch did not arrive until about 90 minutes into our visit. After two hours, we finally had to put our jackets on and hunt someone down for the final tab to be returned with our credit card. It was strange.<br><br>Food: It was just ok. Good, but pricey. Not really anything super special, just kind of average run of the mill food. Entrees that the adults ordered were half roasted chicken, chicken sandwich and steak salad. My the time my salad arrived my steak was cold and my lettuce was soggy from the dressing, which takes me back to the whole service issue.<br><br>The View: In short, we came for the view and the view delivered. It was a way for me to show my parents the beautiful city of Chicago without having to be outside in the frigid cold in conjunction with the little driving tour I gave them. This was honestly the perfect activity to do with the near zero temps we've been experiencing, since my mother has arthritis and doesn't tolerate extreme cold very well outdoors. And, it was a way for me to show them all of the great things the city has to offer to do on their next visit when it's warmer outside! <br><br>I'm not sure I'll come back here, but it was on my list of \"Things To Do\" in Chicago. Overall the experience was worth it, but for me I think once is enough.", "pics": null}}, {"review": {"des": "Just enjoy a high-end fancy meal before going for the Hancock tilt. Honestly, everything has met my expectation. The lobster bisque displays a richness and elegance on the palate, while the scallop main course is well seared with a nice surface (though it does not look beautiful enough) and tender taste (it's also super juicy inside with a typical aroma that only flesh seafood has). Really appreciate someone mastering a scallops dish, cause it's extremely challenging to sear every piece of them evenly. <br><br>If there is something is to complain about, it's that the place is always packed with people during the weekend, so it could be a little noisy, which makes it hard to call the waiters sometimes and hear the piano playing. So make the reservation or else you will have to wait in a long line!", "pics": null}}, {"review": {"des": "Incredible view even in the ladies room! Sangria and bloody Mary's were awesome and dining area is gorgeous!", "pics": null}}, {"review": {"des": "This was one of the first stops I made on my trip to Chicago, and I was blown away by the views! Expensive drinks, yes, but, according to my friends who live in Chicago, The Signature Room has an even better view than the one Willis Tower affords. We got seated immediately at a table in the corner, which gave us an amazing view of the water and city skyline!<br><br>Considering one drink here is cheaper than admission to Willis Tower Skydeck, this is the place to check out instead. Ladies, be sure to make a trip to the women's restroom for what is apparently the \"best\" view of the city! Sorry boys, no view from your bathroom apparently ¯\\_(ツ)_/¯", "pics": null}}, {"review": {"des": "In town for thanksgiving with wife and nephew, staying with brother who relocated here ages ago. He brought us here 2 days after the elevator incident just before thanksgiving, ride up was very interesting ( freight elevator) but worth it. We were greeted and seated right away ( window over looking navy pier and lake) food was excellent wait staff great and friendly compared to our experience at Cité , night and day. Wouldn't hesitate to recommend coming here , aside from the elevator problem ( which was being addressed as by replacing the cables on all 3 guest elevators) this was one of the best dinners we enjoyed in a town that has great food on every street", "pics": null}}, {"review": {"des": "Went here as part of a business dinner. View is spectacular (I do wonder how all those spiders in the window corners survive - I wouldn't have thought bugs flew up that high in sufficient numbers to reliably feed spiders, but guess I'm wrong!)<br><br>Food, however, was mediocre. Huge disappointment on that front. Especially the desserts (sad brownie type chocolate cake that tasted like a prepackaged Little Debbie cake, and a peach blueberry cobbler that our local supermarket bakery could beat hands down).<br><br>Recommend you just go to the observation deck of any tall building in Chicago for the view, and save your dollars for a truly great restaurant elsewhere for dinner.", "pics": null}}, {"review": {"des": "We dined at the Signature Room on Wednesday June 13th. From the start our experience was epic! <br>When we called for reservations the hostess was welcoming and accommodating. <br>We arrived at the restaurant and were immediately greeted and walked to the most beautiful table located along the window overlooking the pier!<br>Our server Ruslan was efficient and patient.<br>We sent back a side dish as it wasn't what we were expecting and Chef Giovanni personally came out to check on us and suggested a side dish that was exactly what we were looking for. <br>Chef also spent time with us to make sure we were completely satisfied with our dinning experience. We would of left and missed the magical fireworks show if he hadn't had filled us in on this surprise! <br><br>Oh and I'm almost forgetting the best part! The personal tour around the lounge and the Womans restroom view was mind blowing!!!<br><br>We seriously can't thank Chef Giovanni and his team enough for making our evening and visit to Chicago so memorable Chef G", "pics": null}}, {"review": {"des": "I went there for drinks.  They were nice and strong.  The view is spectacular at night.", "pics": null}}, {"review": {"des": "So it's a surprise for our Anniversary! The reservation was smooth and we reached in time to be seated at the corner table facing the Navy Pier! The service was excellent but slow at times! Food was great! Warm, fresh and well presented! Not the unhealthy typical big portion sizes!<br><br>Drinks ( Virgin Mojito and pin-a colada ) were great! Soup and Deserts ( creamer brûlée and Mango coconut panacotta ) outstanding! Entree halibut and Veg Lasagna were good but not outstanding. <br><br>Can't beat the views! The romantic ambience when you book just before sunset! The bonus is the fireworks at Navy Pier on Wednesday and Saturdays! <br><br>A place to visit and the money worth spending.", "pics": null}}, {"review": {"des": "We a beautiful enjoyed the buffet here at the signature room. The buffet offers a great variety and includes a prepared menu item. Everything was very tasty however I couldn't concentrate very much in the food as all focus durning this dining experience will be on the view! From entire Chicago coast to the city skyline this view has it all!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SuaySsuAJhrOxGB_ECg07w/348s.jpg", "caption": "Root beer float !"}]}}, {"review": {"des": "One of the best views in Chicago!<br><br>We went on a Saturday night around 6 pm, waiting approximately 20 minutes in the lobby to get upstairs, and 10 minutes to get a seat at the bar. <br><br>The view is definitely the highlight of the Signature Room. <br><br>Drinks were priced as expected, $17 for a glass of champagne. The white and dark chocolate mousse cake was surprisingly good and reasonably priced at $10. Highly recommended. <br><br>Overall worth the visit and recommended if in Chicago for the weekend.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VRSP0Li8iVdnv4oC_IGdmQ/168s.jpg", "caption": "View of the city."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ioYSQL6fvmp7ZiJJwqdlDQ/168s.jpg", "caption": "White and dark chocolate mousse cake.   Delicious and reasonably priced!"}]}}, {"review": {"des": "I and my family wanted to go up to this place for brunch. I am sure this place is very nice. BUT one thing I really wanted to complain is the lady at the elevator route. Instead of giving us information she'd rather be misleading us the information and not working professionally with her grumpy face and voice tone. This is about rude to your customer. We ended up not to eat there.", "pics": null}}, {"review": {"des": "I was so looking forward to having dinner at this place as it came highly recommended, mainly for its view. I wish I would've saved myself the experience and just stuck with the view at the bar upstairs. Dinner was mediocre... Took incredibly long to be served. And in between taking the order and receiving the meal (1 hour plus) the server neglected our table completely. No offer a refill or drink, nothing. When I received my meal, my steak was cold and they forgot the butter I requested. When they brought the butter out, it was rock hard and also cold. Lack of attention and lack of consistency. <br><br>On a positive note, I received a survey a few days later and after I filled out the survey, I was contacted by their Director of Service. He apologized for the issues I experienced and advised he discussed the situation with our server and the chef. I can appreciate it when an establishment owns up mistakes and tries to implement ways to correct the issues so that they don't happen again in the future.", "pics": null}}, {"review": {"des": "We brought my mom to Chicago for a weekend and surprised her with dinner here the first night. Frankly she doesn't travel so Chicago was just full of amazing moments for her. But the thing she talks about the most was the whole experience visiting here at this restaurant. We brought her here for her birthday and we asked for a window view. We are totally expecting to have to wait to get this but they seated us immediately. And we booked it just the perfect time so we got to see The View with light and as the light started to change and then of course at night when it becomes just magical. The food was very good was the first time she ever tried Lobster and she liked it which surprised me since she does not like seafood. The chocolate mousse cake was divine and they wrote a happy birthday message on for and brought a candle. The only things that weren't good was the sangria was very tart .. not my preference.  The au gratin potatoes were ruined by the over powering truffle oil... dont know if could have requested it be eliminated??<br><br>I took her to the ladies room in the upstairs bar area because I knew the view. When we got on the elevator to go back to our seats at the dining room they didn't hear us and they took us all the way to the bottom when we explain that I just hang Lee said oh that's okay we'll just take the stairs. They took me totally serious and said oh no no no no you won't want to do that. I gather they don't have a dry sense of humor.<br><br>The whole experience was just wonderful from The Uber ride to the beautiful lobby with that neat sculpture that looks like a huge dandelion the staff were all so friendly and nice helpful. My mom felt like a princess on top of the world isn't that how everyone should feel on their 85th birthday. Our server Chris C was very attentive and friendly. Just a great special experience if you can afford to go there for a special night out definitely do and if you can't go and have a drink at the bar or two you still get to see that wonderful million dollar View. If we're going to be gauche talk about price... my husband and I both had one alcohol drink are meals and we shared a dessert and it was a little over $300 but we did get the surf and turf and several side items so share. You can definitely do it cheaper but not cheap. The great setting for a special night like a birthday anniversary or place to propose at our age we just celebrate being able to get around LOL", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DjK5Vh4Dnr_SShLOUq-Cdg/348s.jpg", "caption": "surf and turf"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xwKX-MQo_TsMsevXm1wO_w/168s.jpg", "caption": "fried gnocchi were ok"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PT8eCQ_ETIBWONPyguBKqw/168s.jpg", "caption": "our awesome server Chris"}]}}, {"review": {"des": "Was super excited to try something new and capture a great view of the city. Unfortunately, the day that I was in town, it decided to rain on and off all day. We weren't going to let that stop us from eating and drinking in the city.  We came to the signature room around 5-6 to beat the crowd. <br><br>We made it to the lounge and it was fairly empty. It was still early on in the night. It's first come first serve on this floor. We got sat and took a look at the menu for drinks. We didn't rally care for our table and asked to move near the window when another couple left.  We moved and were able to enjoy our experience a lot more from here. I suggest you take a window seat when you come.  Even on a rainy day, the views are amazing. The views are even better in the bathroom. Weird, I know. <br><br>I ordered the signature room punch; it was delicious. we ordered the chips and guacamole and it wasn't bad to munch on while we chatted away. <br><br>I really liked the ambiance and vibes here. I don't live in Chicago anymore, but I highly recommend everyone stop in, even just for a drink. I think maybe next time I'd like to eat downstairs in the restaurant.", "pics": null}}, {"review": {"des": "Took my fiancé here for brunch, prior to our engagement, and it was a dream for us. We were right next to the window and we had a beautiful view.<br><br>The two gentlemen took care of us like we were VIP and my fiancé couldn't get enough of the atmosphere. <br><br>Last, but not least, the food was great! Couldn't have asked for a better brunch. If there is a better place in Chicago, then let me know. This, by far, was my favorite brunch in the US thus far.", "pics": null}}, {"review": {"des": "What to get: any cocktail<br>Service: 4/5<br>Atmosphere: semi-dressy, sit down<br>Wait: 20 mins (Sunday 9PM for 3)<br><br>The Experience: [March 2017]<br>Whenever I visit a city, I must find the best spot to view the city at night. It's tricky to find high up spots that don't cost too much, but for the price of a drink, the Signature Room allows you one of the best spots in Chicago.<br><br>I'm sure during the day, it's like any other of the views from the top skyscrapers, but at night is when the magic happens. Again, since it is the price of a drink rather than the price of a ticket, I'd say it's a great deal. Are the drinks amazing? Not compared to the multitude of cocktail lounges around town, but I see it as paying for your view.<br><br>When you get out of the elevator, there's two lines: 1 for window seats, and the other for all other seats. Luckily, there are viewing areas (though very small) by the windows if you don't get a window seat. Most people are understanding if you're blocking the view to get a picture (though, I'm sure it gets to be obnoxious). Even the women's bathroom has full length windows (which is slightly strange), so you can enjoy the view even from in there [I wouldn't suggest it, but just know that it's there].<br><br>As an amateur photographer, my best tip is to take a picture with your camera/phone against the window. NEVER turn on the flash because the light will just bounce back at you or make you look like a ghost (ugh). Other than that, get your shot and enjoy your drink with an amazing view.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6gRwpSW-VDgxphg1uA2mlw/168s.jpg", "caption": "One of the best skyline views of Chicago"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hiAEyelelfDJjB_rR7vT_g/168s.jpg", "caption": "Drinks with a view"}]}}, {"review": {"des": "Beautiful restaurant with amazing food! Had dinner this past weekend there to celebrate my boyfriends birthday! View was spectacular and the food was amazing.  My seafood plate was so yummy and full of flavor, and my boyfriends meat was so tender and tasteful. Our waiters were very helpful and attentive! I would highly recommend this location for a special day!", "pics": null}}, {"review": {"des": "Love the food, the service and love the ambiance. Going up the elevator is so fast you won't feel anything but your ears pop lol!!!!! When I travel to Chicago to visit family I have a date here with my hubby and everything is always yummy!!!!!", "pics": null}}, {"review": {"des": "We visited this lounge on our first trip to Chicago and we loved it! My husband and I ordered a couple of drinks and dessert from this. The service was good, very professional and friendly. The lounge had a 360 view that over looked the city. We visited after dark and it was absolutely beautiful! The best view in the city!", "pics": null}}, {"review": {"des": "Really nice space. Enjoyed the sangria, chicken. Dumpling soup and lobster salad. All great! Service was great also.", "pics": null}}, {"review": {"des": "Wow! Breathtaking beautiful views here! We came at dusk and watched the city transform from pink and blue cotton candy skies to glittery night with shimmering city lights, right before our eyes as we watched the sunset. Gorgeous views! I highly recommend arriving around dusk to watch the sunset. <br><br>Admission to the actual John Hancock Observatory is $21. They had another offer, Drink with a View, for $26 which included access to the observatory and a cocktail which is a great deal considering most cocktails on the menu were around $17.50 alone, so in essence with the offer you're only paying $5 for a cocktail. I had already purchased City Pass or else I would have taken advantage of this offer. You could also just ride up the elevator for free and just visit the Signature Room for a cocktail and walk around and look at the views of the city there. <br><br>There is a decent size wait time for the elevator up to the 95th floor of the Signature Room. Elevators are somewhat small especially compared to Willis Tower. Expect your ears to pop as you ride up and honestly it's a little  claustrophobic in there but they have a tv monitor in the elevator talking about the history of the building to keep you preoccupied. <br>Once you arrive, there are two separate parts, the Signature Room serving full plates and Signature Lounge serving cocktails and lighter fare. We were just having cocktails but there was a significant line for a table. There are significant lines everywhere really. First you have to wait for the elevator up, then wait for a table, then wait in line for the elevator down. We were seated almost immediately because we were a group of five and they had more tables available to accommodate larger groups. Groups of two had longer wait times because there are less two seater tables around the perimeter of the restaurant right at the glass windows with a bird's eye view of the city, and people seem to linger there longer. Would make a great date or anniversary though, if you are willing to wait.<br><br>The cocktails, although pricey, were very tasty. I had the Godiva Chocolate Martini, which was amazing! My friend had the Apple Spice Martini which was also very good. They could only split the check four ways even though there was a group of five which was kind of an inconvenience. Service at the actual Signature Room wasn't bad, albeit very slow, but staff throughout the John Hancock building were kind of rude. When standing in line to the elevator, a member of the staff snapped at my friend when the line was moving. Also, when checking our bags down stairs, the staff member was very rude. Other than that, it was an enjoyable experience. Cocktails with a dazzling view of the city! What could be better? I'd stop in again during my next visit to Chicago.", "pics": null}}, {"review": {"des": "Stopped in for a few drinks and ended up staying for 3 hours due to the amazing views. We did not have food but highly recommend stopping by for at least a drink or two in order to soak in the amazing city views.", "pics": null}}, {"review": {"des": "The view was amazing but make sure it isn't cloudy or it's not worth going. The price is expensive and would only go for special occasions. You get to pick out two main dishes and get the buffet. But for someone who doesn't eat as much wouldn't be worth it.", "pics": null}}, {"review": {"des": "The view of course is top of the mark.  But from the main room you only get to see east and north really.  The other sides are used for private rooms.  If you want to see all around, go to the observation deck for $20+.<br><br>As for the Sunday brunch....well, it's good.  This is not your Vegas buffet however.  There is a set menu of decent sized portioned entrees which are quite good.  The food quality level is higher than your average brunch buffet.  And you can order as much of the limited selection as you want.  But because the portions are so generous, unless you have a garbage bin stomach, you're unlikely to get pass 2 entrees.  This is assuming you are also going to partake in the short buffet line that has some salad option, fruits, and minor assortment of small desserts.  There is also a cook who will do omlettes to order at the end of that line.<br><br>Fountain drinks, coffee, tea are included.  For additional charge you can order mimosas as well.<br><br>So you are paying a lot for the view here.  The food is okay but don't expect 101 options.  Just expect decent food and good service...and weather permitting, some good conversation about Chicago's skyline!", "pics": null}}, {"review": {"des": "I came here with my parents around 11am on a Sunday for our brunch reservation.<br><br>Upon arriving we were seated very promptly.  The interior is classy and luxurious, but the main highlight of the dining room is actually what you see outside: the view.  The windows basically floor to ceiling and they offer a beautiful sight throughout the dining area.  Additionally, there's a live piano player so the ambiance is wonderful.<br><br>The price per person is $50, which actually is not bad at all for this brunch buffet since the price to go to the 360 observation deck of the Hancock building is about $20 and you have to deal with all the people and you don't get food.<br><br>Now in terms of the buffet food, it's easy to see where $30 can be \"gained back\".<br><br>First, there's an entree menu from which you can order any entree you want and as many as you want.  I kept coming back for the steak and eggs, seared baby lamb chops, and braised short rib.  The chef's selection of fish was really good too!<br><br>From the buffet table, I focused heavily on the seafood: raw oysters, shrimp, and crab legs.  I later indulged in the dessert table where the star was the ice cream sundae bar with strawberry flambe.<br><br>Note: alcoholic drinks are not included in the buffet, but I couldn't stay away from a couple mimosas and a bellini.<br><br>Our servers were fantastic and extremely kind, social, and personable to the point where we felt like more than just diners and this is definitely icing on the cake for why this place gets 5 stars from me.<br><br>Overall, great seafood and entrees, amazing service, gorgeous views and ambiance, and a great bang for your buck compared to the 360 observation deck... like just go to this restaurant  instead because you get an immense value for the price due to the inclusion of the buffet with the views.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FiBNheVrbBzNC5VjCZiMHw/348s.jpg", "caption": "Special \"Happy Anniversary\" presentation"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yZTH6z5Jknt7VtQzogwUYg/168s.jpg", "caption": "Dessert"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PYgqbvPMmk3G_eHcZJO4aA/168s.jpg", "caption": "Brunch buffet"}]}}, {"review": {"des": "Great place to go for a romantic dinner. Went here for my gf's birthday/one year anniversary. The view is the best part. Service was great as well. Our server even took pics for us and was very patient. <br><br>The food was good but I thought it would of been way better because of the price. My gf got their chicken and it was dry. It also had no flavor and we didn't even finish it. I got the duck and it was pretty good. They also gave us candles when they brought out some birthday cake so that was nice of them. They really care about their customers, that's why I'm giving them four stars but I expected their food to be better. I would definitely go back just for the views and maybe some drinks.", "pics": null}}, {"review": {"des": "Came up here twice during the weekend. First time was so foggy that we couldn't see out of the windows, but it was also kind of cool (a bit of the \"in the clouds\" feeling)! The second time we came, there was a stunning view of the city.<br><br>We tried a beer, a wine, two of their non-alcoholic cocktails, and creme brûlée. First off, the dessert was delicious! A good serving as well for sharing between 2-3 people. We enjoyed our drinks as well - the beer list was limited, but had a nice group of local brews. I got a glass of white wine blend that was super well balanced and very refreshing! Both of the cocktails we ordered tasted very fresh and came with a cute, John Hancock building shaped toothpick! Overall a great place to stop and enjoy Chicago!", "pics": null}}, {"review": {"des": "The view is amazing and they'll let you check it out without getting a table or sitting at a bar. <br><br>My girlfriend and I had a busy schedule so we just wanted to come in check out the view. It's on the 96th floor and the place is pretty classy. Would dress up if you come. They let us in without getting a table and we walked around and found a few good spots to take pictures. Its pretty cramped and can get busy so don't expect to be spending hours taking your IG pics.", "pics": null}}, {"review": {"des": "It was my father's 85th birthday. My wife and I flew in from Dallas to take my dad (\"Nick\") to dinner there. We like to eat at your restaurant when we are in town. <br><br>My dad had an office in the Handcock for over 30 years and has enjoyed your restaurant and lounge for many years.  It was a memorable experience for him to say the least. Your staff treated my dad like a rock star, very welcoming, friendly, and interactive. <br><br>They even lead the restaurant in singing \"Happy Birthday\" to him. Kudos for making him feel so special and thank you for the FABULOUS time your staff created for his 85th.", "pics": null}}, {"review": {"des": "Signature Room is the alternative to skydeck or other observatory decks. Why pay $20 for a view when you can pay $50 (I know right?) for a view AND brunch? Yeah, it's pricier but the food was actually surprisingly good and the little buffet was nice, especially their seafood.<br><br>For brunch (or any meal) you will want to make a reservation, the earlier time you reserve, the more likely you are to get seats by the window. So for a $50 brunch, what should you expect? Spoiler alert: a lot. You will have the option of choosing as many entrees as you want from lamb chop to fried chicken and waffles to the chef's special selection on fish. In addition to that, there's a buffet where you can load up on pastries, fruit, cheese, cured meats, and seafood. Finally, you can finish up with a dessert section with sweets unimaginable. As someone who loves to maximize on buffets, I probably ordered 3 entrees and filled my plate with king crab legs, oysters, shrimp, and creme brûlées. <br><br>So yeah, it's expensive here so coming up here should be reserved for special occasions, visitors, or wealthy diners. But if you have a chance to dine here, you'll have an amazing view with great food and service. Also, I am sure you can sneak in photo ops here and there without having to wait in line like at most observatory decks.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wvGbOpHtGIZf-2uKYpuTAw/348s.jpg", "caption": "Lamb chops"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DRBy0DOs9oad3mHAsFV1pg/168s.jpg", "caption": "Chef's fish selection"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fuaRGrrsBTXXpEJJ3tjEiA/168s.jpg", "caption": "Braised short rib"}]}}, {"review": {"des": "Haven't been here in years. I had friend in town from New York who wanted to take me dinner. I thought of this restaurant that had a romantic view and I was trying to show off our beautiful city. He was in awwww about the ambience, the food was on point and service was great as well.", "pics": null}}, {"review": {"des": "This place is wow. We had brunch there (buffet). View is amazing. Brunch was really good tasty. Service is really good. Our server Ronald was really nice guy he's so cute walking with us taking our pic. Will definitely come bcak", "pics": null}}, {"review": {"des": "Breathtaking views of the city & the lake with some delicious cocktails with lunch or dinner? Yes please! This is one of my favorite places to come to with friends or relatives visiting from out of town. Even on a cloudy day, you still can't take your eyes off the view. <br><br>We have been here during the week for lunch as well as their weekend breakfast brunch buffet. To be honest, some of the dishes are phenomenal and some are average to below average. I wasn't happy with the calamari at one point at a lunch visit here because it was sooooo oily and dripping when you'd pick up a piece. The fish tacos are really good and although they are an appetizer of three tacos, you can add a fourth for an entree if you want. The bread and butter are addictive; try not to fill up on it!! <br><br>The cocktails are fantastic. Very fruity and delicious. The service is very good too. <br><br>At the end of the day, we come here for the view. Make your reservations in advance. Also, come at lunch during the week and come early so you can get a window seat because it's not always guaranteed even with a reservation.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/j7t9G2--mpuSJAWRkVlEbQ/348s.jpg", "caption": "Gorgeous view"}]}}, {"review": {"des": "Pros: The view is phenomenal, there is not much to say but \"wow\". I went with a group of 8, and they were very accommodating. The place was packed for a Monday evening, great vibe, fun atmosphere.<br><br>Cons: High prices, the cheapest glass of wine was $16, I only had one. Of course, you are paying for the view and atmosphere, totally worth it.<br><br>Will most definitely return!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iDTkfe6WnGshIQhBtpTKSw/348s.jpg", "caption": "View from the ladies bathroom"}]}}, {"review": {"des": "We had 4.5/5 food, 5/5 service, and for a reasonable price had a huge meal with an amazing bird's eye view of Chicago.<br><br>Our friend from Chicago helped us out by recommending this place. He said, wait for a while, pay $40-50 for a view at Sears Tower..or come here for food, close to the same view and you get to enjoy it for an hour or so for the same price. Boy was he right!", "pics": null}}, {"review": {"des": "Breathtaking views and the food is delicious. My steak was so tender. Very pricey but worth it if you're a tourist and it's your first time seeing the city", "pics": null}}, {"review": {"des": "Visiting this great city from Tampa on business.  Had to experience this awesome view.... glad we did.<br><br>Food, Service and the View \"World Class\". <br><br>Started with Shrimp Garlic appetizer, followed by Lobster Bisque Soup & wedge salad. Super fresh and delicious... <br><br>Main course recommend by our Super knowledgeable and friendly server.. Grilled Scollops and grilled salmon... both were delicious in every way... prepared perfectly -highly recommend if your a seafood lover. <br><br>The seafood tower appetizer looked incredible - many leaving the kitchen for larger parties. Maybe next time... <br><br>Enjoy my friends....", "pics": null}}, {"review": {"des": "Beautiful View. Good food. Nice waitstaff. Could have a better beer and wine selection.  But I guess you go there more for the view.", "pics": null}}, {"review": {"des": "A great restaurant for special occasions. A bill for 2 was $250 but it was so worth it. We got a window seat so we had a beautiful view of the city and Lake Michigan. My boyfriend got the surf and turf ($81) and it was some of the best steak and lobster we have ever had. My pasta dish was awesome. We had key lime cheesecake which was super yummy too. I loved the romantic vibe of this restaurant and the food didn't disappoint!", "pics": null}}, {"review": {"des": "Amazing view, as I chose this for my 35th birthday. We go amazing seats along the window. Started with lobster bisque that was average at best. Followed by the surf and turf, starting with the steak, being from Texas I know my beef... this was a 2 ... I won't even review the lobster tail... definitely don't do the seafood pasta... 2 Star for the view.. lol pro score : 22/100", "pics": null}}, {"review": {"des": "Stunning views of the city without paying to go to the observation deck, get a drink with your money instead.", "pics": null}}, {"review": {"des": "The rude and poor service as well as high price doesn't make the view worth going. On the other hand, and to be fair, the view is nice (but you can get it elsewhere).", "pics": null}}, {"review": {"des": "Been here a couple of times including this past weekend when we had some out of town guests. Neither visit was worth the effort. This Saturday's visit was just plain awful. In fact, it was bad enough that I know I'll never go back. First of all, there was a huge line for the elevator (3:30ish) and it took over 30 minutes to get on the single operating elevator. We were there for drinks and got a table for 4 and we promptly sat and waited. And waited. And waited. As did everyone else. I vaguely recognized a \"server\" who eventually brought us a menu and disappeared. After 15 minutes or so she stopped by, we ordered drinks and she took off. 30 more minutes and I finally catch a glimpse of her so I head across the room and flag her down to cancel our drink order. We had dinner reservations elsewhere and there's no way we could have drinks and pay our bill in time. <br><br>She apologized and said she was the only one working. WHAT? How can that be? The place is packed!! But, not her fault I guess. So we left only to get in line for the elevator to go down. That took nearly 30 minutes. There are 3 elevators, only one of which was operating despite 100 people in line, many of whom never got served either as we found out.  And the drinks were pricey but we would have paid it just to enjoy the scenery. <br><br>If this place didn't have that view it wouldn't be more than 2 stars, maybe even 1. 2 hours and I didn't even get a single drink. So, be warned. Go if you must, but don't say I didn't tell you. In fact, people exiting our down elevator warned the people waIting to go up to turn around and not waste their time. Good advice. Is the view good? Yes. Is it worth 2 hours. I'm saying no way.", "pics": null}}, {"review": {"des": "The food here is mediocre, in my opinion, but that's not why I enjoy coming here.  In my opinion, it's the best view in the city, maybe only second to the higher units at the Trump Tower (but you'd obviously have to be a resident there to enjoy that view).<br><br>I never really came here for the food... but it's just a nice place to take someone if they're visiting from out of town, or for a romantic date night.<br><br>Besides, nobody really comes here initially for the food... they come here for the view.  <br><br>Unfortunately, though, as others have mentioned, the food isn't anything to really write home about.<br><br>If you haven't been here though, you should still check it out.  The ambiance is great.. incredible views at night.  <br><br>(A note for anyone that's susceptible to motion sickness.  The building does move a bit at this height, and you can feel it on a windy day. It's only a slight movement, but if you're sensitive to that sort of thing, or your date is, I thought it would be important to mention that.)", "pics": null}}, {"review": {"des": "Had a friend visiting in Chicago and had brunch here. Very good experience. First of all, the view! At 95th floor of the John Hancock building you can see the beautiful view of Chicago and the lake. For brunch it had buffet for seafood, fruit, pastry, salad and dessert, all tasty and fresh. Also, you can order more than one entree if you want to. We tried the egg Benedict and rib,both very tasty. Over all, It is pricy for a brunch ($55 per person, not including tips and fees)but given what they can offer I think it is well worth it.", "pics": null}}, {"review": {"des": "Bad service from start to finish. Confusingly so, actually. Tacky. Dry/chewy lobster. Drinks taste like they're made for a college bar. Wine list disappointing. Don't waste your time or money.", "pics": null}}, {"review": {"des": "Always a great time at the signature room <br><br>As often as I used to come up here when I was local  and still wanna come up every time I'm in town, it's hard for me to justify the price of observatory decks here or at the Sears tower. And on a trip like this when I didn't mind paying, I was discouraged by the wait. <br><br>Coming up for apps and drinks at the restaurant and lounge means less wait and you get things back for your money more than just a view. <br><br>He line moves fast, almost all seats have great views and you down get up and walk around. It's not abnormal to see people stepping closer to a nearby window or taking a walk around for quick snaps. <br><br>Favorite drink here: banana split =) do it!", "pics": null}}, {"review": {"des": "The Signature Room gets a lot of praise for being one of the best views of Chicago! And the view truly is breathtaking. In fact, go check out the women's bathroom for one of the best views in town, sorry fellas! We didn't dine here so I can't speak for the food but the ambience was great for a special night out or romantic date. The cocktails were a little pricey for what they were but in the end you're paying for the view. I would recommend this spot when visiting Chicago for the first time or celebrating something special but definitely not a bar to visit regularly.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aNXKy-dtdLjdKAmMjFrTTw/348s.jpg", "caption": "The Signature Room"}]}}, {"review": {"des": "3 stars for the establishment itself... a 4th star for the view & party accomodations!<br><br>My boyfriend and I attended a birthday party thrown by a couple we know in one of the private rooms here (I forget which). We had a corner room with two walls of floor-to-ceiling windows, facing north and east. The view of Oak Street beach and LSD, especially at night, is incredible; you won't see anything quite like it.<br><br>The room layout was one long table, which was cool in that you didn't have to play the game of social musical chairs but this also meant we spoke with the same four people for the whole dinner course. The food was good, I had the chicken but one bite of the man's perfectly cooked steak and I knew I should have gotten the beef...<br><br>Parking is easy if you reserve ahead of time with a service like SpotHero or ParkWhiz. We found a garage right across the street and with valet, no less.<br><br>We had a good time. Thanks to the Sig Room staff for making the birthday girl's night a special one!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3ragwxt7aHhFN8bcbkV-gw/348s.jpg", "caption": "Our setup in the Lakeshore Room - private party"}]}}, {"review": {"des": "I made a 5:30 pm reservation a week out because that was the earliest time slot available (closest to 7 when I would have ideally gone) and 9 pm was the latest so I took the earlier time. I have to admit, I went in with low expectations due to the reviews I read online stating the service and food were mediocre. The Signature Room at the 95th did not disappoint and exceeded our expectations with the food and service. Our server was named Ray and has worked at the establishment for 15 years and was very attentive. His helper and food runner were also very on the ball refilling our drinks when they depleted, noticing my napkin had fallen and the floor and getting me a new one, etc. The food was high quality and yes, so were the prices. I wouldn't recommend going there on a budget. Treat it like a special occasion and get what you'd like and to will pay a nice penny. Our special occasion was us traveling to a new city together. We had the gnocchi as an appetizer, the seafood pasta and scallops plus two drinks each and CREME brûlée for dessert, totaling over $200 with tip. All of the portion sizes were small compared to what other establishments serve but for once, I didn't leave the restaurant feeling too full. We had a view of the Navy Pier and ocean and it was gorgeous. When we return, we will come around 5 pm to get the even better view of the skyscrapers. All of those tables when we arrived were taken but the people looked like they hadn't been there for long. There is a long line when you get there. Make sure you tell the restaurant representative managing the line that you have a reservation and you skip the line to the elevator and stand in your own open space separate from the line. I read online that the women's bathroom view was outstanding so I went to the 96th floor to see it and wow! I will return here one day for another lovely dinner in the clouds.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MLhEwd6JnUw5LwGQJQIlDw/168s.jpg", "caption": "The seafood pasta and my scallop dish in the back"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mJea3GZhuEfIT4vb524sxA/168s.jpg", "caption": "Our view from our table"}]}}, {"review": {"des": "The view, food, and staff are always fantastic. The menu is limited if you come with a larger group but can always request individual menus. This place is JAM packed on the weekends esp at night. They always have special events going on around certain holidays which you can make reservations for well in advance. The elevator ride up to the 95th floor can be an adventure for those who have a weak stomach but totally worth it once your on top! Give em a try, you won't be disappointed!", "pics": null}}, {"review": {"des": "I came here for the amazing views but somehow the turkey burger stole the show -perhaps it was the avocado aoili...whatever it was it was fantastic!<br><br>Make a reservation (yes, even for lunch), have a glass of wine, and enjoy the beautiful breathtaking views.", "pics": null}}, {"review": {"des": "This should be on everyone's \"things to do in Chicago\" list. Located on the 95th floor of the John Hancock building, this restaurant/bar offers panoramic views of Chicago's beautiful skyline and Lake Michigan. I've only come here for drinks and the view, and although the drinks are a little on the pricier side ($15+), they are hand crafted with fine liquor, and I usually only need one drink to feel the buzz. No reservations needed for the bar. Even the women's restroom offers amazing views, and you'll find a lot of women taking selfies in there.", "pics": null}}, {"review": {"des": "I know the place has a reputation.  I came here for Thanksgiving.  So, this is how the meals for this kind of event goes.  <br><br>Seating at your Table:  You are greeted by a very nice waiter who will bring you a glass of sparkling wine.  I thought it was Vueve.  It was their house brand.  VERY GOOD.  <br><br>Appetizers - A large bank of tables is set up with a large amount of choices.  Cheese.  Crab Legs.  Asian.  Breads. Fried Apps. Soups. <br><br>Main Entree - We had our choice of Turkey, Scallops, Pork Chops and Prime Rib.  We could have as many sides as we liked. And, if we wanted a second, third or fifth main entree, we could. It came plated. All was very good. <br><br>Dessert - There was a long table with so much to chose from.  Cakes, cookies and fancy sweets.  All in tasting portions so you didn't have to overcommit. They had traditional pies as well and even hot cocoa. <br><br>They were NOT trying to rush us at all. Their big concern was that our holiday was good. The meal ran about 80 bucks.  <br><br>You don't have to clean or cook!  This was well worth it.  <br><br>My only ask:  Have pre-made doggie bags with some turkey and stuffing for each person to take home.  It would have made the day complete.", "pics": null}}, {"review": {"des": "This is one of those restaurants that you need to go to once purely for a nice downtown experience. It is great to go for dinner because it's dark outside and the Chicago skyline is definitely worth seeing! The one thing that is unfortunate is the portions are quite small (as expected for high-end and $$ restaurants), and for those who are vegetarian, there aren't many options. Additionally, there is a \"one minimum main course per person\" rule, but salads do not play part in this. Therefore, if you plan on coming and ordering nothing more than a salad, you will have to go with your second food option. Nonetheless, the food is quite tasty!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fqQzdk70xggncNCr_5P04g/168s.jpg", "caption": "Pan Seared Duck Breast"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pgUi4qaZlOblBOvjiXy5LA/168s.jpg", "caption": "Roasted Salmon Fillet"}]}}, {"review": {"des": "Aside from the overpriced food and drink, this place is definitely a sure hit! Well I should not say overpriced, overlooking view-worthy-priced food and drink. The price is like directly proportional to the above sea-level elevation, lol.<br><br>Anyway, we really enjoyed this place. The food is good, generously served, and of course the view is extraordinary. We can spend the entire night here viewing the city but we don't have enough time in Chicago to cover where we need to go to. The place can get crowded and packed very quickly, and I saw reviews of 45 to 1.5 hours wait is definitely not an overestimation. We got so lucky we were seated at the window in less than 10 minutes. Thumbs up!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Q8tfsj0CMVjpBNPtZH89LA/348s.jpg", "caption": "Nice view!"}]}}, {"review": {"des": "I kind of had low expectations of this experience because I know it's such a tourist trap, but I went and really enjoyed the experience.<br><br>You have to wait in line for the elevator. Took us about 10-15 because we got in and headed to the 95 and 96 floor. It kind of seems like a free for all, but if you're smart you'll make a reservation.<br><br>Why come here? Well for the views of course. It's like sitting on a cloud, looking out over the city.<br><br>We got super lucky and asked a server for a table and he gave us one right by the window- score. The downside is that while you're eating/drinking everyone is kind of hovering over you to take photos.<br><br>Our waitress came by and took our order. I got a blood orange margarita and we got a hummus plate and chips with guacamole for the table.<br><br>I was surprised that I liked the food and drinks- again I thought this was just a tourist trap with bad everything. Now, it gets a little pricey up in the sky- a drink on average is $16, but you're paying for a view- luckily they are strong. <br><br>Everything was good from the food, to the booze and of course the view! It's worth it if you time it right. Get there before the sun goes down so you can watch the sunset from the sky.<br><br>Definitely worth checking out once.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VP90AFw0xeVekDRxkH7lJA/348s.jpg", "caption": "Views again"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/H0P4ayo-CSlD4WJvdllZ6g/168s.jpg", "caption": "Waiting for the elevator"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_Zq6cDAt39_6Dx9Mio7wOw/168s.jpg", "caption": "Dirty under the table"}]}}, {"review": {"des": "Took mom here for her birthday and it was a nice time.  View was good, service was decent (provided by a team, instead of one waiter, busboy, etc.).  Food was OK, which surprised me.  With the reputation of the Signature room and the price, I expected better.  We both had Salmon and other restaurants salmon have been much better.  Best part of the meal was the mousse cake.<br><br>Might go back and hang out in the bar area.  Friday and Saturday night they have a piano player, according to staff.", "pics": null}}, {"review": {"des": "My boyfriend and I opted to dine at the Signature room rather than do the sky deck, as the prices are similar but one includes lunch! I still think we made a smart decision. The food wasn't all that great and very small portions. If you go here, make sure to get a window seat! the views are amazing!", "pics": null}}]}