{"name": "the-publican-chicago", "reviews": [{"review": {"des": "My first time the The Publican was just last night and must I say...Wow. <br><br>My girlfriend and I were in the city last night and we were looking for a prime destination to satisfy our oyster craving. We had a few places picked out but ended up going with The Publican and I am so glad we did. We ate about three dozen oysters and from arrival to departure it was great. <br><br>The restaurant itself was beautiful in design. I loved that it didn't stand out from the street but once you entered, you could not help but admire the décor. The ambiance was perfect, the lights were not too bright and the music was not too loud. It was a great place to enjoy quality time while enjoying quality food. Whether you are with a big party or just you and a loved one they have the floor plan to accommodate it all. <br><br>Our server was so nice, very knowledgeable of the menu, and ready to answer any questions that awaited. He checked on us frequently to ensure our food was delicious and our drinks were full. The drink menu was as large or larger than actual food menus I have seen at other restaurants. The food menu was very extensive as well with tons of options, however we did only stay for the oysters. I will indeed be back to try more!!!!!", "pics": null}}, {"review": {"des": "I always wanted to try The Publican since it is well known for their meats and I finally got to try it. Interior is modern, decorated with many round light fixtures and heavy wooden tables and chairs. We were the first ones to get there for their Saturday brunch so there was no wait. <br><br>We ordered the following:<br>- Mushroom scramble: good if you're not feeling the meat first thing in the morning, nice and light. The portion is a bit small.<br>- Tasso ham toast: thinly sliced ham over toast topped with a sunnyside egg. The giardiniera is on the sweeter side, I wish it was spicier.<br>- Publican bacon: delicious - not your usual bacon, they are thick (I mean really thick) and taste more like ham. <br>- Crispy potato: mighty super delicious! Smashed potato, perfectly crispy and seasoned.<br>- Buttermilk biscuit: decent, wish it was more buttery. <br>- Sticky bun - The server recommended that this is a must to try side but it is a very familiar taste. Still good though.<br>- Coffee & cream French cruller: kind of dry and not sweet enough, I was a bit disappointed.<br>Mimosa was strong and delicious and Gio's michelada, made with mezcal and tequila was really good as well. Service was amazing. We told our server that our friends just got married that morning and she gave them 2 glasses of rieslings on the house!", "pics": null}}, {"review": {"des": "Lucky we were able to reserve a table for dinner a few days beforehand! <br><br>The restaurant was slightly difficult to find because there's no name outside. Look for the number 837 and the spheres of light coming from within! <br><br>Ambiance: Modern restaurant with beautiful rows of lights. I like their pictures of pigs and the bathroom was unique. The wooden tables are high rise, shared, or booths. It was packed. Downside was that it was super loud and hard to hear conversation across the table. <br><br>Service: Our waitress (I think red hair and glasses) gave us good suggestions since it was our first time eating here. Our waters were filled often and dirty plates taken away almost as soon as we were done to make room for the next dishes. <br><br>Food: Amazing! It's meant to be shared family style and we did just that.<br><br>Barbecue carrots- (5/5) soft with a nice crunch, great smoky flavor<br>Honeynut squash- (4/5) nice texture <br>Chicken liver pâté- (5/5) surprisingly good flavor, a favorite of the table, bread was also yummy <br>Pork belly- (4/5) delicious and oh so tender but knocked a star off for the portion. One strip for $25? Thank u, next. <br>Tagliatelle (lamb ragù)- (5/5) one of my favorites<br>Country rib- (5/5) flavorful <br>Bouchot mussels- (5/5) big amount and tasty broth, comes with bread <br><br>My family and I had a wonderful experience. Weill make sure to come back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1StrJ17s7ibSl_MeN_RP6A/348s.jpg", "caption": "Barbecue carrots"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Cfucpg2q1kH5odvo7ATBRQ/168s.jpg", "caption": "Interior shot"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tVmCRiByyni30X8cTeTu6g/168s.jpg", "caption": "Country rib"}]}}, {"review": {"des": "The Publican is simply an amazing place. When my buddy and I jumped out of our Uber, I thought the place looked like a deli. It turns out we were at Publican Quality Meats across the street. That deli looked amazing and we spent a few minutes walking through before heading over The Publican. <br><br>A very classy looking place and seemed very similar, in many ways, to The Playground back home in Santa Ana. They had booth seating with swinging doors to add a bit more privacy but we were seated in the communal bench seating area. The place is pretty loud so be prepared. We got the corner two seats and the folks around us were pretty cool to be around us. <br><br>Christopher served us with precision all evening. We quickly realized he could put together a suggested meal for us if we gave him a couple of hints of what we liked. He suggested some great beers and we each picked a few dishes until we had a belly full of suggestions. <br><br>Eating family or tapas style is a great way to go if you are adventurous. The charcuterie plate was a great way to get several tastes of their specialty meats. Head cheese, sausage, salami, pickles, caper berries and a couple of mustards and their super crunchy baguette. Whole fried whiting (think large sardine) with fried dill pickles and a tangy rich sauce. Barbecued carrots, boneless leg of lamb with Brussels sprouts. Incredible taste, ingredients and presentation. Hot apple pie type of dish with sherry ice cream finished it off. <br><br>Not overly expensive and certainly worth the price of admission. A real foodie treat.", "pics": null}}, {"review": {"des": "Loved the atmosphere, service, and food! <br><br>When you walk in, it looks like a beer garden with the family style long tables and the lighting. My friends and I were seated in this booth, that had these enclosed doors so I loved the privateness of it. <br><br>They have an extensive beer menu, with beer with Belgian backgrounds to local Chicago favorites. <br><br>Food wise, the portions the huge, so sharing is recommended. We tried the sweet potato dish, that came with this lovely creamy aioli sauce. We also had the sirloin and the porchetta. The sirloin was on the smaller side, but was very delicious and was not heavy at all. Although tasty, the Porchetta was pretty fatty. It came in a great sauce and was served with roast potatoes. <br><br>We were surely left stuffed! Come hungry and try to save room for dessert, I know I couldn't.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rjyVK4T2mLOVG6wk0Uh3bA/168s.jpg", "caption": "Porchetta"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8sCXEv-bJaQ4sFDnV_OPgw/168s.jpg", "caption": "Sirloin"}]}}, {"review": {"des": "I came here with a few of my friends for a \"Friendsgiving\" celebration the other night and all I can say is WOW!<br><br>We ordered 5 different dishes to share as a table and each one was better than the last!  The first thing we are were the honeycrisp apples with horseradish ricotta and it was a delightfully sweet and savory dish that had just the right amount of kick with horseradish.  After that, we had french fries come out with the mussels, and I can't say enough good things about the mussels.  The white wine and garlic based broth was great, but the highlight of the mussels were the actual size of the mussels! I don't know where they got these things, but every place in the city needs to get in on these because man were they good and meaty!  The french fries were great, as was the aioli served with them, and they were even better dipped in the mussel broth.<br><br>After finishing all of our appetizers, we were on to the meats.  We ordered the ribs and the pork belly, both of which were spectacular.  The ribs were much more of a traditional rib but the flavors were just spectacular, combining lime and peanuts.  With all of this being said, the star of the night was easily the pork belly for me.  It was cooked perfectly, with fat that you could press up against the roof of your mouth and it would literally disintegrate.  The flavors were Asian inspired, and the rice that it was served over was cooked to perfection.<br><br>One of the biggest surprises of the night was that, after finishing our meal and asking for the check, our waiter took it upon himself to bring us a free dessert!  We did not see this coming, and were blown away by the generosity of the staff.  The dessert that they brought us was the pumpkin bread pudding, and while it was not the table's favorite dish, the thought is what counted.<br><br>The quality of the food combined with the atmosphere of the restaurant and the fantastic wait staff made for a memorable night, and a guarantee of returning. I mean, does it get any better than free dessert?", "pics": null}}, {"review": {"des": "MEATING<br><br>This is the best place to have a meating. The menu has a lot of interesting dishes to choose from. I also highly recommend that your group order a bunch of different dishes to share. This isn't one of those places where you get your own personal dish plus it's always fun to share food. <br><br>We started out in the bar. I tried ordering Titos and was quickly shot down. Apparently an ex-employee started a vodka company in Madison, Wisconsin and they exclusively serve their vodka. Okay I'm game! Let's do this! I started with a vodka and soda with a fresh lemon wedge. It was the perfect refreshing drink after a long day of working.  <br><br>Our table was ready and we were moved to a community table which I'm cool with unless your neighbors have never been to Europe or are afraid of their own shadow. Let's say our new friends were both. That's okay we're going to have more fun then you anyways. You had your chance to join the cool kids. <br><br>We decided we needed to start with a plate of meat but how do you choose just one ham? You can't so I highly recommend you go for the Trio of Hams. Our dish came with Edward's Country Ham which was smoky and sweet from Surry, Virginia. As well as La Quercia Rosa which was gentle and balanced from Norwalk, Iowa and finally Fermin Serrano which was rich and wild from salamanca. It was so hard to pick a favorite or even remember which ham was which. I do know that all of them were fantastic. This was the start of a perfect evening. <br><br>Next we had Potted Rillettes which was served in a jar with sourdough bread. It's not a very pretty looking dish but it's really damn tasty. I highly recommend it because it will be your new favorite. I also love knowing where the pigs came from. If your curious the pigs are from Mick klug farm located in St. Joseph, Michigan. Talk about eating local. <br><br>Our next dish to share was the Pork Belly and it was really good. I'm always worried about pork belly because I find that the dish is either done perfect or done bad. Luckily they served it good here and I would not expect anything less from this is place. Other dishes I'd recommend include the BBQ carrots which were surprisingly delicious. We also accidentally ordered the frites which blew us away. It reminded me of walking down the streets of Europe with a cone and a wooden toothpick to eat. The added bonus here was that they even served the fries with mayo. This was the tastiest mistake we made all night. I would also advise you to stay away from the Shishito Pepper Plate. It was my least favorite dish of the night. <br><br>For dessert you have to go with the homemade ice cream. We couldn't decide on just one flavor and made them make us a trio of ice cream. Kind of like the trio of ham. The ice cream here will blow you away. We also got the waffle but I can't even remember if it was good because the ice cream was so amazingly yummy. <br><br>So the next time you're looking for a meating then this is your place. The Publican is located in the historic meat packing district of Chicago which is rapidly disappearing to trendy restaurants, hotels and corporate giants. I miss the old neighborhood but you can't stop progress or trends.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oVfysGlwTbcDuY_Vob2M-w/168s.jpg", "caption": "The bbq carrots rocked!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8BQhMg3Ntl6wTe5_qVUbog/168s.jpg", "caption": "There's nothing like a trio of ham platter!"}]}}, {"review": {"des": "What a place. Even their beets are to die for! The server was attentive and the atmosphere was great - we went on a friday night around 730. Honestly, the quality of the food has been amazing any time I've been there -you should also check out their place across the street! We had the chicken liver pate, beets, and pork belly this last time. Their bread is to DIE for.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iNvfj7QbGqbAETebF2tMBg/348s.jpg", "caption": "Pork belly"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OGbhj64nTbFFqlbr-wYk2g/168s.jpg", "caption": "Chicken liver pate"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/h_YMwn2eEDerDd-j5t0N4w/168s.jpg", "caption": "Beets"}]}}, {"review": {"des": "Holy crap, what an experience! If you haven't heard of the Publican then it's time you educate yourself.<br><br>This place is basically a modern beer hall that focuses on family style portions of market fresh ingredients. We managed to get a reservation on a Sunday night and were immediately comforted by the relaxed vibe and social atmosphere. The best waitress we've ever had in Chicago made the experience even better. I can't remember her name but she had wavey light brown hair and glasses and she took her time explaining every single dish and making suggestions along the way. We decided to start off with some serrano ham with a side of honeycrisp apples. Perfect salty sweet combo! Then we ordered a big bowl of mussels with a side of peasant bread to soak up the broth. Sooooooo delicious. To finish the meal we had an apple cake with a scoop of sherry ice cream. I tried a few beers along the way considering they have a very unique collection of brew.<br><br>Overall I think Publican just topped my list of favorite restaurants in Chicago.", "pics": null}}, {"review": {"des": "Incredible brunch spot. Tell me. Why are you reading my review? Were there not enough that told you how good the food is? Been here twice over two trips, a year apart, and I'm glad I did. Beer and brunch brought together in orgasmic bliss when you are an outsider stopping in Chicago just because Chicago is so damn awesome. <br>This place is an awesome food spot in a town full of options. This area has several options. You can look at the map. I sat outside both times and if I were fortunate to live in my favorite vacation city, i would sit inside too as the ambiance is nice and modern, warm and welcoming. Seating is cozy and it's a perfect date, family, friend or solo spot. Come here when you visit Chi city and drink beer and eat sausage with eggs and avocado. That kinda shit my friends.", "pics": null}}, {"review": {"des": "This review is for weekend brunch. Ordered two dishes,  both came out pretty, but the taste, one is overly sweet while the other is soaked in mustard. If posting Instagram pics is more important than what the food taste like, publican is right for you. I would give it a 2 for the two main dishes but the extra start is for the bacon. I'd be happy if they have two sunny side up eggs with bacon as a main dish. Won't come back again.", "pics": null}}, {"review": {"des": "WTF YELP!<br><br>Once more i'm seeing one of my reviews has been deleted without having been informed. No idea why as my reviews were initially a 4, then turned out to be a 3.<br><br>My feedback is based on a dozen of times having brunch or dinning at Publican including past week-end.<br><br>Publican started being a 4/5 when they opened. After a while the novelty wore off. Not necessarily because of the food which at times is overly salty; but more for the philosophy that fits more with a chain restaurant's mindset.<br><br>Service has certainly gotten worse. Nonetheless i'm glad they are in Chicago. I think their whole group has done Chicago lots of good.", "pics": null}}, {"review": {"des": "The interior decor is gorgeous. I love the light fixtures and the door swings to the booths. My party of 3 had reservations at noon on a Saturday and we were seated immediately upon arrival. The waiter told us the menu changes frequently. Like others have mentioned, the brunch menu is limited but tasty. My friends had the pastrami sandwich with an over easy egg and I had pancakes sprinkled with scramble eggs and sprinkled bacon. I also ordered their crispy potatoes with an over easy egg on top. I think the crispy potatoes dish was my favorite. I basically licked that plate clean. We also had their mimosas and Bloody Mary. The Bloody Mary definitely had a kick to it. Service was kind of so-so. Prices were reasonable. Portions were huge.", "pics": null}}, {"review": {"des": "Like this place needs another glowing review. I made a reservation for a Friday dinner a few days in advance - reservation highly recommended as this place was PACKED the entire time we were there.<br><br>Publican has a beer hall setting with slightly more refined food. The motto here is beer, pork, and oysters. You know what you're getting yourself into, but the food is surprisingly well thought out and refined, and many of the vegetable dishes on the menu looked very tempting.<br><br>I had read about a great $65 chef's menu, which unfortunately had been temporarily been taken off the menu to be reworked when we were there, but our waitress kindly said she'd ask the kitchen to put together something for us.<br><br>That \"something\" ended up being a full five course meal that utterly defeated us. Other than the sheer amount of food, everything was delicious and it was hard to find a fault in the meal. Even something as simple as a steamed mussel pot was executed much better than the average bar. Highlights of the meal for me were the roasted carrots, porchetta, and banana rum cake ice cream.", "pics": null}}, {"review": {"des": "What an amazing brunch! The menu is on the smaller side and I'll admit I was initially skeptical but everything was so, so good. We had the pork schnitzel, chicken stew, pancake with scrambled eggs & bacon, and the crispy potatoes. My friends made fun of me for getting chicken stew at a restaurant but it was actually my favorite thing! (Plus the crispy potatoes, of course.) Definitely recommend! <br><br>The service was amazing as well - it was my boyfriend's birthday and they brought us a plate of bacon with a candle which was such a nice touch! I'll post more pictures on my insta @naty_eats. <br><br>Will be back!", "pics": null}}, {"review": {"des": "I didn't have an unpleasant time at The Publican for brunch by any means, but I feel like for the hype it gets and the price we paid it should have been better. My brother and I arrived at 11am and asked for a table outside and we were told to wait for 15-20 minutes even though we saw 6+ tables open. We went back to check 20 minutes later since no one had gotten us and they sat us right away, with all of those tables remaining empty the entire time. <br><br>Many of their brunch items are a la carte, so we ordered a pastry, some breakfast sausage, a waffle, 2 scrambled eggs, and a dish with some corn and poached eggs. Meanwhile, we had some coffee poured and my brother had to ask twice for silverware and creamer which never came, so he got some from another table. 15 minutes later the pastry came out, and then another 15 minutes later our breakfast sausage came, and then you guessed it... 15 minutes later the rest of our breakfast.  The corn dish was at least $13 and was simply a plate of roasted corn with an overcooked poached egg on top. <br><br>It was an odd experience and between the service and mediocre food I can't say I'll be rushing back.", "pics": null}}, {"review": {"des": "Great brunch, priced modestly, good vibes. <br><br>I went to this restaurant with a friend for a Saturday morning brunch. The food was good, well presented, and priced well. My friend and I both got side dishes/a la carte because neither of us eat pork and weren't able to find something to our liking without pork, unfortunately. <br><br>I definitely recommend the restaurant, but only for those who eat pork.", "pics": null}}, {"review": {"des": "I heard this restaurant from a friend. On mid autumn day I brought Mom here and enjoyed a happy dinner together. I will try brunch here if I have time. The food here is really good! The waitress is nice.", "pics": null}}, {"review": {"des": "If you haven't figured it out by now, Publican has a very meat heavy menu. <br><br>I've come for both brunch and dinner and wasn't particularly amazed. I think it was good overall but I didn't love anything.<br><br>I had the spicy pork rinds and fried chicken for brunch. I don't know if I was expecting a more meaty vibe to the spicy pork rinds but it wasn't very impressive IMO. Our group felt like you could buy the pork rind chips from markets. The fried chicken was fine, but I didn't like it enough to finish it.<br><br>I also came for dinner with a group of 12. The service was great! The food was okay - I got to try almost all the meat options with a couple starters since I had such a large party, but nothing stuck out to me here either. The fish and the beets were good.", "pics": null}}, {"review": {"des": "I didn't know they closed at 2 and made late reservations on Open Table for 145pm for a late late hungover Sunday brunch.<br><br>Food had to be in by 2pm, but other than that, they were super accommodating! I couldn't believe how nice they were about it!<br><br>Food was clean, delicious and seemed to be super healthy. Cocktails were also spectacular. I will be back, as the patio is huge with lots of umbrellas.", "pics": null}}, {"review": {"des": "I am torn between a three-star and a four-star rating because there were a lot of things I like about this place but I would say a few things fell a little short. This place was #1 on Yelp for awhile so my boyfriend and I made reservations on a Sunday at 6:30pm. We ended up having to wait even though the restaurant was less than half full and got sat at the big community table by the kitchen. <br><br>The server was great! He checked on us multiple times because I was having a very hard time with the menu. I am a vegetarian and their menu is filled with meat dishes. Not only was there not enough veggie-friendly dishes but the menu is just hard to read. The wine menu was also confusing because they don't list the type of wine they are just the notes and I'm not a super huge wine person so I really need the types to be able to pick. The server ended up helping me pick out a wine and the cod which was great and I did really enjoy them. <br><br>The bread board was good but nothing special and they charge extra for butter...butter. The broccoli was absolutely fantastic, I have no idea what they put on that but if I could eat that for every meal I would. <br><br>We got the apple creme brulee for dessert. I have never had creme brulee before and it was really tasty but the apples on top were a little too sour/sweet for me. <br><br>I like this place because it is fancy food with a casual atmosphere. You could come here in jeans and a hoodie or a nice dress and neither stick out. I hate dressing up so I really appreciate being able to wear whatever I want. <br><br>The bathrooms are super cool, that was probably the highlight of the night. The Dyson hand dryers need to go, they throw the mood off and it was loud and right near the front door.", "pics": null}}, {"review": {"des": "Hands down best seafood and pork  in Chicago.  The seafood tower with mussels clams oysters shrimp crab omg fantastic. Beer selection is amazing and the Publican chicken is hands down delish very knowledgeable staff one of my top ten in Chicago", "pics": null}}, {"review": {"des": "Oh, the Publican. Swoon! One of my best friends used to work there and introduced me to this wonderful restaurant and it has been one of my absolute favorites since. The frites and aioli are wonderful, as are pretty much all of the entrees. I'm also 100% OBSESSED with their desserts--there is always something beautiful, creative, and delicious on the menu. Most recently, I had an amazing dessert topped with luscious strawberry foam. <br><br>In addition, I highly recommend going to any of their beer dinners if you have a chance. It's such a treat to try out all of the great beers and their perfect pairings!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/im8PhkExVocz73OKnspdBg/348s.jpg", "caption": "Frites and eggs"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gCgS7x6wIJDssXJ826fxyA/168s.jpg", "caption": "Duck confit"}]}}, {"review": {"des": "Came here from Anthony Bourdain's recommendation from the Layover.  Make sure you make reservations early. I did it before I came to Chicago and it was still early reservation at 530pm. We sat in the communal table and it was not packed yet. We ordered the fresh pork skin which was so different from the package that my husband usually gets. It was fresh and crispy. I loved the side dish that the waiter recommended with nectarines and mozzarella. It was the highlight of all the dishes, with many different components to the crisp and freshness was well received. We ordered the porchetta, it was a huge dish! We could not finish and had to take some to go. It was salty but very tasty with eggplants, cabbage and some bread underneath. I would say the service here was excellent. The waiters were very tentative and I enjoyed my meal!", "pics": null}}, {"review": {"des": "This place is fantastic!  Small, concise menu.  The service maybe the best thing about it.   However, the food is outstanding.  I ordered the country ribs.  They were not the ribs that you may typically think of.  These ribs are like a cut of steak to the point of having the fat taste just as good as the meat .<br><br>Also, I ordered a beer that was limited release they don't make that beer anymore.  The beer is from San Diego, but was a VERY nice Belgium style beer.  I wish the stock wasn't running low.  Even though it's in limited stock the price was much aligned with an average beer at restaurant of this caliber.<br><br>All this and I didn't share anything about the servers. We probably had four or five different people from the hostess to the busboys and the waitress serving us and each and everyone one of them were pleasant and polite and super helpful.", "pics": null}}, {"review": {"des": "I have a feeling that merely one brunch visit isn't nearly enough to wrap your head around what they have to offer here, but regardless the food is outstanding.  The maple braised bacon is definitely a highlight, though perhaps not *quite* deserving of all the praise it gets.  What wowed me the most was the cajun sausage dish that was on the menu when I was there - my friendly bartender strongly recommended it and it was just fantastic.  The strawberry brioche tart was outstanding, too.  An overall top notch experience!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TWmX55u_IjLEGTAdqoKerQ/348s.jpg", "caption": "Cajun sausage * grits * mushroom gravy * sunnyside egg"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UMm4pOiOhfDY23RFwBWxHQ/168s.jpg", "caption": "Burton's maple braised Publican bacon"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pDRmUo4AitPy5nt5K78jUg/168s.jpg", "caption": "strawberry brioche tart"}]}}, {"review": {"des": "Had a friend in town from London who ran the Chicago Marathon, and he wanted to meet a few of us after the race for brunch at The Publican.  I had been wanting to check the place out, so I was an enthusiastic yes to join he and his group.  <br><br>The building is attractive, the space has a great vibe, I LOVE the long tables and communal seating, the booths with doors, as well as the raised desk four tops.  Really inviting interior with open kitchen and the space had numerous decor accents that were most appealing, including the large pig paintings on the wall, which I loved.  Our wait staff was attentive, responsive and very friendly.  <br><br>Though I won't say the brunch was bad or anything, I enjoyed my sugar toast and Publican mimosa very much.  The $8 bacon side fell very short of anything but average.  I guess I just expected so much more of the place with all that I have heard from others about the place, to go along with all these rave 5 star Yelp! reviews.  My brunch experience was merely okay, and nothing better than I have had for far less at some of Chicago's many neighborhood brunch hot spots.  <br><br>So though I didn't have a bad brunch by any means, it was fine, and the company was GREAT, the hype had me prepared for more, much more, as did the prices.  Maybe dinner is better.  I will make getting a dinner here something I earnestly endeavor to do to balance this brunch review with a proper review of a dinnertime visit.  <br><br>Until then, great space, great vibe, wonderful interior, excellent help, but for brunch, here in Chicago, you can do (much) better for a lot less cash.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/On6H7x1z-2Tk2bfZ1_1q3w/348s.jpg", "caption": "Always great to see an old friend and meet one of his friends over brucnh."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9sFoRsN2iYXA-QLxb54zMg/168s.jpg", "caption": "One of the FANTASTIC Pigs on the Walls The Publican October 2018 Jeff Skrentny IMG_1159"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-tobaJmVWEbvP-74WqmJgw/168s.jpg", "caption": "The Long Tables & Raised Desk Tables for 4 The Publican October 2018 Jeff Skrentny IMG_1160"}]}}, {"review": {"des": "This is one of the best meals I've ever had. The fries with egg. The oysters. The PORCHETTA!!!!!!!<br>Changed my life. <br>God Bless The Publican.", "pics": null}}, {"review": {"des": "The food is excellent, the atmosphere is inviting so long as one is not stuck at a packed communal table and the service is superb. It's been three months since we ate, or rather gorged ourselves, at Publican and the only things I remember eating are the pimento cheese and the pork belly. Both were fantastic. Having said that, neither of those dishes are worth another trip to Publican. Go to say you went, preferably with a large group so you can share because in three months you too will likely not remember what you ate but rather the people you were with. <br><br>Note: do not go without a reservation. If you're gluten free bring your own bread!!", "pics": null}}, {"review": {"des": "While in Chicago, we stopped by this spot for brunch on a beautiful morning. Despite the gorgeous weather, we opted to sit inside. This spot is bright, light, and really welcoming - complete with large paintings of pigs. Most of the tables are long and communal though there are smaller tables and booths along the side.  The service was awesome and within seconds of sitting down, we had both water and coffee. The coffee was amazing and I definitely took advantage of it being bottomless!<br><br>We split a side of the bacon ($7)and a biscuit ($4) along with our mains.  The maple braised bacon was hands down the best bacon period. It was crisp, bursting with flavor, and thick.  Do yourself a favor and order it, you won't regret it. The biscuit was also delicious and was moist and flavorful.  <br><br>My husband ordered the crab scramble for $16 which was really good. Loads with crab both inside and on top and really good. I got the bread pudding for $15 which was good savory combination though the other dishes were far better.  All in all - delicious, flavorful and original recipes combined with great service. Highly recommended for brunch in the West Loop!", "pics": null}}, {"review": {"des": "The ham toast was possibly the best brunch sandwich I've ever had. Go across the street when you're done to get fresh meats, cheese, and bread.", "pics": null}}, {"review": {"des": "Excellent gastropub with innovative and exciting cuisine. Came in with a work group of nine and were promptly seated at one of the communal tables. <br><br>We ordered a bunch of beers off the extensive list with the clear favorite among all of them being the Tre Fontane from Lazio. Easily one of the top five beers I've ever had. <br><br>We split some oysters which were a nice mix of east and west coast. We then did the chef's tasting menu which was three fish, three meat and three vegetable (it seemed like more) that arrived family style for sharing. <br><br>Amongst our favorites were the snapper crudo, the sous vide/broiled/fried pork belly (which was absurdly good) and the mussels, which were served  in a rich broth. Another favorite was the porchetta served over charred bread and miso sauce. <br><br>This was finished off with house made desserts; cobbler, assorted cookies and a gelato.<br><br>Service was highly attentive and engaging and made numerous recommendations. We particularly liked the beer-som who commented on our prodigious consumption of our favorite beer which turned out to be his favorite beer.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/r2dC57Q1XjW2pN3pSKwmMA/348s.jpg", "caption": "The dead soldiers from Lazio."}]}}, {"review": {"des": "Stumbled into The Publican because my first choice for dinner (Au Cheval) had a two hour wait... yeahhh, no thanks.  I'm glad, because I ended up absolutely loving my meal here.<br><br>The restaurant space is reminiscent of a German beer hall - lots of communal tables and an open, airy vibe.  Initially, I was seated at the bar, which was way too cramped - the seats are so close together that your elbows are practically resting in your neighbor's appetizer.  However, I asked a passing server if I could be reseated at one of the communal tables, and they were kind enough to move me without any fuss.<br><br>It's probably best to dine here with a group so you can order family style and try a bit of everything, but I was solo on a business trip, so I just ordered a bunch of stuff off the menu.  My server was awesome!  She made some really fantastic recommendations on what to order and was kind enough not to judge me for the amount of food I was inhaling by myself.<br><br>I started off with a round of their fresh baked bread (sourdough and multigrain) to sample, along with a spread of date muhammara.  The bread was excellent - fluffy, nicely textured, and carbolicious.  The date muhammara spread was interesting - sweet and tomatoey.  I think in hindsight, I would have preferred some fresh butter instead, but I'm glad I tried it.<br><br>Next up - spicy pork rinds!  These were AMAZING.  In fact, I could still hear them crackling, which meant they were fresh out of the deep fat fryer.  Super crispy, deliciously fatty, melt-in-your-mouth.  These are an absolute must-order... worry about your cholesterol results later.<br><br>I decided I needed some veggies (hah!), so I ordered a salad of beets, kale, and ricotta as well.  This was nice and light, yet like everything else at The Publican, delicious and elegantly presented.<br><br>Last but not least came my entrée - and this was one of the best things I ate during my entire Chicago trip.  A giant smoked pork shank, still hanging off the bone Flintstones style.  This was incredible... extremely tender meat, beautiful smoky flavor, excellent caramelized glaze on the outside... superb.  It came resting atop a farrow/cabbage salad with a sweet poppyseed dressing that perfectly complemented the smoky pork meat.  5 stars just for this dish alone.<br><br>OVERALL: 5/5.  Fantastic food, excellent service, cool vibe/atmosphere... I can dig The Publican.  I'm really glad I got the chance to try this place (even if by accident), because it ended up being one of my favorite restaurants in Chicago.  Highly recommended!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4AcA-Su8b3311a-wxAI3Fg/348s.jpg", "caption": "Smoked pork shank - farrow, poppyseed dressing"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/z8QqDlp_1QSltW1dp3mh-w/168s.jpg", "caption": "Beets, kale, ricotta salad"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WEeUba7NJsNq8YSH4fDf1Q/168s.jpg", "caption": "I can actually hear the spicy pork rinds crackling!"}]}}, {"review": {"des": "I had to get on Yelp right away to review this place. Publican is now in my top 5 restaurant experiences in chicago. Everything was top notch there. My wife and I ordered oysters, pork rinds, chicken liver pattae, and the porchetta. Sounds like a ton of food, right. Well it was, and we almost finished everything. We couldn't stop eating. Everything tasted delicious, including their beers and spirits.<br><br>The oysters tasted very fresh, the pork rinds were crackling when they came out, the pattae was the best texture and flavor I have ever had, and the porchetta is a dish that needs it's own category. That was the dish that is going to have me talking and recommending publican to others.<br><br>It was a great time sharing all the plates between 2 people. It's also works to share with an entire group. A larger group of 10 next to us almost ordered everything off the menu. Great idea if you want to explore the menu and try a bit of everything.<br><br>I did have one critique. It was that the drink service from our server was slow. I like when servers ask me if I want to order another drink when I'm close to finishing the drink I already have and not 10 minutes after I'm done and then the drink shows up 5 or 10 minutes after I order. Same with the bill. Just seemed like the more crowded it got, the longer service took. But none the less, I would come back in a heartbeat.", "pics": null}}, {"review": {"des": "Very popular brunch spot in Fulton market. <br><br>Interior tables are mostly long, communal style, so you may rub elbows with the party next to you since they seat people pretty closely. They have fun little booths on the side as well with closing doors, if you are a party of 3 or 4 they are easiest to get. The interior design is meant to look upscale farmy - there are large paintings of fat pigs on the walls. <br><br>Menu is rotating and changes - checking the menu online doesn't necessarily mean it's the menu you get. In addition, some of the menu items themselves change even though they're listed as the same thing. The buttermilk chicken I ordered didn't look much like the other pictures - they were more like little nuggets than a large piece in some of the historical pictures. Rotating menu keeps the selection varied since their menu is somewhat small for a brunch place. <br><br>Service is great and very attentive. Solid food offerings but fairly typical option for Fulton Market.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9-2xtRIrQT_1h9aXb2i5Pw/348s.jpg", "caption": "Publican Bacon, fried chicken, Breakfast Sausage"}]}}, {"review": {"des": "If you want an upscale restaurant with a casual vibe this is for you.  I like how the servers all help you with whatever you need without doing the ol \"let me find your server for you\" routine.  The restroom area is also fun with a unique roundabout for hand washing for men and women. There's also fun takes on different world cuisines that they also mix up everyday so you could come back each night and have something new.<br><br>So I really wished this place would work out. It the food was too salty for me. Portions were small and so when your order different plates, it really racks up. Sodas are in single bottles and the melon appetizer was soggy and bland.  The fries weren't very good.  And there wasn't any plate that was standout in my opinion. I know I'm probably the minority here.  Because everyone else loved it.  Just not my cup of tea though and I'll probably be more curious to try other places walking distance from here.", "pics": null}}, {"review": {"des": "We came in on a Sunday eveningand loved our experience here- yes, even as 4 vegetarians! The Publican was surprisingly very accommodating to veggie diners and had really hearty, flavor-packed and satisfying options for us all. Since we were dinig family style, we ordered an array of dishes to share and opted for the off-the-menu vegetarian chef special-which is literally a sampler of each chef's innovative creation made on the spot. Definitely a fun experience! The menu and drinks are constantly changing, but come in and trust your server. The ambiance is fun, intimate and warm. This would also be a fun spot for group gatherings, excited to come back!", "pics": null}}, {"review": {"des": "The style of dinning takes some getting used to, but wow the atmosphere is great and the food has a ton of flavor. Be ready to share your plate with a friend and have the meat sweats.", "pics": null}}, {"review": {"des": "It took me a long time to make it to The Publican. Much of the seating is around a massive U-shaped communal table. It is important to note this because you may find the arrangement to be awkward, as was evidenced by the two parties who sat next to my buddy and I and quickly asked to be moved and the third party which stayed put but seemed kind of off-put.<br><br>The service, in contrast to the other reviews, was exceptional, our waiter even taking the time on a busy night to show us pictures on his phone of some of the whole octopus that was brought in that week. There was a certain level of coolness, comfort, and authenticity that is matched by few other establishments in this neighborhood.<br><br>Also, the food is good. We had the chef's selection of oysters, the peaches, soft shell crab, beef heart tartare, pork belly, and octopus. We were cautioned that it was an absurd amount of food for two people but found it to be just the right amount.<br><br>In an ever-changing West Loop dining scene, it is no wonder that The Publican is still at the top of the food chain almost ten years in.", "pics": null}}, {"review": {"des": "LISTEN: GET THE PECAN STICKY BUN. Possibly the best single bite of our trip to Chicago among fierce competition.<br><br>We had a wonderful brunch at The Publican. The bacon was nothing short of mouthwatering - thick cut, glazed in something sweet but not overpowering. Perfect.<br><br>The fried chicken was crispy, almost (but not quite) to a fault, and though I was leery of ordering grits, I am now a total convert. The whole grain mustard vinaigrette was a nice compliment.<br><br>The gravy and corn bread was packed with chorizo flavor, but I would ask for my eggs slightly more done than how they arrived (my personal preference only).<br><br>The service was nothing short of fantastic, and really made our experience shine. Thank you!<br><br>The Publican is on our must-do list for every trip to Chicago - we will return!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KmyjV2hOSSWmelOkPmh6sw/168s.jpg", "caption": "Bacon."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GDKH6pqRL1xjDHpLa7cBZg/168s.jpg", "caption": "Pecan sticky bun. EAT THIS."}]}}, {"review": {"des": "Well this place definitely lives up to the hype! Everything was delicious and prices really aren't bad for a nice dinner. My husband and I got 4 dishes and a beer and paid $110 (including tip). The asparagus is delicious and the chicken is cooked perfectly! The pimento cheese spread is so so good! My husband loved the taste of three hams and the portion was huge!<br><br>Ambience is wonderful and bright, unlike so many Chicago restaurants that are dark. Our waitress was very knowledgeable and accommodating. We will definitely be coming back!<br><br>Pro-tip for party of 2: if you show up at 5ish and don't have a reservation, they will likely have a spot at the bar or communal high tops!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ew_z8PaOJSSYn2Pr3GYJqQ/348s.jpg", "caption": "Pimento cheese spread"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Z0aBOdNVdm-6U4pw_iZiGg/168s.jpg", "caption": "Asparagus YUM"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6JhSg3osSYcjdC_J2DzXGQ/168s.jpg", "caption": "Taste of Three Hams"}]}}, {"review": {"des": "The publican is really nice, came in a Tuesday night, plenty of seating available. Tried the chicken, was really good as well as the peach salad. I will say however that the highlight was surprisingly the bbq carrots. Savory, sweet with a nice crunch here, they were wonderful. The best dish of the night by far was the pork belly. So savory and scrumptious.", "pics": null}}, {"review": {"des": "delicious food and amazing service !!<br><br>Was visiting Chicago and made reservations for 4 for Sunday dinner! The restaurant interior is rustic/ barn like -- they have long communal tables (w big chairs) and booths that even have a small door. Noise level is pretty loud. And I like their unique & mismatching dinnerware!<br><br>THE FOOD !! All the dishes were delicious and thoroughly liked by everyone, the dishes' ingredients complimented each other well. What we got:<br>- a dozen oysters, chef's choice<br>- (fish) OLIVE FLOUNDER CRUDO: the fish tasted so fresh and loved the pomegranate seeds with it<br>- (vegetables) BBQ CARROTS: wow! compliments of the chef/ server (thank you!!!) cooked and smoked perfectly, best carrots I have ever eaten<br>- (vegetables) FRIED CAULIFLOWER: looks like tater tots, fried very nicely<br>- (meat) COUNTRY RIB: with broccolini and cashews; flavorful, some fatty/ burnt pieces tho<br>- not sure what this dish was called but had onion typa rings and a meat?<br><br>Amazing service from our server! Very knowledgeable about the dishes, gave recommendations, checked up on us a lot, and we really appreciate the complimentary bbq carrots :') <br><br>A bit pricey, came out to be $200 for 4 people (oysters, 4 dishes, bottle of wine). Same of how much we spent @ The Girl and The Goat, but I liked The Publican more !! (:", "pics": null}}, {"review": {"des": "It was good! We had dinner reservations for a table of two at 5:45 p.m. last Friday. We got seated right away and I got to check out what \" The Publican was all about.\" Like \" Quality Meats,\" it's a communal eating dining table which makes dining fun. However, we didn't really sit by anybody because our reservations occurred before the dinner crowd hit.<br><br>We ordered the two entrees' their sirloin, porchetta also fries with an egg on top. Everything was perfect. Their porchetta was perfectly cooked I loved it. The sirloin was a nice medium rare with king mushrooms. We liked their fries it was good it reminded me slightly like Au Cheval's fries with an egg on top. It was fine. Service was excellent! We would love to come back and try other dishes.", "pics": null}}, {"review": {"des": "celebrated the better half's business school graduation here a couple weeks ago. it was a highly anticipated meal as the publican is one of the only places left on my list of restaurants to try in west loop.<br><br>loved the feel of the restaurant interior. the giant wooden tables and oversized wooden chairs made it feel like we were inside some sort of german beer hall. my favorite part was the fact that every chair has storage underneath the seat - so clutch for holding purses and extra menus.<br><br>food was pretty on point. we got a dozen oysters on the half shell, chicken liver pate, hake, and seafood tagliatelle. we absolutely loved everything except maybe the tagliatelle (a tad too creamy and cheesy for our palate that night). the hake fish was soft and flaky. the pate was surprisingly light and airy, and made for amazing spread on the bread slices. and you can never go wrong with oysters to start off a meal.<br><br>overall a wonderful experience to cap off our 2-year stint in chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0dp20jrkjAUYXtWlgalDaw/348s.jpg", "caption": "tagliatelle"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3wLuqzT6mhXlx3bXTgujFA/168s.jpg", "caption": "hake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/D0pvnDIQ2syVili7lBlOyw/168s.jpg", "caption": "chicken liver pate yummm"}]}}, {"review": {"des": "There is a reason that The Publican is so highly talked about. We went on a Monday night for a birthday dinner and it was fantastic. We started with the Publican beer sampler and a charcuterie board. For the main course, we had short ribs and pork belly - the pork belly was to die for. I would order it again in a heartbeat.", "pics": null}}, {"review": {"des": "Service is on point. Excellent recommendations. I was told to get their pork belly but it wasn't on the menu today. Apparently the menu changes frequently. <br><br>We got the taste of 3 breads and spreads. Chefs choice half dozen oysters. Pickled veggies. Barbecue carrots - A MUST!! Then the main - smoked pork shank over grits. Jeebus it was good. My body must now recover.", "pics": null}}, {"review": {"des": "I will say the food and service is fantastic, Joanna and the wait staff were completely on top of things. But...3 of us ordered the chefs menu on Monday night and all 3 of us agreed that we left hungry. After spending $100+ on drinks and dinner you should not find yourself spending 10$ more on the way home for fast food, but that is exactly where we found ourselves...", "pics": null}}, {"review": {"des": "My wife and I have been waiting a long time to get back to Chicago and try Publican, and we were not disappointed!  We had one of the best, most memorable meals we have had in quite some time in this lively, community concept restaurant.<br><br>We both decided to do the chef's tasting menu, as we really wanted to sample as much as we could from the amazing looking menu, and it was quite the value.  We started with some pork and duck rillette on toast with blueberry compote (we ended up buying the rillette the next day to take home with us), which was a perfect and savory start to the meal.  We next had some oysters (yummy), house pickled veggies, and a marinated beet salad with goat cheese that changed the way I will forever look at a beet salad. Next came a house smoked mackerel with potatoes chips, and a charred cauliflower dish.  The smoked mackerel was outstanding - perfectly smoked and perfectly prepared - wonderful dish all around.  <br><br>The next course was memorable in all if the best ways - a 60 day dry aged sirloin with fennel and goat cheese slaw, and an craving inducing deep fried sweet potatoes with cane sugar and a lime crema.  The steak was beautifully prepared to a medium rare (a picture perfect medium rare), wonderfully seasoned, and had just the right amount of acid pop from the slaw.  The deep fried sweet potatoes will change your \"foody\" life (not literally, but maybe...).  We have never had such sweet, tender chunks of breaded goodness - they were like eating donuts made with healthy (!) sweet potatoes.<br><br>We then, relunctantly, moved on to a sea bass in pork broth and porchetta roast.  The sea bass was prepared nicely, nicely flaky, but was a bit of a let down just because the previous dishes were so wonderful.  The porchetta roast (house made) was also extremely good, really well prepared, but still a touch of a let down as compared to the previous courses.  Again, both dishes were wonderful as stand alone courses but when compared to everything that came before, which were exceptional, were a touch of a let down.<br><br>However, the desert dishes of ice cream (coffee and brownie) on a waffle, and an egg nog tres leches cake, were the prefect end to the meal. <br><br>The service was friendly, fast and courteous and very knowledgeable of the menu.  The drink menu was extensive, very well priced, and they have an enormous and unique beer list.", "pics": null}}, {"review": {"des": "The amazing five star reviews I read before coming here that detailed the great food somehow didn't match up to the experience I had. While the majority of our dishes came out pretty fast we ended up waiting a pretty long time for the Half Farm Chicken dish, not sure what happened with the timing for that. When the dish came it just wasn't that good, the sausage was pretty dry and and the rest of the dish was average. Maybe it was sitting out for too long? <br><br>I was also excited to try the pork rinds but when they came, they had A LOT of seasoning on them. Is that how it's supposed to be? Even when I tried to shake off some of seasoning there would still be a lot left. Seemed like someone just poured a bottle of it on the pork rinds. <br><br>While the food wasn't that great, our server was still really awesome. The atmosphere inside was pretty fun and the decor was a bit different but I really liked it.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hvUi1vPShkKKtRaZItErzQ/348s.jpg", "caption": "Inside, some tables are communal seating and some are booths"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VE-9p_--cf4U1shcp_EPXA/168s.jpg", "caption": "Inside"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GxKA1DXx17uP9_cVTbvR3w/168s.jpg", "caption": "Spicy pork rinds"}]}}, {"review": {"des": "It was a cool Monday night when we entered with an 8:00 reservation.  The place was packed and buzzing with rock music blaring from the overhead speakers making any conversation challenging. Van Halen echoed through enough times to made me think that it wasn't a coincidence, someone liked the sound of David Lee Roth.<br>As I walked into the main dining room I noticed the irony of the artwork on the walls.  Caricatures of overly fattened swine adorned each wall hinting that either that the restaurant specialized in pig, or you'd feel like one by the time you were done eating.  On this particular night both were true.  I had a variety of different pork dishes, and walked out feeling sufficiently stuffed.  <br><br>Seating - There's a huge horseshoe shaped table in the middle of the main room, with 4 person booths along one wall.  The booths have low doors on them that are reminiscent of farm animal pens, but also provide some privacy if you prefer that over a shared table.  Determine ahead of time if you want to be off by yourself or seated next to strangers.   <br><br>Pork Rinds - Not what I would typically order and don't expect these to be similar to what you get out of a bag in a vending machine.  These were served in a conical paper funnel and were so light and airy they almost melted in your mouth.  The seasoning dust spiced these substantially.  Caution - Don't inhale while eating these as you might get a lungful of spicy dust and end up coughing the rest of the night.<br><br>Vegetables - This was probably the biggest surprise of the night. I went in knowing that this place specializes in high end meats, but had no idea I would enjoy the vegetable as much as anything else.  The Cauliflower was roasted until browned and crispy on the edges and only lightly dressed with herbs and cheese. The Barbequed Carrots had distinct grill marks and were sweet and nicely balanced by the dill and pecans.  Our Squash dish was cooked soft and sprinkled with feta, pomegranate, and pumpkin seeds.  Each single source farmed and all were fresh and full of flavor.   <br><br>Pork Belly - This is a must order and was unlike the Asian style pork belly I was accustomed to.  Rather than having to peel off thick layers of fat, the meat was slow cooked and marbled with melted fat.  So tender that you could cut it with a fork and seasoned with wild onions and grapes.  This is the only pork belly that will literally melt in your mouth.<br><br>Taste of Three Hams - A sort of ham sampling if you want to do some compare and contrasting.  We were given paper thin slices of Kentucky, Iowa, and Spanish hams.  All good and all different.  If this is your first time at publican or you're a ham fan and not sure what to get, this sampling is for you. <br><br>Dry Aged Ribeye - Not on the menu so feel fortunate if its available when you order.  A solid 22 ounces of buttery Ribeye sliced and served with roasted potatoes.  We ordered Medium-Rare and it was cooked just right.  A nice dish to share.<br><br>Dessert - We are too full to order dessert, but couldn't resist ordering a big Cookie Jar filled with surprises.  Ours came as a sort of sad bear with a blue bow tie, but inside was a combination of chocolates, chocolate cookies, rice crispy treats, and layered dessert bars.  It was fun passing the cookie jar around and sharing with the group and good way to end the night.<br><br>Service - Our main server Joanna was efficient, knowledgeable, and friendly despite the heavy crown on a Monday night.  She gave us good suggestions and complimented us on our broad choice of shareable dishes. In the end there were probably 4 people that brought dishes and cleared our table.<br><br>Overall, the Publican does some outstanding meats, but don't forget the surprisingly good vegetable sides. Many of the dishes are made for sharing so go with a group, pass the food around, and enjoy the ironic artwork.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/u83QcNi5aIv2OPMiKz-QdQ/168s.jpg", "caption": "Inside the cookie jar"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/O1R0xlExSUxsrMTGPuuqOA/168s.jpg", "caption": "Cookie jar dessert"}]}}, {"review": {"des": "Came here with a fairly large group for brunch on a Sunday. I was impressed that they were able to accommodate a last minute reservation for 9 people (although that may have been because our reservation was for 9am when they open haha).<br><br>The food was phenomenal. I had the Belgian waffle which was great and everything else on the table looked amazing. Definitely trying the red wine poached eggs next time.<br><br>My biggest gripe with The Publican is the pricing on their drinks and sides. If I were to go and just get an entree it's pretty on par with other restaurants in the area, but $5 for coffee? Kind of absurd.", "pics": null}}, {"review": {"des": "I don't get the hype. I came with high expectations of the food and left with disappointment. I did love the look and feel of the restaurant though. The atmosphere of the restaurant is reminiscent of another era with medieval looking high-top Bavarian dining tables that encourage a communal dining experience. Honestly, if I saw people getting their wine in goblets, I wouldn't have been surprised.<br><br>We didn't make reservations and were luckily able to get seated right away. Our server took his time in taking our order and was a little too pretentious for my taste. I read raving reviews about their Pork Shank and asked if they had it and he pompously pointed at the date on the menu and with a conceited smile said, \"Our menu changes everyday.\" Okay then. That's how it's going to be.<br><br>The dishes were not worth the prices. <br>-The publican bread plate with cultured butter and sea salt was good but I don't understand how an item that is free in most Italian restaurants costed $7 here. <br>-The heirloom tomato salad was delicious. It was probably not worth $15 but definitely tasted like farmhouse fare and I enjoyed the combination with the crema. This was the best dish we ordered.<br>-The farm chicken with summer sausage and fries was so simple that it looked like a large kids' meal. Nothing interesting was going on in that dish. The chicken tasted barely seasoned and the sausage and fries were meh. For $27 I would have expected more than the typical rotisserie chicken you'd buy from your grocery store. <br>-And last but not least, the Porchetta. I'm glad they give the option to have this dish as half a serving because I barely ate it. The Porchetta was too thinly sliced and fatty and the chicories made the dish extremely bitter.<br><br>All in all, for the price, there's much better restaurants to try in Chicago, like \"Girl and the Goat.\" Also, I looked at the menu 4 days later and it looks the same to me...", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/l_mT7uqFJM6gZP9TJZs4kw/348s.jpg", "caption": "Publican sourdough and multigrain bread plate ($5) with cultured butter and sea salt ($2)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LhMueJ1lIUH56ZFnQE3hDQ/168s.jpg", "caption": "Farm chicken - half chicken with summer sausage and frites ($27)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dRbLIo4y2FfszBkovYFjPA/168s.jpg", "caption": "Heirloom tomato salad ($15)"}]}}, {"review": {"des": "Fun restaurant with colorful eats. At first glance of the menu, it appears that they only serve meat and fish, but then you realize that this is one of those places that will throw in ingredients you've never heard of and harmonize them beautifully. Call me a simpleton, but most of my favorites were from the vegetables section of the menu.<br><br>The faves:<br>- fried sweet potato<br>- taste of three hams<br>- cauliflower<br>- frites (which come with what I believe is garlic aioli)<br>- chile sausage<br><br>The good:<br>- chicken liver pate<br>- taste of three & bread (the butter is the bomb)<br>- rock cod<br>- (dessert) cookie assortment (variety of cookies and other sweets that came in a large strawberry-shaped cookie jar - best one I had was the chocolate croissant)<br><br>The not as good but still good:<br>- beef heart<br>- daily pickles (includes pickles, cauliflower, and onions)<br><br>They have some interesting seating options here. We were seated at a long, right-angled community table (you're pretty much elbow to elbow with your neighbors but that's part of the fun) but they also have high tables and booths that look like they're totally fenced in from the outside world.<br><br>Have to note the cool overhead lights and massive portraits of voluptuous pigs.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MO6OEK6mNmM059Qv12Atvw/348s.jpg", "caption": "Table setting. I like the cutlery."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2COYQaGfapXzfPLpTUplFw/168s.jpg", "caption": "Lights + pig painting"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gIY1epzV9a_IbzqfAl7ZCA/168s.jpg", "caption": "Sweet lights"}]}}, {"review": {"des": "I love James Beard Award winner Paul Kahan and his restaurants. This is a pork inspired restaurant and one of my favorites. The kicker is that i don't eat pork! They have other foods besides pork, but if you really like the other white meat, this is the place to go. <br><br>They are small plates made for sharing. We had so many plates and it was all well worth it! My guest had some pork plates and he liked them, the pork rinds (they make from scratch) and plate of assorted porks (head cheese, and other things). He thoroughly enjoyed them. We also ordered the beef heart tartar which was fantastic! We ordered a side of the BBQ carrots, which were Smokey and had a nice spice to them, oysters (delish and fresh), duck confit (fatty, full of flavor, mixed with cheese and spices), good ol Publican bread (they have a bakery and if i lives close I'd be fat from their bread) which was served with a cheese spread, the mussels (creamy, plump and plentiful) and the cream puff dessert. <br><br>Everything is made from scratch, his drinks are perfectly concocted to enlighten all the taste buds and the servers can help you pair a drink and feed. The service is also outstanding! Our server, Alexandra, was patient and helpful! <br><br>I love this place!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/L6IrRbijfZqQy56Wb6hGgQ/168s.jpg", "caption": "Cream puff"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AwEoebfARsfZojnUFYu-sg/168s.jpg", "caption": "The best mussels"}]}}, {"review": {"des": "I love raw oysters. So the moment I heard The Publican, Oysters & Happy Hour I knew it was meant to be! The oyster special was $1 oysters and the variety was chef selection. I had the Wellfleet variety which is an east coast selection that had the perfect amount of brine. What they lacked in size was accounted for in taste. The oyster selection has something for everyone. With 6 different oyster selections from the east and west coasts, any oyster lover is guaranteed to find the right combination of taste and size. The cocktails were tasty as well! Last but not least, try the melts in your mouth frites with garlic aioli, so tasty!!", "pics": null}}, {"review": {"des": "Fabulous breakfast and brunch foods for reasonable prices! We ate brunch here and I had the eggs and potatoes hash. It's not listed as an option but they will do it if you ask. The eggs and their potatoes are fried in beef fat so they're delicious and tasty! I also tried the pecan roll and almost licked the plate. It was perfectly sweet and dough light as air. I also loved the herbal tea that was blueberry and hibiscus. It was wonderful!! We did ride share so parking was not an issue. My friends said they found a garage nearby.", "pics": null}}, {"review": {"des": "Don't go to the publican for dinner. WHY??<br>-Much of our food stalking ended up being for the BRUNCH items (unavailable)<br>-Overpriced<br>-Salty AF (both my emotions and the chicken)<br>-Changing menu nightly so you can't anticipate items<br>-Main item takes about an hour to cook, so you're full by the time it comes (ie chicken, but we were warned about this)<br><br>We ordered:<br><br>//$15 CAULIFLOWER GRATIN-feta, vadouvon curry, methi, cashew<br>-This tasted like straight up curry. Cauliflower doused in curry. I didn't really get much out of the dish but that. Small tiny plate for the price.<br><br>//$7 SPICY PORK RINDS $7<br>-Pork rinds with a cheese powder atop. Not worth $7 imho, why Yelp, why? You led me astray!<br><br>//$13 CHICKEN LIVER PATE-strawberry, shallots, ciabatta<br>-This was good. Liked the strawberry and shallots with the liver. They'll bring you more ciabatta for free if you run out. We liked this and thought it was a fair price.<br><br>//$27 FARM CHICKEN-half chicken w/summer sausage & frites<br>-SALTY, so so salty chicken atop fries. First of all: fries. Fries are fries. So let's throw that out of the equation. On to the chicken...breast was dry! Alright, a normal occurence. But the worst part was how SALTY this dish was. I'm one of those people who joke \"I like to eat a little food with my salt!\" but I really thought this was overboard. And why was the sausage so dry and rubbery? I couldn't even cut it with the butter knife they had provided...<br><br>All in all, this was not a meal worth the cost. It was bustling for dinner, and you're seated at tables with other parties.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/A9rhMtNnprqrq0NcLV9QvA/348s.jpg", "caption": "//$15 CAULIFLOWER GRATIN-feta, vadouvon curry, methi, cashew -This tasted like straight up curry. Cauliflower doused in curry."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6fZBXAdIlI7mD-sM49nTDg/168s.jpg", "caption": "//$27 FARM CHICKEN-half chicken w/summer sausage & frites -SALTY chicken atop fries. First of all: fries. Fries are fries. Rubbery sausage."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6EJJ56P5Q2Fjlx8lqooz2Q/168s.jpg", "caption": "Dry chicken breast"}]}}, {"review": {"des": "Food: 5/5 Service: 5/5 Ambience: 4/5<br><br>I'm so impressed! Wow, as a DC native I can honestly say that this Chicago restaurant set the standard for high quality. DC needs a place like this!<br><br>Food: We started with the bouchot mussels (5/5) that come with some sour dough bread to dip. I've never seen such large mussels before. Super tasty and a large dish that you can have as a large entree or share with 1-2 other people. We were pretty full but then received the bread with pimento. The bread was fresh baked and paired well with the pimento. For entrees we got the sirloin steak (5/5) and the pork shank (5++/5). The sirloin was great but definitely a smaller dish compared to the huge pork shank. Now to talk about this pork shank - WOW. The meat was falling off and cooked/flavored to perfection. It came with this slightly sour Greek yogurt sauce with a rice/some grain. Loved everything about this dish and definitely huge so have an appetite or share! For drinks, I got the Coastal Fizz, it was awesome and I got a second! <br><br>Service: I was very impressed with the service. They take their customers seriously. Shout out to our AWESOME waitress Kat (sp?). She was super friendly, attentive, informed on the menu, and handled the busy outdoor patio really well. Despite how busy she was, she took her time with us, offering suggestions and even gave us great recommendations for Chicago! You're the best Kat!! I also noticed what appeared to be the Manager walking around, helping with tables, she came over and checked in with us and other tables. Also a shout out to the bus boy staff! Again, where can I get this type of service in DC? I didn't get his name but our bus boy was super attentive and made sure our tables were clear and ready for the next dish. Our water glasses were never empty. I notice when service is taken seriously and I appreciate it. I'll go out of my way to speak about this place to friends and family. I'll also be back once I move here!! <br><br>Thanks the Publican!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/g8QPiJvzRswetmNR8YI7RQ/348s.jpg", "caption": "Coastal Fizz - light and summery! Very good!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1C2ifinnWUDcuAoNtypiSw/168s.jpg", "caption": "Bouchot Mussels. This dish was amazing and the mussels are HUGE. Definitely could be a large entree or share with 1-2 friends."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GHdyjz2Sd2ka9swOv8M8og/168s.jpg", "caption": "The Pork Shank! 5+++/5. Amazing delicious dish!!"}]}}, {"review": {"des": "Just had brunch here today and it knocked my socks off!<br><br>The good:<br>-Atmosphere<br>-Service<br>-Red wine poached eggs<br>-Coffee<br>-The $5 brunch box drink<br>-Thick cut maple bacon (GET THIS)<br><br>The bad:<br>...<br><br>Honestly, probably the best brunch I've ever had from a pure food perspective. If you need a new brunch spot in Chicago to try, head here!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hr7IUme_Pi0YcgO94MIRjg/348s.jpg", "caption": "Red wine poached eggs (front), maple bacon (back). Get both!"}]}}, {"review": {"des": "It's interesting because when I first stumbled upon this restaurant around 6 years ago (with my undeveloped palate), my friends and I couldn't understand half the menu and promptly left upon also seeing the prices. But coming back now as an adult made me realize what all the hype is about.<br><br>Service was quick and yes, seating is interesting in a communal style, European-esque setting. It was still a good spot for a casual date though pretty loud. We got some beers and the bread plate to start- an extremely filling appetizer but was delicious to try all the spreads. The two of us only finished half the plate.<br><br>We also ordered the bbq carrots upon multiple recommendations, and this was tasty. Basically like bbq sweet potatoes.<br><br>My favorite dish was probably the pork belly, which is usually my favorite. This was super fatty and melt in your mouth delicious. The flap steak was also a delicious meat dish and was a very close second favorite. Flavors were great though portions small for more than two to share.<br><br>Overall, I had a great experience and loved the interesting atmosphere and just as unique dishes. I would definitely recommend to those with defined palates who enjoy splurging on their foodie adventures.", "pics": null}}, {"review": {"des": "Because the Roister website invites non-reservation holders to stop in, I did. Because they are too cute by half, they have no phone. Amusingly for them they were closed for a special party and I was left out in the cold. Luckily, I noticed The Publican on my Uber ride a block farther. A more welcoming space awaited. And they have a phone! Amazing!<br><br>Don't miss The Publican's Aged Ham. I tried a smoky delight. Served with goat butter and beautiful earthy bread, I gobbled up a dozen tiny salty-smoky sandwiches. These hams are a joy that should be sampled if you visit. <br><br>An Avocado Salad sounded intriguing. To play against the softness of the avocado and the feta, they wisely used a Jalapeño laced dressing. Adding this spark turned an average plate of greens to an explosion of flavor. <br><br>I finished with the Duck Confit ( great ) and Baba at Rum dessert ( a rum cake, custard mash up) and was totally satisfied. <br><br>Perhaps The Publican is not as cutting edge cool as Roister, because they have a phone and you can call them and ask them if they might have room for you and they will likely tell you if they are having a private party, so you can make alternative plans. The next time I'm in Chicago, I won't make The Publican my backup choice. It will be my first choice.", "pics": null}}, {"review": {"des": "I did not know what to expect of this place but it turned out to be a real winner! They seat everyone relatively together, even though there is a good percentage of private seating, but the long walnut communial tables have a lot of people sitting next to strangers and it works out really well. We did not know what to make of it but we loved it by the time we left. Everyone gets along. There is a lot of noise from conversations and sometimes we almost had to yell to each other across the table, but it was just fine and we ended up enjoying that aspect as well. <br><br>The food was fantastic, really exceptional, and we all commented that each of our selections were some of the best breakfast food that any of us could remember in recent history. I got the mushroom scramble with hash browns (I highly recommend the hash browns) and my wife got the wine poached eggs. I don't think there are any bad dishes on the menu because we ordered just about everything.<br><br>We will be back here and we all give it our highest recommendation. On the opposite side of the brunch menu is their normal lunch menu and it was very vegan friendly, actually, quite interesting. We are going to return for lunch as well.<br><br>Incidentally, Publican means pub owner and they wait-staff all wear t-shirts that distinguish the word from any political meaning.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ff7vvSJaeDmHoAS4ZA7VDA/348s.jpg", "caption": "Orange Cake Donut"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Qrn0TNGl__gVKPtcT3YK1Q/168s.jpg", "caption": "Pecan Sticky Bun"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/V2qj2B43f6ucqjsVlk6HjA/168s.jpg", "caption": "Looking tables ... Very intimate!"}]}}, {"review": {"des": "Never had a bad meal here...the menu is so well done and thoughtfully put together... Not only is the food amazing but the staff us soooooooo good at what they do, which is make sure every guest is delighted with their dining experience... Didn't get as many pictures as I'd like because I was too busy eating... Order the bread with the Pimento Cheese!", "pics": null}}, {"review": {"des": "I came with my brother when he visited and we ended up loving the restaurant.  My brother is someone who can put away some serious food (think Homer Simpson at the Frying Dutchman), and so I was a tad worried he would leave unsatisfied.  But sure enough, even he left here fat and happy. <br><br>Pros:  Delicious food.  Whatever you get, just know you'll get the best quality of whatever you're eating. We chose to do the Chef's Menu ($65 pp) and while I don't regret it, I wouldn't do it again as I definitely know what I want next time when I return.  Pork belly, yes.  Sweet corn, yaaaasss!  <br>Our server made an effort to speak to us like the place wasn't insanely packed on a Friday night and checked in on us every so often before running back off into the madness.  Great service.  <br><br>Cons:  The music was way too loud to comfortably have a conversation with just normal speaking volume.  For me, it would be a place that I would bring friends so I could be loud and obnoxious with, not an older brother that just stares at you awkwardly through 11 courses.  I joke, I joke.  But seriously, I'm going to need more alcohol next time if I come back with family.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YQ68u_WFJRDQV3pHRk6Ydg/348s.jpg", "caption": "Top favs were the sweet corn (big pic) and the pork belly. Tasting menu $65 pp (two other dishes not shown)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ClblomZoOkuVlV7j_NSa7Q/168s.jpg", "caption": "Dessert menu Sept 2017"}]}}, {"review": {"des": "The Publican was a great experience in my book. It's got a very communal feel and the freshness of the food is noticeable. I really enjoyed the Dorade paired with a saison, the avocado salad, and the fried clams. <br><br>The seating situation is a little odd. If you sit in the communal table you'll be elbow to elbow, if you sit in the booths (make a reservation to secure one) they have these very strange and in my head at least unnecessary barn doors they close. Otherwise, the atmosphere is quite nice along with the decor and I think the lighting is excellent. The Publican offers something for everyone - from the freshness of the vegetables, to the cuts of meat, seafood, and the dessert offerings. I loved the waffle and scoop of ice cream!", "pics": null}}, {"review": {"des": "Publican was recommended by a friend who said<br>It was a great place to entertain clients ..true but not<br>To do business because it's loud..and one has to shout...<br>Even at the waitress sooo ....food wise very good with the exception of the Steak which is really a steak salad<br>(And should be described that way)<br>The mussels were amazing (wife's order/she always orders better)....wine list is obscure...nothing you will recognize..and pricey(Chicago??? nothing Red under $48)...all in all..just remember its a family style<br>Restaurant", "pics": null}}, {"review": {"des": "The Publican is definitely one of those restaurants I recommend to anyone heading to Chicago, no matter how long the trip.<br><br>My wife and I went in December of 2016 and absolutely fell in love with everything they had to offer. The drinks were intricate and boozy, and the meat-centric fare was delicious. I'd try to track down everything we ordered, but I'm sure they've changed their menu quite a bit since we went.<br><br>Nevertheless, I know this is a place that people will and should be going to for years to come when they want a lofty spot and a fantastic meal.", "pics": null}}, {"review": {"des": "I love the simplicity, great food and amazing atmosphere this place provides. I came here just for appetizers, but will definitely be coming back for dinner sometime! We had the frites with the egg, the half charcuterie plate and the three sisters cheese. The charcuterie plate was the perfect size and full of delicious meats, and the fries were perfectly crispy and combined greatly with the fried eggs, but my favorite part was the three sisters cheese which came with honeyed tart cherries and that combination was truly unbelievable, amazing!", "pics": null}}, {"review": {"des": "I wanted very much to like The Publican as my daughter booked it for our family of seven gathered on her one-year reunion of moving to Chicago.  My adult kids did warn me that this caverness bare pub featuring 30ft long bench seating, could be acoustically loud, but nothing could prepare me for the ear-shattering punishment that could have ruined a meal twice is good.  <br><br> I certainly don't mind the occasional boisterous pub atmosphere even when the prices rival much finer white tablecloth dining affairs, but unless you are prepared to consume your meal in a head-splitting disco like atmosphere, I suggest you avoid this worse than mediocre tourist trap.<br><br>We were greeted at 6:30 in a 2/3 vacant dining room by a hostess that wouldn't even look up.   I recited our name and when she found our res on her e-list, she told us our table was ready.  We stood to the side waiting to be seated, but instead five other parties that came in behind us were inexplicably seated first.   The large gentleman that took us to our table simply gruffly grunted follow me - which struck me as more than odd.  I should've followed my instincts and walked the other way.<br><br> Our server was similarly vacant, yet kept coming back every minute to pester us to order drinks (a single beer runs $8-12). We got the constant  feeling that we were being rushed to turn the table over.    The quality of service deteriorated from there. <br><br> The busing staff is cold and brusque. The guy that refilled our water glasses took no care and the water slopped and splashed all over the table drenching two menus.   (He didn't skip a beat.) This overrated pork place, in search of a true identity, dresses it's waitstaff in building maintenance uniforms. The service was befitting the part.<br><br> Our waitress pointed out that management recommended a family-style approach to ordering.   We took her at her word, but felt she over represented the portion sizes, especially the salads and vegetable sides, suitable for one person. Definitely not \"two or three.\"  <br><br>We ordered the donut peach salad ($14); corn on the cob ($15 for a single ear); and a \"little gem\" lettuce salad to share ($11).  The peach salad featured unripe peaches (which reappeared like a bad dream, on the pork belly) drenched in a tart over-vinegared simple dressing, not very tasty.  The corn on the cob was hardly family style. It literally was a single ear of grilled corn, priced at $15.  Caveat emptor.<br><br> For the next course, we ordered the large charcuterie plate,  traditionally served as a first or second course. The service was so mixed up and disorganized, they brought this cold platter last, shortly before the check arrived. And I'm not kidding.   When I asked our server about the timing, she defensively said \"that's the way we do that, in any order that it comes out of the kitchen.\" That's about the way it went the whole night.   Practically none of it was especially good and it's hard to picture what the small platter looks like if this was supposed to be the large -- cost $26.<br><br>Our server recommended the \"Farm Chicken\" platter, which she bragged has been on the menu since the restaurant's first opening. She was right that it was generously portioned - compared to the other skimpy dishes--but at $27 for a cut-up half roasted chicken over a bed of soggy french fries soaked in chicken grease, and no veggie sides, the value is simply not there either. Moreover, the chicken was not particularly flavorful or well seasoned. It was however smothered in salt, as is most of Publican's food.  If you take the time to read other honest reviews below, you will see that the food is over-salted. Believe it when you read it. <br><br> Perhaps most disappointing for a pork place, was what should be their signature dish: the country pork ribs ($28). Never mind the fancy description on the menu. The few sinewy ribs are nearly flavorless and they are very tough, so much that you want a sharp steak knife to peal them off the bone. So if you were waiting for fall-off-the-bone country ribs, forget it - you've come to the wrong place!<br><br>Even the Pork Belly ($25) supposedly from Rotterdam Holland (sure thing...) was skimpy, hard and relatively tough.   <br><br>As bad a value as the food is, the beverages somehow manage to be worse.   12-ounce bottles or cans of beer will set you back $8-$12, plus 25% tax and tip. The nine dollar shot glass of Mede, which is really like wine, is barely more than 3 ounces!  <br><br>I wanted to like Publican, but honestly could not find a single thing to like, except after the check came and I could final leave.<br><br> Which brings me to the last subject, the overrated reviews herein. Some restaurants play it straight and let the public express their views. You will find honest reviews woven into the content below, and then you'll find they are buried beneath a series of phony five-star reviews no doubt purchased by this establishment.  Look for the honest ones and be so guided.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/akinrSZAoqNe9eB4keTmEQ/348s.jpg", "caption": "I’m always suspicious of a restaurant that does not post it’s prices on its own website. I post it here as a public service!"}]}}, {"review": {"des": "Service: one star<br>Food: two stars<br>Total: three stars <br> <br>Very disappointed brunch. After reading the high reviews, we booked reservation for Easter brunch. We ordered thick bacon, waffle and pork belly. Coffee and pu er tea. Thick bacon is the best of all, but not very impressed. Waffle is so so, pork belly is cold. Coffee is nothing special.<br><br>Service, very bad. The waitress didn't tell us anything about the menu, if we know pork belly is cold and we will not order it, or it's not fully cooked.  She was not very friendly and warm. <br><br>We will never go back again and we felt bad to choose the publican for our Easter brunch.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Dw6G1lXAYa-Rd_neqOWPqQ/348s.jpg", "caption": "Small portion and so so"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_LtCgX4khl8OaV_-GeX8hw/168s.jpg", "caption": "Pork belly is cold. Very small portion"}]}}, {"review": {"des": "I feel there's a little too much hype around the beer menu and excellent overall. The beer selection, as far as the trappist selection goes, is weak AF. <br><br>If you like pork then you're in luck. This place had the best rinds, hams, and meat in general.the oyster menu is actually priced well but the oysters themselves are nothing to write home about. <br><br>The lighting is excellent but the decor is bleh. The service was good but it was so LOUD. I couldn't hear what others were saying to me across the table.", "pics": null}}, {"review": {"des": "The best salad I've ever had. I could eat this all day. Served nice and warm and comes perfectly seasoned.", "pics": null}}, {"review": {"des": "Unique ambiance, with farm tables and tall chairs. I ordered the crab scramble which was really good. Light and fluffy eggs with just the right amount of crab for flavor. The hash brown side was perfectly cooked. The other pork dishes (tonkatsu) my friends ordered did not get high remarks. They mentioned that it was too soupy.", "pics": null}}, {"review": {"des": "Two friends were visiting from out of town and both were going through a pretty strict diet that was heavy on protein and less on the dairy, sugars, etc. They picked out The Publican as our dinner spot and I was eager to try out a new establishment that was literally a bus ride away from me.<br><br>At first glance, The Publican looks like another one of those over-priced tapas \"family style\" restaurants where the portion sizes are tiny, the costs are high, and everything comes in an odd number. Our waitress even recommended that we order 1-2 plates per person to share. Sounds like another one of those kind of spots, right?<br><br>We were hella wrong.<br><br>The Publican may have just climbed the rankings as one of the best restaurants I've tried in Chicago. Their service was fantastic, the portion sizes are much larger than what you'd normally expect from a new American restaurant, and everything was delicious. For the price we paid, it was well worth it!<br><br>We tried the following together:<br><br>- The Publican Bread Plate ($11) and tried their Sea Salt Butter (heavy so a small dose goes a long way), Sunflower Sikil Pat & Mint (my personal favorite as it was very easy to eat), and White Cheddar Pimento Cheese. Bread was a bit hard but still delish.<br><br>- Fried Cauliflower ($11) was our favorite dish hands down. Cooked in boursin cheese, jelly, and mint, everything on this plate was working<br><br>- Farm Chicken w/ Summer Sausage & Frites ($17) was a massive plate with tender chicken, phenomenal smoky sausage and fries for carbs. It was big enough to share with three people<br><br>- Beef Tongue ($18) topped with broccoli and cilantro over sesame bread was fantastic as well. The tongue was very soft and melted in your mouth. Don't be alarmed because the tongue was tasty and will make your own tongue salivate<br><br>- Rock Cod ($17) that my friend got with much of the sauces and walnuts removed was still delicious. They did a great job making sure that it met my friend's dietary restrictions, and honestly I wasn't missing any of the dress up for this dish.<br><br>We had a great time at The Publican and I am excited to come back in the future to share this experience was other friends. They've got a great thing going, so if you're looking for a fancier spot with larger portions, this is the place to be.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SFMb8QSkXcL4psZ7nBpaHA/348s.jpg", "caption": "Beef Tongue"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UiwNh7MH7hYDJ4lq0dArMg/168s.jpg", "caption": "Rock Cod (simplified to fit diet)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Y9fPGrrxy0gpSNzh6DJFXQ/168s.jpg", "caption": "Farm Chicken"}]}}, {"review": {"des": "Honest review: amaizin i loved the food the service was amaizin supper attentive gave good recommendations always gave new silverware the ambiance is really rustic n its big theres a lot of seating just theres alot of communal dining so if u dont like that make a reservation it is really loud here so i wouldnt bring a date its more for like a cool hangout u can get half portions of the big entrees like instead of getting a lot of porchetta u can get a smaller version the only thing i didnt like bout the food was thought that the desserts were a lil basic feel like they could have been alot better.<br>best things: bbq carrots/ pig brains/ sirloin/pork belly/ farm chicken<br><br>Bbq carrots $10 loved it! i hate carrots with a passion like i get mad if a dish has carrots in it but this was so flavorful. The carrots are not hard or supper hard n the flavor on them really does taste like ur at green street smoked meats the walnuts adds crunch wish there was more the dill adds freshness n the sauce was really good<br><br>Pinkerton Avacado salad $14 if u like refreshing dishes or drinks youll love this i didnt really care for it because it felt more like a palate cleanser wasnt really that flavorful it was a very subtle dish<br>wish the sauce was more rich the best part was the fried quiona put more plz <br><br>Fried pigs brains $11 amaizin! Ik alot of people are scared to eat weird food but just try it!<br>It comes with a salsa verde that is so tasty just put more plz and gooseberries cut through the richness the herbs added freshness best dish of the nite<br><br>Hake $26 i didnt like this. The fish was cooked perfectly crispy and supper moist the issue was the sauce did not taste like a curry it tasted like a very basic sauce the other components added good flavor like the clams added saltyness n the gooseberries added acidity plz give this curry flavor<br><br>Dry aged sirloin 21$ this was delish! The sirloin was cooked perfectly n had the best sear on it so it was really crispy the walnut ajika was amaizin it was like a pesto but with more of a nut flavor with more flavor the cheese added such a great flavor loved the straberries but they werent sweet enough making a sauce n making it more sweet would have been better <br><br>Pork belly $27 best dish of the nite the pork belly was the biggiest i ever seen n it was perfectly it was supper crispy on the outside n supper tender on the inside the peaches added sweetness so it was the perfect combination of sweet and savory the beans with the sauce added richness to the richness i wanted to order it again<br><br>Porchetta $33 this was the worst dish of the nite. It was extremely bitter n had a bunch of odd flavors that didnt work together. Chicories are extremely bitter so cooking the sauce in it was a bad idea because it made the sauce bitter then theres chicories on the plat which adds to it the black berries were really acidic so it added a weird tart flavor. Then this dish need a crunch factor badly the pork was tender but not that flaborful <br><br>Farm chicken $27 amaizin the chicken was to die for it was supper tender and really flavorful the fries were cooked perfectly crispy without being greasy just wish they had some cool spices on it or something to make it unique. Thought The sausage was gonna be weird with the chicken but it actually goes together n really enhances the dish my complaint with the sausage is the sausage casing is really hard like indelible n wish the sausage was chorizo or a merguez something more flavorful this dish needs a sauce really badly something to tie it together n something spicy because hot sauce makes chicken taste way better<br><br>Buttermilk cheesecake 11$ amaizin presentation is terrible but its so tasty picture like cheese cake dumped into a bunch of sauce its kinda like a dessert soup. The cherries added tartness to cut through the sweetness the cheesecake was so good! My only issue is it needed more texture the using a cookie crust in this wssnt a good idea got mushy n was a weird texture so plz fix that maybe use a nut crust or dont put so much sauce<br><br>Toasted panna cotta 12$ amaizin the panna cotta texture was amaizin the peaches were amaizin really enhanced the dish the blackberries cut through the richness n toasted coconut added more texture just wish there was something else that added more texture <br><br>Oprah cake 12$ if u love tiramisu youll love this i didnt like it because there was to much of a coffee flavor it overwhelmed everything else", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2HBYy0B2I5G0TC3r1txhBA/348s.jpg", "caption": "Front"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Pb4spsOC4X7_YciLNEP-nA/168s.jpg", "caption": "Front door"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/J1w6ZshYlD0R6eBif4ya1g/168s.jpg", "caption": "Bill"}]}}, {"review": {"des": "Pros:<br>Dishes are all well-balanced in flavor, texture, and saltiness<br>Bread is amazing<br>Chefs are not afraid to use less conventional meats like chicken liver and pork rinds--expect something interesting on the menu<br>Picnic plate had uniquely pickled cauliflower and mouthwatering bread and spread<br>Poached eggs were cooked well, and prosciutto and arugula paired perfectly<br><br>Cons:<br>Appetizers tasted good but I'd rather save my money for the entrees<br><br>Recs:<br>Order the picnic plate and an extra order of bread to share between two people<br>Visit Sawada for coffee", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/J3Bb1G5pdzfhAQRdnTlZmw/348s.jpg", "caption": "Poached eggs"}]}}, {"review": {"des": "Delicious food, no doubt. But one of the best restaurants in Chicago? I'm not sure it quite lives up to the hype, in my humble opinion...<br><br>...which is shared by several other people I know...<br><br>Anyways, I'll start with a couple of the issues we had. First, the notion of food coming out when it was ready was never explained to us. So, we ordered like a normal restaurant, with appetizers then main courses for each of us. It was frustrating that each of our mains came out at different times, so essentially one of us was eating at a time. The other issue was that dessert took a while, and our server, who was fantastic besides that aforementioned lack of explanation, was clearly frustrated. It was my mom's birthday, and it took forever to get her candle out to the table. <br><br>Now that those are out of the way, the food was very tasty. Fortunately for you readers, I was able to taste all of the dishes. Appetizers were the bbq carrots, beets, and shishito peppers. The flavors in all three were great - my personal favorite was the beets. The carrots aren't super soft - some of my family liked it better that way, while I would have preferred a bit softer. I'm honestly not a huge pepper fan, but the rest of the flavors were really delicious in that dish. <br><br>For mains, we ordered mussels, halibut, beef tongue and sirloin. Again, all delicious. The sauce the mussels were bathed in was amazing, and it was great that they serve it with a fresh sourdough baguette to dip. The halibut was sublime, tender with a perfect sear on the outside. The beef tongue was also great, though maybe my least favorite of the bunch. The sirloin, which was my main, may have been my favorite. The tzatziki and feta really gave it a unique Mediterranean twist, and it was perfectly cooked. <br><br>The desserts were overall the most underwhelming part of the meal. As usual, I ordered well, but the others were not as well loved by the group. The worst was the strawberry mint sorbet. The mint was totally overpowering, and it was tough to taste the strawberry at all. My dad ordered the waffle, and added the ice cream. The weird thing about that is if you add the ice cream, they take away the fruit preserves. It was decent, but not worth getting at such a good place. The cajeta tart was very good, probably the second best dessert. The best dessert was the rhubarb crostata. It was like a warm apple strudel a la mode, but with unique flavors that set it apart. We made sure to scrape all of the crust off the skillet, so as not to leave any leftovers. <br><br>Overall, it was a very good meal, but I've had better non-Michelin Starred meals in Chicago. I'll also say if you have both carnivores and vegetarians in your group, this is a very solid compromise.", "pics": null}}, {"review": {"des": "Bread was tasty. As was butter. Good drinks. Liked the cauliflower. And the cookie dessert. No espresso though. Pork and chicken were fairly dry. Carrots were underdone. Disappointed versus what I was expecting.", "pics": null}}, {"review": {"des": "I want to preface this by saying that I was feeling extremely under the weather when we had dinner here and this might've impeded my tasting abilities and my drinking.<br><br>We had reservations about a week out for a party of 5. We were sat in one of the long communal tables. These actually were big enough that you didn't feel you were soaking in the conversation from the party next to you. The interior was cool; lots of hanging lights, wooden tables and chairs, and some high-tops on the side. A few of us had gotten dinner there in the past so they had many recommendations. We got way too much food and the waitress even said so.<br><br>The plates were brought out one or two at a time and they're all designed to be shared family style. Nothing really stood out to me except for the bread + cheese platter. The ham was actually also pretty good, but I was expecting to love the pasta or the carrots. Everyone loved the carrots, so I'm really thinking that the hype went over my head because I was sick. It's also pretty pricey for what it was. They had the spicy pork skin w/ flakes of spices on them and all I could think was, \"I could find this at a grocery store in queens!\" Shame that I was in a funk all night, but I'd really like to come back and confirm that it was my sinuses and my throat to be blamed.", "pics": null}}, {"review": {"des": "Genuinely enjoyed eating at The Publican. I drove here with my sister. We valet the car ($12). We had a reservation and got seated right away (and there was a crazy long line waiting to be seated) <br>The place was buzzing. The noise was very high, like in a market place . Our waiter checked in with us right away. We decided pretty quick on what to have: marinated beet salad and the pork shoulder. <br>The beet salad was fresh, a bit tangy, and well balanced with farro and feta cheese, finished with fresh herbs (the fresh dill was the perfect finish). The pork shoulder was cooked to perfection. Incredible moist and easily coming apart but still holding its shape. <br>Service was impeccable, food was just right, ambiance matched the neighborhood, and the feeling I left with was that of returning soon. <br>PS: kid friendly place (high chairs and the women's bathroom to the far right has a changing table).", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nUN8CmwK5wvm24tIpevgTA/348s.jpg", "caption": "Sugar anyone?"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/etIgthBKBp9JDyMjBOfVyw/168s.jpg", "caption": "Marinated beet salad"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Hfd_8e_eTdX9kqCwkvRX2Q/168s.jpg", "caption": "Pork shoulder w eggs"}]}}, {"review": {"des": "Amazed that they have maintained their quality.  We only go with 4 or more people because when we go with two it's less fun (less capacity for sharing).  We were there on a busy Saturday night.  It is loud so if you have issues with that, beware :)<br><br>We had our usual chicken dinner. It was still good but the chicken was a little less moist than usual. Great fries and flavor on the chicken.  Always love the pickles.  Had the three ham tasting dish. Always delight and this was no exception.<br><br>Because there was a long pause they brought us a complimentary dish of mussels and halibut. The mussels were clean and tender and the halibut delicious. We had not even complained about the wait--they just noticed and brought it as an apology. That's classy service :)  The flank steak dish was good too but I'm not sure because my husband and daughter were not great at sharing :)<br><br>Drinks were delicious too.", "pics": null}}, {"review": {"des": "Came here for dinner on a Thursday night while visiting Chicago. The place has a trendy hipstery feel. Most of the dishes are very meat-centric. It's not the best place to find healthy options as even the vegetables on the menu seemed to be drenched in butter and salt but I guess one doesn't come to a place like this to eat healthy. We ordered a variety of small plates and everything was pretty good. I particularly like the salmon and the beets plate. The beer list seemed to emphasize European style beers and not too many IPAs which happen to be my favorite. The atmosphere was noisy and the booths have a strange door that closes to resemble a pig pen which made me a bit claustrophobic. Overall I'd recommend it if you're looking for a trendy place with hearty, meaty dishes.", "pics": null}}, {"review": {"des": "This is probably one of my favorite brunch places in West Loop. You can't go wrong with anything on the menu. The food is flavorful and the service is great. We were able to get one of the booths and it was nice and intimate. We did five dishes for four people and it worked out perfectly. Pork Schnitzel was my favorite.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uOsxlwUCE3QB_UQ9xhAh0A/348s.jpg", "caption": "Brunch box"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fr8uC_aAzuxEbsxems3pKg/168s.jpg", "caption": "Buttermilk Fried Chicken"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tK9AsDJOfKHR4BS4SBnG6g/168s.jpg", "caption": "Lights!"}]}}, {"review": {"des": "Great spot in the meat packing district of Chicago. This place is a great spot for local beers and fresh food, cooked to order. Staff was really great as wll", "pics": null}}, {"review": {"des": "Oh man! If you love pork and can't afford to go The Publican for dinner, brunch is definitely the way to go here! The porchetta melted in my mouth. It was juicy, tender and full of flavor. It paired perfectly with the cornbread underneath the sunny side eggs. Breaking the egg yolk over the porchetta and corn bread = ultimate savory. And brunch is never complete for me without a side of hash browns. The crunch from the perfectly toasted hash browns was divine!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tOZy57omIUBT5x_89EB0Dw/348s.jpg", "caption": "Porchetta with Hash Browns // corn bread, calabrian chile, sungold tomatoes, and sunny side eggs"}]}}, {"review": {"des": "Strictly from a food perspective, The Publican in Chicago's hopping Fulton Market would be a winner.  We were four and we all shared a trio of ham (the Serrano was particularly good), some seafood, chicken, oysters, carrots, and tomatoes.  Everything was super-delicious.  So too was the berry cobbler we had for dessert. No complaints there ... but a restaurant is more than food of course.<br><br>So as to the rest of the evening ... the hostesses were incompetent.  There's no other word for it.  We ended up waiting twice, first for our table outside which was \"ready\" but we still waited about ten minutes.  We'd just gotten off a (late) plane, our body clocks were an hour ahead, and we were hungry, so this was particularly annoying.  Then, after it started to rain, we came back inside and waited again even though there were several empty tables.  Not impressive.  It was also unimpressive that there were insufficient umbrellas outside for the rain. It's not as if rain is unusual in the summer in Chicago (more like it happens all the time).  And once inside, the acoustics were awful.  I could barely hear my dining companions.  Finally, there was no decaf espresso.  <br><br>Other than a long wait to take our order, the waitress was sweet.  Still, I'd not likely go back gIven the plethora of other options in the area.", "pics": null}}, {"review": {"des": "Had to come to Chicago on business and called my daughter who is always traveling and said \"seafood\" She replies \"Got you dad\". The Publican  was  amazing the service perfection and the food OMG. Make a stop you  wont regret it", "pics": null}}, {"review": {"des": "This has been on my list of \"go-to\" places in Chicago. I finally had the chance to go on my birthday. The restaurant is really nice and they even have patio seating options.<br><br>Started off with the pork rinds. They were realllyyy good and satisfying as an appetizer. The menu items are meant to be shared family style. My boyfriend and I decided to order 2 plates each for us to try. I got the mussels and the country style rib. The mussels broth was flavorful and light. The country rib was great. It had a very asian kick to it with lemon grass and soy sauce flavors. The peaches were a sweet addition. My boyfriend ordered the sirloin and the pork belly. The pork belly was GONE in a minute. It melted in your mouth and the ricotta it came in was perfection. The sirloin was a dish that we didn't really care for. It was kinda charred and salty but the sirloin is meant to be charred. We weren't too keen on that. However, everything else exceeded our expectations. The food was amazing and the staff was super friendly. Definitely recommend this place and we will be back :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ymaKtvM72JnYgajGVF8Zcw/348s.jpg", "caption": "Spicy Pork Rinds"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-aq7MA5YxYEPiugo6lqgMA/168s.jpg", "caption": "Spicy Pork Rinds"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ESEcsbyA0nAAJQD9aPlbdA/168s.jpg", "caption": "Mussels"}]}}, {"review": {"des": "I don't know what else to say besides that the Publican was by far the best brunch spot. If you're visiting Chicago, this place is a must. Not only is the food and coffee incredible, but the atmosphere makes t great for any occasion. The menu not only offers a unique option of brunch plates, but is also diverse enough for everyone to enjoy.", "pics": null}}, {"review": {"des": "Right off the popular Randolph strip, the Publican still exudes the hip cool-kid, yet professional, vibes. The menu changes and offers a really good assortment of American Contemporary food that is delectable to the foodie but presented in a way that will not frighten a picky eater, which is a truly remarkable balance to strike. In addition, compared to its peers, I would say the Publican offers a great meal at a GREAT price point. <br>Expect communal eating that makes it a fun atmosphere - good for groups of 2-6. <br><br>it also has the benefit of being slightly removed from Randolph so there is hopes of finding a table in LESS THAN THREE HOURS (shout out to Au Cheval). <br><br>*Disclaimer* if you cannot tell already, this is my favorite restaurant.", "pics": null}}, {"review": {"des": "The Publican is one of the more unique places I've dined at. The interior is super interesting. We had a reservation at 5:30PM and were promptly seated when we arrived at a section of the long tables they have for communal dining. Around the walls of the restaurant are booths that are completely enclosed by tall swinging doors. The set up reminded me of medieval dining halls. <br><br>Bf and I opted to get 2 small plates and 2 larger plates like our waiter suggested. We ordered the sweet corn, chicken liver pate, aged sirloin, and cuttlefish ink pasta. Everything is meant to be shared. We loved the chicken liver pate, super creamy and came with perfectly crisp bread slices. The cuttle ink pasta was my favorite. Aged sirloin was pretty good too but a little too sweet for my liking. Surprisingly, our sweet corn came last and the portion was tiny! It was good but probably not worth the price. <br><br>Overall, I had a great experience here. If I am ever back in Chicago again, I would definitely come back to try more of their dishes.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/K0fFubSSh4qeBOyDS1NQ9w/348s.jpg", "caption": "Dry Aged Sirloin"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/V2cVgatfILMC2_g9_5pZkg/168s.jpg", "caption": "Cuttlefish Ink Pasta"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3X9xzecyatQZ06bz9Y6Fgg/168s.jpg", "caption": "Chicken liver pate"}]}}, {"review": {"des": "This is one of those family seating type of places. So you will most likely sit very closely to other parties. Around 9:15pm it was still busy, but not a long wait compared to other places in the area.<br><br>Brussels Sprouts - I never had brussels sprouts shredded so it was different. The dressing on it was light and citrusy<br><br>Charcuterie Plate - Mix of everything which was good! The pate was delicious!<br><br>Mussels - Fresh and tasty, I could have eaten these all day<br><br>Half Farm Chicken - It took a while for it to come out. Flavor was kind of there. The good tender parts were really good, then there were some dry pieces that lacked", "pics": null}}, {"review": {"des": "Great service and definitely great food! I heard of this place through the traveling channel and I have to say, it's definitely worth the try. From the carrot plate, to the bread and cheese spread, to the half chicken and fries, everything was simply amazing. Our waiter was attentive and welcoming. Thank you for the great experience! We'll definitely be back", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1ZPhyZAPoeWCK6s0R02MuQ/348s.jpg", "caption": "Cheesy Bread was to die for! Great recommendation on behalf of our waiter"}]}}, {"review": {"des": "The buttermilk cheesecake sounds great, what you get is this IKEA deconstructed looking like dessert. There's ton of liquid sauce and in that sauce is the tiny portion of the cheesecake part. It was pretty disappointing and I felt like it was trying to recreate the wheel while being bit misleading.<br><br>We got the farm chicken, I felt this was overpriced for what I got and had me comparing it to much cheaper chicken dishes that I've had and enjoyed far more in the past. It's $35 for the whole one, you do get some frites and sausage with it, but it wasn't worth it in my opinion. <br><br>A so so experience for me, others seem to love it here and they do serve some different and unique items. It's mostly highly regarded here from what I read but I wasn't the biggest fan.", "pics": null}}, {"review": {"des": "The Publican is a large gastropub with a unique seating arrangement - private booths along the perimeter, and this large communal wooden table with seats on both sides that wrap around in a large square around the restaurant.  Its a loud and fun environment, and service was quick and attentive.  We had a pretty good dinner here - one half-flawed dish but four very solid dishes.  3.5 stars but rounding to 4 for the great service.<br><br>Let's start with the half-flawed dish.  There were artwork of really, really chubby pigs adorning the walls.  It should have been a sign to order their pork dishes!  I ordered instead their half Farm Chicken which turned out to be half good.  Dark meat was tender, moist, seasoned, and great smokiness (5 stars).  Breast meat - seasoned, smokey, but dry like sawdust. (2 stars).  The rest of the sides of frites and summer sausage were actually good, so 3 stars overall.<br><br>The other dishes were very good:<br><br>* Half Dozen Oysters: Three from Vancouver BC, three from New England.  All very fresh and briny. (5 stars)<br>* Strawberry Salad: I like the addition of hazelnuts for crunch and the creamy cheesiness mixed with the sweet, ripe berries (4 stars)<br>* BBQ Carrots: Wow, the use of fresh dill really adds a nice tart flavor to the char-grilled carrots, which are sweet.  They added pecans for crunchiness! (4 stars)<br>* White Bass: Large filet roasted with clams, green chile broth, and fregula. Solid dish. (4 stars)<br>* Fulton Mess: This dessert is on the lighter side, with fresh raspberries, and lemon-vanilla meringue with the texture and taste like yogurt. (4 stars)<br><br>Portions are huge here.  Maybe best to order a few veggie apps and then either split a meat entree or order two seafood entrees.  I would not recommend the Farm Chicken, though surprisingly lots of them were getting ordered tonight.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NtsrQb69-r6Zu4OrPpMz3Q/348s.jpg", "caption": "Fulton Mess - Raspberries with vanilla-lemon meringue.  Similar to yogurt (4 stars)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Bv67cEH9fv6CL_KLsAD7Iw/168s.jpg", "caption": "Roasted White Sea Bass with clams, green chile broth, fregula (4 stars)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6IWbtRITf3q2T-GvshLW6A/168s.jpg", "caption": "Half Farm Chicken with summer sausage and lotsa fries.  Dark meat awesome, but white meat dry like sawdust!"}]}}, {"review": {"des": "Okay this was AMAZING. We went for brunch on St. Patrick's Day and enjoyed coffee, pork and potatoes, thick cut bacon, and a Belgian waffle. I capped my meal off with a peppermint tea and it was so nice to sip it and be surrounded by loved ones in such a pretty space. The only not-so-great item we ordered was the chocolate pastry which I felt was a little dry.<br><br>The giant pig art is a riot, the different patterned plates were beautiful, and I really like the communal seating. The only odd thing we noticed was the boxed-in booths with swinging doors. We couldn't figure out their purpose or benefit and thought they concealed booths that were in need of repair.<br><br>Service was kind and kept the coffee coming. Bathrooms were clean, nongendered (woop!), and had neat Hogwarts-looking sinks.<br><br>A fascinating and visually interesting place to have brunch with friends.", "pics": null}}, {"review": {"des": "I feel like Chicago is becoming my second home since I come here at least one week a month. Since Chicago is pretty much a foodie paradise, I get to try different cuisines and restaurants with each trip. <br><br>Recently we tried the Purple Pig and it was stellar. We wanted to try something with a similar vibe, shareable plates and a great menu. This place delivers on all fronts. <br><br>Before I get into the food, the area where The Publican is located is going through a renaissance. There's a ton of construction, and this looks like it will be a super place to live. <br><br>Okay, back to the food. This really is a 4.5 star place, with nearly perfect food, friendly staff and cool vibe.  The menu changes regularly, but they always have their standard cured meats, which I hear they offer in smaller and larger serving sizes or you can order a charcuterie plate with a few options. We decided to try the Serrano ham since I haven't had any since I was in Spain. The ham came with goat butter and bread, but I just focused on the ham. It was super. <br><br>We also settled on spicy pork rinds, pork belly, corn, fried cauliflower and green chile sausage. The spicy pork rinds were fine, but we ended up just eating one or two. To be honest, they were good but not much better than what you can buy at the grocery. The green chile sausage was a high point for me. Wow! This was good. It came with a squash caponata, Swiss chard, pine nuts and a cheese called ubriaco rosso. It was superb. The pork belly was also super.  They are so confident in its tenderness that they serve it with just a spoon.  Yep, it's that tender! The cauliflower to me was too sweet and could use some acid, but wow was it crispy. It's so hard to fry vegetables well, and this was crispy. The corn was the last item we received and it was a nice way to end. It had shishito pepper, pecorino, basil and crispy fried shallots. <br><br>The Publican also has a nice wine, beer and cocktail menu. I ordered the veltliner, which is a white wine from Austria. It was good. <br><br>I really like The Publican with its communal tables and great food. If I lived nearby, I'd come here often for a great meal and an opportunity to meet my neighbors.", "pics": null}}, {"review": {"des": "Came here for the second time for a short weekend visit to Chicago. Since I had such a great time a couple years ago, I made sure to take my friends here to have them experience the same awesome time I had. We made reservations ahead of time on a Sunday, so there was no wait. Service is great as always. Servers and hosts were very friendly and accommodating. Since we had a group of 7, we decided to order as food items off the menu as we could to share. Their food is just so well-made, created and plated. Flavors and textures are all on point. I had the bbq duck confit, and public bacon (which is the superstar small plate for everyone everytime). I also had a bite of the hashbrowns, veggie egg scramble, and belgian waffles. All were wonderful. No complaints. Will be back again for more great food and company. And that Bacon! Mmmm.", "pics": null}}, {"review": {"des": "On another recommendation we heard that this was the place to come for oysters, living in the Pacific Northwest raw oysters are one of the bases for our food pyramid so had to come and check them out.  Had a good selection and also they had a wonderful selection of local craft and imported beer. On Untappd I am close to 3000 unique beers and even I was able to find a few I had not tried yet.  Communal table seating so be aware of that, and the atmosphere is quite loud. but we were prepared for that and it didn't affect the taste of the food or beverages any, so all was well.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RP84nHY7MlrXNPTwTlr7lw/168s.jpg", "caption": "Dozen mixed oysters"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KxVfjkXgbK1S7K0z5uuGiA/168s.jpg", "caption": "Chicken liver patè"}]}}]}