{"name": "the-capital-grille-chicago-3", "reviews": [{"review": {"des": "We visited Chicago in October of this year and stayed at the EMC2 which is three doors down from The Capital Grille.   <br><br>We walked all morning and worked up quite the appetite so we decided to stop in and have lunch.  So glad we did.  We sat down exhausted and we were met with a wonderful waiter, unfortunately I can't remember his name.  He took our drink order right away and we had a very tasty Bloody Mary to split.   <br><br>We both started with soup as it was cold that morning.  I had the squash bisque and my wife had the lobster bisque.  Both were fantastic but I liked mine a bit better.  <br><br>We then had our entries of salmon salad and the lobster    The salmon was cooked perfectly and the salad was tasty as well.  My lobster roll was good but was really just lobster and lettuce on a roll.  There was nothing mixed with the lobster so a lot different than others lobster rolls I've had.   The lobster and roll was very good though, just a little different than expected.  <br><br>Overall our experience was very good and I'd definitely visits again when in Chicago", "pics": null}}, {"review": {"des": "What a phenomenal lunch at the Capital Grill!!!<br>My wife and I are visiting from Florida and we came in for lunch where we met Derreck our waiter. He is one of the best waiters I have ever met. He asked if we were on a time restraint since most of their clients work in the area. <br>Suggested great items for lunch including the lobster bisque which is a must have!!!<br>My wife had the salmon and i had the cheeseburger, both were incredible.<br>Just a five star experience all around.<br>Ask for Derreck of he is working!!!", "pics": null}}, {"review": {"des": "We went recently for the annual wine and wagyu event. As their website aptly describes it, 'Wagyu & Wine lounge event features the pairings of three highly rated wines created by the Antinori family--the oldest winemaking family in history--and three gourmet Wagyu burgers prepared by our Executive Chef. Select your burger. Select your wine. And experience history being made.' I can't speak to what, if any history was made but I will that you that this was a damn good burger and a really good glass of Vino, all for a measly $25. <br><br>This year the burger options are;<br><br>Caprese-Style Wagyu Burger <br>with Heirloom Tomato, 15-year Aged Balsamic and Fresh Mozzarella<br><br>Wagyu Cheeseburger <br>with Havarti and Aged Vermont White Cheddar<br><br>Caramelized Onion Wagyu Burger <br>with Grand Cru Gruyère and Shallot Aioli<br><br>While the wine options are;<br><br>Villa Antinori, Chianti Classico Riserva, Tuscany, 2013<br><br>Antica, Atlas Peak, Napa Valley, 2014<br><br> Col Solare, Columbia Valley, Washington, 2014", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HcZpbaGpgNJXOZfhXV0zRg/348s.jpg", "caption": "Wagyu & Wine is back!!"}]}}, {"review": {"des": "My new all time favorite restaurant! My boyfriend and I had a staycation downtown a few weeks ago, and we came here our first night for dinner. All I have to say is *heart eye drooling face emoji*. <br><br>When walking to the door, you can tell this is a classy place just by seeing the building. The building has a huge gold sign saying \"Capital Grille\" and then there are large lion statues sitting on both sides of the door. <br><br>When walking in, the restaurant decor is so elegant and classy. The hostess was very nice and so was the manager. We had reservations, and when I did my name they said, \"Ah yes, come this way Ms. Davis.\" Service is wonderful here and they treat you like royalty. They even pulled my chair back so I can sit down, and they would always say \"Ms. Davis or the Davis party.\" <br><br>The food melts in your mouth and of course the prices are high, but it's a top quality place, so it is expected. My boyfriend and I both ordered steaks, which melted in our mouths. We both ordered then with lobster tails, and I have never tasted lobster as fresh as I did here. The restaurant also gives complimentary bread when you sit down, and there are a few different kinds! We order the au gratin potatoes as our side  and I felt like God was sitting next to me; it was excellent.<br><br>I will DEFINITELY be back, no doubt about it. As we were leaving the restaurant, the manager said  thank you so much for coming and asked how everything was. You can tell he really cares about his customers and his restaurant. He even was fixing the revolving door to align it perfectly... haha eye for detail!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FVEu7crWYEz0I-IEtMKGXw/348s.jpg", "caption": "Beautiful building"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sl-V6Nyav3UN92UUXtbYyw/168s.jpg", "caption": "Beautiful restaurant even from the outside"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9UkDYtlM1dgoaZZe_w2jZw/168s.jpg", "caption": "Au gratin potatoes"}]}}, {"review": {"des": "I took a group of six to the capital grille for a work dinner and the service was phenomenal.  They worked us in without more than an hours notice and our server, Blaire, was a total delight.  She made us feel welcome and kept us all smiling throughout dinner.<br><br>We started with blue point oysters and shrimp cocktail which where excellent but the best is the steak.  I had the bone in filet Oscar style made with king crab.  I ordered it rare plus and it was cooked to perfection.  We had the lobster Mac, au gratin potatoes and the brussel sprouts for sides.  I strongly recommend the brussel sprouts, although be aware they are made with bacon.  <br><br>Overall it was a great experience. There are steak houses in Chicago that are trendier and more hip but for a classic throwback steakhouse they nailed it.<br><br>Chris", "pics": null}}, {"review": {"des": "I love this elegant steakhouse! It offers amazing cuisine with impeccable service in a gorgeous room. <br><br>As I walked through the door, I was greeted with such warm hospitality. The hostess smiled and welcomed me kindly. <br><br>The room is more elegant than you can imagine. With dark woods and sophisticated portraits, the room feels like a beautiful den. <br><br>The menu offers so much more than steak options. I enjoyed amazing salmon on one occasion and delicious scallops the next. The salads were bright and fresh. The desserts are top notch so save room for them. <br><br>Check out their wine list it offers a variety sure to please any wine lover. <br><br>There are a lot of steakhouses in Chicago - do yourself a favor and come straight to Capital Grille!", "pics": null}}, {"review": {"des": "So we have reservations here at 7:15 PM on a Saturday night. Reservations were made last year as we were in town for a tradeshow the NRA ie not guns. We arrive early and head to the bar. Their cocktail menu was nice I ordered the Mojito Uva. Had a splash of champagne I guess in place of the club soda but it was definitely less syrupy than most so I stuck with this choice for the evening. <br><br>We were lead to a nice booth in the center of this restaurant. This Capital Grille is slighly smaller than others I have been to in Miami, Ft. Lauderdale,Orlando,Seattle, and most definitely NYC who takes the prize for most beautiful location and lay out. So as you can see I love Capital Grille. They just do everything right so why take a chance when you want a great meal as well as experience. Hey they work hard for this praise. Take last night when we got to the bar our waiter was sweating profusely and his forehead was dripping. It wasn't until a couple drinks in I was getting hot as well. There was a table of 8 in the center of the restaurant that the ladies were fanning themselves with the menu. <br><br>So I get up and found the manager who quickly thought outside the box for a resolution. By the time I got back to the table the other table was thanking me. The manager who was beyond congenial gave me his card and comped our two appetizers. Nice touch and very much appreciated. My hats off to Robert Brito. <br><br>Now for the food start off with a bread basket where I pick out the lavosh cracker and spread the plated salted butter with it. Heavenly a meal in itself. For appetizers we share the garlic grilled shrimp and lobster and crab cake that came with the grilled corn. <br><br>For dinner always hard to decide as I love everything I get the scallops. The portion size is ginormous and came on a bed of whipped pototoes,mushrooms and asparagus. I took the remains back to my hotel always too good to waste. My dining companion had the same and my other friend the NY strip with gorgonzola cheese. They shared a nice bottle of red with it. Also ordered two sides the mac and cheese as well as the whipped potatoes. We all left with midnight snack bags. <br><br>Too full for dessert we left after paying the check. We were not rushed as most Chicago restaurants do even though there was a crowd waiting to get in.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Oo15ddaVsoCLVb9-mdHz2A/348s.jpg", "caption": "Mashed potatoes"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/U5C7KWOXBly-O_1NIme1dA/168s.jpg", "caption": "Mac n cheese"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-U4cTNVwipLwQqEcbhDHeQ/168s.jpg", "caption": "Strip steak gorgonzola"}]}}, {"review": {"des": "This place had a wonderful salad with field greens and heirloom tomatoes. We also enjoyed the lobster and crab cakes and had some wine. We were visiting Chicago and had gone to several places to try the cuisine during our visit so we were eating light but the food (Salmon) looked very good that we saw delivered to a neighboring table and I would love to return when I visit Chicago again and give that a try! The waitress was so nice and asked us where we were from and told us about some places to visit in Chicago which was very helpful.", "pics": null}}, {"review": {"des": "Everything I excepted and the service was amazing. Try the South African lobster tail! Enjoyed the complimentary hard copy picture taken by our server after dessert.", "pics": null}}, {"review": {"des": "I've never tried this place before so I was psyched when I realized I lived a 5 min walk away. I really enjoyed the service and food here. My husband and I went here for our weekly date night and were seated right away.<br><br>We spilt the sliced steak with fig, lobster Mac n cheese, and truffle fries. This was more than enough food for both us. Even though we spilt a steak, the portion was big enough that we both felt stuffed afterwards. The portions here are huge! <br><br>I enjoyed the famous lobster Mac n cheese, however I think it was a little bit bland. Maybe it needed some salt. The truffle fries are delicious. <br><br>I also really enjoyed their complimentary bread, which had chunks of apricot in it. So delicious. <br><br>Service was excellent as well.", "pics": null}}, {"review": {"des": "This was my first time eating at a steakhouse in Chicago, as I'm usually the type to go for more economical restaurants. The last time I went to a steakhouse was probably for junior year prom 8 years ago, so I don't have much to compare to. However, I was pleasantly surprised at the quality of the Capital Grille. <br><br>What I enjoyed a lot, actually, was the bread basket that came with the meal. It had a ton of variety and definitely satisfied my ever-present carb craving. For appetizers, our table of 4 ordered the crab cakes and fried calamari. The crab cakes get 5 stars -- very tender, fresh, went well with the sauce that came with them. The fried calamari gets maybe 3.5 stars. It was quite salty and the topping of pickled peppers didn't help. I still ate a lot of it, so I guess I can't dock it too much. Another person ordered a cup of the porcini mushroom bisque which was smooth, creamy, and flavorful. <br><br>For the main course, I shared the Dry Aged NY Strip au Poivre with Courvoisier Cream with another person, and we both found that to be perfectly filling for us. I will admit that I'm not entirely sure what constitutes a perfectly cooked steak, but my medium rare NY strip tasted really good. We got two sides to share -- the French beans with heirloom tomatoes and grilled asparagus with lemon mosto. These weren't the ones that the waitress recommended, but we felt like having some vegetables to go with our meal. Next time, I'd skip these. They were fine, but the portion sizes were quite small for being advertised as \"to share.\" The flavors also didn't blow me out of the water. Not worth the $11 each in my opinion.<br><br>I still say 4 stars overall because everything tasted pretty good. Just a few small criticisms with the pricing vs. portion size of the veggies, and the calamari being too salty. I'd stick with the steaks and seafood to get your full money's worth.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tjz8Tt668bIDnde9NDQzmQ/348s.jpg", "caption": "Grilled asparagus"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JBuiymuTSMX7bNsaygrUWw/168s.jpg", "caption": "NY strip au poivre with courvoisier cream, medium rare"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MxDkAUX05fc2g-ZlFoJODA/168s.jpg", "caption": "French beans with heirloom tomatoes"}]}}, {"review": {"des": "The Capital Grille -  4/5!<br><br>Food: 5/5 phenomenal!! <br><br>The 18oz Kona Dry Aged NY Strip is melt in your mouth perfection. I ordered it medium and requested no blood oozing out. The Shallot Butter over it was a perfect touch. I was literally in a food coma after eating about half of it. <br><br>New England clam chowder was also perfectly cooked with the perfect consistency of clams and potatoes.<br><br>The chocolate espresso cake was the perfect way to end my meal. It was rich, but not too rich that I couldn't finish it. There were two raspberries as a finishing touch.<br><br>Service: 3/5 mediocre! <br><br>I was very disappointed with how long it took for a sever to take our order and bring out our apps and entrees. Our reservation was at 7:45PM and we left the restaurant at 10:30PM. I remember constantly wondering where our sever disappeared to the entire time. We had saved our appetites for this big meal so waiting was even more painful! <br><br>Atmosphere: 3/5 - OK<br><br>It was a nice classy restaurant. Towards the end I felt like I smelled vomit and held a napkin to my nose as I ate my dessert. Not sure why it smelled funky and nobody had seemed to acknowledge it except my party.", "pics": null}}, {"review": {"des": "I highly recommend you visit this amazing place if you are looking for a special dining experience for a special occasion. Great menu going far beond steaks, large portions so you can share with the other people you are dining with. The service is great and excellent cocktails with a good wine list!", "pics": null}}, {"review": {"des": "I came here to celebrate my Birthday and the experience was amazing. The host asked me what the occasion was and she accommodated me in such a wonderful manner. Decorations on the table, free champagne and a birthday dessert.<br><br>Me and my partner had the ribeye and the cast iron shrimp. Everything was delicious! This is a perfect date night spot and well worth the ticket.", "pics": null}}, {"review": {"des": "For Restaurant Week, this place seriously has the best deal. $33 gets you an appetizer, entree, side, and dessert. The 14-oz dry aged NY strip is normally $47 but this is included as an entree choice for RW, so you are definitely getting your money's worth. You have some extra $10 options to upgrade to the kona crusted option, or add on shrimp or lobster. It was such a good deal I ended up going twice in the same week because I'm working on my winter bod. Put it on your list for next year's RW!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2GkfS0EG5uqrJYmKUrEYKg/348s.jpg", "caption": "Creme brûlée"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/86d7gEdf9JWg5MW_TxSI9g/168s.jpg", "caption": "Caesar Salad"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iM65BaIBtMEqavaYb0on4Q/168s.jpg", "caption": "14oz NY strip, medium rare"}]}}, {"review": {"des": "Another great meal at Capital Grille, Chicago. The food was as expected, if not better. The service was spot on, if you can request a server, ask for Dave he is the best. Always attentive, great knowledge of the menu and just what you need to make this a 5* event. Get there while the 'Generous Pour' is available. <br><br>Oysters, Porterhouse and Asparagus. Along with fantastic wines and impeccable service. <br><br>Capital Grille - Chicago --. 5*", "pics": null}}, {"review": {"des": "Celebrated our 9 year anniversary here since the husband wanted \"manly food\", & I couldn't say no to a steak from Capital Grille! We were greeted with 2 glasses of champagne, and proceeded to order the Kona crusted and porterhouse steak. While we waited for our order, we were greeted with the calamari appetizer. Everything was ridiculously so good. We finished with créeme brûlée desserts , and our sweet waiter lina brought us another complimentary dessert with \"Happy Anniversary\" on it. It couldn't have been a happier evening.", "pics": null}}, {"review": {"des": "This was my first restaurant week experience with my husband and it was easily one of the best deals out there. I ordered the filet mignon and my husband had a NY strip steak and we each ordered one of the two side options: green beans and mashed potatoes. Both of our steaks were cooked to perfection, but didn't really have any special flavor. We've both had better steak elsewhere, but they were still good. For desert we got the creme brûlée and it was delicious! It almost tasted like a marshmallow, which is a bit different than traditional creme brûlée, but was still very good. Our service was awesome and our food came our pretty quickly! Not sure if we'd come back as we have other favorite steakhouses, but we'll definitely be back next restaurant week!", "pics": null}}, {"review": {"des": "ATMOSPHERE: (3/5)<br>- Very old school steak house. <br>- random pictures of old men on the walls. <br>- made a reservation for 7:45pm, waited until 8pm to get seated. Not bad. <br><br>Food: restaurant week!! <br>1a.  Caesar salad with grana padano croutons - solid Caesar. Nothing crazy about it. <br>1b. New England clam chowder - again, nothing crazy to it. Very solid.<br><br>2a. Filet with jumbo shrimp  (4/5)<br>- the filet would cut like butter. So tender and it melts in your mouth.  <br>-Shrimp wasn't as flavorful as it looked. Kind of cold actually.  <br>-Hint: skip the extra $10 and get the regular filet with no surf<br><br>2b. 18 oz bone in Kona crusted dry aged NY strip (5/5)<br>- wow, so flavorful and perfect medium rare. <br>- The juices would start spilling as soon as your knife cut. <br>- The obvious highlight and worth the extra $10.  <br><br>3a. Chocolate expresso cake (4/5)<br>- super rich and thick. Chocolate heaven <br><br>3b. Creme brulee (5/5) <br>- light, fluffy, and perfect with the tart fruit pairing. <br><br>Overall:  solid steak house experience.  The 18 oz NY and creme brulee made it worth it in my eyes.", "pics": null}}, {"review": {"des": "I didn't have a great experience at TCG, but that had nothing to do with the wait staff. <br><br>I booked a reservation through open table on a Sunday night (which wasn't necessary, the place only had 8-12 other patrons so it was essentially empty.)<br><br>The restaurant is nicely decorated. They have portraits of the men who helped build/found the city of Chicago which I thought was cool. There's a TCG in New York, but I've never been so maybe all the chains have a decoration theme?<br> <br>I ordered the special for that night was was a steak medium-well with asparagus wrapped in bacon (I'm sure they named it something much more fancy sounding.) When my food arrived the steak was WELL DONE on one end and RARE on the other. I was so confused I could only laugh. I didn't even know it was possible to cook a steak in so many different states in one go. <br><br>I took a few bites (of the section that was medium well) and couldn't stomach the rest. Overall the steak also didn't have much flavor and I wasn't impressed. My waitress noticed and offer to get me another dish, but I just wasn't interested since I was only in the mood for steak and didn't trust the kitchen with another go. <br><br>My waitress was SO nice. I felt bad that I didn't like any of the food I got and she was so nice about it. I wasn't charged for meal, and I did enjoy the ambiance which is why I gave it 2 stars instead of 1 star.", "pics": null}}, {"review": {"des": "Besides the amazing food, this review is really focused on private dining. Throughout the years, I have had many private dinners ranging from 8-12 guests. The service from beginning (planning/contracts) to the end, is always spot on. They do such a great job with private dining and honestly, I find the prices reasonable for the quality of food and service. Will definitely return!!", "pics": null}}, {"review": {"des": "Great experience at this venue. The food was excellent. The location convenient. The service was top notch. I must give a shot out to Zak Benson, the manager. I am a big fan of this place for years to come. Small gestures to the customers pay off in big ways!", "pics": null}}, {"review": {"des": "This place has it all, class, stellar service & great food. Let's begin with the level of service here:<br><br>My mom asked for a diet Pepsi which they don't have. The waiter proceeded to walk to a nearby convenient store just to accommodate her!<br><br>Food:<br>Gorgonzola & Black Truffle Wagyu Burger<br>This is 1 of 3 burgers in the city (Au Cheval & R.P.M steak are the others) that will satisfy my complicated & hard to please taste buds. Each time I've had it the flavors have been consistent.  An amazing amalgam of flavors. The cheese is the perfect contrast to the beef! Comes with your choice of side & I of course opted for truffle fries because you can never have enough truffle...<br><br>The lobster roll is served with chilled lobster meat & I prefer warm however it was still delicious. <br><br>This is a white tablecloth establishment & it's never noisy although there's always several power lunches going on.k", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BhAFaZDrCR6Yrg5LyT6YTA/348s.jpg", "caption": "Waiter walked to a nearby convenient store to accommodate my mom's fav soda"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/U7B1CQnsfd0WzkkzYtwqcQ/168s.jpg", "caption": "Gorgonzola & Black truffle Wagyu Burger"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CdtPChvuqZrCIZqFamIBTA/168s.jpg", "caption": "Lobster roll"}]}}, {"review": {"des": "Date of Visit: 11/8/16<br><br>Had a fantastic dinner in the Wine Room, the center-most private dining room surrounded on three sides by the wine cellar. We had seemingly 80% of the menu, favorites being the Grand Plateau (Jumbo Lump Crab, North Atlantic Lobster, Shrimp Cocktail, Oysters) and Porcini-Rubbed Ribeye. <br><br>Super fresh seafood, solid classic cocktails, consistently top-notch service, and they sure do know how to cook a steak.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TmfuXfvfZuMjZzAghQmB-g/348s.jpg", "caption": "Porcini-Rubbed Bone-In Ribeye with 15-year Balsamic"}]}}, {"review": {"des": "The atmosphere at night was very warm and romantic. If you want a nice date or want to impress a wine enthusiast take them here.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kHH52DWX5Qjg56KGjl6l9A/348s.jpg", "caption": "Happy birthday! Lenae"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ik8PKNZRhsQA42lEKbkl5g/168s.jpg", "caption": "The beautiful wine cellar"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qLIt0KRmjviHGO1fjNyktw/168s.jpg", "caption": "The Calamari was delightful and light with the fresh cut lemon and white chardonnay wine"}]}}, {"review": {"des": "This is my first visit to a Capital Grille and I have no complaints about it at all!<br>I came for lunch so the menu was not the most complete one they have but still had a good variety.<br>I've had the Lobster Mac n Cheese which, despite the fact that it is a dinner's menu item, was specially prepared for me! It tasted A-MAZING! Super creamy and filling! My friend had a salad with steak and said everything was cooked to perfection. No drinks or dessert for us on that visit. But would totally come back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DJne2KNQ1Qsoi6xLMquYXw/168s.jpg", "caption": "Lobster Mac n Cheese"}]}}, {"review": {"des": "I had a nice time at the bar tonight.<br>The bartender was awesome.  Busy Sat night and he was great.<br>Watched the Cubs game and met another solo traveler for some conversation.<br>Service was awesome.  Wine was good.  I ordered wild mushrooms.  Unfortunately, they were not wild and they were not seasoned well.  Just sautéed in oil.  Very oily no seasoning.  They were button mushrooms.  Would have passed had I known that's what I'd get.<br><br>Overall ambience and service was well worth the trip!", "pics": null}}, {"review": {"des": "A old-fashioned steakhouse. No fancy plating or innovative dishes you see in Michelin starred restaurant, but it is fancy in old-fashioned way. Very classic. Delicious salad, soup, and steaks.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ceeK3Qi5heGPimmygeb2yw/348s.jpg", "caption": "Clam chowder"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/E7YN4TPr_lmT0eMSnCdSIA/168s.jpg", "caption": "Caesar salad"}]}}, {"review": {"des": "Just right $22 Restaurant Week lunch menu.<br><br>NEW ENGLAND CLAM CHOWDER was a okay.  DRY AGED SIRLOIN was a okay.  Fresh MOZZARELLA bits made the too bitter and too much ARUGULA SALAD taste better.  Delicious perfect CREME BRÛLÉE is contrasted by super chocolaty FLOURLESS CHOCOLATE ESPRESSO CAKE in a perfect itty bitty portion.<br><br>SERVICE is pleasant. Inconsistent Coat Check.<br><br>VENUE is slowly suffering from neglect.  Contradiction.  Personalized wine bins vs Jergens Lotion in women's bathroom.  You will fall off from that wobbly toilet seat. Styrofoam brown bag...steakhouse became a diner?", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QbigDMw72SrC47xmwxCQQg/348s.jpg", "caption": "$22 pp 2017 Restaurant Week Lunch"}]}}, {"review": {"des": "I came here with my bf for restaurant week, and man were we impressed! We were seated immediately, and our waters were filled and bread was brought out almost as soon as we were seated. We ordered our food all at once: I chose the wedge salad with blue cheese dressing and bacon, and he chose the clam chowder soup for the first course. My salad was literally a wedge of lettuce, bacon, and dressing so it did leave a bit more to be desired. He devoured his soup. We both got the 8oz filet mignon medium, and while mine came out perfectly cooked his was very well done. Without us even saying anything, our server came over saying that he was unsure if the meat was cooked medium, and that he would have a new one made. The new filet mignon was cooked excellently, and he even brought out another serving of mashed potatoes along with it. Now halfway through the steak both of us were starting to get a little worried with how much food we still had, but we pushed through to dessert. We had one of each of the desserts, the creme brulee and the espresso chocolate cake. The creme brulee was cold, and seemed as if they had stored it in a fridge and just pulled it out given the crazy number of people coming for restaurant week. It was still good however. The espresso cake was delicious, and seemed like a fudge cake more than a sponge cake. <br>overall we were SO impressed with the service here, and we will definitely be back.", "pics": null}}, {"review": {"des": "To. Die. For.<br>If you ever find yourself choosing your final meal this is the place to order from!<br><br>If you're ever stuck in the hospital and they say you have to have one meal blended into a smoothie so you can eat it through a straw. This is STILL the place to order from.<br><br>In all seriousness we went during a weekend trip to Chicago, a city I LOVE and one my fiancé had never been to. Chicago is such a foodie town it was hard to decide which places to take him but this was suggested by a few people so we made reservations. <br><br>We decided to forgo drinks because we needed some recovery time from the previous night but I did see a lot of people had ordered their house specialty the stoli doli so it must be good.<br><br>We both ordered one of the specials which was the surf and turf option of a filet and lobster tail. Mine had the Kona rub with shallot sauce and his was cooked cowboy style which meant it had a dry rub, onion strings and horseradish. Both were delicious but we both agreed mine was better. The rub on his steak made it a bit too salty but trust me it was still delicious! We shared the lobster Mac and cheese and it did NOT disappoint. I am not a big M&C person but there are only a few items I would push a baby stroller over to get to and this has been added to the list right next to the coveted spot held by Thin Mints. <br><br>Sadly we skipped dessert bc we were STUFFED but a lot of people on here race about the chocolate cake and cheesecake so I am sure you can't go wrong.<br><br>Equally as important as the food is the service. Annette was our server and she was phenomenal and had great suggestions!!! At pricey places I expect the staff to be very knowledgeable about the meat and distinctions and she knew everything!!<br><br>Oh a cool feature in this place is the wine lockers and as you stare at them imagine what you would label your locker. Mine would be House of Tanzer. <br><br>The only reason I am not giving 5 stars is that the serving jackets thy have the staff wear are hanky! They look like jackets for IHOP staff or Dennys and I just expected something a bit more fitting to the level of the restaurant. <br><br>Last but not least it was the weekend before Valentines so everyone got a rose at the end of the meal and that was sweet! <br><br>Definitely try this place out but be sure to make reservations in advance!", "pics": null}}, {"review": {"des": "I don't usually go to steakhouses, but when I do I choose places like Capital Grille. We went there for restaurant week. And I am beyond happy with my experience! Our server was very professional and knowledgeable. He helped us to choose bottle of wine. Since it was restaurant week we made our minds about food before we got there. I started with delicious Wedge with blue cheese and smoked bacon; and my man had a New England clam chowder. I ordered Filet Mignon which was cooked to perfection! And he had a bone-in Ribeye. Brandon loves his steak rear (I'm medium kinda girl) and he was very happy with his steak! <br>For the side we got Sam's mashed potato and French beans with heirloom tomatoes.  For desert: my favorite Classic cream brûlée and his favorite Warm double chocolate cake <br>It was great and delish experience!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zSFGU1Yv6bmgzKxmR3ZrBg/168s.jpg", "caption": "Bone-In Ribeye*"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/adrzScJraycY5Xw3-3WGsg/168s.jpg", "caption": "Filet Mignon and Bone-In Ribeye*"}]}}, {"review": {"des": "Immediately want to give a shout out to Lara. <br><br>She was welcoming, charming and insightful about steak! <br><br>The experience began at the front desk when they knew to congratulate us on our anniversary! It truly felt like more than a meal, it was an experience. (Hokey Factor: 100) But it's true!  <br><br>It was pricey.<br><br>No regrets.<br><br>Delicious.<br>I had the surf-and-turf.  I wish I had ordered it twice!", "pics": null}}, {"review": {"des": "Solid spot, atmosphere were very nice and upscale feel. I'm a huge martini with blue cheese olive guy and they were hand stuffed and the martini was good. Would recommend the the tuna tar tar ap.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CYb_-5fESaqs52qN05IFXw/348s.jpg", "caption": "Creme brûlée cheese cake. V tasty"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oJsMoeadd9mm_DHZNXulmA/168s.jpg", "caption": "Tuna Tartare* (best thing we had)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gKjgGRLCgDIz7_UNmRGyiA/168s.jpg", "caption": "T Bone"}]}}, {"review": {"des": "I came here for restaurant week 2018. After doing an extensive research of places that are worth the money, we decided on this place. When we arrived, we were seated right away. We were seated in the back room which was nice and quiet. We ordered the steak and beef tenderloin. Out of those two, the beef tenderloin hit it out of the park. There was a nice kick to it which was unexpected. Everything was so amazing and flavorful. For $33, this was such a steal. I wish they had this deal all the time. I can't wait for restaurant week next year!", "pics": null}}, {"review": {"des": "I went for Restaurant week for dinner.  And $33 for the amount and quality of food you get is a great deal!  I ordered the lobster bisque which is an upgrade of $5.  I thought it tasted good, but would have liked more lobster.  I tried the clam chowder and wished I ordered that instead.  For my entree, I ordered the t-bone and for dessert I ordered the creme brulee.  <br><br>The service was great, but I could tell they were busier than usual just due to restaurant week.  But, take a look at the regular menu prices.  You're definitely getting a steal for the amount of food you're getting during restaurant week.", "pics": null}}, {"review": {"des": "I tried to find a good steak house in Chicago for a while. Found nice reviews about this spot and would like to try it with my husband on a Friday night. Since I got a new job offer on that morning, it became a wonderful celebration night.<br><br>We enjoyed our oyster, it was very fresh. The calamari was full of favor. The medium-rare rib eye and New York strip were juicy and tasty.<br><br>Our server was outstanding!! The wine he recommended was so good and we finished a whole bottle during the dinner.<br><br>It's a lovely Friday night and will absolutely come back!", "pics": null}}, {"review": {"des": "Went for lunch again today and it was fantastic. I had french onion soup (the best I've had in Chicago; better than from other french restaurants I've ordered it from). Ordered a new item on the menu, Burrata salad. It was phenomenal. It was burrata over arugula pesto, mixed greens dressed with lemon vinaigrette, a prosciutto wafer and glazed pear. My entree was grilled jumbo shrimp over a delicious couscous broth. And as always, the service was 1st class. <br><br>I wish they would return decadently delicious Chocolate Hazelnut cake to the menu.", "pics": null}}, {"review": {"des": "Went for restaurant week, dinner $33 per person, and you get to choose a starter, entrée with a side, and dessert. <br><br>First: What. A. Deal.<br>For $33, we got so stuffed. The bread was fresh and the variety made it interesting: just enough of each kind but enough different kinds that you didn't get tired of eating the same bread (we're kind of bread enthusiasts). <br><br>We started with clam chowder (pretty rich, but also pretty standard), then got salmon & the 14 oz. steak. They offered a $10 add-on for a lobster tail and we took it....what we didn't process from our waiter was that it's 2-3 oz. lobster tail and that is tiny....tl;dr don't get the add-on lobster tail but that was our mistake because the waiter definitely made that disclaimer.<br><br>Salmon was juicy and so soft, and ohmygosh the size. It isn't those places that give you a plate twice the size of your face but you could eat the food in one bite. This salmon took time to conquer. Same with the steak, that was a LOT of meat. Green peas (side) were ok, mashed potato was pretty good. <br><br>Desserts: the chocolate espresso flourless cake...texture is more like a mousse and dang it is rich (read: bitter). The taste was pretty overwhelming since it was toward the end of our meal and we had gotten really full at that point, and we ended up not finishing it.<br>The crème brûlée on the other hand, was really delicious. It was borderline too sweet, but compared to the chocolate cake it was much easier to go down. We found ourselves wanting more, even though the serving wasn't small! <br><br>Overall, really great deal for restaurant week! Might even consider coming back for its normal menu.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FUXhX8lj0pmofmmR-avhzQ/348s.jpg", "caption": "Salmon (really good portions!)   Sides: Green peas and mashed potato in the back"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ilEFvZ-14IXUtrp6Fw037Q/168s.jpg", "caption": "Creme brûlée"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xOgp6mxeh_eLUoLs4dpBwg/168s.jpg", "caption": "Clam chowder (not huge but decent size)"}]}}, {"review": {"des": "What I like about The Capital Grille is it knows it's target market to a letter. & I'm doing that provides the exact experience their patrons have grown to love. Service was exceptional. Edgar & Melissa were definitely on their game & it showed. The food was pretty good, but the service alongside it made dinner at The Capital Grille a great decision.", "pics": null}}, {"review": {"des": "Love this location...centrally  located, lots of windows and impeccable service. Never disappointed with food, wine or the professional service.", "pics": null}}, {"review": {"des": "Absolutely outstanding dining experience that exceeded our expectations. From the maître d', to our server and bussers, we had a wonderful evening enjoying the atmosphere and cuisine at The Capital Grille. Our steaks were cooked to perfection and our ice was never left dry. Since I was celebrating my birthday, our server brought out some decadent desserts to enjoy. We were extremely surprised and delighted. The Capital Grille is one of the best dining experiences ever had in Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EsxWxsRXRXGdW7XhGThzBg/168s.jpg", "caption": "Surprised and delighted."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xBNGD5NfuC6mUz1-dFEihQ/168s.jpg", "caption": "2018 Chicago Restaurant Week Menu"}]}}, {"review": {"des": "Booked here on OpenTable to have lunch during Restaurant Week so that my friend and I could catch up after not having seen each other for a long time.  We love Capital Grille and looked forward to eating at the Chicago location. <br><br>She had mentioned in the booking it was my birthday.  To our surprise, they very elegantly decorated our table and gave me a hand written card.  Throughout the entire meal, the team could not have been nicer or more accommodating.  Our server Diego was outstanding but most of all, genuine.  Just a genuine nice guy.  At the end of the meal, they took a picture of us, printed it, and gave it to us as a gift!<br><br>It was such a pleasure to have lunch here, all of the extra little touches made it so special, and all around it was the best afternoon I have had in a while all thanks to Diego and Capital Grille.  Thank you again!", "pics": null}}, {"review": {"des": "This is a decent restaurant. I will strongly recommend the filet mignon,surf and turf. Our server is Rich, he is nice, friendly and well-knowledge. We have nice experience in the restaurant.", "pics": null}}, {"review": {"des": "Decided to try this place out for restaurant week.  The atmosphere is reallly warm and welcoming. The service was also great. I started out with a wedge salad with blue cheese and bacon. Absolutely great. For the entree I got a filet mignon with lobster and mashed potatoes. My lord, the steak was so juicy and so great you don't even need sauce. The potatoes were rich and creamy and the lobster was cooked perfectly. For dessert I got the espresso cake and it was rich and great as well. I definitely recommend this place to anyone, it's worth the trip (even if it's not restaurant week).", "pics": null}}, {"review": {"des": "We went here for our anniversary and loved it! The waitress was great and several of the staff stopped by our table to wish us a happy anniversary which was so sweet. The food was amazing as well. Five stars!", "pics": null}}, {"review": {"des": "I went here for the first time during Chicago Restaurant Week. The three course tasting menu was more than enough for the two of us. The salmon was cooked perfectly (light and fresh), and the accompaniments of mashed potatoes and french green beans with heirloom tomatoes were fantastic. I had an excellent old fashioned too. My favorite part of the meal was the Crème brûlée though. I'd come back here for some bubbly and more of that any day! I was happy to try somewhere new during CRW. We had GREAT service, and I will definitely be back.", "pics": null}}, {"review": {"des": "Its one of our go to places when we visit Chicago...birthdays...anniversaries and New Years Eve...always amazing service and food... its a little loud but its all good!!!!", "pics": null}}, {"review": {"des": "There's this common wisdom when it comes to restaurants that, no matter the quality of the food or ambiance, you're supposed to like an independent location over a chain. Well, you can label me a fool, because Capital Grille rocks. <br><br>I'd been before, but this most recent time we came in for Restaurant Week -- Choose Chicago referred me after a quick 'Best Restaurant Week Deal' google search. The deal was great, and the food was even better than I expected -- I expect high-end restaurants lower their standards when the hoi polloi come in. Not so here.<br><br>All of the food was great -- the wedge, 8 oz filet, salmon and dessert. The service was good, our waiter Dave was awesome and super friendly. I would gladly return, restaurant week or not.", "pics": null}}, {"review": {"des": "This is a long overdue review, but maybe it's because I always dream of this restaurant every time I crave good ambiance and food. As a Yelper, I'm a bit ashamed to say that I didn't take advantage of this year's past Restaurant Week. However, my fiancee did manage to snag reservations at The Capital Grille with everyone at her workplace raving about what a great deal it was. <br><br>We dressed fancy that night because in addition to Restaurant Week, it was also one year engagement anniversary. We were greeted by the friendly staff and I managed to tell them that we were celebrating an anniversary. Quite reflexively, the staff directed us to hang our coats. Afterwards, we were brought to our table and lo and behold, there were heart shaped confetti and a signed card by all the workers in the restaurant. What a great start!<br><br>Literally a few minutes after being seated, we were being handed menus and a bread basket while getting our waters filled. Quite attentive. Our hostess was trying to sell a few special items on the Restaurant Week menu such as the unlisted Surf and Turf and a Steak Diane but we did our research ahead of time and preemptively decided on the 14 oz dry aged NY steak and the additional $10 of 18 oz dry aged steak with Kona rub (to compare). She did manage to have us try a different side and dessert. <br><br>My fiancee had a great view of the steaks being made and we enjoyed watching them prepare food as we ate through our blue cheese wedge salad with bacon (part of the three-course prix fixe menu for Restaurant Week). The only minor comment here is that I noticed that the table next to us were offered freshly ground black pepper and we weren't. <br><br>Not much longer, our delicious steaks were presented before us. To be honest though, I couldn't taste too much difference between the Kona rub and my the regular dry aged steak. My fiancee did say that the Kona rub was a bit sweeter with the caramelization and the regular steak had the distinctive, juicy steak flavor. Both were really delicious and the perfect medium rare. And we were really blown away by the buttery mashed potatoes! It was the perfect side to the steaks. If we hadn't gotten the green bean side, we would have probably said the same about the green beans as it was nicely crisp with a buttery finish. We finished everything.<br><br>Dessert came with a coffee chocolate cake and a creme bruleed cheesecake. They went out of there way to put lit candles on our desserts so we could make a wish to celebrate. The coffee chocolate cake was slightly bitter to balance the sweetness. The cheesecake on the other hand was slightly sweeter with berries. In the middle of dessert, our hostess brought us complimentary champagne on the house to celebrate. <br><br>Overall, they were really great to us! Definitely come here to celebrate and prepare to be treated like royalty. Be sure to mention that you're celebrating a special occasion and wine and dine like kings and queens.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Eo5yTQG09bDDbVkv6CAUng/348s.jpg", "caption": "Coffee chocolate cake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3qSaPUqEFZB3lxeUhvzFhA/168s.jpg", "caption": "Creme brule cheesecake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Y4vjdiWWF1-irMSQriOc4w/168s.jpg", "caption": "Sides of mashed potatoes and green beans"}]}}, {"review": {"des": "Omg the most amazing steak ever! It just melts in your moth the lobster Mac n cheese was amazing the mash potatoes are home made and the asparagus still had some crunch to it! At the end we took home the cheesecake brûlée and that was the best finisher. Def the best steak", "pics": null}}, {"review": {"des": "The service through the food was A+! Our waiter was Diego. So courteous and so prompt, and also so off handed when he walked by and knew we did not need or want him. He was just perfect as a waiter. Please ask for him when you go! He will make you feel not only cared for, but also, not intruded upon.<br><br>We waited a bit of time before ordering our appetizer and meal and he came at just the right times. He also offered just the right amount of banter. He is good at what he does. <br><br>The food........it was amazing. <br><br>The other wait staff were impeccable. <br><br>I have honestly never had such a great fine dining experience before. <br><br>We both had a New Zealand Sauvignon Blanc. We also started with the Tuna Tartar. She had the Lobster Roll ( which was FULL of fresh cooked lobster) and I had the Wagyu burger with wild mushrooms and 15 year aged balsalmic...both with truffle fries. Amazing. <br><br>Best dining experience of my life.", "pics": null}}, {"review": {"des": "It was our twins' 18th birthday as well as Thanksgiving. Our daughter has a serious peanut allergy. Chef Patrick made a phenomenal Flourless Chocolate Cake that was to die for!!! Our daughter can never have dessert in restaurants.....so this was an incredible treat that was truly appreciated !!!<br>Our waiter Wade was so accommodating and we loved our dinner!!! The most delicious turkey dinner.....(not counting Mom's)!", "pics": null}}, {"review": {"des": "Amazing experience tonight.  Have come before and the food is always phenomenal.  But today's experience was enhanced by our server Rich Dorgan.  REQUEST TO BE SEATED AT ONE OF HIS TABLES.", "pics": null}}, {"review": {"des": "Came here for restaurant week.  Best value steakhouse menu in the city.  Great filet and great salmon. I would go with the flourless cake for dessert.<br><br>Tip: if you come as a party of two, specifically ask NOT to get sat in the wine room.  That area feels like you're eating in a hallway and you're 12 inches from the neighboring tables.", "pics": null}}, {"review": {"des": "Amazing!! I'm vegetarian and my husband absolutely loves a good stake. We sat at the bar and were both very happy with food, service, and accommodation. People who work there go beyond to please you and make you happy. We enjoyed our evening very much, thank you!!", "pics": null}}, {"review": {"des": "Perfect for Valentine's Day. Our server Valerie was very friendly and helpful. The food was amazing. The lobster Mac n cheese was amazing. Everything was perfect!", "pics": null}}, {"review": {"des": "If you are looking for an old school traditional steakhouse this place is a good spot in the area without having to get a cab or Uber to one of the more well know establishments. The decor is very much traditionally inspired with wood brass and numerous oils, even in the restrooms. Service is good and the food is nice. Not being a beef eater, I always go for the lamb and the double cut rack of lamb was cooked exactly as I like it. The sides are nice and shareable portion sizes. Best think about this place for me is that it also is very accommodating for walks ins, even on a Friday night, if seats are available.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nWwgd7rnqXcaJfZMbIlXrA/168s.jpg", "caption": "Double cut rack of lamb"}]}}, {"review": {"des": "Personally, I've had better steak but for the price and location, it is great! The steak was cooked perfectly, medium rare and seasoned well.<br><br>My boyfriend and I were visiting from New York and decided to have a date night (dress up, go out, etc). Capital Grille was just a block away from our hotel so we walked there and was immediately seated. It was relatively empty (it was also a Tuesday night).  The waiter, oh the waiter, how I wish I could get that service everywhere! You must ask for Diego; he is just phenomenal.  We were unsure of which wine to get so he allowed us to taste two to decide. Later on in the night he came over and took our picture, which was later printed (and by later I mean 2 mins) and handed to us.  It was so sweet - He really made us enjoy our time at Capital Grille.", "pics": null}}, {"review": {"des": "Capital Grille has punctuated many milestones in my life. We keep coming back to CG for not only its impeccable and reliably delish (!) steaks, but their consistently excellent service. Each time, our servers were so friendly, knowledgeable about wine pairings, and really made me feel the special-ness of the occasion we were celebrating!<br><br>I keep coming back for the kona-rubbed ribeye, porterhouse steak, and miso glazed halibut! I'm getting so hungry just thinking about them! Mmm...<br><br>One thing I love about CG is also its location. It's tucked away on St Clair street, which is dramatically more peaceful and quiet compared to Michigan Ave., which is the next street over. <br><br>5 stars for quality of service and consistency in great food! Will come back for more!", "pics": null}}, {"review": {"des": "There were three of us for lunch yesterday at Capital Grille Chicago. Everything was absolutely perfect. The moment we entered the door from the greeting to the goodbye, service was excellent and the food was beyond perfectly excellent. Greeter was pleasantly friendly, accommodating my wheelchair and the wait staff was on point anticipating our every need.<br><br> We ordered the 20 entrees, one signature hamburger and two mini tenderloin sliders entrees (one with a very tasty salad and one with a very good bowl of clam chowder).  The tenderloin was seasoned to perfection, cooked to medium rare picture perfection and the chew was like cutting through butter. The hamburger, large, seasoned very well and perhaps just some of the best meat in Chicago. Frites are wonderful and plentiful. I highly recommend this luncheon experience and can't wait to go back for my birthday dinner or maybe a few times before. Atmosphere for romantic dinner, business lunch, family celebration and the nostalgic feeling of my old beloved Chicago.", "pics": null}}, {"review": {"des": "Sat at the bar for dinner after struggling to pick a place for dinner. Was in town for a conference and decided to stay an extra night. <br><br>The bar tender provided some of the best service I've had in a while. Plus his drinks were fantastic. <br><br>Decided to order steak au poivre (channeling my inner archer lol) it was perfectly cooked and delicious. Exactly what you'd expect from a steakhouse of this caliber. <br><br>As a side ordered the lobster mac. Also the bread was seriously good! Would totally consider coming back the next time in town.", "pics": null}}, {"review": {"des": "The customer service here is exceptional and food was delicious as well! I will definitely be going back and recommend everyone try it out.", "pics": null}}, {"review": {"des": "What can I say, but perfectly cooked steak with all the trimmings.  This is aged steak that you can cut with a fork. The perfect lobster bisque and wonderful service.  I would recommend this to anyone.  I'm from Texas and we pride ourselves on beef and this is no slouch.  The service was friendly and checked on all our needs making recommendations that were spot on.", "pics": null}}, {"review": {"des": "Had a 14 ounce new York Strip cooked to my liking med no char mashed potatoes an a glass of wine food was great service 5 star. Great lunch", "pics": null}}, {"review": {"des": "We had a very unpleasant experience. Checked in, waited for 30 min ( which is fine, they are busy). Asked about our table - manager rolled his eye ( literally) and told us that  we have only been there for 5 min.  Food was good, onion soup is exceptional. When check came it had a change for bohemian salad , which we never ordered. The funniest thing - there is no such item on the menu!!! It's totally a bogus charge which you easily overlook after few drinks. Unbelievable, I am sure it was on purpose- waiter was not even surprised.", "pics": null}}, {"review": {"des": "The atmosphere is phenomenal.  Beautiful, beautiful building.  Had lunch today and while some aspects of the meal were good, we felt others were not worth repeating.  Both the lobster bisque and porcini mushroom bisque were excellent.  The mini-tenderloin sandwiches were very good.  Truffle fries really didn't do too much for my husband.  The roasted chicken was overcooked and not tender at all as I had expected.  It was accompanied by mushroom risotto which was I felt was undercooked.  Coconut sorbet was good while the cheesecake was too heavy.  I think we will give the Grille another chance .... will just try other options on their menu which are wide and varied.   Very good waitstaff.  Pleasant and capable.", "pics": null}}, {"review": {"des": "This particular branch is right by my work so I come here a lot for lunch and dinner since it's so convenient, but also because it's amazing. I don't typically order steak at restaurants because I can make a pretty mean steak myself but I will order the ribeye here from time to time because it's just that good. My most commonly ordered items here are the lobster roll for lunch and the lobster/crab cake for dinner. Both are delicious for a very reasonable price. You get a ton of fresh lobster in a toasted brioche. They don't put much dressing on it and it's just a bunch of lobster meat. The same can be said for their lobster/crab cake. There's very little filler and just made with big chunks of crab and lobster meat. You can't go wrong with any of the 3 items I mentioned above, I would not hesitate to stake my reputation on it.", "pics": null}}, {"review": {"des": "Porcini rubbed rib eye steak with 15 year aged balsamic is superb. Mashed potato and mushroom sides are perfect.  Waiter is friendly and professional. They lack the last star from me because  of the host front unorganization. They called my friend for the table being ready and I walked in 1 min after. They already gave our table to someone else and had us wait 10 mins. That's the only gripe I have with them.  Food is magnificent.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/52XRVssiF1le2QsCXCYh8Q/348s.jpg", "caption": "Porcini rubbed rib eye with 15 year aged balsamic"}]}}, {"review": {"des": "Definitely an older crowd here but the ambiance is still fabulous! You won be at the french onion soup. Everything is just fabulous! Don't skip the desert! One of the best I've had.", "pics": null}}, {"review": {"des": "My boyfriend took me here on my birthday and it was one of the best dining experiences we've had. They seated us right away and wished me a happy birthday and gave me a card and complimentary ice cream for dessert. The filet you could probably cut with a spoon because it was so juicy and like butter in my mouth. The lobster mac and cheese was another favorite and the calamari was flavorful and had a little spicy kick to it, different than any other I've ever had.", "pics": null}}, {"review": {"des": "The Capital Grille<br>Fine Dining Restaurant · 2/3/18<br><br> Went there for restaurant week on January 28, it was so good we are returning with friends February 7", "pics": null}}, {"review": {"des": "My boyfriend and I went here to celebrate my birthday. I called a few hours before to reserve a table just incase (it was a Monday so I probably didn't need to, but if you go on other days, you should definitely set a reservation.<br><br>We went here specifically for the lobster Mac and cheese. It's my favorite. Others try to imitate but they never get it as good as it is here. As expected, it was delicious. There was a little less lobster meat in it than we normally get, but it could have just been the luck of the spoon (or lack of luck). <br><br>The dinner bread/butter they bring out was delicious. My favorite is the brown bread. I don't know what it's called but it's so damn good. The big patty of butter they bring out has a light rock salt garnish and it comes out at room temp so you aren't ripping the bread, because the butter is too hard/cold. Big kudos on the room temp butter. We also both got a glass of wine.<br><br>Our server was very nice (I wish I could remember her name). She was knowledgeable about their wine list and was attentive to our needs. I asked for her to take our pic and she happily obliged. <br><br>Even though we were what was probably her smallest check of the night, she treated us as we were her biggest check. Also, when you tell them it's a birthday celebration, they leave out a happy birthday card and put HB confetti on the table, which is super nice. <br><br>I've had full steak dinners at Capital (not this location) before so even though my review is only on an appetizer, I'm confident you can go here for an all out spread and enjoy yourself as much as we did during our visit.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Rj2TJYkRA8QzmdsmsR48Vg/168s.jpg", "caption": "Lobster Mac and cheese!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cJnp7AKMQ9wCQ4HTzS2oBA/168s.jpg", "caption": "Happy birthday confetti!"}]}}, {"review": {"des": "After treating a few employees to the Capital Grille during lunch for Administrative Professionals Day, we had to bear witness of one of their employees/contracted workers attempting to assault a FedEx delivery person outside the establishment. <br><br>The assailant/employee parked his vehicle right on the bumper of the FedEx delivery vehicle to try and fit within the no parking /loading zone section alongside the restaurant. The actions of the Capital Grille employee is what put matters into motion. <br><br>You can see by the condition of this vehicle it is clearly not valet parked by the restaurant but simply belongs to the short Hispanic male employee (wearing black) who uses a fake parking valet sign through Premium Parking in an attempt to take advantage of the street parking.<br><br>It is unfortunate that the actions of this individual had to be witnessed in public. I doubt our firm's staff will be visiting this establishment anytime soon.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nyShumyiMrdeOObhkFPrnw/348s.jpg", "caption": "Assailant."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_O-stYtkCXvS1Glb9iv83A/168s.jpg", "caption": "Vehicle involved."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fZwuTrcgjn8oNXp4W5sZxA/168s.jpg", "caption": "Vehicle involved."}]}}, {"review": {"des": "One of the best restaurant week menus in the city.  For 33 dollars you get a great steak, salad, side, and desert.  The service is incredible.  You easily save 15-30 a person with this deal.  Not to mention the food is spectacular.  So worth it on any day due to the outstanding service and food but a must for restaurant week!", "pics": null}}, {"review": {"des": "Great service, really good steak, salad and deserts for restaurant week. Even received additional sweets for my friends birthday. Only issue the 2 person tables are too close together, it was a tight fit.", "pics": null}}, {"review": {"des": "Their lobster Mac and cheese is a must try. I had the Delmonico. It was good, but nothing I craved again. Quiet atmosphere. Good for dates.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lBcECJx2kqnodp0FFEjKlg/348s.jpg", "caption": "Delmonico"}]}}, {"review": {"des": "I have never been to the one in Miami but I happened to pick this place while visiting Chicago for fine dining before heading back home. Restaurant presentation and decor are upscale and our booth was so comfortable! Ordered the lobster Mac and cheese to share, there were crumbles mixed into it that were delicious and the pieces of lobster were plentiful and quite good. Had the tenderloin medium rare with twin lobster tails in a butter sauce. TO. DIE. FOR. The server was knowledgable at the menu, very well dressed and courteous. He made the service personalized to the right amount. This place really went beyond my expectations.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pLTYD5aJ674zyj_QGi-Fug/168s.jpg", "caption": "Foam cake with graham cracker crust with a sweet glaze and berries. Dark chocolate brownie with whip and raspberries."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/y7fkDuCPdRswsGaGXggjkg/168s.jpg", "caption": "Tenderloin cooked medium rare with twin lobster tails served over butter sauce; ABSOLUTELY INCREDIBLE."}]}}, {"review": {"des": "The steak is awesome!! Capital Grille is the classic Chicago steakhouse experience. Good food, good atmosphere and great service. Manager Robert Britto does a great job. I highly recommend this place!", "pics": null}}, {"review": {"des": "On a recent trip to Chicago, I met up with a friend on a Saturday night.  We decided to walk into the Capital Grille and for dinner since it was a short walk from my hotel.  <br><br>As usual the service was excellent.  As for the food, the filet was top notch medium rare, the tuna steak seared rare to perfection, the calamari appetizer was served hot with the right amount of crispiness, and the Caesar salad was covered in just the right amount of dressing.<br><br>When I travel, I often ask myself why I go back to  a chain like the Capital Grille.  The season is simple, you know what you are going to get and that is superior quality food, top notch service, and you won't leave hungry or thirsty.  Great job Capital Grille Chicago!!", "pics": null}}, {"review": {"des": "Last year my wife and I dined at Ruth Chris's steakhouse for our 5th anniversary.  At the time I remember thinking \"it does not get better than this.\"<br><br>I was wrong.<br><br>Last night my wife and I were downtown to enjoy our 6th wedding anniversary.  We were tempted to dine at places such as Michael Jordans Steakhouse, and Volare, among others.  Instead, we chose The Capital Grille down Saint Clair.  <br><br>Folks-If I have been to a better restaurant, it sure as hell escapes me as I am writing this. <br><br>The food, the pricing, THE STAFF (a very special thank you to our sever Ralph who could not have been nicer or more attentive-please seek him out when you go there), and the ambiance-all of it made for quite a magical mix at The Capital Grille (TCG) last night.<br><br>The portions here are quite decent, the steak (I had a beef tenderloin) is phenomenally juicy, it has THE BEST potatoes au gratin I have ever had, a succulent brule-style cheesecake, mouth-watering lobster tails, and a quite interestingly prepared and delicious steak tare-tare.  <br><br>Front desk was so sweet and KNOWLEDGEABLE (seek out one of my prior reviews to a different restaurant-getting an educated front desk is no slam dunk), and the overall attentiveness for our anniversary (including a signed card by all the staff and a scrumptious mini dessert platter) was almost too much (I stress... \"almost.\"  Haha).<br><br>What was so amazing about it was that we had roughly the same style choices we had last year at Ruth Chris, but the bill was shockingly lower here at TCG, and not by a couple pennies.   Had the bill been the same as Ruth Chris I would have understood (and it would have been worth it).   This bill at TCG was roughly 25% less expensive than Ruth Chris.  Truly amazing.<br><br>I could go on and on about The Capital Grille in Chicago, but, instead, I urge you to please head down there and give this place a try for yourselves.  But once you do... do not blame me if you want to keep coming back on a daily basis.  <br><br>My hats off to TCG team.  You guys made our anniversary extra special, and truly excelled in all realms of execution.  As the 5 star rating on here suggests, The Capital Grille is surely \"as good as it gets!\"", "pics": null}}, {"review": {"des": "I gave TCG another go after not having a good experience at this location. I've had amazing experiences at the Boston and San Francisco locations so I really want to like this one. This time around it was better but still not up to par.<br><br>I sat at the bar for dinner. I was greeted by the bartender and given the menus. I asked to sample a wine and the bartender was happy to give me one. I was surprised I wasn't given or offered water. After about ten minutes I realized that and got the bartender's attention and he knew what I wanted without me saying it. <br><br>The bartender was training someone so when the usual dinner setup came, the trainee laid serviette very jaggedly and the fork was upside down - I knit-pick since it is the Capital Grille.<br><br>I got the bone-in ribeye which was perfectly cooked and seasoned but I've had better cuts at restaurants like STK, Gibson's, and Carmichael's where the bone comes out of the middle part of the end and doesn't take up one side of the steak.<br><br>On a high note, the potato leek soup was delicious and velvety and would order over and over.", "pics": null}}, {"review": {"des": "It was about a year and a half ago and delicious. It is pricey, everything ala cart; had valet parking; stellar service; they  hand sweep any crumbs off your table between courses. Food is hot and tasty- salad delicious  It has old school charm; rich wood and comfortable booths- reminds me of the classy joints in movies  in the days days of prohibition-  Two people - cocktails - all sides- full courses over $200.", "pics": null}}, {"review": {"des": "Restaurant Week 2016 was a great time to visit this place. A steak dinner for $33 in my opinion is unbeatable. we started off with an amazing selection of breads and fresh butter. I ordered the Hemingway daiquiri, which was so refreshing with a kick!<br>I started with the clam chowder, and right off the bat, I could taste the freshness of the clam and how well it tasted with all the right flavors. My bf had the wedge salad that looked great!<br>For the main course, I opted for the 8oz filet mignon with green beans and tomatoes, and my bf got the 14oz ny strip. We had the regular menu as well so I saw the prices for both and it ranged from $45-48! I mean now you got me questioning paying full price for steaks! <br>Either way, our food was great! I loved my perfect medium rare filet, and melt in the mouth buttery taste. Definitely preferred that over the NY Strip (which was undoubtedly good as well). Green beans were amazing with a hint of lemon and ginger, and mashed potatoes were not bad either!<br>For the desert, we tasted both flour-less espresso cake and cheesecake, and man were they good! <br>I deifnitely enjoyed my time here!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yx8SV9mhpYg3rNzi80f5Pw/348s.jpg", "caption": "Flourless espresso choclate cake and cheesecake!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cPqLM3lmX7unp7Gz6k64mQ/168s.jpg", "caption": "Hemingway Daiquiri"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Uo1-DOeLTcYN0Ddr_4qDrw/168s.jpg", "caption": "14oz. NY Strip"}]}}, {"review": {"des": "This was a very classy restaurant. When I first walked in I actually thought I was underdressed, so I sat at the bar. The whole staff was so nice and accommodating, I felt very welcomed. The bartender was very quick with the service. I ordered the side of the lobster Mac and cheese (huge portions, with large chunks of lobster meat) and also a tomato basil salad, which doesn't look like much when you first see it but it was delicious and filling. They also offer bread and butter before your meal, which is always a nice touch. I will say that the mac and cheese was very filling and I don't know how to describe the cheese except to say that it tastes like \"Cheez-its\". Personally I don't like the sharp cheddar taste, but I still ate it because it was that good! This was a very good experience overall, I would definitely recommend.", "pics": null}}, {"review": {"des": "It was good. The service is what gives this place four stars.  They overcooked my steak which I was surprised about. I sat at the bar as is my usual. Not the best steak I've had though.", "pics": null}}, {"review": {"des": "Capital Grille is as good as it gets! We go in every city we travel to. The food is amazing but the service is what makes the experience truly special. No where are you treated like royalty like at a Capital Grille. Downtown Chicago Capital Grille with Rich D. as your server means you will leave happy, full, and feeling like a million bucks.", "pics": null}}, {"review": {"des": "I cannot say enough great things about The Capital Grille! <br><br>My husband made a reservation online for our 10 year anniversary. He had taken his mom to the Rosemont location for her birthday a few years ago and said we would go there sometime because the food was outstanding. When you make a reservation, it asks if the visit is for a special occasion. He selected Anniversary. When we arrived, the front desk greeted us and asked if we were there for a special occasion. We said yes, our anniversary. They both said congratulations and happy anniversary. Then we were shown to our table. It was a corner booth near the kitchen. The booth was decorated with heart confetti and a card was sitting on the table for us! The card said Happy Anniversary and was signed by the staff! Our waitress, Valerie Delfin (ask for her, she's FANTASTIC! I will forever ask for her to be our waitress!) came over and wished us a Happy Anniversary, as well as every employee that walked past our table. She went over the menu and brought out the drink menu. They will select a wine or cocktail to best suit your meal if you ask. <br><br>We both ordered the 10 oz filet. I know I'm committing a terrible crime, but I ordered mine well done. It was not burnt, chewy, or overcooked. It was amazing! Definitely the best steak I've ever had. We ordered the Soy Glazed Brussels Sprouts with Bacon and the Potatoes Au Gratin. WOW! The potatoes were very rich, but delicious. The brussels sprouts were, again, the best I've ever had.<br><br>After dinner, Valerie brought out the dessert menu. We told her there was no way we could do dessert and she told us to look it over anyway. Then she comes back with a tray of desserts, ON THE HOUSE! She tricked us! The tray said, in chocolate, Happy Anniversary. It came with a mini cheesecake and a dark chocolate brownie, and fresh fruit. Just when we were talking about how amazing they were and how much they went above and beyond the level of customer service, Valerie comes out with 2 glasses of champagne as well! <br><br>The service was OUTSTANDING. The food was OUTSTANDING. I know that we will go out of our way to go to the Chicago location for our future special occasions. I've never experienced so much love and appreciation at a restaurant. Thank you Capital Grille for making our special weekend even more special!!", "pics": null}}, {"review": {"des": "Fantastic service defines the Capital Grille!  For several years, I have planned to give this place a try.  It offers one of the best, if not the best, Restaurant Week menu for a steakhouse.  Excellent options are available.<br><br>Connie was a breathe of fresh air as a server.  She explained the menu, even the secret menu options.  In fact, the entire staff seemed to be onboard to make customers feel welcome and appreciated.  I would love to return. <br><br>The classic decor stands out with high ceilings and wood paneling.  <br><br>The food was great.  The signature Kona crusted sirloin was cooked perfectly and tasted great!  Honestly, the side dishes were just that, a nice side show.  I enjoyed them, but wanted to focus all of my attention on the main attraction Kona crusted sirloin.  The wild mushrooms, however, were some of the best of Chi steakhouses. <br><br>Look, Capital Grille is not the best steakhouse in town.  It is, however, one of the better ones and a top notch restaurant for overall dining.  <br><br>I love the fact that your server will have the valet get your car and bring your keys to you. That is full service.<br><br>Thank you for a great dining experience!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/l1fYD34A3TBygT5TMFVIRA/348s.jpg", "caption": "Dry aged sirloin (Kona is better)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_pZyHKzuJvwZIWX9tvfDmQ/168s.jpg", "caption": "Flourless chocolate cake -- AKA \"The you must love chocolate, chocolate cake, or else\"."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/H7JfBGX3vK0iG8zXEgU1ag/168s.jpg", "caption": "Kona crusted dry aged sirloin...perfect steak!"}]}}, {"review": {"des": "Celebrated my birthday last night.  Made reservations and was seated promptly.  Loved the decor inside.  Our server Jesse was spectacular.  We started with calamari which was amazingly delicious!  Oysters were huge and fresh from Connecticut.  My husband ordered the ribeye porcini steak and I had the bouillabaisse.  I enjoyed his steak better than my bouillabaisse because I had better!  It is a steak place after all, so next time I order bouillabaisse, I'll be sure to order it at a French restaurant.  As a sweet treat they gave us dessert for free with a lit candle to make a wish on<br>I believe that the service really made our night!  Thank you for making my birthday special.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9enbjkZkz6MjKFmDAQKsaA/168s.jpg", "caption": "Must have calamari!"}]}}, {"review": {"des": "Highly disappointed. <br><br>I visited the Capital Grille during restaurant week after hearing one of my girl friends rave about the food. I was hoping to have a new favorite steak house. <br><br>There was a slight wait for our 9 pm reservation due to the restaurant week crowd. We decided to grab a drink at the bar. About 10 minutes later our table was ready, and we requested for our drink bill to be transferred over to our table. Our waiter was prompt, yet refused to write down our order.We both ordered from the prefix menu with an add of the lobster mac and cheese. Prior to the waiter's departure he repeated our selections and forgot the mac and cheese. I reminded him. <br><br>When the food came there was no lobster mac and cheese. We reminded the waiter AGAIN.The flavor of the food we did have was very tasty, yet it is expected for the original price point of the restaurant. Nothing stood out. The mac and cheese came about 15 minutes later WITH NO LOBSTER. We were starving and realized neither one of us had had a piece of lobster until half way into the meal. When we stopped the server he looked as if he did not believe us, and said he would take it off of the bill. Another dish with lobster was never brought to us. <br><br>When our bill came, our drinks were not included. We asked our server to add them to the bill and he seemed very relieved we were honest and brought a revised check. <br><br>I will not be back to this location due to service alone. Del Frisco's was a better experience.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yjR-DcxdYfe6hPZ1VX7j8Q/168s.jpg", "caption": "No lobster to be found in our \"lobster\" mac and cheese :("}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_Hkg-t4ADg2IOs2Fp9ZAzg/168s.jpg", "caption": "Great Table View!"}]}}, {"review": {"des": "It was fantastic and a beautiful place. We had dinner there. I like the decor and waiter/waitress there were all very polite.", "pics": null}}, {"review": {"des": "Capital Grille took me by surprise when they were listed on the 2015 Chicago Restaurant Week for $33 per person with a three-course menu that included steak. The deal was too good to be missed.<br><br>My first course was a bowl of hearty clam chowder with a slight hint of black pepper. It was rich and creamy, making it especially desirable for the cold weather. For the second course, I chose the 8 ounce filet mignon over the other two steak choices because I prefer a smaller portion with more natural flavors even as irresistible as shallot butter is. The steak was perfectly done at medium rare. My only complaint was the meat being slightly rough on the edges. And finally, I ended my meal with a sweet and classic creme brulee. It was standard and much more tolerable than my friend's sugar-stacked, flourless chocolate espresso cake. <br><br>A line was formed as we were leaving at 9pm. You may take that as a hint at how solid they are.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qcNu6fGYUk4I7FZdZrMHJg/348s.jpg", "caption": "2015 Chicago restaurant week, third course: creme brulee"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UU4G1BH4dV0PlyijiqGZJA/168s.jpg", "caption": "2015 Chicago restaurant week, second course: 8 ounce filet mignon, medium rare"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rDvU_aQMZi9MswJ47XddGg/168s.jpg", "caption": "2015 Chicago restaurant week, first course: clam chowder"}]}}, {"review": {"des": "Yes, this is a chain restaurant; but I'm still giving this location of The Capital Grille 4 stars.<br><br>Living so close to this Capital Grille I've been here numerous times and always enjoyed my dining experience (lunch and dinner). The service you receive here is always stellar and the food is always delicious and filling.<br><br>My last time dining here was last night for a friend's birthday and again the dining experience was first rate. When we were seated at the table there was a birthday card waiting for him that was signed by all wait staff (nice touch). For starters we had a cup of French Onion Soup which was standard, but still good. Our selection for our entrees was the 14oz Top Sirloin with the Lobster Mac & Cheese and Oscar Style Roasted Potatoes.<br>* The 14oz sirloin was cooked to perfection, flavorful and filling (I bought about 7oz home - ha dirty).<br>* The Lobster Mac & Cheese was good, but I would have liked more lobster in the dish.<br>* The Oscar Style Roasted Potatoes was something I haven't seen at our restaurants. The crab meat was plentiful and made me a happy man. The roasted potatoes were good, but the asparagus could have been cut a little thinner. <br><br>At the end of the meal our server Aaron M, who provided amazing service to us, brought out a celebration platter which consisted of a mini flourless chocolate espresso cake and mini cheesecake. Both desserts received two thumbs up from the birthday boy and from me because they were free!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/K-kZ7W9F7oFipOnG6erFYg/348s.jpg", "caption": "14oz Sirloin"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UX7Ju3ra86H1-m7USK89zA/168s.jpg", "caption": "Oscar Style Roasted Potatoes"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GPWJKebwLmJoCVUf8Ua8gQ/168s.jpg", "caption": "Lobster Mac & Cheese"}]}}, {"review": {"des": "Everything is just top notch here! If you're looking for a classic steakhouse experience, don't look anywhere else.... this is your place!<br><br>-The atmosphere screams typical steakhouse in a good way. <br>-The service is pretty incredible. <br>-And the steak... omigosh the steak. And let's not forget the sides either. I've had the NY strip and the filet, both great choices. Sides in the past have included the lobster mac and cheese, mashed potatoes, creamed spinach, and the green beans. All are top notch! <br>-Prices are reasonable for a steakhouse. If you're lucky enough to eat here during Restaurant week, it is by far a steal of a deal!", "pics": null}}, {"review": {"des": "Food was good. I enjoyed myself took a friend for their birthday.  I Had ribeye which was very good not excellent. Lobster mac and cheese I really didnt Care for at all and I love me some lobster mac. Sauteed Spinach was good. Lamb chops were excellent.  For birthdays they have a champagne toast for everyone complimentary.  Although food was good I probably wont fo back unless someone had a party or something there. Del frisco's in my opinion is still the winner so far.", "pics": null}}, {"review": {"des": "I got food poisoning from the meal I had from this restaurant for the whole night and morning (vomiting and diarrhea). My last meal was at their restaurant. Inspite that, we were rushed out at 10:45, although they close at 11, we havent even finished up our meals. Because of this I forgot an important item in their place as I was the last person who left the restaurant, yet they did not bother for checking the Item after kicking us out.  I assumed the place is sophisticated and worth the money I spent that night. However, it turned out the exact opposite. I would definitely put a bad review at this restaurant for the bad customer service as I am extremely disappointed.", "pics": null}}, {"review": {"des": "Easily one of my favorites in Chicago... If you're looking for legit steak, look no further! I've been here on more than one occasion, but I have to give some props to the waiter we've had on multiple occasions, Mr. Scott Johnston! If you have Scott as your waiter, you're in for a treat for the night! Super knowledgable & friendly dude! He's definitely been around for some time and can point you in the right direction for whatever it is you're looking for. <br><br>The service has always been nothing short of spectacular and the food amazing! I recommend the lobster mac n cheese, delmonico, & the kona crusted dry age steak! The kona crusted dry age seems to be the most popular and on their menu year round, so definitely a solid option!<br><br>On a final note, if you're celebrating anything special, DON'T BE SHY. They take care of you whether it's a birthday, anniversary, graduation, or any sort of special day! Til next time, cheers!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OC7NdqrtH3nZCO9wZrtB4A/348s.jpg", "caption": "Delmonico & lobsta mac n' cheese in da back!"}]}}, {"review": {"des": "This evening, I celebrated a birthday dinner at Capital Grille with two friends. We had a fantastic time and a wonderful server, Diego. He made our time there smooth sailing! He was very kind and attentive.<br><br>The food was delicious. We all had lobster tails that were flown in from South Africa. The lobster melted in your mouth! Delicious!! The lobster Mac and cheese was very good. The spinach salad works the bacon dressing was very tasty, too. A fine time was had by all!", "pics": null}}, {"review": {"des": "Overall:<br><br>- Prix fix menu for business lunch<br>- Solid salmon salad <br>- Attentive waiter<br>- Amazing looking desserts<br><br>---<br><br>Business lunches are uncomfortable. Everyone sits unnaturally straight and are very mindful of cutting their foods into extra small portions to make sure it can fit on a single stab of the fork. One is usually scared to move. On this particular rainy Tuesday, I was uncomfortably crammed into a booth when the business people I was eating with decided to combine tables. <br><br>So, other than that, the food and service was pretty awesome. Our waiter lightened up the serious atmosphere by inputting a few jokes. Maybe even he was able to feel the pressure that was thick enough to be cut by a knife. <br><br>I ordered greens and more greens. The salads were dressed decently and the salmon was solid, though a little overcooked. The prix fix also came with sides of green beans and mashed potatoes, both of which complemented the main course well. The fare wasn't outstanding but it was good enough for me to want to come back for me. I hope to come next without having to pretend there's a stick up my a$$.", "pics": null}}]}