{"name": "the-gage-chicago", "reviews": [{"review": {"des": "I absolutely looooved this restaurant.  The atmosphere, our waiter, the food....everything was top-notch.<br><br>My sister and I had brunch. We ordered corn beef hash, crab cakes...and fried pickles on a suggestion. Our bottomless mimosas were a perfect match to wonderful meal. And, the fried pickles were a surprising delight. The portions are big so come hungry!<br><br>Highly recommend this place! If you want a cheap diner feel... this is not the place (not any restaurant on Michigan Avenue). Come for fried pickles, stay for the delicious food.", "pics": null}}, {"review": {"des": "The ambience is the best part here. There are very cute booths, tables next to the fireplace, and a really nice bar sitting area. <br>Food- was alright. Didn't blow my taste buds. <br>For appetizers we got the scotch egg, mussels and fried pickles. The scotch egg was good, mussels were pretty good. Fried pickles were very ordinary.<br>For entree we tried the Elk Ribs, I personally wasn't a fan, my friend enjoyed it. But I did not feel like it was worth the $56.<br>They do have a decent number of options for entrees.<br>Cocktails- I got the Wake me up which was a good mix of coffee and rum, liked it. My friend got his old fashioned and was content with it.<br>Service- our server did check on us a few times, service was good.<br>Overall a pretty good experience.", "pics": null}}, {"review": {"des": "Service was okay, if not a little patronizing. Clientele was on the older side, but I'm still in my 20s. I felt like the manner in which we were treated was a bit cloying and condescending. Still, it was okay. Food came quickly and our server checked back frequently. <br><br>The food was solid. It was pretty damn good. My taste buds weren't blown away, but I would return to try more! Everything we ate was delicious and I would give each dish at least a 4/5.", "pics": null}}, {"review": {"des": "Cool place. Food was good to very good, service friendly but slow, atmosphere lively. <br><br>Not a \"value choice\", but with the location across from Millennium Park and the Art Institute, plus around the corner from the Private Bank Theater and adjacent to Chicago Athletic Association/Cindy's Rooftop, it doesn't have to be...", "pics": null}}, {"review": {"des": "Honest review: (just ate burger) Service was alright typical crappy bar service <br><br>Gage venison burger $19 substitute truffle fries $4: it was alright honestly like nothing special. Burger was perfectly cooked however lacked seasoning. There werent fried jalapeños they were grilled so it needed a crunch was very mushy then there was grilled onions n grilled mushrooms like there was no wow factor was a regular burger loved the addition of gouda cheese though but burger was nothing special would give it a 2 out of 5 <br><br>Truffle fries $4: fries were crispy but lacked seasoning truffle aioli didnt have a lot of truffle flavor n it was the same portion of fries? So like i paid 4 bucks for mayonnaise:/", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/h5BXxWixq2W0gu6JOG9z4w/348s.jpg", "caption": "The front"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fIiRQk8HY8WjCqYmldfR5A/168s.jpg", "caption": "Coffee"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ziDq-uae-Oh0MPCwGIzblA/168s.jpg", "caption": "The Gage Venison Burger"}]}}, {"review": {"des": "This restaurant was very tasty. I'm in town for a conference this week and I met up with my boss to talk business, as he lives in the Chicago area and I live in the Detroit area.<br><br>He said that he has been to The Gage many times and all of the food is good. We split an order of the PBR battered fried pickles for an appetizer; I love fried pickles and these were very unique.<br><br>For my entree, I ordered the 8 oz filet mignon and a side of the Brussels sprouts. The filet mignon was good but could have been a little bit better; it had a nice char and a little too much pepper, although it was still tasty. I ordered the Bordelaise sauce for it which was also very good. The Brussels sprouts were also nice and charred, and came topped with some diced chili peppers. (too spicy for me)<br><br>I've been sick for a few weeks now, so instead of getting a cocktail, I ordered the gingerbread rooibos tea, which was very good and is served in its own teapot.<br><br>Waitservice and service in general here was excellent, as well. I would definitely return here upon my next visit to Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4c84kKKoBzAXKBdJ915V0Q/168s.jpg", "caption": "8 oz filet mignon with Bordelaise sauce"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-ryzTvLSIVhhMscEoKxwmA/168s.jpg", "caption": "Brussels sprouts"}]}}, {"review": {"des": "On a cold Wednesday evening, they had an incredibly packed guest list and we were lucky to get seats after a 20-30 minute wait. If you are a tourist like I was and wanted to go get dinner close by after, I recommend getting your reservation THEN visiting Millenium Park after because this place is busy for a reason. <br><br>My table ordered the Braised Pork Shank and Amish Roasted Chicken. All of us who ordered the Amish Roasted Chicken swapped the grits for mashed potatoes. Yum, the mashed potatoes were so smooth and the all food was well seasoned and flavorful.<br><br>Pros: Everything. Food was amazing, staff was super friendly and attentive. The bathroom was cute (haha, the tub sink was cool ok...)<br><br>Cons: Wait time might deter you from coming here if you have a big group. Make sure you set a reservation or expect to wait. Also, a bit pricier.", "pics": null}}, {"review": {"des": "Disclaimer: I do not like to pay a lot of money for okay quality food and overpriced drinks.<br><br>The atmosphere of this place is a little crazy. You can tell it is a lot of high rollers who go there with their other wealthy friends after a long day in banking or consulting. It tends to be very crowded as they have tables all over the place.<br><br>Our waiter was not the most attentive or patient with us. He was often rushing past us without checking to see how we were doing. Our waters did remain filled though which was nice.<br><br>The food was good, but nothing spectacular in any way. For the prices, I was going expecting more. My party had a few different appetizers including the calamari, a beef dish, and a blueberry cream cheese type dish, along with some oysters. I wasn't impressed by any of them. The calamari was my favorite out of them, but I have had significantly better.<br><br>My party had a variety of dishes. The one that I wish I would have ordered, but again was more expensive, was the pork shoulder I think. It was actually very flavorful. However, I ordered the venison burger. I am not sure what I was expecting, but after asking the waiter I was expecting it to be far more flavorful. Instead, it was pretty dry and tasteless. I should have ordered the regular burger.<br><br>In the end, probably will never be back here unless it's for a work event.", "pics": null}}, {"review": {"des": "We came here last night and it was phenomenal. It was a little pricier than expected but worth every penny. <br><br>The whole place has a dark and cozy atmosphere. If you are into a relaxing ambiance this is it. The front of the restaurant is more of a busy noisy bar while the back of the restaurant becomes a but not intimate and hushed. <br><br>They didn't have an extensive wine list but they seemed very selective about the ones they did carry. I liked this. Each one was specifically selected. I had the Shiraz. Not something I normally order but I told the waiter what I like and to bring me a glass of something that would please my tastebuds. He did good! <br><br>We started with the calamari. Not your typical calamari. It was sautéed and laid over whipped potato and surrounded by a moat of chili sauce. This was honestly the best calamari I have ever had. Fried calamari is over rated. This was delicious. <br><br>Next we shared the beet and burratta salad. How have these two never been paired before. This was AMAZING and I could quite possible eat it everyday if I had consistent access to good burratta. Yum! <br><br>For dinner I had the scallops. I really didn't care for the bed of sweet potato and lentils that came with. It added too much sweet to a dish I would rather have a bit salty. But the scallops were amazing and I ate every bite of those. <br><br>I honestly don't know how we passed up dessert. Everything sounded good and I really wanted to try the chocolate banana bread pudding... however... Chicago seems to be a late night city and I just couldn't hang past 11:30. <br><br>If you are in the city, you MUST try this place out. It was phenomenal and it will be the first place o go on my next visit.", "pics": null}}, {"review": {"des": "We decided to stop into the Gage for our first meal after arriving in Chicago.  We were looking for something good for lunch and definitely found it!<br><br>We were able to walk right in and get a table and place our order all pretty quickly.  We each got a cocktail and decided to start with the poutine (how could you not?).  It was a great take on a Canadian classic, mixing it up with cider braised pork shoulder and pork gravy.  We then ordered a couple sandwiches for our entrees, the spicy fried chicken and venison burger.  Both were cooked perfectly with a great mix of flavors that complimented each other very well.  Everything was so good we ended up finishing it all, even though it was a bit tough.<br><br>The ambiance of the restaurant is very interesting with a large bar upfront and plenty of room as you walk back further.  The staff was all very friendly and we had a great first meal of our trip!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/r9meH-sEJISAzkl4d5_WQA/348s.jpg", "caption": "Poutine"}]}}, {"review": {"des": "Nice gastropub right in downtown Chicago. Walking distance from the hotel I was at so the group I was with thought it to be a good choice. Order a variety of items, fried pickles, fried chicken sandwich, the cheeseburger, lox and bagels. The food was good, service attentive. I don't know if I would go back, but I did like it while I was there. The big plus is that it's right by the Bean and the waterfront so taking a walk there afterwards was nice.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NJmku57Jxw8jkB_lzg0XVA/168s.jpg", "caption": "Friend pickles."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3t15CUZYJLVdt2nwGldWDg/168s.jpg", "caption": "lol and bagels"}]}}, {"review": {"des": "If you want a great meal and exceptional service, the The Gage is for you!  We were quickly greeted and advised the bar is open seating.  We sat down and promptly were given menus and water.  The interior is clean and spacious <br><br>Our server came over quickly and we started with the  Scotch Egg.  It was brought over within five minutes and delicious!   Next we ordered our main meals: Spicy Chicken Sandwich and Poutine.  I also ordered a glass of bubbles.  <br><br>The servers, hostesses, greeters and bussers worked together well and picked up our appetizer plates and refilled water promptly.  Also, the hostess checked on us if we wanted to move seats to watch the football game.  <br><br>The sandwich was huge and the flavor combination was spot on.  The poutine was very cheesy and the gravy with pork was delicious.  I was so full that I asked for a box and our check.  The waiter and hostess both advised that the charred lemon peel I took out of my poutine (it was a part of the brine) wasn't supposed to be there so they were bringing us a dessert. <br><br>My husband loved the Brownie crunch bar and I even enjoyed it and I rarely eat desserts. This was an amazing and unexpected exceptional lunch and we've already picked out what we are ordering for our next visits.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BEgBJWe5JAoW6EUBj1tAHA/348s.jpg", "caption": "Spicy Chicken Sandwich"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/48tT0D-F-Mqg5NQqmmlx5g/168s.jpg", "caption": "Side view of spicy chicken sandwich"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZjrvX9vW54_gr9-S0CclQw/168s.jpg", "caption": "Scotch Egg"}]}}, {"review": {"des": "Located conveniently across Millenium Park, the Gage is a high recommended place for good food and ambiance. Surprisingly, on a Saturday night, we were seated right away. <br>The Gage is considered to be a gastropub and it actually exceeded my expectations. <br>They have an extensive drinks menu and a variety of food options as well, which are not cheap, but high-quality food. <br>Since I was craving a burger, I ended up getting the burger and fries and my friend ordered a steak.<br>Considering that our bill came up to almost $100, it's probably one of the most expensive burgers I've ever had, but it sure was delicious. The steak was juicy and tender and matched well with our wine selection.<br>Service was a little slow in my opinion, but considering it being a Saturday dinner, it was expected.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/m2eW9Jeaz0XQDpRtr3dvbQ/348s.jpg", "caption": "Fine burger and steak!"}]}}, {"review": {"des": "Came here on a whirlwind evening hanging out downtown. Everyone I interacted with was very helpful, friendly, and gave great recommendations. Truly great customer service!<br><br>I sat the bar and asked for something frothy with either brandy or whiskey at the base; after talking with the barkeep and basking in our mutual love of Sidecars, we landed on them making a Brandy Sour of sorts with cordial and egg white.<br><br>Good GOD the Scotch Egg is good. Beats out the eggs I've had at The Dead Rabbit and other speakeasies in Manhattan. It's that yummy, tho watch out cause it is $9.<br><br>For my main I could not ignore the craving and I ended up getting the fish and chips. Perfectly crispy and hot, totally hit the spot. Someday I will come back with my lady and get some of their fancier fare as well! But if you are in the vicinity of the Bean and Millennium Park, stop here for a drink... you won't be disappointed!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5lsmtkUyeJ8LdNhg-qoMDA/348s.jpg", "caption": "Brandy sour the barkeep made for me custom... hit the spot! Right on the money"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/62k6uWjwcaHhMTRFxQZp6w/168s.jpg", "caption": "Le menu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dFPP7zmptOk3fLI8qlhpgA/168s.jpg", "caption": "Fish and chips. Sometimes when it's right it's right"}]}}, {"review": {"des": "Overall my experience was okay!I had the fish and chips and it fine. The burger wasn't so good. It was supposed to be medium well, but it was kind of burned :(. <br>Also, I called in advance because I was so hungry and I needed to know if it was going to be a long wait! It wasn't.", "pics": null}}, {"review": {"des": "I stopped by with some friends for lunch on a Thursday - great spot if you're around Millennium Park/The Bean. As soon as we walked in, we noticed the vast majority of the customers were dressed up and looked like they were there for business meetings.<br><br>Before we were seated, we got a couple of drinks at the bar - we had the Livin's Easy cocktail, which was perfect and refreshing after we had been outside. When we were seated at the booth, we shared three dishes - crispy drumsticks, poutine, and the grilled peaches salad. The drumsticks were decent, the poutine was a bit soggy but flavorful, and the grilled peaches salad was very good and fresh. Since we all shared, it was a good variety of food and along with some more drinks, we had a good lunch. I would come back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/34W6JFi8nU7pabbO-1pgmA/348s.jpg", "caption": "When the Livin's Easy"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/61CrBncMpkkLZGw-zDSfTA/168s.jpg", "caption": "House Poutine"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Qu_8jTzUwfAnoqyfvERZ2g/168s.jpg", "caption": "Crispy Drumsticks"}]}}, {"review": {"des": "My experience with Gage happened after the Harvest Hop Down by Millennium Park. The four of us didn't want to walk far for a couple more drinks. We chose the Gage for the upscale and lively presence. We had a slight speed pump with the Host, but other than that- average experience.<br><br>We arrived around 9:00PM and could tell right that the place was crowded. Shoulder to shoulder by the bar and many people were eating in the dining area. Ordered our drinks by the bar, and had zero problems with wait time. We ordered two cocktails, a water, and a beer. Everyone was happy with their drink order. We asked the Host if we could reserve a table for some more drinks. She misunderstood us and sat us at a table for dining.  <br><br>While the food looked delicious, this brought confusion on our server. We didn't want her to lose out on tips, and were also asked to move to a cocktail table. We later found out that the tables with \"reserved signs\" were for drinking patrons only. This would have been nice to know, but it wasn't a deal breaker. <br><br>Besides this slight miscommunication, the drinks were great and the atmosphere added a boost to our Friday night. My experience was average- not good, not bad.", "pics": null}}, {"review": {"des": "The Gage seems to do everything perfectly and add their own little twist to ordinary meals which makes them spectacular. A simple bowl of soup can turn out to be a unique and wonderful surprise. The burger is a reliable treat.<br>It's my go to place when I visit The Art Institute, but it's worth a trip just for its own sake.<br>It's always crowded so plan ahead and get there early.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DwkCGQLlBAWhEbo_PkSbbw/168s.jpg", "caption": "Always mobbed here - for good reason."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VRMvmCEOI9qYx28usU_HNw/168s.jpg", "caption": "Bar during holidays."}]}}, {"review": {"des": "This is a highly rated restaurant and for good reason. An army of attentive staff. A limited, but unique menu. We chose deliciously prepared brussels sprouts and calamari. The elk burger was perfectly prepared. A very inviting high end ambience. The lively bar is in the front, with tight seating tables and booths in back. To die for peanut butter mousse with sea salted caramel ice cream. They currently are serving three slices of pie for a special seasonal dessert( pecan, pumpkin, an apple).", "pics": null}}, {"review": {"des": "This place has class. Well worth any wait. Staff is top notch. Out server seemed very happy and I would be willing to bet it's a reflection of trickle down effect. This happenstance experience was a blessing in disguise from a bad experience a few doors down and up high with a view. Can't wait to come back here.", "pics": null}}, {"review": {"des": "Second time I've been to Chicago and once again found myself at the Gage. Both times the service has been great as have the food and drinks. The fried chicken is a must have.", "pics": null}}, {"review": {"des": "What an amazing dinner last night with local Chi-town friends.<br><br>We had no idea where we were going - we found out when we walked in. Our friends picked the spot and even (very unexpectedly) paid for our dinners. I'm still trying to get over the guilt since I'm the one that's usually stealth with grabbing the check.<br><br>The Gage is an extremely well-run, bustling establishment, without 'tude. Our server was awesome - attentive without being annoying, funny and smart. Food presentation is lovely and the quality is terrific.<br><br>Two of us ordered specialty cocktails and they were delicious. Mine was a beautifully presented, interesting mix of whiskey, egg whites and a few other ingredients....it was almost too pretty to drink. (Almost).<br><br>To start, our table shared the cheese plate that included a mix of soft (blue and brie-like) cheeses served next to a harder cheese, a piece of honeycomb, a berry mustard spread/chutney, roasted/salted almonds and toasted, lightly oiled italian bread slices. The bread was refreshed without our asking for more.<br><br>I ordered the halibut and it was delicious - light, flaky and perfectly seasoned. Others at the table had the filet mignon, curry chicken and the pork chop. We shared the asparagus side dishes. Reviews on everything were very solid - the only thing that fell a little short was the curry.<br><br>For dessert, we shared the strawberry cheesecake and pineapple pecan carrot cake. Cheesecake was light and delicious; carrot cake was wonderful. Even the decaf coffee was good.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uRiLGvsl7_EIRW4ZxLPY8g/348s.jpg", "caption": "Pineapple & Walnut Carrot Cake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2oZkp2RooPzKDG3JLkcciA/168s.jpg", "caption": "Spring Strawberry Cheesecake"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zKtqOlMO9zVXQoZq9LYsEw/168s.jpg", "caption": "Asparagus"}]}}, {"review": {"des": "Nice place for brunch and outdoor seating! <br>Conveniently located on Michigan ave just across from the park with all the attractions.  Corm beef hash was surprisingly great. Server informed me that the recipe was passed down from the chef's grandmother. Thumbs up grandma!! Plate was perfectly seasoned and very satisfying.  Bloody Mary was a good choice to have on a hot late spring Saturday.  Fish & chips came in decent portion but, next time, I may just skip this and stick with standard brunch menu. Great service, nice people, easy location. Looking forward to returning again.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SWDx7sBnSEhSOLYmzf-HvA/348s.jpg", "caption": "Bloody Mary"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cOK5k8KezjzQVyKAIg0-vw/168s.jpg", "caption": "Fish & chips"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/x7ppBQk-nsE7s64p1uxH2A/168s.jpg", "caption": "Corn beef hash was out of this world!"}]}}, {"review": {"des": "The Gage was the perfect unexpected find that made our first meal in Chicago one that was truly memorable. After arriving on a late flight, traveling from the airport to our hotel and walking around aimlessly trying to find a restaurant open later in the evening 9pm? 10pm? We were so happy to have found The Gage within walking distance from  our hotel. We were quickly seated and offered an amazing selection of fine cocktails to choose from. I can't remember at the moment but I ordered something that was fruity with a nice smoky finish..whatever that drink was, it was amazing. <br><br>Our server was great. I feel horrible I can't remember his name but he was very knowledgeable about the menu. After consulting with him regarding our desire for veggies, something not too heavy, but will fill our tummies, he made a nice suggestion of ordering 2 veggies and a protein plate to share. <br><br>From memory, we had the green beans, which the BF devoured and loved. I believe there were cashews on there and some sauce that was to die for. We also shared the eggplant dish which I loved. the egg plant was sooo flavorful. Lastly, we share their braised roast chicken. The chicken was surprising very moist and complimented the veggies well. <br><br>The server even offered us an order of the wedge salad when we miscommunicated or desire to order the item, but the item didn't make our meal ticket. It was good--nice chunky pieces of bacon. <br><br>If you're near downtown and want a nice dinner with great cocktails this is your spot :)<br><br>So happy we found this place.", "pics": null}}, {"review": {"des": "I had read somewhere that this is Johnny Depp's favorite restaurant in Chicago a long time ago but wasn't able to verify my source- but I can see the potential of the statement. The ambiance inside is very nice and British, and the restaurant is excellently located across from Millennium Park. We came here for dinner after roaming around at a festival nearby. <br><br>My margarita was super sweet, but the poutine was delicious and hearty. The turmeric carrots were basically another form of fries. The burger was delicious and a good portion to split. The meat was nice juicy and flavorful.<br><br>Overall, this spot was a good dinner date spot, and I'm glad I finally tried it!", "pics": null}}, {"review": {"des": "YELP!!!  why so many of my reviews have been arbitrarily deleted...I swear i had a review of the gage before that is missing now.<br><br>My second time.<br>It is OK.  I will go back once more. I think for that part of town, a reasonable option.<br>Pastry chef, Kimberly is great.", "pics": null}}, {"review": {"des": "Came here after landing from the airport for a late lunch/early dinner. Tried the drink When the Livin's Easy which was so refreshing. I enjoyed the fish & chips, it was a huge portion which I had to share. My brother in law got the Venison burger which he liked and my husband got the smoked beef brisket sandwich. Loved the atmosphere, it deserves all the good reviews on Yelp.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1CxP24cdF7EjR-Uej6ecsw/348s.jpg", "caption": "Smoked Beef Brisket"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GwJ3-5lZbmdHmMTr6EVzkA/168s.jpg", "caption": "The Gage Venison Burger"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8EbzrYFn6NOtPiBdhanU8w/168s.jpg", "caption": "Today 's Fish & Chips"}]}}, {"review": {"des": "Five star all the way. Love everything about this place. Ambience is wonderful, food and drinks, if you want the wow factor. Just a great place to dine.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QJMdz0xOLWFZS5QJNlfrAA/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9Qugb3ygVw0xAufH5xQWTw/168s.jpg", "caption": "Bar"}]}}, {"review": {"des": "Came here once for lunch. Busy place (even though this place is pretty large too), and after I ate, I understood why. Great service, with even better food. Started out with the tuna tartare, which tasted fresh. Continued with the chicken sandwich, which had a crispy outside but an incredibly moist interior. Definitely check this place out if you have a chance.", "pics": null}}, {"review": {"des": "My first and only visit was a bit hurried for business reasons, but I would easily return and can recommend The Gage. Super crowded and loud, but it is popular and the location is in the heart of things. Great food and drink options, and the meal was great.<br><br>On my Uber ride over, my driver recommended asking for the GTO, a gin cocktail. It's not on the menu. It was excellent and you get the experience of a giant thyme sprig in your nose each time you take a sip. Good fun.", "pics": null}}, {"review": {"des": "Fast and delicious.<br>Atmosphere is definitely gastropub feel.<br>I had fish and chips, although the portion was a bit small it was delicious.<br>Would definitely come back and recommend to others.", "pics": null}}, {"review": {"des": "NomNomz: 4/5<br>Service: 5/5<br>Ambiance: Business-savvy, date-night worthy & upscale (but not too fancy)<br><br>Arrived in Chicago for a work trip, a much needed nice dinner out was in order. After my friend from college who lives there recommended The Gage, and then our hotel reaffirmed that as well, I knew we had to check this spot out. It's in a bustling location, directly across from Grant Park. We were staying at the Blackstone Hotel, so it was a 5 minute walk. Perfection! Check-in, then off to a yummy dinner! Let's do this.<br><br>First stop -- libations. And this place doesn't disappoint! The wine selection is phenomenal, I actually found a new favorite wine there (our waitress brought out the bottle for me, so I could sneak a photo!) Make sure to try one of their signature cocktails. My choice was \"When the Livin's Easy\" (vodka, fresh strawberries, basil, lime, soda) and was the perfect summer cocktail to get your evening started. <br><br>The dinner menu was priced exactly what I would expect for a pretty nice place in downtown Chicago, but nothing extreme. If you want to get the filet or lobster however, then I'd bring the platinum ;) The dinner menu was fabulous. Appetizers ranged from $9-$21 (oysters, bison tartare, house poutine). If you are really hungry, I highly recommend the caesar salad. Hands down one of the best caesars I've ever had. If you fancy yourself a caesar, definitely order one (FYI big enough to split for two).<br><br>There was a pretty decent sized assortment of entrees ranging from $15-$65. The filet mignon was looking FABULOUS, but I was craving something lighter so I went with the fish of the day, which happened to be a mouth-watering Mahi-Mahi ($MP). Someone else in our party had the halibut ($35) and it was also a hit. Looking at other tables, everything on this menu is recommended to be honest. All of our plates were fabulous, and pretty decent portions as well. You won't leave hungry, that's for sure.<br><br>Overall: This is a great spot for both a nice happy hour after work with coworkers/friends OR a nice dinner out. We did both, so that works too ;) I'll throw in a great date spot as well. The lights are dimmed a little lower, so it definitely has a bit of a \"sexy\" vibe. You get the whole \"speakeasy\" vibe for sure with the jade colors on the walls, and art-deco flare. Great experience overall. Will definitely go back next time I'm in the windy city!", "pics": null}}, {"review": {"des": "I am not a chicago native and with the vast culinary selection available in the city, it was hard to pick but I'm glad I chose this place! It was a great lunch option. I came here with a party of 6 and we tried a variety of yummy dishes. <br><br>We started with the fried pickles and crab avocado toast. They were fantastic! I love pickles and the battered fried type were crunchy and crisp. The crab avocado toast was sensational! Sooooo yummy!!! I would totally get it again. <br><br>For my main I had the black bean burger. I am no vegetarian but I am a huge fan of a great black bean burger. It was super flavorful, moist and the texture was crispy on the outside of the patty and smooth in the center. I chose to go for a lettuce wrap which adds a little crunch to it. The burger was large so I definitely could have shared it but I just ended up taking the rest home! It kept very very well. <br><br>My boyfriend and his dad had the salmon sandwich and loved it. I am not a huge salmon fan but they live and die for food salmon so I'll take their word for it. <br><br>My mom had the regular burger and I of course had to have a bite. The burger was juicy and the meat was super tender and flavorful on its own!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Fd1EToM-FsacelfLA9tfFg/348s.jpg", "caption": "\"PBR\" Battered Fried Pickles"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6yUedlWBIQIsYHoP5Z2d0Q/168s.jpg", "caption": "Rock Crab and Avocado Toast"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lEja5P8iRUzD_CWhfnUujA/168s.jpg", "caption": "Housemade Black Bean Burger"}]}}, {"review": {"des": "Skip it. Service was horrible. We came with a group of 7 on reservation, timely. Had to wait for a table. <br>Drink service - just beers and wine took waaaaay too long.  She never asked for an appetizer order. The cheese board was ridiculously plain - Brie and blue cheese, a few almonds.  Fried Pickles were unique, large and fun.  They were out of Dover Sole. On a Tuesday. At 6:30. Is this like \"the ice cream machine is (always) broken?\"<br><br>Our group enjoyed the fish of the day, scallops, fish and chips, and Thai curry.  They were OK. <br><br>Desserts were dismal, at best.  <br><br>The main food was good. The rest of the experience was ridiculous. We even had to ask for WINE GLASSES after we ordered several bottles for table. <br><br>Go somewhere else.", "pics": null}}, {"review": {"des": "We visited this place for lunch and I found this place not worthy.<br><br>We had:-<br><br>1) Bean burger: It was one of the best thing ever. Tikka of beans was superb. Salad they gave was super tasty.<br><br>2) Stakes and beef appetiser: Both dishes were extremely disappointing. I will give 1 star to them. Only presentation was good.<br><br>3) Boody merry: This drink was suggested by waiter and I found this drink extremely interesting. Because it was just like a soup and spicy drink it was!!!<br><br>As a food blogger, it was disappointing.", "pics": null}}, {"review": {"des": "We were in Chicago for a couple of nights and decided to go here based on yelp reviews as we were staying very close to this lovely restaurant. I have recently turned vegetarian so decided to go here as they had good options for vegetarians based on yelp highlights. I had a couple of Jameson's on the rocks and got the only vegetarian appetizer \"Blackberry and cherry tomato tart\" which was absolutely amazing, a little bit on the sweeter side and then ordered the \"Thai coconut curry\" for entree shared with my wife as the serving was huge. Finally ordered a desert as recommended by server \"chocolate brownie crunch bar\" absolutely mind blowing. Overall 5 stars to this place, the food was amazing and the presentation was great.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XbwmvH_MMqBaYb8V29Km7A/348s.jpg", "caption": "Thai Coconut Curry"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_-6SFP3sMJRRhSstQlfmaw/168s.jpg", "caption": "Chocolate Brownie Crunch Bar.. you gotta try this"}]}}, {"review": {"des": "In a world of super-loud bars and restaurants, The Gage stands out for its fabulous -- and I mean fabulous -- playlist amplified lightly. You can hear the background music, and wiggle in your seat instead of dancing, but you can likewise hear your dining partner without either of you raising your voices. A solid place to have some good conversation along with your food. For that alone I would return often. (Complete disclosure, we were here during the day, albeit when the restaurant was full. Can't vouch for nighttime noise.) <br><br>The food is likewise solid. We ate here twice in one weekend; breakfast and lunch. Fish and chips for lunch; crispy fish from start to finish. Irish breakfast good. This is not cutting edge gourmet but a good meal at decent value.<br><br>And then.<br><br>Ah. Then. The boozy hot chocolate! One ounce of Jameson mixed with hot chocolate and topped with raspberry liqueur infused whip cream. My life might never be the same.<br><br>Service ranges from fine to truly outstanding. Prices reasonable for location. (Did I mention the boozy hot chocolate?)", "pics": null}}, {"review": {"des": "Great spot for drinks, desserts, and even a full meal. It's right on Michigan Ave, which would make you think the place is always packed, but usually when I go I'm able to find a table or a spot at the bar without too much difficulty even when places nearby have a hefty line.<br><br>Usually when I spot a place that's not that busy while others around it are packed I get worried, but not with the Gage. You won't be disappointed here. They've got classic looks inside, great menus, and almost always great service without that Mich Ave snootiness you might find at other places, even though from the look of the place you wouldn't be shocked to get bad service. This place defies expectations and typically is a great spot for food or a few late drinks.", "pics": null}}, {"review": {"des": "This might seem obvious, but you need to come here hungry. The portions are huge and you will want to eat all of it then and there, with the aromas and the plate in front of you. I promise. I ate brunch here at around 10:30 and wasn't hungry again until...5:00?<br><br>Service was fantastic and I wish I remembered my server's name! He was attentive and charming. This place can get loud so also be prepared to out-talk your neighbors if you're seated close.<br><br>We started with the honey-glazed cheese biscuits which were literally the size of my face. You get 3 in a serving (!!!!) and they are huuuuuuge. Don't be fooled - their size does not have anything to do with how tasty they are. Each bite is like the last you will ever eat. They are that good. We couldn't eat all 3 then and there (we still had to order entrees, you know?) so I got lucky and took one home to eat for breakfast the next morning.<br><br>Pro-tip: take one home to eat for breakfast the next morning.<br><br>For my totally unnecessary entree (seriously, I was full after a mimosa and one of those biscuits) I had the spicy fried chicken sandwich. This thing is ALSO massive. I'm not sure who they think their target customer is, but I think they assume we all have bottomless pits for stomachs. Honestly, I'm not complaining. I didn't really get \"spicy\" from it but it was definitely a fried chicken sandwich. I wish they cut it in half for you because when it gets to you it's a little intimidating. I found the bread overwhelming and you can probably eat it as an open-face sandwich. All in all, a good sandwich. I'd like to try other things if there's a next time.<br><br>Bonus: The Gage is on the 2018 A La Card series! Check it out.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1vY7w0ZhxBrkKOLUaSNxbA/168s.jpg", "caption": "Spicy Fried Chicken Sandwich"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mvT7ChSpIpYht9TVMOhN8w/168s.jpg", "caption": "Honey-Glazed Cheese Biscuits"}]}}, {"review": {"des": "I've been here a few times for drinks and appetizers. All very good experiences. First time for brunch. It's was an enjoyable experience all around. The cocktails were excellent. The iced coffee with aged rum was a prefect brunch cocktail. Strong and not too sweet with plenty of caffeine. We got the cheese biscuits and scotch egg to start. I loved seeing a scotch egg on the menu, I love them if they are done right. And it was excellent, with the two kinds of mustard for dipping. The chilaquiles were very good. Two in my party got the Irish breakfast. It was a classic example of Irish breakfast, and the black sausage was very good. Unfortunately the other sausages were just ok. Ended with their Gagelious beer from Revolution brewery. It was very good. All and all I'd highly recommend, reasonable prices for the quality and right across the street from Millennium Park.", "pics": null}}, {"review": {"des": "Enjoyed a Saturday afternoon at the bar. We got lucky that there were two open seats so we did not have to wait. Great service and bartenders were very helpful. We ordered a burger and the mussels. The mussels were delicious in a coconut curry sauce with a little heat to it. Very large portion and was the perfect amount for lunch or to share. Burger was also good and the fries were very crispy. $50 for two lunches and a beer is pretty reasonable in Chicago", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kyX65ldCDD7iosNh_iZ44Q/348s.jpg", "caption": "P. E. I. Mussels"}]}}, {"review": {"des": "Wonderful ambience and terrific service. I recommend this for tourists looking for a great spot close to attractions or for a business lunch.<br><br>Book reservations if possible, this place fills up (though there's open bar and high top seating which is usually available). I came with two dining companions, one of whom loves the Gage and has been many times before. We ordered drinks (came very quickly) and looked at the brief but varied lunch menu. I ordered the beef brisket sandwich, which was perfectly cooked, dripping in sauce, and delicious if a little fatty (which is what made it so tender!) It was a wonderful lunch. My companions got the salmon BLT and mussels (a huge appetizer and filling lunch in itself) and had rave reviews. We decided on dessert, the Meyer lemon tart and almond cake. They were perfect, not too sweet but packed with delicate flavor. I especially loved the cherries and almond together.<br><br>Service was fast and excellent. I'll be sure to recommend this place.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/O3Hj__yKkZ_aaBGIYOOIkw/168s.jpg", "caption": "Meyer lemon bar"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OExVGAv9J6A_VVlN5VxUmw/168s.jpg", "caption": "Almond cake"}]}}, {"review": {"des": "Food: The food was great; I had the fish of the day, which was a seared salmon cooked medium-rare with browned butter, risotto, pine nuts, and broccolini. The apple tart was just right without being too sweet.<br><br>Drinks: Good selection of beers, wines, and spirits. I thought it was nice that they also had on draft beers from Midwest brewers (Revolution, Three Floyds, Lake Brothers, Moody Tongue, Half Acre)<br><br>Service: Service was good. My party arrived early and had to wait ~30 minutes until our reservation time. The staff promptly resolved a mishap with a fellow diner's drinks.<br><br>Ambience: Visually, the place is cozy with mood lighting, welcoming, with high-end finishes. Acoustically, as it was packed that evening, it was very loud in the restaurant and difficult to hold a conversation with table of 6.<br><br>Will I go back again? Probably.", "pics": null}}, {"review": {"des": "I read the reviews and looked at the menu outside and decided to give it a try. The Lamb Loin was cooked to perfection and is served Mediterranean style with feta, tomato, cucumber, peppers and should have has watermelon and potatoes but I asked for them to be left off and instead had Brussels sprouts.  It was delicious. <br><br>The restaurant is loud, if noise bothers you not the place for you.", "pics": null}}, {"review": {"des": "Decided on The Gage because of their proximity to the park but they didnt disappoint. The Corned Beef Hash, Sticky Bun, and Lavendar sodas are all a hit!! Check it out if you go. We enjoyed the meal. The ambiance is low key and we couldnt tell if it was full of locals or tourists which we liked.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kt80Zcs1rLM7LGB-Mcs6eg/168s.jpg", "caption": "The Corned Beef Hash!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/N9UIVhJhVBZ501BbO2SCNA/168s.jpg", "caption": "The Sticky Bun!! YUM!!"}]}}, {"review": {"des": "This was one of the most memorable brunches I've ever had. The poutine is a great start to the morning. We chose to sit outside on the patio and it was a perfect way to enjoy Chicago as a tourist. The corned beef hash was perfect with tender corned beef, finely diced fried potatoes, and poached eggs. Next time we are in Chicago, I know where we have to stop again!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HSC6Jiml1N6uocvfbNJY-w/168s.jpg", "caption": "Housemade Corned Beef Hash*"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HNZlO34InkPQ_Cp6SEF0Rg/168s.jpg", "caption": "Poutine"}]}}, {"review": {"des": "The Gage is what I would describe as high-end and classy without being pretentious. It's actually quite nice inside and the waitstaff were very attentive.<br><br>I started with the buttermilk salad. The dressing was creamy and subtle with just enough flavor to keep it interesting. The fried onion rings were chewy rather than crisp and unfortunately one of my lettuce leaves had a little bit of gritty dirt on it and a small fruit fly.<br><br>For my main course I proceeded with the lobster roll Cuban style. It wasn't quite what I expected. It was served neither cold nor hot, or at least I couldn't tell. There were generous pieces of lobster in it, but the bread was soggy, and it was served with a chorizo aioli sauce and what seemed to be diced tomato and bell pepper. I've had enough lobster rolls to know that this was not one of the best. It was neither lobster roll nor Cuban sandwich. <br><br>Overall we had a lovely dining experience, the food just barely missed the mark for me. The menu looked delicious so perhaps it was what I ordered. I'd be willing to give them another chance.", "pics": null}}, {"review": {"des": "The Gage is a wonderful place to grab a drink at the bar or enjoy a romantic meal. I visited while in town with friends and we came for an early dinner and drinks. <br>The environment at the Gage is upscale yet laid back enough to make you feel at home. The bar had lots of seating as well so you could sit there if you wanted. <br>For drinks I went with the French Lesson which was had Grey Goose, St Germain, Campari, hibiscus, lemon, and and prosecco. The drink was very good but I typically go for more dryer options than prosecco, I did really enjoy it though.  <br>For my food I simple went with the house poutine since that was what I was feeling. The fries were covered in delicious pork shoulder, gravy, and cheese curds. The dish was nice and hearty yet the flavors were not overwhelming like one may expect. Overall I really enjoyed my meal here.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CsT5CC8aJzLzPvldGxj0Cg/168s.jpg", "caption": "House poutine"}]}}, {"review": {"des": "Oof this place was a letdown in our Chicago food tour. The menu sounded really good online so we came here for brunch to celebrate a special occasion. We ordered the sticky bun, honey biscuits, Irish breakfast, corned beef hash, and fish and chips. <br><br>Let's start with the positives. Great service and waiter who gave us two free desserts on the house because of the special occasion. The dessert was a dense brownie with meringue and salted caramel and it was deliciously heavy. The honey biscuits were nice and cheesy and came with a really good whipped butter. The biscuits were slightly overdone for our taste but the flavor profile won us over. The corned beef hash was definitely the winning dish with a buttery hollandaise and full of chunks of good meat.<br><br>Now to the not so good. The sticky bun was very mediocre in taste and dry. The Irish breakfast had sausage with borderline gelatinous texture, the bacon was more of a pork chop, and just overall a meat heavy dish. To be fair, I should've asked more about the dish but I clearly prefer American breakfast. The fried fish had a good crunch but it was soooooooo bland. Uneatable by itself and needed a heavy hand of salt and pepper and any other spice. Fire weren't bad though.  <br><br>For only liking 2 of the 8 dishes that we ordered (the burger and other sandwiches are forgettable), I can unfortunately only give this place 2 stars. Great service though.", "pics": null}}, {"review": {"des": "Restaurants and people throw around the term gastropub like it's supposed to mean something. Often it's used to justify charging more for the same old bar food, only with expensive-sounding ingredients, or it's a New American restaurant that wants to feel cozier. The Gage is the only restaurant that I've been to that can legitimately claim the moniker. (Though, I'm doubtful they would like to.)<br><br>First of all, it legitimately is a pub. It has dark lighting, it can be noisy, and there are people from the Loop having after work drinks. Second, it serves refined food inspired by British neighborhood pubs. <br><br>It's difficult to read down the menu past the small plates, and we have a dinner of them. The scotch egg, which I have had in the past has a flaky crust and does not feel dense or greasy like its contemporaries. A house made sausage plate contained a smooth and fatty banger and a lean and crumbly North African sausage. They were delicious. Bison tartare with quail egg, frizzee, and cornichon salad is a leaner version of the classic though still soft and flavorful.<br><br>On our most recent visit they were offering a butternut squash bisque, which had a luxurious texture, saltiness and umami from the bacon offset by tart apples. It was a hearty and warm delight that was a stark contrast to the bitter cold of Michigan Avenue.<br><br>Their cocktails are great. I most recently had a Gibson cocktail which is made with a tangy mirepoix-infused vermouth. You really must try it. My dining companion had a Cedar Point, which she described as a blend of limoncello and mezcal flavors.<br><br>You don't have many great options for fine dining in the Loop. So, go with the best.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fJEuAeZrJLaanzbhlqm0IA/348s.jpg", "caption": "House-Made Sausages"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VTlBAi-xVN0f_l6EUQp2dg/168s.jpg", "caption": "The lean and flavorful Bison Tartare."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TkuTD4mTCYBkYY2fZ2vsbQ/168s.jpg", "caption": "Luxurious butternut squash bisque."}]}}, {"review": {"des": "My husband and I came here while on vacation. I had the Far and Away cocktail and the Lemon Ricotta Pancakes which we're both fantastic and paired perfectly together. Both were a little sweet with a hint of lemon, and delicious. My husband had the spicy fried chicken sandwich, which looked fantastic. He said it was really good. We also had the fried pickle appetizer, which was really good and a BIG serving. <br><br>Our server, Jeffrey, was super awesome! Wonderful service!", "pics": null}}, {"review": {"des": "Came here for brunch with my bff and had an amazing time. The service was on point and the food was phenomenal. I highly recommend The Gage...for lunch at least.<br><br>Server: Maggie gets 5 stars!<br>Food: Everything we had is worthy of 5 stars!<br>*Honey Glazed Cheese Biscuits<br>*Housemade Corned Beef Hash<br>*The Gage Venison Burger", "pics": null}}, {"review": {"des": "A total splurge but I love this place!! I always always get the mussels. Comes with a delish curry sauce which is very unique!  FYI the portion is HUGE. You literally get a giant mound of mussels. If you wanna save room you can request a half order which is plenty for several people to share as an app. <br><br>The meaty main courses always shine. I've had the bone in ribeye and the bone in pork chop before and both are so good my mouth waters just thinking about it now. Seasoned and cooked oh so perfectly tender. <br><br>So why not 5 stars? I was disappointed by their Cesar salad last time. Wilted lettuce with subpar salad dressing.  I was flabbergasted - there's no excuse for bad produce. Also, fried pickles were oily and nothing to rave about. We ate them all but I wouldn't make a trip to Gage just for them. <br><br>I say stick with the meats - it's pricey but waaayyyy worth it - and skip the stuff you can get anywhere else.  <br><br>One more thing - and I realize this makes me sound ancient - it's quite loud inside. Don't expect to have intimate conversations because you're yelling at each other the whole time.", "pics": null}}, {"review": {"des": "I went to the Gage about 2 weeks ago. I would highly recommend having a reservation so you can sit in a more private and quieter area than by the bar. <br><br>I ordered the scallops dish which was highly recommended by the waiter. The scallops were cooked perfectly and accompanied by fingerling potatoes, I believe some small mushrooms and some other vegetables. Overall, the dish was very flavorful and satisfying. They were probably the best scallops I've had in the Midwest but not the best I've ever had (it's difficult to compare to those that you can get on the coasts). <br><br>I also ordered a side of brussel sprouts which had some nice sweet balsamic raisins and spicy peppers. It was delicious but a bit too spicy for me. <br><br>Service was also excellent.", "pics": null}}, {"review": {"des": "I ordered the peach and berry salad. The farro added an interesting element that didn't leave me still hungry after a salad for dinner. This dish allowed me to stay healthy and full in the best way possible. This spot is right on Michigan ave with a cozy outdoor spot and a great view. Not many dinner spots available late at night on a weekday so this place is certainly a must go to.", "pics": null}}, {"review": {"des": "I mostly like The Gage except for the noise. It's hard to have a conversation. The menu is more bar food than white table cloth. The wedge salad seemed to have a poppyseed dressing rather than blue cheese dressing. Rather odd taste. The fish and chips are very good, except the chips could be better. It's a convenient stop by Millennium park. <br>One of our group had the hamburger and it was fine.", "pics": null}}, {"review": {"des": "Usually I plot out my vacations ahead of time, but on the visit where we ended up at The Gage we just let fate take us and found them by wandering until something piqued our interest. <br><br>The interior vibe trends upscale but there was a mix of locals, tourists, folks in jeans, and dressier denizens. <br><br>The brunch menu has several hearty, meaty dishes, so I made my own meal with a sticky bun and an order of Gage potatoes. I had no idea what they were, but it's hard to go wrong with a potato and they bear the restaurant's name so I figured they must be pretty delish. <br><br>The sticky bun was large and had a nice chew from the caramel. The potatoes were fried and covered in a very generous portion of cheese. I normally take down potatoes with abandon, but these were extremely rich and a side is probably good for two people to share if you don't have iron stomachs. <br><br>The Gage is great for an indulgent way to start the day and won't break the bank for brunch on Michigan Avenue.", "pics": null}}, {"review": {"des": "The Gage is, I think, one of the most under-rated, under-discussed restaurants in Chicago, and the fact that I've loved it for 12 years but am just now writing a review proves that I'm partly guilty for that.<br><br>When we first moved to the city and wanted to eat in and around Michigan Ave., The Gage quickly became our go-to special occasion restaurant, which always boasted reliable, upscale pub food, great service, and some of the best desserts in the city.<br><br>I hadn't been back in years, but when we recently had family in town--including my British FIL--I decided to take them to a weekday lunch at The Gage, followed by a walk through Millennium Park. (It's proximity to Mill Park is one of its many perks, as there aren't a lot of high-quality dining options along Michigan Ave.)<br><br>Since it was a weekday, the vibe was a little too business-y, but the food was every bit as delicious as I remembered. My FIL said the Scotch egg and the fish & chips were the best he's had since leaving England. We also always love the poutine.<br><br>The desserts, just as I remember, are really the standouts, though, and worth a trip on their own.", "pics": null}}, {"review": {"des": "Their potatoes might give you a heart attack right there, but that's what makes them so tasty! I got a eggs benedict and a mimosa and I can't say enough about the hollandiase sauce on the benedict. The green is probably cilantro and adds a light flavor to it but is more so a visual delight amongst all the shades of brown.<br><br>Also, this is very conveniently located in front of Millenium Park so if you're going to make a trip to the Bean and the surrounding area, make sure you hit The Gage up for brunch! The place is named after \"Gage hats\" from ye ol' days.", "pics": null}}, {"review": {"des": "Trustworthy friends had recommended the Gage to me, so I knew I was in good hands.  On a chilly and windy day, I started with Boulevard Brewing Co.'s Tank 7, a farmhouse ale from Kansas City.  It was delicious, with a hoppy sweetness that was lovely.<br><br>I had the \"regular\" burger with blue cheese, medium well, on a brioche bun, and though it was cooked a bit rarer than I ordered, it was on point and thrillingly salty.  Wish the bun were slightly thicker, however.  The fries were $!?@!&?ng great, like the kind of fries you dream about being served but never materialize anymore - juicy and crispy at the same time, and slightly herby.  And the burger appeared nigh instantaneously after I ordered it.<br><br>Music level was a bit too much from the speakers overhead, but I'll still be back on my next visit to Chicago - I want to try some other dishes!", "pics": null}}, {"review": {"des": "Service is fantastic, and although iced tea wasn't available, they made it onsite anyway! The Scotch egg was fabulous, tomato soup poured over grilled cheese bites was delicious, corned beef hash was amazing! The sticky bun was great to share as a starter!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dYK3W0IfvmTsWUQnfpBn3g/348s.jpg", "caption": "Sticky bun"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ds-gmAz2Zj9b7gSm2AtEpg/168s.jpg", "caption": "Tomato soup"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Uox5GT9xETERLDdd9Zo2HA/168s.jpg", "caption": "Corned beef hash"}]}}, {"review": {"des": "\"The Gage\" is a fave. <br><br>I enjoy popping in here for lunch (scallops and chardonnay usually), for an annual brunch post-Rock-n-Roll half marathon (eggs bennie usually) or a late night bite (Guinness and something meaty usually like a burger or that bison tartare.) And sometimes I change it up and get a Grey Goose Martini - made perfectly - as you'd come to expect. The bar area is usually bustling, I really like the patio on Michigan Avenue in good weather and sometimes it's nice to just chill at a table in the back of the house. I like that they keep the same items on the menu but they tweak them a little here and there - like the eggs bennie was poblano hollandaise this last year and the bison tartare was prepared to fit seasonal availability of greens. <br><br>It took me about a milliennium (and visiting the restroom downstairs a bunch of times, seeing old photos of fine millinery and wondering, \"Why the fancy hats here!?)... to realize from where the name is derived: (from their website) The Gage takes its name from the Gage Group of buildings (18-24 South Michigan). <br>Constructed in the late 1800s and now historically landmarked, the buildings housed<br>three milliners, including Gage Brothers & Co. founded by David and George Gage. Gage Brothers & Co. supplied hats to fashionable ladies throughout the U.S. and abroad. The installation in the staircase to our lower level features original early 20th century theater magazine advertisements for Gage hats which were known for their<br>\"superb style, sterling quality and superior workmanship.\"<br><br>I enjoy coming here. It's a nod to the past while enjoying food and drink of the standard set by the previous occupants of the building. Well-crafted meals, excellent service and a dimly-lit but still somehow brightly shining trendy spot catering to locals, business-travelers and tourists alike. <br><br>Reservations aren't a must but will be a plus.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Hu47MYa-Qr_qol3Lf928Mg/348s.jpg", "caption": "Menu July '17"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/v7YnVl3H_Pfhn69mypXS8w/168s.jpg", "caption": "Eggs Bennie. House made pork sausage, poblano hollandaise (July '17)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ptLJ71eAeK063-tRQl0jwg/168s.jpg", "caption": "Bison tartare, Grey Goose martini"}]}}, {"review": {"des": "Excellent dining experience! Made a reservation in the morning on my way to the art museum, after finishing up the museum visit, we headed to this spot directly! Excellent fresh sheet and service! Food is just delicious and portion is just right. We had a special fish dinner, fish and chips, local fried pickle dish, and a special desert. Everything is perfect! Will definitely recommend this spot to everyone who is gonna visit Chicago in the future!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eMu-EmgFDDAw6W9fI1gdng/348s.jpg", "caption": "Blueberry coconut cake, special desert!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-zXZm60hsFLFMQCoLp0D4A/168s.jpg", "caption": "Fresh sheet: salmon"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EGTubAn5iMSkzwNfLoJG7A/168s.jpg", "caption": "Today 's Fish & Chips"}]}}, {"review": {"des": "We decided to try this restaurant, because of reviews, I was curious if this place is worth the hype. I tried like 3 cocktails from their cocktail  menu and I was not impressed. Kind of premix tasted, unfortunately. Bison tartar, was to die for, we came back same day and ordered it one more time, perfect balance of tastes. Clams were eeh so so, sauce reminded me watery tomato soup, definitely needed more spices. I decided to try elk, but I didn't like it, the manager came to us, and changed order for me, which was really nice. Desserts were soo good we had cheesecake and chocolate crunch bar.  To sum up; I would give them 3 stars, one extra star is for really good service.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Zl5hwStgszRlwXDhz1HQIQ/168s.jpg", "caption": "Bison Tartare was too good, I didn't even had time to take picture :D"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gPI7sknq-PeHNfJV9yrQig/168s.jpg", "caption": "Clams, tasteless in watery sauce."}]}}, {"review": {"des": "Well, that was f*cking amazing.<br><br>1. Apex Predator<br>2. P.E.I. Vindaloo Mussels<br>3. Apex Predator <br>4. The Gage Venison Burger<br>5. Apex Predator <br><br>If you've got a better idea for a night out on Michigan Ave., I'm all freaking ears! The Gage had been a bookmark of mine for ages. Couldn't be happier that we partook in all of its glory after attending a killer Yelp! event at the nearby Chicago Symphony Orchestra. The aforementioned (Hit List) was a prefect ending to a delicious Yelp night out. That mussel broth though....fantastic spicy Indian spin, one of a kind dish. Smoked Gouda, fried jalapeños, mushrooms, pickled onions, mustard aioli...all layered over cooked-to-order Venison meat? Need I say more?! <br><br>Do yourself a favor and ADD THIS PLACE TO YOUR BOOKMARKS! You shan't be disappointed!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dkQje7R1vLqd3UO87983Xg/348s.jpg", "caption": "Apex Predator"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sycNXkHI7PC8H0Or26V5CQ/168s.jpg", "caption": "P.E.I. Mussels"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1_hmypIEpYjSKLm72fdIIA/168s.jpg", "caption": "Venison Burger"}]}}, {"review": {"des": "Pros: Great ambiance, outstanding service, beautiful locale, good quality ingredients. I came in for a quick lunch while on a solo excursion of Millenium Park, they sat me in a conner table by the bar, it was a perfect spot to privately people watch. I ordered the fish of the day, Faroe island salmon with lentils, kale, and agro dolce. The fish was a perfect medium rare, the lentils were succulent, the agro dolce was meaty and tasty. I also had a Zinfandel and a espresso. <br><br>Cons: Prices are high but it's in the middle of a tourist area, so that's expected. The fish described above was overall very good, but I think they went a little overboard with the balsamic. Would order something else next time.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yaoQA2SKd3SR3hq5ds7erA/348s.jpg", "caption": "Espresso"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kQ6SueNQuBuErXZ0NaTRCg/168s.jpg", "caption": "Faroe island salmon with lentils,kale, and agro dolce"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tIPnr5GkmH16QBy3qIpZow/168s.jpg", "caption": "Vino"}]}}, {"review": {"des": "THIS ESTABLISHMENT SUPPORTS RACISM. I was here with a group of friends last Saturday night (10/13). The night was winding down for us so we asked for the check. As my husband was paying the $500+ tab, a patron at the next table -- sitting with a group of several others -- made a derogatory and racist comment to him: \"Why are you leaving? They don't have tacos on the menu?\" My husband, our friends, and I am Hispanic. The table of patrons who made this offensive, inappropriate, and completely uninstigated remark were caucasian. I feel gross even having to distinguish race/ethnicity here, but this is what occurred. In disbelief, my husband asked what the problem was. That's when another male member of their group quickly stood up with puffed chest, walking aggressively toward my husband as the group continued to make racial remarks. At this point the majority of our party was shocked and asking, \"What did they say? What's going on?\" The next thing I know, a waitress makes her way over and begins yelling at us to get out. We attempted to explain the situation to no avail. She continued yelling at us, calling over more waitstaff to back her up and make us leave -- which we were already doing to begin with! In a state of disgust and disbelief, we walked out and ordered our respective Ubers/Lyfts. We couldn't believe that we had been treated in such a humiliating manner, and the offending party sat at their table laughing at us. Unfortunately, at this point we had already payed our very pricey tab (with generous tip), so it must've been an easy call to kick US out rather than the instigators, who were still imbibing. Waitstaff continued to harass us as we waited for our cars outside, coming out to yell at us several time, \"Get out of here before we call the cops!\" The indignity of the situation was outrageous. We explained we were waiting for our rides and told them to go ahead and make the call. They told us we couldn't stand on the sidewalk outside the restaurant and that we had to wait somewhere else. We reminded them that the sidewalk is public property. A few minutes later three police officers arrived. This was actually a relief for us. We explained our side of the story and they were extremely understanding. They didn't give us a hard time, recognizing how ridiculous the situation was, and they also told us we could continue standing where we were (on the city sidewalk) to wait for our cars. <br><br>I have been to this establishment many, many times and have recommended it to others on countless occasions -- in fact, I recommended it to colleagues just two weeks ago. Never again. I am sick to my stomach with disgust at the demeaning way we were treated, especially compared to the way a table of racist, troublemaking individuals were treated. If you find this situation to be as gross as I do, I urge you not to support this establishment. I realize we're living in a climate where prejudiced people are emboldened to make cruel and hurtful remarks to plain strangers; I just didn't know The Gage supported this type of racist behavior. <br><br>Please tell others about this situation; I'm making sure to tell everyone I know. I will never return here and will happily spend my money (including my $500+ tabs) at any of the hundreds of other upscale, non-racist establishments Chicago has to offer -- you should, too.", "pics": null}}, {"review": {"des": "I always walk pass this place on my way to my bus stop so was excited to finally give it a try around lunch time. We didn't have reservations and they did not have any open tables, we did however find space at their very large bar area. They do have a pretty nice bar and the service at the bar was good even during lunch hour when they were packed.<br><br>I tried the  Venison burger which they recommended I try medium rare. I was just not feeling ambitious enough the day before a long vacation so went with Medium cooked which I think was a mistake. I'm going to give this burger another try with the house recommendation of medium rare. My friend tried the fish of the day and the drinks were mad delicious. <br><br>The Gage may turn out to be my new favorite spot for a bite in the city. Solid 4 stars for the price point.", "pics": null}}, {"review": {"des": "This place is an elegant place to stop in after work for drinks if you're around Millenium Park. I've been here for drinks after work, and the bartenders are always friendly, helpful and conversational if you are into that. On another occasion, I've been here for drinks with a bunch of girlfriends - the strawberry drink \"When the Livin's Easy\" is delicious! It is so smooth and sweet, just how I like my cocktails. And the Brussels sprouts are really something else. I think they'd turn a hater around. They are a bit creamy and seasoned with Parmesan cheese!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RbFXzaChgMyzctS8YR7oUg/348s.jpg", "caption": "When the Livin's Easy, accompanied by Brussels sprouts!"}]}}, {"review": {"des": "Food: great<br>Service: great<br><br>Dined with a group of 8 and our server was fantastic! Most of us got different dishes and all were good. I got the Alaskan Halibut and it was fantastic! The Lamb, and Fish and Chips were also group favorites. <br><br>Capped the night off with a 20yr Tawny Port and it was a perfect ending to the meal. Highly recommend.", "pics": null}}, {"review": {"des": "Started with the mussels that were cooked in a curry sauce that were very tasty and fried pickles. For the main....  <br>Outstanding lamb chops! Cooked & seasoned perfectly.  They were sooo good. Dessert was a shot of espresso, Service was also great. Highly recommend this place. Only negative was the bourbon list was out of date.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QuYyCYX7SlQM1HHQStrzOA/348s.jpg", "caption": "Ballast poit"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/m84typnkcUnBvye4jtFNzg/168s.jpg", "caption": "Free eagle rare"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1fJINL25lollvHgj2JJ9pQ/168s.jpg", "caption": "Mussels"}]}}, {"review": {"des": "Friendly staff, great location and awesome food! Had poutine and crab cake Florentine. The house Old Fashion was delicious!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bhoKIru74Abh0EYVI1ZW8A/168s.jpg", "caption": "Food was delicious! Crab cake Florentine and Poutine was great. Had to get boxes to go because the portions were huge!"}]}}, {"review": {"des": "This is a huge restaurant but the food was just so-so. We got the fish and chips and it was alright. Overall I would say this food was average at best. Service was great though and the restaurant is super large and can accomodate a lot of people.", "pics": null}}, {"review": {"des": "Great ambiance! We sat next to the fireplace which was cozy on this snowy/rainy day. Drinks were beyond our expectations. Service was en pointe as well. Glad we came here. Highly recommend!", "pics": null}}, {"review": {"des": "Our best brunch experience on our long weekend trip to Chicago was at The Gage.<br><br>Despite our reservation, we had to wait a little bit on the couch out front, but we entertained ourselves as we considered their menu.<br><br>After we were situated in a booth, it took five minutes before we were greeted by our waitress with a couple of checks in hand, but she was nice and provided us with satisfactory service thereafter.<br><br>The three of us shared:<br>Blue Corn Pancakes $14 mixed berry jam, lemon curd, rosemary syrup<br>Housemade Corned Beef Hash $14 poached eggs, hollandaise<br>House Poutine $10 cider-braised pork shoulder, pork gravy, cheese curd<br><br>If we had to vote a dish off the island, it would be the poutine, although the poutine was still good with chunks of tender meat and onions.<br><br>The corned beef was your epitome of the dish - made with real chunks of corned beef.  Our corned beef lover was quite pleased.<br><br>The pancakes were a surprise pleasure for the less sweet toothed among us.  I liked it with the lemon curd.  They preferred it matched with the berry jam.  Though we all still gave higher marks to the banana cream pancake we had enjoyed earlier in the weekend.<br><br>The bathroom is located down a flight of stairs.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zWG9ZA55KhdmD75P_8S-gg/348s.jpg", "caption": "Housemade Corned Beef Hash $14 The Gage 9/2017"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/13FZpytje_plzn6BP_ds_A/168s.jpg", "caption": "House Poutine $10 The Gage 9/2017"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tCd1VpU57auuT2UD3Vg3QA/168s.jpg", "caption": "Blue Corn Pancakes $14 The Gage 9/2017"}]}}, {"review": {"des": "We stopped by during brunch hour, and was surprised by how many people there were in the restaurant. We sat down, took a look at the menu and kind of found out why. The brunch dishes are very cheap. It's like the price point of TGI Friday or red lobster, maybe even cheaper. We ordered the scotch egg. The egg is very good, but maybe not quite as good as I expected after seeing literally thousands of review saying how good it is. <br>I did not like the spring asparagus salad, but only because it has some kind of goat cheese in it, which I hated a lot. <br>The lobster roll is decent. You get a lot of lobster. I will say you get what you pay for the lobster roll.<br>The venison burger is pretty good. It has a strong spicy flavor that I love, and juicy patty.<br>Overall, the place is very crowded during lunch, probably because the foods are not expensive and pretty good.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sLCJSkhTca3rfwmh2U8Lug/348s.jpg", "caption": "Scotch Egg"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vHbhXZqVDg9sC5TOXBVMHA/168s.jpg", "caption": "Lobster Roll"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ghxDgD90XeHkuPc5bebrmA/168s.jpg", "caption": "The Gage Venison Burger"}]}}, {"review": {"des": "We really enjoyed this place. We don't usually hang out at restaurants after we eat. But this place is so welcoming we stayed for dessert and a few drinks. Who ever put this place together did a fantastic job! <br>We will definitely go again", "pics": null}}, {"review": {"des": "The Gage offers a very fine brunch. It may require one to get over their aversion to hipsters (how many man buns can one staff have?!?), but it's worth doing so. <br><br>The Gage has an attractive and comfortable decor. The server was prompt. And the brunch menu offers some delicious options. <br><br>I was very happy with the Smoked Salmon plate, with a good portion of smoked fish, giant ripe tomato slices, and chive cream cheese. My friend's Chilaquiles were delicious and cheesy, and the Eggs Benedict was quite good. <br><br>The serving of PBR Fried Pickles was generous, but they weren't as good as others I've had. (My friends debated if it was the batter or the pickles that left us slightly disappointed.) The Gage Potatoes were good but not exceptional. <br><br>I was a little disappointed at the server's response to a special request from one of my friends, who asked if the eggs in her BLT Egg sandwich could be made a certain way. He said \"no\" out of hand without even checking with the kitchen. But, my friend was fairly happy with the sandwich, nonetheless. <br><br>This is a good place for a nice brunch.  When you're done, stroll across the street to Millenium Park or up Michigan Avenue to the Chicago Cultural Center. Both are free and add to a pleasant morning after good food at The Gage.", "pics": null}}, {"review": {"des": "On a recent visit to Chicago over St. Patrick's Day weekend, we took a Free Tours By Foot walking tour of The Loop and Millennium Park, that conveniently ended by The Gage Restaurant. Lunch there is a must if you're in the area! How fun to introduce our Persian cousin to typical pub foods -- even moreso over St. Patrick's Day. We got Mussels, a Corned Beef Sandwich, and Fish and Chips -- and plenty of Guinness and Hard Ciders, natch! Somehow a Scottish Bagpipe player strolling through the pub got us all in the mood for St. Patrick's Day even moreso! Possibly due to the aforementioned beverages?!? :)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jPG20-Pg9z1MTabxmJnFYg/348s.jpg", "caption": "Scottish Bagpiper, getting us in the mood for St. Patrick's Day!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_kC4h82Bdje4sNHLIePcqQ/168s.jpg", "caption": "Bailey's Cream Dessert"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZV8kSgAKIZ8jiRUCROrafQ/168s.jpg", "caption": "Guinnesses and Hard Cider"}]}}, {"review": {"des": "My girlfriend and I sat at the bar and had wonderful service. Our bartender made us delicious drinks made them  to our profile. All we needed to do was advise our alcohol of choice, that we didn't like sweet and that we preferred soda water over tonic and he made refreshing cocktails. In addition, we asked for a recommendation on the appetizers and were advised to get the fried pickles. Oh my goodness, what a good idea that was!!! First of all, the portion was huge, we couldn't finish it. I don't know what type of breading they used, but it was super yummy and it didn't fall off the pickles. Also, the dipping sauce was zesty and creamy....so good!<br><br>I don't know how service is in the rest of the restaurant, but I will go back to the bar next time I visit Chicago!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cHw4alI_hHVDoSMXRDsxpA/168s.jpg", "caption": "Fried pickles"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WYHPvd3YJUwcLn08uvLjkQ/168s.jpg", "caption": "Bartenders concoction"}]}}, {"review": {"des": "Awesome breakfast. I had the crab cake Florentine  and my wife had the bagel and lox.  Both exceeddd our expectations with quantity, presentation and flavor. Great coffee and a latte. Service was very good.", "pics": null}}, {"review": {"des": "We walk in without the reservation on  a Saturday afternoon and are seated immediately. The place is huge. I like the spaciousness, layout comfortable feel at the table. Passing through  Im noticing a full bar ( TV that  plays  sports), lively atmosphere,  and back room aligned with the kitchen, mostly secluded from the main restaurant, where we are seated.<br>Its a brunch time, I am asking  the waiter for the recommendation, he very confidently states that the beef hash is THE meal to order.Beef hush is their authentic recipe, so I complied.  <br>It was a big deep/soup alike plate filled with the smoked shredded meat and the two eggs on top of it + 2 peaces of bread and melted American cheese on the side. I know there are many folks who would appreciate this amount of  proteins at plate,  but for me this was way too much. I ended up getting full by  2 over-easy eggs, tasting just a little bit of the meat (wishing I had ordered the eggs florentine as originally planed). <br>2 Burgers that were served  at our table were also enormous. I  tasted only the venison one. Standardly tastes and its rich.<br>The bloody Mary was outstanding.  <br><br>I would recommend The Gage for lunch. Its comfortable and  conveniently  located across from the park and Chicago Art Institute.  Its lively, not quiet. The food  is probably going to be good, the service is friendly and efficient. I wouldn't mind returning to it , but I will not be remembering it either.<br>If it were possible my honest rating would be  3,5 stars.", "pics": null}}, {"review": {"des": "My husband and I spent a long weekend in Chicago and found ourselves in town right around lunch. We were walking and randomly came across The Gage on Yelp and decided to give it a try. We were not disappointed. We started with the House Poutine. It seems anytime we find poutine on a menu we have to try it. My eyes became huge when I realized the appetizer we ordered was enormous. We did not have any issue finishing the bowl though. The toppings and sauce (cider braised pork shoulder, gravy, cheese curds and jalapenos) were even distributed throughout the entire bowl and I did not have a single naked fry. The fries themselves stood all on their own, crispy, just enough salt and delicious. For my entree I ordered the Spicy Fried Chicken Sandwich and my husband had the venison burger each with salads since we had started with fries. We also had a couple drinks with lunch since we were on vacation. My favorite was the Far and Away, vodka, lavender, lemon and rose. Light and refreshing and not too sweet. Definitely not a light meal but a great start to our Chicago weekend.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ycqPcSFsRyS27LMRpnGzYQ/168s.jpg", "caption": "Spicy Fried Chicken Sandwich with Salad"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AGCDzktDPTSiyYE8Hz_zZQ/168s.jpg", "caption": "Far and Away"}]}}, {"review": {"des": "I've been here for drinks a few times and have always had good drinks and enjoyed the space. I can't say anything about the food as I've only ever had drinks.", "pics": null}}, {"review": {"des": "This place is amazing. Despite the minimal lighting inside, the food is full of flavor and the wait staff is extremely kind. <br><br>I ordered the Gage venison burger (with a regular hamburger) cooked medium, is was perfection. The burger was juicy and the cheese was perfectly meaty. The subtle kick from the jalapeños were the perfect touch. <br><br>The fish n chips was crispy and tender and the fries were perfectly cooked as well. The vegetarian coconut curry was to die for. The creamy flavors melted in your mouth with every bite. <br><br>Although we were stuffed by dessert we still ordered the cheesecake and the chocolate mousse (both recommended by our waiter, thank goodness for him!) the cheesecake was uniquely unbelievable and was gone before we could say cheesecake. The mousse was creamy and light and just sweet enough. <br><br>If you're looking for a nicer restaurant in the city, I definetly suggest The Gage", "pics": null}}, {"review": {"des": "The Gage is a great place for delicious food, scrumptious desserts, and naughty cocktails. Our dining and drinking experience was fantastic.  Our waiter was very attentive and knowledgeable.  His recommendations were spot on.  The serving of the PEI mussels as an appetizer is quite generous and an amazing meal of its own.  Since we wanted to try the lamb entree, we decided to make it an appetizer.  OMG! It was grilled to perfection!! It simply melted in our mouths and we were all fighting over the last bite.  The rock crab and avocado appetizer was also delicious.  <br><br>The seasonal cocktails were also worth drinking.  I was over the moon with the drink \"over the moon\" because it was light, faintly sweet, and tickled my taste buds with a large lemon peel. The Old Fashioned was also delicious.  The Ice cube was so clear you could read through it.  <br><br>If you are a carrot cake fan, it is definitely worth having. The cream cheese icing and pineapple on top of this moist cake was awesome.  The chocolate brownie is a must for the chocoholics.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BJVcBwKzAW6fajDGOqwHEA/348s.jpg", "caption": "Old Fashioned"}]}}, {"review": {"des": "Loved the service and the food.  The only negative was that the inside can be a bit loud if you plan on having dinner conversation.  I found the menu fresh and inventive with new dishes and standard classics alike.  People in our party had salad with scallops, curry, filet mignon, and lamb... all were excellent.  Dessert was filling but nothing exceptional, and choices were standard fare.   The wait staff was attentive and knowledgeable.  The wine list was nice, but not huge.  <br><br>Overall, a really good place for a family dinner  or business meal.", "pics": null}}, {"review": {"des": "We came back for a quick trip for our youngest son's birthday, his name is Gage. We told the staff about Gage's birthday, and they went above and beyond to make the occasion special. We could have not been more pleased with the service and staff, they made it a truly memorable occasion. <br><br>The food was again excellent. The mussels and cheese board were amazing, the curry flavoring is great. The tuna special was also cooked perfectly and delicious, also with a hint of curry. The wine list is extensive, but they have unique and excellent choices, we had a small batch wine from Napa recommended by the staff, it was excellent. The butter cake for dessert was amazing. Also, the kids were big fans of the Mac and Cheese! Excellent place, would highly recommend!", "pics": null}}, {"review": {"des": "Bonus star to FOH for doing their best to accommodate us, when we arrived about an hour early for our lunch reservation, with a toddler and infant, plus an extra adult, amid the lunch rush and Millennium Park crowds seeking refuge from a summer downpour.<br><br>The service continued to be fantastic, with our server who took the time to help us through the extensive draft beer selections.  <br><br>I think Gage is really the epitome of what a gastropub ought to be.  Great food carefully created to complement the great drinks.  Standouts on the food side: the scotch egg, fried pickles, fish and chips, and the special of the day, which we had to order upon hearing our server describe it to us: bacon hash burger.<br><br>Would wholeheartedly recommend to anyone making the requisite Millennium Park stop and in need of really good food.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jmobMxJ31Wt1BD0k2VypIA/348s.jpg", "caption": "y"}]}}, {"review": {"des": "Really cute place for brunch! I ordered the eggs Benedict, and it was delicious. My husband got the lobster roll and I had a bite, and it was really good. It's a little loud in there, but what do you expect.. nothings quiet in Chicago.", "pics": null}}, {"review": {"des": "In town traveling for work.  I met up with an old buddy.   The beer and scotch selection is solid.   The waiter service is first class (bravo).  We ordered oysters and the venison burger.  The burger was absolutely amazing.  The bun, jalapeños, mayo, was great, and how it was cooked is world class.   This place is laid back with white table cloth.  This place more than sufficed!", "pics": null}}, {"review": {"des": "Only visited twice for lunch and had Venison Burger each time. This is a bold statement but in my opinion this was one of the best burgers I ever had. We usually go to Au Cheval to fulfill the need for a good burger but now there is a second spot for sure. I am not going to compare them but Gage is a gem. This is where medium is always medium and the marriage of venison meat, smoked gouda, wild mushrooms and jalepenos are simply perfect. They have a great selection of craft beers and their service is always top of the line. The inside decor has this interesting vintage feeling as it has the vibe from the previous era. Can`t wait to try the dinner menu some time.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Z7F5BhH1dWD6SlYVVwBj1A/168s.jpg", "caption": "When medium IS medium"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HedsznL44voLc0hWEIonxg/168s.jpg", "caption": "Venison Burger"}]}}, {"review": {"des": "Fabulous location and great atmosphere!  Our waiter, Zach, was great. He has patience and a positive attitude. The excellent tea selection to the authentic Irish menu makes this dining experience delightful!<br>The downstairs bathrooms have an elevator next to the stairs and hand lotion next to the soap. A reflection of the attention to detail in every aspect of this dining experience.", "pics": null}}, {"review": {"des": "We had a wonderful evening at The Gage and greatly look forward to going back!<br>I had always avoided The Gage because I assumed it would be horrifically expensive. While there are many VERY expensive items for those with an over abundance of cash, there are also many delicious affordable options. I'm so thankful that our 'a la card' coupon brought us in because it opened my eyes to the greatness of The Gage.<br>We started with some drinks and were so happy with the generous amount we received. I ordered the Spanish G&T and my partner ordered a German beer. Mine came in a beautifully presented wine glass and his came in an enormous stein! Yum!<br>We then ordered the charred Brussel sprouts in an apple cider vinegar and coconut milk cream sauce. I know, it sounds weird, but it was AMAZING! I couldn't stop eating it! Although it was Brussel sprouts, I consumed it like I was eating popcorn! Yum!<br>We both got the venison burger with fries and loved it. It was totally affordable AND incredibly filling! The best of both worlds. Plus there were many other affordable things on the menu that we want to try, so we will definitely be back!<br>Finally, the service was great! We always had refills on water, diligent and kind assistance from our server, and friendly staff all the way around! And all the while, they maintained a classy and high-end atmosphere while creating space for all types of people! I loved it and can't wait to check it out again!<br>Thanks for breaking my expectations, The Gage! See you next time!", "pics": null}}, {"review": {"des": "Met my former New-Yorker-turned-Chicagoan friend here for dinner last week.  I had a meeting in the city the next day, and had walked there from my hotel.  She walked there from her apartment.  Perfect 3/4 mile walk on a perfect night.  It was kind of in the middle for both of us. <br><br>We loved it!<br><br>Beautiful ambiance and friendly waitstaff.  The menu was really good.  We shared a seasonal salad, the venison burger, and the sausage and beer cheese plate.  Of course we had dessert, which was a mint sundae with hot fudge drizzled on top and fresh whipped cream. <br><br>She had wine and I had an Old Fashioned.  My drink was well-made and strong.  <br><br>Later I found out another friend of mine has a family member who is one of the partners there!  She also asked me if I had tried any of the other restaurants in this group.  The answer is no, but the Dawson is screaming my name. (Chicken fried lobster!?)<br><br>Anyhow, not to steal the thunder of The Gage, I will say this is a beautiful and tasty place to have dinner.  It was the perfect warm early Fall Chicago night, and I enjoyed it thoroughly.", "pics": null}}, {"review": {"des": "Decent burger not sure why it was named the second best burger in Chicago. To be honest it was kind of salty although it was juicy. Our server never came around that much i literally ordered, eat and paid like a fast food restaurant. Good location because it right across from the millennium park.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xVSVN1P5kuVn3LG6BYxaXw/348s.jpg", "caption": "Venison burger and fish and chips"}]}}, {"review": {"des": "The food selection was fine.  Very crowded but able to get a drink quickly while you wait for your table!", "pics": null}}, {"review": {"des": "We went on a Saturday night. Made reservations, but probably didn't need to, because the place is pretty big and decent amount of seats were available. For drinks, I got Over the Moon, which is really refreshing. For entree, we ordered the Lamb Loin and Swordfish. Both have a great layer of texture and flavor! The Lamb Loin comes with really chewy spatzle, and the Swordfish comes with crispy roasted mini potatoes. The portions are not too big, but I wouldn't say small either. For dessert, we got the Mint Chocolate Coupe. A great way to finish the entire meal. <br><br>Prices for this place is decent, considering it's location.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PU5AXz_MXMmZhmmLfD1OCg/348s.jpg", "caption": "Menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_CTNjV6lTaFHQDChlxTAyA/168s.jpg", "caption": "Mint Chocolate Coupe"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qGJ1zYXf4BwDD0yil2HNBA/168s.jpg", "caption": "Cocktails"}]}}, {"review": {"des": "When on Michigan avenue in the loop considering eating options, you will inevitably receive this recommendation. \"Go to The Gage man!\" I have one good friend that is a self confessed gastro-pub-a-holic; and whenever we dine out, usually he has some over priced gastro pub picked out for us to try. Some are good, some not so. I would have to put The Gage in the later category based on my experience. My take aways:<br>1) Prime time is crazy busy, with helacious wait times for seating, and mob crowds<br>2) Bar area is packed and has limited accessibility<br>3) The two bartenders I encountered, the red head was pleasant, the brunette, not so much. In fact, for a bar tender, extremely difficult to catch her eye. <br>4) Had to ask for the booze menu that is kept behind the bar<br>5) Saw the most Whistle Pig poured out evah, and I'm pretty sure that is an $18 drink, the bar tender was pouring it from the well it was that frequent<br>6) Everyone is making due at the bar, so be prepared to get cozy with your neighbors<br>7)  I actually like the downstairs bathrooms here, perhaps a welcome relief from the mobs up top<br>8) The person next to me ordered the mussels and they looked and smelled good<br>9) My cohort ordered the fish and chips and was very underwhelmed<br>10) I ordered the venison poutine, sounded like it was full of potential. Boy was I disappointed to receive a bowl of mushy fries with toppings. Isn't the trick to poutine to have the fries be more nacho like, just crispy enough?<br>11) You can't choose your bar mates but boy there was one group of guys that were just totally housing, gang busters loud, and showing no signs of leaving anytime soon, and I was there for a good chunk of time. <br><br>Would the experience be different if I was seated at a table and ordered high end of the menu? IDK, you tell me, but I'm not sure I really wish to find out.", "pics": null}}, {"review": {"des": "Been here a few tikes and never been disappointed. Has cute outdoor seating perfect for after work drinks staff is friendly. Had the lamb with spaetzle, medium rare and it was very good. Thai coconut curry with scallops was very good as well.", "pics": null}}]}