{"name": "the-gundis-chicago", "reviews": [{"review": {"des": "Excellent food and great service. Super find!<br>We will go back and highly recommend. <br>The eggplant dish was amazing", "pics": null}}, {"review": {"des": "I don't recall all of the details, but when I saw this place on Check Please, I knew I needed to try it. It took some time before we made it here; since we moved, we don't spend much time in Lakeview.<br><br>I'm not going to lie, East Lakeview isn't my favorite place to dine. IMO there aren't a lot of destination restaurants, but this The Gundi's is one of them.<br><br>The space is simple, open with exposed brick; I think in a former life it was a resale shop and I bought a dress there. But I digress. The atmosphere is sparse, but friendly and conducive to groups.<br><br>We started withe the sampler substituting the Ezme for Halloumi since we  had one nut allergy at the table. All of the items on the platter were good, but the Octopus salad was delicious. The octopus was diced so small that it actually looked more like pico de gallo. For our mains, we shared entrees ordering the Grilled Octopus, Spicy Jumbo Shrimp, Mardin Lamb, and one other beef dish. The star of the show was the grilled octopus; I've never had such flavorful, tender octopus. I think we all would've ordered a second helping if we had room. The shrimp was good too, the lemon rice was tart and delicious. I didn't try the other two dishes, but the lamb also got rave reviews. With our dinner we ordered two bottles of wine, one of which was a favorite of our friends and priced very reasonably.<br><br>We saved a little room for dessert and enjoyed the dark chocolate belgian cake. It was the perfect little sweet something to close out our meal.<br><br>The food here is wonderful and there's something for everyone. It's a great place to take family in friends. We'll be back for sure.", "pics": null}}, {"review": {"des": "Came here for my wife's birthday dinner. We saw the restaurant featured on \"Check, Please\" and decided to give it a try. We were not disappointed. <br><br>First of all, the atmosphere was warm and inviting, the service attentive and sincere. They don't follow the management textbook of some in the \"hospitality industry,\" which is a good thing to my mind. No fake smiles asking \"how is everything?\" Our waiter was knowledgeable and helpful. Never intrusive. Water was refilled several times and dishes cleared promptly. The service was great. <br><br>The food was equally wonderful. For starters, we ordered the sampler platter and the calamari. Both were outstanding. The hummus was solid and the baba ghanoush was better than most places we've frequented. The standouts though were the octopus salad and the ezme. Both were exquisite! Fresh, subtle, and nicely balanced flavors. The ezme was especially good. We asked what was in it. Our server gave us the main ingredients, but withheld the family secrets, which is fine since such such information is essential to their wonderful recipe. <br><br>For the main entreé, we had the grilled octopus. I liked it very much. It was tender and delicious. The yoghurt sauce was a nice complement. The grilled veggies were good and not overpowering. We had the bulgar side (can't imagine fries and such good octopus together). <br><br>Nice glass of pinot noir and a Spanish wine paired with the meal. Dessert was complimentary since we were celebrating a birthday. Tea and Kurdish cookies. Not overly sweet (thankfully). Tea was very good, too. <br><br>We're particular diners and both of us were very pleased with the dining experience at The Gundis. We'll be eating there again in the future.", "pics": null}}, {"review": {"des": "The Kurdish breakfast for 2...coming right up! <br><br>The food<br>We chose to get the Kurdish breakfast, soft scramble and soujouk (spicy beef and halal sausage) for $39.95 split between two people.  The eggs were very good, with pieces of onion and peppers mixed into the beef and sausage.  I didn't find the sausage too spicy. <br><br>They bring out small dishes for the following: feta, fresh mozzarella, kashar cheese, three house jams, honey, butter, Kurdish sesame butter, black and green olives, fries, cucumbers, tomatoes, fried cheese rolls.<br><br>You can dip the roll of bread they give you into the jam and butter.  I particularly liked the sesame butter and honey. <br><br>The service<br>Service was good.  When we asked what scramble was best, they immediately answered with the soft scramble and soujouk (spicy beef and halal sausage). It comes with bottomless tea and it was never offered to us, so I had to ask for it.  It is very good, so make sure to try it! <br><br>The experience<br>Made a reservation for 11am on a Saturday.  The restaurant wasn't very packed, so I'm, not sure if a reservation was needed, but I would make one just in case. <br><br>They put us at a table for two, there were two of us but they brought out so many plates it was hard to fit everything on the table. <br><br>I would suggest this place to anyone who is looking to try something different!", "pics": null}}, {"review": {"des": "Everything about The Gundis left me wanting to come back for more. The glass facade welcomes visitors into the warm glow of hanging lamps in a lofted space with brick walls and modern wood floors.<br><br>The space is very communal, everyone sits in one room. It is warm and cozy. <br><br>Much thought has been put into the food and drinks. The Gundis Salad is so fresh and flavorful. The Kurdish coffee, I learned from Denise, a co-owner, is made from pistachio beans. Pure heaven.<br><br>Everything on the menu looks delicious. We'll definitely be back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fot39-1TGfDZ8HO8iDn6vA/348s.jpg", "caption": "Gundis salad."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ST_p30rkBjIeTxI2QC0ZyA/168s.jpg", "caption": "Gundis salad. Outstanding."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/blWUE-Q1RJDs5RS6BEkGVw/168s.jpg", "caption": "Chicken sac tawa"}]}}, {"review": {"des": "The Gundis is one of my favorite restaurants in Chicago. If you haven't been yet, I'd highly recommend it!<br><br>I used to live in Lakeview and would pass by weekly but never thought much of it.  The Gundis was featured on Check, Please! and after listening to all the rave reviews, I had to give it a try.<br><br>As with most restaurants in the area, the crowd is \"older\" and the menu certainly reflects that. You won't be able to order a cocktail but the wine selection is decent. The food is familiar but with a Kurdish twist. Of course you've had lentil soup and stuffed chicken before but nothing like the Gundis' versions. The lentil soup with goat cheese is my favorite lentil soup in the city and everything about the stuffed chicken is just perfect.<br><br>The Gundis is a must try with their beautiful space, welcoming staff, delicious food, and incredible desserts. You can come here with friends, family, on a date, or on your own and still have a wonderful experience. <br> <br>They're also Zabiha halal which makes this one of the most unique restaurants around.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8Gh_QjxnKNIa4GfkbrqhEA/348s.jpg", "caption": "Stuffed chicken"}]}}, {"review": {"des": "Came here as a treat yoself dinner, and it did not disappoint. Really lovely place with awesome food and well worth the price, in my opinion.<br><br>For appetizers we got the sampler of Ezme, Hummus, Octopus Salad, Baba Ganoush- everything on this plate was tasty AF, well spiced, and refreshing- 4.75/5.<br><br>Entrees- we got the Chicken & Veggie Sac Tawa (4.75/5- delicious chicken w/rice and veggies) and lamb stank (4.75/5). The lamb was a tad bit dry but the bulgur was so full of flavor from the sauce. <br><br>The food isn't perfect but it's close to it.<br><br>Also- shout-out to the staff. Super friendly, nice, and accommodating. Answered the million questions we had and was attentive but didn't barge in constantly asking if things were okay. And the space is super pretty- it's big and open and modern but cozy. Wonderful atmosphere.<br><br>Will gladly come back here for round two. Thanks for a great dining experience.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-4bDJ0pD90AJ9mxn0HXZbQ/348s.jpg", "caption": "Chicken  & Veggie Sac Tawa- yum"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jFE3cCD58sjzDqVbY5Keqw/168s.jpg", "caption": "Lamb Shank- yum"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RdctktNSH3HuMX0ujB_9Xw/168s.jpg", "caption": "Sampler: Ezme, Hummus, Octopus Salad, Baba Ganoush- delish"}]}}, {"review": {"des": "If you haven't been to The Gundis, do yourself a favor and get there.  Never had Kurdish, me neither. It's a sort of unsuspecting spot along Clark Street just south of Belmont as you finally start to escape the Wrigleyville insanity.  I've been twice in four days (dinner and brunch), so that should be a pretty good indicator of how I feel about this place.  Let's start with my first visit for dinner.<br><br>Dinner:  My party started with the Hummus and the kitchen threw in some complimentary Baba Ganoush.  Both were absolutely perfect.  Bread was provided along with a sort of crunchy thin cracker (blanking on the name).  <br><br>I ordered the Adana Kebab which is a sort of ground and minced lamb meet.  It was flavorful and very tender.  I can't identify all the spices, but it was amazing. This restaurant is Kurdish so while similar to Turkish, things tend to have more spices and citrus. This was served with a side of rice and a salad.  The vegetables in the salad were particularly fresh.  The dressing was a lemony sort of mixture that was not too heavy and also tasted very fresh. <br><br>My partner ordered the Mardin Eggplant Stew w/beef.  I only had one bite, but as someone who isn't a huge lover of eggplant was pleasantly surprised.  In fact I might order it next time. <br><br>Brunch-So while there a friend mentioned they also do brunch and so sure enough a few days later I was back.  I went with a friend and we ordered the Kurdish Breakfast (meant for two).  This was truly a foodgasmic delight.  The meal consists of an egg dish (large enough for 4) and sides feta, fresh mozzarella, kashar cheese, three house jams, honey, butter, Kurdish sesame butter, black and green olives, fries,  cucumbers, tomatoes, fried cheese rolls, and bottomless Kurdish tea.  <br><br>Finally, the quality of service matched the food. The staff was fast, friendly and attentive without being intrusive.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/m2SUUkmiB-c8tFfT3tr8HQ/348s.jpg", "caption": "Turkish Coffee"}]}}, {"review": {"des": "Kurdish breakfast was a great experience. Cost about $20 per person and left full of tasty good foods. Great option if you like to try lots of bites of different foods. <br>Will be back :)", "pics": null}}, {"review": {"des": "We went for brunch and had the classic Kurdish breakfast. The food was delicious. Freshly baked bread, assorted cheeses, homemade jams, etc. Our friend ordered the baklava crepes and they were fantastic as well. The staff was excellent. Nice ambience, though the acoustics are not great,so probably not great for a large group or long table. It was really affordable sine our friend paid for us. Jokes aside, it is really well priced.", "pics": null}}, {"review": {"des": "All over excellent restaurant. Came here for Sunday brunch. They easily accommodated a group of 6 people. The service was excellent and food was exceptional. The Kurdish breakfast came with an assortment of items including jams, olives, breads, cheeses, and a scramble of your choice. All the ingredients were fresh and the scramble was made with Kurdish spices. In addition we had gotten two of the sweet breakfast items, specifically the baklava crepes and fig/Walnut pancakes. The baklava crepes were too rich to be eaten by itself by one individual because of this. It comes out in four pieces which we had split amongst 6 people and still felt it was too much sweetness. While the pancakes were perfectly made, with just the right amount of fluffiness from the pancake base, crunch form the walnuts, and sweetness from the figs. The biggest disclaimer to note is that the Kurdish coffee has no caffeine. However it is served in a cute silver cup and had a smooth pistachio flavor to it. The Kurdish coffee was just okay. While the Kurdish tea was delicious, basically a black flavored tea Similar to a Persian tea. <br>I would definitely go back ag", "pics": null}}, {"review": {"des": "The stuffed chicken is to die for! Great food. Great ambiance. A must!!<br><br>Our server took a while to get to us, so the manager gave us free dessert and tea. So lovely. <br><br>The fish and chicken pasta is also delish", "pics": null}}, {"review": {"des": "This is a great brunch spot. I'd highly recommend either getting their Turkish coffee or their Kurdish coffee. The waiting staff is incredibly friendly and the food is so great. A friend and I split their brunch special and still had so much food left over. If you are wanting to try a different brunch spot out, i would definitely recommend the Gundis!", "pics": null}}, {"review": {"des": "There are very few places that can do brunch and dinner equally well and The Gundis is one of them.<br><br>Came here on two separate occasions for brunch and split the Kurdish Breakfast - it is delicious and so filling! Just the assorted jams, jellies, and fresh cheeses itself blew my mind. <br><br>But dinner... dinner was absolutely incredible. A friend of mine shared the halloumi, stuffed chicken, and crushed isot salmon. Both were ABSOLUTELY AMAZING!!! So flavorful and perfectly cooked. Plus the service was so great - the wait staff is kind, attentive, and gave us a nightcap of Kurdish tea on the house which was incredible. Love love love this place!", "pics": null}}, {"review": {"des": "I love Chicago! <br>It has so many unique exotic places. One of them is The Gundis. It's a Kurdish restaurant! I have been to Mayan/Sardinian/Yemeni/Burmese/Basque restaurants but never to a Kurdish restaurant in my life.. Another rare cuisine to the list added!  Their food is so similar to Turkish/Persian/Levantine cuisines. <br><br>Food<br>Came here for a brunch. Had sujuk (halal beef sausage) omelet and the Wayne spicy spinach omelet. Both served with freshly baked whole wheat bread, olives and house fries. Everything was so tasty.. We ordered Kurdish tea (which is the same as Arabic/Turkish/Persian black tea) and it was so good. Personally, next time I would get only the bread with their BLACK olives (green olives were just OK here), house cheese and tea. It is definitely not your typical regular brunch. <br><br>Olives<br>Olives are sacred to me. They burst in vitamins, righteous lipids, essential minerals, significant iron, antioxidants/oleic acid (protects against aging, dementia and wrinkles).  And they're so tasty with hot black tea like the one served here.. You should eat at least 1 olive a day..<br><br>Atmosphere<br>Classic, clean and standard place. Parking was a piece of cake, but it was a snowy super bowl Sunday!. Love the snow fall outside while enjoying a hot cup of tea inside. <br><br>Staff and service<br>Professional and friendly. Prices are very reasonable. <br><br>If you're looking for a healthy, tasty, out-of-routine weekend brunch, The Gundis is a lovely option. Remember to get the black tea and the black olives. And read my lecture about the importance of olives as above..", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-eRIGcz687mWoGfmXwC5Bg/348s.jpg", "caption": "Kurdish black tea to follow a great brunch! Chicago has another authentic restaurant! Kurdish this time."}]}}, {"review": {"des": "Amazing flavor! Everything is fresh! Loving all we ate. 4 meals and we all had something to rave about! From the lamb, to the chicken, to the vegan entrees. If you love high quality cuisine. This place is for you!!!", "pics": null}}, {"review": {"des": "After seeing Gundis featured on Check Please! my husband wanted to try it. What a good idea. The mussels disappeared before I could get a picture. It hard to eat mussels and takes pictures. The same thing happened with the lamb shank. The watermelon salad with a delicious orange dressing and the rice pudding with apricot we're more delightful than I could capture with my cell phone. <br>We tried brunch on Sunday. Fortunately a table for two was available. The Kurdish breakfast for two could feed four. Great treats including house made jams--cherry, pear, and apricot. The spicy beef sausage soft scramble was delicious. Fries too. We'll be back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RnlOp5IEglAi_0UC3c8tLQ/348s.jpg", "caption": "Vegetable stew. You can order it with meat but it has the flavor to stand on its own."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ep3zCgllzcRfTDG2hyKUzg/168s.jpg", "caption": "Chicken stew on roasted eggplant--the best."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sMjfsEg0O0wqYJxJeJ35cw/168s.jpg", "caption": "Lentil soup wasn't overly seasoned so the flavor of the lentils came through delicious."}]}}, {"review": {"des": "Thank you Check Please! This program brought us here and we have fallen in love! We have never had Kurdish cuisine before, and I can tell you right now that it will not be the last! This place is just amazing!<br><br>We started our adventure with Baba Ganoush, an amazing hummus like dip that was to die for! <br>For entrees, we had the following:<br><br>Crusted Salmon<br>Mediterranean Sea Bass<br>Stuffed Chicken<br><br>All of our dishes were 5 Stars alone! The stuffed chicken was the best thing I have had in a long time! The sauce was just so delectable, I simply could not get enough, and I wanted to experience the meal all over again!<br><br>The Sea Bass was just as good! Having a taste myself, I was enthralled with the taste and utter smoothness of the dish! So good!!<br><br>The Crusted Salmon was beyond words good! <br><br>We simply loved everything The Gundis had to offer! We will be back very soon! Can't wait to enjoy another dining adventure with many dinner parties to come! Oh and yeah the Chocolate and Pomegranate Mousse is just heaven!!!", "pics": null}}, {"review": {"des": "Great brunch experience here. Service was exceptional. We got the Kurdish Breakfast for two with lamb scramble. <br><br>Love the small plates of jam, cheese, butter, bread, olive and more that comes with it. Tea is bottomless with this breakfast. I also started with a Turkish coffee. <br><br>Splitting this price point ($40 before tax) was a very good deal. I'm not sure how pricey it gets if you're going for dinner and entrees though. <br><br>The interior is chic and modern. Will definitely come back!", "pics": null}}, {"review": {"des": "Lovely place, great food (huge portions!)<br><br>We started with the Îsot Shrimp Tawa, shrimp all covered in a sweet and spicy sauce and served with warm homemade bread - on point. I sopped up all that sauce and it was worth it. Ordered a bottle of Grenache Spanish wine which was a little overpriced ($36, but sells for $10ish at store) but went well with our meal. <br><br>I ordered the crusted Îsot Salmon, a (gigantic 8-oz) fillet over rice and veggies in a delicious orange sauce. I thought the sauce was really unique and fresh. <br><br>My husband had the Lamb Shank, which comes with roasted veggies and piling heap of mashed potatoes, served with a rosemary sauce over top. It was tender, juicy, fall-off-the-bone good.<br><br>We took half our entrees home for leftovers and ordered the Kurdish cookies and tea for two. Super cute and fun way to end the meal. <br><br>We will be back to try the brunch!", "pics": null}}, {"review": {"des": "This was the greatest brunch I've ever had. Nestled in this charming little Kurdish restaurant you'll find plates presented in an aesthetic as quaint as the interior decor, plates filled with flavors subtle and perfectly balanced. <br><br>Even though I was in a Kurdish restaurant, the \"Kurdish Breakfast\" didn't make me feel like I was eating anything distinctly ethnic. It was more like an elegant and refined version of brunch that I'm used to. Coming with an assortment of jams, butters, and honey to dip the absolutely perfect bread in (fluffy but dense enough to spread on, with the lightest crunch on the outside), high quality cheeses, fruits and veggies, and a SPECTACULAR sausage  omelette, you'll excitedly hop from dish to dish in this extravagant spread. <br><br>The standout dish was the baklava crepe. The folded crepe mimics the crunch and layers of the puff pastry, but does without the dryness of the original. Topped with pistachios and that rocking honey, this is one dish you're going to have a hard time sharing with others. <br><br>We also had the fig and date pancake. With yogurt to spread on top, it was also served with a maple syrup that was refreshingly not overly sweet or with too much maple flavor that makes some syrups overwhelming. The pancake itself was like the bread, perfectly fluffy but thick enough with the lightest hint of buttermilk flavor in the background. <br><br>This much subtlety and elegance in a simple and humble setting for a very decent price makes this brunch experience the best I've ever had.", "pics": null}}, {"review": {"des": "Have been waiting to try this place for long time and got a chance to have brunch there. Soft Scramble with spicy beef sausage(soujouk)was delicious  eggs were perfectly cooked, fresh peppers & tomatoes. It came with a side of fries which was different and delicious.We also tried adana kebab wrap with was great with fresh veggies & goat cheese.  I'm not a big milk-shake fan , but don't miss out to try their dates & pear milk shake...not sure whether it is seasonal. <br>We also had a look at their dinner menu and it looked promising with a loot of seafood, poultry , beef & lamb options..planning to visit The Gundis soon...", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Szbc2d2u2gcj6KtwQRPbNw/348s.jpg", "caption": "Dates & Pear Shake"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pwLtdxIQUts-7LxqRpzw4Q/168s.jpg", "caption": "Soujouk Soft Scramble"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gtH-qVJ50T-Fs5QDOHnRUw/168s.jpg", "caption": "Fries"}]}}, {"review": {"des": "Have eaten here for dinner on numerous occasions and am always very satisfied with the experience. The food is excellent, the service is exceptional, and the atmosphere is pleasant! For Lincoln Park, I feel they offer unique, upscale selections.<br><br>I can personally recommend the spicy lentil soup, the sautéed Îsot Shrimp Tawa, and the Crusted Îsot Salmon.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4BnajoRP4o8HDy2TFlr81g/168s.jpg", "caption": "Crusted Îsot Salmon"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hErrR0cuMLYloNdEpHvE1A/168s.jpg", "caption": "Shrimp Îsot"}]}}, {"review": {"des": "Obsessed with this place! They should receive wayyy more recognition because they knock it out of the park. It's my favorite restaurant in the east lake view area. <br><br>Food: Fantastic! I can't emphasis enough how amazing it was. <br>Crusted îsot Salmon: The best salmon I've ever had... and I eat a lot of salmon. It was perfectly seasoned and flaky. The orange butter sauce complemented the savory roasted veggies. I can't get over how good this meal was. <br>Stuffed Chicken: Jesus Christ this was tasty. The goat cheese, the sauce (creamy and spicy), the everything. <br>Grilled Halloumi Cheese: salty, creamy and decadent all at once. <br><br>Ambiance: Beautiful. It has high ceilings with beautiful artwork. It felt spacious, elegant, yet relaxing. <br><br>Service: Our waiter was excellent. He knew his menu well. The spacing of courses was timely but not rushed. <br><br>Best food in the area! I highly recommend for a nice night out.", "pics": null}}, {"review": {"des": "I came on a Monday night and returned less than a week later, on a Saturday night, so that should tell you something. <br><br>The place: It's homey and sexy at the same time. It's simply a place I really enjoyed sitting in - and now I've been there and got to sit outside. They only have 3 tables outside, and there's a bit of shrubbery growing, but I'm of the mindset that I'd like to eat outside as late into the season as possible in Chicago. Being able to do so in late September is a gift. Service is solid. Courteous. Helpful. <br><br>The taste: Yum. So far, I've had the octopus salad (they do a great job with the octopus, seriously), the halloumi salad and the halloumi starter (give me halloumi everyday), an eggplant dish and a lamb sac tawa I think it's called. Also, the tea for two, with a few turkish cookies and tea reminds me of the times I sat in a Bedouin tent on the floor, drinking tea. It's nostalgic, and sweet and exactly the ritual that connects people. A perfect way to end a delightful meal. The coffee is also interesting. Reminiscent of mexican hot chocolate.<br><br>My face: There's something sort of magnetic about this place, and I've always left with a smile. A few times people have treated me, but I think you can expect to spend $25 a person...depending on your hunger and alcohol consumption. I think the bill for 2 has usually been around $70.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/duKjsPwCs5TXt0UcRMJOWQ/348s.jpg", "caption": "Turkish coffee. Sweet and unexpectedly delightful."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8VvKL1tFsh14Kng_HcBdvg/168s.jpg", "caption": "Turkish cookies and tea for two."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Gu7bWsmFs7ZWHXlKm_5-CA/168s.jpg", "caption": "Eggplant - I forgot the name but it's the special one. Also delish."}]}}, {"review": {"des": "Walked over to Gundis after spending some time perusing Art de Triomphe across the street. Did you know the owner oh that place has been awarded the very highest honor in pastel painting? Anyway, after looking at her stuff we went across the street and found a restaurant that should have high honors to for a tremendous meal. What a wonderful find! We had a Gundis salad that had just the right fit of lemon. We had shrimp and roasted vegetables and finished up with Belgian chocolate cake. That was an absolutely perfect amount of food. More, it was an absolutely perfectly flavored meal with a little bit of heat but not too much and complex flavors that were superb. Nice staff. Great evening. We didn't order any wine because we had had some earlier, so our meal came up very reasonable. I happily recommend this place and look forward to going back again.", "pics": null}}, {"review": {"des": "This is the only Kurdish restaurant I've ever been to but I will be looking for more. The value was great. There is a full bar.  The service was exquisite. The bathrooms were clean and beautiful.  They offered a gender neutral option.  <br><br>The food was amazing. Light use of cream and cheese made the spices melt in your mouth. Make sure to get the sampler appetizer and the Kurdish cheese. It was so very good. I loved how easy it was to be there. We shared plates and had a wonderful time. What a great restaurant!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cOykTNJw5Rzq-pPidMdaLQ/348s.jpg", "caption": "The Restaurant was very clean. The service was excellent. We shared plates and had a wonderful time. They take reservations but not Amex!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4YDwwhUscJH-bR_hOQo66A/168s.jpg", "caption": "Baklava...Pistachio and walnuts rolled in phyllo dough and smothered in honey. Perfect portions and the presentation made it shareable."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8UEgbzPFnF-JjKgpObsR7Q/168s.jpg", "caption": "This is the special stuffed chicken in cream sauce. The vegetables were perfectly cooked and the chicken tasted like no other chicken!"}]}}, {"review": {"des": "Outstanding meal.  I was excited to try Kurdish food, and the Gundis really impressed me.  There were so many delightful-sounding items on the menu that it was difficult to choose.  Everything that I tried was at least good, most of it great.  My two highlights were the grilled calamari appetizer and my entree, mardin eggplant stew.  This was vegetables and cubes of lamb in some kind of savory sauce, served on a bed of eggplant puree.  Not only were the flavors amazing, but the meat was so succulent that I could hardly believe it.  It was high-end steak-house quality.<br><br>Service was decent.  The waitress was friendly and attentive enough, until right at the end when she disappeared for a long time before bringing the check.  There was a curious exchange about dessert though. Long story short, our party of four asked for two orders of the rice pudding, but they were close to running out.  The server went to check and came back saying, \"Sorry, there's only about half an order left.\"  Besides missing out on a favorite dessert, I also found it strange that they told us that there was a half order, rather than just saying \"Sorry, we're out.\"  I feel like a restaurant at the top of its game would have comped the small amount of dessert for the table, just to let the customers try it.<br><br>However, the food was so good that this disappointment did not ruin the meal in the slightest.  The restaurant was rather loud, but otherwise I have no complaints.", "pics": null}}, {"review": {"des": "Visited this restaurant for a private event recently. Never had Kurdish food before but I have to admit I was pleasantly surprised. The Adana kabab is a must have. Pasta with feta was spicy but really good. The appetizers hummus and egg plant dip (Baba ganoush) solid. The highlight to me was the crepe bakhlava... this is a must have in my opinion. I love that this is a family run restaurant and the dad (head chef) came out and we took a picture together. All in all loved my experience will be back soon.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ijQ9NhY7OewJVu7fJav4VA/348s.jpg", "caption": "With Owner and Head chef."}]}}, {"review": {"des": "Been to this place only once but it was a great experience. Would highly recommend the Kurdish Breakfast. It was a real feast of cheese, olives, breads and spreads. The tea they served was amazing with honey. The service was expremely courteous. We were raving about the whole affair for a few days after. Highly recommend!", "pics": null}}, {"review": {"des": "A true gem in a neighborhood chock full of choices. We made late reservations on Saturday night and when we arrived the place was jumping. While our table was not quite ready we went outside since it was a nice night to wait. Upon entry your senses are awakened to the hustle and bustle inside, the loud (not too loud though) chatter and the amazing aromas from the foods being prepared.<br><br>Once seated we ordered some libations (solid selection available), perused the menu and discussed our options. We decided to try a wide array of dishes and share amongst one another to share in the experience.<br><br>The menu provides a glimpse to a broad array of gastronomical regional options. <br><br>Our appetizers arrived in sizable portions (not too much, definitely not small either) and all were prepared freshly with top notch ingredients.<br><br>The wait staff was attentive and helpful answering questions about certain dishes and menu items. Pleasant, attentive without being overbearing and extremely knowledgeable are the best describers.<br><br>Our entrees were just amazing!! Abundant, magnificently prepared and delicious. <br><br>We had hoped to delve into coffee and dessert but were just too full!!<br><br>All in all this establishment is terrific. We overheard folks mentioning they also had a fantastic Sunday brunch that we will be sure to try next time in town.<br><br>If you love this type of regional cuisine or are not sure and have an adventurous palate I highly recommend this restaurant. Trust me you wont be sorry! - JG3", "pics": null}}, {"review": {"des": "I love Breakfast for two!! I come here regularly, and enjoy this place always. The staff is friendly, quick service, everything is delicious. Authentic and cozy place for a good Sunday morning. I have recommended this place to everyone I know, and bring visitors.", "pics": null}}, {"review": {"des": "My wife and I came here with my cousin here last week. We just happened to walk by, so it wasn't planned. <br><br>From the little appetizers to the entrees, everything was terrific. My wife is still talking about this shrimp appetizer she got. The shrimp was great, but the sauce was also so delicious that we got more bread just so we could finish that up too!<br><br>I think we were most touched by the service though. Everyone was just so easy going, gentle, and friendly, it just made the whole meal all the more relaxing and enjoyable. <br><br>We will definitely be returning!", "pics": null}}, {"review": {"des": "Fresh food and good service! We did the sampler appetizer (highly recommend to try a lot), navy bean salad and a lamb dish. So good!!", "pics": null}}, {"review": {"des": "Recommendation: the stuffed chicken and the dark chocolate mousse with pomegranate seeds. The sauce for the chicken is so creamy and to die for!! I'm not usually a dessert person but the chocolate mousse just melts in your mouth been here twice and gotten both things both times because they were so delicious. Reason for not giving it 5 stars: the service can be a little all over the place (small tables for large plates of food, waiter forgot about us a few times, didn't offer us bread until we asked, etc). Overall delicious food - must try!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kAgBKiKkoZqoRJ3dxoLIgg/168s.jpg", "caption": "Dark chocolate mousse with pomegranate seeds"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ni2lxZVXiGYozjygrQKhDw/168s.jpg", "caption": "Stuffed chicken"}]}}, {"review": {"des": "Went here on a Sunday night. The restaurant was more then half empty yet the hostess tried to seat us at a very small side table next to a noisy bunch. I asked for a different table and was told they were all reserved. Yeah right ... total nonsense she just wanted to be rude. We left. Not coming back here.", "pics": null}}, {"review": {"des": "Here for brunch but want to return for dinner. Spacious, good service, extremely well flavored food. Loved my tofu scramble!", "pics": null}}, {"review": {"des": "I first spotted this \"good vibes\" looking Kurdish restaurant earlier this year when it was newly opened, and I finally had a chance to visit recently. I had a reservation on a weekday night, and it wasn't as crowded as expected (I've walked pass the Gundis on weekends before and remember it being really packed). The restaurant has a fairly huge space, filled with modern decor and ambient light. Service was fast and attentive.<br><br>For dinner, I had the Mardin Special, which was chicken (you can also choose beef/lamb) wrapped in lightly fried eggplant, neapolitan sauce, yogurt sauce, served with bell peppers and tomato. A plate of bread was also served as a side. The stuffed chicken was tender and delicious, while the eggplant was well cooked and not too soft. However, the most impressive part was how delicious the two sauces blended together turned out to be - great pairing!<br><br>Overall, I had a good dinner experience at The Gundis. Will definitely come back to try brunch and Kurdish breakfast!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0u7NTnwmUt6uJ4dDJVJp4w/348s.jpg", "caption": "Mardin special with a choice of chicken"}]}}, {"review": {"des": "I vacationed in Turkey a few years ago and have fond memories of the huge spread for breakfast most mornings - simple but delicious things that turned breakfast into a real event. I was reminded of that at The Gundis with the Kurdish breakfast.<br><br>Husband and I went for brunch at 9 on a Sunday and we were the first people there (though others did trickle in slowly). We did the Kurdish breakfast which starts with your choice of a soft-scrambled egg. We chose ours with sujuk, the spicy halal beef sausage we ate all over Turkey. The scramble has peppers, onions, and then sujuk (or lamb or whatever other choice if you want something else). Very very tasty and well done. Then the rest of the spread comes: <br>- fresh bread which was FANTASTIC<br>- 3 types of cheese (the feta was the standout)<br>- tomatoes and cucumbers<br>- spreads and jams for the bread (cherry, apricot, a tahini spread with grape molasses which was fantastic), butter<br>- different types of olives<br>- probably some other stuff I'm forgetting<br><br>You also get bottomless tea, which is helpful because the teacups are just like they are in Turkey - teeny tiny :) My husband tried the Kurdish coffee and let me just say - I'm no coffee connoisseur. I drink it, but I don't love it. This coffee was delicious. It has ground pistachios in it and that made it creamy and delicious. I've really never had anything like it. The only downside is, it's a pretty small cup so while good, it disappeared pretty quickly.<br><br>We liked this place a lot. I have heard mixed reviews on dinner but we had a great experience with brunch and will definitely be back.", "pics": null}}, {"review": {"des": "Great food. Love the chicken Kebab sandwich, the baba ghanouj, fresh bread and traditional tea!", "pics": null}}, {"review": {"des": "Brunch at The Gundis was both the best meal I had during my trip to Chicago, and one of the best breakfasts I've eaten in a very long time.<br><br>For $35 - $38 (depending on whether you get your egg scramble with meat or veggies -- and you should go for the veggies!), you get a Kurdish feast for two, including unlimited cups of tea, a big \"soft scramble\" of eggs and peppers/tomatoes/meat, fried cheese roll-ups, fresh cheeses, fresh cucumbers and tomato, delightful fried potatoes, as much bread as you want, olives, and a tantalizing variety of jams (cherry, apricot, and fig, all with pieces of whole fruit in them!)/butter/honey/sweet tahini spread.  It's really fun to be able to try so many different kinds of food, including savory and sweet, and to be free from menu-induced decision fatigue and eater's regret that comes from picking one dish and then wishing you could try them all!<br><br>It's *lots* of food: easily enough to feed three + people, or to stuff two to the gills.  And it's all absolutely delicious!  Standouts for me were the cheese rolls, veggie soft scramble, tahini spread, and jams, but everything was excellent.  It's also a rarity to find a big Kurdish breakfast like this in the US -- I've had a breakfast like this in Istanbul (and the one at The Gundis was just as good!), but Kurdish restaurants are few and far between in the Midwest.<br><br>The atmosphere of the restaurant is lovely -- light and airy with huge windows and a trendy, minimalist design.  The service was attentive and polite.  We visited on a Sunday at around 9:30 AM, and the restaurant was not at all busy.  They do take OpenTable reservations if you're going later in the day and want to be sure to get a seat.<br><br>I plan to revisit The Gundis next time I'm in Chicago -- their dinner menu looks great, as well!<br><br>FYI: Metered street parking is available in the area, and the side streets have free meters on Sundays.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/98n2RApGIj9awhuNGn_Ecg/168s.jpg", "caption": "Breakfast for 2!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mN8VQRh0Ye5DxvfFoqTxKA/168s.jpg", "caption": "Tea and sugar"}]}}, {"review": {"des": "Yummy yummy yummy,<br>We had great food great service and great wine... all in a trendy but Uncrowded place. We ordered the<br> sampler with baba ganoush , hummus, and roasted octopus salad with flat bread.<br>Salmon and sea bass main courses( both epic)<br>Dessert was a light and purely addictive rice pudding and the Belgian chocolate cake...<br>Amaze lol just amaze", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iYCVyTE6RGzgq45fzba12w/168s.jpg", "caption": "Sea bass"}]}}, {"review": {"des": "A OK. Review what Pete Wells resto critic at NYT says when you get 2 stars--this is really good--Yelpers need to stop over-staring places so we can get a realistic perception.  A-OK means very good.  This place has good food and service and is a nice clean new spot.  This is not life changing food--This to me is not even Kurdish.  Although I have not been to Kurdistan, this is a very popular cuisine in Israel, and I have had many meals at some legendary Kurdish restaurants. Place is very hospitable--go and enjoy yourself. The breakfast for 2 is very expensive and the mezes are what i would call condiments.  The pancakes are the best I ever had.  Lunch sandwiches/wraps are excellent and a very good value.<br>Salads are nicely done.", "pics": null}}, {"review": {"des": "We passed by Gundi on a walk & decided to try it out one day. We managed to get there today for lunch & I'm so glad we did. This place is a true gem. It was absolutely delicious. The ingredients are super fresh, the meals delicious, the atmosphere friendly & the wait staff were excellent. This has the potential to be my favorite place! <br><br>Will be back for brunch, as that looked fantastic!", "pics": null}}, {"review": {"des": "This place was highly recommended to me and we also watched the segment of The Gundis on Check Please. <br><br>This place is absolutely a new favorite. <br>For starters we had the Grilled Halloumi Cheese and Baba Ganoush (recommended from Check Please). I could have eaten a whole plate of the Grilled Halloumi Cheese, but luckily I had someone with me to split it. I also am particular when it comes to trying Baba Ganoush since I have only regularly had it at friends houses who cook authentic Turkish and Lebonese food, and this Baba Ganoush was delicious! It is served with their house made bread they make daily and these crackers that were delicious to dip with it! <br><br>For our main dish, we had the Crusted Îsot Salmon and the Mardin Special with Lamb. I love anything with Lamb but this dish was the best lamb dish I have ever had. The tomato and yogurt sauce made the dish ignite with flavor that complimented the lamb and eggplant nicely. Now to the Crusted Îsot Salmon, I am not a fish person by any means, however my date mentioned he wanted to try \"from the sea\" section on the menu. I settled for the Crusted Îsot Salmon, served with rice, roasted vegetables flavored in a butter sauce. <br><br>I also tried Kurdish coffee, which happens to be decaffeinated and pistachio creamy flavored. I could have had at least 10 cups of it! <br><br>I will absolutely be back here, the atmosphere and the staff are friendly and fun. I hear their brunch is spectacular and I have to come back to try their Red Spicy Lentil Soup!", "pics": null}}, {"review": {"des": "This is our favorite restaurant in Chicago and a favorite in the Lakeview neighborhood. Everything is delicious!<br>Our favorite dishes are the Couscous with Chicken, the Crusted Isot Salmon with mashed potatoes, Baba Ganoush, the Red Lentil and Goat Cheese Soup, and the Burned-Bottom Milk Pudding.  The service is wonderful- the waiters so nice, friendly ,and attentive. Looking forward to trying the brunch someday soon!", "pics": null}}, {"review": {"des": "Having seen that The Gundis opened in early 2017, and that it was the only Kurdish restaurant in the general area, I was looking for an opportunity to try it out. My opportunity came this week when another friend couple and my wife and I decided to coordinate a Thursday night dinner. After parking the car, we walked in and were taken to our seats. My wife and I really liked the art, decor, and ambiance which has a Kurdish theme but very modern or contemporary as well. <br><br>Hungry as could be at 8 pm, we ordered starters including halloume cheese, the sampler (basically mezza) which includes octopus salad, ezme, hummus, and baba ganough with Kurdish bread, and the Mediterranean salad. Everything was delicious and balanced. Drinks included apple fruit belt and ayran (salty yogurt beverage). <br><br>We then ordered the main entrees and split it family style: Adana kabob (I would recommend getting this spicy), lamb sac tawa (delicious and akin to stir fry for those who aren't sure), and stuffed chicken (the spicy cream sauce is amazing). <br><br>For dessert, we ordered baklava and rice pudding. In addition, the group ordered traditional black tea. <br><br>Overall, a great place to take friends and to enjoy a nicer Middle Eastern experience.", "pics": null}}, {"review": {"des": "This place is so good! The staff was so nice to me and my friends even though we stayed for so long. Also the limitless tea is so fun. Everything we tried was so good and I will definitely be back", "pics": null}}, {"review": {"des": "Their Isot salmon is one of the best salmon dishes I have ever had (they only serve it at dinner though). The decor is modern and sleek and very spacious. The portions are very large and make the price tag of the mid to uppers $20s very reasonable. I take my parents and friends here whenever they are in town because it is one of Chicago's gems. Highly recommend!", "pics": null}}, {"review": {"des": "This place deserves every star. We stopped by here around 6:30pm on a Saturday and were able to walk right in and get a seat. By 7 they were only on reservations and had to turn everyone away. <br><br>We started with the appetizer sampler which was delicious. My boyfriend has a gluten intolerance and when they saw that he wasn't eating the bread they asked if everything was okay. To our surprise they had gluten free bread which he said was wonderful. We shared the stuffed chicken which I can't say enough good things about. I'm already thinking about getting it again. <br><br>Grab a reservation here and see why it's so well rated. You won't be disappointed. We can't wait to come back!", "pics": null}}, {"review": {"des": "I've been to the Gundis 5 or 6 times now, and I have to say it has been consistently high quality food with great, healthier options. I love the black pepper lemon garlic shrimp which comes with a delicious side of rice and roasted vegetables. The stuffed chicken is also a star and the dish I often recommend to friends, it is packed with flavor and comes with a delicious creamy tangy sauce. Portions are ample and the food quality is great. This is a great spot for a double date, or a nice meal that won't leave you feeling bloated and overloaded with carbs.<br><br>Service is decent and has been getting better over the past 6 months as we've returned a few times. Unfortunately, their prices have been steadily rising as well which is why I will put 4 stars instead of 5. I remember first coming here and being so impressed with the quality of the food, the uniqueness of the dishes, and the very reasonable prices. Entrees have gone up from $12-18 into the $25-30 range and many dishes listed with \"Market Price\". I'm not saying they're not worth it, as these are absolutely high quality dishes with high quality ingredients, and as the place has gotten busier and more consistent it only makes sense to charge more. The last time we went, the place was absolutely packed and had several people waiting outside in the cold to be seated. Tables were turned around within 10 minutes of being cleared, so business is definitely booming here and you will most likely need a reservation to get a table.<br><br>As a semi-frequent visitor it is a little disappointing that this place has gone from a casual date night spot to more of a special occasion. Regardless, I will be back for that tasty, tasty shrimp and chicken.", "pics": null}}, {"review": {"des": "Wow, lets start with the apps. Hummus was fresh and clearly homemade, roasted vegetables were tasty and seasoned perfectly. We knew the entrees would not disappoint. The zaza shrimp and goat cheese pasta was amazing. The sauce was spicy but not hot. The stuffed chicken with roasted vegetables and rice was my favorite.  The rice pudding with apricots is a must have...<br><br>Finally the wait staff were excellent very attentive but not obtrusive. Room is very laidback, they are not trying to rush you out the door..We will definitely be back..", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lk9RLag_oLrY-SHrsWQdcw/348s.jpg", "caption": "Bye bye stuffed chicken"}]}}, {"review": {"des": "Great food with a great staff.always a table to sit at with prompt service.also has a big menu to choose from.", "pics": null}}, {"review": {"des": "Delicous food w great service !<br>You will get what you want, a real taste of kabab.<br>Try it, you will never regret !", "pics": null}}, {"review": {"des": "Came here for dinner on Wednesday and the food was amazing, service was just as amazing. There were three of us and we tried three dishes, chicken lamb and fish. All plates were made perfectly and the flavours were so fresh. <br>Decided Sunday to come here for brunch with friends cause it was so good for dinner... and let me tell you, once you have brunch like this your never going anywhere else. Just look at my pictures. We ordered the sharing meals, we got two because there were 4 of us. Look at the pics... that's all o can say. The amount of detail in the food, the presentation, the flavours, the variety of jams and spreads, better then any place I've gone to that charges triple the price. They had a cheese platter, fresh bread, almond butter, French fries, it just didn't stop. If you have the opportunity to have brunch this week go here without hesitation. Best food best and service in the city. The staff is so nice and welcoming, they treat you like family.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4xVDWsurkw-CpOZ_UNQwTw/168s.jpg", "caption": "This is the jams, butter, olives, almond butter... better then anyplace I've been"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HauZ3_xPvtLA00j0U-0DLA/168s.jpg", "caption": "This was a meal for 4 people... how we finished it I don't know, all I remember was it tasted amazing!"}]}}, {"review": {"des": "What a great find!  We tried The Gundis for brunch and thoroughly enjoyed the meal.<br><br>The restaurant has a nice vibe, not so much an ethnic joint, but a more current decor suitable for the area.  Our server was attentive and helped up understand some of the spices on the menu.<br><br>For brunch, we enjoyed the Kurdish breakfast.  The meal for two is served with eggs prepared with veggies or meat, fries, tomatoes/cucumber, 3 types of cheeses and a tray with an array of toppings and condiments (jams, honey, olives, butter, Kurdish butter).  We asked for some bread and the meal came with Kurdish tea.<br><br>If you want something more lunch like, there is a selection of chicken, lamb and meat items along with vegetarian options.  In addition to coffee and tea, there is also wine and beer options at reasonable prices.<br><br>The food was tasty and the warm atmosphere made a first Kurdish experience memorable.  We plan to be back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Bt6IxBV_apMB03LP5crQkA/348s.jpg", "caption": "Yummy brunch"}]}}, {"review": {"des": "For me, this restaurant started out quite good and exciting but kind of fell flat. <br>The ambiance and service is very good here so the evening was off to a great start. They make their bread in house and it's absolutely delicious! (We paired it with the baked cheese appetizer) <br><br>However, the main courses were disappointing. I tried the lamb shish as well as one of the pastas. The lamb was not very flavorful, the rice a little too dry, and they paired it with a salad that was far too acidic which made the whole dish fall apart. The pasta was even worse-- it literally tasted like sauce from a jar mixed with pasta noodles, nothing special. <br>The portions for all of the entrees were relatively small as well. <br><br>Overall, it's a beautiful space with great service. But the food from its main menu is overpriced and mediocre.", "pics": null}}, {"review": {"des": "My friends and I had to come dine at Gundis. It is the first Kurdish restaurant that opened in Chicago. I tried out the dew, a traditional Kuridsh beverage.  I have tried it before and this is the best dew I have had. I ordered a chicken turkish wrap. It came with a side of roasted potatoes and a yogurt dipping sauce. After the main course we had the kurdish tea with sugar cubes and  kurdish baklava. If you are hesitant about trying this desert, you definitely have to.<br><br>It is by far the most incredible baklava desert I have had. It has plenty of honey and fresh pistachios along with figs in the center of the plate. Check it out if you are in the neighborhood. If not, make the trek to Lakeview and eat here. You won't be disappointed.  5 stars!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_BJn3JTJ5dRXOGiEt2VQZg/348s.jpg", "caption": "Kurdish Baklava"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zR4CC9eQFsTaa-NhVmZxiQ/168s.jpg", "caption": "Kurdish Chicken Wrap"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PEJT1dYmV8VM8IrwYgOzYA/168s.jpg", "caption": "Restaurant interior"}]}}, {"review": {"des": "Best Kurdish Restaurant in town.  I would recommend for breakfast or  lunch everything is delicious. Very clean place and friendly staff.", "pics": null}}, {"review": {"des": "Their service is HORRIBLE. I have been here three times since January, and wow, they haven't improved at all. This rating is based solely on their customer service. The food is good.<br><br>The first time I called to ask when brunch ended bc I forgot (my boyfriend and I enjoy it), the call was answered promptly. When I called back to make a reservation, it took about 7 calls for them to pick up. Well, I let it go, and still made a reservation. When we were running about 15 minutes late, I tried calling again to let them know. I called 9 times. Let that sink in. Someone answered, but hung up on me. And then didn't answer again after that. I called 17 times in the span of an hour and the calls were answered twice, and another time I got hung up on. I actually counted how many times I called because I was shocked. I've never experienced this before. That is horrible customer service. <br><br>I like their food. I really do, but this kind of service is what would make me never return. Please straighten this out.<br><br>The service is always slow and unattentive but I brushed it off because they were new. You aren't that new anymore, and you should be working out the kinks. It seems like they brush off all criticism which really sucks. Seems like business is doing decently well for them, which I think is well-deserved considering the food, but customer service is half the experience.<br><br>I wanted this to reach the appropriate people so that they can take this seriously. I really enjoy their food, and I will be back. It's just that when I do want it, I have to take into account if I'm ready to deal with neglectful servers/people. Please improve so I can love coming here.", "pics": null}}, {"review": {"des": "I'm so glad I discovered this place. My partner and I anticipate becoming regulars here as it's located super close to his apartment. We came for dinner for the second time last night, and here's what we've tried so far:<br><br>Red Lentil Soup with Goat Cheese - Red lentils topped with creamy goat cheese and served with toasty bread. I have a particular affinity for lentils (and goat cheese for that matter), and this did not disappoint.<br><br>Stuffed Chicken - Stuffed with spinach and goat cheese, and served with rice in a spicy Kurdish sauce. I loved this so much. I tried to branch out and try other menu items during my second visit, but couldn't resist ordering it a second time.<br><br>Lamb Sac Tawa - A relatively small serving of rice surrounded by plenty of meat and veggies..but mostly meat lol. I only had a couple bites of this, but it was flavorful and delicious.<br><br>Jumbo Shrimp - Shrimp, rice, and roasted vegetables seasoned with lemon, garlic, and another familiar spice that I couldn't quite put my finger on. Up to par with the other two entrees I've tried. Beginning to believe this place can do no wrong.<br><br>Burnt Bottom Milk Pudding - Not too sweet, and the burnt bottom adds a really nice touch. Texture is similar to flan.   <br><br>To top it all off, you can get a bottle of wine for $24...which is what we did lol. Outstanding.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5UhW8knVN6rec79YgXvQqA/348s.jpg", "caption": "Jumbo Shrimp"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tBDEdVb0UuQHVAIJ-rvMhQ/168s.jpg", "caption": "Burnt Bottom Milk Pudding"}]}}, {"review": {"des": "This place, I don't know where to start, nice upscale feel, lovely serve ware. The food was amazing, I had the lamb burger which was so succulent and yummy!!! The coffee, if I were to be deserted on an island with one food source, I will ask for this coffee, the flavor of the pistachios was so delicately present in each sip!!! I can't say enough good things about it. The staff were very attentive and kind too. Must eat here at least once in a life time and blessed are those who are able to have the coffee every day", "pics": null}}, {"review": {"des": "A chic Kurdish restaurant in Chicago? Count me in! I was really impressed by this place. The decor is clean, a rustic/modern hybrid of sorts. The waitress was super friendly and helpful. And all the food was delicious, fresh, authentic, and presented really well. As somebody who frequents middle eastern jaunts fairly often, this is much appreciated.<br><br>All of the meze were delicious and on point. The bread they brought out was fresh and crispy. The mardin stew and lamb sac tawa were so good, especially the lamb. The adana kebab was pretty good. <br><br>They even have salgam, this root vegatable-based drink. Not the most refreshing thing in the world, but super authentic! I've never had kurdish coffee before, but it's somewhat creamier and crushed pistachio topping was a nice retreat from the usual turkish coffee!<br><br>Great to see such a well-run spot surpass all my expectations.", "pics": null}}, {"review": {"des": "Ordered baba gounsh as the app, one lamb shish and one lamb shank for entree! The app was amazing, very tasty and refreshing, especially with their homemade pita bread chips. The chips are extra thin and crispy. Lamb shish are strongly recommended. It's tender and fully seasoned. Even if you don't like the smell of lamb, this dish won't fail you. <br>I used to go to Greektown for Mediterranean food. But this place beats  the Greek town hands down. Will come back again if I get a chance!", "pics": null}}, {"review": {"des": "The best place in Chicago, excellent food, excellent service and nice staff. I will definitely go back there again.", "pics": null}}, {"review": {"des": "The Gundis took over one of the shuttered storefronts on this lively section of Clark St. and turned it into a lovely modern upscale restaurant. While this neighborhood has lots of bars and grills, mexican, asian and pizza restaurants, Kurdish cuisine is a brave new world for the local diners. I have dined here twice and the food is exquisite. The spicy lentil soup is a sight to behold and is pureed to point of being completely smooth. It has a complex flavor from the spices added to it. I have also had a salad with chicken and it was fresh and tasty. The second time I came I had a pasta dish that was so good I could not believe it. The waitstaff are reserved, but pleasant and the kitchen is accommodating to deletions and additions to their plates. From the the quality of the food it is obvious that someone cares about what is sent out to their guests.", "pics": null}}, {"review": {"des": "My husband and I visited The Gundi's for sunday brunch. I had the Gundi omelette and he had the soft scramble with Soujouk (beef sausage). We also ordered sides of Olives and cheese. He decided to try the Pear and Date drink, while I had the Kurdish Tea. <br><br>It was all exquisite! The ingredients they use are SO fresh! We've been to other joints that are Known for their fresh ingredients, but they lacked in every other area; The Gundi's is The tea was just great, not the usual tea bag stuff. The date and pear drink was really light and refreshing. <br><br>The scramble isn't the traditional scrambled egg, but it won't disappoint. <br><br>Overall, very pleased with the meal... It was light yet heartening... Service was warm and friendly. Will definitely be coming here again.", "pics": null}}, {"review": {"des": "I visited The Gundis tonight and thoroughly enjoyed my dining experience. The location is easy to get to and the interior is tastefully decorated. Service was inviting and attentive. They also have great vegetarian options. I ordered the Zaza Pasta Tofu and absolutely loved it! The flavors were very unique and the ingredients tasted super fresh. I would definately recommend this spot for your next date night!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/huKwx0eLZLQBnpjx_H9t7Q/348s.jpg", "caption": "Zaza Pata Tofu"}]}}, {"review": {"des": "Absolutely delicious! <br><br>Quiet weekday brunch (we were the only customers for about an hour) in a bright and airy restaurant, sitting by one of the large windows. Servers were attentive and friendly. Brother and colleague each ordered the lamb soft scramble, served with fries and a bread piece, and I got the Zaza omelette, served with fries. Delicious. The spinach and the tang of goat cheese with those onions inside. I could have eaten another whole plate. I heard the Kurdish coffee was also delightful. Can't wait to return and try  their other selections.", "pics": null}}, {"review": {"des": "It's the best place the get a proper brunch. <br>The quality is awesome. The Sojouk is delicious they even make it with Halal meat. The staff is friendly and very respectful with a cute sense of humor. I love this place. Me and my husband go there regularly and every time we enjoy it more. The restaurant atmosphere is lovely. They refill their delicious tea as much as you want. <br>Don't miss out. Go and make a great time with your loved ones. I absolutely recommend this place. Enjoy", "pics": null}}, {"review": {"des": "Very underwhelmed and frankly disappointed in my meal here. Came in on a week night for dinner around 7:30 and it wasn't too busy. The place is nicely decorated and the food around us looked good. We ordered:<br>  Meze sampler - the best dish of the night! No joke, should have just ordered 3 of these and called it a night. The octopus salad was the only thing that was a little too salty. Otherwise so good and the bread yum. <br>  Spicy red lentil soup - pretty good, but \"spicy\" really meant peppery here no real heat kick. <br>  Lamb Suc Tawa - big portion of meat, veggies and rice. Decently seasoned but really didn't have a wow factor....Especially when it's $23+.<br>  Mezopotamia - the real disappointment of the night. So BLAND. Literally no seasoning. Another pricey entree that missed the mark big time<br><br>Interested in coming back to try the brunch, seems like a way better deal. Won't be back for dinner.", "pics": null}}, {"review": {"des": "We were lured by Check Please, and also by the high ratings by Yelpers.  And, we were not disappointed........well, maybe a little.  But to start with the positives (which are considerable) the decor is very pleasant and the service impeccable.  Our two entrees, the stuffed chicken and lamb shank, were outstanding.  The flavors were subtle yet intense and varied, and the meat was cooked to perfection.  The rice and veggies that came with the chicken were perfect for soaking up the sauce, and the mashed potatoes went very well with the lamb.<br><br>We were a trifle disappointed with the appetizers, especially after reading so many good things about our choices.  We got the cheese and the baba ganoush, which were just OK.  I much prefer the presentation at Greek restaurants, simply because the cheese is flamed table side and is therefore still somewhat melted.  This was very flavorful but the texture was a bit unpleasant.  And though the baba ganoush was good, it was not as good as we thought it would be.  We love baba ganoush and have had it many places, and this was just a trifle better than average.  <br><br>But we will definitely return here, as the entrees were fabulous.", "pics": null}}, {"review": {"des": "I have no clue what are all those positive feedbacks that are raving about the food are all about?? I mean the food there was not only very expensive for what you get but is just not that authentic and lack taste and creativity. Take for example the stuffed chicken breast with cream sauce ($25) I don't know if this has anything to do with Kurdish cuisine !! This is like a 101 chicken recipe from an amateur cooking website.... when did the Kurdish people have this French style old school recipe with spinach mushroom and cream in their cuisine ? <br><br>The hummus is not that good at all .... the packaged cedar brand at Whole Foods taste way better so that's a shame. <br>Overall I couldn't justify the price for what I got or for how authentic and tasty the food was .... will never recommend to my friends nor go back there again.", "pics": null}}, {"review": {"des": "Open for just about a month or so The Gundis is a true family restaurant serving somewhat unique and tasty Kurdish-ish cuisine. It's a true family endeavor with the Kurdish husband, California Mexican American wife and her chef father all partnering to deliver a delightful dining experience for you.  The open brick walls large front windows, high wood beam ceilings and pillars make the ambiance comfortable and contemporary. Nice chill crowd. It fills up later as it gets a lot of Landmark cinema pre and post movie crowd. <br><br>Denissee, the wife and partner managing the front of the house is one of the nicest, sweetest young ladies I've come across in some  time. She radiates her happy, welcoming infectious vibe.  Ella, our server was a wonderful as well, has no shortage of opinions on what to recommend and why. She's efficient, helpful and very friendly.<br><br>I didn't know exactly what we ate but it was the Kurdish named dishes. All were fresh and tasty as was the hummus appetizer. The Spicy calamari was a real surprise.<br><br>The house goat cheese rolled in soft mini crepe with honey, pistachio figs etc baklava was a perfect end treat. I also appreciate that they give you a portion of 6 versus a portion of 3 which makes sharing a little easier on a fourtop. <br><br>I heard the brunches are excellent and I believe they serve them on Sat and Sun.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ozVa7KIE0JMTePTyLY0rOA/348s.jpg", "caption": "Forgot the name but lots off tasty stuff on a huge plate"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jLl4avko8QhXbj-m7Y_4nQ/168s.jpg", "caption": "Spicy savory calamari"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Mh3ISJK3kayzq7NR4RPuBg/168s.jpg", "caption": "Fresh hummus"}]}}, {"review": {"des": "The food: 4/5. It's the first Kurdish restaurant in Chicago. We tried fried cheese, octopus salad, mardin special with lamb and stuffed chicken. Their strong point is definitely the freshness of their ingredients and the sauces. The fried cheese was nice and light, the salad was very fresh although it could use more octopus. I loved the sauce that came with stuffed chicken and the sauces with mardin special, but the lamb was a little dry. <br><br>The service: 5/5. The service was prompt and friendly. <br><br>Overall: 4.5/5. Good food, good service. I'd go back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ow8g8DQMrJFMvxlVa64Rgw/348s.jpg", "caption": "Octopus salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YA5eDf4xmMgv6CxWktfGzg/168s.jpg", "caption": "Mardin special"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jgNd96c2QvKrF1nn0XpDCw/168s.jpg", "caption": "Stuffed chicken"}]}}, {"review": {"des": "This upscale Kurdish restaurant is definitely a neighborhood gem, for those lucky enough to live nearby. Variety of Kurdish and Turkish traditional dishes, with ample proportions. Loved the appetizer platter. Our favorite was the Ezme Walnut tapenade! The Zaza shrimp with rotini, tomatoes and goat cheese was Heaven!  The lamb and veggie Sac Tawa was tender and plentiful. We finished our meal with Kurdish coffee and tea, along with a shared rich, dense square of chocolate ganache cake. Service was impeccable, prices were moderate and fair for the quantity and quality of the food. Decent wine and beer selection. Loved the exposed brick and industrial accents. Will def go back and try a few new items!", "pics": null}}, {"review": {"des": "Amazing!  I booked my reservation based on other Yelp reviews - so glad we tried this place!  My husband and I both loved it, and we'll definitely be going back.  We ordered the appetizer sampler to start - very large portion for 2 people - LOVED the Octopus Salad!  My husband ordered their Stuffed Chicken - clean plate club!  It was both buttery and light (is that possible?) - easy to see why that is their most popular entree.  I had the Beef Shish (first time I ever noticed entrees that had \"shish\" and \"kebab\" separately - who knew?!)  The beef shish was amazing - soooo tender and flavorful.  Portions are large - we took home leftovers.  In regards to a previous reviewer indicating a \"full bar\"; they had a large selection of beer/wines, but, not mixed cocktails.  Our waiter (Marco/Mario?) was super helpful and friendly.", "pics": null}}, {"review": {"des": "This restaurant was amazing. We came here for an early dinner on a Friday evening after work. We ordered the baba ghanoush as an appetizer. It was delicious, especially with the crackers and bread. We ordered two entrees, the Zaza Pasta and the couscous. Both not only complimented each other very well, but were so tasty. The pasta sauce was so flavorful, the couscous was such good quality, and the roasted vegetables were to die for. To drink, we both had reds that went very well with everything. To finish, we had the Turkish coffee. It was amazing. I hope to get to experience this lovely place again.", "pics": null}}, {"review": {"des": "Such a great place! Fresh, delicious and light. Service was great. Good wine list. This is an amazingly solid neighborhood restaurant. I highly recommend the grilled calamari and the honey salmon. Delicious!!!", "pics": null}}, {"review": {"des": "Had a beautiful lunch here today.   Service was excellent and the decor and ambience warm and stylish.  Try the fresh beet salad and the baklava...delicious!<br>It was truly one of the nicest  dining experiences I have had.  Too good to miss!", "pics": null}}, {"review": {"des": "Wow, I love this place! The food is so fresh and interesting w. exotic dishes and spices.  I'm glad to see the mid Westerns supporting this place.  Try the yummy tea served in the authentic tulip cups. I've introduced all my friends to this place and they love it as well. Great job, Gundis!", "pics": null}}, {"review": {"des": "This was a nice new try in Lakeview. Went with a group of friends and everyone enjoyed the experience. I highly recommend the stuffed chicken as the perfect combination of savory and spicy.", "pics": null}}, {"review": {"des": "This place is awesome. Their octopus salad and beet salad are a must. We also ordered the veggie sandwich with chicken, which was also great. The service is excellent and the food is delicious. Definitely going again!", "pics": null}}, {"review": {"des": "We were lucky that all the downtown restaurants were booked and ventured out a little to this Kurdish restaurant.  The salad with octopus was well prepared and spicy.  The lamb shank was excellent.  The flavors were surprising and delicious.  You have to try the Kurdish coffee!!!", "pics": null}}, {"review": {"des": "Beautiful atmosphere and great service. Had the lamb shish, which was a bit over-spiced for my taste. I prefer lamb more naked but for someone looking for something more flavorful, this could be a great choice. The side salad and rice were both delicious. Will definitely be back.", "pics": null}}, {"review": {"des": "The coffee is amazing!!! we came back just to drink it. The service is great and the food good. This is a place worth visiting more then once!", "pics": null}}, {"review": {"des": "Went for brunch before pride parade with 3 friends. Ordered the breakfast for two: soft scrambled eggs with soujouk (beef sausage), along with two regular dishes of scrambled eggs with beef. The breakfast for two combo came with unlimited black tea, bread, 3 sides, and 8 spreads. Cheese pieces were really good. The cucumbers and tomato slices were refreshing to eat with the eggs. There was a variety of spreads for the bread: honey, butter,  green olives, black olives, fig jam, apricot jam, cherry jam, and sesame butter. I love the fig jam and they kindly gave me an extra dish. There were also thick fries - not super crispy, more soft. I'm not a huge fan of potatoes, so didn't eat as much.<br><br>The waitress was super helpful and chatted with us since we were the first few people there. Tips she gave included keeping savory and sweet apart, eating the fresh cucumber and tomato slices with the eggs, and the fries had a special spice they put on all the dishes.<br><br>Very filling meal. Getting the breakfast for two and then another dish of pancakes to split amongst four people is more than enough! We sort of over ordered, so it averaged around $20/person, but you can definitely have a hearty, healthy brunch for under $20 here.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HK74Oc9bTUZFKj4BiqStwg/348s.jpg", "caption": "Breakfast for two: scrambled eggs and soujouk"}]}}, {"review": {"des": "Solid, mostly healthy brunch. I got the baklava crepes, which were a bit too sweet for me (which is saying something - my sweet tooth normally knows no limits). The soft scramble with soujouk (sausage) fared better. Definitely try out the drinks - I don't even LIKE coffee and I liked the spiced Kurdish coffee. My friends devoured their date and pear shake, and I quite enjoyed the cucumber lemonade. Definitely more savory that sweet, and absolutely worth a try.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/o-VFYXwGsGI5z5Gub3XXeA/348s.jpg", "caption": "Cucumber lemonade - very refreshing!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GcfDiQfgfxo8yaYaogmxng/168s.jpg", "caption": "Kurdish coffee - so cute and tiny, so yummy"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0CzZIGDW_-21Smtr2RWgSw/168s.jpg", "caption": "Baklawa crepes - a bit sweet for my taste, but still good"}]}}, {"review": {"des": "This was our first time at The Gundis, and it was a wonderful experience. The decor is modern rustic with exposed brick walls and a nice, clean layout. We were greeting promptly and cordially at the front, and the waitstaff, especially Mehmet, were professional and knowledgeable. We shared the appetizer sampler, and each item was delicious. For mains we had the stuffed chicken which was very flavorful and properly seasoned. We also had the sea bass which was beautifully prepared and presented, a great dish. The beverage list had the usual Chicago favs for beer and a good assortment of reasonably priced wine by the glass and bottle.<br> Overall, we had a great time, and Gundis Kurdish is a great addition to the neighborhood. Those new to Kurdish food as we were will enjoy the Mediterranean flair. We will certainly return.", "pics": null}}, {"review": {"des": "A great find! I had brunch with a friend who recently moved to the area and we were both blown away by the quality of food, service and ambiance. I ordered the Kurdish Baklawa Crepes and the Kurdish tea. The crepes were plated beautifully and were delicious. My friend ordered the soft scramble and veggies which was also plated well and tasted amazing. <br><br>Definitely a place worth visiting!!", "pics": null}}, {"review": {"des": "The room is bright, clean, simple, but not boring.  The service is prompt, attentive, but not overpowering.  The food is fresh, clean-tasting, interesting, and flavorful.<br>But best of all is Mehmet, the nicest man who made sure we were happy. He brought treats and information about the food.  I hope he's there every time I return.", "pics": null}}, {"review": {"des": "Its been a while since I gave a Chicago restaurant 5 stars but I think this place deserves it.  We went here last week on a Sat night for a 6 pm reservation party of 8 adults 2 kids and we were seated promptly.  The place has this modern middle eastern feel which I really liked.  <br><br>Our server was Ela and I cannot be more happy with the service quality that she provided esp we were such a big group.  I was not really expecting great service based on some of the reviews I read so I was pleasantly surprised.  <br><br>Having traveled to Istanbul, Dubai and Abu Dhabi I can say that I have a real appreciation for very good authentic middle eastern food.  I really haven't found a middle eastern restaurant in Chicago that makes me want to go back over and over again until this one.  We ordered the following<br><br>Appetizers<br>grilled calamari - ive tried so many grilled calamari and this is one of the best.  <br>baba ganoush - real authentic<br>halloumi - good but a bit too salty for my taste<br>red lentil soup - yummmyyyyyyy<br>Mountain salad - so much flavors in every bite.  <br><br>Entree<br>salmon -my favorite<br>sea bass  - light and tasty<br>mezopotamia - i dont really eat lamb but when I tried this, it was melt in your mouth good.  <br><br>Dessert<br>BAklava - its not your typical baklava, its one with a twist and it works pretty good.  <br><br>We ordered more dishes but these are the stand out ones in my gastronomy book.  Needless to say, there was no dish that disappointed me and the entire group really liked this place.  The entree prices are not cheap but the servings and quality  make up for it.  I hope they dont make the servings less as they become more successful as time goes by.  Ive seen this in a lot of restaurants who become greedy for profits.  <br><br>I really recommend this place and will be back.  Ill make my reservation through Mehmet (I hope you remember our password Mehmet:) and will always ask for Ela as my server.  I also provided some feedback to the owners about how there are some challenges when making a reservation over the phone, hopefully they can address that.  I would also recommend that they publish their entire menu online,  I only see a subset online.", "pics": null}}, {"review": {"des": "Absolutely excellent!<br>This is a great find. The food is very tasty.  If you're looking for something refreshing and delicious definitely stop in here.  Waitstaff are friendly and responsive.  I will definitely be back again.", "pics": null}}, {"review": {"des": "We went here for brunch and the service was incredible. The food was OK. I thought it was a little bit heavy and there weren't enough light flavors, like vegetables, to offset that heavy meat flavor in my opinion. If that's your thing though, you might really like it. They had some really interesting meat too. Check it out!", "pics": null}}, {"review": {"des": "Tried this place since I was near and I noticed that it offered options of vegetarian and sea food. <br>They do not have parking but I parked right in front of the restaurant, the cost for parking is 2 dollars per hour so not bad. <br>I did not make reservations ahead but when I got there, we got seated right away.<br>Once seated our server who I do not think he gave us his name or maybe he did but he had a soft voice I probably did not hear him. <br>He and a couple of other servers came around our table to make sure we were OK so that is a plus for me.  <br>As for the decor, it is simple yet looks very attractive and I like the openness since one wall is just windows.  two others are brick and the last one had some nice paintings. <br>As for the food, the Crusted Isot Salmon had a great taste and I enjoyed it, the Kurdish Baba Ganouch for starters is a must, yummy. <br>and the Stuffed chicken had an awesome taste with its tasty dressing. <br>I liked the Dark Chocolate Mousse and Pomegranates. <br>The overall experience was great.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BSAYmSxoGBtVskeVE4LMoA/348s.jpg", "caption": "Postcard with your receipt"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tyNX0Wb7e7sARfLelQy4uw/168s.jpg", "caption": "Like the decor in the wall"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oqBefoFDp1qu540MlGW37w/168s.jpg", "caption": "Dark chocolate mousse with pomegranates"}]}}, {"review": {"des": "We were looking to try something new and this was the perfect place! I can't wait to go back. I tried the stuffed chicken. Firstly, it look beautiful. Secondly it tastes just as good as it looked. It was rich and flavorful. I will get it every time I go. We also ordered the humus to start which was also very yummy and came with warm pita. We asked for more and they. Brought it out right away! My friend ordered the cucumber lemonade. If you are looking for a nonalcoholic drink get this!! So delicious! We also ordered Sac Tawa. If you like lamb, it was also very good. This place is so great for a date night, a social gathering, or even a nice place to bring your family. I cannot wait to go back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GCpmU9eBw3_gsVtqWVbj4g/348s.jpg", "caption": "Suc tawa, this is a lamb dish that was very moist and yummy!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/brdAL_Ll8neRvKKk6sooVw/168s.jpg", "caption": "Stuffed chicken was to die for. The sauce is so rich and creamy. This was my favorite meal."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8jlMkpH-YPjgLVfNCp0Cog/168s.jpg", "caption": "Mardin special if you like eggplant this is for you. You can pick your own meat to go inside."}]}}, {"review": {"des": "By far the best Turkish/Kurdish breakfast I have had in Chicago<br>Love the soudjuk omlet and the pastry that comes in the very beginning. DELICIOUS!", "pics": null}}, {"review": {"des": "Fantastic food and service, would highly recommend! The beef shish wrap and gundi omelet were extremely flavorful and filling, especially considering the price. The Kurdish tea is bottomless and the waiter was so generous to give us another cup when he noticed we were sharing. Will definitely be coming back, hopefully to try the dinner menu!", "pics": null}}, {"review": {"des": "The food was good, not great, and if I were to rate the food alone it would warrant 4 stars.  However, the food was not worth the price.  Additionally, our server was uninformed about the wine selection and acted unprofessionally and condescendingly, answering my query about a Cabernet Sauvignon by responding \"it tastes like wine\" and laughing.  I will not be returning.", "pics": null}}, {"review": {"des": "A side trip within \"Middle Eastern fare\" - Kurdish cuisine - that strikes unique notes. Elegant, hospitable waitstaff; accessible menu that is so easy to overindulge on; sexy, distinctive atmosphere. Go here!", "pics": null}}]}