{"name": "theory-chicago-2", "reviews": [{"review": {"des": "This is a place that has a great atmosphere and even better service<br><br>We had a group of 20 and they reserves a back portion of the bar for us and enables us to watch what we wanted on the  very large projection screen tv which was an added bonus <br><br>The service all evening was very attentive by both the servers as well as the hosts. Our group opted for the bucket approach and they kept the buckets coming in and out and made sure that we had fresh cut limes as needed<br><br>This was overall very good experience and a great downtown location with a large group and I would highly recommend if you're looking for the same kind of night out", "pics": null}}, {"review": {"des": "I've not a huge sports fan, so I will say I haven't spent a lot of time in sports bars. I went with two friends who were huge Patriots fans to this Patriots bar near our workplace for last Thursday's Colts vs. Patriots game. Even though I'm not a Patriots fan, and sports bars are probably not my hangout of choice, being at Theory for the game was a very cool experience and one I'm glad I had. There's something really fun and energizing about being in a room full of people who are all rooting for the same thing, even if you feel like you have nothing in common with most of those people. It's really interesting seeing how friendly people get when they feel like they're on the same team - one guy bought my friend a beer with no pretext, and that was really nice.<br><br>It's also nice that they give out little baby shots for every touchdown. I tried their cocktail \"A F****ng Good Time Ain't Hurt Nobody,\" which was also really good and you could actually taste the blueberries. I doubt I'd ever come here alone, but it seems like a solid sports bar. The vibe/energy is, as my Patriots fan friend would put it, \"this is a bar that so happens to like the Patriots\" and I think that sums it up well.", "pics": null}}, {"review": {"des": "Smaller bar restaurant. Went here for lunch. Inexplicably had the herky sticks and the flat bread. Two pizzas for lunch? Herky sticks are the bar's version of Gumby pokey sticks. Oh yes. Yummy. <br><br>Both were very tasty. Couldn't finish the flat bread and couldn't stop eating the sticks. Service a little slow for lunch.<br><br>10/7/18 edit: I did go back a couple weeks later for lunch. Service time was normal for lunch. I had the same BBQ flat bread but no herky sticks. Still couldn't finish it all.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gSxrqAVVMkoqAjohWSFotg/348s.jpg", "caption": "Chicago pokey sticks"}]}}, {"review": {"des": "We came here on a Sunday at noon to watch the Vikings game. It was pretty full but we were seated within minutes. <br><br>We started of with the $20 blue moon pitcher and boneless wings. You get about 10 larger nugget sized wings. We were able to do half garlic parmesan and half honey sriracha. I liked the garlic parmesan better than the honey sriracha. The honey sriracha wasn't as spicy as I thought it would be. I would say for both types I wish they had a little more sauce. They were coated but when I think of wing I want them drenched in sauce. The chicken itself was juicy and tender. <br><br>We also ordered the chips and queso. The queso was thicker than most but was still good. It had a slight kick to it. The chips fresh and not super salty.<br><br>Overall the food was good and the service was pretty good considering how busy it was. I would recommend coming early if you want to watch a game or have a large party.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mj0f1BtOYNItbrcuI1yTmg/348s.jpg", "caption": "Queso"}]}}, {"review": {"des": "Came here with a coupla girlfriends while in Chi-Town one evening. We all have different dietary needs (one lactose intolerant, one vegetarian, one pescatarian), but we were all able to order with no problem.<br><br>It was a beautiful evening so the doors were open, which was a good idea in theory (see what i did there), but there were people smoking right outside so it made the dinner pretty uncomfortable since we were seated closeby. The only seating available was high seating as well, which was a drag. I get the feeling Chicago loves high seating, though. We went out to eat quite a bit for about 5 days and everywhere we went had lots of high seating, which I abhor.<br><br>BUT ANYWAY, the food was really good and our server was friendly and patient with us. The fried pickles were fresh to order and piping hot (a couple tongues didn't quite make it, sadly...) but delicious. The nachos had the right ratio of topping per chip and the chips weren't soggy and limp like some places.<br><br>I got the fish and chips with tater tots and immediately regretted not getting fries when my food came. The tots were overcooked and hard--i left most of them on my plate. The fish was good but the none of the coating really stayed on.<br><br>My friends both enjoyed their meals, although i think one friend was a little disappointed in the beat flatbread. The flavors were good, but the actual flatbread was pretty limp, which made it difficult to pick up and eat comfortably.<br><br>All things considered, it was a good experience.", "pics": null}}, {"review": {"des": "A group of 4 of us stopped in for dinner on a Sunday night. Lots of activity in the street outside Theory with the club next door that had a line waiting to get in. Theory was busy, but not packed, so we got a table and placed our drink orders. There is a full bar with a decent beer and wine selection, along with all the other options. I got a martini, which was well crafted.<br><br>The menu has a good variety of options. I asked for the Buffalo chicken sandwich, but grilled instead of fried as it's listed on the menu. They accommodated me and it came out as I ordered it, but was a bit dry, so I asked for extra buffalo sauce, which was delivered for a small extra charge. My wife got the BBQ chicken flatbread, which was OK, but a bit dry also and slightly overdone on the edges. It had a pretty good taste, but could have used a bit more sauce as well. One of the others in our party got 1/2 Brussels sprouts salad, which was a nice combination with kale, bacon, and cranberries. She also got sweet potato fries, which were very tasty and expertly prepared. They were the best item we had. The other in our party got the Chicken Parmesan flatbread which was good - better on that night than the BBQ chicken one.<br><br>Service was OK. Our server was polite and attentive. She did inadvertently add one item on our bill that belonged to the people sitting at the table before us. The manager checked in with our table right when we realized that and promptly took care of adjusting it off the bill. He and the server both apologized for the error.<br><br>There were a number of TV's with the various sporting events of the night on, with pretty loud hip hop music playing. It was not so loud that it drowned out our conversation.<br><br>I'm between a 3 and 4 star on this review and going with the 3 as an 'A-OK' rating. We may try it again next time we're in the city to see if we have a better experience.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jVwa6ztSrmQMOaJ5rIFbWg/348s.jpg", "caption": "Grilled buffalo chicken sandwich"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fbNdux6JBMtQUF6gdmNTdA/168s.jpg", "caption": "BBQ chicken flatbread"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qfF86d-k3vmhw57vWU8BjA/168s.jpg", "caption": "Brussels sprouts salad with tasty sweet potato fries"}]}}, {"review": {"des": "Stopped in here on a Thursday night randomly for a quick drink. It looked warm and we were freezing walking around downtown ha. It was PACKED with people standing and sitting elbow to elbow watching the games. There are TVs everywhere and facing every angle which was cool so there was no way to miss any plays. The bar was so packed and luckily we grabbed 2 bar stools but could barely squeeze into them due to the close proximity of all the other stools adjacent and the people standing everywhere. The service was a little slow but made sense for one bartender and so many people. The drinks were just okay for the price. Walking to and from the bathrooms was an obstacle course ha. I can see getting here early and having a booth table could be enjoyable to watch the game but other than that too many people to enjoy yourself and definitely loud!", "pics": null}}, {"review": {"des": "Stumbled across this bar during a mini bar crawl and decided to pop in for some appetizers and football.  We LOVED the soft pretzels, buffalo wings, and the walking taco.  The atmosphere is lively, a bunch of TVs and food/drink specials. We will definitely be back for more football this season.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pmtuuLn7Zw6cTQ1FatxySA/348s.jpg", "caption": "walking taco and soft pretzel sticks with queso!"}]}}, {"review": {"des": "Came here on St. Patrick's Day this year right after the River was turned green. We choice this place because it didn't have a line. Security did a great job of siphoning out trouble. Zero fights. Festive green drinks. Parade of bag pipes. Staff was attentive. Pub food that hits the spot when drinking. We left around 2:00pm, and there was a line down the block. <br><br>Came here one other time this year after the Parts Town Convention. Service was still spot on. <br><br>10/10 would come here again. Great place for a date or groups.", "pics": null}}, {"review": {"des": "Such a great place! Very fun and hip atmosphere. My husband got the steak tacos and I got the Mac and cheese flatbread (I know it sounds crazy but OMG was it good) they have an excellent craft beer selection as well. Really enjoyed this place and will recommend to others!", "pics": null}}, {"review": {"des": "I chose this sports bar primarily because of its veggie food options as most of my friends coming were vegetarians. It worked out perfectly as it was not too crowded, too loud, or too busy. We had the table for the evening, lots of appetizers and drinks, watched our game from multiple angles, and didn't have to yell during conversations.", "pics": null}}, {"review": {"des": "We really enjoyed the food and drinks while watching the Phil Michelson vs. Tiger Woods match. They have great, plentiful TVs and the ambiance was much more enjoyable than a typical sports bar.", "pics": null}}, {"review": {"des": "Best bar in the city of Chicago. I went with a friend and we had Hillary during the day and Michelle at night Bartending. They were so gracious and made us feel welcome.  It felt like one of my home town bars.  I would def come back", "pics": null}}, {"review": {"des": "We came to theory to watch the Michigan football game and were able to make reservations for 8 people. The service was great, especially since the bar was so busy for the game. The food we got was all good, but would highly recommend the tater tots- they were spectacular!", "pics": null}}, {"review": {"des": "When I first came in to Theory for lunch, it looked like a really cool sports bar with a ton of specials for every day of the week! Thoroughly enjoyed the ambience and I was advices to order their chicken wings! I got myself the Garlic Parmesan wings with also tater tots on the side! When the orders came in, I received four huge wings pulled on top of my tater tots. Overall the food was nothing special, little salty so you can't really finish up your whole entree. Definitely worth coming back here though if you're just looking for a nice area to enjoy some games with some drinks. Otherwise, there are definitely other places in the city worth heading to for some better quality food.", "pics": null}}, {"review": {"des": "This was my boyfriends and my first stop when we got to Chicago. We got the Totchos. They were amazing and so crispy with the works on what is on a nacho. Next he got chicken fingers and fries and I got the General Tsao boneless wings and they were all delicious. The drinks were also great. I got the spicy strawberry margarita which is 33oz and amazing. Would definitely go back to this restaurant.", "pics": null}}, {"review": {"des": "In Theory, Theory would be a good sports bar in the suburbs, decent food, lot of tv's, fun atmosphere. But in river north it is not holding up. I was at Theory many times in the past but hadn't been back in a few years. Before I thought it was fine, decent bar food, lots of beers lots of t.v.'s. Not a place I would go and eat a meal, mostly a place to watch a game and maybe split some apps. I don't remember why I stopped going but I hasn't walked in the doors in a while.<br><br>Until recently. I was there for one of the NCAA basketball games, Kentucky was playing. I went after class with someone from my class who went to Kentucky and just wanted to see the end, I decided to go for a beer. Service was terrible. Waitress did not want to be there, kind of rude when I asked for water after my beer and a refill. Just seemed like I was bothering her.  Me and the other dude were laughing at her attitude.<br><br>I went maybe three weeks later with our whole class. We had a big group and as soon as we got there they stopped us from moving tables together. They said it was a fire hazard and stopped us. Once someone in the group said okay we can go somewhere else they let us move the tables. All of the tables were against the wall, we were just moving them together. We got the same waitress, again she was awful. I only ordered water, when I asked for a refill I got a \"really\" look. A few people complained about her attitude. They screwed a few of the drinks up. <br><br>This place is not worth it, much better places to go in the area.", "pics": null}}, {"review": {"des": "We were in town from the west coast and asked for a game from the Pac 12 network. Joel couldn't have been more accommodating. The food was excellent, ribs get a high recommendation. Music and environment fantastic. Don't miss this when in town. <br><br>We continue to grab a meal at Theory whenever we are in town. It's awesome every time.", "pics": null}}, {"review": {"des": "This place takes care of Pats fans!  We are in Chicago from Boston for a conference this week and heard about this \"NE Patriots bar\" for the game last night. Great place, great food, TVs everywhere and the staff and manager couldn't have been more accommodating.  Would highly recommended!!", "pics": null}}, {"review": {"des": "Located right next door to Mother Hubbard's, these two sports bars couldn't be more different.  While Mother Hubbard's has a dingy, divey, pool playing, frat boy feel, Theory is dark and lounge-y, a little more dressed up, almost Vegas-type feeling.  You'll get folks in sports gear but also collars and sweaters, skirts and heels.  If this is more your vibe then you'll love Theory.<br><br>Knowing that bars were going to be busy for the NCAA basketball championship game, we looked online for a place that took reservations. <br> Lo and behold, we came across Theory.  Reservations made, we walked over and were instantly given our table.  There were plenty of TVs all around, which were quickly changed from baseball and hockey to the big game.  What I didn't like was when the bar played loud music during pre-game, commercials, etc. and only went back to the TV sound for the game itself.  Maybe that's just me.<br><br>Service was very attentive, and we were greeted by various managers and staff members throughout the night.  The menu has something for everyone ranging from typical bar food to salads to burrata.  Likewise, drinks range from $4 PBR to sangria and cocktails.  The food was good - nothing to knock your socks off - but better than your average bar.  I'd  recommend the totchos - not just your typical stadium cheese but homemade queso and a bit spicy.  Good stuff.", "pics": null}}, {"review": {"des": "I was visiting from the New England area and met Joel at a tailgate he was hosting at solider field. He was very welcoming and hospitable. He told us to check out his bar after the game and we did. The food was amazing, service was great, and the Patriots atmosphere made us feel like we were at home away from home. If you're in the area i would absolutely recommend that you stop by. ( not on a Sunday if you are a bears fan during football season though haha)", "pics": null}}, {"review": {"des": "Awesome menu selection that can literally satisfy any palate. Love their rice bowl as that is my go-to with chicken. They have an amazing turkey wrap that is filled to the brim and seasoned fries that remind me of Arby's, but better. Pretty fairly priced and well worth it above all else. Definitely check this place out.", "pics": null}}, {"review": {"des": "This is one of my go to bars to watch NBA games. There's always decent daily drink and food specials and friendly bartenders.  On Mondays there are $5 drafts and $6 svedka cocktails. I ended up ordering the New York sour ($11) which basically tasted like bourbon and red wine mixed together, not what I was hoping for. The Tochos ($10) however, were some of the best loaded tater tots I've ever had. Good portion sizes and the addition of guac was great. I hope to try some of the other cocktails next time and hope they turn out well!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Ir_iitSBad2_txnj2yUI1A/348s.jpg", "caption": "Totchos"}]}}, {"review": {"des": "Wanted to watch the baseball playoff game but they kept changing the sound back and forth between a football game and it was really annoying and then at 9:30 after the football game was over but it was only the 7th inning for the baseball game they started clearing away all of the tables around us like as if they were closing and trying to kick us out. Eventually turning off all of the TVs except 2 of them and turned this place into a dance scene with loud music. It was completely empty! We eventually left at the 9th inning because we felt so awkward with the way they made us feel. As we left there were lines up and down the block for all the other bars but no one was interested in this one. Wish they would just stick with the sports bar theme and not try to be both a sports bar and night club. It felt lame. Also very expensive and very weak drinks. Go somewhere else to watch the game.", "pics": null}}, {"review": {"des": "Nice place to chill out. Good bar food.<br><br>I went for happy hour and was pleased with the drink selection. I got the pizza sticks which were okay 3.5/5, and a burger 4/5. The food isn't spectacular, but good for bar food standards. The atmosphere is what pushed it to 5 stars. Very relaxed, not too loud. Lots of TVs if you're going to watch a game.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jCjhyUZFgnhyaBXvxNRotA/168s.jpg", "caption": "Burger"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/D8j9GQ1UDQcirKkpVJPQaQ/168s.jpg", "caption": "Pizza sticks"}]}}, {"review": {"des": "Overall: Great spot for a typical sports bar option for general food and drinks or game day. It knows the audience and caters to it well.<br><br>The good: Went during lunch with some coworkers and the experience was great. They take online reservations which was clutch and the service was fast and friendly throughout. No slipups whatsoever. The food is your standard bar fare, but it was all great and the portion sizes are good. The prices are downtown-based, but that was expected. Plenty of TVs all around. The kale caesar I had was plentiful and tasty.<br><br>The not-so-good: They were playing their top-40 chart music too loud. It was hard to have a conversation at times. Again, we were there for lunch, so I'm sure it's different at night or during game days.<br><br>Atmosphere: 8/10<br>Service: 9/10<br>Food: 8/10", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zSoxwUXV30P1BJtnPvFTtg/348s.jpg", "caption": "Kale ceasar salad"}]}}, {"review": {"des": "In town visiting and was looking for a bar to watch our Kansas City Chiefs. Found this place and couldn't be more pleased. They welcomed us in even though they are a Patriots bar and we met Brian (originally from Lawrence, KS...Rock Chalk) who chatted up KC sports with us and made us feel right at home. If we lived in Chicago (we live in DC) we'd be here every week!<br><br>Also...order the Totchos!<br><br>Well done Theory!", "pics": null}}, {"review": {"des": "Had dinner here last night. It was really great food and the atmosphere was just right. It looks to be set up more as a bar than a restaurant in my view, which I liked, but since we had children in our group I was a bit hesitant. As it turned out the place was perfect and the kids fit right in without changing the atmosphere at all.  I could tell they were comfortable too. <br><br>Their pizza was very good (not deep dish though) and the other dishes that carried past our table looked tasty. There are plenty of good restaurants on the block for sure, but I do recommend this place if your in the area.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/o38siFUGpxhDg8oPQnSHKg/348s.jpg", "caption": "Pizza time!"}]}}, {"review": {"des": "So I was in town for family fun and had a chance to watch Sunday NFL games here.  Jared and Joel are super cool accommodating and will do everything possible to play your game on one of the very many TVs.  They have a nice beer selection and great wings.  Without question I'll be back next time I'm in town, for sports or just a great place for food and drinks.", "pics": null}}, {"review": {"des": "I love Theory!! I am so happy that we stumbled upon this place during our time in Chicago. If you're a sports fan, specifically a Golden State Warriors fan, this restaurant/bar is a must. <br><br>Came here for Game 4 of the 2017 NBA finals (Friday, 6/9/17). We showed up about an hour and a half early and luckily secured the LAST table available. This place filled up super early and super quick. It's known to be a Golden State Warriors bar, and has been that way long before they started winning championships. Our server told us that when the owner opened it up years ago, he picked two of the worst teams in sports to follow. GSW was the NBA team that was chosen. I do not remember what the football team is for sure, though I believe it is the Patriots. Everyone here is cheering for the Warriors, so other fans: Be wary. <br><br>Before the game, TVs were playing miscellaneous sports channels. Theory has countless TVs. You're bound to have a good view of at least a couple no matter where you sit. Once game-time hit, every TV was plugged into the game, and to my delight, they played game audio whenever it was on! During commercials, they would switch the audio to music. The music was on point. They had a good commercial break playlist. I liked their system. Makes it even easier to know when the games back on after commercials in case you get distracted.<br><br>Top notch basketball sports bar atmosphere aside, Theory served me one of the best pulled pork sandwiches I have ever had. Seriously, it might be my favorite of all time. I scarfed it down in about a minute. It was big and substantial, too! Lots of meat. Great flavor. I'm craving another one as I write this. The house smoked pork shoulder with bbq sauce was to die for. The drinks were also good. I had myself quite a few beers while enjoying the game.<br><br>Theory was easily one of my favorite restaurants/bars that I went to all trip. It has the BEST pulled pork sandwich around, for sure. The beers are good, the vibes are good, service is quick and attentive, and everything else is pretty perfect. Go ahead and check this place out!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iNhycFbHYI-ScSPke6c41Q/348s.jpg", "caption": "The pulled pork shoulder was seriously to die for. Possibly my favorite of all time!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VRSs5OFSSKJyk-j-7VVwDQ/168s.jpg", "caption": "Pulled Sandwich - $13"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WNGESFTa8bPW6uZQ4SkizA/168s.jpg", "caption": "Wings"}]}}, {"review": {"des": "The music is very loud here - mostly hip hop and some rap. If you are over 30, you will hate it. <br><br>The food was good, but was impossible to have a conversation.", "pics": null}}, {"review": {"des": "We love visiting Theory when we are in Chicago!  My husband is an Iowa Hawks fan and there is no better bar to watch the Hawks play!  We live in San Diego and visit once a year.  We are always greeted by Joel, the owner, who is an outstanding host and so appreciative of your business!<br><br>The bartenders are cheerful and do a great job keeping up with the crowds needs.  The food is great and they have great drink specials during game time too!<br><br>Thanks Theory and Joel, see you next year!", "pics": null}}, {"review": {"des": "Great food. Have nfl ticket with plenty of tvs. Service was quick and efficient. Really enjoyed Sunday games and food. Food here was a bit higher  end than your normal sports bar. Drink menu was very robust! Bloody Mary was underwhelming vs what was advertised. However, the rest was great!", "pics": null}}, {"review": {"des": "We were in town from Dallas and prior to our trip, we Googled \"Best places to watch a Bears game\" and this place showed up as an\" upscale\" place to watch a game, which couldn't be further from the truth. When we arrived, we were stuck in the back room forced to listen to a soccer match on the big screen while the Bears game was showing on only 1 of 4 available screens. To make things worse we were told it would be at least 30 min until ANY game would be on the speakers. Within 10 min of that announcement we noticed people leaving the back room, surprised that a room full of football fans would be held hostage to 2 soccer fans.<br>Later we got a table in the main dining area and we then were told that this was actually a Patriots bar, which is not what was advertised, at least not on Google.<br>To their credit the food was good, but a tip to management: if you want to be a Patriots bar then just admit it, don't give out of town Bears fans the impression that you're something else. We spent a lot of time looking at places and picked yours for a reason, albeit a false one now that we've been there.", "pics": null}}, {"review": {"des": "Amazing food, their wings are a must try! My personal favorite is their Parmesan Garlic sauce but their buffalo is good as well. The atmosphere is cool and hip with great music. Next time you're in river north and looking to get a bite to eat, make sure to check them out!", "pics": null}}, {"review": {"des": "Such a fun spot for Boston sports fans! We had the pleasure of chatting with the owner when he came around to our table (nice touch). Watching the Pats and Sox win might have had something to do with it too. The other patrons were great, the service was timely (even though the place was jammed), and the food was uniquely awesome. Will definitely return next time I'm in town.", "pics": null}}, {"review": {"des": "After searching for a sports bar on YELP theOry caught our eyes. Theory has a sports/lounge bar vibe to it, with multiple flat screens to catch the game of the night with a DJ playing oldies to new hits. The boyfriend and I came here to watch the 2nd game of the Cubs vs. Yankees and what a game. <br><br>As soon as we walked in we were greeted by the hostess and seated right away. It doesn't matter where you sit, you will get great view of the game. As soon as we settled in our seats our server approached us for our order. We got our usual favorite draft Stellas and the Herkey Sticks with pepperoni, the description on the menu stated that these sticks were an Iowa City favorite so we had to get it. I love their binder menu with thick elegant off-white sheets, the first page in the binder had the daily specials and easy to switch the pages.<br><br>The Heckery Sticks finally came and they looked just like the flat bread pizzas I used to get back in the days in the NYC Public School lunches. They tasted just like them too with cheap cheese and hard bread, how is this an Iowa City favorite? Besides the food not being a great hit with us everything else was, from service to ambience this place got it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MYfOTz7cS4CoocjR-nJ7mQ/168s.jpg", "caption": "Herky Sticks an Iowa City Favorite"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xsbOpqK5TWVr4xLknYJLqQ/168s.jpg", "caption": "Binder Menu"}]}}, {"review": {"des": "This place is incredible. The perfect spot for lunch dinner or an awesome night out. Got to meet the owner Joel and he's such an awesome dude.<br><br>Get here now!!!!", "pics": null}}, {"review": {"des": "Popped in to catch an NBA game. The place was crowded but since it was just me, I crammed myself into a free spot at the bar.<br><br>There are a lot of good beer options here, both bottles and drafts. The bar service was great, even though the place was crowded. The food here was a real let down - expensive and not great. I ordered a side salad that was beyond plain and wings that I did not even finish half of because they were just gross. The people sitting on either side of me did not finish their food either, both complaining the different items they ordered were not good. <br><br>Another con to this place beside the food was the noise - it was just incredibly loud - the music was up way too high during the game and since people were already loud for the game, it was just too much.", "pics": null}}, {"review": {"des": "Theory is what all hip River North sports bars want to be minus a rooftop. I came in lunch and the easily accessible spot was buzzing with the latest pop music and the cubs game on their HD flat screens. The ambience can fit multiple occasions as I'm sure the sangria pitcher deals will allow for a girls night or the wide variety of cocktail drinks with beers will allow for a bros night or casual date/meetup. There's even an outdoor sit area allowed for people to sit and eat facing the street if desired. <br><br>The menu has a variation of bar foods with a high class twist on them. I had what I considered to be a bougie beef sandwich. AKA the Theory beef sandwich where like the traditional Chicago style Italian beef sandwich you may add your choice of peppers, but the Theory rendition comes with a French dipping sauce on the side much like traditional French dip sandwich but with a delicious Swiss cheese melted to perfection in the sandwich. As for sides you get your choice of tots or fries, which I am sure neither would disappoint. Seasoned french fries always have my heart, but I definitely plan to return to try the totchos (nachos made on tater tots). If you want less bougie I'd go for the wings. I tried the parmesan garlic wings, which by taste I can tell was made with chicken that was a bit unfresh seeing the extra chewy and overly brown parts of chicken underneath the batter..although still edible due to being seasoned in a way that a rookie's tastebuds wouldn't notice (unfortunately I'm no rookie). The wings were humungous if you order the large order and so thickly battered and covered in oil and high-grade parmesan you will enter a food coma right at the table if you don't get a doggie bag. <br><br>The manager came around and asked us several times about our experience, which due to the attentive service was wonderful. I feel like this is a place that all our welcome to enjoy a game and a well stirred moscow mule. Once they master the wings, I'll choose them over BWW.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zFlWK_7Y132B9s_SH8TFLg/168s.jpg", "caption": "Garlic Parmesan wings with vegetable sides"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bpB4YeKplIt2TpygOz1jyQ/168s.jpg", "caption": "Theory Beef sandwich with seasoned fries."}]}}, {"review": {"des": "Great food, drinks and service. Love the fried pickles and coffee old fashioned. Our Wisconsin crowd was grateful for the Iowa hospitality!", "pics": null}}, {"review": {"des": "A top flight sports bar serving very good pub fare. Very attentive service too. What's not to like?", "pics": null}}, {"review": {"des": "Had so so so much fun tonight at theory! We are from Iowa and sadly our Hawk did loose tonight but the staff and company at this bar was so great! Super fast and efficient service and the food was GREAT! Huge props and we will for sure return when we are back in town! <br><br>Ps. Huge shoutout to our waitress Bree! She was fantastic!! <br><br>GO HAWKS", "pics": null}}, {"review": {"des": "We got here late afternoon on a Saturday.  Looking for a spot down the street from the downtown condo and decided to check Theory.  My wife and I knew this spot was great for brunch and a late night spot but didn't know how good the lunch food was. <br><br>Since it was still lent, the wife and I decided to get the Totchos (half Tots, half nachos and tons of deliciousness) and tacos (shrimp for the wife and fish for me).  <br><br>The food came out and the totchos just melted it or mouthes. It was Tots, cheese, jalapenos, guacamole and sour cream.  Just think about those ingredients and start drooling now.  They are too DIE for! <br><br>The tacos were on point for an American spot.<br><br>What I'm raving about this place is the service!  They are all friendly and couldn't have asked for more.  They were attentive yet not overwhelming.  They knew the right amount of time to check up and when they did so, they were friendly and polite. <br><br>We definitely would recommend this place and visit again!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mIkEev3vATBGFY1RLyxryQ/348s.jpg", "caption": "Totchos...Tots + nachos = delicious"}]}}, {"review": {"des": "Pro's, enjoyed trivia night. Decent arrangement of televisions for sports viewing.<br><br>Con's, the food is not only awful. Even if you are looking for down and dirty bar food . . . awful. It is also shockingly overpriced. $12 for what amounts to a soft pretzel. Which came from a bag. Sliders who's meat has been cooked to 200 degrees. And the worst part, pink chicken. Pink. Chicken.<br><br>And the service is miserable. My chair and most chairs I tried to swap with were 78% broken.<br><br>The place rounds to dark and dirty with overpriced, undercooked and generally crappy bar food. With trivia, which was fun.", "pics": null}}, {"review": {"des": "We came here during the first night of the MLB playoffs (cubs v nationals). But we were actually trying to watch the World Cup qualifier match. The hostess was very friendly accommodating and found us a table in front of the soccer game, the only thing was we had to share a table with another couple-which we didn't mind at all! <br><br>Food was amazing. My husband had the honey sriracha and buffalo wings and I had the kale Caesar. We do plan on returning to theory.", "pics": null}}, {"review": {"des": "This is a River North sports bar. Enough said. Can get tourist-y. Typical bar food and drinks. TVs. Decent prices and service. I've ended up here on random occasions with friends, dates, and coworkers.", "pics": null}}, {"review": {"des": "Such a great bar! 90's music, baseball games, great food, great service! Sangria pitchers were fabulous. Love it!", "pics": null}}, {"review": {"des": "The best spot to watch a game or grab brunch. Joel, the owner, is the best and always so friendly when we come in.  This is the place to be for awesome music (90s, 2000, top 40, hip hop). Always has a great DJ. We've been going here every year for the past 8 years for St Patrick's day celebration too. Definitely one of my faves in River North.", "pics": null}}, {"review": {"des": "Theory Sports Bar and Grill - Not your typical Brunch spot here in Chicago, but definitely worth the try!! Outstanding service, ask for Robyn or Rebecca! The Fried Chicken on a homemade biscuit with honey was amazing! Their take on hash is spectacular! The \"From the Border\" had a great full taste! The half order was perfect for Viv Davis - Not often you can find a bar that has great brunch, but that's exactly what Theory is!! Make your reservations on Open Table and give these folks a try!!", "pics": null}}, {"review": {"des": "Went in on a Tues. We were seated immediately and had a very friendly waitress. The food was great. We had a Greek salad ( came with hummus and pita) and a cheeseburger with fries. It was all delicious. As stated the waitress was friendly and attentive. The manager checked on us too. Perhaps the attention was due to a slower night but we were pleased. There are a lot of TVs spaced around for sports lovers and everything was reasonably priced.", "pics": null}}, {"review": {"des": "We had an amazing experience at Theory!  We reserved the back room to watch the Badger Game on a Saturday afternoon.  It was perfect for our party of 12!  The staff was so attentive and kind.  The food was great -- everything we ordered was delicious (shout out for the fried pickles, totchos, and bang bang shrimp!).  We highly recommend and definitely will be back!", "pics": null}}, {"review": {"des": "Come from Texas, the bartender was super nice. They also had a good amount of veggie options. Not much but good enough. Shots came out super fast. Good was good.", "pics": null}}, {"review": {"des": "I have visited Theory several times since I wrote last time. I have continually been impressed by the service here. They always go above and beyond to accommodate. For example, squeezing in extra people to a reservation, another time giving my group the back room to watch the Hawks game. The servers are always so nice and friendly, even though this bar seems so bro and douchey. The food has also been better since my first visit.", "pics": null}}, {"review": {"des": "Decent food. Great service.  <br><br>However, here's my reason for the 1 star.  Came here to watch NCAA football National Champ game.  During the national anthem before the game, Theory decided that playing gangsta rap music was the better choice than honoring our country and flag.  <br><br>Don't be afraid Theory.  There are people who love and appreciate our country.", "pics": null}}, {"review": {"des": "I went here Friday after work and it was a pretty good place for a Friday happy hour. We easily got a table but it was pretty busy. They had $5 draft specials till 7:00. My friend and I split the tatchos and they were very good! Served with sour cream and guac. We split those and it ended up being our dinner because it was so filling. <br><br>We stayed till around 10:00ish and at that point the music was getting too loud to talk so we peaced out.", "pics": null}}, {"review": {"des": "Visiting from Florida and found this great place! Atmosphere was fun and staff was attentive. Food was aaaaaahhhhh-mazing!! The Mac and Cheese flatbread will give you all the feels. The totchos are also delicious!", "pics": null}}, {"review": {"des": "Very good food, excellent beer selection, and service to match. I had the Theory Dogs with tater tots. Very pleased.", "pics": null}}, {"review": {"des": "Great night. Came in to watch the first college football weekend of the season!  Manager Matt and our server Caitlin were excellent! The food was delish.  We ordered the Mac n cheese bites, bbq nacho bites and tacos. All were great!", "pics": null}}, {"review": {"des": "This sports bar had one of the best salads I have ever had! The staff was so nice and took great care of us. The atmosphere was super cool and will definitely eat here again.", "pics": null}}, {"review": {"des": "Went here January of this year... got recommendations because it was a Patriots bar. Not the greatest experience... Service was slow. Food we ordered was not good -  sriracha chicken wings was not tasty- sauce was not the right balance,  meat was of low quality...  and they even brought us cold soggy fries.  Ordered the bacon infused bourbon Bloody Mary... it was also meh.  Maybe it was just a bad day since heard good things about this place.  It was fun to bond with other Patriot fans though most of them were pretty drunk.  Haha.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/y-HvqcsveU2ZpGoj5tgecA/348s.jpg", "caption": "Sriracha chicken wings in the back and the bacon infused Bloody Mary"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hF3ATroQv357Xyn4fTeQvg/168s.jpg", "caption": "Bacon infused Bloody Mary and a Guinness... both mine."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LPye45-4ClSPxEcznjLJYg/168s.jpg", "caption": "Outside"}]}}, {"review": {"des": "We had a very enjoyable dinner!  The staff and owner very present and friendly. Food good. We will return next time we are in Chicago.", "pics": null}}, {"review": {"des": "It always a GREAT time here. The owner Joel, treats me and my chums like family. I come here on New England Patriots GAME DAYS to watch my team play on about 30 HD TV's. Theory is a Patriots bar - haters, kindly troll elsewhere.<br><br>Not your typical sports bar atmosphere. Part brick walled and part blue walls make it vibrant compared to the typical. The food is top notch too - very fresh and good amount of selections.", "pics": null}}, {"review": {"des": "Watched the Patriots @ Bears game here with a few friends, and we all had a fantastic time. Despite being packed wall to wall (standing room only), the staff were incredibly friendly and attentive. Probably the best service we had anywhere in the city during our weekend stay.", "pics": null}}, {"review": {"des": "Loved this bar! My first stop on my trip to Chicago. Went by myself while I was waiting for my girlfriend to fly in. All of the staff was extremely friendly and they have great specials. Got me a bacon avocado grilled cheese and tomato basil soup for $6 and it was delicious! The bartender Bree was awesome!", "pics": null}}, {"review": {"des": "Ummmm, Amazing food! We were greeted by The Friendly guy at the door. We ordered the avocado toast, burger, and kale ceasar salad.<br>Definitely will be back!", "pics": null}}, {"review": {"des": "The best brunch I've had since I moved to Chicago! The deal is fantastic, and I love that they offer multiple drinks in the bottomless package. Having the option to transition from mimosas, to sangria, to rose was fabulous. Danielle was a stellar waitress and our friends from out of town were shocked by how fast our service was. The Herky Sticks and chocolate chip cookie (in a cast iron skillet) were mouthwatering. This will definitely be my new go-to place!", "pics": null}}, {"review": {"des": "An easy recommendation! We just came for some drinks and a quick appetizer and half salad. Got the shrimp appetizer and the buffalo grilled chicken salad. All was seriously so good - nothing left! Great atmosphere and service as well!!", "pics": null}}, {"review": {"des": "This place is dope! Awesome brunch with bottomless mimosas, sangria, and bloody marys. The staff is awesome (shout out to Danielle from Cleveland who bravely works in a Golden State Warriors bar in Chicago). The breakfast nacho bites and nutella poppers can change lives. Go here", "pics": null}}, {"review": {"des": "5 stars means great food, great service, and great ambiance! <br><br>I can't believe that during all my visits to River North, I had never been to Theory until now! man, I've been missing out! My husband and I went in for a late lunch this past Saturday and it gave us a good opportunity to explore the menu, watch the Cubs, and chat with the servers...something you can't always do when it's packed! <br><br>We ordered the totchos for an appetizer and I think that's the BEST decision we made! I've had variations of loaded tots before, but these were perfection...I mean these are totchos after-all!!! The tots were cooked perfectly and not super greasy! They were smothered in some yummy nacho cheese (the consistency was perfect...not chunky and not too liquidy), diced jalapenos, and with guacamole and sour cream on the side. I would come in for just these!!! This could lead to a dangerous addiction! Oh, totchos...I love you! <br><br>For entrees, we ordered tacos; I had shrimp and the hubby had fish. The shrimp tacos were really tasty. The portions were huge. There were only 3 tacos and I at 1 1/2. Maybe it's because they double up the corn tortillas. Or maybe it's because I ate so many totchos! Haha!  The game plan for next time is to get the totchos and share an entree! <br><br>The service at Theory was great! EVERYONE was super friendly! My husband made a comment about the service maybe being good because it wasn't crowded. I beg to differ...I've been to many places where it wasn't crowded and the service stunk! So, great job, Theory on hiring individuals who actually enjoy being in the service industry! A smile goes a LONG way! <br><br>The ambiance is nice and they have a good amount of TVs for games. The placement is good too...you can see multiple TVs from most seats! <br><br>If you're in River North, definitely check out Theory...and the totchos...you'll totally thank me!", "pics": null}}, {"review": {"des": "Excellent service! They checked in with us 5 times to make aure the game we wanted to see was on a screen that was comfortable for us to see. Great food. DJ played good music during game's commercials. Nice atmosphere.", "pics": null}}, {"review": {"des": "Great party last week hosted by work friends. The manager and his staff were very accommodating! Will come back the next time I'm in Chicago.", "pics": null}}, {"review": {"des": "Great atmosphere, we were there for the FIFA finals and had the best time. The waitress and manager were very attentive and the drinks were delicious!", "pics": null}}, {"review": {"des": "We were here for the World Cup final, and in spite of how crowded it was the service was still excellent. Great food, too. I will definitely be back!", "pics": null}}, {"review": {"des": "Love this Place. This is my second time coming and I appreciate so much about this place. <br><br>Ordered: kill bill shrimp, bbq brisket bites<br><br>FOOD: phenomenal. The BBQ brisket bites are an incredible addition to the menu. The brisket is slow-cooked in-house. And very tender and flavorful. These have a bit of a bite, but nothing that will put you out of commission. <br>The kill bill shrimp is a favorite. Very crispy, and very hot (temperature). Also has a teeny bite--but again--nothing you can't handle, stud. <br><br>ATMOSPHERE: we went on trivia night. The trivia is fun, and actually challenging. No one seems to be cheating, so that creates an atmosphere of fun. Everyone comes up with great team names like \"drink apple juice because OJ will kill you\" or \"6:30 is the best time on a clock, hands down\", or \"the highest form of flattery is a plateau\". So if you are going to play, come with your best team name. <br><br>DRINKS: their cocktails are good and relatively strong. The first time I came, I ordered the Slow and Low (whiskey) and the In Heaven (gin). This past time, I ordered pear cider (I know, but I partied the night before so I was taking it slow). Either way, their drink list is extensive and is bound to have something for everyone. <br><br>OVERALL: Would recommend and definitely will return.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_e6R3CNKpOzwXSeYJ_Gfdw/348s.jpg", "caption": "BBQ Nacho Bites"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0Clx9eUbnnby_NleZ__BTw/168s.jpg", "caption": "BBQ Nacho Bites"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ymj-uKDVmOlzQTNZ875npQ/168s.jpg", "caption": "Kill Bill Shrimp"}]}}, {"review": {"des": "To be honest, I only found Theory because it was literally the only restaurant in downtown Chicago that had a reservation on OpenTable for 18 people on a Sunday for brunch last minute. It had 4 stars on Yelp, so why not go here?<br><br>I am sooooooooo glad I did! First of all, it is very spacious for a restaurant in the heart of downtown Chicago. They had my party of 18 at a long table by a private TV room (perfect for kids to play in!). Staff was on their game and very helpful (They even divided our large party's bill according to person/couple). <br><br>The food was good! My wife and I ordered the cinnamon donuts (Wow, we could have eaten an entire plate of those!) and the egg nachos. Both were perfect and satisfying.<br><br>Also, if three in your party check-in on Yelp, you all get a 15% discount on your entire bill. We did that and our entire party of 18 for the discount! <br><br>I definitely recommend Theory especially for a large party!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OzuAIBMyjTn--KmuIGvszA/348s.jpg", "caption": "Egg nachos."}]}}, {"review": {"des": "Always my go-to sports bar if I want to be downtown or really just want a chill night out. While they don't have a crazy selection of draft beers, they're decent and also have interesting bottles. The bar food here I've only tried a few times: the standard chicken tends and appetizers were just what the doctor ordered but not overly amazing.<br><br>Prices are relatively decent for downtown on Hubbard but more importantly, the service is the reason I keep coming back. Came here during March Madness and the owner made sure we had drinks and could find a place to stand when it was crazy busy. Love it.", "pics": null}}, {"review": {"des": "Recommended top sports bar in River North neighborhood and close to my hotel. Came to watch NBA Playoff games. Ordered appetizer of nachos and dip which were served immediately.  Waitress was very accommodating and offered great suggestions for drinks and entrees.  Burgers are served on fresh pretzel bun with multiple side options.  Bar will broadcast one game in surround sound and have plenty of televisions to catch another.", "pics": null}}, {"review": {"des": "What a Great Experience!<br><br>Food - Great!<br>Cocktails - Loved the one I had!<br>Staff - Awesome!<br><br>Cannot say enough good things about this place.  The owner, Joel, runs a very tight, customer-centric ship.  Busy day - World Cup! Place was packed to the gills, but not lacking for service or quality.<br><br>Food - There are many good items on the brunch menu - all looked delicious. We had a California Benedict and Avocado Toast - both YUM!<br>THE EGGS WERE POACHED PERFECTLY! TY! Kudos to Joel for having MORE THAN ONE NON-MEAT brunch option!! TY!!<br><br>Drink - I had the Aperol Spritz. Several times. Definitely going back for that drink!<br><br>Teamwork - best restaurant team I've seen in a long, long time!  We started off at one location with one server - ended up moving to another, better location. Gwen, the original server, switched our tab over to Sheila-no one had to ask her to do it - so professional! The bus was going around clearing plates and glasses quickly, quietly, and politely.  The entire staff was pleasant and professional and set a really good vibe in the place.<br><br>Attention to detail<br>Joel the owner got around to every single table and person at the bar to welcome them and ask how it was going for them<br>Once, when the owner was helping clear dishes from tables, he accidentally dropped something, the bus had it wiped up in literally seconds! Fastest ever time to clean-up I've ever seen.<br>The owner personally was managing the waiting line outside and working with staff to ensure safe headcount - we watched - he was soooooo nice to people.  As soon as he knew that space was low, he informed the back half of the line they were out of luck at this place.  (This is in contrast to another nearby place who held us in line for over 25 minutes knowing there were less than 10 available spots, making it more difficult to find a place to watch the game.)<br><br>This was one of the best restaurant experiences I've had in a long time - and technically it's a sports bar.  I will absolutely be back and will heartily recommend this place to anyone who'll listen.", "pics": null}}, {"review": {"des": "THE best place to go not only to catch the game, but for the food, drinks, service- this place knocks it out of the park!  Bonus points for charitably inclined bingo on Sunday's!  Wish they had one in my home town!!", "pics": null}}, {"review": {"des": "Extra star for how great the hostess was last night - super nice and helpful! Their happy hour specials were pretty awesome too. Overall, this is a pretty solid place to watch a sporting event seeing as they have tvs mounted literally EVERYWHERE you look. The menu is pretty typical bar food, with a lot to choose from. We started with the chicken nachos and they were perfect - I like how they arranged them into \"bites\" for easy sharing, plus they were just delicious! I also tried the boneless wings, which were decent, and also the fried pickles (I'd skip these next time). The food took a bit to come up, which was ok since we were in it for the long haul and drinks always came up quickly. Our server was very attentive too, always checking in and refilling our water as needed. I would recommend making a reservation or getting here early if you're planning to watch a big game because this is a popular spot!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/B0RKbdYtbVl5VCdmcx-Epg/348s.jpg", "caption": "Fried pickles"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fRTH20ToWhYnn2DERf8MuA/168s.jpg", "caption": "Boneless wings in a honey siracha sauce. Spicy!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BXGanuzRslBnAr--iwJ_VA/168s.jpg", "caption": "Chicken nachos - super tasty!"}]}}, {"review": {"des": "Excellent food and service. Robin was a rockstar. No kids menu but portions were more than enough. I had the fish and chips which were excellent. Keep up the great job!", "pics": null}}, {"review": {"des": "Theory is definitely a go to spot! Our waitress was amazing she went into depth in her explanation about each of the dishes we asked about.. we ended up getting half of the taco salad (which was still large enough for two) the hole in one burger and the kill bill shrimp which were unreal!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/f9wqeRBEm7wcoLqkDDDrkA/348s.jpg", "caption": "Kill Bill Shrimp"}]}}, {"review": {"des": "We started off with the BUFFALO WINGS. It was okay. They were crispy. Not spicy enough for me. Not spicy at all, actually. I like them hot, and this missed the mark. They were way too pricey for what they were, so 2/5<br><br>Then we had the HERKY STICKS. Doughy bread and super cheesy. I'd recommend, but I wouldn't come back since this is the only thing I actually like. Would've been better with herbs, though. And again, expensive for some dough and cheese. 3.5/5<br><br>My boyfriend got the FRENCH ONION BURGER and I was jelly, so I got it, too. It looked good, but Do. Not. Get. I'm sorry, but it didn't even come with veggies. I sat there for about 15-20 minutes waiting for my waitress so I can ask for some lettuce and tomato so that I can put it on my burger. She never showed up. When she finally did, I was over it and it was full of mayo and I already ate all the tater tots it came with, so I just wanted my bill and a to-go box for my left over herky sticks. *deep breath* Anyways, I sent the burger back and she took it off the bill. 1/5<br><br>They have a yelp check-in deal for 15% off. When I checked in, it said that THREE people had to check in at the same table to get the deal. It was only me and my boyfriend. It was a little annoying, but I thought the food would be yummy. I was wrong.<br><br>It was way overpriced, pretty underwhelming, and the service wasn't attentive. My boyfriend could've spent his $40something elsewhere.", "pics": null}}, {"review": {"des": "Would not sit me at one of three open, non-reserved tables at 4:30 in the afternoon because I was dining by myself. I was told to squeeze in at the bar where there were no available seats. I asked the hostess if I should just leave and take my business elsewhere and she answered yes. Pathetic! Not how to run a business. Will not be returning, ever.", "pics": null}}, {"review": {"des": "I'm not the type to complain about the volume of music in restaurants or bars but, WOW! If it is later in the night, after dinner then crank the music up. Unfortunately the music is on TEN any time you stop by this place. I hate yelling at the people I'm with when they are only a few feet away. Especially over dinner!<br><br>There are plenty of TVs showing a bunch of sporting games. <br><br>I would say the food is a little above average but I've only tried a few things. The beer and cocktail options are pretty standard but it's nothing to rave about.", "pics": null}}, {"review": {"des": "Can't say enough good things about \"Theory\" and the owners/employees.  Found this lounge after searching for the best place in Chicago (as I was travelling to Chicago for business) to watch the Patriots playoff game (found it via the Patriots Fan Club website).  I was extremely impressed by the quality of food, fantastic service, facility itself (not a bad place to sit or stand, especially with 35 TVs), and overall apparent attention to detail.  Much thanks to Joel and Team at Theory for making a New England guy feel right at home.  All staff were clothed in Patriots gear....even had Patriots cups to making a drink (or two) even more enjoyable.   Also appreciated the mix of music during commercials...kept a vibrant vibe throughout the games.<br><br>Highly recommend to others looking for a great location to watch a sporting event or just looking for a great place to get good meal and drinks.  Definitely recommend for Patriots fans from all over.", "pics": null}}, {"review": {"des": "It was my first time in Downtown Chicago and I went to Theory to watch the world cup. Very nice atmosphere there. The service is outstanding.", "pics": null}}, {"review": {"des": "Nice place. Lots of tvs. Trendy vibe more than a sports bar. Food is good. Bartenders were great. I would return but not really to watch a game.", "pics": null}}, {"review": {"des": "So good. Service was awesome and every single employee was very friendly and talkative, it does have more of a bar or hookah lounge vibe but doesn't feel at all uncomfortable. The steak sandwich was delicious and worth every penny of the $16, the fries were great as well. I think I might have to drive back from Detroit just to come here sometimes, it is that good! <br><br>Also, I have to note being a music producer, their soundtrack is awesome! I found out many employees here have ties to Detroit and you could feel that unique Detroit energy here, I loved the Eminem and D-12 tracks. <br><br>Keep it up guys you are doing all the right things.", "pics": null}}, {"review": {"des": "Owner is very personable. Service has always been great. Food is perfect for the setting. A must for any Patriots fans. Only suggestion is to accommodate a party of two with allowing reservations since you must have a party of four  to make reservations particularly on game days. My husband and I probably spend more money on drinking then most parties of four. Lol. Great place.", "pics": null}}, {"review": {"des": "The food was amazing!  We ordered a cheeseburger, flatbread, pasta and a salad. Everything turned out perfect and tasted awesome. I highly recommend stopping in.", "pics": null}}, {"review": {"des": "We came to this spot to watch the NBA finals and it was the right choice. The spot had an awesome friendly vibe and good food. The staff was awesome especially our server Rebecca! Cheers!!!", "pics": null}}, {"review": {"des": "We're not the easiest table and staff has made us feel at home! If you're gluten free and want bar food. Come here! Great ambiance, service, and quality food.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Yt0NdB0zkSHNm_qqz5Ex_g/168s.jpg", "caption": "A Moscow mule and local Chicago cider!"}]}}, {"review": {"des": "Good food and good service. I would come back here for burgers and fries. The appetizer nacho plate was also good.", "pics": null}}, {"review": {"des": "Great place to enjoy sports.  The owner is awesome and the staff is very helpful even when it is busy.  Even though I am a Buffalo Bills fan and they support the Patriots, I would and will come back here whenever I am in town. <br>Excellent menu and the Bloody Mary is fantastic!  It is a must go to if downtown Chicago.", "pics": null}}, {"review": {"des": "Atmosphere was great. Music was good and tried the Angry Bird cocktail drink which was my favorite! A bit small of a place but if you want just a lounge atmosphere in the city, theory bar is a good place to check in!", "pics": null}}, {"review": {"des": "Went for brunch, food was great. Service excellent. Met the owner and he is very nice.  Solid choice. Would be great place to watch a game.", "pics": null}}, {"review": {"des": "For a party of 8, we all ordered different brunch dishes and no complaints from anyone. The food is good and along with the service. The only thing i wish was the bottomless package was extended to 3pm instead of 2pm.", "pics": null}}, {"review": {"des": "Theory has a wide variety of drinks and a special deal on my go to drink (John Daley) and the food selections are fairly limited. It's also in a great part of the downtown area, with many food places surrounding it. However they do not have a rooftop and the waitstaff, during my visit, gave me the impression they wanted my group out of there as fast as possible. Hence, minus 1 star", "pics": null}}]}