{"name": "three-dots-and-a-dash-chicago", "reviews": [{"review": {"des": "Definitely a must go to in Chicago. Certainly one of my favorite bars in the city. It has an ambience like no other with the Polynesian theme and the drinks reflect such. The wait staff is friendly and make good recommendations.<br><br>I have tried a variety of cocktails at the establishment, and have rarely been disappointed. The few times I did not like the taste of the cocktail, it usually had so much booze that I absolutely did not care about it.<br><br>They have drinks with skulls on them indicating a level of potency and I highly recommend those. These drinks can get one drunk easily.<br><br>The food there is decent to, nothing to write home about.<br><br>I highly recommend getting a reservation prior to visiting the place as it is extremely popular and they do not have much seating.", "pics": null}}, {"review": {"des": "Three Dots and a Dash is a Chicago bar institution that everyone recommends and still continues to pull in a great crowd - it's unique, has super strong, inventive tiki drinks, and does have a really fun atmosphere. The drinks aren't cheap but they are strong, and so from a value standpoint I actually think it's relatively similar to other bars in the neighborhood.  There is a strong attention to detail in how the cocktails are crafted (lots of Instagram opportunities) and the bartenders and servers are generally invested in helping you find a drink that suits you. <br>Snacks are pretty good too and a little more reasonably priced, though I wouldn't come here just for the food.<br><br>Seating can be a little tricky here - highly recommend getting a reservation if you can or being prepared to wait a bit if you don't. We often would grab a small place at the bar to stand in and have a drink while waiting for somewhere to sit.  I liked the Three Dots and a Dash cocktail (rum, spicy from the allspice, and citrusy), as I like that it's not overly sweet and is definitely strong and the Painkiller (rum, pineapple, orange) which is very tropical, but, in general with the menu I'd go with what strikes your fancy.  I've tried a number of the drinks and I wouldn't say that they are all equally delicious, so, if you're with a group would recommend trying a variety of drinks in your first round so you and quickly pick which $15 cocktail is your favorite :)", "pics": null}}, {"review": {"des": "Cute tiki bar to go grab a drink or some appetizers! It's a cool bar to check out if you are visiting Chicago or have friends coming to visit the city. Every cocktail is served in a unique glass and well displayed! If you come with a group, you can order group drinks to share. Some of there drinks are pretty strong (the ones with multiple skulls on the menu). <br><br>The appetizers are small, so definitely order a few if you're with a group. Perfect place to grab a few drinks and appetizers while you wait on dinner reservations nearby! I wouldn't recommend this place for food since there are only about 10 appetizers/small plates on the menu (if that!). <br><br>The entrance is off the the side and you'll need to enter through an alley where you'll need to walk down a dimly lit staircase. If you love tiki bars and Polynesian inspired appetizers, this is the place for you!", "pics": null}}, {"review": {"des": "I wasn't too impressed for this being my first time here, I came for my birthday and thought we'd enjoy the nightlife. However, I wasn't too happy with the service. We arrived and couldn't get a table even though so many were available. But I was told we could stand and drink if we wanted. So after about an hour we just decided to sit because no one showed up.<br><br>The song choices weren't what I expected for a Tropical Bar, with a DJ. It was all Hispanic songs and no hits I have ever heard. <br><br>Also don't close your eyes even for a second, they had security on my friend within 10 seconds. This was around 1am, and she wasn't even drinking, but was told we can't sleep or close our eyes. <br><br>I didn't try their food, but there drinks are absolutely AMAZING!!", "pics": null}}, {"review": {"des": "This is one of those bars in Chicago that you just have to come check out once. As you enter down a dark alley lit by tiki torches, you open a door down into a flight of stairs decorated in skulls. If you don't have reservations, you can just go straight to the bar. There isn't too much space at the bar area either, so it was very crowded. This spot is definitely perfect for big groups though as they have many amazing group drink bowl (or should I say, ships?).<br><br>Either way, each drink is special in its own way here. Every cocktail is served in a cool and unique cup with its own twist. My friend ordered Cobra's Fang ($15) mixed with the deadly 151 and absinthe while I ordered the Mai Tai 2.0 ($15). Even though our drinks indicated how strong it was with a skull head next it on the menu, I didn't find myself too buzzed from it. You can definitely taste the alcohol, but nothing one can't handle.<br><br>This speakeasy tiki bar takes you to another realm. I love the atmosphere and unique twist to a fun, drinking spot. I'd prefer to come to this place in a large party though for a better experience.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HI1Nud33lk-govfGg9YMYQ/348s.jpg", "caption": "Cobra's Fang and Mai Tai 2.0"}]}}, {"review": {"des": "Very cool bar with a cute tiki bar theme. The place is off the beaten path in an alley so thanks to google maps for helping me find this place. <br><br>You know you're in the right spot when you see the tiki lamps in the alley and the bouncer lets you in. So you enter and go downstairs where you feel like you're going to be cast in an Indiana Jones movie. Lol. <br><br>So here's where the star was taken away. We got in and the place is half empty and the hosts tells us those empty table and lounge area are reserved. It's literally 4 pm and he won't give us a table. So we head to the bar and just kinda crowd near the columns and have a drink. The drinks are very playful on the tiki theme. They are very strong and you get your money's worth. <br><br>All in all I'm sure this place gets pretty crowded at night so get in early to secure a drink or two.", "pics": null}}, {"review": {"des": "This place is so fun!!! It's definitely not overrated in my opinion. If you can get in, or get a reservation, you have to do it at least once!! The environment is fun, the drinks are delicious (and strong, and expensive), and there are endless moments for Instagram pictures. I went here for my birthday with my husband and my best friend and it will forever be one of my favorite moments. I don't know how they managed to keep it an intimate setting with so many other people there, but it was wonderful. Keep in mind though, the drinks are really strong so if you have more than one, it's at your own risk. Learn from my mistakes.", "pics": null}}, {"review": {"des": "Super cool spot underground for a drink and some bites to eat. <br>They've done a really nice job at making the ambiance of this place a little creepy and cool with the skulls and tropical theme. <br><br>I love bringing out of town guests to this establishment. Drinks are awesome and can pack a punch. It can get crowded so be prepared for a small wait or standing room only.", "pics": null}}, {"review": {"des": "This is a cool speakeasy / secret bar hiding in plain sight.<br><br>It's got all the cool gimmicks: secret-ish entrance, winding stair well and a super intricate and detailed tiki bar layout. The only thing missing was the luau music and an unannounced tropical storm.<br><br>The drinks are good too. Most are based off of a rum recipe, but there are also other options, some that include bourbon and others that use gin. They don't skimp on any of their mixes so please pace yourself otherwise you might feel your sea legs start to slip.<br><br>I wish there were some servers in the main room. The night I stopped in was fairly busy and there was a log jam at the bar. I think things could have run a little more smoothly and some of us could have got our drinks a little quicker if there was some help.", "pics": null}}, {"review": {"des": "This place will make you blush and you'll find the lush side of you that you didn't know you had. Not to be compared to Lost Lake, this Tiki Bar holds its own. LOTS OF SPACE to socialize, DECORATIONS to view, and TROPICAL COCKTAILS to dine with. Our party of four was seated right away on a Monday night with no reservation. <br><br>Service was accommodating. Only one of us had been here, so the server gave us excellent recommendations. She told us the popular cocktails and her personal favorites. Just ask your server! The cocktails change with the seasons, and regrettable I forgot the names of our cocktails. We all had one cocktail and were done. Prices of cocktails are approx. $15. <br><br>This tiki bar is also considered a speakeasy. The lighting is dim and the music is pleasant. I am more than willing to come here with friends again to splurge!", "pics": null}}, {"review": {"des": "We came here for late night drinks and appetizers on a Thursday night. The place was crowded for a weekday, and we waited a few minutes for a decent table. We chose a few appetizers to share from the extensive menu. We had Hanali spring rolls, lanai luau chips, Thai fried chicken, and king crab rangoons. It's not often that I can say that each dish we ordered was great, but this is one of those times. The Thai chicken in particular was my favorite. The cocktail I had was the Intro to Agricole. This drink was sooo good that I almost had another but I'd had a couple of drinks earlier that evening. We liked the Tiki bar atmosphere as do many other people who hear about this place. Make reservations because it gets crowded.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/d1EP4h0F5rkR5k4yVkOPrA/348s.jpg", "caption": "Intro to Agricole"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JpVfztwUg9S-om14XDnx7g/168s.jpg", "caption": "Thai fried chicken"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HQkRIRWXbWiNOBk1iRDjGg/168s.jpg", "caption": "King crab rangoons"}]}}, {"review": {"des": "What a cute little tiki bar!! Don't be alarmed when your map takes you to an alley way, just follow the tiki torches. <br><br>- - A T M O S P H E R E - -<br>I've been here a few times now and it's always packed. They do watch their capacity so it never gets uncomfortably full. This tiki bar has fun and casual vibe that I love. <br><br>- - D R I N K S - - <br>I'm definitely a tequila girl and their Vicious Virgin definitely hit the spot. There's a bit of a smokey taste to it. <br><br>I also tried the Three Dots and A Dash which is their most popular drink. You can definitely tell because every single person had that in their hand. <br><br>Lastly, they have a bunch of group drinks that looked very fancy and were LIT...literally. <br><br>- - R E C O M M E N D A T I O N S - - <br>I wish I made a reservation ahead of time so I could sit down and enjoy the drinks. They do have a waitlist for tables but the wait time for this was about 2 hours and it wasn't guaranteed seating. It's a fairly small bar so standing around gets kind of tiring since there are no seats around the bar. <br><br>Overall, this was a really cute bar and I'll definitely come back!", "pics": null}}, {"review": {"des": "Amazing speakeasy/tiki bar to have drinks in. I loved the decorations and how each drink came in its own unique cup. <br><br>The shared drinks are definitely a showstopper - our group got the Bali Bali which came with an LED light and dry ice. You should definitely get one with fire/smoke - leaving a tiki bar without ordering one would be a sin.  <br><br>For my individual drink, I had the Painkiller which tasted amazing with the perfect balance between pineapple and coconut flavors.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Y8fcpRPfObLe8X6tvGxIEQ/168s.jpg", "caption": "Bali Bali"}]}}, {"review": {"des": "The honey loves tiki bars, and ever since finding our favorite tiki bar Hale Pele in Portland (early on in our 1 new state a month journey) we have tried to drop by an awesome tiki bar if we find something local.<br><br>Enter in Three Dots.<br><br>PDX Hale Pele and Three Dots are quite similar. Both are big with the kitsch - fancy smoke machines, beach tiki decor. Three Dots is bigger than Hale by like 3 sizes, so waiting out it the cold isn't really a thing. They also have an insanely fun skull wall, on that's lit up with blue light as you walk down the stairs after finding the tiki lit alley.<br><br>Not sure what it is about tiki bars and being down alleys. But it's a regular thing we seem to find.<br><br>So holding up the two, PDX Hale Pele comes out a bit ahead for me. They wear fun tiki uniforms and most of the drinks are set on fire with cinnamon. I also feel like the focus isn't as much on alcohol, but on fancy blended drinks in general.<br><br>Three Dots had only three mixes that could be made virgin, and the second drink I was made was so sweet it was almost undrinkable. The honey also felt that from drink to drink, the consistency of the alcohol amount in the mix wasn't the same, which was really a bummer. <br><br>All in all, I would say this is a definite spot to drop in if you're on this side of the states. But if you're on our side, you should absolutely drop by Hale Pele.", "pics": null}}, {"review": {"des": "I loved this bar!  From the moment we walked in from the alley and stepped under the wall of skulls, to the perfectly dim tiki atmosphere, this place offered everything I always look for in a tiki bar, without the toxic cigarette smoke.<br><br>We bellied up to the bar, and in no time at all actually scored a couple of seats there. Tables in the bar area are all reserved, but it took our friends no time after they got on the list to get one, even on a Friday night.<br><br>The bartenders were outstanding.  Friendly, and full of great recommendations. And the drinks - yum!  They made a killer Painkiller, and a to-die-for Zombie. Plus, they dressed them up right in interesting glasses with great garnishes. Also not to be missed is their signature 3 dots and a dash cocktail, in the wall of skull tiki mug.<br><br>They do sell tiki mugs - at $60 they are ridiculously over-priced compared to every other tiki bar I've ever been to, and yet, we still came home with 2.  Keep in mind that due to the quantity of booze in each drink, they are not cheap, so if you are a $1/drink tipper, don't bother to visit. Other than that, have fun and plan to catch a rideshare afterwards!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lNqTEXoZenxdI4YTLwy1Zg/348s.jpg", "caption": "Delicious tiki drinks."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lbzXK0_rnAk6XOv_zhfqeQ/168s.jpg", "caption": "Awesome wall of skulls."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pQlvbJmNNANtg13oWCzz-w/168s.jpg", "caption": "A zombie and a painkiller."}]}}, {"review": {"des": "Wow. What a cool place. <br>The drinks were crazy good but a little strong. We had an appetizer and it was good, there was some spicy the the wingless chicken. Its kinda down a back alley which make it kinda hard to GPS but what a fun place. Good music playing and great service.", "pics": null}}, {"review": {"des": "I had been wanting to check out this bar for awhile and when I found myself in Chicago decided to give it a go. We ended up parking right next to a sign that said valet for three dots and a dash (also parking in this apart of the city is bad on a weekend night- be prepared to pay). The guy at the valet stand said the place was around the corner in the alley. There was already  a line which was lined with tiki torches. The wait wasn't super long though.<br><br>Once inside, the place was packed and loud. It was just my husband and I and we didn't have reservations so we had to order at the bar and then stand (as a lot of people were doing). Drink were good- fruity, and well made/displayed.<br><br>Next time though I would try to get a table which seems like it would make it a little better than standing around. Other than that it was a pretty cool bar with good drinks and a good spot to check out.", "pics": null}}, {"review": {"des": "This place is just your typical Hawaiian tiki speakeasy... you know, one of those...<br><br>I was led down an alley by my Chicago-dwelling friends to the door that lead us down a staircase to this tropical speakeasy. The theme is executed perfectly and the ambiance is truly unique. It's Hawaiian without the glimpse of feeling cheap or hokey. It was difficult to navigate through the crowd, but we managed to get a drink at the bar. I had the \"Fat Bottomed Mermaid.\" This tasted like vacation in a cup. All of the drinks are served in unique tiki-glasses. These fruity concoctions are strong, and taste very fresh (like you're not ordering a bunch of juice from concentrate).<br><br>Some of the large drinks (served out of a giant treasure chest carried by two employees) come with theatrical entrances (lightening and pirate noises), it was definitely a spectacle. I think if you can score a table here, you could definitely have a 5-star experience. However, there was so little room to stand comfortably and it was so loud that you could hardly hear the person next to you. With the show that this place puts on, it's no wonder that it's such a draw for locals and tourists.", "pics": null}}, {"review": {"des": "If you are visiting Chicago this is a cool spot to visit but a bit hard to find. We waited in line in an alley and entered by going downstairs. <br><br>They decked out their space with tons of decorations like lush jungle/tropical plants and bamboo. And the drink are given to you in fun glasses or on statues with dry ice or lit up vessels. <br>I recommend it if you're traveling.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/c7oLPQMZ_ngy56DLZuFsmg/348s.jpg", "caption": "Skull wall at entry"}]}}, {"review": {"des": "Cocktails are very well made...but also pretty pricey. But you can see why it's pricey, they use a lot of ingredients and garnishes and you also get your cocktail in cool looking container/glassware. Hawaiian/Tiki themed bar. The place is super dark, super packed (standing room only when we came), you can put your name in for a table, but standing is just fine too.<br><br>I got the Royal Hawaiian, comes with Gin, pineapple, and lemon and it was delicious. I couldn't even taste the Gin (not sure if that's good or bad) because I can over drink. On the other hand, my boyfriend got the Cobra's Fang and it was so venomous- got him drunk, and he could taste the 151 Rum alcohol. It's a deadly drink, he got a massive headache afterwards...so pace yourself. Another drink for us and we'll be on the ground probably.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tbHk63n33JQ5g243dmJ-tw/348s.jpg", "caption": "Cocktail and flower shirt!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/J7y63i16z8Buho51VxYhiw/168s.jpg", "caption": "Drinks"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HhfHY46YwNDohh0VTWvugA/168s.jpg", "caption": "Cobras Fang"}]}}, {"review": {"des": "This place is a Chicago MUST. Came here while visiting as a recommendation from a friend.<br><br>Cute to check out. The drinks are pricey, but good. They go all out with the presentation of the drinks.<br><br>The only downside is the small bar area, if you do not have a table you must stay in this roped off area and be squished by the bar.<br><br>Would def come back again. Worth it to check out.", "pics": null}}, {"review": {"des": "This place is great!  It's a tiki bar, hidden down in alley ... located in a basement.  It's a little tricky to find, but as you walk down the alley, you'll see the torches (if you walked down the correct alley).<br><br>The menu is loaded with classic Polynesian drinks (think Trader Vic's); as well as many modern twists.  Everything we tried was tasty.  Our favorites were probably Trader Vic's Mai Tai, and their namesake drink: Three Dots and a Dash. <br><br>We just came for drinks and a quick appetizer, so I can't say too much about the food.  But I do know this - the Thai Fried Chicken is awesome!  <br><br>We visited on my wife's birthday (which is in July), and had a great time.  We plan to return this winter, and use it as an escape from the harsh Chicago winter!  Whenever you visit - I'm sure you'll love it as much as we did!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/U8PEtZHAelvG8rWy3GjO6Q/168s.jpg", "caption": "The Thai Fried Chicken is awesome!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PI-A-9a0B4a6G3MVJPZ57A/168s.jpg", "caption": "Trader Vic's Mai Tai, and Three Dots and a Dash were our two favorite drinks."}]}}, {"review": {"des": "With a little over an hour to kill before dinner, my friends and I walked in and were seated in a booth immediately! (It was Friday at 5 PM.)<br><br>The decor and mugs are so cute, and many of the drinks come with special effects. Four of us shared a flaming skull drink and there was PLENTY of liquor in it to jump start our evening. We also ordered a few other small drinks and everyone was happy. The drinks were pricey, but totally worth it. <br><br>We didn't try any of the food. It is quite dim and loud inside -- but hey, it's a Tiki bar! And it is surprisingly spacious.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3bcOOOhWpVVrJO-yB0UJ4Q/348s.jpg", "caption": "Delicious, flaming drink for 4."}]}}, {"review": {"des": "This was, hands down, our favorite bar in Chicago...And unfortunately we didn't find it until our very last night in town, on a recommendation from our server at dinner.<br><br>Three Dots and a Dash can be a little tricky to find, as the address listed for it is 435 N. Clark, but that takes you to another bar that faces the street.  To find this place, you actually need to walk around back, and you'll find the entrance in the alley behind the building. Don't worry..It's worth the bit of extra effort to come here!<br><br>We're huge fans of bars where they serve up unique, specialty cocktails and have \"mixologists\" working their craft.  The drinks they serve here, the glasses they're served in, and the presentation are quite impressive and as unique as you're likely to find!  <br><br>When we arrived late on a Monday night there were a few patrons seated at tables, and the bar was packed with customers.  We ordered drinks, and luckily a few stools at the bar opened up for us shortly thereafter.<br><br>We each tried a few of their concoctions; my favorites were the \"Too Many Chiefs\" and the \"Caribbean Punch\".  Both were quite good, hand crafted by a talented mixologist (who was also happy to answer a few questions we had about the tools of the trade he was using), and were served in very unique mugs (see photos).  Even the garnish was a work of art!<br><br>The only letdown was when it came time to close the place.  They called last call bout 45 minutes before their scheduled closing time, though the place was still relatively full of customers.  We ordered one last round and settled our tabs, and it seemed no sooner had we done that and taken a few sips of our drinks when they were turning on the lights and one of the employees of this place was yelling for everyone to get out.  Closing time is never easy, especially when the place is full. However, there's a right way and a wrong way to manage it, and the staff here definitely could've handled it better.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PjBFyBNmEAOEAHNn1jkskw/348s.jpg", "caption": "Too Many Chiefs and Vicious Virgin"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1ihkA4imy1om36QvjQ5BsQ/168s.jpg", "caption": "Bali Bali"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/i8bwDlPP3aleh-MfyLqaJw/168s.jpg", "caption": "Custom mezcal drink and Caribbean Punch"}]}}, {"review": {"des": "If you are going to charge so much for drinks then the quality should reflect the high prices. It doesn't. <br>Being new to IL, I needed help from the locals who pointed me in the direction to a dark alley way. So far prior yelp reviews are spot on at this point but the similarities in opinion end here. <br><br>I came here on a Saturday night at 11 and it was packed as expected. The bartenders are nice, the bouncers are friendly and the crowd wasn't rowdy. All good things. <br><br>If you're looking to get inebriated fast then this is your bar since the drinks are strong but this isn't a place you want to frequent and this isn't the place where you want to end your night. Take this as a starter bar to a long inebriated night. The drinks are strong but not great in flavor. I get it. Most people don't care about how their drinks taste because they have one goal in mind and that's to get embarrassingly wasted. However, that wasn't the goal for my friends that night so we had one drink and left. <br><br>If you're in Chicago then sure, check this place out if you're a first timer but if you don't, you're not missing anything. ‍", "pics": null}}, {"review": {"des": "I came here with a few girlfriends and we ordered the Captain Dino's Pu Pu Platter which had yuca frites, spring rolls, king crab rangoons, coconut shrimp, thai fried chicken, and beef meatballs. This appetizer platter had a good variety. I didn't like the yuca fries but everything else was good. We also ordered the Bali Bali cocktail. The presentation of their cocktails are really cool and Instagram worthy. The dry ice effect makes the pictures. We didn't think this drink was that strong. The entire restaurant is underground and the lighting is very low throughout the place. We had to use our phone lights to see the menu. I wouldn't come to this place on a regular basis but if you're a visitor or want  to show your visitors cool Chicago spots, definitely check this place out!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jgC07qlzPbZblhiA-hWn3Q/168s.jpg", "caption": "Bali Bali"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ycIgSrWzbrAvhyjXIwExbQ/168s.jpg", "caption": "Captain Dino's Pu Pu Platter"}]}}, {"review": {"des": "Visited Chicago for a short weekend and decided to come here since it was a Sunday and it was actually one of the few places still open with a fun crowd! Was a little bit hard to find (it's in an alleyway but we didn't know so had to walk around a few different times), but eventually made it with the help of Google haha. <br><br>As soon as we walked in, it already felt like it was going to be a fun night! The entire place is perfectly decorated, it feels like you're stepping into a completely different world. Everything is of course tiki themed from the drinks to their glasses and the servers' outfits. Our server mentioned that they were known for their group drinks, so of course, we couldn't resist! <br><br>We ended up getting the Shotstopus (shots of 151 mixed with passionfruit and some other citrus - $10/shot) which came on an octopus accompanied by smoking dry ice and fluorescent lights. This was seriously delicious and so fun to watch! After the shots, we ordered the Lapu Lapu ($28) which came in a conch with more smoking dry ice (dry ice is the name of the game here). Although it said it only serves 2, we split it among 4 and were perfectly satiated with just this and the Shotstopus. -1 star since the drinks were pretty pricy for how watered down some of it was, but it was fine for us since we were just in it for the interesting experience. Overall, the atmosphere and creativity of the place made it super fun and I definitely recommend making this one of your stops if you're hopping around! :)", "pics": null}}, {"review": {"des": "It's a nice, and comfy place. However it isn't pleasant when it's packed. The drinks are okay tried about 7, they tasted mostly the same to me, couldn't find a difference. Pretty pricey.", "pics": null}}, {"review": {"des": "Wow this place is cool. The way it's hidden in an alley way and you have to walk down some dark stairs, it really felt like some exclusive club you have to be a member of. That's not the case, but I wish we could have spent more time here! It's a little tiki bar hidden in a basement where the drinks are strong, taste phenomenal and beautifully decorated. Highly recommend if you like tiki cocktail bars!", "pics": null}}, {"review": {"des": "I've never been here but I have an upcoming reservation. I am a 5th generation psychic and I've caught some super strong vibes about this place. My energy's are feeling me that all the drinks will taste good but also that they may cloud my clairvoyance. <br><br>The future is looking up.", "pics": null}}, {"review": {"des": "Atmosphere: Exhilarating, fun and exciting! A GREAT place to bring clients, guests or friends from out of town. Tiki bar means Chicago, in a better way than you can even imagine. Expect your guest to be wow'ed when they walk into what looks like a downstairs speakeasy and opens up to a cool tiki bar! <br><br>Service: Great service! Allowed me to sneaky order fancy drinks & food for my team without them noticing. Everyone was super friendly from the hostess to the food runners. <br><br>Food/drinks: Drinks are incredible!! Theres a reason this place is one of the top rated in all of Chicago! We ordered the Head Hunter which comes lit on fire (fire is contained in a fruit peel). Next time I want to try the bail bail which comes with dry ice. I've also tried a Argentina favorite here another night, my co-worker who I brought said it was made very well (he's from Argentina). Overall, this NEEDS to be on your 'must do' list if you are visiting or hosting in Chicago. <br>The food was also great. We only had coconut shrimp but it was great! <br><br>Overall: Add this to your list of places to go to. EVERYONE loved it that i've brought so far (a total of 6 people ranging from 24-55+).", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/a4FA-0jDn3wLCSlvi7fVWA/348s.jpg", "caption": "We ordered the \"head hunter\" it came to our table on fire  next time i want to order the Bali Bali"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5FUCrPbHd1w7xbtbP5HApA/168s.jpg", "caption": "Coconut shrimp was so great!"}]}}, {"review": {"des": "Three Dots and a Dash was absolutely fantastic! I went when on my recent visit to Chicago and was so glad this time around I got the chance to go! In my opinion, it's a must go! First of all, it's underground... I'm from Miami and NOTHING is underground, which is a shame cause it gives places such a different vibe. I loved that it was dark but you could still see details all around the bar!<br><br>As for the drinks... Absolutely delicious, adorable, and so theme appropriate. Each drink had a specific name, strength, and cup! I loved that they would tell you on the menu how strong each drink was and showed you pictures of just exactly what the drink would look like.<br><br>The drinks were a little pricey but nothing I hadn't seen before and not something so outrageous that you wouldn't want to return. I absolutely will return next time I go to Chicago!", "pics": null}}, {"review": {"des": "Neat place but a little more social hall and less cozy than the Vegas and KC versions. Prices were way higher than those two locations as well. Glad I got to see another Tiki type place.", "pics": null}}, {"review": {"des": "Came here because it was recommended to me by a few friends and let me say I was very impressed. I will start with the one negative which is that this place is incredibly difficult to find. It is down some alley, I ended up walking around the whole block before figuring it out. But once you find it it's pretty obvious with some tiki torches and the theme is carried throughout, from the moment you walk in and to downstairs. It is a very lougey feel and they come with the menu and all their drinks are in incredible glasses that are very creative and keep true to the theme! I loved my drink which I got the two dots and a dash (gotta try a places signature drink when you first go and let me say it didnt disappoint!) My girlfriends drink was also good, she got the punch. <br><br>If you're looking for a place to hang out with some people and have a nice drink (which is a decent amount and a good amount of alcohol for the price) then you should definitely hit this place up. They seem to take reservations for their tables so try planning ahead if you're not going in the middle of the day like I did. But even if you're going in the middle of the day I say this place is great because its underground and you forget it's like 6 PM outside! 10/10 recommend :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HsQPCTpD5niLniQaDiJVdg/348s.jpg", "caption": "Three dots and a dash! Good go to if you like rum!"}]}}, {"review": {"des": "Horrible... no line to get in but had heard about this \"speakeasy\" Bar. Don't be fooled - it's not a speakeasy, just an underground bar with an alley entrance. It's actually horrible! <br><br>Our Order: vicious virgin (drink) and old fashioned drink. <br><br>Environment: tiki room vibe in an underground bar. Cheap quality and horrible drinks.<br><br>Verdict: don't waste your time at all!! I mean it. I rarely give one star. This place had disgusting drinks. We actually paid $30 and left our drinks on the table. My old fashioned was made with run and whiskey (gross).<br><br>Tips: don't come. Save money and go to the drifter bar at the green door (way better drinks and service)!<br><br>Next Time:", "pics": null}}, {"review": {"des": "I found this place by searching Happy Hour on yelp. This place does not have a HH special, but I  stayed for the experience. I went on a pretty busy night but I expected that. After-all I did go on a Friday night and  after work hours. The decor and ambiance was nice but nothing spectacular. <br><br>I only ordered two drinks: Cobra's Fangs and another drink that I unfortunately do not remember. It was disappointing that neither drinks were strong.", "pics": null}}, {"review": {"des": "Let me start out by saying this place is an absolute hoot! When you arrive, you walk into a darkly lit space, fully decked out in tiki bar décor. And not the cheesy decor you find at your neighbor's backyard pool party. I'm talking skull walls, enough tiki grass to make skirts for the entire Chicago Bears football team, and of course fun lighting and tons of tiki themed items every where you turn. Everything from the clothes the staff is wearing to the glasses your crazy tiki drinks come in, they go all out. <br><br>Now, I haven't had much to eat here but I've definitely had my fill of tiki drinks. Being that this joint is right in the heart of River North, it's easy to get to and a great happy hour spot on Friday after work. Let me be clear - they don't actually have happy hour specials. That's just what I call it when folks go out right after work. <br><br>In regards to their drinks, they have an enormous cocktail menu! If you're anything like me, the more options you have the more confused and difficult it gets to make a decision. Good thing is, just about everything on the menu is delish! The only bummer is that some of their drinks can get extremely pricy. I generally order an Old Fashioned and there's is $18. A little steep for me. Do note that if you pay more for a drink, you're definitely going to get the booze. I've had the Pain Killer, the Caribbean Punch, and the Bourbon Special, all fabulous!<br><br>At the end of the day this place is a blast and it's definitely a funky spot to enjoy some drinks at. Will I be running back, maybe not. Would I come back if friends were down to get tiki, absolutely!", "pics": null}}, {"review": {"des": "Updating with the final star. I got to try the food this time around and it's good. Drinks still delicious and the place a lot of fun with friends. Music a bit loud when we went late but not ear splitting. Just had to yell to be able to communicate around the table.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/A3eQhVLE97krZ9jOPgrXyQ/348s.jpg", "caption": "Can't taste how strong these drinks are but you'll feel it hours later, phew!"}]}}, {"review": {"des": "OMG i'm so in love with this place. <br><br>Definitely has a tropical speakeasy kind of vibe. Can't say much about the wait because I've only ever been here at non-peak hours. <br><br>Drinks are phenomenal. And yes you probably will make decisions based on the cool cups over the actual drink in them- but that's okay because I can assure you the drinks are AMAZING. Well balanced, fruity, delicious. And oh boy are they strong. You get your money's worth. <br><br>Also- not sure if anyone's really called this out but the chicken bites and yucca fries are shockingly phenomenal. I crave the chicken bites. They're spicy and tangy and pair perfectly well with your drink and a little buzz. <br><br>Awesome place to come with friends or a date! There's also a firecakes right around the corner if you're still hungry/craving something sweet after! It's so hard to find lol so good luck. It's in the middle of an alley with torches outside the door. You'll probs walk around the block a few times without actually finding the entrance but it's alll part of the fun.", "pics": null}}, {"review": {"des": "What a fun place and (literally) hidden gem! Very hard to find but so glad we did! You walk downstairs and are transported to a different tropical world. Super dark, clubby vibe. Every table was reserved so seemed to be standing room only but we grabbed a couple seats at the bar when someone left. The staff was all wearing Hawaiian shirts fit with the tiki bar vibe. The drinks was STRONG and delicious, plus aesthetically pleasing. We didn't eat but the food I saw come out of the kitchen looked amazing. This place is a must-go on Chicago trips!", "pics": null}}, {"review": {"des": "I loved coming here during my short time in Chicago. The area is really lively, with tons of restaurants and bars in the area so you don't feel too scared walking through an alleyway to get to this place. Usually you'll be able to find it because the alleyway has tiki torches that lines the entrance.<br><br>Inside, there are tiki decorations that makes it seem like it's an upscale, classy tiki lounge. My sister was able to make a reservation so we could get a booth reserved for five people. I highly recommend anyone coming here to reserve a table because it's just more convenient than coming with a group of people and standing around. <br><br>The drinks are a little pricy, $10+ at least, but it's a hefty portion of liquor that comes in really cool and photographic tiki cups. We tried five of their cool tiki inspired drinks (three dots and a dash, never say die, too many chiefs, Caribbean punch, and royal hawaiian) and I have to say that the strongest drink we had was the Never say die, but the tastiest was hands down the Three dots and a dash. <br><br>The service is pretty fast too, we only had to wait maybe around 15 minutes for them to bring us 5 drinks. This is a great place to lounge and hang out. Will definitely try to come back here!<br><br>Note: you can't take the cups home!!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/F-zHmUGL7J_gLCRZ91KMdw/168s.jpg", "caption": "(L to R) three dots and a dash, never say die, too many chiefs, Caribbean punch, and royal Hawaiian"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ctaRsIdhwmHe3jvYwVs_hA/168s.jpg", "caption": "Never say die and Too Many Chiefs"}]}}, {"review": {"des": "This is one of my favorite places to go when I visit Chicago! Drinks are great but the atmosphere is better. It's a \"must see\" when you're in town.", "pics": null}}, {"review": {"des": "My friend chose this place as she wanted something different I had it bookmarked already so I know it would be special. Even though the page clearly states it is around the corner and through the alley the Uber driver left us around the corner. Once you do get here we see the lite tiki torches and bouncer at the door. <br><br>We enter this dark corridor and go down the stairs illuminated with skull heads up above. The hostess leads us to our reserved table inside the middle of the floor right near the tiki bar. Nice place it feels like an escape from the city and now you are on vacation! <br><br>The drink menu is large colorful and ginormous. They even have aeveral drinks to be shared by a large party. We all chose our own. I was torn berween the three dots and a dash signature punch or the Caribbean punch served in a ceramic fish. The fish won out by suggestion of our server and it was so delicious I even had another. The second one was definitely stronger than the first. In fact the menu guides you on which ones are strong. <br><br>We shared a pu pu platter that was served perfectly and plenty for the three of us. In fact many of the selections came in three. There was spring rolls,mini meatballs with macadamia nuts,yuca fries which appeared to be made there as they were fresh and coconut shrimp just to name my favorites. <br><br>Very cool place you can tell by the finishes that everything was high end and they really paid close attention to the details which made it special. I would definitely come back on my next trip to Chicago.", "pics": null}}, {"review": {"des": "WOOF this place is terrible for more reasons than one. Let's break it down:<br><br>- The hostesses are extremely unwelcoming, walking up to them and asking about a table is somehow a monumental burden to them. They have to stop using their mobile devices for a moment to let out through their peeves that getting a table will be too hard and you should just try getting a drink at the bar. Not helpful in the slightest bit, even feeling like they are going above and beyond to sway you from drinking.<br><br>-The place is a screaming-tourist trap. It's entirely too small for the amount of people they let in. Just because you throw some palm trees up and bamboo, does not make you a tiki bar. I'm not a doctor in tiki bar setups but jeez this place goes only so far to be creative.<br><br>-The drinks while made well, are not traditional. I asked the waiter to make me a classic tiki drink and he snarled that he doesn't make drinks that way. Cool. Thanks man. It must be so hard to literally do one more thing but i guess when you're so busy, you can't. <br><br>-Seating is a joke. Multiple times we tried to stand close to the bar where there was space to stand, a bouncer came and told us that we couldnt stand there - there were no signs to indicate we couldn't. So we moved. A table opened up so we sat down only to be told we couldn't sit there, it was only for reservations. Again, no signs to indicate this, just being berated for trying to enjoy the super overpriced drink. Then, we couldn't too close to the tables by the bar for some unknown reason. I've never had so many rules shoved in my face so rudely just for a drink.<br><br>-$14-18 a drink? That's well over higher-end drink spots in multiple cities.<br><br>Avoid this place like the plague.", "pics": null}}, {"review": {"des": "I could not be happier with the choice to come here!  Thankfully I made prior reservations, because there was no way I was getting in without one (thank you, OpenTable!).  It wasn't too hard to find the place (back alley by Firecakes), but I was SO shocked how they transformed that basement into a whole other world.  <br><br>I loved seeing all of the different cocktails come out, especially the ones that involved fire.  We ended up with 2 drinks each between my husband and me + crab rangoons.  Everything was so.dang.good.  The drinks are so delicious you forget how strong they are, so beware.  I cannot wait to come back.<br><br>Love the different cups they come in?  You can buy them!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HBjGGmmpGmutSfRDIaU_Mg/348s.jpg", "caption": "Bourbon Special and Three Dots And A Dash"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IkCytrdxJEIXgQbQFlXsYQ/168s.jpg", "caption": "Mai Tai 2.0 and The Zombie"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/c1VyZXuoYcVbWKL8XYKhbA/168s.jpg", "caption": "Crab Rangoon with 4 dipping sauces. SO good!"}]}}, {"review": {"des": "I was a little hesitant, as it seems to have a very club vibe when you walk in, but our dinner experience here was great! <br><br>We sat at the bar, and our bartender was super nice & friendly. She recommended the lapu lapu, which ended up being a fun drink (it \"smokes\") and a good deal for 2 people. She also made us free mini painkillers! The drink flavors themselves were pretty standard, but our server and the overall ambiance made it great. We also got coconut shrimp and yucca frites. Both were very good!<br><br>Only con I would say is that it was very dark inside.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TTjfS0-Gn1vvFv5hHJhDlw/348s.jpg", "caption": "Bar tender recommended the Chief Lapu Lapu, and it was great!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sf4acSFuh8PL1H3Lr-_F4A/168s.jpg", "caption": "Coco's Coconut Shrimp was very good"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bPTFGBJfGY3qAeRJeeWHaw/168s.jpg", "caption": "Cool alley location! Little hard to find, but it made it more unique"}]}}, {"review": {"des": "This is def one of the coolest bars in Chicago! The drinks are very unique and interestingly crafted. However, the place is so tiny and it is always PACKED! You can make reservations on open table but nothings ever available. You're also not allowed to stand in a certain spot leading to the kitchen which they don't make very aware and are pretty rude about it when they tell you to move. <br><br>The ambiance, decor, everything is very very cool here! You feel like you're at an underground tiki bar. But if you have parents visiting town, I do not recommend! My in laws and parents were all visiting together and we walked in and walked out. Too loud. Too crowded. Even if they did bring back the backlight.", "pics": null}}, {"review": {"des": "This is a really cool bar in river north. It's a bit tricked to find. You'll know you're there when you see the tiki lanterns and bouncer standing outside a random door in an alley.<br><br>When you enter you go down a set of stairs into the basement. You instantly notice the extravagant Hawaiian luau decor.<br><br>The drinks here are really strong so be careful. We've never had food but it always looks good. <br><br>The service is quick and the servers make really good recommendations. <br><br>They do take reservations so I recommend making them in advance if you're visiting and short on time.", "pics": null}}, {"review": {"des": "This was a memorable cocktail stop in Chicago. We stopped around the front, not entirely sure where to find the entrance. That's because it isn't around front, it's around back in the alley. You'll recognize it by the aisle lined with tiki torches lighting up your path to the door.<br><br>We were greeted by a blue lit wall of skulls as we walked down the stairs and into the bar. This basement room is appropriately decorated with bamboo covering the walls, a grass hut roof over the bar and plenty of fun accents.<br><br>The best part, of course, is the drinks! And the tiki mugs they're served in. Like any good tiki drinks, these are potent... but dangerous because they don't taste potent! The namesake, Three Dots and a Dash, was my standout. But I wouldn't say no to another Suffering Bastard or Painkiller.<br><br>If I were to go again, I'd head here with more than 1 friend, reserve a table and enjoy sharing some of those group drinks on the menu!", "pics": null}}, {"review": {"des": "The entrance of this place will definitely through you off. But once you step down into the hidden gem, it feels like your in Hawaii! The drinks were amazing. I got the mermaid and it didn't let me down. We done ordered the pupu platter. All were delicious. Small portions though. Come here for the drinks. <br>Make sure you make a reservation!!", "pics": null}}, {"review": {"des": "Three Dots and a Dash has very cute mugs/glasses and definitely strong-enough drinks. My friend and I got a big skull on fire to share, and they have other fun drinks. This place is definitely on the pricier side, and a place you would go for nice drinks / a nice night out. We tried their yuca frites, Thai fried chicken, lanai luau chips, and coconut shrimp. Their food definitely isn't anything special / I wouldn't go out of my way to pay these prices for the food, but definitely a fun snack for when you're drinking their drinks.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/y9dBY2qPBleM6cTXNEgcBQ/348s.jpg", "caption": "Flaming skull cocktail"}]}}, {"review": {"des": "Three Dots and a Dash was on my \"must visit\" while in Chicago because it was highly recommended to me by several different friends. They said it was \"the best bar they went to in Chicago\" and the \"best atmosphere and vibe\" and I have to completely agree! It was probably one of the best places I went in Chicago and to be honest, if I were to ever visit Chicago again, this would be one of the places that I would go out of my way to come back.<br><br>First of all, the drinks here are one of the reasons alone why I would go back. They are so creative, stiff, and made so cute to order! They are Aprox $15 a drink but I promise you will get a good buzz off the first drink. They're also pretty easy to get down as well. <br><br>Second of all the atmosphere and vibe is awesome. I wonder why bars like this doesn't exist anywhere else. It's lively with nice people and good music. There isn't a dance floor (which is pretty shocking!) so it's literally a bar that's just fun to be in! There are tables that you may reserve in advance if you want to sit, eat, and order a large fish bowl to share with friends because that can be difficult to share while standing in a crowd. <br><br>When in Chicago, put this on your \"to do\" list! Because the location alone is the prime location in the city. There are so many other things to do around here that it's great!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IS1ySHcvmzIJssTfo0Kdeg/348s.jpg", "caption": "Cute cups!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ggScfq3Qw8aT6HdFdmgs_A/168s.jpg", "caption": "Mai Tai - Loved it"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pX-dBKpLMB2L7gtDIJkl4w/168s.jpg", "caption": "Drink Menu, April 2018 - So Good!"}]}}, {"review": {"des": "I'm not going to lie, I kind of love this place. I thoroughly enjoy the vibe you get and it all starts when you walk in. <br><br>Let me start with this, if you don't know. This is a tiki bar, so don't go expecting super fancy cryptic speakeasy or some high end place. It's a very nice tiki bar, but still just a tiki bar. It's a little bit of a different vibe than your \"typical\" tiki bar though. It is situated in River North after all.<br><br>Three Dots and a Dash is morse code for the letter \"V\". The V is for Victory during WWII. Whoo! Their menu is large-ish aka there's several different options to choose from...including shareable options depending on group size. They make it fun. And have lots of different vessels for their beverages that sometimes make you want to order a drink for the vessel alone. <br><br>The bar itself feels like a bar you'd find walking a strip of beach on an island somewhere. Then there's booths and tables to choose from otherwise. You can walk-in and hope for seating, go sidle up to the bar or you can actually make reservations. They also serve food (which is handy when you start to realize you're letting the drinks get the best of you - they're just too easy to drinks sometimes). <br><br>So back to the vibe and how it starts. The entrance is down an alley (which looks creepier and more mysterious at night). The entrance doesn't exactly stand out...but there's human checking IDs at the door and some tiki torches...so yes, you've come to the right place. You enter into a dark hallway and have to descend some stairs. The first thing you notice are the skulls (purely for decoration (we think)) and the ropes that at as handrails. There's a private seating area off to your right for large groups or overflow and a hostess stand at the end of the hallway. While standing at the hostess stand, you experience excitement bubbling up inside you because it just looks so fun on the inside.<br><br>And bam! you've made it in and you're ready to order drinks and begin the fun. The service is good, fairly quick. The staff is great (super accommodating for the most part). The atmosphere is fun...with some River North feels (it is River North after all). Drinks can get pricey, but that can be true of any tiki bar. The food is fairly decent also<br><br>TDLR: definitely worth checking out.", "pics": null}}, {"review": {"des": "It's super crowded and the bar area was sectioned off, so there are tables for other people to dine in. This caused lots of unnecessary crowding and not enough room to even stand leisurely. Also, there were people sitting at the bar area, so the rest of us were struggling to even get through to the bartender.  I genuinely hope this bar improves their layout.<br><br>Aside from that, the drinks were cool and pretty strong. The decorations were different and made you feel like you weren't in Chicago anymore. We waited 25 minutes to get in, which was apparently rare for this bar. I recommend coming with a group of 4-6 people and splurge on the larger/special alcohol bowls. <br><br>I ordered the pain killer and it was good!", "pics": null}}, {"review": {"des": "AMAZING COCKTAILS! I have been here at least 5 times and can easily say this is one of my favorite cocktail bars in Chicago. My most recent visit was for a special event where a mixologist from NYC and one from Mexico City came together with the mixologist from 3 Dots to create a special limited time menu. Lil Jon was also hosting the event!<br><br>We got to try 4 out of the 6 cocktails, all were $15 each:<br><br>Lil Bitter: My fave out of the 4! It was only a little bitter but nicely rounded out from the creamy coconut flavors. Tasted like an extremely boozy pina colada. <br><br>SharkDrank: A sweeter cocktail with fun fish gummies in the drink.<br><br>Jarrito Tiki: Delicious raspberry flavors, different from the standard tiki drink since it has a tequila base<br><br>Crunk Tiki: A smaller sized super tropical fruity drink<br><br>Some of the food items we tried were:<br><br>Lao Crispy Rice Salad ($10): Really delicious, unique salad<br><br>King Crab Rangoons ($11): This only came with 6 tony pieces, super overpriced IMO<br><br>Big Berns Tuna Poke ($13): Instead of Tuna cubes, the meat was actually ground up which was a bit strange. Overall, it was pretty average.<br><br>TL;DR: The drinks here never disappoint but the food is a bit over priced with small portions", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qukW8TfYZXB_WxcS3BrTqg/348s.jpg", "caption": "Lil Bitter and Shark Drank"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tMPXaCfaNCs3No5N83szPA/168s.jpg", "caption": "Crab Rangoon"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FyflT-lymbTIQyjiBzI4fw/168s.jpg", "caption": "Tuna Poke"}]}}, {"review": {"des": "We. Love. Tiki. Drinks! Had been wanting to go here for a while but the long line outside had discouraged us before. Went in at 5 pm on a Saturday this time, and got standing space at the bar! Win!<br><br>Deliciously fruity, stunningly accessorized, and sneakily strong drinks. Watching the bartenders while they created these pieces of art was an experience in itself! Don't forget to get your lei garlands from the front desk to make you feel like you are truly on an island.", "pics": null}}, {"review": {"des": "This is probably one of the coolest bars we went to while in Chicago. The cocktail are awesome, a little pricey. But love how they went all out on the mugs and garnishes. <br><br>It's a little tricky to find, but as you walk down the alley, you'll see the torches (if you walked down the correct alley). And as you walk down the stairs you will see the skull decorations. Which is awesome! Actually all the decorations are amazing in the bar. <br><br>Mainly standing room, till 2 am - then more table open up to sit at. <br><br>One of my favorite bars, I think everyone needs to come too!", "pics": null}}, {"review": {"des": "You're paying for theme & fancy drink. Drink was strong, and I only ordered one. Good basic customer  service, its crowded & I went on a Monday evening. It's hidden so look for blue light in the alley. Theres a small sign that locates it. I walked past it multiple times. Cool spot to chill and have a fancy drink. You just stand to wait for open seating at bar and you must check in to host for a table. Underground vibe so it's pretty cool. I would recommend to check out even if it's just one time.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/u1F23S6sMTbdR6G9UBgg1A/348s.jpg", "caption": "You're paying for theme & fancy drink. Drink was strong,  good service, crowded & it's hidden. Look for blue light in the alley. Cool spot!"}]}}, {"review": {"des": "This place is so cute and the drinks and food are so good! The cups are adorable, and although everything is pretty expensive, they are so worth the price.<br><br>When you first get here, you wait in line outside in an alley. It's honestly pretty sketchy, but in a way, you feel pretty VIP with tiki torches and the line ropes. The bouncer is there to check IDs and also to assure that there isn't too many people in the bar at one time. That is the reason for the line being outside. When you enter, you go through a very dark corridor and you go downstairs. So, this place is in a basement of a building, but when you get to the actual bar, the decorations and atmosphere are so cute and Hawaiian. Your mood changes in an instant because you are pretty creeped out in the darkness, and then BAM, beautiful bar in front of you.<br><br>My friend and I shared the delicious spring rolls and the luau chips, and both were amazing. The best part of this place though is the drinks. Each drink comes served in its own type of glass, and therefore, it is easy to figure out what everyone around you ordered. You cannot keep these mugs, but they do sell some hand-crafted ceramic ones, but they are like $75 and I can't see someone actually wanting to buy them that badly to spend that much on them. They also have exclusive mugs you can buy that look more like the ones you drink from in the bar, but those are also between $40 and $60. I ordered a Painkiller which was absolutely delicious, while my friend ordered a very good Bourbon Special.<br><br>The service here is fabulous, but remember that this place is very popular, and the place gets very busy. The bar area has tons of people near it, so if you can, try to get a seat at a table. Make a reservation!<br><br>This isn't a place I would spend all night in, because it really does become expensive and the sweet drinks become too much after a while, but it is definitely a place you need to check out if you are ever in the area.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1vrfSphl1CF5AJ6hmu3D2Q/348s.jpg", "caption": "Painkiller (left) and Bourbon Special (right)"}]}}, {"review": {"des": "Like 3.5/5 stars but I'll round up to 4.<br><br>We had heard this was down an alley somewhere, and it was: the entrance is off of Hubbard St, not Clark. Look for the blue tiki lamps.<br><br>We were about 15 minutes early for our reservation, but they seated us right away. My friend and I each ordered one of the tiki drinks. We were expecting two more friends, and three ended up showing up.<br><br>This is where things get weird... A hostess came over to our table, about two hours after we sat down, and asked us if we had reservations. We said yes, we've been sitting here for a while. She said they can't seat 5 at a table (at that point, three of us were sitting down and one was standing) and she'd have to okay that with her manager. It ended up being fine but it was a little off-putting... To top that off, waitservice wasn't great either (slow until it was time to pay the check...).<br><br>Despite all of that, the drinks were quite good, and the tiki bar atmosphere was fun. Be prepared to pay about $14-16 for the tiki drinks, or like $10-14 for the more standard ones (daiquiri, etc). I'd come back again but definitely with a reservation again, as the bar area was crowded.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/E4T2bbR7tOkJDH-TbCmmaw/348s.jpg", "caption": "Daiquiri #3"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/glitGmXtQOy3xZ94GpBNYw/168s.jpg", "caption": "Weird lol"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qvXu1VW7BhySGcPQt7TTqw/168s.jpg", "caption": "Mai tai"}]}}, {"review": {"des": "Another recommendation we got from quite a few people to check out while in Chicago was Three Dots and a Dash.  Located underground with the entrance in a back alley, look for the tiki torches and you know you're heading the right way.  We had to wait in line to get in to help mitigate the flow of people.  Once inside it was pretty crowded but I was able to make my way to the bar without too much hassle.  Three Dots and a Dash are known for their selection of lots of different rums and their menu reflects it.  There are a lot of Polynesian and Caribbean inspired drinks that all come in their own accompanying glassware.  The drinks were good, but a bit pricey as your paying a bit for the experience.  <br><br>The overall ambiance of the place was really cool having a tiki bar feel all around.   They also had tables available with reservations with you were planning on heading there as a group.  It was a cool experience to stop by and get a drink, but we didn't hang out long.", "pics": null}}, {"review": {"des": "In my opinion, this is a must visit spot when you are in Chicago. From the entrance tucked away in an alley, to the skull wall as you walk down the stairs, to the overall vibe when you first walk in past the hostess stand. I was thoroughly impressed by everything! You immediately feel like you are on vacation on a tropical island. It is a nice escape from the frigid Chicago winter! <br><br>I have yet to order a cocktail that I haven't liked. I try to order at least one new drink every time that I go. One of my personal favorite is the Missionary's Downfall if I am looking for something refreshing. If I am looking for something strong, I tend to go with the Tropical Itch (which is my wife's favorite). <br><br>If you are going with a group, I would suggest ordering one of their larger portioned cocktails for sharing. From all of my visits, I have had the Chief Lapu Lapu, the Port Light, the Zombie, the Bali Bali, and even the Treasure Chest! All of them are very unique in their own way (and very flavorful). My next visit, I plan to try the \"Rock Out with your Conch Out\"<br><br>I haven't ordered food very often, but when I do, it hasn't disappointed! The service has always been good as well, but it can take some time to get a drink due to how busy they usually are. I would recommend trying to secure a reservation to get a table. If you don't get a table, trying to find a spot at the bar can be difficult, especially on a Friday or Saturday evening. <br><br>Three Dots and a Dash has become a staple of my Chicago trips. I will continue to return and stop in for a delicious tropical cocktail when I am in town!<br><br>Words can't do this place justice. You need to go and experience it for yourself!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sm6Pm_1TgF4BUzidRCOP5w/348s.jpg", "caption": "Bali Bali!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9u5f5RI1D-PfMA7pH0BLxw/168s.jpg", "caption": "Bottle of Dom Perignon that comes with The Treasure Chest"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Z9ArJpCv_ksmwmBgtFpXsA/168s.jpg", "caption": "The Treasure Chest!!!"}]}}, {"review": {"des": "Possibly the best bar in Chicago.<br><br>Amazing decor, very kind and engaging bar staff, incredibly creative drinks, and photogenic cocktails. If you're into the bar scene and looking to live it large, stop here first. Then you'll begin to realize all else pales in comparison. But if you're into a simple low key Irish or sport bar, then have it your way.<br><br>You cannot go wrong with any drinks. We had the Zombie among 2 other drinks. Do go for the ones that use dry ice to satisfy your insta crave. Yes one of them can be split from 4-person to 2. Just ask. Also ask that the outer layer with dry ice be refilled to replenish the smoke effect.", "pics": null}}, {"review": {"des": "This is a tough spot to find! GPS will say \"YOU HAVE ARRIVED!\"     No you haven't! Head east behind the building to the alley and you will see lighted tiki torches and doormen to greet you! Very dark atmosphere with 20 something's. I'm 40 something and sorta felt respected more than I should have by staff! They seated us at a table immediately, probably figured our feet hurt and bones ached! Fun drinks. Neat atmosphere. Pricy, but an experience. The kitchen was closed for the evening, menu looked good for a hearty snack. Would definitely go back!", "pics": null}}, {"review": {"des": "I hear-by declare this to be the best cocktail bar in Chicago!  Great ambiance and service, and the entrance alone has a lot to live up to - but it delivers.  I love the wall of skulls and other tiki accoutrements that you encounter as you are reaching the host/hostess stand.  The bar is dark and intimate but with such a great vibe that even other tables are comfortable enough to inquire about your cocktail choice.  The waitress explained the menu, and was quick and efficient especially when we let her know we had dinner reservations down the street.  Because of this we didn't order any food but saw the table next to us had ordered a platter and it looked delicious.  Next time I'd plan on ordering food.  They have large format cocktails which are enough for two (+) people, and the two of us managed to suck down a Zombie and were feeling fine after.  Wish we could have stayed longer and will definitely be back!", "pics": null}}, {"review": {"des": "Fun and well mixed drinks.  Great rum selection.  I had the house drink, Three Dots and a Dash and it is excellent. A bit of allspice makes it extra nice.  The Painkiller was good too--a bit more creamy but personally I prefer the House Drink.  By the way, they make three dots and a dash on top with three cherries and a piece of pineapple.  Cute :)<br><br>We had a dinner of appetizers--the spring rolls, the rice salad and Thai fried chicken. All were good but the spring rolls were a bit bland (off set my the 4 sauces they bring with them). The salad was our favorite.<br><br>Our server was excellent.<br><br>It's down an alley then down some dark stairs--so fire up your GPS to make sure you can kind it :)  Look for tiki torches in an alley :)<br><br>They take Open Table reservations.<br><br>Also, be sure to join the Lettuce Entertain You loyalty program--they give free money on your birthday and the points seem to add up quickly.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5_8pEsJG5MRzns0CPZi3NQ/348s.jpg", "caption": "Painkiller"}]}}, {"review": {"des": "When I was in Chicago I got to go to Three Dots and a Dash and I really liked it.  First it is down an Ally way and secluded.  Then you walk down a flight of stairs and you come to find you are in a little Island Oasis.  It was a really fun place to go and hang out and have a few drinks.  <br><br>I ended up getting a fish bowl when I was here and the taste was amazing and the amount of alcohol they put into their drinks is great.  I loved each sip of drink and really enjoyed myself the whole time I was there.  <br><br>I would for sure go back the next time I would visit Chicago and try more drinks and have more Island fun in the heart of the Windy City!", "pics": null}}, {"review": {"des": "If you don't want to wait forever or be in a crowded bar I recommend coming earlier in the day when they first open. The drinks are delicious and very strong (you might not need more than 2 depending on your tolerance). It does get really crowded at night and I think it is more enjoyable during the afternoon. Great Chicago staple.", "pics": null}}, {"review": {"des": "WHOA. This place is so. cool. When my friend first told us that she was taking us to a \"tiki bar\", I naturally envisioned a floral, tacky bar where everyone was wearing hula skirts. Boy was I wrong! You enter the bar via an alley and immediately walk down a flight of stairs into a space lit almost solely by candles and tiki torches. There were no hula skirts, rather the waitstaff was dressed tastefully in floral prints and flowers in their hair (for the women). <br><br>Although I cannot attest to the quality of food (because we didn't have any), the drinks are out-of-this-world. They have an entire binder full of these exotic, extremely cool-looking drinks. They have some individual drinks but also group drinks. The group drinks were a little more expensive, but don't let that stop you. I mean, one of the offerings is a drink that comes in a TREASURE CHEST. I got an individual drink and it was one of the tastiest I have ever had. <br><br>This place is so neat. If you are looking for drinks in a niche environment while feeling like you're on vacation in the Bahamas, this is your place.", "pics": null}}, {"review": {"des": "In terms of hype, price, and atmosphere, Three Dots is A-OK!  It is definitely the 'Rainforest Cafe' of Chicago tourist traps in that it is a destination, it is gimmicky, and overpriced.  HOWEVER, they do it all well.  <br><br>As I'm sure is common knowledge for anyone who bothers to look it up online, the entrance is in an alleyway, beaconed only by a lone tiki torch.  Venture down the dark stairwell and you'll end up at the host stand.  I've been twice- once with reservations and once spontaneously- both times were on weeknights so I really can't speak for the atmosphere on weekends.  <br><br>Anyways, the service is fine, the atmosphere is dark and moody, and the cocktails are tasty, but they obviously spend way too much money on useless garnishes so that is probably why your drink is so expensive.  My drink does not need an entire bushel of mint on top. <br><br>It is a great place to go once or twice for fun, but I really don't think the drinks are worth the $14-18 each on top of the exclusivity of just trying to get a table.", "pics": null}}, {"review": {"des": "Three Dots is fun. Getting to the bar is fun. Its in a alley. Not to worry. The drink menu is fun. Great for a group of people. Or your favorite drinking buddy. That works too. There were drinks with fruit, fire and great stirrers. I honestly cannot wait to come back to Chicago and return. <br><br>I recommend getting a reservation because no one wants to stand at a bar holding a fishbowl drink.", "pics": null}}, {"review": {"des": "Came for my birthday. Had a drunk Ruski yelling and cursing all night and coildn't hear myself even think. Not loud, deafening like a rock concert. Not really the restaurants fault. <br><br>Drinks are good, food, mainly appetizers are fairly good, no meals here. Not like Trader Vics at all. Minimal tiki decor. All in all, this is a passable tiki bar with pretty good service.", "pics": null}}, {"review": {"des": "I had Three Dots and a Dash bookmarked on my Yelp about a month ago and decided to give it a try since my group and I wanted to have some drinks on our Saturday night out.<br><br>Parking: Street or valet! I ended up just ubering into downtown to save the trouble.<br><br>Location: Literally located in an alley, make sure to ask around or you might miss it. On busy nights, you'll see the long line in the alley. Most likely it's for Three Dots and a Dash.<br><br>Reservations/Wait: You can make reservations with them to skip the line. However, despite the length, it does run pretty fast. My group of 5 were able to be inside within 15 minutes of waiting.<br><br>Bar: Since is underground, it is extremely stuffy and warm. I recommend to wear light layers underneath otherwise you'd be suffocating. There's seating, but most of them are reserved. The bar area is where most people would stand and since it's crowded, it's a little hard to squeeze through for drinks. However, people are pretty courteous and will let you pass through. <br><br>Drinks: They have a good selection of pretty drinks. The strongest drinks will have skull icons to indicate, generally it would have 2 skulls beside its name. Most of the drinks are about $11- $14, which is reasonably priced, since they're also decorated very nicely with little umbrellas, or even tiny flowers. You're also paying for the art. <br><br>I ended up getting the Swizzle, which is one of their strongest. My friends ordered their other drinks, which were definitely less strong, but still strong enough to give you a good buzz. My bartender was very patient with us, he had to tend to at least 3 other groups, so our drinks did take awhile but he did not rush on making them quality drinks. <br><br>Overall experience here was great, the drinks were strong and definitely left my group and I in a really good mood. My only complaint is how stuffy this bar gets, I know it's cold outside, but it is just ridiculously stuffy indoors, and this is coming from a Californian!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DtBUWUsqTbrfzRl3T4-Mww/168s.jpg", "caption": "Pretty drinks - strong too!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JbH2jL0J50msdVesNrCK5Q/168s.jpg", "caption": "Such a cool looking drink!"}]}}, {"review": {"des": "This place has amazing tropical drinks!!! Loved the cups. Wanted to buy all of them but they cost $50-$60 a piece just the tiki glass alone. <br><br>Bar isn't that easy to find. It's located in an alley. Ambiance is very tiki'ish<br><br>Drinks range between $15-20. They also have shareable drinks which range 28-30", "pics": null}}, {"review": {"des": "The cocktails are absolutely great at this place! If you've never been - make sure to visit this 'not like others'  tiki bar. <br>One star away due to a bad maintenance: last three times I came in with friends - the AC unit was broken and you have to imagine that this place is below the ground level, so there was no chance to get any sort of ventilation ;)", "pics": null}}, {"review": {"des": "This place has a lot of choices for group drinks and a great place to meet if you have a bigger group of people. I suggest making reservations ahead of time so you can beat the long line outside. We had the head hunter which was really good if you like sweet and fruity drinks. Everyone has their own straw and shares the drink (good for 3-4 people). It comes out to be $20 per person. The skull cup looks small in the menu but it is actually pretty large. The fun part is that it comes with a cool burning flame. The atmosphere is very festive and the decor makes you feel like you're in Hawaii. The music playlist was great and it covers from older to recent hip-hop and pop music. Approved.", "pics": null}}, {"review": {"des": "Busy even midweek, this delightful tiki haunt lived up to the hype. Granted I'm Tiki bar crazy so it's hard to do wrong in my book, but with a vibrant menu and hilarious fruit bowls that look like tentacles I was won over right away. <br><br>The husband enjoyed the \"Tropical Itch\"  No, not a comment on the health score but a fun take on a tiki classic complete with souvenir back scratcher. Our SF pal Jonathan isn't an imbiber of the sugary tiki delight so I was glad they had some options for those who want to venture outside the tropics. <br><br>Of course I had the \"Aloha Felicia\" which was everything I dreamed it would be. Girl, bye.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/h7SEbSa9XGI97kErm_35jQ/348s.jpg", "caption": "Aloha Felicia"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9eBLSRvaqunJdyo-7O-zsQ/168s.jpg", "caption": "Byeeeeeee"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/749BN5LncOcFlgHbghVWPA/168s.jpg", "caption": "Fear the krakken"}]}}, {"review": {"des": "We walked in around 9 PM on a Friday, luckily the line only got long after we came in, but it was very crowded inside, as most tables were taken, and the bar lines were long. Somehow we managed a tourist experience of getting some drinks, they are filled with sugar, not sure how much alcohol was actually in there. Place was a disappointment, but the concept and drink mugs was the best part.", "pics": null}}, {"review": {"des": "Updating my review for Three Dots and a Dash to reflect my latest experience. We came after a concert at HOB, but this time I made a reservation to avoid the overcrowded bar. I'm glad I made one because it was definitely still packed on a Thursday evening. I was also able to better enjoy Three Dots' ambience. It's actually pretty nice. <br><br>Since we had a table, we tried the: <br>*Anaconda Don't Want None (Blanco Tequila, Mezcal, Lime, Fassionola, Falernum, Bitters) - I really liked this one! But, I am a tequila/mezcal fan. <br><br>*Port Light (Bonded Bourbon, Overproof Jamaican Rum, Passion Fruit, Pomegranate and Lemon - Serves 2-3 - $40) - Didn't see any other tables order this (the conch and the zombie seem like the most popular table drinks) but I'm glad we did. It is a bit on the sweeter side (versus the Anaconda at least) but no overpowering cinnamon! <br> <br>*Captain Dino's Pu Pu Platter - generally pretty impressed with this, but now I know what I WILL order a la cart next time -- Coco's Coconut Shrimp, Thai Fried Chicken & King Crab Rangoons. The Yuca fries were just too starchy for me - just a fact of yuca, nothing against Three Dots' version. The egg rolls were bland and I actually used the (vegan) dipping sauce from the yuca fries to add some flavor. <br><br>It also seemed like OK etiquette to just order drinks, so don't feel shy making a rez for just drinks! <br><br>47/365", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XL_IBgCgxnlfS59AfZ3n0A/348s.jpg", "caption": "Crocodile cocktail + Anaconda cocktail"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HsF2OLbtwCEeFo8Sc8V88A/168s.jpg", "caption": "Anaconda cocktail + Captain Dino's Pu Pu Platter"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/g_VsPQhcREk1W17Uu8t-XA/168s.jpg", "caption": "The port light (drink for 2)"}]}}, {"review": {"des": "Interesting entrance... down the alley and find the blue light!<br><br>Hawaiian dim lit loungy ambience.<br><br>Pain killer - is the best drink everrrrr!<br><br>Treasure chest is super fancy drink to share with many! <br><br>Super expensive but so worth it when celebrating an awesome occasion!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lfSksiuepNInFAU9Usc29g/168s.jpg", "caption": "Cheers! My fave drink everrrr - pain killer!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/h1U_KDDCTMKQS8EbNHJ7Sg/168s.jpg", "caption": "The label is glow in the dark!!!"}]}}, {"review": {"des": "What a fun bar. It's in the alley but the alley is wide and you don't have to walk far to get in the line to go in. We went on a Friday night around 10 and it was super crowded inside, but we only had to wait in the line outside about 10 minutes. They were good about getting people in quickly. <br><br>The bar area is very swanky & had an intimate feel. The bar itself is set up like a thatched tiki hut and has a lot of character. The bartenders were slammed but stayed focused and handled it well. You just have to wait to make eye contact with one of them to get your order in. We didn't have to wait long.<br><br>Our drinks were very good. I loved the Polynesian flavors and felt instantly transported to the beach. My favorite part was the presentation. The menu shows all these beautiful drinks (love that the photos were included) in fun glasses that I assumed would be plastic. They weren't, they were all (but one) ceramic. Loved it. Be prepared for information overload on ordering though. I'd recommend watching the bar for a bit to see what's being made if you can't decide.<br><br>I ended up ordering the Royal Hawaiian and had instant ordering remorse because there are so many good options, but I was rewarded with my choice because it was very tasty. I was not disappointed in the least. I also tried my groups drinks which were the Three Dots and a Dash and the Bourbon Special, both of which were very good. <br><br>Overall I would be back here but will come with a reservation for a table (didn't have time as I didn't find this place with enough time in advance to book a reservation, which is several days out). Heads up though, it's pretty loud with the DJ in there, crowded, and dark, but it's a very fun place.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZtDF7D_RjB-6c4DP6weOAQ/348s.jpg", "caption": "The Royal Hawaiian - very good"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DCLSV7PAXHElzmbKn-jfHQ/168s.jpg", "caption": "Part of the bar"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xZ2CJjmsOGfGLRo_iH4Lhw/168s.jpg", "caption": "L to R: Three Dots And A Dash, Royal Hawaiian, & Bourbon Special - all good"}]}}, {"review": {"des": "This by far one of the most fun bars Ive been to. The back alley entrance and tiki theme are awesome. The tropical drinks here are spectacularly good and the service while beimg packed was very good!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QIetD_vTRd1vjrNu34lJxQ/348s.jpg", "caption": "Alley with tiki torches"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vp1wSs9D4r3JCGeqFdxT9g/168s.jpg", "caption": "Entrance"}]}}, {"review": {"des": "For the amount of alcohol, the price is a little pricy.<br>I purchased the Cobra's Fang with 2 skeletons and it wasn't strong. I was expecting something stronger so I was slightly disappointed.<br><br>We got the sampler and it was delicious. I definitely love the environment however service was quite slow. Our server was going over the menu with us and we did not understand 95% of what she said. Overall, the experience was great. Not sure if I'd go back anytime soon.", "pics": null}}, {"review": {"des": "TL;DR - Worth the hype. Worth the $$$. Worth a visit.<br><br>The drinks here are so perfectly crafted and I don't think you could go wrong with any choice here. <br><br>We got the tiki bowl that was for two and not only was it pretty (think dry ice yall!) it was super tasty too :]", "pics": null}}, {"review": {"des": "Very crowded, loud and dark inside, food was ok. A lot of drink selection but the waitress didn't go over the whole drink menu with us, only focused on their cocktails. We didn't realized until later that they have an extensive list of rum, which my friend was bummed about not knowing firsthand and settled for one of their cocktail options. Very tight sitting for groups with more than 5.", "pics": null}}, {"review": {"des": "If you want to really feel a buzz, this tiki bar is the place to go! It is one of the hot spots of the city so I recommend reserving a table ahead of time- otherwise you would be standing for a long time and holding your drink because there are not many side tables. The lighting is kind of dark but the decorations are festive. ALL the drinks are strong and on the expensive side so be prepared. <br><br>The place is kind of hidden in the sense that the entrance is like in an alley between side streets. Right when you enter underground, you will notice skulls everywhere with a cool effect. The crowd is decent and I noticed more older people. I have not tried the food here yet. <br><br>Definitely recommend and a great place to start the night :)", "pics": null}}, {"review": {"des": "Such an awesome experience. My favorite drink of the night was the Aloha Felicia, but I thank the Fat Bottomed Mermaid for getting me fully tipsy :) This is a must-do!", "pics": null}}, {"review": {"des": "What could be better than a secret entrance to an underground tiki bar? Not much!<br><br>To find this place you have to go down an alley and open a mysterious door to go underground (trust me it is totally safe)<br><br>Once you get downstairs you enter a whole other world. You suddenly gone from Chicago to Hawaii.<br><br>The drinks are pricey but with as much alcohol that comes with them they are totally worth it! I suggest the one that comes on fire, so fun!", "pics": null}}, {"review": {"des": "A must in Chicago. I originally saw Three Dots on an episode of Best Bars in America and knew I had to check this place out. Even since then I always stop at Three Dots and a Dash on my Chicago trips. For the amount of people that come here the service is on point! I would recommend trying to make reservations well in advance so you can have table and enjoy a few drinks. It does get packed. The drinks are all so fun, you will want to try them all!!", "pics": null}}, {"review": {"des": "Went here for a friends birthday party...wow...what a hidden gem! The ambience is sooo cool, it has an amazing hawaiian theme and the music was on point! The only thing is that its hard to find, the entrance was in an alley, so it took us a min to locate but once we found it, it was on! There are light food options, such as a variety of appetizers, so make sure you eat before you come, because you are here to drink and have a good time, the drinks were soooo tasty! I definitely would recommend this place for a good get together with friends and highly recommend that you make reservations because the place get packed quick.", "pics": null}}, {"review": {"des": "This was one bar that I HAD to visit while in Chicago. I heard only good things and was SO excited when my friend said that we are going ! I'm sure all of the drinks are good because my friends and I all got different drinks and we all loved it. Yum yum yum! I wish I came here earlier in my trip rather than towards the end ! I'm definitely coming here again when I come back to Chicago !! Great drinks, cool/pretty atmosphere, and amazing service.", "pics": null}}, {"review": {"des": "Sure, there are better things in life than alcohol, but alcohol makes life better because I don't have any of those things.<br><br>Three Dots and a Dash is a legendary Chicago underground speakeasy beckoning you down a dark alley with a burning tiki torch near a nondescript doorway. No need to ask if you are at the right place. You are.<br><br>The bar is sooo busy! We had to hustle and jostle to get a pair of bar stools as soon as someone got up. This is not a bar for the timid or passive. <br><br>It is a bar for $16 tiki drinkies with names like Painkiller, Stripped and Go Naked, Time Traveler, and Aloha Felicia. Each is unique and super sweet, but with enough kick to eventually get you to a state where tiki is cool and so is your drink. Hell, maybe even you will be, too.<br><br>The crowd was definitely older, but filled with people who were there on a mission to get their drank on and get it on quick ... tiki-style. I fit right in. Sure, there might be better things in life than tiki cocktails served in cool containers the shape of a statue, skull, or coconut, but sucking down a couple of these tiki drinkies helped make life better for at least one night.", "pics": null}}, {"review": {"des": "This is an awesome little bar down the stairs somewhere in downtown Chicago. You'll get lost finding it if no one helps you but you will find your way! The drinks are very expensive but you've probably never had one the way they make them here. Its pretty much a club at night but its not a full blown dance club. While there is dancing, the dance floor is small. They have tables and a nice bar. Seating can be tough and if its crowded, getting a drink can be slow and tricky. If you wait long enough a table or bar seats will open up. I definitely would come back here next time in Chicago. Go for it.", "pics": null}}, {"review": {"des": "This place is such a neat concept. My favorite part of course is the fun cocktail tiki tumblers. Definitely worth ordering one of their signature cocktails to get one of these. The only problem is that it's very small, so if you don't have a table there isn't a whole lot of standing room.  Makes it difficult to really enjoy the atmosphere.", "pics": null}}, {"review": {"des": "When you walk down the stairs into the bar, it feels like you've escaped to a tropical island somewhere in Hawaii. This place does a great job at the whole tiki theme! It's adorable. <br>This place is 21+ and during the nighttime, they have a strict dress code. I tried coming here last summer around 9 pm but got turned away because my husband had sweatpants on, which I understand, because this place is upscale. <br>I Googled Three Dots And A Dash happy hour and found a bunch of websites indicating they had happy hour; yelp, trip advisor, etc. Don't let these reviews mislead you, they don't (and never had) a happy hour special.<br>When we sat down, we asked our server what drinks were they serving for their happy hour special. She told us they've never had a happy hour special and asked me to show her what I found online. I showed her and she brought her manager over and he said those aren't official happy hours by their company, it's just posts by random people that think they have happy hour. I thanked him for clarifying that and a few minutes later he ended up coming back with two zombie shots for us and told us \"here, we believe that every hour is happy hour\" and offered us complimentary shots. That was unexpected and sweet of him to do! The zombie shot was delicious! It was super sweet but also strong enough to give you a little buzz. <br>I ordered the top many chiefs drink because it had strawberries in it and I was craving some strawberries haha. The drink was tasty. You would think that it's light but after finishing it in 20 mins, I felt tipsy. My husband had then cobra's fang. On the menu, it indicated that his drink was on the stronger side and it sure was! It takes a lot for my husband to get drunk and he felt a buzz after just one drink. Both of our drinks were well crafted, strong and delicious. Pricey to say the least but they are generous with the alcohol portion and know how to make one hell of a drink. <br>If you're like me and you love anything tropical themed, you should definitely check out this place.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bEuO5qhLt8YEVU7-syijoA/348s.jpg", "caption": "Too Many Chiefs"}]}}, {"review": {"des": "I love coming here. The service is always amazing. The drinks are some of the best cocktails in Chicagoland. <br>I want to highlight and give a shout out to the host who assisted me and my folks who were visiting from California for their first time in Chicago. <br><br>Sharu went above and beyond. I made reservations on open table several days before our visit and when we checked in with Sharu shortly after my name couldn't be found for our reservation. I was confused and searched my email to find my confirmation. When I finally found it and showed it to Sharu she immediately noticed that the date was for another day of the week. I was shocked and disappointed that I didn't notice the error. Without even asking right away if it were possible to get a table, Sharu had already been thinking ahead and searching for an open table. Sharu not only found a table within a few moments, Sharu also gave us enough time for my parents and I to enjoy several cocktails before we needed to release the table to the next party. <br><br>Thank you Sharu!! you didn't have to accommodate us for my mistake but you did it anyways. You gave my parents who were excited to experience three dots and a dash the opportunity to. Thank you for the great customer service and positive outlook in a situation that could have ruined the evening for us.", "pics": null}}, {"review": {"des": "I am not a fan of this place. I came here on a Tuesday around 10 pm and it wasn't crazy packed (that was a good thing). It can be a little tricky to find the place because there is not a big sign or anything. Decoration wise the place is very cute. <br><br>**First DRINK we had was the Zombie, it was extremely strong and all I tasted was rum, we couldn't drink it. If you want to get wasted and love the taste of cheap rum this is definitely the drink for you. My favorite drink was the Wiki Wiki, it was very refreshing. My boyfriend had the Strip and go naked (his favorite) and Serpiente. <br>**FOOD wise we had: coco's coconut shrimp (it was amazing we both loved it), hanau spring rolls, yuca frites, and the tuna poke (don't recommend the tuna because there was not much of a flavor). <br><br>PROS: the waitress we had was very nice and tried to make our experience better. Big thank you to the managers for understanding that we didn't like the Zombie and gave us the credit to get other drinks. <br>CONS: the menu was very limited, there was no variety. <br><br>Overall this was not the place for us. But if you like strong/not great rum and want to eat certain appetizers then you should try this place. I personally don't recommend it.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BM2jmnrmxAdWAf6cdXl9CA/348s.jpg", "caption": "Strip and go naked (left) and Wiki Wiki (right)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/96YuRkJSgpgYJRXoLJ9tGA/168s.jpg", "caption": "The Zombie"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/X3-HbLHUt2up-1riDzD7HQ/168s.jpg", "caption": "The Zombie"}]}}, {"review": {"des": "This was another great find in Chicago via Yelp. It's walking distance from the hotel I stayed at, Hotel Felix, about 5 blocks away. However, the actual entrance of this bar was not easy to find because it's in a dark alley. Luckily, I saw some velvet ropes in front of a closed black door so I assumed it was the entrance and I was right. I really could've just called my friend who was already waiting inside but what's the fun in that?<br><br>This hidden tiki bar / lounge is actually underground which is accessed via staircase surrounded by skulls. Downstairs, half is a bar / lounge and the other is a full service dining room and the entire place is dimly lit. Got here at 6:00pm on a Sunday and the place was packed, so if you are dining, reservations are a must but we came here just to have cocktails. And as my friend mentioned prior, the cocktails were indeed well presented and strong.<br><br>I tried the 151 Swizzle (151 Proof Demerara Rum, Lime, Cane Sugar, Bitters, Nutmeg, Absinthe) and the Jet Pilot (Aged Jamaican Rum, Overproof Rum, Cinnamon, Falernum, Grapfruit, Lime, Bitters, Absinthe). I was very impressed with both but the Jet Pilot was extra delicious and lethal...lol :)  My friend got the Pandan Pain Killer (Jamaican Pot Still Rum, Barbados Rum, Coconut Tangerine, Pineapple, Pandan). I had sip and it was dam good too.  FYI, they also offer shareable drinks for up to 8 people served in beautiful bowls or creative contraptions.<br><br>Three Dots and a Dash is definitely a must stop while visiting Chicago. It's probably the classiest Tiki bar I've ever been too so prices were a little steep. Single cocktails are $14-$18 and shareable drinks start at $28 and go up to $385 depending on your preferred poison of the night.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/moHKUbybZjWq91mETMftmg/348s.jpg", "caption": "The Jet Pilot. Strong"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fKhGHzO0utKdHfFnHlGO_w/168s.jpg", "caption": "Left 151 Swizzle, right Pandan Pain Killer"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-h_cYXepx9Wu2OJbuEu8sg/168s.jpg", "caption": "The bar"}]}}, {"review": {"des": "All I have to say is wow!!! I love this place. Hands down incredible drinks and presentation. I love the ambiance. Service was great. We had Mary as our server. Only down fall was the fact that drinks were pretty over priced in my opinion but they were like nothing I have ever seen before.", "pics": null}}, {"review": {"des": "It's cool. Not too excited one way or the other. <br><br>Not really a rum drinker so I can go or not.  The food was just ok. Atmosphere just ok as well. I had fun with friends there but I don't have to go back. Very hot in the building last night. As we left the music got better. Service was good as well. <br><br>If you like rum and very big and obnoxious drinks this is the place for you!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wZ4uYX0Ad0MuPsK-U6zt2A/168s.jpg", "caption": "Dranks"}]}}]}