{"name": "tiztal-cafe-chicago-3", "reviews": [{"review": {"des": "I can't wait for this place to reopen.<br>Their oatmeal shakes are amazing - my favorite is the granola. Banana and pecan are great, as well.<br>The first time we went in, the wait was a bit long but completely worth is when the food came out. Any place that's BYOB will always earn extra points with me, as well.", "pics": null}}, {"review": {"des": "Best chilaquiles in all the land. The oatmeal shakes are great too. Even the side potatoes are amazing! Somehow they get the skin extra crispy while the potato stays soft and perfectly cooked. I love this place!", "pics": null}}, {"review": {"des": "Best chilaquiles to date. Finding good quality chilaquiles is something I search for in Mexican restaurants. This place, hands down, the best. And this includes places I've tried in Mexico. The chips are just crunchy enough and their sauce is perfection with the right amount of cheese and eggs how you want them. Did I mention their oatmeal shakes? Amazing. Food, everything to rave about. <br><br>The only reason I would knock out 1 star is because when they get big catering orders, they should accommodate by bringing more staff in or at least warn the already seated customers of the food wait time. Waiting over 45min after ordering food was a bit much especially considering the size of this place.", "pics": null}}, {"review": {"des": "I love this place but sometimes they disappoint. When i paid $22 for chilaquiles and a oatmeal shake to go you'd expect to at least get your fruit that normally comes with it. Also when you're making a shake to go, you should probably just make it when the person is there. The shake will actually be the consistency it should be. <br><br>This is the first time I ever ordered steak chilaquiles and I was asked how I would like my steak cooked so I said medium well. Well as you can see in the picture it's well done.", "pics": null}}, {"review": {"des": "I got dragged here by my roommate on a Sunday afternoon when I was grumpy and ravenous. The anger only grew when we walked in on a busy Sunday rush with not much order or process to seating. It's a small storefront restaurant with limited seating and a tiny, cramped entryway. The wait list was all kind of on the honor system. After about 10 mins of waiting without being acknowledged the party waiting there the longest correctly told the waitress which parties came in first. We stood in the crowded, small entryway for a good 25 mins before we got sat. <br><br>We were also rushed a bit the second we sat down. Busy waitresses asked us what we wanted the second she put menus in front of us. She took our drink order right away while we asked for just a few more mins to decide what to eat. <br><br>Ok, now that I got the negative out of the way (keep in mind the above was also  perceived through my hangry lens). Here is where the 4-star rating comes in: guys....these are the best chilaquiles I've ever eaten....period. This place is masterful at keeping a small menu (breakfast and lunch) and doing a few dishes really really well. The chips are a great mix of appropriately sauced with a tomatillo sauce and crispy. The cheese is plentiful and melted on in a gorgeous, gooey layer. The chorizo was excellent, and cozied up under a perfectly-cooked over-easy egg. In short, it's heavenly....I couldn't find a single thing wrong with it.<br><br>The potatoes are also excellent! They're crispy and well-seasoned, as good breakfast potatoes should be. The portions are huge, but I still licked my plate clean. <br><br>I'm only kicking myself for not trying one of their smoothies or specialty drinks. I will definitely be back to give those a try! <br><br>If you're hungover and looking for some amazing hole-in-the-wall Mexican style breakfast, definitely give this place a shot! Expect a bit of a disorganized wait during peak hours, but rest assured the food makes it worth it!", "pics": null}}, {"review": {"des": "Excellent local Mexican good. Excellent,  fast service. Must come back for more!!<br><br>Highly recommend the oatmeal/banana shake!!!", "pics": null}}, {"review": {"des": "I stumbled across Tiztal Cafe a little over a year ago on my boyfriend's birthday. I fell in love with Tiztal Cafe from the very moment I stepped foot into the door. Prior to visiting Tiztal Cafe I had never heard of or tasted a chilaquiles in my life. I don't think I can ever go back to life pre-chilaquiles. <br><br>During my first ever visit it had been during a time in the day when they didn't have a lot of customers or before a lot of people found out about the restaurant. We didn't have to wait at all because it was partially empty. <br><br>Fast forward a year later, if you come there after an hour after they open you will have a guaranteed wait. I haven't experienced too long of a wait time because they are very great at turning over the tables. During the warmer months they have a back patio. Tiztal Cafe isn't meant to accommodate parties larger than four people. <br><br>Every time I've visited Tiztal Cafe the wait staff is very attentive and our food always comes out with the quickness of speed racer. If you're going to visit this restaurant, you have to get the chiliaquiles. I've had all the types of chilaquiles so you can't go wrong with whichever you decide to other. Do not try to get the chiliaquiles delivered or order take-out because it is not the same as sitting down and eating them fresh. I've always been able to take half of my food home and it's just as great later in the day. <br><br>If you are on the go and don't have time to sit, try the different oatmeal based shakes that they have to offer. Holy cow batman, they are delicious! During my first ever first, we were given a free sample of the original oatmeal shake. <br><br>I can't say enough about Tiztal Cafe, you just have to visit!", "pics": null}}, {"review": {"des": "My first time here with a bunch of regulars, everything was great...food, service, shake!", "pics": null}}, {"review": {"des": "Best ice tea lemonade ever.<br>The food was great and the service was great. <br>I would definitely go here again", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WBfk2PTs7eO4ndC8mKt86A/348s.jpg", "caption": "Best ice tea lemonade ever"}]}}, {"review": {"des": "Come for the chilaquiles, stay for the oatmeal shake. Then come back for one of the delicious, made-right-in-front-of-you fresh juices. And the staff is stellar. A perfect brunch spot!", "pics": null}}, {"review": {"des": "Omg! I lived two blocks away for the past 4 years and just tried this place. It was very impressive. We sat in the patio area in the back, it was really nice. It's covered with two trees and I feel like I'm somewhere else. Food was really good. I got the steak chilaquiles. Potatoes that came with it is well seasoned, garlicky and crispy. The tortilla chips on the chilaquiles are home made, crispy and perfect. Verde sauce is also home made and so good! Service was also on point. This is my new fave breakfast place in the neighborhood!! Certainly will come back!!", "pics": null}}, {"review": {"des": "Just finished up breakfast here and am already thinking of which of my friends will be lucky enough to be invited next time I go--which just might be next weekend.<br><br>I had the chorizo scramble and it was perfect. Not overly greasy, came with great tortillas, and the hot sauce took the dish to another level. The potatoes were also crisp and super flavorful.<br><br>Bonus points for really good coffee that kept coming and service that was on point.", "pics": null}}, {"review": {"des": "It is official.  I can never eat steak and eggs if there is no green salsa, Mexican cheese and tortilla chips with them. Tiztal I love you.  I have no idea what the other dishes taste like and I don't care.  Wait, I did have a bite of The Heiress Apparent's Steak and Cheese Quesadillas.  Very good if you dip them into the green salsa, so get a cup of it.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EUZXL6zGcJFJIv-U9cnEng/348s.jpg", "caption": "Brunch for two, ready to go out on a balcony"}]}}, {"review": {"des": "I live on the south side but distance won't stop me from coming and eating my favorite breakfast dish.  The owner is awesome and service is great.  Love coming here and filling my tummy with authentic Mexican food.", "pics": null}}, {"review": {"des": "Friendly service, lovely clean space, and amazing food. I have tried a number of items on the menu, but my favorite is the Chilaquiles with steak. My husband swears by the chicken. Try an oatmeal shake, you can get it to-go!", "pics": null}}, {"review": {"des": "Chilaquiles,steak and egg is a must thing to try, steak is very tasty and it is really a perfect combo with the chilaquiles,egg and potatoes. Service is Great and very friendly..", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5gplFMtSqL7qZbkO7plL0w/348s.jpg", "caption": "Chilaquiles,steak and egg is a must thing to try!"}]}}, {"review": {"des": "This is our new spot. Best time to come, especially on Sunday, is after 1:45pm. Before that, you will wait a bit, but not too long. I've never had such great tasting chilaquiles! Their green sauce is so good. One of a kind! They put the right amount of cheese and sauce. Highly recommend the eggs and chorizo. Their coffee is great as well. Orange juice... wasn't that great, but everything else is delicious!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6foLvUYqnmaF6SFEqJf8og/348s.jpg", "caption": "Best chilaquiles with eggs and chorizo!!"}]}}, {"review": {"des": "Best chilaquiles in the city of Chicago. I mean this place knows how to do it right. Oh and the heavenly oatmeal shake which is delicious but don't be fooled by the name oatmeal as it's got icecrem, heavy cream and everything else under the sun which would make it taste great. It's so filling and with the amount of calories that must be in there you won't be left with anything to spare to actually eat your meal. Coffee is delicious and they always make sure you're topped off which I appreciate. Went on a Sunday with a group of 8 people and waited an hr and a half to sit down ordered our food and then waited another 1.5 to get our food. To be fair though, the server did mention right away that they were really busy and the kitchen was running a bit slow.", "pics": null}}, {"review": {"des": "By far my favorite breakfast place in Chicago and I'm never disappointed with their savory, cheesy and crunchy chilaquiles. If you're sharing chilaquiles with another person, order an extra side of hashbrowns because you don't want to start fighting over food in the middle of the restaurant.  <br><br>I also highly recommend their biscuits and gravy because they are perfect. Not greasy, creamy and every bite is good for the soul. By the way, I recommend ordering a steak to complete this meal.<br><br>For beverages, order the Oatmeal/Pecan milkshake and the Blueberry/Mango Smoothie. The drinks are on the pricy side, but once you start sipping you are not letting go of that drink. <br><br>Only downside to this place is that it's small, but during the summer time there is an outdoor patio in the back which feels so welcoming. Custom service is outstanding and the art work throughout the restaurant creates a cozy atmosphere.<br><br>Don't snooze on this place.", "pics": null}}, {"review": {"des": "This place is amazing.  The food is excellent the the coffee is worth the wait.  I recommend the place for any time.  During the summer outside is quaint.  I have been here three times and will always comeback", "pics": null}}, {"review": {"des": "This place is absolutely dirty from everywhere specially there plates where having dust on it, I don't recommend this place to anyone specially the lady Don her presents make me feel little intimidated, she was so rude with that delivery driver it's totally unacceptable from anyone to treat like that.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0x102q-vo9iahSFr43XPQw/348s.jpg", "caption": "This restaurant is unhygienic I found hair in my food.   NEVER GOING TO THIS RESTAURANT AGIAN."}]}}, {"review": {"des": "I came here yesterday on a whim for brunch and was really happy!  It's small and there's not much room to wait but they seem to get people in and out pretty quickly which is good.  I had the pesto omelette and added chicken and it did not disappoint.  They let me sub cottage cheese for toast which was much much appreciated as I left full and happy!  I'll definitely be back!", "pics": null}}, {"review": {"des": "Came here around 9:30 on a Saturday and we were seated right away.<br><br>I just have to say I have a major sweet tooth and picked this place solely because I wanted a shake (yes, for breakfast & my friend called me out for that lol)<br><br>Food: I had the Florentine omelette and my friend had the Meat Lover's Omelette; both came with roasted potatoes and toast. We shared the Oatmeal Pecan shake & seemed to be the only people enjoying a shake that early morning... it's fine, I think shakes are great at any time of day. Each table has a nice glass bottle filled with lemon water. Come hungry because portion sizes will fill you right up.<br><br>Service: Our server checked up on us right away and we told her to come back because we were indecisive. Where we WERE ready, our orders were put in quickly and we received our food pretty quickly. <br><br>Atmosphere: It's a nice and intimate cafe. Tables are close to one another & you sometimes lock eyes with your neighbor. The noise level was great -- everyone seemed to be enjoying conversation, so even though tables were close, you don't feel like people are IN your conversations. <br><br>Bathrooms: Large single bathroom. It was clean and that's all I ask for :)<br><br>Would I come here again? Absolutely. Probably a little earlier or around the same time because I hear it gets very crowded.", "pics": null}}, {"review": {"des": "Visiting from sf. Friend recommended this place. The food and grapefruit detox drink were outrageously delicious!  Service, atmosphere, cleanliness. All stellar!", "pics": null}}, {"review": {"des": "Basically everyone who's reviewed this place raves about the chilaquiles, including me. Today, after my daughter and I went to see a play, I was contemplating where we should go for lunch, and she said Tiztal! We only get to come here on the weekends and we were only 10 minutes away, so Tiztal it was.<br><br>I quickly logged into my Groupon account and they still have the Groupon! Of course I snatched it up. ($12 for $20 worth of food, so it brought our bill down from $40 to $20, or $32 total, before tip). <br><br>She ordered the chilaquiles with chorizo, which she loves, and I decided to try some crepes. I got the spinach and cream cheese ones, and they substituted chicken for the ham for me with no problem. They were wonderful! I'm a huge fan of crepes and these are very, very good. They were stuffed with the ingredients and while the order comes with two, I could only eat one. (That was probably due to the oatmeal shakes!) The order came with their breakfast potatoes and a lovely side of fruit. Yum!! <br><br>We get our oatmeal shakes with granola and they are absolutely delicious...and healthy. I don't know of another place that has these, and we love them. So now we've had our Tiztal fix...until next time!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WKifGyTl_uufV4h-JcPTtg/168s.jpg", "caption": "Crepes!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/v3cSnLNCLspDuKMO1st3zQ/168s.jpg", "caption": "Chilaquiles with chorizo"}]}}, {"review": {"des": "One of my favorite spots. The breakfast is authentic and wonderful. The service can be a little slow at times but mostly really terrific! Then I think you have to watch out as they're only open for breakfast and early lunch. I would probably eat there three times a day if they were open for dinner", "pics": null}}, {"review": {"des": "We ordered take out. First time ordering here and it was all amazing.  I had the chicken fajitas, no carbs, extra veggies and they prepared it perfectly.  The  sauce is outstanding - best fajitas I've ever had - ever!!!!  The other folks had the steak and eggs chiliquiles and they were equally happy.  The food was ready in 20 minutes like they said, and we will definitely be back!  Yum!!!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/us5gw98gY-Zucyq-A6sMlQ/168s.jpg", "caption": "Take out Chicken fajita with extra veggies instead of rice and potatoes- delicious!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jHy8-09m3FQB0En3OmGLFA/168s.jpg", "caption": "Lunch menu"}]}}, {"review": {"des": "Our favorite place for breakfast and lunch. Warm, cozy indoor space and spectacular, charming back patio. Their smoothies and famous oatmeal shakes are the best. My little son always orders steak and eggs and my spouse the chiliquiles with steak. I love their omelets. You can actually eat healthy here. They will always make my omelets with egg whites and lots of veggies. The side of fruit that comes with breakfast is refreshing and smoothies can be made to your specific needs. The owners are the nicest people and always remember our usual orders. This place is just different enough to make it a special place. Try it! You won't be disappointed.", "pics": null}}, {"review": {"des": "Outstanding! Excellent service and delicious food! Parking is easy. Highly recommend for breakfast, lunch or brunch. And...this comes from a picky eater!", "pics": null}}, {"review": {"des": "Came for brunch here the other day and had a good experience. The chilaquiles came highly recommended and so I ordered them with eggs and chorizo, and glad to say they lived up to expectations. The normal pitfalls of this dish being that the chips get soggy, or that there's a poor ratio of meat to other toppings, the iteration at tiztal was a large portion with plentiful crispy chips, generous amounts of cheese, eggs, and chorizo, and some delicious homefries to eat alongside. In fact, all of the breakfast dishes came with the same great side potatoes, well-seasoned and still crispy. The other dishes also looked good, especially the quesadillas and the oatmeal shakes.", "pics": null}}, {"review": {"des": "Our squad of three was headed towards a Halloween music festival so we dropped by for some fuel in our onesies. I discovered the place using Yelp and was surprised with the best breakfast I have ever had in years.<br><br>The three of us shared:<br><br>1. Chilaquiles with steak - Breakfast nachos = GENIUS. The steak was tender and the sauce was flavorful but not overpowering and the nachos somehow remained crisp and delicious throughout the entirety of the meal. This dish really hit the spot.<br><br>2. Short stack - We were craving some old-fashioned pancakes and Titzal's short stack delivered! I felt like I was being cuddled with love and warmth from within.<br><br>3. Egg white scramble - Light and flavorful and so well balanced and packed with vegetables.<br><br>The coffee was standard. We decided to split an oatmeal shake too and I deeply regret not getting one for myself. I had never had an oatmeal shake until then but damn it was basically delicious childhood breakfast in a drink and just so amazing! It wasn't even too sweet for me, like I expected.<br><br>Service was fairly good - our waitress was nice but a little forgetful (had to remind her about some things). Decor is interesting and feels like you're eating in a relative's home. Very cozy.  <br><br>The amount of food is great for the price you pay and the taste was just phenomenal. I wish I could eat here every week!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/r7T8REmbEpjUkCgFE6So5g/348s.jpg", "caption": "Chilaquiles with steak."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/j0ogu80lztb6VW6Cqz9qhg/168s.jpg", "caption": "Egg white scramble"}]}}, {"review": {"des": "I had the fajitas with white rice . This white rice is unique in that it can be eaten solo but it comes as a side . I asked \"Tere\" if you order with any meal, she told me it only comes with the Fajitas but will accommodate anyone that wishes to order it . Highly recommend this place . Cozy, friendly and delicious. I forgot the main attraction is their juice bar . Try the Oatmeal shake ,you will love it .", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lmbI38qTj3FuBHGNjZ-WFA/168s.jpg", "caption": "The ambience is authentic Mexican ."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/c3ewJ-0BCpMeS-R2ubnGqg/168s.jpg", "caption": "Beautiful decor"}]}}, {"review": {"des": "Solid breakfast, no doubt. What amazes me most about this space is that my kids attend school across the street, therefore, I pass this place twice a day for at least the last two years. I've never even noticed it. In fact, when it's not open, it appears to be under extreme lockdown. It's not the most inviting curb appeal; however, that doesn't seem to affect the crowds. <br><br>It was just featured on Check Please so I'm sure that will change the knowledge of this hidden gem in no time. While we were there, there was a constant flow of customers and lines at some points. I've heard service is hit or miss. For us, it was great. We had kids with us and they were patient with us and smart, bringing fruit to the table immediately. I had the Zepher Omelet; which was cheese on top of cheese with more cheese. So yeah, that was pretty good. The potatoes were excellent and of course...the oatmeal shake. <br><br>My kids went nuts over the oatmeal shake. The food was quality, didn't blow me away, but it was definitely good. I hear there is a patio out back; which I'm excited to check out once the weather is nice again.", "pics": null}}, {"review": {"des": "I love this place! The food is amazing, service is always perfect and there's a super cute vibe. I love coming here and hanging out on my laptop or stopping by for brunch. The chilaquiles are some of the best I have ever had, even after a trip to Mexico, and the oatmeal shakes are also amazing. Definitely recommend trying this place at least once, you won't regret it!", "pics": null}}, {"review": {"des": "The breakfast and brunch dishes here are absolutely superb; I literally do not have a single complaint about the food, coffee, or lemon-infused water on the tables. I had a fluffy, meat filled omelette with a side of potatoes; my fiancé had a egg and tortilla dish with sauce and a side of potatoes. <br><br>My only complaint hinges on it being my first time to this restaurant, and I had no idea what to do upon walking in--there isn't a dedicated host--and stood idly waiting to be greeted for a few moments before we approached a server for a seat. <br><br>Regardless of my initial issue of not being greeted, sat, or helped, this place delivered with delicious food. A day after our breakfast, my fiancé said, \"that was the best breakfast I've ever had,\" and I would have to agree.", "pics": null}}, {"review": {"des": "You come here for two reasons - the oatmeal shake and the chilaquiles. The chilaquiles are really the only proper remedy for a hangover, and you can get them four ways - egg only, with chorizo, with chicken, or with steak. The chorizo is bomb (natch) but pro tip! If you get chicken or steak, you can order your eggs any way you like them (chorizo only comes scrambled because it is mixed in). So if I am not in the mood for chorizo (whaaa...I know right, it does happen!) I will get chicken and get my eggs over easy. SO GOOD and giant and tasty and freaking amazing. <br><br>My only gripe is that when it gets busy, things tend to slow waaaay down. I waited 35 minutes from the time I sat down to the time I was served - thank god for bottomless coffee! So if you have somewhere to be I would definitely take note of this!", "pics": null}}, {"review": {"des": "A cute place to have a breakfast date, the service is attentive because of the limited space and the food is really good - I've really enjoyed their chiquales, biscuits and gravy, steak and eggs, shakes and general ambiance. They appear to always be full and the artwork is worth admiring as you wait for your food.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/N32vcNrXXPJepYtDy3AA1g/348s.jpg", "caption": "Blueberry and granola, oatmeal shake to go."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Y4T6_E5ExHpY6-70zsXxbQ/168s.jpg", "caption": "Strawberry, banana and pecan oatmeal shake to go."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KsfBXFLeNsxbzwrLPZtC3A/168s.jpg", "caption": "Art - purple rain."}]}}, {"review": {"des": "The only thing impressive here are oatmeal shakes.  Do the oatmeal and banana.<br><br>I doordashed this restaurant and was not impressed.  <br><br>Chilaquiles - with chorizo - very average and didn't come with tortilla chips like the menu states. The flavor missing something, too.<br><br>French Toast - beyond soggy and pretty below average.  Also didn't come with any of the sides like the menu states.<br><br>Spinach, Mushroom Omelette - average - not much filling at all.<br><br>Oatmeal Shake with banana - AWESOME.<br><br>Don't believe the hype guys.  This place is average and certainly doesn't give attention to their delivery orders.", "pics": null}}, {"review": {"des": "Yum. Yummy. Yummo.<br><br>We're giddy that we've found this restaurant just a few blocks away from us. It's been 2 days since we've visited Tiztal and my husband and I are still craving the oatmeal shake. OMG. Seeing the title 'oatmeal shake' made it seem like it would be some gross chunky mess. But thank goodness they brought around samples while we waited to order. One sip was all we needed to say, 'si, mas por favor!' They also brought out 2 year old a complimentary dish of chopped fruit while we waited. That alone deserved 5 stars for us!<br><br>Husband ordered chilaquiles and I opted for hash and eggs. His dish was way better than mine (he always orders better than me). But I didn't care. I was still in heaven from the oatmeal shake. <br><br>Yes. We will be going back. Had no wait to sit on a Sunday at 10am; they have a great outdoor patio in addition to their indoor space. It's my new fave weekend brunch space.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/s3Outmyk6Io94MPWTeR6Lg/348s.jpg", "caption": "Even the 2 year old agrees - the oatmeal shake is awesome!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AzeK21qeIy_wnmvzX6qHWA/168s.jpg", "caption": "Oatmeal shake (we added banana and pecan for the same price!)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Z0gYV-OWPqffl9WHB_dN1g/168s.jpg", "caption": "Chilaquiles. The green sauce is so delicious!"}]}}, {"review": {"des": "Tiztal Cafe is a uniquely delicious Mexican cafe in Chi Uptown area.  It is simply one of the best Mexican cafes I've been to.  They are primarily a brunch place (my favorite) and have a small dining room w/ bar.<br><br>When you arrive, do yourself a favor and order a drink/smoothie/milkshake, they have an eclectic, fresh menu of drinks.  I love juices and I ordered the Vampiro (beets!, $5) and was awarded with fresh pressed, sweet and earthy flavors.  Top brunch juice so far, perfect! You also can't pass up the famous Oatmeal Shakes ($6), unbelievable!  The best tastes of oatmeal blended into a satisfying and filling treat.  Wow! These are a new obsession!<br><br>I ordered the steak and eggs chilaquiles ($13), a heaping pile of freshly fried corn tortillas, covered in melted Chihuahua cheese, green tomatillo sauce and two perfectly cooked eggs with a side of potatoes (home fries style).  The dish was the perfect breakfast and deeply satisfying.  Also it was perfectly traditional and the restaurant made me feel at home, well fed and happy.  Bravo Tiztal!<br><br>(Service was spotty, food was delivered quickly, but check took forever.  Waitress was chatting with comadres so I get it.)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ukhDZ84k30iYHOHICtZydw/348s.jpg", "caption": "crispy, cheesy with a nicely seasoned, thin flank steak"}]}}, {"review": {"des": "The first time I came the food was amazing . The service was excellent. The second time service was horrible and we waited for our food over an hour. I normally don't write bad reviews but this place disappointed me. We came in and waited for menus for 15 mins. Then we ordered and waited for our 45 mins . I asked the waitress why was it taking so long and my children were so hungry . At that point a women from the kitchen came in the conversation and said excuses me let talk . You talked enough now it's my turn.... I was taken back but intrigued. She said \" we have an to go order we are working on \"......WTF....some of our party left. However I stayed I didn't feel like going to another place since I invested all this time waiting . Finally food came 1hr and 15 mins later . Everyone table around me got their food within 15 mins . No apologies,no amends ...just good ass food and nasty attitude . Wow", "pics": null}}, {"review": {"des": "I do not know what words to use to describe how phenomenal the oatmeal banana shake is at this place! Came here with some friends after a morning run! <br><br>The chicken chilaquiles were fantastic! I don't eat pork but my friends thought the chorizo omelettes and chilaquiles were delicious. The table also enjoyed sharing a fruit, granola yogurt with ice cream plate (i can't remember the name) that was a great way to end brunch.  <br><br>The mushroom swiss burger is the only thing I would say was just ok (not bad)but certainly not something I would order again with all the other fantastic options here. <br><br>Service was fantastic and everyone was very polite and hospitable! Will be back!", "pics": null}}, {"review": {"des": "Great breakfast. My wife and I both had the country fried steak and eggs. The gravy was wonderful. It didn't like paste or like it came out of a can like too many other places. The steak could be cut with a fork!  <br><br>It's a cute place. Clean. The service was okay though. A little slow. One of our orders was wrong and the kid who delivered it had a hard time understanding the issue (her eggs came over-easy instead of scrambled). Eventually, all was made right though. Things happen.", "pics": null}}, {"review": {"des": "Exactly what you're expect from a classic diner but so much better!  Love the chorizo and eggs and the juice definitely seems freshly squeezed. <br>The few ladies I've interacted with here are always super nice and helpful. <br>So happy to have this place nearby!", "pics": null}}, {"review": {"des": "Great food and such friendly service. The chorizo and egg chilaquiles are the best. So are the oatmeal shakes!  It's one of our favorite neighborhood spots.", "pics": null}}, {"review": {"des": "One of my favorite brunch places! Their food is really tasty, good prices, and most times the service is good too. Parking is usually very easy to find as well. They also have an outdoor patio in the back!  I highly recommend the chilaquiles & the oatmeal shakes!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-IcJ28H2XGtBWCJDUXKJSg/348s.jpg", "caption": "Delicious chilaquiles with eggs & chorizo... Two thumbs up!"}]}}, {"review": {"des": "Was on the hunt for a spot that had chilaquiles; mission successful. The green salsa that came with it was yummy. The cilantro potatoes were delicious, couldn't stop consuming them. <br><br>Tiztal meat omelet was standard, there was a heaping mound of cheese placed on top that made it undesirable for my taste. I prefer my cheese in the omelet.", "pics": null}}, {"review": {"des": "Many people have asked me if the merchants who put their deals on Groupon are any good.  I do admit that some are, but some are definitely not.  Tiztal cafe is one of the affirmative ones.  Well, I should say \"Affirmative\" with a capital \"A\" like Simom Cowell would.  <br><br>I did purchase a groupon recently when Groupon offered an additional discount toward the local deals.  It was $12 groupon, but it can be used toward $20 worth of food...so...let's dig in! <br><br>Tiztal Cafe was featured on one of the episodes of Chicago's Best.  I remember that they recommended the original creamy oatmeal shake.  Although it was pricy ($5.49 as of 01/31/2015), I wanted to try it since having a groupon allowed me to splurge a little.  <br><br>We also ordered the steak & eggs chilaquilles and omelet ranchero.  Unlike their drink menu, the entrees are priced pretty reasonably; most entrees are between $9.99 to $11.99.  <br><br>Of course we had to have our morning coffee.  Their entree portions are large.  My chilaquilles were hearty and made just the way I wanted it.  At once I thought I have finished it, yet underneath the steak there was more layers of goodness.  On the other hand, hubby's omelet was awesome.  The salsa sauce on the omelet was just right.  He saw a plenty of options for vegetarians.  <br><br>Back to the oatmeal shake, you guys should really try it!  It's worth it in my opinion.  With an entree this large, the amount of shake I consumed was adequate.  It's one of those \"feel-good\" drinks that doesn't overwhelm you.  <br><br>Overall, we had a very positive experience.  Service we received was very attentive and coffee-refills were continuously non-stop.  I definitely will come back, with or without a groupon.  <br><br>It's located one (1) block east to Lawrence Ave.  The CTA 22 bus (Clark) or the CTA 81 (Lawrence) can get you there.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KE0hX5b404dZxjJHCG35dw/348s.jpg", "caption": "Omelet ranchero"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/so1CP0SmO2fmgGAnFS4Afw/168s.jpg", "caption": "Chilaquiles (steak & eggs)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/L2HFrBqK6GDev2dV91isTA/168s.jpg", "caption": "The original oatmeal shake"}]}}, {"review": {"des": "Horrible. Staff was so rude, never said hi or good morning.  Seriously probably the worst service I've had in a long, long time.  My sister ordered a Mexican breakfast and she got eggs with no cheese and basically Jewel salsa on top.  Horrible, overpriced and absolutely rude service.  What a waste of $30.", "pics": null}}, {"review": {"des": "It's not my first time at this place but it will be my last today, the lady that received us at the front door was very rude, arrogant and not a nice person.<br>I asked a simple question, do we need to sign up to get a table, I do not see anything wrong with this question and that did it, she screamed so loud and this restaurant being so tiny everybody heard her and turn their heads to see what was going on........... \"there is people in front of youuuuuuuuuuu can you seeeeeeeee!!!!!!!!<br>I kindly asked that if we needed to sign up and if we did for her to write our name, she turned around and screamed even louder that yes we did need to sign up but there was people in the list that was in front of us.<br>The only reason I stayed is because my daughter loves their French Toast and we commuted from the far north suburbs<br>This lady happens to be the owners sister and if the owner gets to read this please please keep this lady as far in the back of the restaurant as you can, I am probably one of hundreds that have had this experience with your sister but one of the few that loves to write about our dinning experiences<br>Sorry to have lost you as our favorite breakfast place.......... good bye", "pics": null}}, {"review": {"des": "A tiny little place on N Clark in Uptown. It was quite a find. Great mexican take on brunch.  We ordered Chilaquiles, omelette, their oatmeal milkshake, french toast, biscuits and gravy, coffee, mango smoothie.<br><br>So, everything was excellent. Oatmeal smoothie :  can have it forever for breakfast. Everything was freshly made. Staff was great! Very attentive. The seat was bit weird, made a hole in my jacket because of a sharp edge on the installation on the wall. Such small things matter, but oh well. We had a great time!", "pics": null}}, {"review": {"des": "This is good breakfast food, so I give this restaurant 3 1/2 stars. You can taste the fresh ingredients in the potatoes and omelets. However, I feel it needs a little seasoning.  The pancakes were good but not worth traveling from Oak Park.  They do not have a lot of tables so you will be pushed to dine and fly.  Therefore, the wait staff was a bit terse with their interaction with customers. This is definitely a neighborhood preferred joint.  <br>Value 4.5 of 5 stars <br>Atmosphere 4 of 5 stars<br>Service 3.5 of 5 stars<br>Pancakes 3.5 of 5 stars<br>Omelet 3.5 of 5 stars<br>Potatoes 5 of 5 stars", "pics": null}}, {"review": {"des": "Saw this place on Check Please. It was delicious. We had oatmeal smoothie, chiquiles and chorizo scramble. All were amazing!", "pics": null}}, {"review": {"des": "My friends and I met at Tiztal's Cafe for brunch on a Sunday afternoon.  It is located on the busy streets of Clark where meter parking is readily available.  The restaurant is quite small, but quaint.<br><br>Tiztal's Cafe offers a small and simple menu.  I decided to try the corn beef hash topped with two sunny side eggs and the oatmeal milkshake.  The corn beef hash was nothing special.  It definitely needed more seasoning.  The oatmeal milkshake wasn't what I had expected.  It's more watery and not as flavorful as other oatmeal milkshakes I had tried in the city. <br><br>Overall, I had higher expectations due to the phenomenal reviews on Yelp.  The food was ok, but the service is what brought down the stars.  When we sat down, we were never greeted.  We had to flag someone down before we could even order.  People who were seated after us were already serviced.  If you want to be ignored and have an mediocre food, then you'll love this place.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nSBCFxbG5VjjWz84rFkE_w/348s.jpg", "caption": "Hash and Eggs"}]}}, {"review": {"des": "Four stars for the nice hidden backyard patio. My husband and I were taking a walk back from Heritage outpost coffee shop on Wilson and were looking for a close brunch spot. He had the chorizo scrambler, while I had a couple of eggs. I highly recommend the breakfast potatoes and fresh fruit smoothies. Our server recommended the peach, raspberry, and apple smoothies and it did not disappoint. Nice little hidden gem in the Ravenswood/Uptown area!", "pics": null}}, {"review": {"des": "Great shakes, delicious food! Wanted to see what the hype was about on them shakes. I had the oatmeal pecan shake($6)the taste was very satisfying and didnt leave me with itis like the ice cream type. Also had the chilaquiles with steak & eggs($13). The steak was nice & tender, cooked to order. Only thing I didn't like about the chilaquiles, the sauce was a little too sour for my taste. Must've added too much lime. Overall, I believe the meal was good but pricey. You can definitely find cheaper prices at other places but the quality was exceptional. The location is quite a drive for me and at those prices I don't think I will be going back anytime soon but I certainly recommend it.", "pics": null}}, {"review": {"des": "You want icecream for breakfast, but you want to be healthy? So glad you said that, why don't you just try Tiztal's oatmeal smoothie... you get your morning oats, protein, dairy and tons of sugar!<br><br>Tiztal is your standard diner fare where you can always find an open seat and something to satiate your cravings.", "pics": null}}, {"review": {"des": "Local brunch place, amazing chilaquiles of any kind, and wonderful amicable staff. My other faves are the leslie scramble (for lighter eaters) and the zucchini pesto omelet. The cilantro potatoes are out of this world and the vampiro juice is great for some morning recharging. There's also a secret backyard patio for summertime brunching.", "pics": null}}, {"review": {"des": "First time here on a Saturday morning with my wife, our 2-year old and a friend. we weren't sure if we would have to wait long for a table. Fortunately, we were seated right away and ordered chilaquiles with steak and chilaquiles w/chorizo. The steak was ordered medium and it was superb! Best chilaquiles in town and we've had our share in the north and south side of Chicago! BYOB was great as we brought some bubbly to celebrate friend's college graduation. Excellent kid-friendly brunch spot with great prices, amazing coffee and attentive staff!", "pics": null}}, {"review": {"des": "The food is always hot and fresh tasting, but the service can be slow. Even when the place is dead, they seem to move like molasses. The food makes up for this and is always worth the wait (albeit, sometimes a long one). Prices are reasonable and u get large portions. The potatoes are excellent with a lil salt and touch of garlic. Stop by for brunch or lunch (they close at 3p)", "pics": null}}, {"review": {"des": "This place is great! I ordered the chilaquiles with steak, along with the oatmeal banana shake.  <br>I felt the food was seasoned perfectly, not too much not too little.  I'm usually hesitant to order steak at breakfast because I feel like skirt steak can be a little chewy but definitely not here.  Meat was tender and flavorful.  Also, I had never had a chilaquiles dish before - the sauce was mild and not too spicy.  The potatoes that came with were also cooked quite well.  The oatmeal shake was very very refreshing - it was not too sweet and I liked it so much, I ordered one to go.  Good food and good service.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5INIVX0uOteXPBJg4l9uyQ/168s.jpg", "caption": "Side of sausage links"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9L4c9XyioU7NKeuSDWFR-w/168s.jpg", "caption": "Steak and Chilaquiles, perfectly cooked, good salsa (not too spicy)"}]}}, {"review": {"des": "Amazing food, very nice staff. You can never go wrong with the chilaquiles. I think I'm actually going to go get chilaquiles right now.", "pics": null}}, {"review": {"des": "Today was my second time enjoying lunch at this great place. Great food and the oatmeal pecan smoothie is just amazing. Worth the waiting time. Great customer service and friendly staff.", "pics": null}}, {"review": {"des": "Love love love.  This place is the best: the chilaquiles are to die for, the coffee is never ending, the shakes and smoothies are amazing.  I love the people, the ambience, the patio!  Come on!  It's by far my favorite place for breakfast on this planet.", "pics": null}}, {"review": {"des": "I've lived in Uptown for over 10 years and have JUST discovered this place last week! I am pleasantly surprised. I called ahead to make a reservation and the lady who picked up squeezed my friend last minute! When we arrived, there was literally a line out the door! Insane! But I could totally tell why. We ordered the basic breakfast (omelette, breakfast potatoes, etc..) and that's when I noticed people ordering a plate that had nachos on it and chicken/steak over! I was really curious as to what it was so I asked my waitress and she informed me that it was the main dish people come for, (chilaquiles.) looked delicious! <br><br>Going back this weekend to try it out. Definitely my new favorite brunch stop in the neighborhood!<br><br>OH, and freshly squeezed orange juice. YES!", "pics": null}}, {"review": {"des": "Best chilaquiles in the world. Period.  Not too mention their famous oatmeal banana shakes.  I don't want people to keep flooding this place (selfishly) but i have to let you know!!!", "pics": null}}, {"review": {"des": "Food was really good! I had omelette with tomato, onion, and feta with added spinach and mushrooms.  Feta in omelette was best I ever tasted.  My friend had chillaquilles with chorizo. She loved it.  My only gripe was coffee was horrible. That was a breakfast buzz kill! Atmosphere is nice and service is good.", "pics": null}}, {"review": {"des": "Probably my favorite breakfast spot in the city. super chill great spot.with awesome breakfast food and unique options. Try the chilaquiles! Also the oatmeal shakes are a must try!! Most recently I discovered they have the best little back patio!! Try it out, nice people, good food and service.", "pics": null}}, {"review": {"des": "This is easily one my favorite breakfast places in Chicago.<br><br>I've recently started going here pretty regularly. On the surface, it seems like a fairly straightforward Mexican breakfast and lunch place, but as I've been coming here more, it's not hard to notice that there are a lot of touches that make this place better.<br><br>Their menu is pretty great. I love chilaquiles and theirs are some of the best ones I've had in Chicago. The fillings in their omelets are very well thought out and well cooked. Everything is well cooked, in fact. Nothing is ever burned, everything is very evenly cooked and distributed. It's just very consistently well prepared. The garlic cilantro potatoes are great, the oatmeal shakes and smoothies are great. There are definitely some things I like more than others on the menu, but I haven't tried anything that I thought wasn't good.<br><br>Portions are generous, quality is high, prices are reasonable, service is friendly and they have a pretty nice outdoor space in the back.<br><br>I really like this place. If I had any gripe at all, it's that they could definitely have better coffee, but it's not a big deal.", "pics": null}}, {"review": {"des": "My fiancée stumbled upon this place using yelp. We came here for brunch on her birthday. <br><br>It was a Monday when we came so it was not packed. The place is a decent size (enough to hold about 40 people) and is decorated nicely. The wait staff was friendly and efficient. <br><br>Now let's get down to the real business, the FOOD!!! IT WAS DELICIOUS! I got the country breakfast and she got the steak and eggs Mexican style plus we ordered a side of pancakes (our motto: if you are going to try a place, try multiple things. If you can't eat it all, as long as it delicious, take it home). Everything was cooked with love and made me feel like I was in a little cafe somewhere in Mexico (minus the American touches on the food). <br><br>The only downside to this place was the bathroom. They only have one and it was ok but nothing I would want to stay in for very long. <br><br>Overall, it was a great experience! Go and enjoy!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HrVhj6lijddMQLO1UO3X8w/348s.jpg", "caption": "Pancakes!!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FVZiDmB9wE04474s7wtqbQ/168s.jpg", "caption": "Steak and eggs Mexican style."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1TUThiKI0wLZzTjbK7xVDQ/168s.jpg", "caption": "Country breakfast"}]}}, {"review": {"des": "We stopped by at this café for breakfast. The food was very good. We had the spinach omelette. The people were very friendly, very courteous. They even offered us a sample of their oatmeal milkshake which was delicious.", "pics": null}}, {"review": {"des": "The food is great, especially the chilaquiles! The price is fair, the outdoor siting is very cute and the service is good. Family friendly but sometimes you have to wait a little for a table and there is no baby changing station.", "pics": null}}, {"review": {"des": "I was lured into this place due to Groupon and was kind of hesitant because of its location but I am SO glad I went. <br><br>The inside of this hidden gem is beautiful. They were modern with a ton of art pieces that included their marvelous paintings. I did not expect the interior to be this nice. Upon entering, there was only one table occupied and the rest was empty. This is a major problem! More people need to go here.<br><br>Food<br>We all ordered their chilaquiles since majority of yelp reviewers spoke about them. I ordered the chicken chilaquiles and my boyfriend ordered the steak. It was fantastic! My boyfriend finished his entire plate while I had half to take home. The garlicky potatoes were fluffy, yet still crispy. The green sauce and cheese complimented the tortilla chips perfectly, not too bland and not too salty. <br><br>Service<br>Amazing! The server (I think owner too) was so sweet. She gave us a pitcher of water so we can fill on our own. The chef even came by our table to say hi when she was leaving. As for the oatmeal samples, the server came by to let us try some and boy, was it delicious. It was my birthday and they even included a waffle topped with ice cream and candle, so sweet. :) <br><br>Con<br>Shakes are too overpriced! About $6 and they are pretty small in size. I  also agree with a fellow yelper, add some music so I don't hear myself talking so loud lol.<br><br>If you haven't stopped by, you have to. I'll be back without a groupon, for sure.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6l_Eoz4DPp16cOsqic4gTw/348s.jpg", "caption": "Beautiful paintings!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Tz4m-r33S-jLqI0nXUUFWg/168s.jpg", "caption": "Chicken chilaquiles"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wOI6OvR0SzOJ-IMmGTsjaw/168s.jpg", "caption": "Birthday waffle :)"}]}}, {"review": {"des": "Every time I come here I get the same thing: chilaquiles. There's nothing better than tiztals chilaquiles with two eggs over easy and their amazing oatmeal shakes. Sometimes they'll have little samples of their shakes (try it and become hooked!)<br><br>It's a really cute family owned restaurant with great service and even better food. They have groupon deals quite often, which makes this place one of my favorite brunch places. Warning groupon not taken on Sundays!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OUTjqhXVBwbL7YYeCeeoog/168s.jpg", "caption": "Chicken chilaquiles with scrambled eggs. Steak chilaquiles in the background"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ErjsbD4r6ENAfR4_MdNJnw/168s.jpg", "caption": "chilaquiles and pecan oatmeal shake"}]}}, {"review": {"des": "I can't believe that I lived next door for almost 9 months and did not know this place existed! So thankful for my yelp friends for helping me find another gem in my neighborhood.  The oatmeal smoothie is amazing! So flavorful. It was $6. I only did takeout and they made it really fast.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qjSWbr_Ucj6bE_C6LEg5-w/348s.jpg", "caption": "Oatmeal Smoothie:)"}]}}, {"review": {"des": "Came in on Sunday around 12 and it was busy, of course. Only waited about 20 minutes for my party of 4. Was quickly greeted by a server with coffee, which was on point. Ordered the freshly squeezed orange juice and it was delicious. I got the chilaquiles Verdes with eggs & chorizo, french toast, and my boyfriend got the country fried steak breakfast. <br>Their homemade potatoes are so good! The French Toast was fluffy and yummy! Really enjoyed this place and the friendly wait staff. Only thing is maybe play some music? But overall awesome place.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4ilr8mNozkdsYZpyMdFkzQ/348s.jpg", "caption": "Jug of water with squeezed lemon."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fUtXnvTz9Gx7GDNYEC5aKw/168s.jpg", "caption": "French Toast."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/73lND2lXNkaqwAdldNCnpQ/168s.jpg", "caption": "Chilaquiles Verdes with chorizo&eggs."}]}}, {"review": {"des": "This is a neighborhood gem.  Quaint tiny space with attentive service.  The potatoes are perfection.  My omelette was delicious.  And the patrons nearby said - \"They don't get an egg wrong.\".  To the other side, the diners proclaimed - \"These are the best chilaquiles anywhere.\"  And they looked significant.  The waitress said that they make their own tortillas and chips daily.  Portion size ensures that you'll take a small box home.  And they tempted us with the oatmeal smoothie before we left.  New to me - made to order and quite tasty!", "pics": null}}, {"review": {"des": "This is my favorite restaurant in Chicago and I wish none of you would ever go here so I wouldn't have to wait in line on weekends.", "pics": null}}, {"review": {"des": "Clearly I eat too much cause most of my reviews are about food :(.<br><br>Enough about me though and let me sing the praises of Tiztal Cafe.  I had brunch there with my boyfriend recently and we were pleasantly surprised.  It's a quiet and unassuming place when you go in but when you get your food, you are made a believer.<br><br>My bf and I both ordered omelettes, mine with cheese and his without.  The omelettes were delicious although next time I may not get cheese, and definitely not queso.  If you get cheese without specifying how much, they cover the omelette in it instead of just bless it to keep the party going lol.  Because the omelette was so thick, I was still able to eat and enjoy the majority of it by flipping it over to the other side. Again, now that I know, I will ask them to go easy on the cheese or not get it at all which it doesn't need.  That day we also had the french toast which was AMAZING.  The last couple of brunch places I have gone to in Chicago have left me majorly underwhelmed but not Tiztal. The french toast was fluffy, slightly crispy, just the right amount of sweet, and golden instead of sad brown color.  All in all a tasty brunch and good service means I'll definitely be returning.", "pics": null}}, {"review": {"des": "Wow my wife surprised us this morning with breakfast out. And this little place was excellent!!! It's a Mexican breakfast eatery and even though I had your basic American breakfast, I believe I short changed myself. My wife and bonus daughter went with the chilaquiles!!! <br> I should have gotten that!!!! That dish is heavenly, it is steak with tortilla chips, eggs any style,all brought together with a mild salsa Verde sauce..... oh I almost forgot the Mexican cheese!!!! This dish by itself gets four stars!!!!!<br>   Our servers were very nice and accommodating. We also got our order super fast, there is nothing better when your food is still hot on the plate. By the time we finished that lil restaurant was packed. <br> I'm giving this place a thumbs up for an all around good experience. There is nothing like good food and good service.", "pics": null}}, {"review": {"des": "Went here for breakfast/ brunch recently with friends. Very busy place, but well worth the wait. Inlets are awesome as are the chilaquiles. Oatmeal shakes are delicious as well. We got a sample of one. Friendly people and great food. Nothing more can be asked for. Would recommend and go back again for sure!", "pics": null}}, {"review": {"des": "My wife and I tried tiztal the day they opened. It was amazing then and it's amazing now. We've never had a bad meal, everything is always incredible. But nothing compares to their oatmeal shake!!!", "pics": null}}, {"review": {"des": "A friend of mine had been telling me how great this place is ever since she realized how close I live to it, so one day my fiancé and I decided to go for breakfast. We have been talking about it ever since. There were 4 of us all together and we all got the same thing, chilaquiles. Trust me, it was amazing. I'm honestly not a big steak fan but I got the steak anyway bc I was told it was the only way to go and they didn't steer me wrong. They also gave us samples of the oatmeal shake and I am in love.<br>The staff is so friendly and since then I've been in a few times, the experience is always the same. Welcoming and friendly. The oatmeal shake is my favorite thing on the menu (oatmeal and pecan is to die for). The breakfast is great and their home made potatoes are so good I always wish I had a double helping. <br>It's not huge inside but it suits them, I honestly wouldn't change a thing about Tiztal.", "pics": null}}, {"review": {"des": "¡Espectacular! I had the chilaquiles with steak and it was amazing! The salsa verde and tortillas were obviously house made and the steak was cooked to perfection! The adorable little upscale space Tiztal occupies is both posh and relaxed, a rare combination particularly in this Sheridan Park/Uptown area which could certainly use more fantastic little restaurants just like this one. If you're in N Clark Street and you enjoy casual breakfast and brunch elegance, you should find your way to Tiztal... now!", "pics": null}}, {"review": {"des": "Amazing breakfast and great service!! A hidden gem. Will definitely come back when in the area", "pics": null}}, {"review": {"des": "I come here very often since I live right around the corner and they're awesome. My favorites<br><br>Chilaquiles with steak (SOOO delicious steak)<br>Veggie quesadillas (really tasty!)<br>Oatmeal pecan shake <br>French toast <br>Free fruit for kids<br><br>These ladies are always going above and beyond to make our dining experience positive. Sometimes the service is slow because they get swamped, because the food is delicious.", "pics": null}}, {"review": {"des": "Ever since I've discovered Chilaquiles, I've made it a mission in life to order it off every menu I see it on. Thus far, the steak and eggs Chilaquiles ordered here has been my absolute favorite. Though the steak was slightly overdone for my medium rare order, it was tasty and plentiful. Two over easy eggs sat ready to burst over my crunchy and cheese covered tortilla chips, all swimming in the most delicious salsa. <br><br>I stuffed myself to an uncomfortable level because I did not want to waste a bite on my plate. There was a slight wait for brunch on a Saturday and the tables were set up quite close together to get the maximum number of people in such a small space, but it was worth it. I came here with a groupon and only want to come back for more.", "pics": null}}, {"review": {"des": "Amazing! I've eaten there several times and it's always delicious. The chilaquiles are the best and the roasted potatoes are always crispy and well seasoned. <br><br>Don't forget to try the oatmeal shake, it's phenomenal!", "pics": null}}, {"review": {"des": "Ok, so I can safely say this experience was truly disappointing. To start off I never thought that I would experience any racism from an establishment that is also owned and run by people of the same ethnicity as mine. Was it blatant racism or was it subtle racism? You decide... <br><br>My girlfriend and I were excited to try this restaurant, because we had heard the food was good and the oatmeal shakes were amazing. So we decided to go ahead and start our day off with some breakfast from here. We arrived and the parking was easy to find. As we entered we were seated by the front door and there were two tables for 2 people further away and one table for 4 people next to us. <br><br>We were given our menus and asked if we wanted coffee. My girlfriend asked for one coffee and I opted for water. As we sat there looking over our menus and deciding on what to order, two people walked in and sat at one of the 2 person tables. Then following them four people walked in and sat at the table next to us. <br><br>Now remember, we had walked in first and had been there for a good 10 minutes waiting to have our orders taken before the other two parties walked in. <br><br>My girlfriend and I started to wonder when they would take our orders and started to look for the waitress or the person that sat us... And then I noticed that the waitress was already taking the order of the 2nd couple that walked in, you know that was okay; as long as we were next. But you know what happened next??? The waitress approached us and told us that she was going to take our order last after she takes the order of the table next to us! She was going to take the order of the people who came in last before our order and we came in first!<br><br>I proceeded to inform her that we had arrived first before either party and she has already bumped us down the line by taking the other couples order first, and I told her that she will take our order next and not the last table to arrive. She begrudgingly made a face and took our orders. It also turns out that this person taking our orders was the owner of the restaurant.. Can you believe that?! How is the owner going to mistreat her patrons. <br><br>I stood up and walked over to the hostess and asked to speak to the manager and she said that she can help me and the manager was actually our waitress. I proceeded to ask her why she had attempted to take our orders last and take the Caucasian peoples' orders first? Was it that we are Hispanic and have brown skin? Do they think we won't pay or tip as much?? She proceeded to smirk and ask how they can be racist if they are also Hispanic. I explained to her what Internal Racism was and that I know how, unfortunately, Hispanic people can favor other lighter skinned people over darker skinned people. <br><br>She didn't apologize at first until I told her that we were going to leave. And that's when she realized she would lose money and offered to put our order first, I told her that we didn't feel comfortable eating there any longer and we don't feel like eating in a disrespectful environment. She offered to give us oatmeal shakes while we wait for our food and I turned that down. <br><br>We aren't there to get freebies and we can't be bought off. I am disappointed with this establishment. And I am disappointed with the management and owner of this place. <br><br>Sincerely,<br>Giovanni RR", "pics": null}}, {"review": {"des": "Amazing. The food here is authentic and consistently tasty. We ordered the Chilaquiles and oatmeal shake and were overwhelmed with incredible flavors - it was one of the most satisfying breakfasts I have ever had and I highly recommend it. <br><br>It's a little out of the way, but well worth the hike. We came at noon on Sunday and were seated right away. Great service and friendly atmosphere - one of my weekend favorites.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cENJqLnRPkjVa0oCvDHq9Q/168s.jpg", "caption": "Chicken Chilaquiles"}]}}, {"review": {"des": "What a nice little find!  In the no-man's land between Uptown and Andersonville lies Tiztal, nondescript in atmosphere but with awesome breakfast food.  I showed up early for brunch with a friend, and offered to wait at the counter, since they were filling up. Graciously, they said it was fine to wait for him at a table.  I did so, with a nice little pot of tea (they had a dozen or so varieties to choose from).  <br><br>I was tempted by several things on the menu, but opted for the well-reviewed chilaquiles.  I got the standard vegetarian preparation, but you can add different meats if you want. This dish's reputation preceded it, and it did not disappoint.  Cheesy, crispy, just the right amount of spice ... I nearly ate myself sick, because the portion was so generous but the dish was so good that I didn't want to stop eating.  <br><br>Our server was attentive but didn't ever make us feel rushed, even as a line congregated in the foyer. To be fair, my friend said it isn't typically that crowded, but they had just had a Groupon offer.  <br><br>If this place was in my neighborhood, it would be a frequent stop.  I'd want to try their juices and smoothies as well, but I only have one appetite.", "pics": null}}, {"review": {"des": "I've been here twice now and both times I ordered the same item: The Florentine Omelette.  It was delicious the first time and the second time was no different.  My husband has had the Steak and Eggs and the Country Fried Steak.  They were also both delicious.  I like the consistently good food that comes out of their kitchen.  <br><br>A lot of people rave about the oatmeal shake but we have yet to try it.  You can also get juices here.  <br><br>Service is on point and very friendly.  This place is tucked away from the busy streets of Clark, but you will usually find a full house.  I would definitely recommend this place if you are looking for a good meal.", "pics": null}}, {"review": {"des": "This review is mainly on the owner and my waitress. <br><br>Okay so my sisters and I went in for some milk smoothies since I had a groupon for $20. We ordered them and let her know we were not going to order food, as soon as we did she started giving us attitude. The check came and when I went to pay she actually went infront of me and whispered into the owners ear and after that the owner was giving me attitude. She discounted the $20 of off my bill which left a total of $3 something (can't remember), so I pulled out my card and instead of her letting me know there was a $ minimum she just started saying that I needed to buy something else and her smoothies are $6. I wasn't sure if she was trying to confuse me or what?? but anyways I just ended up asking her how much I owed her and paid in cash. When I handed her my money she said I had to leave the change for the waitress which ended making me angry and I said no. I'm not sure if they're genuinely like this, but this experience ruined any chances of me coming back.", "pics": null}}, {"review": {"des": "Definitely try the Chilaquiles with eggs and steak. Don't forget to get a pecan/banana milkshake. This brunch will keep you full for the rest of your afternoon. <br><br>Prices are extremely reasonable!", "pics": null}}, {"review": {"des": "First time coming here with my sister, absolutely one of my favorite restaurant. Tried the Chilaquiles, steak and eggs, amazing !", "pics": null}}, {"review": {"des": "My favorite place for brunch in Chicago! The Chilequiles are the best I have ever had. I always get the Fresh squeezed orange juice and some pancakes as well. Just thinking about this place makes me hungry!", "pics": null}}, {"review": {"des": "Amazing! The chorizo chilaquiles, the chorizo scramble, and the oatmeal shake are out of this world. Friendly and fast service too. What else can you ask for?", "pics": null}}, {"review": {"des": "The food was amazing. I had Eggs Benedict but I was with 4 other people who all had had something different. Everyone loved it. Reasonably priced too. The venue is small so be ready for a wait. But it's totally worth it.", "pics": null}}, {"review": {"des": "Definitely one of my favorite brunch places to go to. Love the chilaquiles. Great service, fair pricing and amazing food!", "pics": null}}, {"review": {"des": "This place is a small place but much to offer. Great customer service! Very friendly.<br>We had cleansing juice which was very refreshing. Also the beet, Apple, carrot and orange juice was great too. For main dish, we had veggie dish and chilequetos with tomatillos sauce which was so yummy. Normally the veggie dish tend to be boring when you eat out but not at this place! It was so yummy. We also tried the oatmeal granola shake which tasted like horchata! <br>Kids loved their pancake, waffle, eggs as well!", "pics": null}}]}