{"name": "topo-gigio-ristorante-chicago", "reviews": [{"review": {"des": "Great Italian food! <br><br>We had the spaghetti and the veal. Both were prepared perfectly. <br><br>This is how it should be done. I highly recommend Topo Giogio and will be coming back as often as I can. <br><br>In addition to the food, service was attentive, friendly, and helpful with the recommendations. <br><br>A+ for this place.", "pics": null}}, {"review": {"des": "Simply put...I love this place. Stumbled upon this historic gem a few years ago and every time I visit I try something different and it's always just as delicious as the last. But, on those rare occasions that I order previous favorites, its just like the first time...every time! The kitchen is consistent, staff are efficient and nice. Intimate setting, nice variety of wines and classic desserts. <br><br>Favorites:<br>Burrata caprese<br>Farfalle Due Salmon<br>Chicken Parmigiana <br>Seasonal fish w/lemon caper sauce", "pics": null}}, {"review": {"des": "After a long wintery walk, I found myself in an area that I rarely visit. I  craved something that would satisfy me while at the same time not gorge myself. Good Italian food seemed appropriate, so I looked  to my trusty Yelp app and searched Topo Gigio where I found myself standing near. It seemed many people were happy enough for me to walk thru the door. The place was packed on a Wednesday evening, but there was overflow seating in the heated patio area just past the bar area. There were so many things that sounded good, I wished I was with someone so I could share something else. In the end I chose the \"conchiglie alla sarda\" which didn't disappoint. The shells were cooked to perfection and the tomato cream sauce clung to the pasta without being either too thick or soupy. I didn't really need anything other than that, no salad or appetizer or dessert- just a nice glass of wine. There was the obligatory bread and olive oil and grated cheese placed on the table before hand. If I was going to say one thing that wasn't up to par, it was the bread. It wasn't bad. It was just unremarkable. <br><br>The waiters were efficient and my food arrived without much of a wait despite the restaurant being busy. I'd go back without hesitation if I find myself in the area again.", "pics": null}}, {"review": {"des": "Really good Italian food! I got the mushroom tortellini - definitely recommend. They give you big portions, I had over half leftover for lunch the next day. They also have a large selection of wine.  The tables were a little close together inside as it was pretty packed. They also have a covered \"outdoor\" area that seemed pretty warm due the heat lamps - although we didn't sit in this section. <br><br>I would recommend getting the pasta while here!", "pics": null}}, {"review": {"des": "Wandering in Old Town, and stumbled on this quaint Italian restaurant. We went in because the food looked amazing from the people on the patio.<br><br>If you see a seat in the bar, it's up for grabs! We were able to find a little high top instead of waiting for a table. Started off with a bottle of Prosecco.<br><br>The server was on it, coming by to refill our glasses, fresh bread, olive oil etc.<br><br>My husband got the classic  spaghetti and meatballs. I got the eggplant parmigiana. Both were delicious! But keep in mind the eggplant does not come with any pasta. I didn't mind as I was able to steal some of the hubs pasta. <br><br>It was really cute: by the bathroom you can also see all the celebrities that have eaten here- Bill Clinton, Jerry Seinfeld etc..", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kVbsk8_yOVJBDnEAuAaVJg/348s.jpg", "caption": "Eggplant parm was good! Does not come with any pasta"}]}}, {"review": {"des": "This is a solid restaurant with good food and great service.  <br><br>Baby Friendly 3 stars<br>Kid Friendly 4 stars<br><br>We came here on Sunday for my Mother-In-Law's birthday.  My In-laws love this place.  I think it may be there favorite restaurant.  We had a reservation for 6pm on Sunday, and I am glad.  By the time we ordered, the place was packed.<br><br>I had the salmon salad.  It was great.  The dressing was a little salty, but with a housemade dressing that can happen.  The salmon was excellent, and it was a full piece.  The salad had a really great assortment of veggies.  This is exactly what I wanted for dinner, tasty salmon with veggies!  I would absolutely order it again!<br><br>I tried the pumpkin ravioli as well.  It was also really good.  It wasn't as much food as the salmon salad, but it was a great dish.<br><br>I didn't see a kids menu, but my toddler loved the spaghetti with meat sauce his uncle shared with him, and liked the pumpkin ravioli as well.  The staff was really great, and got him a high chair right away.  There is no changing table in the bathroom, but the handicapped stall has enough space on the floor to change a baby if you bring your own mat.", "pics": null}}, {"review": {"des": "On Tuesday early afternoon, this place was already busy so I had high hopes that we would have a great time and true enough my group wasn't disappointed. <br>Service was very efficient and portion sizes were decent for the pricing. I would definitely return to try the other dishes.<br>I enjoyed my fried calamari and linguini with clams - good for two people.", "pics": null}}, {"review": {"des": "I have never left a review before but Topo Gigio was so incredible I had to. This is easily the best Italian food I've ever had. The setting is incredible, dimly lit (in a good way) and feels like you're sitting in somebody's house. The service is great and attentive<br><br>The food, my goodness, I could eat it all day. We got the burrata special appetizer and it felt like I was eating clouds. The Fettucine special was an 11/10. Huge shrimp, loads of clams and crab meat and the perfect amount of succulent cream sauce. I cannot day enough good things about Topo Gigio and I will certainly be back", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MHUdq-YPtClvVmsbB949Bw/348s.jpg", "caption": "Fettucine special: Fettucine, shrimp, clams, crab meat, spinach in a tomato cream sauce"}]}}, {"review": {"des": "10/10 ALWAYS. Topo Gigio is by far one of the best Italian restaurants in Chicago and I recommend to everyone. We came last night, a few girlfriends and I, and all ordered CONCHIGLIE alla SARDA. I specifically always order this dish when I come because it's truly unbeatable. We shared a large cesar salad which isn't on their menu but we had asked for it to be made. Ordered great bottles of wine, too. I absolutely adore this place.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DZbE3AD_SeF2WuI5Vyp-Qw/168s.jpg", "caption": "Anti pasta appetizer"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QsSVflPk6fFqaX8H3P4yUg/168s.jpg", "caption": "Conchiglie alla Sardinia"}]}}, {"review": {"des": "Topo Gigio is WAY better in the summer than it is in the winter. <br><br>I came back here the other night and it's like it was a completely different restaurant! Last time I was here, the restaurant was almost completely empty, but this time, the place was packed to the brim -- even on a Sunday night! The outdoor patio with string lights was super cute, and the heaters kept the space cozy even at 65 degrees. The staff was super attentive and the service overall was pretty darn stellar. Before we'd even gotten our food, my fiancé was like, \"Is this really the same place we came to last time? It's completely different in every way!\" <br><br>When the food came, it was better too. Like best-pasta-I've-had-in-Chicago better. I had the conchiglie alla sarda with gluten free pasta, and it was AMAZING. The waiter didn't even skip a beat when I asked to sub chicken for the ground sausage. The sauce was perfectly creamy and gone were the copious amounts of oil I'd remembered from my previous visit. My fiancé loved his rigatoni dish too.<br><br>Now, I'd come back here in a heartbeat! The pasta was amazing, the portions were large, and the service and atmosphere were spot on. I don't know if the weather was what made things so slow and lackluster the last time we were here, but I'm already dying to come back again before it gets too cold!", "pics": null}}, {"review": {"des": "This is the cutest, most charming little open air restaurant! Perfect for date night or for a girls night out dinner.<br><br>We started off with the Burrata, it was good but was honestly a little underwhelming in comparison to other Burratas I've had across the country. At the end of the day - it's still a plate of delicious cheese, so it worked for me!<br><br>For my entree I had the fusilli alla Topo Gigio - amaaaazing. The sauce is a mix of pomodoro, bolognese, and four cheese sauce. Mixed with chicken, pancetta, and fresh mozzarella...man. It was phenomenal.<br><br>I definitely recommend it!", "pics": null}}, {"review": {"des": "I've always been happy with my time at Topo Gigio. It's a cute, romantic spot, but it wouldn't be awkward for going out with friends or family, either. <br><br>I've never disliked a pasta dish here! The only problem is that the food is packed with flavor and very rich, so you might need those oft-advertised yoga pants that look fancier but expand more ;)<br><br>The waiters are mostly older and friendly. They have plenty of interesting stories to tell!", "pics": null}}, {"review": {"des": "A neighborhood gem that is cheap but portions are family-size generous with delectable flavors and fresh ingredients. Always busy and popular among families and big groups! Calamari is a top choice. Pasta and fish dishes are also deliciously safe bets.", "pics": null}}, {"review": {"des": "We only ordered 2 pasta dishes so we can't speak on the whole menu, but we had a very good experience here. It's an old school Italian place, but they do it better than the average place. I tend to cook these kinds of Italian dishes at home more than I go out for it. I grew up eating this kind of Italian food. But they do things a little differently and it's a good thing. We had the conchiglie alla sarda and the rigatoni al filo di fumo. They were both seasoned well and tasted authentic. And of course the portions are big since it's an old school Italian joint. Inexpensive as well.", "pics": null}}, {"review": {"des": "Absolutely amazing food from appetizers, to entrees and desserts. Don't pass this place up...best Italian place in Chicago in my opinion. Great atmosphere and service as well.", "pics": null}}, {"review": {"des": "Very busy and popular old-school Italian restaurant.  Nice ambiance and good service.  The weakness really lies in the food.  All of the dishes our party ordered were very bland and uncreative.  The waiter really promoted the tiramisu which was probably the worst tiramisu we've ever had.  It is made in individuals dishes and basically tasted like you were eating cool whip with lady fingers.  Where's the espresso?  if you want hearty old-school Italian with great food I would recommend La Scarola far above Topo Gigio", "pics": null}}, {"review": {"des": "This is definitely one of the best Italian spots I've been to in Chicago- and that's saying alot! The atmosphere is quaint and that of a cozy nice Italian restaurant. I love the decor and warm lighting that made up the nostalgic ambiance of the place too. The service is excellent, knowledgeable, and timely. The complimentary bread is nothing to rave about, but the house wine is.<br><br>We had the Joe's salad to start, which was a nice refreshing add to the meal. My dad had the housemade fettuccine special with lobster, scallops, and other seafood in it. This was absolutely delicious, and the sauce was of just the right amount of flavor and lightness. My mom got the Linguine delle \"Cinque Terre\", which was also scrumptious. It had a nice touch of pesto sauce. My parents both thought these pastas were of the best they have had, though I got the seabass special and it wasn't as good. I think the pastas here are the right choice.<br><br>We also got the white chocolate raspberry cheesecake and the housemade chocolate cake for dessert- these were both delicious to share. The coffee was nothing special, but went down smoothly with the desserts. Overall, we had a very nice meal here for an excellent price too.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hs8MjJQMNmvmLBfIuz-uFg/348s.jpg", "caption": "Joe's Salad"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hLUxc5TxPAPRIkPWTslTnA/168s.jpg", "caption": "Sea bass special"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/O4oqcIBTFPYYuNjFnmteLw/168s.jpg", "caption": "Lobster fettuccine special"}]}}, {"review": {"des": "Your standard red sauce, Italian America, white tablecloth, Rat Pack soundtrack backed business model. From the bread and olive oil to the wall of past celebrity patrons, Topo Gigio delivers. I've had this dining experience at numerous Italian joints and hope places like this stay in abundance.", "pics": null}}, {"review": {"des": "While this was a favorite spot of mine while I lived in Chicago years ago, I am SADLY DISAPPOINTED. <br><br>I decided to grab takeout from them after a long day of being back working in the city this evening, and overall BAD experience. First, I was told their wait would be 30-40 minutes because they were \"very backed up\" and when I went to reply that that was fine, the guy tried to hang up. To give benefit of the doubt, maybe he didn't hear me correctly or they just didn't want to do a takeout order...?<br><br>Then, I let them know I have a severe nut allergy. The man's response was \"we don't have any buts here in anything\". I then clarified, \"not even pine nuts?\" (frequently in Italian restaurants) and he said no, none. I thought, ok great...even though I doubted this to be true after their online menu contains walnuts and pesto in items.<br><br>I ended up arriving early, my order was ready to go (in under 30 min). Great, if they hadn't tried to turn me away based on a long takeout wait time.<br><br>When I arrived home, the first thing I found in my bag was a side salad of sorts, with WALNUTS after I'd clarified I had a NUT ALLERGY. <br><br>***I have written no reviews for this place previously but I felt it necessary. FOOD ALLERGIES ARE NO THING TO TAKE LIGHTLY. Ever. Train your staff better please. ***<br><br>I have had many wonderful meals out here, but of all the times this is the second unforgivable experience I've had. The other too long to write about, but had to do with a drunk manager. The food is great here and so is the atmosphere. I hope the staff can get it together or this place will eventually go downhill altogether.<br><br>Honestly, way better spots in the city to go for good Italian.<br><br>PS: The \"Bruschetta\" is a joke. Small tomato on piece of bread. Sprinkle of basil. Drop of oil. No flavor. See photo.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2wkMbAqZNlTTciju0pJdpQ/168s.jpg", "caption": "Salad with WALNUTS after I told them I had a NUT ALLERGY."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/T_TMlSVXz1MInfUwWBWVeg/168s.jpg", "caption": "Sad bruschetta...it's one small tomato cut into 4. One small drop of olive oil. Dry."}]}}, {"review": {"des": "I was extremely disappointed by this spot. I finally had the opportunity to go for lunch with my coworkers. It is in a good spot in old town. I am vegan, but typically Italian can be very accommodating. The waiter was very rude. I asked some questions about the dishes like whether there was dairy or egg and he was bothered by me. I hate having to be high maintenance, but all I needed to hear was what pasta and sauces can I have. I ended up getting the rigatoni with pomodoro sauce, which was good, but I was so upset by the situation I barely ate. I don't ever see myself going back.", "pics": null}}, {"review": {"des": "I need to share my phone experience with the manager and I bridge her name is a Theresa (or something similar). We called to make a reservation for 3 weeks out. It's a party of 10. I understand Saturday nights are busy, and a larger party isn't easy, but we called over 3 weeks in advance and are going earlier to help with the accommodating. <br>The way this women spoke o me on the phone was THE RUDEST I've ever been spoken to. She seemed to be bother by something else and acted beyond inappropriate and actually hung up on me eye. I told her I didn't appreciate being spoken down to. She is on the service business and should treat people with respect. This manager needs to find s different occupation as she clearly can't handle people. VERY DISAPPOINTING. We will never go back there because of her!", "pics": null}}, {"review": {"des": "I have been going to this restaurant for 10 years on a biweekly basis. Hands down my favorite Italian food. None of this new bs trend of small plates here, just good old fashioned Family style Italian food. They know the foods good so you don't need \"trial size\". The Conchigle alla Sarda is a staple and deservedly so with a creamy red sauce bolstered with spice sausage and finished with Peas.  I also really like salmon so often partake in the salmon farfalle (WARNING: it does taste like fish so don't eat if you don't like salmon)<br><br>Long story short, can't go wrong unless you decide not to come here!!!!", "pics": null}}, {"review": {"des": "This is a super popular Italian restaurant in the heart of old town. Came here a little early with a party of 4. Since the restaurant was so busy, we couldn't get seated early. Once we were seated, we were served crusty warm bread with olive oil and a grated Parmesan cheese. We ordered a bottle of German Riesling ($31) which was deliciously light a sweet. For my main entree, I got the special which was fresh fettuccine with lobster tail, calamari, scallops and shrimp in a tomato cream sauce ($24.5). The pasta was cooked perfectly and the tomato cream sauce was delicious. The shrimp was a bit overcooked, but nevertheless it was still one of the best pasta dishes I've had in a while. My boyfriend ordered the garganelli con le luganighe ($16) which is a hand rolled pasta with porcini mushrooms and sausage ragu. The pasta was perfectly al dente and the sausage was flavorful. I will definitely be back for future date nights and other special occasions!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Wlu7QCERD19qcQO9ewxCYw/168s.jpg", "caption": "Garganelli Con Le Luganighe"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EnE66BhGQuC1xjSIXG4ocg/168s.jpg", "caption": "Special with fettuccine, lobster tail, shrimp, scallops and calamari in a tomato cream sauce"}]}}, {"review": {"des": "Read some reviews on this place and looked pretty good. Place is neatly decorated inside. But once we sat down, it wasn't busy but it was very loud. Tables were to close together so it felt like you were on top of each other. Table bread wasn't very good. The bruschetta was terrible. I got the carpaccio and that was pretty good. Wine list was small but had some good ones on there. They don't chill there wine, which if I'm gonna drop $100 on a bottle I like it chilled. Ordered our entrees, I got the ribeye and she got the whitefish. It came out in like 10 min. Which is nice if your in a hurry, but we weren't so it was kind of annoying. Waiter kept interrupting us while we were talking. Ribeye steak was extremely bland and over cooked. Her white fish was decent but not up to par from normal places.  <br><br>I would beware going to this place for a romantic dinner. We will not be back to this place.", "pics": null}}, {"review": {"des": "Atmosphere, service, and food: three important things in a restaurant. Topo Gigio on Wells checks all those boxes. I've always sat outside here but I've been inside and seen the patio in the back and all three areas look and feel great. It is very much family-friendly as the restaurant feels family-run (not sure if it is or isn't but I wouldn't be surprised if it is). The service here is really great as the wait staff is always making sure everything is going smoothly, and they're very attentive to their guests. Food is delicious, plates are large, and it isn't that expensive. My favorite dish is probably the burrata: the cheese is so creamy and tasty, and it comes with fresh tomatoes, cucumbers, and toast. Yummm. I'll definitely keep going back to this restaurant.", "pics": null}}, {"review": {"des": "Love the food there! We ordered Mussels and Clams for appetizer, Tortellini alla Panna, Spaghetti ai Frutti di Mare and Tiramisu. Seafood was fresh, sauce was flavorful and everything tasted good!<br><br>The portion was decent and we both feel stuffed after finishing half of the dish. Since this was our first time trying this Italian restaurant, how can we leave without Tiramisu? So of course, we tried it and loved it! Cute presentation and the love the texture of the mascarpone cheese mixture. <br><br>Only problem would be the slow service. The place seemed understaffed - only one server covering half of the restaurant? Had there been one more server, it would have been perfect!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0Z8qfERZyD002OrldyGQ9w/348s.jpg", "caption": "Tiramisu in a cup"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ywYMAa7UUXS7-6yISifEZA/168s.jpg", "caption": "Tortellini alla Panna"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PbF7nyHnTiqckIvomHFKlw/168s.jpg", "caption": "Mussels and Clams appetizer"}]}}, {"review": {"des": "I came here last weekend for my birthday and was blown away.  The ambiance is cozy and romantic but the food was the best Italian food I've had in years!  My fiancé and I both had chicken dishes and shared a pasta.  I normally don't indulge in bread but this olive oil was too good to resist.  I'm embarrassed it's taken me so long to try this place.", "pics": null}}, {"review": {"des": "1. Food was ok--not mind-blowing for a plate of spaghetti by any means. <br><br>2. Horrible management. There was an altercation between another customer and a woman in our party and we were spoken to very rudely and sworn out by the owner. I could not believe how terribly this was handled and from other reviews, this seems to be a trend. <br><br>3. Only redeeming quality: the general wait staff was very patient and polite. <br><br>Not worth the price on all points!", "pics": null}}, {"review": {"des": "Cute spot in Old Town for decent Italian food. Came here on a sunny Saturday for late lunch around 1:30p and was immediately seated.<br><br>Food: Started out with complimentary bread and olive oil. Good sized portions for apps/entrees!<br>GRILLED CALAMARI 5/5, best dish. Perfectly grilled and the lemon wine sauce was on point.<br><br>CONCHIGLIE alla SARDA: 4/5, most popular dish here so I had to try it! Thought it was good but not great. I think it was overhyped...<br><br>CLAM LINGUINE: 3.5/5, bae said it was on the bland side.<br><br>Service: Prompt.<br>Ambiance: They have an outdoor patio seating which allowed us to people watch.<br><br>Good Italian! But wouldn't go out of your way to try this joint if you're not in the area already.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xR-UzcFtHCsycslaG-qUIQ/348s.jpg", "caption": "Conchiglie alla Sardonia: sausage, peas and cheese"}]}}, {"review": {"des": "If you're going, please do yourself a favor and get the caprese. It was so fresh and extremely delicious. Fried calamari was good but a little fishy. Pasta was pretty good too. I would definitely return in the future.", "pics": null}}, {"review": {"des": "We love Topo Gigio. It is an Old Town neighborhood gem and we eat it, borderline too much! Our favorites are the burrata appetizer, the house wine, and the CONCHIGLIE alla SARDA. All of this is just as good as takeout as well.", "pics": null}}, {"review": {"des": "Italian food is my fave type of food so I was super excited coming here. There's a little bar area that's separate from the eating area which I personally loved because you can come in for a drink or have a full blown dinner without. The inside has a very classic Italian restaurant feel, it's very compact and dim lit and the tables are closer together. We had a bigger party so we made a reservation just to make sure we would have a table. We actually miscounted our party but despite that they were super accommodating and were able to push together tables so we could all fit comfortably. We came for a birthday and they were able to store the cake for us in the back so it wouldn't take up space on the table. <br>The menu is pretty extensive and the names of the dishes are in Italian which adds to the authenticity of the restaurant. I ended up getting a salad and the portion was HUGE. It's rare to be completely full from a salad but I felt stuffed after. The salad was really great tasting and very fresh. The way they cut the veggies added a lot of dimension as well. The pasta that my friends got were all huge portions as well but I think that's what you would expect from a classic Italian dish. When it came time to celebrate they brought out the cake all cut up already which was super nice so we didn't have to do it ourselves. <br>All-in-all a great night and great celebration at this restaurant.", "pics": null}}, {"review": {"des": "Loved the restaurant!  The food is delicious,  service is attentive and the ambiance is intimate and romantic.  We will definitely return.  <br>Try calamari salad and beef carpaccio - to die for!", "pics": null}}, {"review": {"des": "Sea bass with asparagus: 3<br>Conche alla sarda: 3.5<br>Grilled calamari: 3.5<br>steamed spinach - 3.5<br>Bread and oil: 3<br><br>Lattes: 3<br>Service: 4<br><br>Nice vibe here, from staff and patrons alike. Intimate seating along perimeter of restaurant, with larger tables available centrally.", "pics": null}}, {"review": {"des": "By far the best Italian I have ever had in my life.  I have been coming here for a little over 10 years now and it never disappoints.  The service and food is top notch.  Whether it's a 2 day visit or week long stay, Topo is always a must stop.  Highly recommend if you want to try the best Italian food in Chicago!", "pics": null}}, {"review": {"des": "I am madly in love with this place. <br><br>Perfect location, the service is good when it is busy, and the food is spectacular. <br><br>I just want to live in here and become super fat. This is like my favorite Italian joint in town. <br><br>I would not change a single thing.", "pics": null}}, {"review": {"des": "5 stars - without a doubt.  Dined here with my wife and a few friends - sat on the quaint-cozy patio as we were treated like royalty.<br><br>Anti pasta platter was amazing, as was the Sarda pasta that I ordered.  My only complain was that I was not hungry enough to enjoy it all in one sitting.  <br><br>I was going to take a picture, but I ran out of time.", "pics": null}}, {"review": {"des": "The staff here is truly amazing!  We went into the place to just have drinks and stayed for a fabulous meal! Linguini was home made and so so good! Very fine food!", "pics": null}}, {"review": {"des": "Excellent Italian near Wrigleyville. Had a drink at the outside bar, which is enclosed for winter. Great bartender. Excellent wine list - every price point covered. <br>Try the antipasto.  Large plate filled with excellent meats and veggies. Clams were outstanding. <br>We split several dishes amongst 8 folks - meat, fish, pasta - everything was great to outstanding. And add excellent service. <br>Great night at a fabulous place. Really don't think one can go wrong here.", "pics": null}}, {"review": {"des": "Stopped by on a busy Friday eve for dinner without a reservation . We were greeted warmly and were lucky to be seated . Great menu, lively restaurant with a warm and comfortable vibe. Did I mention the food ? Awesome !! Burrata special appetizer was tasty and delicious. The pasta special was also excellent .. we highly recommend Topo", "pics": null}}, {"review": {"des": "My favorite Italian restaurant in Chicago.  Everything is made incredibly well, service is great and sitting outside on their patio is the way to go when the weather is good.  The tomato cream sauce with Italian sausage and peas is simple, mouthwatering flavorful and that rich yummy sauce would be great on anything!   The seafood is outstanding. Fresh large perfectly cooked scallops and tender shrimp, with the tomato basil sauce were perfect.  Loved the garlicky fresh flavor of this light sauce that paired perfectly to let the seafood shine.", "pics": null}}, {"review": {"des": "The food is fantastic,  ambience is nice but not stuffy.  Great portions, great place to come with friends.  Highly recommend!", "pics": null}}, {"review": {"des": "Excellent Italian stables with some creative twists. Barramundi Fish filet was expertly cooked. Tiramisu desert was all I could have wanted.", "pics": null}}, {"review": {"des": "What I want to know is who designed the layout of this restaurant. I'm almost certain that the mentality was, \"hmmm, how do we cram as many customers into this restaurant as possible without inducing fire safety violations?\" The tables and chairs were so crammed together where we sat that there was absolutely no room to pass through. The back of my chair was touching the back of the woman's chair behind me. The server actually made me move my chair up more, but that forced me to move the table closer to the booth seat because I barely had room as is.<br><br>The food was okay. We ordered:<br><br>- Calamari alla Griglia (grilled calamari sautéed with lemon & wine sauce) - You can definitely taste the lemon flavor, which overpowers the dish just a tad bit. It's a light dish though if you're not in the mood for heavy food.<br>- Conchiglie alla Sarda (seashell pasta in a tomato-cream sauce with ground sausage, peas and pecorino cheese) - It's better to finish this sooner than later because the cream sauce tends to dry up if you wait too long. The first few bites are good.<br>- Linguine alla \"Vic Damone\" (linguine with little clams, olive oil, garlic, cherry tomatoes and fresh cilantro) - This was a light dish as well. However, it's just slightly on the bland side but still decent.<br>- Cannoli - My friend ordered this and liked it.<br><br>They give you complimentary bread, but I promised my friend that I wouldn't fill up on bread like all those other times we dined together.<br><br>The service could have been better. Our server didn't tend to us much, but the busboy came to us too much. He kept wanting to take away our dishes even though we were still working on them.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YKp2zHDkl-_Pxwi1KALcsA/348s.jpg", "caption": "Calamari alla griglia"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mmeW6qa9aUDh7L49kl7wRQ/168s.jpg", "caption": "Linguine alla \"vic damone\""}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gbY6e1SZZCLV-F1KCtOa1w/168s.jpg", "caption": "Conchiglie alla sarda"}]}}, {"review": {"des": "What an Italian spot that has so much authenticity, and so affordable! I had their chicken with potatoes which was cooked to perfection, while my gf was staying original and stuck with pasta, and she's a big pasta person and said it was amazing! Great staff, great atmosphere that's gonna make you feel like you're at dinner with a mafia member. LOL! <br><br>Everything was great, and the only exception is perhaps put up a sign or something that shows which door is the front entrance. I was confused as I was entering the restaurant. Besides that everything else is great!", "pics": null}}, {"review": {"des": "High Yelp reviews prompted me to suggest this place to my friend; he and I were looking for a casual place that served Italian food.  My bad!  Clearly I should have been more thorough with when I looked up the star rating, because I would have realized this place was a little more upscale than what we were looking for.  We really wanted more of a \"mom & pop\" type place, not an all-out dining experience.  The interior is very nicely decorated, and the atmosphere definitely offers a nice ambiance for a more laid-back romantic dinner.   The exterior entrance, however, is a bit confusing; we stood in a line, thinking it was to the entrance, but come to find out, it was the line for outdoor seating, and you have to go through the patio for the main entrance.  Good thing we didn't wait in that line long before we realized our mistake!  Everything on the menu is al a carte, so things could add up quickly if you are looking for that true dining experience with multiple courses.  Bread was hot and tasty, especially when dipped in the olive oil.  Service was excellent overall.  I ordered the chicken parmesan (okay, so I didn't try something new and unique)--no side of pasta, of course, and it was great!  I just KNEW this place could do it justice!  I was happy to see it came with a generous portion of wilted spinach.  If I had more time in Chicago, I probably would have returned to get that \"full-on\" dining experience, but I was happy with my experience this time, and would gladly return.", "pics": null}}, {"review": {"des": "Authentic Italian food. I had the fresh pasta special with shrimp. Perfectly cooked with well balanced flavors. Who knew my favorite childhood cartoon was OG italian  Yelp is to be taken lightly. We all have different taste buds but IMO, this place deserves all 5 stars. Thank you for the awesome experience. Will definitely be back when I'm in town again.", "pics": null}}, {"review": {"des": "I went to Italy and haven't stopped thinking about the food. This place is authentic. They offer gluten free pasta and know what can be modified. We had reservations on a Saturday night at 6 p.m. - the place was packed.<br><br>Quaint bar entrance for overflow or lounging. The wine selection? Incredible. Olive oil? Oh my sooo good. Dipped my finger in it because they don't have gluten free bread. Didn't think about  anything but wine because, well, it's Italian.<br><br>I had the California Sea Bass special that evening and it was phenomenal. My partner had the eggplant parmesan, nearly finished it. All seven in our party raved of our entrees. The wait staff was timely, direct (busy), and kind.<br><br>Loved the atmosphere - Italian in every sense of the word.", "pics": null}}, {"review": {"des": "Amazing restaurant! Fairly priced with awesome Italian. Definitely order the \"alla sarda\" and get the scallop appetizer. To die for!", "pics": null}}, {"review": {"des": "Went for lunch and found more joy in the price than the actual food. Don't get me wrong, the food is solid but also tasted like it's something I could've made at home and relied too much on the flavor of the meat. Granted I got the spaghetti and meatballs essentially for an affordable $10.95. The staff was so friendly and they were so on top of things that it improved the entire experience. <br><br>Love the olive oil and Parmesan combo they put on your table for your bread basket. And everyone else around seemed to really be enjoying their food. They had some great items on the menu and the calamari fritti looked super fresh and fried perfectly from a table away. Beware of you're looking for the frutti di mare pasta, they don't serve that for lunch.<br><br>Parking is never easy near here is the only call out I have, but once you find it there are other stores and bars around to visit if you're in the mood to meander. There are a couple of comedy shops nearby too if you've got tickets (Zanie's and Second City).", "pics": null}}, {"review": {"des": "The squid ink pasta was soooooo amazing! The best squid ink pasta I have ever had! And the moscato was also very good!", "pics": null}}, {"review": {"des": "I don't normally write reviews for places, but this one it is necessary to do so. I could go into details, but to summarize: <br>I was disrespected by a customer (physically and verbally). When I brought the situation to the attention of management, they didn't even offer an apology. <br>One other member of our party tried to address the situation to management, and she were disrespected and sworn at. <br>Apparently the customer that disrespected me was a \"regular\", and they saw no reason to even apologize. I wasn't even looking for a meal comp or anything. Just a simple \"I'm sorry\". Humanity, huh? <br>When my brother left the restaurant, he was given a very rude \"F you\", to which he replied how disappointed he was for such a disgraceful experience. <br>We paid our bill and will certainly spread the word to friends and family who live in or visit Chicago to avoid this restaurant. <br><br>Also, I speak Italian and a friend in the party speaks Spanish. So if you're going to be rude in a language you don't think your customers speak, think again. I wish I could give zero stars. What a horrible experience.", "pics": null}}, {"review": {"des": "Amazing patio makes you feel like you're in another country! The food took my breath away, from the mussels to the grilled calamari and to top it off the squid ink pasta! -melted my heart with happiness! Well done!", "pics": null}}, {"review": {"des": "The people who scored Topo Gigio less than 5 stars are either idiots or haven't had the tortellini.  Our group of 5 received a recommendation from our Uber driver for this restaurant, and all of us left agreeing this was one of the best Italian meals we've ever had.  (Including meals we've had IN Italy).  The only thing better than the INCREDIBLE food, was the FANTASTIC SERVICE! Huge shout out to Tony for making our night so memorable and wonderful.", "pics": null}}, {"review": {"des": "Can't believe I have never reviewed this spot. Classic Chicago restaurant in Old Town. I like the anti pasta, eggplant parmesan, and any of their pastas. Oh and the pizza is also amazing. They make some great (strong) drinks (ask for a lemon drop martini so good!) and have the friendliest service. I like to try to score a seat at the back bar which can be tough as it always is packed. Nice cozy atmosphere for a laid back Friday night. More fun in the winter IMO.", "pics": null}}, {"review": {"des": "Wow!!  Just Wow!!! <br><br>The food here is truly spectacular - this was discovered immediately the Caprese salad was delivered.  The mozzarella cheese was the smoothest and tastiest I've ever had. <br><br>I was looking forward to a great dinner- I had no<br>Idea it could be this good!<br><br>And to top it off - the staff make you feel so welcomes. <br><br>You're going to love that you came here", "pics": null}}, {"review": {"des": "Someone recommended this restaurant to my sister when we were planning our visit to Chicago. We took the Second City tour at 4 PM, and then got to this restaurant at 5:30 PM.   Within half an hour, the place was full. We were lucky to get a spot on the sidewalk on a beautiful evening.  It was a  Wednesday, and the place was full for the next two hours that we were there. <br><br>We split an order of Joe's salad.   Absolutely delicious, lots of great ingredients, and perfect dressing.<br><br>A white bread and a whole wheat bread with olive oil and Parmesan came with the dinner.<br><br>I had the fusili Topo Gigio. It was probably one of the top 10 dishes I have had in my life, and I have been to a LOT of restaurants. <br><br>My sister had the GARGANELLI  and it was excellent as well.<br><br>I would definitely come back to Chicago just to eat at this wonderful place.", "pics": null}}, {"review": {"des": "An old-school Italian place that is very much worth it! I was going to see a show at second city and needed to find a place for dinner before the show and I am so glad we chose this place! The food came fast and it was delicious!! The waiter was kind and everything was very tasty. I can see why other people enjoy coming here so much.", "pics": null}}, {"review": {"des": "I figured that St. Patrick's day was a good day for spaghetti and meatballs. I was right. I had not had it fir years and felt a yearning. This was a good place to quench that yearning. This is a classy place and I don't look classy but I was treated like a valued customer. The bread for the olive oil was good , fresh and crusty. The coffee was good. When I got the dish it was everything I wanted . It was like old school spaghetti and meatballs. The biggest shock was not that the food was good, I figured that. The surprise was that it was affordable on the lunch menu. I even had Spumoni (their's has 4 colors, green was added.) I have spent more for much less. The dish was ample. The ice cream was high quality and the service was also A-1. Next St. Patrick's day I may go for it again.", "pics": null}}, {"review": {"des": "I have been going here for years.  Great location in Old Town. You walk into a covered bar which is alway hoping or chose to dine in a simple but stylish restaurant.  Menu is simple Italian with great portions. Start with the baked clams or the calamari. For your main entree, I love the the Italian roasted chicken with potato chips ,  conchiglie alla sarda (ask for heat) as a pasta or the white fish.  The staff is so friendly and have been here for years.  The bartenders, Rudy, Tony, and Luca rule.  We always sit at the bar and enjoy a wonderful dinner and people watching.  A great value and enjoyable dining experience.  Get reservations or you'll never get in on a weekend. Finally, we had our rehearsal dinner here on the second floor and it was spectacular.", "pics": null}}, {"review": {"des": "Can't believe it's taken so long to write a review! We've been here close to twenty times and every visit is perfect. The food is amazing and the kind people who work here make it an even better experience. It's our favorite place in Chicago!!", "pics": null}}, {"review": {"des": "Outstanding Italian food in old town Chicago. Liked it so much we came two nights in a row. <br>First night was with a large group of 10. We got an 830 pm reservation and it was a wise move the place was full. Excellent bread and flavorful wine preceded dinner. I got the most popular item on the menu- I believe the fusilli topo gigo. It was basically pasta in a homemade cheese sauce with savory chicken. It was simple with powerful and memorable flavor. The serving was large and I could not finish.<br><br>Second night we  arrived within about 20 minutes of kitchen closing and were warmly ushered to an outside table. Under the warm<br>Summer skies of Chicago the garden patio is the perfect place for a taste of Italy. Por ti volare echoed in the background as we enjoyed our vino and fine Italian meal that was the finale of a long day in Chicago. I kept it simple night two: spaghetti and meatballs. The red sauce was not too salty and had brilliant garlic flavor. <br><br>Our server was gracious and friendly. <br>Food came out quick and hot. <br>Reasonably priced. <br><br>Will visit next time I'm in the neighborhood.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2c4ODP6YqHsuVhOumLjT-A/348s.jpg", "caption": "Night 2 spaghetti"}]}}, {"review": {"des": "This is by far the best Italian food I've had in Chicago! The pasta is amazing and authentic (just came back from a trip to Italy so I can make that comparison). We got the tortellini Alla pana and the conchiglie alla sarda. SO GOOD! You also get bread, olive oil, and Parmesan at the table before ordering. Also the people there are so wonderful. I had the chance to talk to the owner and Rudy at the bar for a good 20 minutes before my husband showed up and they could not have been nicer. They also know everyone! Clearly a fantastic family business that loves the food, what they do, and their customers. I'll be back many more times.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tDw7S3K3XivvdSdNJQAsGA/348s.jpg", "caption": "Conchiglie Alla Sarda"}]}}, {"review": {"des": "This place has probably the best Italian food I have ever had!! So glad we stopped by this place:)", "pics": null}}, {"review": {"des": "Came here with a big group on a Saturday night. Had a reservation and got right in. The ambiance of the restaurant is great; quiet, intimate.<br><br>Split a few bottles of red wine with the complimentary bread to start. Good selection of wines!<br><br>I ordered the Eggplant Parmesan. Wow. I can't even describe the melty cheesy saucey goodness. So amazing.<br><br>My friend had the creamy tortellinis, I can't exactly remember but it was great as well.<br><br>Everyone was incredibly happy with their meals and we ordered a wide variety of everything.<br><br>Highly recommend coming here, truly authentic Italian food.", "pics": null}}, {"review": {"des": "My husband and I are visiting from out of town and we decided to try this place out after seeing it on Anthony Bourdain's show. I had the conchiglie sarda pasta dish which was shell noodles, sausage, red sauce, and peas. The portion size was ginormous so be sure to come hungry. The dish was really good and I enjoyed every bite of it! I should also mention that I had the caprese salad to start, which was very light and refreshing. The most important tip I have is that you just order dessert!! We had tiramisu and the house made flourless chocolate cake. OMG, to die for!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hQ6AtFjqyjberyCXUYFXHg/348s.jpg", "caption": "Pasta dish, shell noodles, red sauce with sausage and peas"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QM0nigFV4QYo5sTIha1JeA/168s.jpg", "caption": "Flourless chocolate cake"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9hqi0SusH-z-83X-W9l5FA/168s.jpg", "caption": "Tiramisu"}]}}, {"review": {"des": "Stopping here was just a quick whim during the Wells St Art Festival. And I must say it was an excellent choice. We sat in the bar area and I sipped on a mojito. It tasted pretty fresh with mint and lime, not spectacular, but good enough. <br><br>The bread was pretty thick cut with a chewy crust. They brought extra virgin olive oil and grated cheese for dipping. We started with the fried calamari and I was really for a couple of reasons. First, they included the tentacles of the squid, the fun part to eat.The breading wasn't too heavy, it stayed light and crispy. Also, they brought out a small gravy boat of marinara sauce. The calamari was worth it just to get some of that marinara alone. It was vibrant and rich, not too light and not too heavy. And the portion was size was large, it would have been enough for three people, let alone two.<br><br>The Joe's salad is one of the craziest combinations I've ever seen. It has a lot of the standard Italian salad ingredients, but there's also some unique twists like potatoes, walnuts, and black raisins. The ingredients were top notch, especially the tomatoes, cucumbers, and roasted peppers. But what I remember is the cheese. There were two slabs of cheese on top: fresh mozzarella and fresh provolone. That provolone alone was so nutty and loaded with flavor. Honestly, all I needed was a loaf of that bread and the provolone.<br><br>The service was solid, our water glasses were kept full, the table was bussed promptly, and the staff was very engaging. Definitely worth coming back to.", "pics": null}}, {"review": {"des": "Greatest experience. Best wait staff, delicious food, and great prices. Went there at night and sat on the back patio. So beautiful and no bugs! Great place", "pics": null}}, {"review": {"des": "Great Italian spot near Second City. Pasta sauce is fantastic. Recommend the Cochigle ala Sarda. Could only finish half of it but wish I could eat it all. Very good. Indoor, outdoor and indoor-outdoor type seating. Good recommendation.", "pics": null}}, {"review": {"des": "The pasta was really good. However they don't do anything for birthdays. If you order a desert they will put a candle in it.", "pics": null}}, {"review": {"des": "This local standby is one of the most consistent Italian places in the city.<br>The food is excellent and the service is always friendly and accommodating.<br>We love sitting outside when weather permits.  They have a small but reasonably priced wine list with more than enough options to pair with your meal.", "pics": null}}, {"review": {"des": "Salad was tasty, very unique with the capers and tortellini were very good. The portabello was plain boring. This could be a cozy Italian restaurant, but I sat tightly up against a wall, that was on the other side of the restrooms. My BF was on the outside, he was hit and run into more times than we could count. Poorly designed and layout of tables.", "pics": null}}, {"review": {"des": "Hands down my favorite \"hearty italian\" restaurant in Chicago.<br><br>This place gets packed on weekends, so make sure you go early if you can! The staff here sometimes gets hard to understand (thick accents), the drinks are nothing to brag about, but there's a feeling of going to grandma's house for good hearty food that you just can't quite get anywhere else!<br><br>The seafood salad, the calamari, and every pasta I've ever had here are my favorites! The prices are by no means cheap, but food wise, you truly get a bang for your buck!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6l8MQaSpIRXjIOCpeNli2A/168s.jpg", "caption": "Tiramisu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aPEheJovlqwUZoGU1gxBSA/168s.jpg", "caption": "Linguine frutti di mare"}]}}, {"review": {"des": "Have been here many times in the past....it's apparently been a long while and alot has changed.  Without rehashing everything we ate, I will leave it at this: pasta in a long standing restaurant should be better than what you could throw together yourself at home.  Or at least not worse.", "pics": null}}, {"review": {"des": "I realized it was time to update my review, as I've been here countless times since my last review. Previously, I knocked a star off for service and I decided to add it back. The service is what it is, efficient and accurate but not overly friendly. That's fine, because you can have a conversation with your company and enjoy the amazing food. I'm not sure if Topo would count as \"under the radar\" as it's always packed during prime time dinner rush, but I don't think it makes it on enough lists for best Italian food in the city. I get the same dish every single time (conchiglie alla sarda) because it is so dang good, but I've sampled most of the menu since my wife switches up her order. I've had people from neighborign tables change their orders after my pasta dish arrives because it looks so amazing. The seafood specials are always great, and the fusili alla Topo Gigio is oustanding with the chicken and pancetta in a four cheese sauce. If you're looking for an appetizer, get the grilled calamari. You'll be soaking the sauce off the plate with your bread.", "pics": null}}, {"review": {"des": "Food is mediocre and service staff was stretched too thin.  I would not recomend to anyone.", "pics": null}}, {"review": {"des": "There are plenty of restaurants in this area, but Topo Gigio would definitely draw me back to them again. I arrived after a long morning of museum wandering to find a warm basket of bread to greet me. I may have groaned audibly as I reached for the first peice, but the waiter was polite enough to ignore me. I devoured half the basket before starting my actual meal. It was so good!!<br><br>I had the Conchiglie alla Sarda (seashell pasta in a tomato cream sauce with ground sausage, peas, and Pecorino cheese) since it was the general recommendation and was not disappointed. The sauce was a vibrant sunset orange loaded with cheese, the ground sausage provided a good earthy flavor while the peas were bursts of brightness. All served piping hot, exactly the temperature I like my pasta. Also, the portions are large. I was starving before the meal but could only finish half the dish. All the better, I got to enjoy it all over again as leftovers. Definite revisiting in the future!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rhrEGKU7AY5vUMfajRHWug/348s.jpg", "caption": "Conchiglie alla Sarda."}]}}, {"review": {"des": "My favourite Italian place in Old Town since I moved here in 2000. Quality has been the same for years. Expect a delicious, tasty meal every time. I had the black linguini with seafood and it was amazing even the next day! Portions are big and reasonably priced for being an elegant restaurant in Old Town.", "pics": null}}, {"review": {"des": "Always a delicious experience! The wait is super long and that is always a drag but once we sit down it makes it all worth it. Our server was polite and informative. He made the experience great. We say outside in the patio area which is a cool atmosphere. Their selection of wine is my favorite. We got a bottle of Sangiovese and loved it! The buratta is to die for! Can't wait for our next dinner here!", "pics": null}}, {"review": {"des": "I love this place! I can't even begin to decline how incredible the food, service and ambiance is at Topos. A fantastic spot for a romantic date, just grabbing some appetizers/drinks or with a group for a full course meal and a good time. All pasta is homemade, meats, seafood and ingredients fresh by the day and a family history that's palpable when you walk through the door. This is our go to spot and I would highly recommend taking any guests or smoky here.", "pics": null}}, {"review": {"des": "Great date night spot!! Easily shareable Plates and a great Authentic feel! We loved dinner EXCEPT we ordered what we thought was a charcuterie board; what you get feels like cold canned mushrooms, veggies, week old quiche (ALSO COLD), 3 pieces of hard meat and cheese. Truly so disappointed but otherwise salmon pasta was amazing!", "pics": null}}, {"review": {"des": "My husband ordered what you wanted which wasn't on the menu meatballs sausage and ground sausage in the meat sauce with angel hair pasta. It came out incredible. They use the bread was good quality.  I Ordered the spaghetti carbonara with chunks of prosciutto. We didn't order it but they use organic Niman ranch pork Which, to me, is an excellent indicator of the quality of food.", "pics": null}}, {"review": {"des": "I cannot express how delighted i was to come here.  After seeing Anthony Bourdain devour his pasta i decided i'll go here for my birthday.  My goodness, the shrimp linguine with scallops and clams was exquisite, and my dad asked for his prime rib well done and it came out well done. <br><br>The environment was open and friendly. I forgot to make a reservation but the hosts were uber friendly and my 30 minute wait was only a 10 minute wait.  I was also surprised to see it packed for a Wednesday but hey, good food brings good people. Thanks for the experience.I will be back soon.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FHEqk416qnspzQIM-J7OqA/348s.jpg", "caption": "Shrimp, scallop, and clam linguine in vodka sauce. Delish!"}]}}, {"review": {"des": "Yes this place has gotten lots of fame via Anthony Bourdain... No, that fame hasn't spoiled this place one bit! Located in the charming Old Town neighborhood, this place is the epitome of old-world Italian, family-run restaurant. The seafood is fresh, the red sauce is probably made from scratch by some sweet grandmother in the back kitchen and the wine list is full of carefully chosen, earthy and full-bodied beauties that will remind you of travels through Europe. There are quirky cartoons on the walls, lots of stools in the corridor patio and the former proprietor watches from above the bar. Altogether, if the ambiance and helpful servers don't win you over instantly, the cooked-with-love food definitely will! Go early before 6 or call ahead for reservations.", "pics": null}}, {"review": {"des": "This place never disappoints. I took my mom and Aunt here when they were in town for a great Italian meal.<br><br>Our service was excellent, the food was delicious and the cost is incredibly reasonable for how much food they provide you with. <br><br>Try the CONCHIGLIE alla SARDA pasta dish. It's one of my favorites here.", "pics": null}}, {"review": {"des": "Finally a place in Chicago with real espresso coffee!! Food was amazing as well. The rigatoni were spot on with taste and my husbands meatballs were seasoned perfectly. Their 1/2 serves for kids were a perfect size. I will say the calamari weren't the best I had and a little dry. But in all it was one of the better Italian restaurants we've been to in Chicago. And it was great cost as well. Will definitely come back to try other dishes!!", "pics": null}}, {"review": {"des": "Atmosphere was super cool. We sat outside in their back patio section. Very comfortable and quiet. <br><br>Immediately after being seated we were given fresh bread and waters. The bread was delicious and warm. They gave us olive oil and cheese also. <br><br>I was there with my family so we decided to try the grilled calamari before our entrees. It was good with a good sauce on top, but nothing too special.<br><br>I ordered the Conchiglie Alla Sarda. It is the most popular thing on the menu and I understand why. The sausage within the pasta was amazing and the sauce on it was full of flavor. My sister ordered the gnocchi and loved it. It came with a homemade marinara sauce on top. My dad ordered the special of the day. It was black linguine pasta with an assortment of different fresh seafood. He enjoyed his meal and was the only one able to finish it. My mom ordered the linguine with clams. She enjoyed it, but enjoys her own recipe more. <br><br>Overall the food was good, the service was for sure lacking. They seemed very lost and did not remember to bring things to our table when asked.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eQocMYfAaKwxxtwyMDyisg/348s.jpg", "caption": "Conchiglie Alla Sarda - amazing"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VtJUiSYJWHtDpE2BUarFqg/168s.jpg", "caption": "The linguine with clams"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iyN7KuVsLj0lOKC_Zy3OHQ/168s.jpg", "caption": "The special that day! Black linguine pasta with fresh seafood"}]}}, {"review": {"des": "Great Italian restaurant. I had the conchiglie mediterranea which is a shrimp and scallop pasta in a fresh tomato and basil sauce. It was delicious. My boyfriend had the pumpkin ravioli which is a special, and he enjoyed it. Their fresh bread is also delicious. There was great costumer service, and the food comes pretty quickly. Our server was very nice with the 300 questions I asked him.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2ypKPEsxV-w6JA4iQU0M5A/348s.jpg", "caption": "Conchiglie mediterranea. Shrimp and scallop pasta in a fresh tomato and basil sauce. Very good."}]}}, {"review": {"des": "Topo Gigio is one of the my favorite all-time restaurants. Which says a lot, as I am constantly eating. This place has an old school Italian feel that reminds me of somewhere my grandfather would take me to as a kid. The food itself, is phenomenal. I always get the Conchiglie alla Sarda or the Garganelli con le Luganighe. Whenever I'm in the Old Town area, I always recommend going here. It's been a family favorite for years.", "pics": null}}, {"review": {"des": "Cute outdoor seating area, but confusing strategy of this restaurant. The door is not clearly defined, and its hard to determine where to wait to be seated. <br>We were seated adjacent to the bar, in the outdoor patio area, which is beautiful. A server came out promptly with water and bread/oil/cheese. The bread was GREAT. The parmesan cheese had a hair in it. Still tasty though :/<br>Ordered the shells pasta (without meat), and the fusilli. Fusilli was great with a great amount of cheese and sauce, while the Conchigli was a bit sweet for my liking. <br>The servers are incredibly sweet and kind.<br>Apparently the bill is not bought out until you ask for it, which we were not aware of.<br>Nice vibe, ok food.", "pics": null}}, {"review": {"des": "Ok. We had 4 different dishes. All 4 of 4. Service great.  Trust me as an Italian I know good pasta. This is it. Rare. Great!!!", "pics": null}}, {"review": {"des": "Generally, I have had good experiences here and have been here many times over. Today, was a drastic departure. While I was standing at the host stand outside, the owner bumped into me. I said, \"excuse me\" to him. He got in my face and told me that he need not excuse himself, that he was the owner, and that if I did not like it, I could leave his restaurant. If this is how he treats women, I do not need to take my patronage there. No thanks, Topo Gigio. Hopefully the owner will learn some manners for his future patrons.<br><br>I have also seen other patrons leaving reviews on their Facebook page that express similar sentiments about the owner. Hopefully he can get his act together and fully understand that customer service and hospitality are fundamental concepts of managing a successful business.", "pics": null}}, {"review": {"des": "We were at Topo Gigio on Mother's Day-a very busy day for most restaurants.<br><br>Topo Gigio handled it all with great food and great service.<br><br>It was calm and lovely and moderately noisy.<br><br>The rose given to each mom was the best!", "pics": null}}, {"review": {"des": "I had never noticed this place in Old Town until my parents told me they wanted to have dinner here.<br>It's dark inside which makes for a romantic setting.  They do have patio seating out front on Wells Street.<br>We had a reservation but weren't seated for about 10 minutes after our reservation time even though our table was empty the entire time we were standing there.  <br>Our waiter was MIA most of the time.  However the bus boys were quick to refill our water and bring out our food.<br>Despite the crappy waiter, the food was really good.  We started off with the antipasto- it had grilled carrots, grilled eggplants, grilled artichoke (which was tough to chew), cheese & salumi, olives, mushrooms soaked in oil & seasoning, a piece of quiche. It was a lot of food...you could order this for 3-4 people as an appetizer.  I ordered the garganelli pasta which was so good. There was plenty of the sausage ragu.  My stepfather had the chicken parmesan (I am not sure where it is on the menu) as well as the spaghetti and meatballs.  He said the chicken parm was the best he's ever had.  My mom had one of the daily specials- black pasta with seafood in a red sauce.  There were plenty of scallops and shrimp mixed in with her pasta. The pasta's sauce was amazing. I could just eat a bowl of that pasta & sauce and be happy.<br><br>We ended with some desserts. I had a cannoli that was decent.  My mom got the tiramisu which I liked.  My stepdad got the biscotti- came with an assortment of cookies actually.  <br><br>I'd come back mainly for the pastas.", "pics": null}}, {"review": {"des": "THE OWNER IS EXTREMELY RUDE. We ordered 5 glasses of wine and the waiter did not even think to suggest a bottle which was $37 but chose to get us the glasses for $15 per glass. When we spoke to the owner he told us to take responsibility for our actions and then to \"get out of the restaurant\". He also told us we have \"no class.\" We have been coming to this restaurant for AT LEAST 10+ years and we also knew the owners father, who would have never treated us as the rude new owner would. Ridiculous. NEVER coming here again after all of our years as loyal customers!!!!!!!!", "pics": null}}, {"review": {"des": "The atmosphere is ace and the food is so tasty! Highly recommend! I love the outdoor area!", "pics": null}}, {"review": {"des": "My wife and I went last night.  It was the 20th anniversary of our first date.  The food and atmosphere was just as good as it was 20 years ago.  For an appetizer we got the smoked salmon.  It was fantastic!  I would come back just for that.  For the entrees I had the striped sea bass which was perfect and my wife got the seafood risotto that she loved.  Perfect meal and a great evening.  Thank you Topo Gigio.  We will be back.", "pics": null}}, {"review": {"des": "Very crowded with tight space between the tables but the food is amazing.  The scallops were cooked to perfection, the linguini with shrimp and pesto sauce was incredible. The sauce did not over power the freshly made pasta which was further complemented by the shrimp. The white fish with lemon and capers was delicious. <br>Servings are generous and although I couldn't finish my veggies I still could not pass on their totally delish chocolate cake. They also had a very nice wine list.", "pics": null}}, {"review": {"des": "Mi SUNY Optometry familia @ Top Gigio dining Italian!  Although my friends in Chicago's Old Town restaurant lost my reservation, they seated my large SUNY Optometry party of 12 immediately.  Thank you Topo Gigio!  I am very grateful.  \"I never ask for a second favor once I have been denied my first!\"  Topo Gigio's consistency for 25 years is defined by a very high quality Italian-American style, i.e. pasta made to a perfect balance of \"al dente\" and more American style--Chicago-style.  We had a nice balance of appetizers built around their Joe's Italian salad--an American kitchen sink of fruit, nuts, olive oil, cherry pomodora, and fresh greens.  We also had some outstanding grilled calamari, Romana bruschetta, and tomatoes with mozzarella.  Our meal centered around a blend of spinach with garlic, grilled codfish, and Topo's outstanding chicken marsala.  We hit the Chicago pasta overload with spaghetti basil, rigatoni, vegetarian risotto, tortellini, and my favorite Chicago linguini with white clam sauce, i.e. alla Vic Damone.  However, it is the family friendly service that earned them another rare 5 star review.  Topo Gigio is considered now part of mi familia, i.e. mi SUNY Optometry familia!  Grazie Topo Gigio!", "pics": null}}, {"review": {"des": "One of my favorite Italian restaurants in the city -- reasonably priced as well. Typically get the Spaghetti Ai Frutti Di Mare (which is to die for!) The wait staff is super friendly and make sure that your experience is an unforgettable one. I lived in Florence, Italy for four months and can easily say between the delicious Italian cuisine and ambiance, I really felt as if I was back in Italy. Can't get that at too many other Italian places in the city. Thanks, Topo Gigio!", "pics": null}}]}