{"name": "toro-sushi-chicago-3", "reviews": [{"review": {"des": "I love this place and go as often as I can. It is comfortable and unpretentious and the food is delicious. I have been to Japan several times and I have also lived on the west coast where sushi is abundant and fresh. Mitch and his team work hard - in Chicago (!) - to provide fresh and favorable food at an affordable price. Thank you!", "pics": null}}, {"review": {"des": "Got here early, early enough to pick any seat I want (before 6pm). Seems I remember they use to have special and this time they did not. I ordered a bento (1 side) and this time I picked beef. The beef looked like skinny strips of port and I had to ask the waitress \"Is that beef?\" Honestly, for $15 and the main item is beef - I really don't think I will order this again. <br><br>Glad I ordered the Sashimi entree, thick and beautiful. Service was good.", "pics": null}}, {"review": {"des": "This restaurant is small, but very busy - that's a good sign. We had several rolls. Some roll we would recommend are:<br><br>Spicy Golden Roll - delicious<br>Miami - yummy<br><br>A great place for sushi. We can't get sushi in the burbs. Highly recommended.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/955w5ZxeZ8tJNSDHErdgZg/348s.jpg", "caption": "Spicy Spicy Golden Rock (Donie & David)"}]}}, {"review": {"des": "The sushi was very good! The only downside is how small the place is, it truly is a hole in the wall with only a few tables. Be prepared for a wait just due to the size. <br><br>The volcano roll was so exciting! Almost like a birthday celebration, they bring it out with a sparkler.<br><br>Loved the spicy tuna crunch roll and the ahi tuna roll. The ahi tuna roll tastes a lot like ginger salads and has no rice btw.", "pics": null}}, {"review": {"des": "I'm not fond of sushi but an old friend who loves them was in town so here we were.<br><br>The staff promptly brought me hot tea after seeing me shivering from the sub zero temperature we had.  They continued to fill my cup throughout the meal which showed me they are very attentive to their customers.<br><br>I enjoyed the seaweed salad.  The portion was a lot more than other places that serve them.   The spicy tako was tasty and delicious.  I cannot speak for other rolls we ordered, however, my friend enjoyed every bite the kamikaze, spice tuna and three musketeers.  <br><br>The place is small and busy.  I love the names of their rolls.  They obviously do well from the great reviews and steams of customers coming in and out the evening.  <br><br>Overall, it was a pleasant experience and I would come back again for the seaweed salad and tako.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OxL_YRb52xqiUZNiC4YWVw/348s.jpg", "caption": "Age Doshe Tofu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5lVhZ_NR6XLGLje5EeZo3Q/168s.jpg", "caption": "Spicy tako"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3NuIMh7p1OSzoDv77etnLg/168s.jpg", "caption": "Kamikaze"}]}}, {"review": {"des": "Good but not great! <br><br>Food: Volcano roll - adorably served with a sparkler. What it had in presentation it lacked in taste. The roll was dry and there wasn't enough sauce. <br>Oh my god roll- amazing!! It has everything I want in a roll. It was fresh, crunchy, creamy and light all at once. <br>Jalapeño poppers- Tasted like a sushi roll in a jalapeño. Was spicy but no cream cheese! Not what I was looking for. <br>Salad- good dressing. Worth the 2 bucks. <br><br>Ambiance: crowded and small, but it was fine. <br><br>Service: Man they are on it. Good came quickly. The cleared our plates the second I took my last bite. Check was dropped off by one person, taken by another, and given back by someone else. I like efficiency so I enjoyed this service. If you want a long, stretched out meal this isn't your place. <br><br>Pricing: fair, a little expensive but overall decent value <br><br>Overall: So many better sushi places.. in the area even. I liked but probably wouldn't go back.", "pics": null}}, {"review": {"des": "I've been here a number of times.  By far some of the best sushi I've had in Chicago.", "pics": null}}, {"review": {"des": "A solid sushi place - 4 stars.<br><br>My favorite thing about this place is the portions - they're pretty generous with the seaweed salad, the miso soup comes in a larger-than-average bowl. The fish is fresh and the rolls taste good. Service is good for the most part - they're a bit understaffed on the service side. The only thing that wasn't so good was the bento box that one of us ordered to share - it was very bland and generic, lacking the characteristic Japanese sides, and the salmon wasn't tasty.", "pics": null}}, {"review": {"des": "Had heard great things about Toro Sushi and was excited to try it out! Waited a half hour for a table for two on a Friday at 7. Everyone that worked there was super friendly and helpful with the menu. Had the kamikaze, volcano, and o roll. My least favorite was the volcano roll because it seemed to be cooked salmon which I wasn't expecting. The kamikaze roll was amazing. Also had the miso soup which was as great on a cold Chicago winter night!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xaPxiOFnBUOE58nWTQ-j_Q/348s.jpg", "caption": "Volcano roll"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/b1w09s_1fs27ocuATReUUw/168s.jpg", "caption": "Great miso soup!"}]}}, {"review": {"des": "Go to Toro, sit at the counter/bar, and meet Mitch! Mitch is the Head Sushi Chef and he is so fun to talk to. His story is truly wonderful, and you can tell he is super passionate about what he does. I recommend going right when they open for dinner at 5, as they do not take reservations, and go with just one other person so that you can sit at a two-top or at the counter easily. (This is a great date night spot.) It's BYOB, so bring some wine/beer/sake to round out your meal.<br><br>The fish here is fresh and delicious, and the creative/specialty rolls are tasty and a lot of fun. My favorite things to order are the spicy tuna hand roll, Arizona roll (comes shaped like a cactus!!), and salmon crunch roll. Plus miso soup, of course. <br><br>The only reason I'm giving Toro 4 stars instead of 5 is that the service isn't always amazing. Sometimes you have to flag someone down to have your order taken, get more water, get the check, etc. But I still love this place -- it's really a great hidden gem, no-frills sushi spot, and I highly recommend it.", "pics": null}}, {"review": {"des": "Going on minute 80 as we were told it'd be 20 minutes to sit down. They have no system. Wine is now warm. If you have all night come entertain this option but if not just get take out and save yourself", "pics": null}}, {"review": {"des": "Outstanding place for Sushi BYOB. Master Sushi Chef, Mitch is a master of delicious fresh makki rolls.", "pics": null}}, {"review": {"des": "The rolls are great quality, the fish is fresh, the place is cool, the service is great, and the prices are right. This is a solid sushi spot. <br><br>We shared the volcano roll, the spicy tuna roll, the tempura shrimp roll, and the Philadelphia roll. They were all amazing, both because the fish tasted fresh and because they were really well composed. The volcano roll in particular stood out the most. Not only was it really well planted, but it had a lot of great flavors infused in it. I also loved the tempura shrimp and philly rolls.<br><br>The atmosphere here is really cool - sitting at the sushi bar is very fun. They have a great nautical theme going on and played awesome reggae music. The sushi chef is both friendly and funny. <br><br>If you're craving sushi rolls, you won't go wrong with this place.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4_oUlF-q_G1vZM2yeQYWpw/348s.jpg", "caption": "The volcano roll"}]}}, {"review": {"des": "We came here around 7:30 on a Sunday, and we were seated right away! Every time I walk by, its always packed, so I think we hit it right at a lull. I will preface this review with the notion that I am not the biggest sushi fan, but I'm so glad that I decided to try this place! <br>We weren't that hungry, so we got the spring blossom, Philadelphia, and a California roll. This was the perfect amount of food for the two of us. The spring blossom came in about 9 rolls, and both the Philadelphia and California rolls came with about 6 each. The food came out in a reasonable amount of time, and I'm not joking when I say these rolls practically melted in your mouth! SO good..the spring blossom was the highlight of the meal. Total it was about $25, which isn't too bad at all. There's such a variety of rolls, so theres never a shortage of different things to try! <br>Servers were all so friendly, and they kept coming up to us and making sure we were doing ok with everything. Also BYOB!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/U6SAciX64ayzGCKelC8fAg/348s.jpg", "caption": "california, philadelphia, and spring blossom rolls"}]}}, {"review": {"des": "Meh I've definitely had better. The miso soup had rotten seaweed in it. The salmon in my Alaskan roll was room temperature. The tuna in my Boston roll was the only decent roll. Definitely not worth a revisit. <br><br>Tr seating arrangements are tight and because of that it becomes quite noisy. I could hear three other conversations. <br><br>I'll stick to Green Tea or even Nori over this spot.", "pics": null}}, {"review": {"des": "Fantastic meal!<br><br>I had no idea that this little shop of delights would have me waiting for a table at 6pm! I suppose that is what happens when you combine cleverly named rolls, cloudy miso soup, BYOB and a friendly staff! <br><br>On a freezing Friday event, a friend and I met up to chat and chew. We ordered three rolls, green tea and a miso soup each. I would have to say our favourite was the Trixie which, you probably need to cut in half if you have a small mouth ;-) Loaded with all of our fav fish including soft shell crab, tuna, avocado and green roe. Thanks to the sushi chefs for taking off the unagi sauce. (we find it too sweet). <br><br>The wait for a table is fairly short and they will put your name down and call you when they're ready. But it really feels like you come for a great meal and leave promptly. <br><br>Downside? we were sat right next to the door so anytime anyone entered we were hit with a blast of cold air!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DzRt5iWUU83YogTXVls_Lw/168s.jpg", "caption": "Miso"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/v-2x-du68cWpIcSHbnya8A/168s.jpg", "caption": "Trixie"}]}}, {"review": {"des": "Toro is a somewhat hidden gem in Lincoln Park. By hidden, I mean it's sorta small, and if you were just walking in the area,looking for a place to eat, it would be easier to choose one of the larger more well known places nearby. I recommend giving Toro a chance though. <br><br>They don't take reservations, so come on a Tuesday or very early on a Fri/Sat if you don't want to wait. They're BYOB, so don't forget the wine. They have a handful of tables, or you can sit at the \"bar\" by the chef. I've been here a few times, but my most recent visit was earlier this week with a few friends. We shared some seaweed salads (pretty standard, but nothing out of the ordinary) and a few sushi rolls. The OMG roll was by far our favorite! The service was good, and the price was reasonable!", "pics": null}}, {"review": {"des": "Accidently bumped into this restaurant while exploring restaurants in the area. Pleasantly surprised.  We ordered the dragon roll, and it did not disappoint. I would come back for more!", "pics": null}}, {"review": {"des": "I've been here three times now in the past two years and Toro is still the shit!  Look, you aren't going to get a sultry, dim, chic atmosphere here.  It's a tiny no frills space (more than you would even guess) and it's perfect.  Best value I think I have had anywhere in the country frankly and it's BYOB!  We've always gone there right before 5 to avoid the lines or at least join a small line.  It's always so fresh and clean tasting.  Nowhere else can you get uni so good and cheap as well assuming they have it.  Can't wait to go back!", "pics": null}}, {"review": {"des": "Toro Sushi was busy when I stopped in for a late dinner. The sushi did not taste fresh. I won't be returning. Mediocre cheap sushi.", "pics": null}}, {"review": {"des": "The absolute best sushi place in the city! I get disappointed anywhere else I go because any other restaurant is not even close to being on Toro's level. Mitch is the head chef/owner and he is the best! The green mussels are a great appetizer.  \"Thats how we roll\", \"J.J.\", \"Southern Galz\", \"Volcano\", and \"kamikaze\" are my favorite rolls.", "pics": null}}, {"review": {"des": "\"Fish, to taste right, must swim three times - in water, in butter and in wine.\" --Polish proverb<br><br>Ok, this explains why sushi originated in Japan and not Poland. Toro is BYOB, so there's your wine right there. But Toro doesn't subject their fish to butter, thank goodness.<br><br>Mitch is Toro. Toro is Mitch. He is the owner who welcomes each customer with a warm fist bump and who reigns supreme as Master of his Realm. <br><br>Mitch knows fish like Einstein knew physics. He sees things in fish that others miss. And he has very exacting standards when buying his fish. After talking to him, I see how 95% of a good sushi restaurant happens in the buying of the fish before it even gets to the restaurant. You see this in movies like Jiro Dreams of Sushi. But Toro isn't fancy. In fact, the restaurant is a a bit shabby, but in a warm, comfortable way. You don't come here for the decor. You come for the fish and to kibitz with Mitch. <br><br>Rolls stand out here. Our favorites are the Trixie, Miami, and Three Musketeers. Sushi is wonderful and the sashimi is outstanding. <br><br>Tip: Mitch will grate real wasabi for you if you ask (for a small charge). It's sweeter and less astringent than the reconstituted powder that is standard here and other places.", "pics": null}}, {"review": {"des": "Great local sushi bar. It gets busy on weekends so be prepared to wait for a bit. It's BYOB! So take advantage and bring your bottle of wine... red wine pairs great with sushi in my opinion. Free street parking on Sundays since the parking meter doesn't require payment! Enjoy this local spot for sushi and good service", "pics": null}}, {"review": {"des": "Toro is absolutely the best sushi in Chicago.  The quality of the fish is just far better than anywhere else, and they also have sooo many rolls that are filled with lots of fishies and other good stuffs. I sat here eating today thinking about where they get their fish and confused why it's so much better than everywhere else in Chi. <br><br>The service here is kinda weird (quick but not super personable), the restaurant is kinda grungy, but the sushi makes up for it x10000. <br><br>I highly recommend the Chirashi Bowl, it's a great bang for your buck and all of the fish melts in your mouth. We also got the kamikaze & holla hollapeno and both were really good. The kamikaze had sunflower seeds and maybe macadamia nuts? But it was super crunchy and yummy, but just beware that it's only four rolls! <br><br>If you come before 6pm on a weekday it's super easy to get in! The only thing I hate about Toro is that they don't deliver, and aren't on any delivery apps either, so the only way to get it is to go there :(", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uE-mNAJGzwz1tSKa7y5iYQ/168s.jpg", "caption": "Best sush in Chi"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qR-Nyi8FzEnzNab1FLzJ3w/168s.jpg", "caption": "Holla hollapeno"}]}}, {"review": {"des": "I have four words melt in your mouth. This place may not look like much from the outside, but the sushi is to die for. When I tell you delusions and with every penny. Don't stress over the small space.... it's excellent.", "pics": null}}, {"review": {"des": "As you can tell based off the reviews this place is highly rated for a reason. I decided to check it out since it's been on my bookmark list for some time. For years i've been looking for an over the top sushi spot in Chicago & I can now say I found it! I've never had sushi so fresh, it's a small place that is BYOB. I tried the Oh my God Roll and it was exactly that! I also got to meet chef Mitch whom is super friendly and interactions with just about every person that walks in. It's a really nice touch to be able to connect with your customers as the chef/owner. The sushi is really out of this world. I highly recommend and I can't wait to visit again!", "pics": null}}, {"review": {"des": "We tried several rolls a Saturday night. Forgot the Names but they were good. Basically you got what you pay for. No surprise, but decent sushi. Korean owner Mitch was really friendly, introduced the fired matcha ice cream to us. Very rich, if you never tried, should give it a chance.", "pics": null}}, {"review": {"des": "Solid. Mitch is so kind and friendly that I gave an extra star. <br><br>The food is a good 4/5. I personally prefer simple and high quality fish for my sushi, nothing fried or smothered in sauce. Came in on a Saturday night right around opening and there were maybe two tables full and the bar empty. But by the time I left (5:50pm) there were already people waiting for tables and the bar had one or two seats left. <br><br>My favorite sushi in Chicago is the Crispy Maguro from West Loop's Sushi Dokku BUT the Spicy Tuna Crunch here was delicious and the tuna itself was incredibly fresh. Mitch is so helpful when ordering and just really kind and loves what he does. You can see his pictures with a few celebrities on the wall. Definitely one of the better sushi spots and is constantly rated well Thrillist, Zagat, etc. Come check it out!", "pics": null}}, {"review": {"des": "Love this place!! We got the \"Three Musketeers\", \"Cherry Blossom\", \"Crazy Horse\", \"Breezy\", \"Spicy Scallop\" rolls and everything was phenomenal!!<br>We also got salmon nigiri and a salmon hand roll. My bro likes it plain as it is. Before eating, we got compliments from the house. I don't know what it was called but it had smoked salmon wrapped in a crusty seaweed. DELICIOUS! My favorite Japanese resteraunt ever. Will be looking to go to this<br>Place again.", "pics": null}}, {"review": {"des": "Really wanted to get my fill of Chicago restaurants on my short 4 day visit, so I stopped in here for an in between meal snack<br><br>They are BYOB, so of course I brought in my 24oz. of beer. <br><br>Food: <br><br>Uni nigiri - my first time trying and I am not a huge fan, sadly. Chock that up to my taste buds, not the restaurants fault. <br><br>Spicy tuna hand roll - 5 stars. The tuna was so good and left in good size chunks as opposed to the tuna paste you sometimes get with other places in spicy tuna. <br><br>Tempura handroll - 5 stars. I've been craving more of these since I had it. Fried and fresh at the same time, I really enjoyed this. <br><br>Service was quick and the location was perfect to have lunch.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TJGziulCzRK3_lfWFImKLg/348s.jpg", "caption": "Tempura hand roll no kani salad"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VNnEvgobdiwbaZLFqrQWBw/168s.jpg", "caption": "Uni nigiri and spicy tuna hand roll"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/avG-TnHn4qYtaphvVN5oJQ/168s.jpg", "caption": "BYOB!"}]}}, {"review": {"des": "The sushi wasn't exceptional. The volcano roll featured tempura salmon and tasted slightly burnt, a little too crispy. The restaurant was a little crowded but you'll find that a decent amount of restaurants are in Chicago. The dragon roll was good.", "pics": null}}, {"review": {"des": "I have found my sushi home! (Please don't overcrowd this amazing place!)<br><br>That being said if you like quality sushi with great service and amazing chefs...go here. They're a small BYOB (no hard liquor) place and do to go orders. Definitely a busy place. That said they don't wear incomplete parties but the staff don't cut the quality service as a trade off (they're super knowledgable and personable). <br><br>Had an agedashi tofu, they hit the broth just right (I've seen places that add sugar...). Crazy horse roll, which was a server recommendation blast of flavor and fish (the cilantro was a nice touch). Salmon, Boston, and A SPICY TUNA. As you can see very traditional roll choices that highlight their quality...but I need to rave that they make real spicy tuna that isn't detracted in flavor with mayo, their sesame chili oil base won my heart as it reminds me of my home sushi place in Orlando (see Orlando--Sushi Tomi). Honestly this place isn't over hyped--it's represented with the quality they put in that so many people see. I cannot wait to come back!!!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gNLqdhlwNZBmq63bnTGpMA/348s.jpg", "caption": "Crazy horse (left) Spicy tuna (upper) Boston (middle) Salmon (right)"}]}}, {"review": {"des": "This is THE best Sushi restaurant in Chicago. It's small, adorable and has the freshest, most innovative sushi rolls in town made by Sushi Master, Mitch. This place is a gem and anyone who has left a bad review here is welcome to stay away, because the rest of us know that this place is pure sushi Heaven and it will make the wait for our turn to get seated even faster.", "pics": null}}, {"review": {"des": "The food: 3/5. I've been to Toro twice. The first time I went, yellowtail was very fishy. This last time, tuna and scallops were very fishy and of questionable freshness. Salmon was good both times. The prices are very reasonable, particularly for nigiri, the pieces of fish are very generous and about twice the amount of rice. However, the fish quality is average. <br><br>The service: 2/5. The service was friendly the second time when the place was dead, but the first time we were asked to leave because we were finished eating, even though we were still drinking our sake. The place also has a very strong musty smell I can't get over. <br><br>Overall: 3/5. Reasonable prices and decent service if you're not too picky about the fish quality. If you're looking for the best or the most authentic sushi in Chicago, go elsewhere.", "pics": null}}, {"review": {"des": "Toro sushi is an unassuming restaurant south of Del Seoul. They are a pretty small establishment that fill up throughout the entire night. Come early!<br><br>Tako. His favorite between the two maki. Made of sliced octopus, kani, sesame oil, sunflower seeds, and spicy mayo. Love the surplus of meats piled on top. <br><br>Kamikase. A combination of three types of fishes bring the maki roll very packed with protein and squishy. I personally think this roll was enhanced with the sesame oil.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dbA4cZC1IA4rCjfX62kzPQ/168s.jpg", "caption": "Kamikaze."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ikHbU62971POYdlVxYrw-w/168s.jpg", "caption": "Tako sushi"}]}}, {"review": {"des": "The hamachi hand roll and the tako nigiri was so FRESH! Simple no frills place.<br><br>However..:the $9 uni was not fresh. Had a very strong odor and flavors..like farts! One star off for this but I am really tempted to deduct more. Sad because it was the last pieces we ate.<br><br>DON'T ORDER THE UNI!!! *shudder*", "pics": null}}, {"review": {"des": "Crazy horse, trixie, spicy tuna temaki are the new faves! Mitch and team, as always, were amazing! Pig in the sea was a new try, not sure we're crazy about it but love love love the menu and service here! Worth the wait and byob isn't bad!<br><br>Tried the kamikaze, sunny and big Tex last night. Sooo good! Worth the wait and sitting at the bar is always fun!", "pics": null}}, {"review": {"des": "The weirdest part of 4/19 'What the What' Wednesday happened right away, so I'm glad it was over fast!<br><br>My friend and I decided to try Toro Sushi because of good reviews, but were disappointed from the moment we walked in. We arrived a little after 5:30, and we sat at the front left table facing the window against the wall. There were just 2 other people sitting at the sushi bar, so we beat the rush. Our server asked if we were ready to order although we just sat down and I told her we needed time. We never saw her again. <br>I opened my menu and saw some of the dirtiest stains ever. Both of our paper menus had brown stains (on the INSIDE of the plastic) and were grimy. A new table had sat behind us and received some of their food and we still didn't see our server. While we waited for over 10 minutes for our server to come back, I noticed a musty smell from the wall on my left and my friend told me we should leave because he was completely grossed out. We got up and walked out. The chef called for the server and pointed at us, but we were already out the door. I left confused and sad. I won't be back.<br><br>*We went to Kabuki (check there for my review for part two of my 4/19 'What the What' review).", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ps3ixiHZZnrXbDepB8ltmA/348s.jpg", "caption": "menu madness :/"}]}}, {"review": {"des": "The sushi was so fresh and fantastic. The owner was behind the sushi bar helping make the sushi and was incredibly friendly. He clearly cared about the quality they were putting out. My boyfriend and I both agreed this was some of the best sushi we have ever had! We will be back", "pics": null}}, {"review": {"des": "Loved it!! Fast, clean, great sushi.  BYOB <br>It does get full fast.  So make sure entire party present or else won't be seated.  No rsvp. <br>Reasonable cost of sushi. The area is small they do have carry out and sushi bar.", "pics": null}}, {"review": {"des": "First timer last night and loved everything. Sat at the bar and enjoyed the show and beautiful artistry. Tryed Chef's choice Sashimi, tempura shrimp and the MJ rolll. Wanted more of all. I would totally go back for food, atmosphere and service. BTW BYOB for beer/wine only.", "pics": null}}, {"review": {"des": "Clark Street in Lincoln Park probably has about 5-6 sushi restaurants within 6 blocks. However, Toro seems to be the most popular  and always has a line that goes out the door (probably mostly due to the small space inside).<br><br>Been here two or three times before to dine-in and food has always been good. Came here recently to order food to take-out on a Friday night. and even then, the wait was 45 minutes. Got three rolls to share between two people:<br><br>1- El Fuego - definitely the favorite of the three. Includes jalapeno which gives it a nice refreshing kick. <br>2- Kamikaze - recommended by the host, but I wasn't impressed. It includes a bunch of various types of fish diced up covered in a spicy volcano sauce. However, because there was so much sauce, it masked the taste of the fish and whatever else was in the roll. <br>3-Best of Both Worlds - Love the fresh slices of fish on the top. It was one of the bigger rolls, but nothing special.<br><br>Food was good, but not sure if it is worth the wait during peak hours especially when there are other options just down the street that are comparable.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kBlpwpJTZbLYbHCrbFkMYQ/348s.jpg", "caption": "El fuego and best of both worlds. Couldn't wait to take a bite before taking the picture"}]}}, {"review": {"des": "First time here and I really loved the sushi! We had some nigiri pieces, spicy tuna, And OMG roll. The yellowfin nigiri was BOMB. It's BYOB and no corking fee, I will be back to try some of their more elaborate rolls.", "pics": null}}, {"review": {"des": "Went to Toro on a Saturday night with a few friends. Showed up just before 7 with a half an hour wait. Went and grabbed a drink at hopcat just down the road to kill some time. We finally got seated and got ready for some yummy sushi since everyone absolutely RAVES about this place.<br><br>Service: I didn't give this place 5 stars mostly for the service. It was slamming busy so I cut them a break but still... took about 15-20 mins just to get menus!! We had to ask to order, ask for our salad and soup starters because they never came (and our server paid no attention) and food took forever to come (that's just cause they were busy). Plus there was an empty coke can at our table when we sat and they NEVER cleared it! <br><br>Food: we got 3 rolls for the 3 of us. Spicy scallop, Hiroshima, and a specialty tipsy trixie or something like that. The tipsy trixie was by far the best, but all of the sushi was super fresh, and light. It was absolutely delicious. This was a blow me out of the water sushi place like some more of the upscale, $$$ places where u can order set menus, but hey that's not what it's going for.<br><br>I would definitely go back and keep trying rolls and more sashimi since they are known for the quality of their fish. For 3 rolls 2 soups and a salad the bill was 53. Not bad and we all left feeling satisfied and happy!", "pics": null}}, {"review": {"des": "Had a nice dining experience at Toro last night. <br><br>I had been wanting to try this place for a while at the recommendation of friends - came in Sunday night around 7:30 and were able to get seated at the bar.<br><br>My boyfriend and I ordered the El Fuego, Yum Yum Yummy and Octopus Nigiri. <br><br>The El Fuego had a really lovely balance of spice that was complemented by the cilantro - not something I'd typically expect in a tuna sushi roll but it worked.<br><br>The Yum Yum Yummy was exactly as described - portion seemed on the smaller size. The food itself was well done, fresh and tasty. <br><br>The issue I had with the whole experience was an order (not ours) was messed up - a waitress was working to resolve the issue with the chef and he started loudly yelling at her in front of all the guests.  I understand the food industry isn't exactly calm but if you're going to have an issue with your staff do it in the back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AkTD2VoAwljX4KsS-ZApGw/348s.jpg", "caption": "Octopus nigiri"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qQRAHwW1HNQhyHP_2sESVQ/168s.jpg", "caption": "Octopus nigiri"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Vdkj8FiclUkTCjFSGrV_4w/168s.jpg", "caption": "EL fuego- spicy and refreshing"}]}}, {"review": {"des": "2.5 stars, very average sushi, no ambience.  People swear by this place, maybe because it was so highly recommended and hyped up I expected better??  Sushi wasn't bad, but it wasn't amazing and we ordered a pretty good assortment of the specialty and normal rolls.  We left feeling underwhelmed and commenting that we won't be back.", "pics": null}}, {"review": {"des": "Went last night and it's as good as advertised.  You're not coming here for the club atmosphere and overpriced food, you're coming here for awesome sushi.  On a Friday night just before 7, we were quoted a 45 min wait and seated in 40 mins at the sushi bar.  Everything was super fresh and reminded me of sushi I ate in Cali a few weeks ago.  That's high praise from me.  <br><br>On a side note, I'm gluten sensitive and I really appreciated how the menu is marked with \"gluten free\" or \"gluten free option\" on any eligible item.  They made it easy to be gluten free last night.  Thank you!", "pics": null}}, {"review": {"des": "Wow, has Toro gone down hill in the past two years.  What used to be our go-to for excellent portions of high quality fish at weekday prices now produces food suitable for an all-you-can-eat buffet   They changed their menu two years ago (from what I can remember). The rolls are now loaded with mayo, panko and other fillers (to mask much reduced portions and quality of fish).  I don't know whether the fish was off or just too much mayo and other fillers but my wife and one son had stomach aches that evening.  If you do end up going, and are not a fan of tilapia, make sure to request \"no tilapia.\"  They even included it in the sashimi platter of our last order this time and didn't order the sashimi platter, since I swore it had tilapia in it last time. <br>It's sad how Lincoln Park is losing its culinary niche. Hopefully all this new apartment density brings it back.", "pics": null}}, {"review": {"des": "I just ordered some sashimi to go from Toro.<br><br>I am quite picky when it comes to fresh fish as I've had fish from the famous Tsukiji market in Tokyo as well as fish from Taipei fish markets.<br><br>The fish here is just OK but not the best I've had.  I've come to the realization I can't expect that level of quality here in Chicago unless I'm willing to pay big bucks for it.<br><br>So based on just one dish, the fish here is ok for the price point but definitely not the best I've had in Chicago.", "pics": null}}, {"review": {"des": "Toro has fresh nigiri and inventive rolls, though the menu is overwhelming. I'm tired just reading the number of rolls they offer. I've consistently enjoyed their hand rolls, saba nigiris, and hand rolls. The volcano roll is the only roll who's name I recall, and also recall being very delicious. Otherwise, the cramped-ness of the restaurant is a drag.", "pics": null}}, {"review": {"des": "Some of the best and freshest sushi in Chicago.  Small joint in LP, fills up fast expect to wait an hour to sit. The owner is super cool and personable.  He often will give people sitting at the bar pieces of sashimi to taste for free.  Go for the signature rolls and try the big white tuna!  Rolls are very creative and beyond tasty! Oh and this place is BYOB with no cork fee. 5 stars!", "pics": null}}, {"review": {"des": "Sitting at sushi bar was great, really enjoyed meeting and speaking with Mitch (owner/head sushi chef) who was awesome <br>Favorite dish(es): Kamikaze and Arizona rolls were great and sashimi was excellent - Mitch kindly gave us complimentary Toro too<br>Casual place and BYOB, great for dates or with friends", "pics": null}}, {"review": {"des": "Omg this sushi was bomb. We waited close to an hour but it wasn't an issue for our group. Just to note, there really isn't anywhere to sit and wait so we went to a bar across the street. Server/host were friendly and easy to chat with. Our server made an error on our order and brought a tempura California roll instead of a California roll and a tempura roll, but the tempura California was delish and he gave us a complimentary roll for his error! No big deal. Love the BYOB!! The red dragon roll is a yummy choice if you like spicy tuna. Will be back!!", "pics": null}}, {"review": {"des": "Great sushi. Super casual. Big menu. A great neighborhood spot. Loved the asparagus tower.", "pics": null}}, {"review": {"des": "Best sushi so far in Chicago. Almost reminds me of the ones in Japan.<br>Woo, 1k review! Looking forward to the next visit.", "pics": null}}, {"review": {"des": "With plenty of stellar eateries in Chicago's rustic Lincoln Park area this hidden gem is easy to miss to the untrained eye. But once inside, senses are overwhelmed with a sense of comfort and welcoming. I entered on a snowy day and was greeted warmly by the waitress and exuberantly by Mitch himself. I sat at the bar and enjoyed soft shell crab which was fresh and moist inside yet perfectly tempura outside. And the sushi...OMG. Beautiful, creative, and amazingly tasty. Mitch took the time to personally make sure me and my girlfirend picked rolls perfectly suited to us! This place needs a neon lit sign! I am a tourist but I will definitely be back and I thank Mitch for such an amazing dining experience.  <br><br>P.S. Please bring this to ATL!<br><br>Sincerely,<br>A happy black sushi enthusiast", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CZQ7S6qjvyqgAAw13iJXbg/348s.jpg", "caption": "Chef Mitch!"}]}}, {"review": {"des": "Incredibly friendly staff and exceptional sushi! Tried a fried roll and a plain roll. Both exceeded expectations. Every dish I witnessed leave the kitchen looked delicious. Wish I could bring this place home with me! Impressive and kind sushi chefs as servers.", "pics": null}}, {"review": {"des": "My first experience in the place was very good. We came on Tuesday around 6:30pm, the place was already packed and had a wait 15-20min for a party of 2, although we got lucky and were seated less than in 5 min. The staff was friendly and attentive, even though it was busy, the chef/owner of the place, Mitch, was cooking and talking to the guests who seat around the bar and never missed a customer, who was leaving, to thank them for coming and say good bye.<br>The atmosphere is warm.If someone is looking for a fancy sushi place, this is not the one, but here you feel the spirit of small business, home run restaurant that cooks for you as for the family.<br>We got a crunchy salmon roll as appetizer and ordered the handmade rolls that looked like little triangle tacos. Everything was delicious!<br>The most interesting part was when we wanted to ask for the bill, we were informed that there was a gentleman, who paid for everyone in the restaurant!!!!We were shocked and surprised, first idea that came into our head was \"is it April 1st already?\", we thought they are joking with us! Honestly there were a lot of people in the place, and the prices are not the cheapest there, so it was a very shocking, but very pleasant news. God bless that generous man and his family. And we will definitely be back to get more yummy sushi :))))", "pics": null}}, {"review": {"des": "Hands down the best sushi! Freshest ingredients. Very interesting flavors and amazing customer service. Been here several times and have never been disappointed. My go to sushi place, won't go anywhere else!", "pics": null}}, {"review": {"des": "Loved everything about this low key sushi place! The service was great and sushi was the best in the city. We came in on a Thursday around 6ish and were seated instantly and were surprised at how quickly we received the food.", "pics": null}}, {"review": {"des": "Mitch is the best sushi chef for miles around. I've yet to find a sushi bar I like better. His combos are all ingenious and his portions are VERY generous.", "pics": null}}, {"review": {"des": "I've been looking for a good sushi spot for months and always wanted to try this place but there is ALWAYS a wait and it's usually super busy. So a friend and I decided to try it last night and it was absolutely AMAZING! I can see why there is no \"slow\" time for this place. Sashimi was so fresh and delicious, and the rolls were all very tasty (spider, volcano, ninja). BYOB, so come prepared w wine and beer, and to have a delightful meal. I recommend sitting at the sushi bar, the chef was so nice and entertaining.", "pics": null}}, {"review": {"des": "All and all, it was good. We got the finger roll, but I wouldn't get it again, it was pretty bland and tasted like fryer oil. The spicy tuna roll was good, quality tuna but heads up it's not a creamy spicy tuna roll. The Arizona roll and kamakaze were both good. It's a busy little joint, I would say a party of 1-4 is probably best. We watched as parties larger than that were turned away.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ykrwv1B-o6oNaI0FexQkyw/348s.jpg", "caption": "Finger roll, bland."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qtAAW0r0E3jpFdNerly-rQ/168s.jpg", "caption": "Kamakazie, it's good."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2ySvD6Ap-irj6Rb15t0pnA/168s.jpg", "caption": "Arizona roll, its was good."}]}}, {"review": {"des": "Walking into this place you're almost convinced it's the real deal. And then you eat and eat and eat and then realize.....it really is; and then some.", "pics": null}}, {"review": {"des": "This is the best sushi I have ever had. The quality of fish is phenomenal.... the salmon nigiri just melts in your mouth. The rolls are inventive (the Sunny has sunflower seeds that add just enough pizzazz to bring it all together and the Fuego is amazing). And If you get a chance, sit at the bar to watch Mitch work his magic (and tell you about the fish and give you a little taster of something special). No sushi joint can compare to Toro Sushi, and believe me, I have tried many others.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/__xPq7olncjwiy0A9oiuGA/348s.jpg", "caption": "Salmon and yellowtail nigiri up top, Fuego roll in front and Sunny behind it"}]}}, {"review": {"des": "I do not hate their sushi. Handrolls are okay. <br>However, I don't want to even touch their old greasy menu.  It's a poor reflection on the cleanliness of the restaurant that serves raw fish. <br><br>It appears that they opened new store called Suchi, but they should pay attention to the existing store rather than opening up a new store.  As a long time customer who actually enjoyed coming here, i am disappointed for the lack of upkeep and maintenance.", "pics": null}}, {"review": {"des": "Escolar? Why?<br><br>Was pleased to see the massive and appropriately presented chirashi entree.  Lots of fish sitting on top of a bed of sushi rice; not a sashimi platter served next to to a bowl of rice (ahem, Nana Sushi NYC <a href=\"https://www.yelp.com/biz/nana-sweet-sushi-new-york-2\">yelp.com/biz/nana-sweet-…</a>).  Unfortunately, was dismayed to discover that three of those pieces were the white, diarrhea-inducing escolar - which is BANNED IN JAPAN.<br><br>To their credit, Toro identified it as escolar, as opposed to lying about it (\"white tuna\").  What's wrong with escolar?  Much - the fatty esters aren't digestible, causing GI symptoms including gas and diarrhea.  Not \"toxic,\" but pretty unpleasant.  Also has an odd, soft sharky texture.<br><br>Would go back, but be sure to stick to real sushi fish.", "pics": null}}, {"review": {"des": "Mitch is the best sushi chef in town! I used to frequent Toro when I lived nearby but then I moved out of state. After seven years I am back for a visit and had to go to Toro for delicious sushi. It was just as I remember: friendly staff, Mitch the best as usual, and the sushi was fresh and with wonderful flavors! I will always come back to Toro and to see Mitch.", "pics": null}}, {"review": {"des": "Hands down the best sushi place in town. My wife and I have been coming here since we lived in Lakeview, and now make a special trip up up from the West Loop just to come to Toro. <br><br>Mitch the owner, and chef, is always accommodating and an all around awesome guy. Try the Sunny - best roll in Chicago!", "pics": null}}, {"review": {"des": "This is a hole in the wall place with amazing sushi! We had about a 45 min wait on a Saturday night, but got drinks at a nearby wine bar while we waited. We got the vegetable gyoza, sunny roll, kamikaze roll and crunchy salmon roll. Most rolls had added nuts which provided texture and crunch. The fish was fresh and the rolls were DELICIOUS! The service was incredible. Highly recommend this place.", "pics": null}}, {"review": {"des": "Amazing food for excellent prices! Somebody recommended this place to me, so I went for my birthday dinner. We actually arrived late, but they still managed to seat us. The sashimi was really fresh. The gyoza was really crispy. All the rolls were made well. The teriyaki dinners were huge. All in all, a fantastic meal!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CUHkXfkgKDgVJEqHWm6cHQ/168s.jpg", "caption": "Sashimi"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hXcy4tK6nMkyJFPSNEMd8w/168s.jpg", "caption": "Gyoza"}]}}, {"review": {"des": "Really Bad Sushi. It's cheap and you shouldn't mix that for quality. <br><br>The hostess didn't give us menus for a good ten mins, and when I asked her for them; she told me to HOLD ON! Way to go!<br><br>Been still Stomach sick since I ate there yesterday.", "pics": null}}, {"review": {"des": "The 2nd best Sushi spot I've had in Chicago. It's a little cramped, but the rolls are worth it. Everything tastes fresh, with many complex combinations offered on the menu. Favorites: That's How We Roll and Pig in the Sea. Definitely order from Mitch's Special Rolls.", "pics": null}}, {"review": {"des": "I live right down the street and never really thought to stop in because of how unassuming it looks from the front. I finally decided to stop in after two years and was really surprised by how fresh and tasty the sushi was. It's a very intimate space and they are BYOB, which I am usually wary of. I always feel like the sushi is below par at a place that is BYOB and I'm not sure why.. but this place really hit the spot for me. I ordered the crunch spicy tuna maki and it was AMAZING. Dare I say it even overshadowed the specialty rolls? <br><br>The service was fast, it was a cute space, perfect for a casual get together or date night, and the food was fresh and yummy. Toro will definitely become my local go-to for a quick sushi fix.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lOLpE4571TbXTni267oA7Q/168s.jpg", "caption": "The spicy tuna crunch maki roll- MUST GET THIS. Amazing. Edamame was done well too (read:not overboiled and dry)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/46bw5jWsSQ2l1ba4bUgr-w/168s.jpg", "caption": "The Arizona Roll- a very light, summery roll."}]}}, {"review": {"des": "Not five stars because of coldness in restaurant and wait time. However, keep reading. <br><br>Supposedly the best sushi in Chicago, you better come when they open or be prepared to drink next door while you wait. It's BYOB, and when the waiters are wearing their Sorels inside you know you will need to keep your coat on.<br><br>For starters, the salmon sashimi was thicker and smoother than I have ever seen. The O roll, spicy tako, kamikaze...  Truly amazing and came out at a fast pace. Word on the street is that the sushi chef gives you extra treats when you sit at the bar. So the end note on Toro: grab your favorite saki from the liquor store across the street and wait it out, the masses agree on this one.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/T9dwNnS7_jGin3w1KMmCNw/168s.jpg", "caption": "O roll, yum!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Tbr0YKqWiTauGXWKz6EgkQ/168s.jpg", "caption": "Spicy tako"}]}}, {"review": {"des": "Toro is my favorite sushi restaurant in Chicago. I've spent time in Japan because my half Japanese cousin lives there and once you eat in Japan, then you are spoiled forever. Their rolls are fresh, well sized and beautifully flavored. My favorite specialty rolls are Red Dragon, Spicy Tako, Kamikaze, Pig In The Sea and El Fuego. All spicy with good kick. The Red Dragon roll is mind-blowing in flavors. The Spider Temaki hand roll is another favorite. This is deliciously authentic with modern creativeness at its best. Miso soup is excellent served piping hot. I hate lukewarm soup. Their Wakame salad is large and perfect for two persons. Service is always attentive and Mitch the owner is very welcoming. It's a small restaurant that fills up quickly.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xPD9_Pz3UBvIFKlhZukvTg/348s.jpg", "caption": "Spicy Tako roll"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/I0sFSJOedZwXWfPCY82nfw/168s.jpg", "caption": "Kamikaze roll"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/NLM5SFM7iiYK9O0IcDGm0w/168s.jpg", "caption": "The amazing Red Dragon roll"}]}}, {"review": {"des": "the food is great, nice staffs. This is always been my favorite restaurant. I have come here many times. BUT I have notice every single time that the owner didn't greet us or say thank u when we pay and leave. He say hi, smile and bye to people that come behind us (like a min after us). I think not just us, he seem like that especially to Asian. Every time we come, we spend almost like 100 bucks. The money I spent and the money others people spend are different???? I won't come back or recommend my friends.", "pics": null}}, {"review": {"des": "it's in a cozy little place close to Del Seoul, it's quite busy at night and you have to wait for an hour or two to get a seat, we got there around 5:30 on a friday and was lucky to be seated right away<br><br>i would recommend any of the mitch's sushi, their specialty rolls are all very unique, though a bit on the fusion side<br><br>the crazy horse is pretty good too<br><br>it was a bit sad that they don't do the flames for the volcano roll anymore tho", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Tku3Zd2udJm3SzGuMI81VA/348s.jpg", "caption": "grilled mussel"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WeXlkWiLdE2HgtzbsOIU6g/168s.jpg", "caption": "crazy horse roll"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gSz7KypI-dH6TTo8Vg319g/168s.jpg", "caption": "el fuego roll and trixie roll"}]}}, {"review": {"des": "If you want to eat at Toro literally any night of the week, be prepared to wait for a table. But despite the wait and the other dozen sushi joints that don't have waits within a 2 block radius, it is definitely worth it. <br><br>Fish is always extremely fresh. And they have some of the most interesting combinations around. <br><br>My favorite roll is the SPICY TAKO, which is a combination of octopus, spicy sauce, and sunflower seeds. The sunflower seeds sound so random for a sushi roll but are actually awesome and completely make the roll. The HOLLA HOLLAPENO and KAMIKAZE are also great. The latter combines so many different kinds of fish - tuna, yellowtail, white tuna, salmon, etc - that it sounds scary but it somehow comes together deliciously !! <br><br>I also like the plain old Salmon and Tuna sashimi. They are always fresh and just melt in your mouth. Quality is on par with any of the \"fancier\" sushi spots around town.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qRRkPmssJBvNboVAHELGFA/348s.jpg", "caption": "Spicy Tako"}]}}, {"review": {"des": "A tiny restaurant with excellent sushi. A colleague recommended and he was spot on. Get there when it opens or you will wait because it is always packed. It's also BYOB, just so you know. I almost didn't want to review as I don't want to have to wait longer when I go.", "pics": null}}, {"review": {"des": "Love this place! The sushi is great and the atmosphere is really relaxed. I love the byob option too. The owner is great with customers!", "pics": null}}, {"review": {"des": "Overpriced & not worth it at all. My husband ordered a sashimi combo (sorry forgot the exact name) & I ordered 2 rolls & we ordered another to share. The quality of the fish is really good, but the rolls are definitely too small to be worth that much money. And the chef is not even Japanese so it's not authentic sushi. He can't handle the sushi rice properly nor can he make flavorful rolls. We both grew up eating authentic sushi & Japanese food & have been to so many sushi restaurants. This one is a HUGE disappointment. For something so small portioned with cheap plastic plates, we spent $100 & literally felt we should pay $50. You are not buying the experience nor food. There are many other better sushi restaurants & this one can only be a reliable neighborhood place.", "pics": null}}, {"review": {"des": "So overpriced for what it is, standards defiantly slipping. Ordered takeout, messed up my order, miso half full, OMG is more like omg I paid $13 for this tiny entree. Anyway, my 2 cents.. last time I order from here. If you're considering Japanese food in Lincoln park, go elsewhere.", "pics": null}}, {"review": {"des": "I recently discovered toro and have been back multiple times since. I LOVE the Arizona roll and crave it on a weekly basis. Mitch is great and sent over an appetizer to our table when I brought my mom in. I usually like to sit at the sushi bar when there are two of us because I like watching the process. The restaurant is BYOB and can be hard to get into due to the small space and high volume of customers. I would highly recommend toro for anyone in the Lincoln park/lakeview area!", "pics": null}}, {"review": {"des": "The entire time I lived in Chicago, I was never able to get into Toro without a huge wait.  Finally, I went back to visit and we went during lunch when it opened.  I got a sashimi platter and the fish was SO FRESH and absolutely delicious.  It's pretty small in there, so it makes sense that there would be a wait. AMAZING, you have to try this place if you like sushi.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6Xncc4x0MpWoUwP1LQHEhw/348s.jpg", "caption": "Sashimi! Sooooo good"}]}}, {"review": {"des": "Went because of the ratings. The nigiri was not very fresh or flavorful. Nice atmosphere. Skip it.", "pics": null}}, {"review": {"des": "A friend and I stumbled upon this place years ago during a trip to Chicago and this place has become one of my favorite sushi bars/restaurants ever. I ordered Chirashi for the first time here and all of the sashimi tasted extremely fresh. I've come back multiple times over the years and the food is always great. I'm not going to recommend any rolls because I've tried a variety of the sushi rolls here and have never been disappointed. The restaurant is very small, so the wait can be quite long if you come around dinner time, but it's worth it.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VxUQZCZ2VMIzapUaGgIjqw/168s.jpg", "caption": "Chirashi"}]}}, {"review": {"des": "Awesome place. The sushi is one of the best we have ever had. From the special rolls to the standard. Also, I'm so happy to see that they offer Real Wasabi on the menu. Real deal. <br><br>Thank you.", "pics": null}}, {"review": {"des": "My boyfriend and I was getting some mollys cupcake and we wanted to try this sushi spot. We are picky eaters in some ways but love sushi. <br><br>We ordered 4 sushi. We got the spicy tuna & tempura hand rolls which were delicious. We also got the M.J and (we forgot what the other roll was called) but it had mushroom, spicy tuna, asparagus, & spring mix served on a spring salad with ginger dressing. Very delicious. <br><br>The place is a $$ but in my opinion it's kinda of too pricey. We orders four rolls and it wasn't enough & the bill came out to be around $36. The place is delicious and i recommend people to try this place out.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9Su_PWyh_3fyfXmes8l9Lg/348s.jpg", "caption": "Right: spicy tuna and tempura hand rolls"}]}}, {"review": {"des": "Best Sushi in Chicago <br><br>There's nothing I can say that hasn't been said before. But seriously there's a reason that Toro has such a great rating. The food is amazing and Mitch (owner and head sushi sensei). <br><br>My favorite rolls: spicy tako, ahi salad roll, kamikaze roll, and the hot finger roll appetizer. I've tried most of the menu and you can't go wrong with any selection. <br><br>No matter how long the wait is, trust me it's worth it!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aDGv7MgZlq-LHxNKIWrQ-g/348s.jpg", "caption": "Ice cream!!!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LaCgbvOuiYV1wcxbrqxQgw/168s.jpg", "caption": "Crazy Horse with yellow tobiko"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/P8BNbdA4WAFfxReABfbsoA/168s.jpg", "caption": "Ninja!"}]}}, {"review": {"des": "Tucked away in the hustle of Clark street, lies one of the best sushi gems in the city. Like most sushi places, it's BYOB and the staff is eager to accommodate your $8 Walgreens wine special. <br><br>Side note: There's a nearby liquor store and a 7-11 for your last minute BYOB needs<br><br>Keep in mind, since it is a smaller location, there could be a wait for parties larger than 4. In the past, Toro has been an excellent spot for dates and smaller groups. It's a intimate place sans obnoxious music and ideal for people watching. There's no table without a good view of the sushi bar and the chefs working their sushi magic. <br><br>Their menu is pretty expansive, but I have yet to be disappointed by any of their little creations. Typically, we start with the edamame and dumplings and continue on with their specialty roles. Previously, I've had the Red Dragon roll, Oh My God roll,  and Big 10 roll to name a few. In short, it's a sushi adventure you won't regret and every time keeps me coming back for more!", "pics": null}}, {"review": {"des": "Easy to load up on the specialty rolls since they are so bomb, but they add up and crush your wallet.  I would only come with a party of two to cut down on the wait.  Love the OMG roll and the Gobi, all sashimi is ftd, and the octopus salad is a must.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/myTXn1tDpX7viPxUPA5MpA/348s.jpg", "caption": "The Gobi roll - seaweed salad on top!!"}]}}, {"review": {"des": "Really good sushi. Might be the best sushi in chicago. The space is small and very casual, but the sushi is pro level.", "pics": null}}, {"review": {"des": "Came here for dinner tonight. Everything we ordered was great and the server was friendly/helpful. We ordered the Alaskan, Crazy Horse, Breezy, and Dragon rolls. Everything was great with the breezy being my favorite. The fish is definitely fresh.", "pics": null}}, {"review": {"des": "I have tried many different sushi places around Chicago and this was my favorite. The owner is front and center making the sushi and talking to everyone at the bar. My Bento box took a little long because they got new servers and he specialty made me a roll for my - very short - wait. Seriously so good", "pics": null}}, {"review": {"des": "I wish I could give more stars. I have been going here for 10 years and always meant to write a review. It just gets better every time. Mitch...you are an absolute saint. They do not make them like you any more, just an all around 100% amazing person and chef. The service is always prompt and kind, the food is ALWAYS perfect and the environment is cozy and just the right noise level for enjoying a dinner but having a nice time doing so. Thank you Toro for so many years of great food and great times. See you soon!", "pics": null}}, {"review": {"des": "Easily, my favorite sushi joint in Chicago! The food and quality of service is always consistent and amazing. The hand rolls are the best in the city, perfectly crafted by owner and chef, Mitch. Try the kamikaze roll. It is incredible!", "pics": null}}, {"review": {"des": "I've had their food twice, once for takeout for lunch and once for dinner.  The takeout lunch was great! I ordered the Oh My God & Kamikaze rolls and they did not disappoint.  Takeout as well, they were still fresh when I got home and I loved the Oh My God roll more than Kamikaze.<br><br>The second time I went, I got about halfway through my roll, walked into the freezer, ran to the bathroom and threw up.  It was awkward and awful.  The food tasted fine! I had the sashimi appetizer, the red dragon roll and the el fuego roll.  Both were phenomenal! The sashimi tasted so fresh but something did not agree with me.  I gave 3 stars for both experiences combined.  The prices are a bit high, but we had 9 pieces of sushi per order about which was generous! <br><br>Ambiance is casual, our green tea was not good. Had no flavor.  Service was great! Place fills up fast even on a Wednesday !", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9u6eT78IVkaPlVdPZ-4S_A/348s.jpg", "caption": "Red Dragon in the back/top and El Fuego in front"}]}}, {"review": {"des": "Their fried ice cream is a must!!! No doubt! <br>Dragon sushi was pretty good. Their customer service is very average and they need to do better", "pics": null}}, {"review": {"des": "Very disappointed in my last meal here. I came here on a Saturday at 8 p.m. and was quoted an hour for the wait.  50 minutes later we call to see if we will be seated soon and are told it will be another 15 minutes.  We go back to the restaurant and we are finally seated at about 9:45 p.m.  Horrible.  Had I known the wait would be an hour and 45 minutes, I would have gone elsewhere. <br><br>The food left much to be desired.  We were given a complimentary portion of agedashi tofu, and I am glad we did not pay for it because it was vomitrocious.  Cold and gummy, just bad.  We ordered a Boston roll, spicy tuna roll, and an eel roll (the rock and roll).  First, the rolls are very small.  Generally not a problem, as long as they are filled with whatever is supposed to go in the roll.  However, our  Boston roll--just avocado and salmon--was also stuffed on the inside with rice.  This is basic sushi-making 101--create the roll properly so there isn't rice stuffed on the inside of the roll.  There were miniscule slivers of avocado and salmon and big chunks of rice.  At that point we were starving and just ate it.  The spicy tuna roll was too spicy--could not taste the fish at all.  The eel roll was good.  We also had the tempura, which was good.  <br><br>Overall, this was a bad experience.  I waited a few days to write this to let the \"hangry\" side of me calm down, but I am still just very unhappy with my meal and I will not return.  Maybe the experience was poor because we were one of the last tables to be seated for the night (not by my choice), but if the food can't be prepared correctly at the end of the night, stop taking paying customers.", "pics": null}}]}