{"name": "tre-kronor-chicago", "reviews": [{"review": {"des": "We love this place! They are currently renovating so they are not open for dinner,  make sure you check their website for current hours. <br><br>We ordered: the soup of the day, carrot dill soup,  their sausage special was smoked cheddar bacon sausage, maple pecan danish, spinach and mushroom quiche, salmon dill omelette. <br><br>The carrot dill soup was absolutely delicious! A little hint of dill, perfectly salted. Their danish was served warm and not too sweet. We loved the smoked cheddar bacon sausage,  so much so we ordered another one of the sausage and soup to go.  The quiche was wonderful,  I'm not sure what cheese they used but it complemented the spinach and mushroom perfectly. My fiance enjoyed the salmon dill omelette (served with potatoes - yummy!).<br><br>This was where my fiance and I had our first date so we make it a point to go at least once a yr. Service is always exceptional and food never disappoints!<br><br>If you haven't been check it out!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fGHJGCcKQk_TMiiweh5ALA/348s.jpg", "caption": "Spinach and mushroom quiche"}]}}, {"review": {"des": "The staff is incredible and the service is OUTSTANDING! Refills and anything you need happens fast and they are extremely friendly and helpful!<br><br>Shared a house sausage (today was maple)-SO good and I typically don't like sausages. Ordered the salmon dill quiche with fresh fruit and partner had crab cake Benedict. Quiche was a large portion and good but didn't blow my mind...I probably wouldn't get again. Crab cake bene was insane. We both agreed it was our favorite. The potatoes with it are cooked perfectly...possibly the best breakfast potato I've had!<br><br>Very clean place and the people that work there are nothing less than wonderful. Definitely will be back...great first experience!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/r7r5RPLlwzfroSZksC46-g/168s.jpg", "caption": "Crab cake Benedict with mind blowing potatoes (highly recommended)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/N6UExugTAxzL6xZWNP-4cQ/168s.jpg", "caption": "Salmon dill quiche with fresh fruit. Maple house sausage in back-order it!"}]}}, {"review": {"des": "This place was okay. The service was a bit slow but the waitress was nice enough and the food was fine but nothing I'd really rave about.<br><br>I got the salmon and my boyfriend got the fish of the day, and we shared the crab cakes as an appetizer. The crab cakes weren't anything terribly remarkable (3/5). The salmon was good...but to me it just lacked in taste (3.5/5). My boyfriend's fish of the day was also just okay (3/5).<br><br>I'm not quite sure what it was about the food- maybe it just wasn't fresh ingredients- but nothing really stood out to me and the flavor fell a little flat on everything. It was nice trying everything once but especially for the prices, I think once was enough for me.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4Br4ujscZGf6cT0Mmx-LYA/168s.jpg", "caption": "salmon"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tore97h_MEH6zHcmwANYyg/168s.jpg", "caption": "fish of the day"}]}}, {"review": {"des": "Tre Kronor has one of the best brunch games in town. From the lattes to the benedicts, every detail was on point. As other reviewers noted, the kitchen is not super fast, but we never felt forgotten. Hubs ordered the crab cake benedict, and I ordered the smoked salmon benedict. I *never* finish potatoes with my breakfasts, but this time, I did. Those baby reds are fantastic and so simple-- I don't know what they do to them! The benedicts were perfect, the hollandaise was the exact medium-light consistency I like (with the right touch of lemon). We were both so happy and will definitely be back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZdcwHr7IQ-De0UPR9Dhvfg/348s.jpg", "caption": "A delightful little latte to start off brunch"}]}}, {"review": {"des": "This is an amazing breakfast/brunch place in the Albany Park neighborhood. Extremely Swedish thanks to the impact of North Park University. I had the salmon and dill quiche while my friend had the Stockholm omelette. Both were rich and flavorful. A place you most definitely need to check out. But, be sure you have the time as it can often be packed and the kitchen isn't particularly fast.", "pics": null}}, {"review": {"des": "My friend and I stopped in because the reviews looked good. The food was yummy!<br>I got the Norwegian meatball sandwich and it was good, but there wasn't anything spectacular or special about it. The portion size was decent for the price.<br>The atmosphere and area was very cozy, small, and cute. They have an upstairs, which we didn't know about. We enjoyed the company around us and it seemed like a popular, neighborhood, and comfort food spot.<br>This is a great place for brunch, families, kids, and friends. I would come back to red other meals!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MOZIGmJL-vU_3LnON6R2Dg/348s.jpg", "caption": "Norwegian meatball sandwich and Belgian waffle"}]}}, {"review": {"des": "One of my fave places to have brunch. They've expanded with outdoor seating but it's always busy so be there early. The cool part is that you can wait at the Swedish store next door and they have cute items. They always have specials of eggs Benedict, quiches, and freshly baked danishes. <br><br>My favs are Belgium waffle, Anders Corned Beef Hash, Swedish Pancakes, Salmon dill quiche, fresh Danish, hot cocoa, and cappuccinos. Never a disappointment, great place for brunch.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_hizQcG19GIK6bllEesIvg/348s.jpg", "caption": "crab cake Benedict"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nMbuZTByK_gcVONIAk1ipg/168s.jpg", "caption": "smoked salmon omelette"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CnQ6xCaaCB0mD89Thuwj1Q/168s.jpg", "caption": "Anders corned beef and hash with over easy eggs"}]}}, {"review": {"des": "Went here for brunch early Sunday and the place was already busy. There are non-Scandinavian/more traditional brunch dishes if one chooses. I had the vanilla and orange French toast and it was good! On Sundays they have a magician entertaining the tables! Was a funny surprise.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cIcDMn3b2w0-Y-81saV0dA/348s.jpg", "caption": "Vanilla and Orange French Toast"}]}}, {"review": {"des": "We went for breakfast at this Swedish delight. Tre Kroner has been around for a long time in Chicago and it shows why. The location so great, the restaurant itself is an old apartment and the food is made fresh. This place is known for the sweetish pancakes and Swedish food. We didn't have the traditional, but because this is a scratch kitchen, we wanted to try it out. Personally thought it was a 3.5 but I'm giving it a 4 because of the critique. <br><br>It's someone's house. The restaurant is two floors and was originally an apartment in the heart of North Park. The bathroom even had a tub! Really nice place to live if it wasn't a restaurant! <br><br>The service was interesting. Our food took 30 min for three dishes. When we received the food, we realized it was well worth the wait. However, I'd rather not wait that long in general. The server was friendly, but sometimes would walk away before she finished pouring my coffee, getting it all over the table or me! She was attentive, so that helps. <br><br>For our breakfast, we ordered the corn beef hash, the salmon eggs benny and the orange/vanilla French toast. The corn beef hash tasted good, but had way too much rosemary. It overpowered anything else. It tasted better when you cut it with the egg. The eggs Benedict was good, too. The hollandaise sauce was much more tangy than I'm used to. However, i would order again. The best part of the breakfast was the vanilla orange French toast. It had a great balance of citrus and sweet. <br><br>The coffee was strong and kept coming. I will come back to try some Swedish pancakes with lingonberry.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/D8TRyRgTJC1427Sir3fseg/168s.jpg", "caption": "Ariel view"}]}}, {"review": {"des": "Stopped in for a late lunch today after watching Diners, Drive-ins, and Dive's Guy Fieri rave about the Swedish meatballs. <br><br>I was disappointed to learn that Tre Kroner only serves these on the dinner menu. I get not having the entire dinner menu available at lunch, but if the Swedish meatballs are your signature dish, good enough to have been featured on the Food Network, then you should probably have that dish available at lunch too. I'm going to guess that I'm not the only one to feel this way, since we watched a table, leave minutes after being seated, when they too learned they were unable to purchase the dish.<br><br>I opted for the Norwegian meatball sandwich which was mediocre substitute...not terrible, but it by no means \"wowed\" me.<br><br>On the plus side, the Danish onion soup was pretty tasty.<br><br>We want to give it another try, but Andersonville seems to have quite a few good Scandinavian places that we will try first.", "pics": null}}, {"review": {"des": "Adorable and totally unique, from the decor to the dishes. It has a cozy main room, a larger dining room, an outdoor area, and a second floor!<br><br>I recommend the Oslo Omelet as well as their pastries. Service is friendly, prices are normal, and the ambiance is cute (the server station looks like it's a cabin, and it's made to be part of the mural!).", "pics": null}}, {"review": {"des": "This might be my favorite restaurant in Chicago. The staff, the hosts, waiters and waitresses are always so friendly and attentive. The excellent service only compliments the delicious food. Everything I've ever ordered here is consistently delicious and well worth the wait on the weekends. I love the vanilla orange French toast, the flaky Danish filled with apples and pecans, the thin Swedish pancakes with lingonberry jelly and the omelettes stuffed with falukorv sausage and dill. With nice weather, the patio significantly extends the seating capacity, and it's a bit easier to get a table in the morning for breakfast or brunch. Also, it's pretty much perfect out there. Sitting inside is also really nice, it's somewhat lively on the first floor, and if you want a more quiet experience, I'd recommend getting a table upstairs.", "pics": null}}, {"review": {"des": "I am so sorry to say this place made my wife and I  We ended a world class choir concert North Park University Chicago.<br>We had the greatest day in Chicago but decided against having lunch before the concert as we would be in an area known for its restaurant diversity. <br>Prior to going on campus we saw five great places to go afterwards! And we started to get into to a place and eat! So, after the concert we met a friend from Sweden  and crossed the street. As we reached the other side we realized we we're in front of a low lit place that called itself  true Swedish Resturant! It was late so the lack of clients was acceptable. And the menu was handwritten so we sat down for a light meal because it was late.<br><br>Anna suggested we have salads and she and I shared a soup. I had a dark green salad with a mild mustard vinaigrette.<br>Anna choose a layered potato shell fish salad. The food was beautiful yet flavorless,  it was also pricy for what <a href=\"/redir?url=http%3A%2F%2Fordered.so&s=291c51c34e6c1ae9cb357f0e56ff889943984ae276a732cc5f6c9ac64d16511b\" target=\"_blank\" rel=\"nofollow\">ordered.so</a> the bill was the first shock!<br>After that  we called a cab back to our hotel we dropped into bed and we're fast asleep in moments...2:00AM and the illness was in full fury. <br><br>I woke first very sick! Then Anna was up under extreme unpleasant illness.<br><br>We are still sick today. We had to drive back to Anderson on the first day! All we can say is we will never go there again", "pics": null}}, {"review": {"des": "My sis and I come here at least once a year. We have a special day out and come here for lunch. It's always just good food. Last time I got the quiche and it was so light and fluffy. Yum. It comes with a nice fresh fruit side. <br><br>The food is fresh and the wait staff is helpful. They also have some unusual drinks. I got a lavender one once, but even the low sugar one had too much sugar for me. If you like that kind of drink, try one of them out. <br><br>They never rush us, even though the place is crowded. <br><br>After lunch we go across the street to the Swedish shop.... always something to buy there! ;-)", "pics": null}}, {"review": {"des": "Very tasty breakfast! I am very picky when it comes to breakfast and it's taste but wow  the food at this place is really good. Also I really like the staff and the restaurant atmosphere. I would recommend this place to anyone in the neighborhood and if you are not from the neighborhood still come and enjoy some good food!!!", "pics": null}}, {"review": {"des": "Beware! In the vast choice of all the restaurants in the area, this place reigns supreme. We tried it once and we were hooked. From the superb service to the awesome food ( the salmon dill quiche is to die for), this place is it for your breakfast and brunch needs. <br>The patio is a beautiful addition to the whole unique and delicious experience. Give this place a chance and you will be among the regulars who come there to enjoy the atmosphere and the tasty treats.", "pics": null}}, {"review": {"des": "Mediocre food, horrible service. Not one employee asked us how the food was tasting. I literally had to get up multiple times to get things like napkins, water, coffee refill. <br>I found this place to be overrated. Won't be recommending it to any of my people.", "pics": null}}, {"review": {"des": "If real men don't eat quiche, count me out of manhood... wow. I have visited a number of times in the past few years and have always had delighted tastebuds and leave as though I am leaving my mom's house after a meal.<br>     My first visit was a few years ago with a group so it was a limited menu. Being over 100 lbs larger then with a big appetite, the quiche sounded good but I was expecting a flat little quiche.I went with the Swedish meatballs. They were good but when I saw the mile high pie style quiche, I had regrets. <br>      Since my first visit my question is what quiche will I have today as they change their special quiches daily. Yesterday was Brie and Bell peppers. I wish I could describe the light fluffy texture of the eggs, with the perfect crunch of crust and the bell peppers at the perfect cook. I savored every bite.<br>      But let's not forget the Sweedish Cucumber Salad. If I come in and hear the words\" \"we are sold out of the quiche for the day\", I still have the salad to look foward to. It's the perfect sweet, salty, crunchy cucumber salad that is made from scratch daily but always taste the same.<br>      I may not have Sweedish roots, but I'll join the family if I get to eat like this.<br><br>Update: 1/22/2018.5 star to 4 star change<br><br>I was in the area so I decided to come over and have quiche. I ordered the Salmon, Dill Quiche. Either this was day old or they did something different then the last one because I am confident it was reheated by a microwave. It clearly was not cut out of the whole, as the sides were cooked and the center was beyond hot,  which made it unenjoyable and caused the salmon to be  overcooked and have a chalky texture. Having always had great experiences in the past, I am looking at the rating as a whole but I can't justify a five star anymore. I will be back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uvki0Z_0HbnNFp0ptoJy4A/168s.jpg", "caption": "Brie and Bell Pepper Quiche with Cucumber Salad"}]}}, {"review": {"des": "I. Love. Tre Kronor. Great food, excellent service (thanks Lars!), lovely environment. I was able to sit for hours with my ipad and have my coffee refilled over and over and over, and wasn't rushed even though it was very busy. Loved my Oslo Omelet and excited to try the danish when I get home.", "pics": null}}, {"review": {"des": "Quaint, cozy brunch spot that delivers on good food. <br><br>Coffee Tea Exchange coffee and teas-<br>Coffee: 3.5<br>If the coffee were better, this place would be great!<br><br>Oslo omelette (smoked salmon, dill, and cream cheese)- 4.5<br>Swedish Limpa Rye bread: 4<br>Potatoes- 4.5<br>Salmon Dill Quiche- 4.5<br>Maple Pecan Danish- 4.5<br><br>Food was very good, and service was super friendly. Will return to explore more on the menu!", "pics": null}}, {"review": {"des": "Great food. Service was slow and food took over 30 minutes for a Wednesday early afternoon. Would've given 5 stars if it wasn't for the slow service.", "pics": null}}, {"review": {"des": "This breakfast/brunch spot is just pure homey feeling from the gecko; it has two floors from what I've seen and my boyfriend and I were seated upstairs which felt like we walking in someone's apartment. The service is very friendly but the food does come out little slow in my opinion or it's probably because I was really hungry lol the atmosphere is relaxing and the noise level is quiet to the point you can hear people conversations. <br><br>I ordered the Belgium waffle with fresh fruits and whipped cream with the side of diced potatoes. Omg! The waffle was very instagram worthy. Took the first bite and it immediately taste delicious. The waffle was light and delicious.  I recommend getting the waffle, you won't regret it. My boyfriend got the French toast and he said it was good but not good enough to stand out from others restaurants. <br><br>I would definitely come back here again for the waffle.", "pics": null}}, {"review": {"des": "Cute restaurant with plenty of outdoor seating. The menus are handwritten giving you a small bed and breakfast feel. Tre Kronor is located in downtown Chicago in the Sweedish district. I ordered the Canadian bacon benedict. The egg oozed out as I cut into it just as a benedict is supposed to. The english muffin soaked up the egg making it delicious. The bacon was thick and flavorful. The potatoes were undercooked and not that great. The waitress was very friendly and came by frequently. <br><br>I went for my birthday brunch and the waitress even offered me desert.  That was very sweet of her. I'd totally come back again and would reccomend the Tre Kronor benedict to anybody in the area.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/a50uz-1a0wJtuBgjcXCScQ/168s.jpg", "caption": "Bacon Benedict"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hpvRNhudTd8evcdGH11VpQ/168s.jpg", "caption": "Cafe Latte"}]}}, {"review": {"des": "A very quaint and cozy restaurant, with a nice shaded patio in the back during warmer months. Rustic wood and fun murals inside, also decorated with small blue plates, the same ones my grandmother collects.<br><br>The food is delicious, try the potato sausage and Swedish pancakes. Herring is excellent. Pastries are all very good too, a cinnamon roll is always nice with coffee. <br><br>I've been a half dozen times, and the service is always great, even when busy.They have a pretty big staff to take care of the weekend brunch<br>crowds. It's not a big place, so expect a wait at peak times, and maybe check out the Swedish Store to pass the time. It's a classic place, especially as the Swedish character of nearby Andersonville is fading.", "pics": null}}, {"review": {"des": "Still eating here currently but I have one word to describe this place so far; refreshing. I ordered the Joia sparkling to drink, (it's blackberry, pomegranate, and ginger) and it's so delicious. We also had the lox with mustard on bread and that didn't fail to impress us either. We got the onion soup which also was delicious. One more thing we got was the beet salad with beets, goat cheese, oranges, and a vinaigrette. SO GOOD! Still eating, so I'll update this when we get our Swedish meatballs.<br>Update: the meatballs were delicious! Honestly the lingonberry sauce was incredible, and the mashed potatoes were super creamy and the perfect taste. The lemon tart was a little too runny, and a little overpowering, but that was my only problem with the all the food we had. Would definitely come to this place again. I recommend this if you want some gourmet food that's super refreshing.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BlKAEjGYjePxedR_K4VJ4g/168s.jpg", "caption": "Inside the place heh"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/h_Lajp47Q9xTOmLDxISMlQ/168s.jpg", "caption": "Awesome soda."}]}}, {"review": {"des": "The weather was nasty but service and food was great. We pretty much had the place to ourselves. We were glad that we made the 45 min trip over from our hotel and included this on our trip up from Texas. Seating was intimate and comfortable.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cnH5KlGOvVbJqLtTjRghRg/168s.jpg", "caption": "Swedish meatballs"}]}}, {"review": {"des": "After frequenting this place for several years I experienced the most disappointing customer service. We were a party of six and waited 45 minutes for our food. Party after party were served before us. When we were finally served I made the mistake of not noticing that the quiche is served with fruit and asked for potatoes. The server quickly brought me out potatoes and then asked if she should charge me for the potatoes or take back the fruit! I gave her the fruit and then the owner explained how expensive the fruit was and how she has been in business for 26 years. Disappointing since the food is good. I guess her business doesn't need to serve all customers.", "pics": null}}, {"review": {"des": "Yummy chicken pot pie. Good price and service. It's has a nice atmosphere. Would come here for brunch again.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YW5jmyd833Zi_0eliMQJqA/168s.jpg", "caption": "Roast beef on croissant"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Exvv0JbKIceQz7fSe6HXKw/168s.jpg", "caption": "Chicken pot pie"}]}}, {"review": {"des": "I had to give Kroner two stars because of a horrible experience on Father's Day. Its the second year in a row my dad wanted to go enjoy their cozy patio and Anders Hash and Eggs... the food is amazing! But be prepared to wait a very, very long time. My husband and I arrived at 840 since they do not take reservations, we were sat at 9 when the restaurant opens, ordered in a few minutes and did not get our food for over an hour and ten minutes!!!!! I find this to be ridiculous especially at a breakfast joint. <br><br>I won't be returning anytime soon due to slow, slow service and steep prices.", "pics": null}}, {"review": {"des": "I came here on a Sunday for brunch. There was a wait to be seated (at least for a table for four), but we went to The Sweden Shop directly across the street to kill some time. We sat inside because the maître d' said the bees in the patio area were acting aggressive. I did encounter an aggressive bee on the way out. The patio area looked lovely, though. <br><br>This is my first time eating Swedish food, and the food was delicious. I ordered the vanilla and orange French toast. Best French toast I ever had! There were no sides included (other than a slice of orange), yet it was quite filling. I also ordered the sausage of the day, which was applewood smoked bacon sausage. Yum, yum, yum! It reminded me a bit of polish sausage. <br> <br>I would've given four stars if the service hadn't been so slow. And points are taken off due to the fact of how tiny the restaurant is. I was getting major anxiety every time someone new would come in through the door.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Mm2cPn0yLKSgIdNyu8dBIg/348s.jpg", "caption": "Orange and vanilla French toast + sausage of the day (Sunday) - applewood smoked bacon sausage."}]}}, {"review": {"des": "Tre Kroner is a wonderful place to eat breakfast. We love their quiche, sweets and many offerings. The service is pleasant and atmosphere enjoyable. We also enjoy shopping at the Swedish shop across the street.", "pics": null}}, {"review": {"des": "TL;DR - very slow and inattentive service, mixed food quality.<br><br>It opens at 9, and we arrived for breakfast at 9:20.  \"I'll be right back with your coffee\" took 20 minutes and us asking twice.  Our cinnamon roll took 25 minutes to come out.  Our main dishes of hash with scrambled eggs and a crepe took 50 minutes.  You may notice that all of that food takes less than 5 minutes to cook.<br><br>We also had to ask repeatedly for a fork (one was missing from the table) and extra napkins (which we ended up getting ourselves).<br><br>The hash was good, as was the crepe.  But the rye toast that accompanied it was very stale, as was the cinnamon roll.  Although the orange glaze on the roll was quite good.<br><br>Overall, I can't figure out why people are giving this place four stars.", "pics": null}}, {"review": {"des": "Loved this place for the aesthetic. It was beautiful and the food was exactly what you would want for brunch. Overall, I was very satisfied with my experience.", "pics": null}}, {"review": {"des": "Quaint neighborhood cafe with solid brunch options and unique Swedish fare. Well cooked eggs highlighted by delicious pickled herring (definately try) and Swedish pancakes.", "pics": null}}, {"review": {"des": "This brunch place is so cute. Their wait staff is friendly and check to make sure if you need anything. <br><br>I've had their waffles with berries and it's so dang good. <br>I also had their two egg any style: the standard breakfast because you can never go wrong with something classic. It was overall delicious and a good experience. Will come back to try the other dishes!", "pics": null}}, {"review": {"des": "We've been going here for years and the food has been consistently great.  Our favorite is the rainbow trout. The last time we came was for my wife's birthday with 16 people and the service and the food could not have been better, everybody enjoyed their meal and the outdoor patio was very nice.", "pics": null}}, {"review": {"des": "Stopped in for brunch this morning. Neither of us knew about their patio. It's a quaint, hidden gem! Lots of trees and the little barn is adorable! Started with coffee (nothing fancy) before moving into the main event. My friend had the french toast. It's his go-to dish here. Along with sides of both bacon and sausage (sausage has some seasoning in it I couldn't pick out, but it was great!). I opted for the omelette of the day...shrimp, havarti dill, and garlic. Yum!!! It was a combo I wouldn't have thought of but am thinking of trying to recreate at home. The potatoes that came with it were a little greasier than I would usually like, but it was fine. Our service was great as well. The waffles the table text to us ordered looked sooo good. I think I'd come back to check those out!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Bgpd2h948zh8nlD4Jzdd8A/348s.jpg", "caption": "Omelette of the day with shrimp, havarti dill, and garlic. You won't be disappointed!"}]}}, {"review": {"des": "I went here for dinner with a total of 5 people on a weekend. The place is very small. It probably seats 25-30 people? It wasn't all that busy when we sat down, maybe 4 other tables were taken...<br><br>First off, the pricing is a little bit high for their portions. <br><br>I ordered the Swedish meatballs which came with mashed potatoes and lingonberry sauce. I think the plate was $14. The meatballs were delicious, but the mash wasn't all that impressive (a bit bland). <br><br>It did take a while for our food to arrive to the table, not too sure why since it wasn't busy... <br><br>It didn't leave a great first impression, but I'll go back to try the breakfast. I heard the breakfast is where it's at!", "pics": null}}, {"review": {"des": "This was literally the smallest restaurant I have ever set foot in. So tight you can see what everyone in the room is eating...<br><br>It's a very cute place, but it would be nice to have a little extra room. It would make the world of a difference. <br><br>I came in here wanting to try a different type of breakfast. Something besides your ordinary American breakfast. So I saw this Swedish breakfast place online and I really wanted to try it out. <br><br>The Swedish pancakes looked so good, and they were HUGE and flat.... how did they taste...eh, nothing to write home about. <br>I wouldn't want to try them again to be honest. <br><br>We also had the Belgian waffles with whipped cream and fruit. Again, nice presentation, the taste..nothing special I would come back for. We also tried out their quiche thinking maybe the third entrée is a charm? <br>We ended up being wrong again. Everything was too bland.  <br><br>And to top it off our breakfast bill was $88......<br>Yeah, sorry but I'm definitely not coming back.", "pics": null}}, {"review": {"des": "This was an amazing hole in the wall. The topping on the cake was that we were able to order a dinner appetizer for brunch, baked Brie with apples and honey. We had their Oslo omelette, their smoked salmon and dill cream sauce was amazing. It was not overpowering and was mixed very well with the saltiness of the smoked salmon. We also had their corn beef hash. It had so much flavor and had just the right amount of char and crisp to make you want more after every bite. Hands down will go back to try more of their menu items whenever I am back in town.<br><br>Just a heads up, this restaurant is small and does not seat a lot of people. But what it lacks in size, they make up in flavor", "pics": null}}, {"review": {"des": "Although we have our usual brunch places, we decided to try a new one on recommendation. <br> However, that place had no AC (!!) and a 45 minute wait (!!!), so we ended up at Tre Kroner. <br> I'm sure glad we did - the waitress was delightful, and the food delicious.  Even my cinnamon role was still tasty when I finally got to eat it the next day.  TK is definitely worth your time if you're in the area and hungry.<br><br>The one kvetch I have has to do with my own derrière.  Specifically, that it's large, and therefore trying to navigate the restaurant was a challenge, since I didn't want to knock into anyone.  If you're less gifted in that department, or if you don't sit in the very back of the restaurant, I imagine you'd be fine.<br><br>In case it matters to you, there isn't a 430 ILCS 66/65 sign that I could see.  Huzzah!", "pics": null}}, {"review": {"des": "Love this place! Not that expensive and has a great variety of food. I shared the Meatballs and Waffle. The only bad part about this place is that they don't take reservations and the restaurant is very small and the wait can be long. Great place, for any meal!", "pics": null}}, {"review": {"des": "One of our favorite restaurants.    Food and service are excellent.     Hard to find a good quiche but theirs is tender, fluffy and tasty.    Fresh squeezed OJ, coffee and pastries great.    Coffee and water are refilled frequently.   Does get busy on weekends - be aware that food is prepared by order placed so if you ordered after a large party ordered, they will get their meals before yours even if your order is simple.   Has upstairs seating too.", "pics": null}}, {"review": {"des": "Met a few friends here for breakfast. Very cozy and quiet. Ordered the crab cakes eggs Benedict special, which was good. Odd that it didn't have any muffins, or toast, so felt a bit incomplete. The crabmeat is molded into a party rather than lump.", "pics": null}}, {"review": {"des": "Have been to this place multiple times and love the food and decor, and especially the outdoor patio in summer! <br>However, last time we were there, I was very disappointed with their customer service. I understand their policy for no outside drinks, especially given the proximity of Starbucks and long wait times over the week end. However, you as a restaurant DO NOT SERVE ANY MILK SUBSTITUTE. So, what right do you have to ask me to dump my coffee when you cannot provide an alternative? After my visit I called the restaurant and asked to speak with their manager. Manager got on the phone,  told me the owner will call me back...and guess what? Nobody did. So much for caring...well, now I know.", "pics": null}}, {"review": {"des": "An absolute delight! Gorgeous old home turned restaurant. Excellent service. Great coffee. Perfect Swedish pancakes, fluffy omelettes. Don't miss Tre Kroner!!", "pics": null}}, {"review": {"des": "I had time to start this review while waiting for my brunch. The service is very friendly and polite. However it's a small and complicated place. I don't recommend it for large groups or if you're on a tight schedule. The pastries are heavenly and the coffee fragrant. The food is ok and the portions are small.", "pics": null}}, {"review": {"des": "This is a must-visit restaurant in Chicago, in my option. The atmosphere is cozy and cute, the service is great, and most importantly importantly the food is delicious. Every time I have come here, no matter how busy it is (and this place can get PACKED on the weekends) I am always met with incredible and friendly service. The food is wonderful - my favorites are their quiche, corn beef hash, and their homemade soups. While the dining space itself is small, it adds to the overall homey feel that you'd expect out of a Swedish restaurant. <br>The prices are right and the portions are perfect.", "pics": null}}, {"review": {"des": "One of our favorite weekend breakfast & brunch spot. But also been here for lunch with coworkers. Cozy restaurant with plenty of outdoor seating. Fresh ingredients and delicious. Love their quiche served with fresh fruits. Open face tuna salad sandwich is my other favourite - creamy and light tuna salad, small chunks of nuts and fresh grapes add crunchiness and a fruity sweetness to it. Their freshly baked pastries is a \"must try\".<br>Staff members are very friendly.<br>Since they make everything fresh, lunch sometimes may take over an hour if you plan to go during your workday lunch break.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qrd7kpYBL8DC7ijoFoWKDg/348s.jpg", "caption": "Oslo Omelette with salmon"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hTeeIKTi8orj7-n9-kfYLQ/168s.jpg", "caption": "Spinach Salad"}]}}, {"review": {"des": "Wonder brunch! Delicious french toast and amazing quiche. So nice to my 1 1/2 year old, great for young families.", "pics": null}}, {"review": {"des": "Deciding on a special Mother's Day breakfast spot wasn't easy...that is, until I called Tre Kronor and was delighted to hear they accepted reservations. I've seen Kronor on a popular cooking show years ago and had a hunch my mom would love the Swedish specialties..<br><br>Reservations were made for 9:30am and arriving at 9am upon opening, there were groups already waiting outside to be seated, not surprising....Even with reservations, we waited and waited and waited.  Although it was a gorgeous day, we weren't planning on sitting outside for about an hour.  That's how long it took to finally get our table.  Not sure having reservations helped, especially after witnessing other groups arriving after us get seated.  We asked the front waiter a few times on the wait and he seemed flustered each time. While this left an impression of what to expect inside and possible haphazard service - it was quite the opposite. Flawless.<br><br>Tables were adorned with pretty pink flowers. Consistent with the pink theme, we were given complimentary pink champagne along with \"Queen for the Day\" pink stickers which we happily applied to ourselves...yes we were all Queen's for the day, but the real Queen that day was mom...Specials and menu items were thoroughly and thoughtfully described. Although we noticed brunch was offered, there was no mention of and we were fine with the menu's on hand.<br><br>I was torn between the Stockholm Omelette (Falukorv sausage w/caraway Havarti - YUM), Quiche specials and Crab Cake eggs benny - all sounded mouthwatering.  After being told the hollandaise is excellent, my decision was made. Crab cake eggs benny it was.  Sis had the Oslo Omelette; smoked salmon, fresh dill and cream cheese.  Mom ordered the Swedish pancakes (I knew she would) and 2 eggs plate (comes with potatoes and toast).<br><br>We weren't ashamed to sample more. Sis shares my obsession for variety. How could we not taste the HOUSE MADE corned beef hash? (Sis is a fan, me not so much).  Side of Swedish pancakes (I didn't want to steal Mom's), and another Swedish specialty; Falukorv sausage.<br>Sausage was very good and reminded me of a refined Polish (no disrespect to the Swede's).<br>Hash was finely cut corned beef & potatoes with an overwhelming Sage presence.  Oily and salty.  Not as enjoyable as we had hoped.  Sis felt the salmon in her Oslo was very salty as well, but loved the texture of her omelette.  I tasted the salmon and agreed - overly salty.<br><br>Crab cake was full of fresh crab, topped with the best poached egg's I've tasted in a long time.<br>Hollandaise was light and smooth - delicious. Mom enjoyed her perfectly cooked eggs.<br>We all agreed our potatoes were more undercooked than cooked, and not very memorable.<br>The showstopper?  SWEDISH PANCAKES.  Everyone's favorite, not to mention the Limpa Toast....if your having toast, this is what you want to get..<br><br>Not only was our girl super friendly and attentive, she was upbeat without missing a beat throughout our entire breakfast. Constant refills on coffee, water and check-ins on our food..<br>Speaking of coffee, the cappuccino's are on the weaker side. Surprisingly, the coffee was much stronger.  So good we asked what they use -  local supplier; David's blend..<br>If your craving more Swedish sausage, their main source is Paulina's Meat Market..<br><br>Interior is very small & tight - but so very charming.  Just as I expected.  The second floor has additional seating and reminded me of dining in someone's home...The bathroom with tub certainly added to the charm and homey feel.  Parking wasn't bad either.  We easily found spots nearby..<br><br>While I struggled with the rating due to salt & seasoning and undercooked potatoes - not to mention the strong egg smell on glasses..(yes, sis told the waitress so they would be aware of this and rectify)....Everything else we had was delicious. The experience, memorable. And the service, excellent.  Would love to come back and sit outside in the quaint back patio for lunch..Grab a Reader on your way out the door....<br>I'm indecisive on my 3.5-4 star rating...another visit is needed :)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8qTSME_mmyuCYRDG0gxt8Q/348s.jpg", "caption": "Housemade corned beef hash"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8U_yfL4_78pTVFAH9Wr0gA/168s.jpg", "caption": "Oslo omelette - smoked salmon,  dill & cream cheese"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5t7sYAJwjwars0lTIictcQ/168s.jpg", "caption": "Crabcake eggs benedict"}]}}, {"review": {"des": "My absolute favorite restaurant in town! Although I've never had a bad meal here, I'll admit my go-to favorite menu item is definitely the duck breast on their dinner menu. Highly recommend giving it a try with the lingonberry sauce as well.", "pics": null}}, {"review": {"des": "Amazing Benedict - worth waiting for!<br><br>Family took me to this cute little Scandinavian place for breakfast as soon as I landed in Chicago, after a very early morning flight and I think it'll be the ritual moving forward. Get off the plane and head straight to Tre Kronor.<br><br>We got there on a Saturday morning at around 8am and it was already quite busy. My cousins strongly recommended ordering one of their Eggs Benedict dishes, but they weren't ready yet - the hollandaise sauce was still being prepared and would be ready in 20 minutes. It was well worth the wait - get the Eggs Benedict.<br><br>Specifically, I had the crab and it was the best Eggs Benedict I've ever had. I got 2 large and meaty crab cakes along with the Benedict and the well-worth-the-wait hollandaise. It came with a side of potatoes as well (no bread). It was very filling and because of the eggs, a bit heavy but the crab cakes were such a great compliment - meaty but light and not too dense.<br><br>To fill the 20-minute wait for the hollandaise sauce, we ordered the pastries like the freshly baked cinnamon roll (thick and dense icing compared to Cinnabon, but holistically not as sweet) and pecan and maple danish. They were served warm and were just perfect. Light, but filling and a couple more and I probably didn't need the Eggs Benedict.<br><br>They were constantly busy with tables frequently turning over, but the service was still very attentive, warm and friendly. They never left our coffee cups cold or half full.<br><br>I would definitely come back. First time at a Scandinavian restaurant for breakfast and I'm a huge fan.", "pics": null}}, {"review": {"des": "Friendly service.  As we entered they told us that the kitchen was backed up. We had another member of our party was going to be over 30min late.  They said we could take their order and (hopefully) by the time he arrived the food would show up. And sure enough the two arrived at the same time.  They had a \"house\" magician show up.  He was very friendly but we did not partake on his service.  Otherwise service was good and food flavors were great.", "pics": null}}, {"review": {"des": "My husband and I tried this place for the first time last night and we loved it! It was a pretty chill atmosphere. The waitress was very friendly and all smiles as she served us. There was no wait at all and we were seated right away. The time it took the food to come out wasn't as slow for us as other reviewers have mentioned. Perhaps that's because we were one of the few customers there on a damp Friday night. <br><br>My husband had the pear salad, duck with lingonberry and he had nothing but good things to say! I had the onion soup and the swedish meatballs with pickled cucumber and the berry sauce. It was simple but delicious! To top it all off, my husband had their coffee with burnt custard for the both of us to share.  The serving size for the entrees were pretty small for the price, but the taste was worth every penny. <br><br>We enjoyed our experience here and look forward to coming back!", "pics": null}}, {"review": {"des": "I always enjoy food from my own people! But ... this spot seems to become more inauthentic the more I come here. The decor is of course very much reminiscent of my days in Sweden spent with family, but most of the food doesn't have the same effect.<br><br>I've had a few things on the menu on several visits here, including a veggie omelet with spinach that was too thick and eggy (not like anything I would get in Sweden), and the pancakes, which are better than most of the food. The potatoes were probably the most disappointing to me, as usually they should be more crisp and not so bland. Most recently I had the Brie and red pepper quiche, which I thought to be the best thing I've had here. Crispy crust, and smooth and delicate filling, and the red peppers gave it a sweetness that I wasn't expecting. Side of fruit was a nice addition! But again, it could've been a little more representative of what Swedes would eat (maybe some lingonberries or better strawberries instead of grapes and kiwi). <br><br>And now for the bullar - first of all, I think there should be a distinction between the cinnamon and cardamom varieties, which the wait staff don't seem to understand. Also there's lemon icing on them, which is adds a nice tang but also not the most authentic. It's a good cinnamon roll, but it doesn't really remind me of the ones I've had in Sweden. <br><br>What's more is that when the staff sang happy birthday to someone in the restaurant, they didn't even sing the Swedish version (Ja må han leva), and that made me sad :( so aside from some minor dishes on the menu, I don't feel like I'm eating Swedish food. Not saying it's bad, there are just better spots for that kind of experience.", "pics": null}}, {"review": {"des": "This is a Swedish gem on the north side. Went for dinner.  The menu is small , but everything on it is very good. My go to dish is the trout with sauteed spinach. The meatball are also a recommended dish of mine. my favorite app are the crabcakes and the french onion soup is very hearty. Tre Kronor is a BYOB place. Street parking is available. There is outdoor seating which is very nice and relaxing. The staff is very friendly.", "pics": null}}, {"review": {"des": "A friend and I dined here on a Saturday evening, and it was an incredible experience from start to finish. When we first walked in, the clean but warm aesthetic of the restaurant instantly caught my eye. Think IKEA crossed with an artisanal cuckoo clock farm. The decorating was perfectly balanced, with nothing overshadowing or drawing too much attention. After opting to sit outside in the \"stuga\" (basically a small wooden hut resembling a children's playhouse or a tiny home), we settled in with a couple glasses of freshly squeezed orange juice.<br><br>By the time our appetizers arrived (baked brie with thinly sliced green apples and a drizzle of honey, as well as the pickled herring dish), I realized that the tasteful atmosphere of Tre Kronor would be extended to much more than the decorating. Both appetizers were perfectly balanced in flavor, portion, and plating.<br><br>For my entree, I ordered the lightly breaded and baked chicken with a side of mashed potatoes, and I substituted homemade pickles in place of the green beans. The chicken was breaded just so that it was filling but not too heavy, and the accompaniments were an excellent complement to the main dish. Substituting the pickles was a great decision, as they were a bright and summery addition, peppered with fresh dill that I'm willing to bet was homegrown in the garden just to the left of the outdoor dining area.<br><br>I opted for the lemon tart to finish off my night, and it did not disappoint. Though the custard was a bit runnier than I am used to, it held ample amounts of bright and fresh lemon flavor, and it wasn't hard to find room to polish the whole dessert off. <br><br>My dining experience at Tre Kronor was just that - an experience. I walked in expecting yet another forgettable meal, but instead I found an inspiring and relaxing respite. Go to Tre Kronor with an open mind and an empty stomach, and you too will be charmed by their artistic atmosphere and cuisine.", "pics": null}}, {"review": {"des": "Ok, this place has been getting by on spotty service for a looong time now. Case in point: Sunday AM brunch. Arrived at 9:15, no coffee until 9;30, no cream until 9:40. Coffee not very hot to begin with. <br>First rule of waitressing: GET THE COFFEE POURED! <br>When we finally did get our food (10:00) the waitress says: \"bacon's not ready yet; it'll be along in.a few minutes.\" So. Do we eat our food and have bacon for dessert, or do we let the rest of our food get cold (to match the coffee) while waiting for the bacon?<br>First rule of managing a Sunday brunch: HAVE THE BACON READY WHEN THE DOORS OPEN.<br><br>Food? Good; or I'm sure they would have had to shut down.this cute place years ago. BUT, the service needs a lot of work<br> <br>Seems like every time we're here,  (monthly or so in \"outdoor months\") there's a complete change in wait staff.  Some have been really good, some have been well-meaning but not particularly efficient.  <br><br>Here's a thought: instead of hiring young coeds with no experience who look good in yoga pants, try to find - and pay- some gum-snapping, out of shape, Experienced middle-aged waitresses with too much eye shadow and lightning-fast coffee-pouring abilities. <br><br>This place, good food notwithstanding, needs an infusion of Chicago diner-style efficiency.", "pics": null}}, {"review": {"des": "This Swedish restaurant has the most amazing mushroom soup, \"Reubenssen\" sandwiches, and creme brûlée.<br>The meat on the sandwich was not fatty, as Reubens so often come.<br>The soup today is not vegan (as it's made with both cream and beef stock), but if you're not vegan it's tasty beyond words.<br>Having been here before I also recommend the chocolate mousse and Swedish pannekakar- thin pancakes with lingonberry, and various quiches.", "pics": null}}, {"review": {"des": "This is a cute little Scandinavian American restaurant in the North Park neighborhood. I've been here twice. Once for dinner. Once for breakfast. Dinner I had the duck breast with lingonberry. Breakfast I had the French toast. Both were delicious. I would definitely come back. There were other items I would definitely like to try.", "pics": null}}, {"review": {"des": "This rating is for the very kind, professional, and nice staff.<br><br>We had not been here in years.  Notably, at 11 am on a beautiful Sunday in chicago's all-too-brief summer, one could walk right in, which should have been a tip off.<br><br>The oslo omelette at our table was so salty as to be inedible.  The Swedish pancakes were utterly tasteless, they appear to have replaced good  apple syrup with restaurant supply corn syrup substitute and the special sausage they touted was swimming in grease, and in a word, awful. <br><br>The poached egg was perfectly done and the potatoes were good.  The coffee was better than average for restaurant coffee. <br><br>All in all, not going back.  Kudos to the manager for not charging us for the meal, though we would have been happy to pay. [That means we're not just trying to get a free meal.]. <br><br>With so many excellent breakfast restaurants in the city, it's time for Tre Kronos either to do a total overhaul, or recognize that it's time has come and gone.", "pics": null}}, {"review": {"des": "I sometimes come to this place for the quiche which is usually amazing! But today was not the case... came in for lunch and ordered the Broccoli Cheddar quiche, but seems like they made me the wrong one so that had to redo it. So the cooking time was not the same because they were trying to rush it out so I wouldn't notice, I rather they have been honest and I would have been patient to wait for a fully cooked one. My quiche came out and was a scrambled mess, the dough was raw in the bottom and the eggs weren't cooked like a quiche is supposed too. The crust on the outside wasn't even flaky at all.. They offered to remake it but I was on a time crunch for work and didn't have another 15min to wait for another one. I gave them 2 stars because the mushroom soup was great. But believe me they still made me pay for that scrambled mess they called a quiche.", "pics": null}}, {"review": {"des": "Waited 1 hour for food ---2 Belgium waffles, order of bacon, and 1Swedish pancake order.   When asked about where food was after 45 minutes was told they were backed up and kitchen couldn't handle orders.  Was sitting outside in lovely back yard and the. Went into find manager/owner saw 2-3empty tables with room and upstairs closed.  Was told owners were in kitchen trying to get food out.  Totally unacceptable.   Food finally came out after 1 hour and akthough not cold, not hot.  Will never go back.", "pics": null}}, {"review": {"des": "I stumbled across Tre Kronor after moving into the neighborhood and decided to try it for a weekend brunch. The decor and ambiance were fun and cozy and the restaurant makes you feel like you've been transported to Sweden. Our breakfast items were okay but not fantastic, however the table next to us had the Belgium waffles which looked amazing. I hope to return and try the lunch menu out on the patio since the ambiance there was even better.", "pics": null}}, {"review": {"des": "My favorite breakfast place! Best waffles, French toast, and quiche! Love sitting outside in the summer time, good food, cozy and quaint atmosphere, perfect brunch or breakfast spot on the North side.", "pics": null}}, {"review": {"des": "This is definitely a very cute place to have breakfast though they sell lunch items too. <br><br>My husband and I have been coming here for over 6 years and we have yet to have a bad meal or a bad experience. Although the weekend mornings get particularly busy and there is a slight wait time, it's never been overly bad and the waitresses are all very friendly and courteous. <br><br> Usually when a place gets super packed, the service takes a hit but not here.  I really do not think this place is any pricier than other breakfast spots and the portions are more than enough for one person....plus if we are comparing it to another well known so-called \"Swedish\" breakfast spot...this one takes the cake...by far", "pics": null}}, {"review": {"des": "Food wasn't what I'd consider one of the best places for breakfast. Bryn Mayr breakfast club had a wait and was really stuffy inside. We got a table right away and the server was nice. Didn't realize how long it took for the food to come out. Literally took an hour later from ordering to get our food. The potatoes weren't listed on the menu and if they were, I would've preferred them well done. Some were chewy. We feel like the restaurant got busy with regulars and totally forgot about us. Won't be back!", "pics": null}}, {"review": {"des": "We can't comment on the food because it was 2 degrees Fahrenheit and we were happy to wait for a table for two (with the other twosomes in front of us). The hostess/waitress takes our name and we patiently wait by the freezing, front door.<br> After 20 minutes, a table for two table opens up right on the front door, directly in front of us. I'm  speaking five feet away from the front door. Literally. Plus the door keeps opening and closing.<br>Summer- maybe. I'm not sitting there in winter after standing there in the freezing cold. <br>The hostess wants to sit us there and we ask nicely, hint, hint (3 open four tops away from door in back of the dining room) if we could sit somewhere warmer. <br>She states it will be it wouldn't be possible and it will be \"TWENTY MINUTES MORE\" and we will have to \"GO OUTSIDE ACROSS THE STREET TO ANOTHER BUILDING.\" WTF?<br>Just then, we see two gentlemen getting up from a four top and there are still 3 open four tops and not a huge line behind us. <br>Plus, she's going to start sitting the newcomers of three and more before us!<br>The hostess/waitperson should realize that she would have NO LINE and TURN OVER more tables if she didn't leave them empty. She had the nerve to say \"NO...WE PREFER TO RESERVE THEM FOR THREE OR MORE PEOPLE.\"<br>When there are a bunch of twosomes waiting, why are threesomes more important? I understand you may have some tables for two opening up in TWENTY MINUTES, but we could almost be done by then if you did your job and seated people promptly. IDIOTS. <br>ITS A MATTER OF TURNOVER. You need to hire an efficiency expert to do a consultation immediately. Many restaurants have perished due to poor customer service. <br>We turned around and walked out the moment that woman was foolish enough to tell us \"I don't want your business= We reserve these tables for three people or more.\"", "pics": null}}, {"review": {"des": "I got to come here for the first time today and I really enjoyed the outside patio, as well as the iced coffee, and the food.  It's on a corner across from North Park University.  The actual inside of the restaurant appears to be VERY small, and there seemed like quite a few people who had to wait to sit inside in the AC.  But the patio is quite large and offered quite a bit of seating, and much of it was in the shade, which was a relief in the unseasonably hot temperatures.  I had the Salmon Eggs Benedict and they were really great.  It came with potatoes, which were good, though not the best I've had.  I would happy come by here again!", "pics": null}}, {"review": {"des": "KO and I had a lovely, near-perfect brunch a couple weeks back. Benedicts. Smoked salmon for me, crab for her. The cappuccino was terrific, and the tea selection seemed high-quality. The dining room is tiny,  not much room for stroller families, but they work it out so everyone is comfortable.<br><br>Then, gold help me, we ordered dessert. A plum tart to share, and one to go. My husband gave it high marks.<br><br>I'll absolutely be back. My parents are regulars.", "pics": null}}, {"review": {"des": "So I have to update my review again. My daughter and I had dinner here tonight for the first time in a long time. They finally changed the chicken recipe back to the original. If it's not the original, it's pretty darn close. DELICIOUS!!! I'm so happy they changed it back and I will now make an effort to dine here more often (I live like 45 minutes away.) Our waitress Audrey was wonderful as well. Very sweet and helpful.", "pics": null}}, {"review": {"des": "It is really quaint, unique, and tasty!  Absolutely delightful is my assessment!  We will be back often since we just moved into the area.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oLLEVJZj_yOasQaYc8jgMw/348s.jpg", "caption": "This is the \"Oslo\" quiche or something like that.  Basically it was a massive portion of salmon delicousness.  So good!"}]}}, {"review": {"des": "I struggle with this one.  5 for ambiance, service, and setting.  2 for quality and taste of food.  We had a party of 6 and varied food.  Bread was generally hard, coffee generic, the cinnamon danish, meh, eggs looked deep yellow, but were bland, and accompany food was over spiced.  <br><br>I will probably try this again, but I was really psyched for greatness and very let down.", "pics": null}}, {"review": {"des": "Great Restaurant with a warm and <br>Welcoming atmosphere. They have<br>a great menu and the service was<br>Great.<br><br>I would recommend this restaurant to<br>Friends and family. Reminds me of<br>The Restaurants we went to in<br>Stockholm Sweden.", "pics": null}}, {"review": {"des": "This place I liked before because of their quiche for breakfast. I guess you'll not go wrong eating for brunch but don't recommend for dinner. Over all dinner experience was ok. Don't plan to eat here for dinner again. Good thing our dinner experience was made pleasant by our waiter Luke who was nice and attentive to our needs. The other lady waitress was also nice and polite.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YPJS4qgCZClGHD9hNCtDjQ/348s.jpg", "caption": "Sauce was tasty and crab cake OK. But would have taste better if more crabs than other ingredients"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YNM06tT4ttYq3MCT7-XE1Q/168s.jpg", "caption": "Will not go wrong with their chicken. Flavorful sauce. Vegetables cooked just right"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0R-V98gI9H0PwgwijFef7w/168s.jpg", "caption": "Avocado, blue berries & blue cheese w/vinaigrette dressing. Lacks dressing. Over all there's no \"wow\" in this salad."}]}}, {"review": {"des": "This was a awesome surprise. We ended up here around 9:15 on a Sunday morning because wait time elsewhere was too long. We were seated right away and the server gave us a long list of super fun specials with our menus. The brunch menu has a great range of traditional Swedish and more American breakfast staples along with a great selection of lunch options. <br><br>I got an omelette with bleu and spinach and it was perfect! Just the right amount of bleu and it was light and fluffy. My boyfriend got a BEAUTIFUL Belgian waffle with strawberries and bananas and homemade whipped cream. <br><br>The restaurant is adorable and the vibe is fun! The wait staff was helpful and enthusiastic and really cared about providing wonderful service. I will definitely be returning.", "pics": null}}, {"review": {"des": "Brunch, dinner, desert, snacks, light, heavy, etc. <br><br>I've never had Swedish food, and I cant stop going to or ordering from this place.  I'd write a novel if I had the time, but the Swedish pancakes with lingonberry, orange/vanilla french toast. corned beef hash, meatballs, salmon, duck, and more.  <br><br>Excellent.  All of it.<br><br>This place is damn fine food.  Their outdoor patio is wonderful to.", "pics": null}}, {"review": {"des": "Its great food, great coffee, but the service is unbelievably slow. I've been there twice, and although the second time was better, it feels as if the waiters and waitresses do not have their own sections so its a bit confusing for them to know who to check on and when.", "pics": null}}, {"review": {"des": "This is my favorite brunch place in the city. They have good Swedish dinner as well. I have come here several times with a friend or a group. It never disappoints me. So I feel I have to write a review for them. <br>Their Danish is freshly baked every day, flaky and soft. They always have daily specials, like quiches, omelette and eggs Benedict. I tried almost everything on their menu and I am never tired of quiche. Both salmon dill and broccoli cheddar are great. <br>In the summer, you can sit outside in the lovely garden/yard. Definitely a local and comfortable place for relaxing meals.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eHxdiJmjtYdIUCDgq3cmcQ/168s.jpg", "caption": "Maple pecan Danish"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dJiylDJdNfiwBloJ6_t6Bw/168s.jpg", "caption": "Salmon dill quiche"}]}}, {"review": {"des": "My profession allows me to take wonderful seniors on day trips; Tre Kronor was where we dined for lunch during our Swedish themed adventure last month.<br><br>Pros: wonderful wait staff, good portions, decent atmosphere. Excellent breakfast/brunch/lunch option.<br><br>Cons: the party room we ate in was quite dirty and it appeared that there were still Christmas-like decorations hanging up. Not sure whether or not the group I was chaperoning noticed the dust and junk on the floor, but I did.<br><br>Overall, the food that we came for was good. I had the spinach and mushroom quiche as my entree and the lemon tart for dessert. Personally, I like a firm quiche, but this was not so. It was a very thick piece; likely the reason for the liquidy center.<br><br>Would return here for a meal if I were in the area again.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fM1HiPxO63_r2HivqkRsDQ/168s.jpg", "caption": "Smorrebrod sampler w/ fruit"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VRWtYEsssOuGXtrtDJ9-Vg/168s.jpg", "caption": "Spinach & Mushroom Quiche w/ Fruit"}]}}, {"review": {"des": "I came here for Easter brunch with husband and son. There was no wait! We ate upstairs and I was pleasantly surprised by the decor. It's so homey and feels like you are at a friends house enjoying a home cooked meal.<br><br>To eat, I ordered the honey mustard chicken salad on a croissant with a side of potatoes. So delicious! The sandwich tasted awesome but was messy and hard to eat. The potatoes were my favorite! I would get a plate just of those. I also ordered a Swedish cinnamon roll. Yummy! Warm, gooey, sugary goodness. My husband ordered an omelet. I forgot the name of it but it had havarti (?) cheese and sausage. So good, too!<br><br>I really have no complaints. Our waitress was nice and helpful. I will be back and sit outside when it's nice out. A perfect brunch spot!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Vk8wUZ95iIm81-RWCmPkCQ/168s.jpg", "caption": "Honey Mustard Chicken Salad on a Croissant with potatoes Cinnamon Roll. Yum yum in my tum!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AIv7OrozBQwuNn1vxAyVhA/168s.jpg", "caption": "Swedish Cinnamon Roll. So. Delicious!"}]}}, {"review": {"des": "Visited late morning for brunch.  Both the breakfast and lunch menus were available.  The ambiance was quaint with Scandinavian pictures and prints throughout.  Some Swedish guests that were sitting near us commented that they made them feel at home.  It was a great place to have a leisurely breakfast and enjoy conversation with friends.  We enjoyed the corned beef hash and both an apple and raspberry danish.  The generous portion of corned beef hash was outstanding.  Made from scratch.  The thyme seasoning was prominent.  It was cooked nicely and not at all mushy or overcooked like the kind you get in a can. The over easy eggs were cooked perfectly.  You can request the hash as a side, if you don't want it with eggs. The pastries were served warm.  Exquisite crust with buttery flaky layers.  The coffee is average to above average but not the reason to return.  Very attentive and friendly staff.  Several special quiches were offered in addition to the menu items.", "pics": null}}, {"review": {"des": "Wow!  I loved everything about Tre Konor.  The downstairs is a bit tight, and may worry you when you first approach.  But do not fear!  There is a full upstairs above the entryway that holds around 20+ tables in a very cute decor old-world home.  The restroom here has a bathtub in it... It honestly feels like you're eating at someones house.<br><br>The food!  I had the hash... it was amazing.  Literally astounding.  The toast (some kind of Swedish bread) was perfectly done.  Simple to make toast?  WRONG!  It was perfect.  Lightly toasted, with just a light hint of butter throughout.  This place makes me stupid for the simple goodness of breakfast!<br><br>Okay, but back to the hash.  The beef was flaky and tender with a light saltiness along with tender potatoes.  The most surprising this about it was that there was enough of it on my plate.  when it arrived I thought it was a little on the small side, but once I was half-way through the plate I realized that my eyes had shrunk back to my stomach's size and I was becoming very satisfied.  The eggs were nothing special, but that in itself is real compliment.  The just were.  They were the eggs I wanted.  The eggs the hash needed.  I ordered them over-medium, and that's how they came.  It was perfect.<br><br>This meal along with a continually refilled glass of good coffee made me a very happy man.  Come, eat, be happier.", "pics": null}}, {"review": {"des": "Tre Kronor is one of my favorite breakfast places in the Chicagoland area. This cute restaurant will make you want to go Sweden, as it is beautifully decorated with Swedish woodwork and other decorations. I usually get an omelette, but on my most recent visit, I had the spinach and mushroom quiche. The quiche was heavenly: the eggs were light and fluffy, and the crust was baked to perfection. While their omelettes are good, I'm seriously wish I had tried this quiche earlier - I highly recommend it! Their pastries are also really delicious, and I would suggest ordering one (or more) to eat while you wait for your main entree.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hhocseI1P_Fsupz-LXjTgw/348s.jpg", "caption": "Spinach and mushroom quiche"}]}}, {"review": {"des": "Part of my Foster Ave Restaurant Crawl! Tre Kronor means three crowns and a 16th century castle in Stockholm, Sweden. Kronor by itself is a boys name variation of the name Connor. Quaint, cute slice of Sweden in Chicago! Came for brunch left wanting to come back for dinner! These folks have been doing this for a while the service, staff, ambiance, pace and efficiency were all perfect. Exceeded my expectations. Started off with the cinnamon roll served warm with raisins topped with a sweet sugar glaze, delicious.  Had to try the Danish onion soup it did not disappoint, one of the few soups of this type that was not to hot to slurp right away. Had to try the open-faced Norwegian meatball sandwich with breakfast hashbrowns tasted exactly how I thought it would.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7AlpcpPJEBdmEAKJmKASPQ/348s.jpg", "caption": "Diners drive-ins and dives made a visit"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VswUoaRCaDcu4D-_hrHuaQ/168s.jpg", "caption": "Open face Norwegian meatball sandwich with breakfast hashbrowns"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7JM0ruLkhqKziD1lQ3V-cA/168s.jpg", "caption": "Danish onion soup"}]}}, {"review": {"des": "Kind of disappointed by the portions; everything is fairly expensive which makes you think you'll be getting a good amount of food. However, the roasted duck was probably only 3 ounces and it was the most expensive meal. This is probably because everything is homemade from scratch though, which I appreciate. I did, however, enjoy the service. Our server was friendly and kind. The menu is extremely limited so if you're even a slightly picky eater, which my company here was, you'll be very disappointed. Everything takes very long; we were the only table in the entire restaurant and still waited 30+ minutes for our food. Again, my guess this is because they make most things from scratch.", "pics": null}}, {"review": {"des": "Cute and friendly, but oh my gosh sooooo sloooow. Tried it twice and not sure we can do it again with a toddler in tow. Fresh orange juice is nice, quiches are tasty.", "pics": null}}, {"review": {"des": "I like it a lot for breakfast, good coffee good staff, great benedicts as well as other breakfast dishes. Nice friendly atmosphere", "pics": null}}, {"review": {"des": "Went here for brunch with a friend. Surprisingly, it was not exceedingly crowded on a Saturday. I ordered the Belgian waffle with all the toppings with their maple sausage. It was excellent! Friendly and knowledgeable staff. They also have a Swedish shop connected to the Resturant which I did not have time to explore, but I hear it is pretty cool. Give this place a try!", "pics": null}}, {"review": {"des": "A little annoyed by the reviewer who knocked it down a star because of the size?  Really?  I've been here a bunch of times.  Yes there is a wait, that's because it's good and a lot of people want to eat here.  Yes, it's small, but you whack it down for that?  The homemade herring is absolutely out of this world.  Served with some egg and fresh onion.  Couldn't be done any better!  Rock on Tre Kronor, always a fan!", "pics": null}}, {"review": {"des": "Me and my cousin went here on a Saturday morning. I didn't know they had additional seating upstairs-which had a very-home like setting to it minus to noise level you can get at alot of breakfast places! We tried the Stockholm omelette was OK but I really have to compliment them for their amazing Oslo omelette which I had to order again! The Anders hash and eggs was very delicious as well as the Swedish Cinnamon roll(warm and soft)! Unfortunately the food took quite awhile to be served... Prices are reasonable for portion!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/25NBXCrElFj19Oj1ccZxKg/168s.jpg", "caption": "Anders hash and eggs"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xP3i7DYXfgRzM5uv2i-iRw/168s.jpg", "caption": "Stockholm omelette"}]}}, {"review": {"des": "Nice quaint place. Never have been to Swedish place. service was really good and the food was good as well.  I would certainly recommend this place and will next time try them for breakfast. Stop in and enjoy!", "pics": null}}, {"review": {"des": "Had such a positive experience here and is my new favorite place. We had the Swedish Pancakes and the Salmon and Dill Quiche.  Both were excellent.  Also make a solid latte. Going next week when the family is in town", "pics": null}}, {"review": {"des": "Just a charming, cozy, clean and friendly Swedish restaurant across from North Park University.  I felt like I was in Sweden.  So very special.<br><br>The food was fabulous, I loved every bite!  Started with Danish onion soup, limpa bread.  Excellent!  Main selection was the Oslo omelette with Norwegian salmon, fresh dill and creme cheese.  Dessert was rice pudding with lingonberry compote.  Fabulous!  <br><br>My friend had similar except he had the salmon & potato au gratin casserole, green salad special and he was a equally pleased as I was.<br><br>Service was attentive and very friendly.<br><br>Loved every minute I was there.<br><br>Highly recommended!", "pics": null}}, {"review": {"des": "Great dining experience. Loved the array of sodas. The patio dining area is straight out of a fairy tale book. Swedish meatballs were ok. A bit disappointed in the sauce flavor.  Kind of blan.", "pics": null}}, {"review": {"des": "LOVE the food at Tre Kronor. I've been here many times and never had anything I didn't enjoy, and I've tried most of the menu by now. The atmosphere is cozy and the staff is friendly and quick. Sometimes there's a wait but that's when you head next door to the Swedish Store to look at beautiful Scandinavian home goods! Don't miss out on this gem.", "pics": null}}, {"review": {"des": "Went here twice. They serve lunch until 4:30, so we had quiches, which are also available for breakfast. The quiches were absolutely divine! The fresh fruit was substituted for potatoes, which were great. The do provide ketchup or hot sauce. The lunch menu is one the same menu set as the breakfast menu, so we came again for brunch! It was a tough decision, and the corned beef hash and Belgian waffles were split. They can provide extra plates without charge. No sharing charges either. The waffle was topped by layers of fruit. The whipped cream on top was a heavier cream, and looked like a giant scoop of ice cream! We substituted the blueberries for lingon on the side, which we used on our toast. <br><br>I definitely recommend this place, but caution that their service isn't very good; rather slow and forgetful on filling up water. They are also hard to flag. However they are super nice!<br><br>The bathroom on the first floor is a bright and cute yellow. There is an additional one upstairs.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/muDRuXlEhNqEgYg5QGaMjA/348s.jpg", "caption": "Belgian waffles! Subbed blueberries for lingonberries."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YPDlwBAwuXMHQi7bIElvVg/168s.jpg", "caption": "Excellent corned beef hash with eggs scrambled. Had Swedish rye bread"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iH0Xxk836Cekosl5l6OfLA/168s.jpg", "caption": "Salmon quiche with potatoes substituted."}]}}, {"review": {"des": "This place is very quaint. It's cute and cozy inside. The staff is very friendly and accommodating.  They have a lot of unique sofas you can't find anywhere else.  I had the cured salmon, and it was fantastic.  The sweetish meatballs were good, too.  I really liked the cucumber salad it came with.  The potatoes it came with were very rich, very yummy.  I won't forget them at salmon!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vdW3L7QDL5lCsrOYfzlIJw/348s.jpg", "caption": "Weird soda"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fHHizOsNLLOFKOqihZT9Aw/168s.jpg", "caption": "Swedish meatballs"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pLqOqmDszwyKRnyaLGjkLw/168s.jpg", "caption": "Cured salmon. Delicious."}]}}, {"review": {"des": "I was told about this place from two different people in the same week and I cannot believe I live 6 blocks away.  I had to try it.  I loved it!  They send you over to The Swedish Shop while you wait & that was awesome too!  I'm going to go back for sure.  The service was great and the food was truly delicious and clearly made fresh daily.  Definitely a new spot for me!", "pics": null}}]}