{"name": "true-food-kitchen-chicago", "reviews": [{"review": {"des": "Came here on a Friday afternoon for lunch and we got a table for two without a wait. To start off we got the hummus which has a lemony kick to it and tasted extremely fresh! We both really enjoyed it. I went with the Teriyaki Quinoa bowl with chicken and my friend got the turkey burger. We both really liked our meals! <br><br>They have a pretty extensive drink menu as well but we didn't try any of the specialty drinks, tried one of the rosés which was good! <br><br>Healthy restaurant with tasty food, lots of space and cool vibes.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/H7LlMrv0taKSYfkBmGy6mw/348s.jpg", "caption": "Teriyaki Quinoa Bowl with chicken"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PtBHdHGbh1Rjm1xP43EXuw/168s.jpg", "caption": "Turkey Burger"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1Pt8BgCKua75FdSp-bXyYQ/168s.jpg", "caption": "Hummus"}]}}, {"review": {"des": "Service very uneven. Main came when I was about 1/3 done with starter. Server seemed very stiff, trying too hard, maybe he was just new. Other staff were good. <br><br>Ramen is a great concept and everything was really yummy except the broth, but that kinda ruined the whole dish. Too much roasted bean taste overcomes everything else. I had steak with it, and it wasn't good -- overcooked and tough. I eat a lot of grass-fed meat, that's no excuse.", "pics": null}}, {"review": {"des": "A great place for a meal you can feel good about. <br><br>I've been to True Food quite a few times and always enjoy my meal. The atmosphere is wonderful and the service great. This time, I had the teriyaki quinoa with chicken, the brussels, and the hangover rx drink. All of them were delicious and even better to know how healthy the food is. <br><br>The only reason I put 4 stars is because of the price. It is a little steep for the amount of food, but definitely worth it.", "pics": null}}, {"review": {"des": "After my previous Yelp review the manager reached out to me and addressed some of my comments. Any establishment that takes the time to personally address each review good or bad are places where I am always willing to give a second chance too. <br><br>We came in here around 11am on a Saturday morning. It was about half full but we were seated immediately. The server quickly came over with water and asked if we'd like coffee or if we needed a few more minutes. <br><br>I started with the matcha horchata. It's matcha tea steamed with rice milk. It was so good. It was sweeter than what I usually like to drink but I didn't mind it so much. The portion is also huge. It looks small because of the way the cup is but i could barely finish it. <br><br>My husband got the kaleaid. It's a pretty large drink. He was pretty full after drinking half of it. He really enjoyed it especially because the kale was so well blended/strained out that there were not randomly floating kale pieces in the juice. <br><br>For brunch I got the avocado toast. It's a large piece of toast cut into triangles. I cute the triangles in half because it was hard to hold otherwise. The Gouda cheese held the avocado to the toast. The avocado was smashed enough where it was more smooth than chunky. The sunny side egg was perfectly cooked. The egg white was fully cooked and the yolk was slightly runny. The entire entree looked and tasted great. I definitely recommend this!<br><br>My husband got the banana pancakes. It was different than when you make them at home because they add quinoa for texture. He liked them so much he ate all of them. The texture was different but really good. The banana was mushed up enough where you didn't get chunks of it but the pancake also had a texture similar to a pancake.<br><br>We also shared the chicken sausage. It's two medium size patties for $4. This tasted homemade and freshly made to order. <br><br>Overall we had an awesome breakfast. The service was quick and efficient. The food was even better! I most definitely be back to try some more items.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ICxZq25FuvZsVYCYkxgePA/348s.jpg", "caption": "Menu 11.03.2018"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3UO3Ttw6yKSy7RLv-DZPmg/168s.jpg", "caption": "Drink Menu 11.03.2018"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XwdEGL96-hsM7egexODM0A/168s.jpg", "caption": "Avocado Toast"}]}}, {"review": {"des": "A go-to healthy spot in River North, places strategically next to a Barry's Bootcamp so you can refuel yourself properly after a workout. Came here with a big group pretty late at night (around 9PM). We started off the night with some healthy cocktails; they're lower in sugar content and around 200 calories. I tried the watermelon mojito ($12) which was super refreshing, and wouldn't mind if it was mintier. My friends loved the skinny citrus margarita ($12).<br><br>For my entree, I got the Moroccan chicken ($21). It consisted of 3 medium size chicken breast with crispy skin, under a delicious chickpea and fig sauce. This dish blew me away! I didn't know what to expect from a healthy restaurant, but it was both filling and extremely delicious. My only complaint is that this restaurant is a bit expensive, but that's usually the trend with healthy restaurants/cafes.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/n8wELThn2rNiamh-7AzQvQ/168s.jpg", "caption": "Moroccan Chicken"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oz3z1NHdQNOFoXCtVSf5ZQ/168s.jpg", "caption": "Watermelon mojito (left) and skinny citrus margarita (right)"}]}}, {"review": {"des": "Fresh healthy food with options for everyone! Loved this trendy atmosphere and seasonal menu, not to mention a decent wine list. I was overwhelmed with the options but the friendly staff was very helpful and quick to give suggestions. The edamame dumplings are a must.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/isxqAPEo9cy6I4K9jrzf9Q/348s.jpg", "caption": "Teriyaki Grains bowl"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/J1p85sN7rsrU90Xwx7Ws0Q/168s.jpg", "caption": "Menu winter 2018"}]}}, {"review": {"des": "What a beautiful restaurant. Sat at the bar on a Sunday. It was busy but to overcrowded. The bartender was so friendly and genuinely happy. I got the Vodka cocktail with beets which was super tasty. We only ordered a few appetizers which all tasted very light and good. True Food Kitchen lets their food talk for itself. A must try", "pics": null}}, {"review": {"des": "I've been here several times and have tried the ancient grain bowl, pad Thai, Moroccan chicken, and edemame dumplings and cauliflower appetizers. My two favorite things have been the appetizers. The dumplings are fantastic. The Moroccan chicken and Pad Thai are just ok and the ancient grain bowl is pretty good. <br><br>The restaurant has a nice but casual vibe and had fresh, pretty good food. The reason I'm giving it a 4 instead of a 5 is because I think it's a bit overpriced.  Getting a grain bowl with 1 protein shouldn't cost nearly $20.", "pics": null}}, {"review": {"des": "Great healthy eats that are fresh and flavorful! <br><br>I came here for a healthy meal after a workout and was very satisfied by the service and food! My server was very attentive and was helpful with recommendations. <br><br>For drinks, we tried the Kale Aid and the Bright Eyes. You could literally taste the healthiness coming out of these two! The Kale Aid was full of kale(obvi), ginger, apple, celery, cucumber, and lemon. It was very very good. The Bright Eyes was full of carrots, tumeric, apple, ginger, beet, and pineapple. It also very flavorful and tumeric is supposed to be very good for you. <br><br>For the starters, we tried he Charred Cauliflower. It was a great charred, smoky flavor and it came with this great harissa tahini sauce. <br><br>Entrée wise, I decided to opt for a bowl. I got the Teriyaki Quinoa bowl, which came with many vegetables, brown rice, and toasted sesame. I added the tofu for protein. It was a pretty good bowl, but slightly bland, so I asked for some hot sauce to do the trick. Fun fact, they also do half sizes for people who want smaller portions. <br><br>Overall, a good experience! I want to come for their brunch to try their fun mimosas!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1TP2P02m_OsaFDkbqN5V_Q/348s.jpg", "caption": "Charred Cauliflower"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xMEtyocnfVf6YqQCbiD2WA/168s.jpg", "caption": "Teriyaki Quinoa Bowl"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rY_hGkPmC149G_eZBlz_Yw/168s.jpg", "caption": "Alllll the juices"}]}}, {"review": {"des": "So I finally had the opportunity to return to this place and boy am I glad I did! I had previously ordered the Tuscan Kale Salad with shrimp and this time I wanted to try something completely different. <br><br>For my entree I ended up ordering the Spicy Panang Curry with tofu! Oh man this was an amazing dish! The portion was large and flavorful. I kinda expected some spiciness to it, but didn't end up caring because the taste of the coconut shrimp broth was just too exceptional. <br><br>My boyfriend ordered the Teriyaki Quinoa and added shrimp and tofu! I had a taste of his entree and was so impressed at how delicious and tasty it was. Also, I loved how you could see all the healthy veggies that were added onto it, therefore not feeling too bad after a workout! He also ended up ordering a drink called \"Medicine Man\", pretty good!<br><br>These two entrees were so tasty and flavorful that I can't wait to return for some more! Just comes to show you that you can't judge a restaurant based solely on one bad meal!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bccrDyk_RO9Cow6KfeQxnw/348s.jpg", "caption": "Medicine Man $6"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vXtsgTBO3wCh_GrUe9K4Sw/168s.jpg", "caption": "Teriyaki Quinoa with tofu and shrimp! So yummy!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Dv9sKA3vRR_do1H_7g733w/168s.jpg", "caption": "Spicy Panang Curry with tofu! DELICIOUS!"}]}}, {"review": {"des": "I had a ladies day out and we ended up at TFK because I'm on a special diet in which I can only have certain things. We started off with the charred cauliflower which was amazing! Usually cauliflower is very and and boring. The taste was nothing like no other, my friend and I ended up fighting for the last few bites. <br><br>For dinner I opted for the grilled salmon and replaced the quinoa with a sweet potato hash. The server was very accommodating and friendly. I also had the hangover without honey and it was very refreshing. <br><br>At the end the chef gave us a complimentary dessert for a little inconvenience we had and we chose the chia pudding, it was delicious.", "pics": null}}, {"review": {"des": "Ordered from True Food Kitchen via a food delivery site -- 3 hours later got our order...COLD OF COURSE -- could not blame the delivery service, monitored the progress of the order and clearly the delay was due to the restaurant not prioritizing our online order. I feel this is not fair given I am paying the same prices and tipping in the same manner as \"sit down\" customers, just not costing the restaurant as much to serve, but still got a 3 hour late meal....sad customer service", "pics": null}}, {"review": {"des": "(English)<br>I love these types of restaurants that offer a variety for everyone, vegan, vegetarian, gluten-free and carnivores. <br><br>This restaurant has an incredible menu and atmosphere. The staff was very nice and attentive and food of course, delicious. <br><br>With all this atmosphere, I was feeling like no meat kind of day, so I ordered the edamame dumplings served in dashi, white truffle oil and Asian herbs. I also ordered the charred cauliflower that the server highly recommended me, it had Harissa tahini, medjool date, dill, mint and, pistachio. This dish is really an adventure in your mouth, you can feel how every single ingredient is harmoniously complemented with each other in this amazing casserole. <br><br>All very impressive, I will definitely come back!<br><br>(Español)<br>Me encantan estos tipos de restaurantes que ofrecen una gran variedad para todos, veganos, vegetarianos, sin gluten y carnívoros. <br><br>Este restaurante tiene un increíble ambiente y menu. El personal fue muy agradable y atento, y la comida, por supuesto, deliciosa. <br><br>Con todo este ambiente, decidí ser vegetariana por un día, así que pedi los dumplings de edamame (Edamame Dumplings) servidas en un dashi, aceite de trufa y hierbas asiáticas. También ordene el coliflor carbonizado que el mesero me recomendó mucho, tenía Harissa tahini, medjool, dátiles, eneldo, menta y pistacho. Este plato es realmente una aventura en tu boca, puedes sentir como cada ingrediente se complementan armoniosamente se  en esta asombrosa cazuela.<br><br>Todo muy impresionante, definitivamente regresare!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pPpAjGre47EnbH7z84Kdig/348s.jpg", "caption": "Charred Cauliflower (bottom) Edamame Dumplings (top)"}]}}, {"review": {"des": "I was so happy to finally try this amazing chain of restaurants at the only location in the Midwest. Thankfully it's within walking distance from where I live because I'll definitely be coming back!<br><br>I loved the menu and the environment. There's something for everyone here. Vegans, vegetarians, gluten free, and even carnivores like me. <br>One of the signature starters that everyone seems to recommend is the Edamame Dumplings and they did not disappoint. Served in a dashi based broth, the white truffle oil is really complimented well with the rest of the Asian herbs. It's as if pho and miso soup had a baby and gave you edamame stuffed dumplings instead of noodles.<br><br>I could eat these dumplings morning, noon, and night they were so good! But don't be confused, this is not an Asian restaurant. They have pizzas, burgers, poke, quinoa bowls, salads, etc.<br><br>Also, if you're into cocktails, definitely get the Strawberry Smash. It's basically bourbon and strawberry lemonade put together. Even my wife who doesn't like bourbon loved it! <br><br>It's no wonder this place appears on the Michelin guide. True Food = True Love!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fKA5zLUNTopDAVtXYBuhJg/168s.jpg", "caption": "Strawberry Smash (front)  Farmers Market Sangria (back)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ytYOsTVi78br2wtMh5S86w/168s.jpg", "caption": "Edamame Dumplings // dashi, white truffle oil, asian herbs"}]}}, {"review": {"des": "Great tasting- overpriced- healthy food at True food kitchen! The restaurant has a great vibe and very nice ambiance. Their menu has some innovative options to choose from and has a lot of gluten free, vegetarian and vegan items! In spite of the fact that everything we ordered was great tasting  and up to the mark, I definitely felt like its slightly overpriced.  But if you're not too fussy about spending slightly more and just want to catch up with friends over delicious healthy meals-this is the place to hit!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CutsBCmmsx7Txe8n1bbFdw/348s.jpg", "caption": "Will go back to try other desserts :)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Bs_uLZ0Ay_y2ZgDQNpQCSg/168s.jpg", "caption": "Yumm- Banana, coconut chia pudding! You wont feel guilty after having this for dessert! :)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/u6AEOY8108tne2ScOL6Elw/168s.jpg", "caption": "Artichoke pesto pizza with vegan ricotta...... a pizza that's not too high in calories :)"}]}}, {"review": {"des": "A 5 Star favorite. <br><br>Started with Kale Aid; kale,apple,cucumber,ginger,lemon - Wow what a sweet combination and healthy drink. <br><br>Entree was an Ancient Grains Bowl: Broccoli, heirloom carrot, bok choy, mushroom, brown rice, avocado and toasted sesame with organismic tofu Vegan.  This was just extraordinary.  Perfectly prepared with homemade teriyaki sauce. <br><br>The staff is super friendly, the service quick and the food phenomenal.", "pics": null}}, {"review": {"des": "Delicious food .<br>Many vegetarian and vegan options . Located in river north with some street parking available .<br><br>Staff is friendly and attentive .. vibe is casual<br>Laid back with a bit of trendy mixed in ! <br><br>Sit outside during the summer and people watch !", "pics": null}}, {"review": {"des": "Had a great meal here! The Brussels sprouts were some of the best I've had and the vegan butternut squash pizza was awesome. Our server was super nice and attentive (wish I remembered her name!). <br>Just wish they had more vegan dishes to choose from!", "pics": null}}, {"review": {"des": "I had been wanting to try this restaurant for a long time and it was most definitely worth the wait! Overall, I would say the food was a 4 but the service and atmosphere definitely pushed it to a 5. <br><br>The atmosphere is great. It's beautifully decorated and fancy without being too much so. It's really a great place for friends, dates, or even family. <br><br>The service was super friendly and I also LOVE that the menu was about 80% vegetarian (with at least half of those options being vegan). <br><br>We got the kale guacamole, miso eggplant, tempeh sandwich, and ancient grains bowl for dinner. The guacamole wasn't quite as good as normal guac in my opinion but was still really good and came with great pita chips. The miso glaze wasn't the best I've had but it was still well cooked! The ancient grains were simple but filling and delicious. But the tempeh was DEFINITELY the highlight. It is the best cooked tempeh or tofu I've ever had!! It had an incredible apple smoked flavor and I can't wait to get it again.<br><br>Dessert was definitely the second highlight!! The vegan vanilla ice cream was some of the best ice cream I've had. The rhubarb crisp was delicious and the flourless chocolate cake was good too. <br><br>Will definitely be back for some healthy and delicious food!!", "pics": null}}, {"review": {"des": "Even if I might be *slightly* biased about my thoughts of this place given that I tend to love places that offer vegan/vegetarian options just for the mere fact that they exist, this place is a great spot of omnivores or anyone on alternative diet. (I took an omni friend here. She had the lasagna that comes with chicken sausage...and she loved it!)<br><br>The location is spacious and has such a great layout that, even when it's busy, the restaurant doesn't really feel \"crowded.\"<br><br>I came in for lunch and ordered the hummus as a starter and the ancient grain bowl as my main course. I've been to the True Foods in Naples, FL, so I had high expectations about this location, and it didn't disappoint. The hummus was delicious, tangy and well complemented with the olives, onions and feta. The ancient grains bowl had so many flavors that you can honestly opt to not add protein to it and not feel like your meal is incomplete.<br><br>My only \"complaint\" is that I expected the quinoa and other parts of the ancient grains bowl to be at least warm (or even slightly hot), but the one I got was room temperature. I'm not sure if the bowl is intended to be like that. I didn't mind because I do not mind having cold lunches, but I can see how other people might have a problem with that. Our server constantly checked in with me and my friend, though, so I'm sure if you do run into this issue, your server can fix that for you. <br><br>Keep doing you, True Foods! And yes, I'm proudly walking around the city with your \"Love Your Mother\" tote :)", "pics": null}}, {"review": {"des": "OMG, I want to eat here every night! My daughter ate at one in Austin and raved about it. When we were here, she insisted we eat here. It's a very large space and is decorated quite nicely. We sat at the bar as our friend was already there. She & her husband are foodie people, so I was a bit concerned they had not heard of this place let alone eat there! The bar runs a major part of the length and the bartender was quite busy though he waited on us rather quickly. We ordered 4 different plates and shared them all.  <br><br>We ordered the Farmers Market Crudités and loved both dips and the veggies were very fresh! Yum!<br><br>The Organic Tuscan Kale has superb flavors and went well worth our other dishes. <br><br>We asked for chicken sausage on our spaghetti squash dish and it was divine!  <br><br>We were quite satisfied and would highly recommend you to eat here if you're in the area! We'll be back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KKgx-IK-c0ewQvm5Vt2s_Q/348s.jpg", "caption": "Crudités"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/y-b1Eq7nHDxIE8Z9an3czQ/168s.jpg", "caption": "Yummy Spaghetti Squash with Chicken Sausage"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8H1osLslNm0vNx_tdTh20Q/168s.jpg", "caption": "Organic Tuscan Kale"}]}}, {"review": {"des": "The space is very inviting, kinda reminds me of Summer House Santa Monica in that it's open and bright. <br><br>I thought the food was very good though on the pricier side (which I understand given its location).<br><br>A friend and I met for lunch at tfk the other day. I started with a butternut squash soup that hit the spot as it was a cold day. I also had the ancient grains bowl, sweet potatoes, portabella mushrooms, avocado, and a few other items. It was very tasty and appropriately sized for lunch. I felt good about myself after the meal because it was healthy and not too heavy.<br><br>My friend had the spaghetti squash casserole and I'm told it was very good. Service was also good, available but not overbearing. <br><br>I'd definitely come back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qQiXaaMS4J7HCFAPUWn9cA/348s.jpg", "caption": "Butternut squash soup"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4xFopDfeb4hJCUdh0Mcelw/168s.jpg", "caption": "Spaghetti squash casserole"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/f8pdxV6tXVcYs-f3pPNvqA/168s.jpg", "caption": "Ancient grains bowl"}]}}, {"review": {"des": "Food: 4<br>Service: 5+<br>Cleanliness: 4<br><br>We arrived just before rush hour on a Friday evening and made a reservation in case. There were few tables when we arrived at 6:15pm, not long after the place was filled! Be sure to get early, otherwise turn around time is pretty quick I'd say since there are tons of seats. <br><br>Charred Cauliflower $10: In my opinion just okay. We wished the cauliflower itself was crispier and that they'd go easier on their sauce they mix it in. I didn't like the sauce too much, a little too sour/salty for me but my boyfriend enjoyed it.<br><br>Butternut Squash Soup $7: Light and delicate. Loved the sort of chimchurri sauce they splash on top. <br><br>Panang Chicken Curry $15 (+$ whatever protein you choose): A red Thai curry that should be thick and nutty with a hint of sweet and spicy, this just almost hit the mark. The chicken could've been more tender. You get that hit of spice after a mouthful, and with a healthy dose of rice on the side, you'll need it. Compared to curries you can get at a Thai restaurant this was just ok.<br><br>Grass Fed Steak Tacos $18: (2 piece) YUM. Our favorite of 'em all. The steak was tender topped with explosions of flavor from the cilantro, pickled onion, and cheese. You also get a side of pinto beans.<br><br>Overall, True Food Kitchen hit the spot with their extensive menu that offers gluten-free, vegetarian dishes to help you eat better. The service is also wonderful which makes the experience 10x better. They divided the entrees for us since we were sharing and we didn't even ask! We felt great leaving the restaurant. Anddd they've got an open kitchen.<br><br>Would I come back? Yes. They rotate their menu seasonally so I'd be down to see what else they have to offer.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UxXy4EKNVnSTbwwHGgjYOg/348s.jpg", "caption": "Panang Curry: $19 - Meh; Steak Tacos: $18 - YUM"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nT7U51JCDLz6Kwl26CKFUg/168s.jpg", "caption": "Cauliflower: $10 - Meh, wasn't feeling the sauce, wish it was a bit more crispy"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ti_1GO0-6YdHSt2w07XLIA/168s.jpg", "caption": "Butternut Squash Soup of the day: $7"}]}}, {"review": {"des": "Can't wait to go back to True Food Kitchen! <br><br>I was in Chicago over the weekend looking for fresh food and it was recommended that I try True Food Kitchen. <br><br>I sat at the bar. Initially it took quite some time for a server to greet us (which is the only reason I'm giving the review 4 stars). <br><br>The restaurant is build on the premise of an anti inflammatory diet. The menu is seasonal with plenty of fresh food. I had a ginger margarita to drink which was delicious. For the main course, i had the lasagna. Although it's lasagna it was still very light. <br><br>Overall I can't wait to go back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qMualLlHV7B1BrMGhbVdVg/348s.jpg", "caption": "Lasagna."}]}}, {"review": {"des": "True Food Kitchen is SO good. I've been to True Food Kitchen a couple years ago in LA, and I forgot how tasty it is.<br><br>I got the Ancient Grains bowl and added chicken. The Ancient Grains bowl includes: miso glazed sweet potato, turmeric, charred onion, snow pea, grilled portobello, avocado, hemp seed. All of it tasted so good, albeit some of the items were overly salty (so minus half a star, I would still give them 4.5 rounded up).<br><br>I'll definitely be back because while I could learn to make all these items, I think I'd fall short of this place's perfect mix of flavors. This place is pretty pricey for the portion size and everything else, but sustainability and healthiness!!!!! I loved finishing my meal and feeling like I had just had a delicious bowl of healthy foods.", "pics": null}}, {"review": {"des": "This restaurant is amazing! I've been several times, and the food is always delicious. This time, we got the spaghetti squash casserole, burger, and fish. We all loved it! I've also gotten the pizza and grain bowls in the past, and those were amazing as well. The food tastes really fresh and there are a ton of healthy options", "pics": null}}, {"review": {"des": "Everything on the menu is amazing! For drinks I am a sucker for a good margarita so I always get the lemon grass margarita. <br><br>I probably never would have tried it but my friend suggested the chia seed pudding. It is so good! <br><br>I'd highly recommend this place for a healthy breakfasts, lunch or dinner!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Qh6c9q6R2mh_7z2wcC97tg/348s.jpg", "caption": "Summer 2018 menu"}]}}, {"review": {"des": "I wish there were more locations in the area. Cute decor, casual and fun. Great for lunch or brunch, or casual dinner. Food was fresh and delicious. Loved the Chicken salad with apples, cheese, jicama, dates and cranberries. Avocado toast was great, but smallish portion. Poke was good. Teriyaki quinoa was excellent, filled with flavor and good veggies. We shared everything. Yum and healthy.", "pics": null}}, {"review": {"des": "It's hard to find restaurants (especially in Chicago) that are health and figure-friendly, but True Foods Kitchen hits the mark.  They offer an array of dishes that are tasty, creative and don't leave you guilt ridden after indulging.  I highly recommend the kale guac and the lasagna bolognese.  They even have a variety of \"skinny\" cocktails.  I took off one star because the seasonal salads are hit or miss.  I got one for takeout once that was phenomenal, but the one on their summer 2018 menu was pretty disappointing.  Please don't let that deter you from checking them out, however.<br><br>To top it off, service is excellent and I love the modern, rustic interior decor.", "pics": null}}, {"review": {"des": "True Food never disappoints. Whether it's brunch or dinner, they have such a great rotating menu of food based on the season. Their pizzas are by far my favorite. They are the perfect portion of food and at a reasonable price. <br><br>The staff is always friendly, polite, and attentive to your needs. If you're looking for a healthier spot with a variety of options, this is definitely the place for you.", "pics": null}}, {"review": {"des": "I was in town for a conference and everyone had left for the airport but I had a bit of time until I needed to head that way. I was tired of all the junk we were served and was looking for something \"clean\" that I could eat when I found True Food Kitchen. I checked out the menu and yelp reviews and decided to head that way. <br><br>I started with a green juice- Kale Aid. It was delicious and juiced right in front of me. While sipping on that I noticed their impressive cocktail menu using organic, natural spirits and wished I had more time to give those a try!<br><br>Next I tried the tomato soup with a vegan pesto. It was delicious and the serving size was very large, which I really appreciated. <br><br>Next I ordered the wild caught albacore tataki. The presentation was beautiful but I felt the dish was missing something but couldn't quite put my finger on it. The flavor, while good, fell flat. <br><br>Overall, I left full and didn't feel gross :) the space is just lovely, with tons of tables and plenty of bar seats.", "pics": null}}, {"review": {"des": "So delicious -- I can't believe my dish has so few calories! My girlfriend and I arrived on saturday at 530pm and were greeted with a kind smile and seated immediately. We split two dishes: we ordered the gluten free lasagna and the spaghetti squash casserole. Each dish had about 400 calories and were incredibly savory and satisfying. I don't believe that it's only 400 calories! I've had salads at Sweet Green with more calories! <br><br>They serve Health-Ade Kombucha on ice in a glass with rich and thick fruit juices -- heavenly!<br><br>I don't live in Chicago and every time i visit i make it a point to come. I've been here twice this year and after each time, I swear I wanna come back the next day and try a new dish.", "pics": null}}, {"review": {"des": "This was a great place to check out! A health conscious menu with tasty beverages and dishes. The honey lemonade was refreshing and had a nice earthy taste. Matcha was added to provide an energy boost. It was nice changing it up from the usual cup of coffee. The huevos rancheros were very filling and tasty, but it was not spicy. <br><br>I would come back to try more of their menu items. Recommended to check out if you want to eat out as well as have feel good food.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cyZdVdlVzjFLgX9dVOOckA/168s.jpg", "caption": "Huevos Ranchero"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sD_Up0IsyoZoeH8D_FJXfg/168s.jpg", "caption": "Honey lemonade with Matcha"}]}}, {"review": {"des": "Looooooove this place. Very open concept layout with bright open spaces and greenery. The service is stellar and the waitstaff are always friendly. The food is just perfect. Everything is made using fresh ingredients. In fact you can watch the kitchen staff preparing your food and chopping fruits/veggies. The combinations of flavors they use in their dishes are fantastic, and every dish has a healthy spin. My favorite dishes were the Buddha bowl (forget the actual name) and the breakfast burrito, both of which are both vegan. I would also recommend trying their Bloody Mary - it's kind of a different take on a Bloody. Still spicy but there's more refreshing flavor to it. I really love that this place is so accommodating to individuals with dietary restrictions. Keep doing you True Foods Kitchen and I will DEFINITELY be back!!", "pics": null}}, {"review": {"des": "So I've now been here for dinner 3 times and find the experience to be pretty consistent - mix of average to surprisingly (because of the healthy factor) delish food with challenging service...<br><br>Starting with the food:<br><br>Yum - truffle edamame dumpling ( light, flavorful, worth reordering), cauliflower (and I normally think cauliflower is a waste of plate space), panang curry (rich, fragrant, so good it doesn't even taste healthy), lasagna (well seasoned and hits the spot on a cold night)<br><br>Not so yum - seabass (needed flavor or salt or something), burger (again needed seasoning)<br><br>Overall I would give the food a 3.5 and normally would round up, but on all 3 occasions have had frustrating service from snarkiness to getting an order wrong to avoiding our table when an incorrect order was being fixed (and taking way too long) to bring out entrees with several minutes in between.  <br>Overall definitely a round down situation.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Yo9gtSilcsimZC23jQB_8A/348s.jpg", "caption": "Seabass"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XgU3C4ExATqXjcF0yXG2Lw/168s.jpg", "caption": "Edamame dumplings"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kcE8r-5HkV57rqbrb1ipIA/168s.jpg", "caption": "Cauliflower"}]}}, {"review": {"des": "LOVE this place, great m, good quality natural food. The desserts are to DIE for (Chia seed pudding and the butternut squash pie - gluten free, dairy free!).<br>Fantastic service and very attentive crew at the bar. Must try the one in Atlanta.", "pics": null}}, {"review": {"des": "Probably should have gone to Sweetgreen across the street; I just didn't want to opt for plastic utensils and dinnerware (lunchware?), when the reusable option was available.<br><br>My waiter promptly brought our check even without our asking for it. (He became all of a sudden very effusive and animated when cash materialized on the check presenter.) Never mind the food, which was nothing to write home about.<br><br>I am very troubled by the \"get 'em in, get 'em out\" ethos at this restaurant.", "pics": null}}, {"review": {"des": "I am so excited to find this great vegetarian friendly place in my neighborhood! We went for a light lunch and had soup of the day- cream of cauliflower which was nice and not too heavy. Edamame dumplings are a beautifully crafted and are must have! Huevos Rancheros was more like fusion food and did not taste authentic, but it was good. For drinks I had Hangover Rx and I was happy with my choice. Hubby liked his beer on draft.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sQ5f-C1W-nNveqid0nlKqg/348s.jpg", "caption": "From top to bottom - Huevos Rancheros (average), Edamame dumplings (yum!) and cauliflower soup (good)"}]}}, {"review": {"des": "Gross. I can only speak for the delivery but oh my gosh, this was garbage. The Brussels sprouts were all oil, my bowl was soaked in grease. I cannot believe they let this out of their kitchen. Absolutely horrid.", "pics": null}}, {"review": {"des": "Great food in comfortable urban feel. Wholesome, fresh ingredients ..salads , turkey burger and brunch are all good. We live close so it is our go to restaurant .", "pics": null}}, {"review": {"des": "As everyone knows, True Food Kitchen is my go to spot in Atlanta GA. I saw it while in Chicago and for Gluten Free and Dairy Free people this place is holy!<br><br>The service was spectacular, the Decaf almond milk latte was amazing. <br><br>The put Cheese on my salad by accident, and swapped it in like 3 min. <br><br>All very impressive, and the area is really nice where it sits in downtown Chicago. They've got great drinks, just like in Atlanta. Great place!", "pics": null}}, {"review": {"des": "This is MY kind of foodplace: airy, wide-open, organic, orgasmically delicious, and such a menu variety as to befuddle even the most well decided.<br><br>It's perfect! It's also a great meeting place for friends or business right in the middle of Streeterville and not far from Michigan Avenue. I just Divvy up from the State/Lake stop of the Greenline.<br><br>Oh, and the desserts are divine!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gtCNKyfvAJnruEWnqx23EQ/168s.jpg", "caption": "Ancient Grains bowl"}]}}, {"review": {"des": "As much as I love eating rich, delicious food wherever I go, I appreciate a good ol' farm-to-table-esque meal. My boyfriend and I were looking for something lighter, but still substantial and delicious. We found this place on Yelp and decided to check it out. <br><br>We split an appetizer, a vegetable dish, and a salad plus one cocktail and one kombucha. <br><br>The cocktail was SO GOOD. It was the wild orchid. It was light, sweet, but refreshing- almost like an iced tea. The lavender is amazingly incorporated. I rarely rave about cocktails but this one is a must. <br><br>From left to right, we ordered: the miso eggplant, the edamame dumplings, and the seasonal ingredient salad. My favorite was the edamame dumplings- instead of meat filling, it was an edamame filling with truffle oil and ponzu sauce. Definitely the most unique and interesting flavor combination I've had in a while. If you're adventurous, I recommend trying it! The salad was fresh and delicious- definitely healthful and tasty. My boyfriend's favorite was the eggplant. It was well executed- eggplant can be hard to get right because of the slimy texture (which i love but most people dislike). The marinade and lentils almost gave it a meat-like texture, which made this dish much heartier and delicious. <br><br>There were many vegan options, and if they weren't vegan, you could \"veganize\" them. If you do like meat, you can add meat to your dish. I LOVE places that fully embrace most diets and lifestyles like this restaurant. If you want a break from pizza, steak, fries, and burgers but don't want to eat at a casual joint like freshii or sweetgreen, this place is your friend.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-9tWZrVL8whzNcR1HOOayQ/348s.jpg", "caption": "From left to right: miso eggplant, edamame dumplings, seasonal ingredient salad."}]}}, {"review": {"des": "Meticulously prepared fresh food in a well lit bustling restaurant with plenty of space and attentive hostess and servers. <br><br>This is an upscale casual and airy restaurant . I will return when my budget allows. The best healthy food I have had in a come-as-you-are trendy new restaurant. Nice servers with quick service and the whole place is immaculately clean.", "pics": null}}, {"review": {"des": "Clean eating at its best! Food and Service were amazing. Loved the RX Hangover juice. And the breakfast sandwich recommended by the waitress was so delicious and filling. I'd suggest ordering some of the sauce(s) they use on their power bowls to go with the sweet potato side. It's a large restaurant but do recommend reservations for brunch.", "pics": null}}, {"review": {"des": "Kinda like a souped up sit down Honey Grow.<br><br>Lots of options from pizzas to grain and poke bowls to salads and traditional entrees. <br><br>I had a cucumber cooler (honey lemonade and cucumber) which was very  nice. <br><br>My highly recommended  (by Yelpers and the waitress) charred cauliflower disappointed  me - flavors were middy and there wasn't a crisp charred thing about it.  There was a strong overwhelming taste that resembled peanut butter and everything was very mushy. (The next night i had a similar dish at a different restaurant, and it was night and day.)  This was a terribly disappointing dish.<br><br>My \"sustainable sea bass\" entree was just OK but this was a little overcooked and dry; although the vegetables are tender crisp like they should be. It was basically a grain bowl with fish. It was very flat flavorless and needed some citrus brightness badly <br><br>This is how people who don't know how to cook make food - it shouldn't be food coming out of a restaurant kitchen.<br><br>Timing from the runner was off -- I got my entree when i was half way through my appetizer. Someone should have been watching to make sure that didn't happen,<br><br>It was \"energetic\" (read: kinda loud) and the service was really, really terrible. There was a long wait to order, there was the above-mentioned lack of proper expediting, and an unacceptable wait for bill, and another long, long wait to run my card. <br><br>I was not checked in with at all to make sure things were OK, and my dishes were not cleared between courses.  This place either needs to do cafeteria service, or be a full on restaurant. Right now, it's not the latter.<br><br>I left a terrible tip, for terrible service.<br><br>I wouldn't ever go back.<br><br>===<br>Note: the restaurant's AGM did reach out to me immediately after this review, apologizing for my experience, which may have just been a bad night, offering a gift card. I do appreciate the quick response.", "pics": null}}, {"review": {"des": "Quite easily one of my favorite places for fresh and flavorful food! I loved True Food Kitchen in sunny Scottsdale AZ and I was thrilled to see it finally open in downtown Chicago! I've probably been dozens of times, and each time it's a Five-Star experience! The menu has variety, using only seasonally fresh items and the portions are generally generous enough for a take-home snack (unless you have an appetite like mine that doesn't quit! Lol). I particularly love how the waitstaff is well educated about the menu, and can easily modify just about any dish to meet your dietary needs - Ex: Gluten Free, Dairy Free, whole360, add/delete vegetables. <br><br>As much as I try to find something different on the menu, I have a few favorites I seem to go back to time and time again... and today it was the Padang Curry dish with grass fed steak! On the menu, it might not stand out but I can promise you on a cold 20-degree day like today, it will satisfy your taste buds and warm your belly.  Also, don't ever hesitate to try their fresh juices. They are always delicious!! Today I ordered up the Gingeraide which I will admit is pretty potent but I enjoy the healing properties of ginger root and I find it very refreshing.<br><br>Side note: try going on off-hours because it's become an extremely popular casual dining place in River North for good reason.", "pics": null}}, {"review": {"des": "So many healthy options here! There are also a few gluten free options which are clearly listed on the menu. I had the quinoa burger. It was very flavorful and tasted very healthy. I also had the strawberry rhubarb dessert. It had a vanilla dairy free ice cream scoop on top of it! A good dessert to end the night - not too sweet but just enough!", "pics": null}}, {"review": {"des": "Let me break this down for you real quick. I'm 5'-9 3/4\" coming in at a solid 285 pounds. When my buddy asked me to go here for lunch I wasn't excited. I'm Yelping \"Bacon Cheeseburger\" when I go out to eat.<br><br>This place absolutely blew my mind. Mediterranean Chicken Pita with Sweet Potato Hash. (Never thought I would say that).<br><br>May be the best lunch I've ever had. Pomegranate Lemonade was legit and our server Nicole was awesome.<br><br>Definitely coming back.", "pics": null}}, {"review": {"des": "What this place has going for it in location and atmosphere, it more than lacks in food quality and service. I tried to like it, but just don't understand the hype.<br><br>My first visit for weekend brunch was alright: my Ancient Grains Bowl was a collection of disparate healthy ingredients loosely tied together by the miso dressing - none of which tasted particularly fresh - and already $15 without proteins added. Today's lunch was the bigger disappointment, starting with the hostess who was MIA during the slow 3pm hour, then seemed reluctant to seat us outside (though tables were already set and diners were already out there). I asked for no cheese in my Grass-fed Burger, to which the waitress appropriately asked whether an allergy or preference. I don't like to burden the kitchen unnecessarily, so explained it's lactose intolerance not true allergy; she gave me a blank stare, unsure which of the two choices to write down. How could anyone in the food industry not understand lactose-intolerance? I asked for my burger medium, but it came thoroughly well-done and very dry, topped with cold caramelized onions and no mushrooms (though was listed on the menu). We had time restraints so I didn't complain. When my friend pointed it out later, she apologized and said \"you know, sometimes these minor details get missed in the kitchen.\" Um, the patty is probably a major, not minor, detail of the burger.<br><br>My friend's Korean Noodles were overly sauced. As an Asian person, I'd recommend not trying any faux-Asian items here. In fact, I don't plan to try this place again at all, though I live two blocks away.", "pics": null}}, {"review": {"des": "Loved it!  Great food!  Fabulous brunch. Hubby had vegan chorizo burrito. Daughter had Johnny cakes with quinoa. I only ordered a bowl of yumminess. Every bite at the table was followed by \"oh wow!\"  Helpful and friendly service. Will be back!", "pics": null}}, {"review": {"des": "Great restaurant with so many unique dishes and drinks to try. The atmosphere is fresh and upbeat. We tried the Poke Bowl, charred cauliflower and grilled fish tacos. The flavours were amazing, I just wish the portion size<br>Of the fish tacos was a little more. The Kale-Aid drink was light and refreshing. Will definitely visit this restaurant every time we're in Chicago.", "pics": null}}, {"review": {"des": "My beau found True Food for my birthday outing. Yay! <br><br>We ordered the Kale Guacamole as a starter and the guacamole lacked flavor..no character whatsoever. I've had spicy guacamole loaded with habanero, I've had it loaded with cilantro and onions, but never as bland as it was at True Food. However, if you like bland guacamole, go for it! <br><br>For my entree, I ordered Ancient Grains, which was a medley of quinoa, grilled onions & mushrooms, edamame, and sweet potatoes..and some type of sauce/paste...can't remember. I'm glad that they gave a healthy portion of the quinoa, because the glaze on the sweet potatoes didn't agree with my palate. I would've preferred no glaze, then a glaze with a weird soy saucy aftertaste. The quinoa, onions and mushrooms, however were delicious! <br><br>For dessert, I had a strawberry and rhubarb crisp, with a scoop of coconut ice cream on the side. The crisp was a bit tart, but mildly tasty. The granola and ice cream offset the tartness. I could only eat about a third of the crisp..<br><br>In all, I like the ambience, attentiveness of the staff and menu variety of True Food, and will return.", "pics": null}}, {"review": {"des": "I've enjoyed the True Food Kitchen in Naples, Florida very much so I was excited to see a True Food in Chicago. The ambiance in this restaurant is as nice as the one in Naples so I was thrilled when we walked in. We decided to have a drink at the bar until we were seated. The bartender was prompt and polite so good start. We were seated about 20 minutes later; however, that was where the pleasantry ended. We both had the Teriyaki Bowl, which was rather bland and nothing special. I was shocked and sadly disappointed. <br><br>Outside of the bland meal, everything else was great--ambiance and service.", "pics": null}}, {"review": {"des": "This is one of my healthy go-tos in Chicago! Everything here is wonderful from the atmosphere, to the menu, to the service! Since I am very picky about what I eat on non-cheat days, this was a nice find when I was living in the city. I'd get it delivered or dine in frequently, and the food was always prepared fairly quickly.<br><br>Everything in the restaurant is organic and the vibe of the restaurant reflects that in a modern way. They even have their herbs growing in the walkway! There are so many delicious options for meat lovers and vegans alike and so many unique items. This is the first restaurant where I've seen spaghetti squash on the menu, and it is my favorite! I also enjoyed the tamarind cauliflower. So filling, but so guilt-free!<br><br>The staff was always friendly when I dined there both with friends and alone at the bar. My only gripe is the price, but that's expected with the organic ingredients and the atmosphere.", "pics": null}}, {"review": {"des": "Our family loves this restaurant. This was our second time here but first time with Whole30 restrictions, so we wanted to make sure we didn't order anything incompatible. Our waitress was friendly and helpful and honest that she didn't know much about Whole30. But the chefs here all are and our waitress made sure to check with the chef that our meal was compatible. <br><br>We started off with beverages... my husband with the RX hangover (no honey) and I had the sparkling antioxidant tea. Both were refreshing. His tasted a little like a piña colada minus all the unhealthy stuff. We ordered roasted cauliflower with the tahini sauce on the side (although the chef confirmed it was Whole30 compliant so yay!) I am not a fan of the vegetable and ate we devoured these. We came hungry but this dish deserves the props.<br><br>Hubby ordered the Panang curry chicken (minus the pole beans and accompanying grains.) A little too spicy for my palate but perfect for him. He could have had more heat. I ordered the kale salad without the cheese and breadcrumbs and added steak. Oh my word. We both found this salad divine. This restaurant really does deliver true food.", "pics": null}}, {"review": {"des": "We had food delivered to my son's apartment. I had the chicken sausage pizza and it was very good. Would have been much better hot but that wasn't there fault. My son eats here multiple times a week and loves the healthy options.", "pics": null}}, {"review": {"des": "This is one of my favorite vegetarian/vegan friendly spots in the city! The food is delicious and healthy with a wide variety of options. I LOVE the Butternut Squash Pizza during the fall!", "pics": null}}, {"review": {"des": "Came in for brunch with two other friends and we had a great time.  We ordered edamame dumplings, margarita pizza and salmon with quinoa.  Everything we ordered was excellent.  Of course we had two rounds of mimosas as well which were amazing.  <br><br>We learned true food freshly squeezed all juice that morning and you can taste the freshness in your drinks. This place gets busy, funny enough we ran into some other group of common friends as well as another group of colleagues.  <br><br>It's a local favorite!!", "pics": null}}, {"review": {"des": "Good food and dessert that I definitely do not feel guilty eating! I had the ancient harvest grain bowl with salmon (additional charge of $7 I believe) shown in the bottom left corner of the photo, and it was really tasty. The sweet potatoes were cooked in a sweet, spicy and tangy sauce that complimented the salmon. I also ordered the matcha lemonade (free refills) that was wonderfully refreshing. Our waitress was the sweetest! Immunity soup also very very nice.", "pics": null}}, {"review": {"des": "This place served up some delicious \"real\" food. We were looking for veggies and we found them really well done here. We got great service just an hour before close. The charred cauliflower salad is a must. The greek salad was a little bit disappointing the the bowl with the sweet potatoes and charred onions was amazing. <br><br>This is a great spot of you're tired of pizza and poutine.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1fejvPjegd05PlOoY9-BXg/348s.jpg", "caption": "Charred cauliflower salad is wicked good"}]}}, {"review": {"des": "True food: real fresh ingredients prepared so yoU can recognize what you're eating. Absolutely love it! Fair prices for excellent quality.<br>I had the destructed quinoa burger and it was bursting with flavors, every layer was real and delicious. The kale salad was lemony fresh with tons of garlic", "pics": null}}, {"review": {"des": "Best lunch I had on my trip. <br>Exactly what I needed on a weekend filled with delicious deep dish pizza and hot dogs haha. <br><br>I was here for a conference so I needed something fast during our lunch break. I wanted a good quality salad that didn't skimp on taste and nutrition. <br>Soon as I realized True Food Kitchen was nearby, I grabbed my bag and started walking without looking at my other options. <br><br>I sat at the bar and had a delicious almond milk matcha as I ordered my meal. <br><br>I got the seasonal ingredient salad, hold the raisins and manchego, add steelhead. <br>So so so good! Where else can I order a salad that comes with roasted veggies and pistachios?! Flavor explosion. <br><br>TFK is always a great meal wherever I find it =)", "pics": null}}, {"review": {"des": "This place is definitely yummy, but a tad overhyped and overpriced. The ambiance is very nice, with lots of white accents and natural light from the big windows. The service was also pretty good, despite it being super busy when I was here for lunch. <br>In terms of the food, you can definitely tell that the ingredients are fresh and (I think?) locally sourced. That could be why it's so pricey, although I still think that the price is due to the recognizable name and reputation. <br>I had the grilled chicken salad - with tender chicken, dates, cranberries, apple, manchego cheese, farro, and marcona almond. The sweetness of the dates and apples complimented the saltiness of the almonds and cheese really nicely. However, I would still say it was kind of a basic salad and I wasn't super full afterwards (although this could be because I came from a hard workout and didn't eat before). <br>They do have an extensive menu with tons of different options and substitutions, but for almost $20 for a salad, I expected to be blown away, and was not.", "pics": null}}, {"review": {"des": "I've been here twice - the first time, my friend and I ordered the edamame dumplings (SO GOOD would definitely recommend this dish), the charred cauliflowers, the teriyaki quinoa bowl and the grilled artichoke & pesto pizza. All of it was really really good. The second time, we shared the margherita pizza and the Tuscan kale salad. These two were a little more average, so I'd recommend getting the more 'special' dishes they serve! <br><br>The drinks here were also better than expected - I got the hangover rx both times!! Service is not bad, but not great.", "pics": null}}, {"review": {"des": "Delicious food you don't have to feel guilty about eating! (Your wallet might hurt a bit though)<br><br>True Food has a very trendy atmosphere with ample seating and adorable little plants on every table. <br><br>We started with the kale guacamole which was so fresh and creamy. Delicious. I just wish there was more of it. <br><br>I got the turkey burger and was very satisfied. It was juicy and flavorful and filling. The sides, on the other hand, were quite disappointing. It was some chopped up kale with seasoning and baked sweet potatoes. Both were things I could easily make myself. My friend got the ancient grains bowl and that was absolutely yummy. I would definitely get that next time. <br><br>The drinks were also very well done. I tried the watermelon mojito and the ginger margarita and both were refreshing and not too strong. <br><br>I left feeling full and nourished :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/N14kpXUqu5zSOXS33D7JGQ/168s.jpg", "caption": "Watermelon mojito"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ouNU1WxBSRZ0j7hN85dr-w/168s.jpg", "caption": "Turkey burger"}]}}, {"review": {"des": "Once again a perfect dinner. Bella, the waitress, was sub<br><br>New favorite place! We shared charred cauliflower dish and it was delicious. I had butternut squash pizza- yummy and husband had lasagna- excellent. For dessert, I had vegan vanilla ice cream and he had flourless chocolate cake- both amazing. If I wasn't so full I'd start over again and have a whole  meal it was so good!<br><br>Of all the places in Chicago to go out to eat, this is the truest! Here we are again. Yippee yay", "pics": null}}, {"review": {"des": "This place was a great all around experience. Food, atmosphere, service, all amazing. It just has a very clean and open feel right when you walk in. Cool juices and kombucha are on the menu. Best of all you can make reservations!<br><br>I split the chicken salad and the inside out quinoa burger with my fiancée. Both were amazing. The quinoa burger was kind of like a Greek salad with avocado and hummus in between two quinoa buns. The chicken salad was just really good and had some high quality ingredients in it.<br><br>Would highly recommend for brunch and probably any other meal of the day. Also the birthday chocolate cake dessert was so good as well!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XxDhXs9E56C9k9IclyEFvg/348s.jpg", "caption": "Inside out quinoa burger- half portion"}]}}, {"review": {"des": "This restaurant became one of my favorites. The food is fresh and the variety of healthy dishes is amazing. A lot of gluten free dishes, excellent service and great ambiance.", "pics": null}}, {"review": {"des": "Can be a bit expensive but the quality of food is worth trying once. Not many cocktail options. Healthy food options are excellent. Parking is difficult in this area so prefer other ways to come here.", "pics": null}}, {"review": {"des": "Lovely restaurant. Nice vibes. Healthy food. I ordered Moroccan chicken. It was pretty good.", "pics": null}}, {"review": {"des": "One of my new favorite restaurants! We ordered the cauliflower and carrots and both were equally amazing. I couldn't pick a favorite even if I had to! Lots of dill though, and it's kind of overpowering, but the dishes wouldn't be complete without it. I also ordered the red chili noodles...and omg. I was definitely a part of the clean plate club. Tasted like takeout, but knew it was 10x healthier. The space was huge, so I definitely recommend this place for groups (especially ones with food sensitivities).", "pics": null}}, {"review": {"des": "TFK is near my office and a few people recommended that I try it so we ventured in for lunch on a weekday.  The place is beautiful - bright and lush with color and foliage.  <br><br>The menu is interesting and filled with healthy options made with creative ingredients.  We started with the guacamole - ok.  My entree was the Inside Out Quinoa Burger - I probably should have paid more attention to the title because it was inside out - the \"bun\" was the quinoa burger and the toppings were inside, not the easiest thing to eat but it was just o.k. too.  I thought the prices were high for the portion sizes, even for downtown Chicago.<br><br>Maybe I ordered the wrong thing but I didn't experience anything at TFK that would prompt me to return or recommend it to my friends.", "pics": null}}, {"review": {"des": "I came here with my daughter after a massage at the Dana Hotel and Spa. This is the perfect place to go after a massage. They have so many healthy options. I had the ancient grains bowl with salmon. It was delicious. The miso glaze on the sweet potatoes was to die for. All of the components of the dish worked well together. It is definitely a party in your mouth. My daughter had a pizza and it was tasty as well. I can't wait to return to try more dishes.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hZCpCh6sohWRcvGpDlii7g/348s.jpg", "caption": "Ancient Grains Bowl with Salmon"}]}}, {"review": {"des": "Third time was a charm for us at True Food.  After two prior experiences where we enjoyed the food but found the service to be lacking (for example, not being able to find our server when we were trying to get the check, or at various other points throughout the meal), our dinner experience last night was completely on point from beginning to end.<br><br>A spacious place for anyone looking for a healthy option in River North (and there aren't too many) True Food has a large selection of organic, vegetarian, vegan, gluten-free, and they do you the favor of indicating exactly which apply to their menu items.  On my visits I've very much enjoyed the Ancient Grains bowl, the Tuna Poke bowl, the edamame dumplings, and the hummus.  They have a limited but well-curated selection of craft cocktails, beer and wine.  <br><br>I was skeptical about liking True Food, despite knowing that it would be good for me.  But I've discovered that healthy food doesn't have to be bland and tasteless.  This was somewhat of a revelation for me.  I just hope that they will continue to improve on the quality of the service, and if they do, I'm sure this place will be around for a while!", "pics": null}}, {"review": {"des": "Great downtown find. All organic. Came after church. Busy and had to slightly for seating  but service was friendly. Arie greeted us and gave suggestions. Allie was attentive and upbeat. The ambiance is modern with splashes of plants and an assortment of seating styles.  A variety of juices, smoothies, teas and cocktails await you. Happy eats!", "pics": null}}, {"review": {"des": "I walked into this restaurant, and the first thing that I noticed was how spacious and open everything was. It had a very earthy vibe, with lots of wood and greens. We were seated right away, but it took a while for our server to come and greet us/take drink orders. I ended up ordering the turkey burger with the sweet potato hash. Our food took a good like 25 minutes to come out, which was surprising given that it was not busy at all. But the burger was great, albeit messy with the avocado and sauce. I would have skipped over the hash, and gotten the kale salad instead if I came here a next time. Overall, great food, but pricy for what you get.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/86g74SqGG8ZAdQr6rNj2vQ/348s.jpg", "caption": "turkey burger and sweet potato hash"}]}}, {"review": {"des": "The atmosphere is usually bubbly and filled with conversation. High ceilings and lights on walls make it a pretty place for a meal. <br><br>We got the <br><br>1) Kombucha with pomegranate and cranberry -  they have Health-Ade, original flavor, (you can keep the bottle) mixed with pomegranate and cranberry juice. Pretty tasty and the entire bottle is probably 3  servings (with ice). <br><br>2) Edamame Dumplings (dashi, white truffle oil, Asian herbs) - rather tasty and a light starter<br><br>3) Charred cauliflower (harissa tahini, medjool date, dill, mint, pistachio) - wish the cauliflower was a bit crispier but flavors were still good<br><br>4) Kale guacamole (pink grapefruit, cilantro, roasted poblano, sunflower seeds, pita chips) - spicier than I anticipated but very yummy and fresh<br><br>5) Seasonal ingredient salad (asparagus, broccolini, roasted cauliflower, chickpea, pistachio, raisin, manchego, Sicilian vinaigrette) - really underwhelming and basically some veggies sprinkled on romaine lettuce. Would definitely not recommend. Unfortunate that it sounded great on the menu so we were really excited for it. <br><br>6) Sustainable sea bass (broccolini, sugar snap pea, roasted mushroom, ancient grains, umami sauce) - fish was really tender and well cooked. The rest of the dish was good and heavy on the grains. Both 5) and 6) had massive portions. <br><br>The food was decent, but I experienced some of the worst service. My friend didn't get dressing, and the waiter appeared very judgmental and came over a few times, insisting on adding dressing. We also waited a long time for water, silverware, and the bill (had to ask multiple times for all 3).", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6pcwxL923zD7pQBbea3UvQ/348s.jpg", "caption": "Wall decor"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xNpBnNUFsq97tp84ZXsWPQ/168s.jpg", "caption": "Edamame dumplings"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8o-sUQAu-_KAy53do7FAPg/168s.jpg", "caption": "Sustainable sea bass"}]}}, {"review": {"des": "Unlike many restaurants that focus on healthy eating, True Food is not strictly vegetarian, but rather emphasizes tasty combinations of all healthful foods. <br><br>We started with the charred cauliflower, which was good--particularly the really well-charred bits--but wasn't really enhanced by the accompaniments, especially the somewhat soggy pistachios.<br><br>Since we were there for brunch we tried the smashed avocado toast. It was topped by two beautifully cooked sunny side up eggs, and incorporated a razor thin slice of gouda. It was very good, but a rather small serving, so you're going to want a starter or a side.<br><br>The best thing we had was the ancient grains bowl topped with steelhead. (Steelhead is a type of trout, but is almost indistinguishable from salmon.) All of the ingredients in this bowl--quinoa, miso glazed sweet potato, snow peas, grilled portobello mushrooms and avocado-- were delicious, and worked beautifully together.<br><br>This place is large and bustling, so make sure to make reservations and don't plan on a quiet conversation.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/N2Xz3KuBOMFFDuAh5gDZ_w/348s.jpg", "caption": "Exterior"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ATOE2toz9HnplLCqD-AhVA/168s.jpg", "caption": "Kitchen"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zhEBsNgRc9E-_H0jBK7fHg/168s.jpg", "caption": "Avocado toast"}]}}, {"review": {"des": "Very allergy/dietary restriction friendly! And delicious! Service was friendly and a good speed considering how busy it was. Fun drinks and creative seasonal menu!", "pics": null}}, {"review": {"des": "Delicious and healthy, doesn't get any better than that! Lots of bright seating, great vibes and decor inside, friendly service, and amazing food options as well as drinks! <br><br>We ordered the Seasonal Ingredient Salad and the Turkey Wrap Sandwich with Sweet Potato Hash! <br><br>The Seasonal Ingredient Salad was super fresh and very delicious! All of the greens were vibrant and crunchy, the dressing was tangy and not overpowering, and the balance of the overall salad was perfect. <br><br>The Turkey Wrap was equally as delicious! The Turkey serving was generous, the Hummus spread was a nice touch, the tomatoes used were sweet, and every bite was so satisfying. The sweet potato hash was not overly cooked, oily, or overly salty whatsoever! <br><br>We will definitely be back to try the other food items. I highly recommend coming here for a meal if you want delicious and healthy foods!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1A4XII5bYG_Rg6MJAjSHkg/168s.jpg", "caption": "Smoked Turkey Wrap with Sweet Potato Hash-yummy"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6G2PckTHScdc3Zmw5uzN5w/168s.jpg", "caption": "Seasonal Ingredient Salad-Delicious"}]}}, {"review": {"des": "This restaurant wouldn't be my top choice for brunch/lunch. I cant say i had a bad experiences. But, also nothing to say about this restaurant. <br><br>1. Interior/service= ***** <br>    Restaurant looks pretty decent. Very very high ceiling and organic feel looking interior. I liked it because it is very casual looking restaurant and trendy at the same time.<br><br>2. Food= **<br>    I bet they use the organic vegs and good meats. However, nothing were very tasty. Its very similar to just regular dining food. I was just disappointed because the prices were pretty high for what they serve. I ordered ancient grain with salmon. It was fine food but salmon... i couldnt eat after one bite... very fishy... do not eat seafood here. <br><br>3. Price= ***<br>     For two of us, we paid around $65 after tipping. Well.. i would just go to sweet greens cross the street.<br><br>Overall, i wouldnt recommend if you are looking for a delicious restaurant. It has nothing special.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UdKW9do9KHSvG7BDyqlhTg/168s.jpg", "caption": "Could not finish salmon"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QaEL6vTkt7cUYnONFTFeXg/168s.jpg", "caption": "Its okay"}]}}, {"review": {"des": "Awesome. Came here while visiting my in-laws in Chicago and now I am desperate for one of these back home. We sat right away at lunch, and I had the OG (a ginger lime honey refresher) and the Ancient Grains bowl. Others had the Ramen. Everything was delicious, the service was outstanding, and the space is beautiful. A great find!", "pics": null}}, {"review": {"des": "Overall: For a healthy and hearty meal it doesn't get much better than this!<br><br>The good:\"Earthy\",\"organic\",\"natural\"...whatever words you want to use. You know what you're getting into here. And, it's all delicious. The menu covers plenty of options (all sounded amazing) from salads, bowls, sandwiches, entrees, apps, custom drinks. My entire table all got different items and we all loved it. The ancient grains bowl that I had was top notch; the glaze, sauces, and ingredients were great. Portions are \"healthy\" and I left full and happy. Service was friendly and the atmosphere is clean and \"trendy\".<br><br>The not-so-good: A little pricey. The entire restaurant was a little loud which may off put some people.<br><br>Atmosphere: 9/10<br>Service: 9/10<br>Food: 9.5/10", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/suD7nUECpzC_fwTx_ucvmg/348s.jpg", "caption": "Ancient grains bowl with chicken"}]}}, {"review": {"des": "If you want to see the future of food, do yourself a favor and make your way to True Food Kitchen, where your tastebuds will be enchanted by an eclectic menu of seasonal fresh food offerings in a chic upbeat environs, and at very reasonable prices. The bar is limited to some organic and local offerings but if you can live with that, this is an excellent place to get a taste of restaurants of tomorrow.", "pics": null}}, {"review": {"des": "NOT A SAFE PLACE TO EAT!!<br><br>Was dinning with my mother in law, two men came into the restaurant and began harassing us. As we looked for a manager or waiter to help us the men STOLE OUR PHONE! Manager did nothing to help and told us that it HAPPENS ALL THE TIME. The restaurant took no steps to help us and let the situation happen because they did not want to interfere and cause a scene in the restaurant.<br><br>The food is good, but I refuse to eat somewhere that is not safe and managed by people who do not care about their customers well being.", "pics": null}}, {"review": {"des": "The best thing about True Food is how huge the place is. There wasn't a wait to get a table at lunchtime in the middle of the week, and the people at the next table were spaced far enough that their conversation was unintelligible. <br><br>The waiter sang the praises of the ancient grain bowl. I am a \"bowl\" skeptic, because I can make a \"bowl\" pretty easily myself, but we tried it. It is pretty ok, though did not surpass what I'd make at home (especially the tofu, which is a pass). And it's a bit pricey.<br><br>The TLT sandwich was ok, though the weakest element is the thin, almost crunchy, smoked tempeh. I guess they were really trying to mimic bacon, but that rarely works out for anyone, and tempeh has so much potential (e.g. the legendary TLT at Seva). <br><br>The Margherita pizza was delicious, however. Super fresh ingredients and perfect crust - better than you'll find at most dedicated, serious pizza places, no kidding.<br><br>Service was fine. All in all, a fine lunch option for the bowl loving and pizza appreciating crowd.", "pics": null}}, {"review": {"des": "The food: 4/5. I had a cappuccino, which was ok and a kale salad which was good. At $16 the salad was very basic with kale, cheese and chicken but it was fresh and enjoyable. Their menu has a variety of vegetarian, vegan and gluten free options so it would be suitable for people with dietary restrictions, which I appreciate. <br><br>The service: 4/5. The service was friendly and prompt. <br><br>Overall: 4/5. A good casual spot for the health conscious.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_5Oc66iTZ3wv5Wj6srUXVw/168s.jpg", "caption": "Tofu burrito"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Ol7-mDhHHzrZlfs6ICrRxA/168s.jpg", "caption": "Kale salad"}]}}, {"review": {"des": "True food is one of my favorites for breakfast, lunch, or dinner .  The sunrise bowl with chicken sausage is my go-to breakfast option.  The ancient grains bowl with chicken is really tasty for dinner.  I love the miso glazed sweet potato and grilled portabello.  Also, you must try the edamame dumplings!!!!", "pics": null}}, {"review": {"des": "So incredibly amazing!! Best food I have ever had in a long time. We came here for brunch and we ordered:<br><br>-chorizo burrito<br>-brussel sprout + mushroom pizza <br>-huevos rancheros<br>-ancient grain bowl<br>-kale + coconut Smoothie <br><br>Every single of these dishes were so superior in quality. <br><br>On top of the amazing and healthy food that they serve, the decor is just beautiful.", "pics": null}}, {"review": {"des": "TFK is so consistently great.  I've been here a number of times since it opened last year, and I'm always blown away by the quality, freshness, and amazing flavors of the food! The restaurant's got a pretty healthy vibe, with lots of veggie-forward and gluten-free options on the menu, but I've found they really have stuff to satisfy every palate.<br><br>The place itself is huge, bright and open feeling.  They have a nice bar area with some high tops, and then a big dining room with plenty of seating - but it still manages to stay consistently full, at least at peak times, so grab a resi if you can to be safe.<br><br>I've come for delicious brunch, dinner, and even just a glass of wine.  Some of my go-to's have been the charred cauliflower, the panang curry bowl, and the garden scramble off the brunch menu.  They also have a lot of yummy, fresh juices - I love the hangover Rx.  The charred cauliflower is so flavorful and bright, with a great tahini sauce, offset by the sweetness of the dates, crunch of pistachios, and fresh herbs.  I've had this as a shared app the last 3 times I've been and always crave it.  Same with the Panang curry bowl.  It's spicy and flavorful, with carrots, green beans, bok choi, and I usually add chicken or tofu.  It comes with brown rice and quinoa which is a nice alternative to the usual white rice that comes with curry.  It's honestly become one of my favorite curry dishes.<br><br>The restaurant is a bit on the pricy side for the relatively casual vibe that you get, but it's reflected in the quality of the food.  I say, even if it feels like a splurge, definitely give True Food a chance if you're looking for delicious and fresh food that's on the healthier side.", "pics": null}}, {"review": {"des": "Come on in, eat your veggies and feel good about how well you adult! Am I the only one that feels proud when making responsible, healthy meal decisions in a city filled with indulgent comfort food? I know I'm not. <br><br>The good news is, at True Food Kitchen, you can feel good about what you eat, without suffering through a flavorless meal that reminds you through every bite that adulting is hard. And if you happen to be having a day where you feel like adulting is extra hard, feel good knowing that True Food also offers a fresh and fruity cocktail menu as well.<br><br>When we dropped by for lunch on a weekday, the place was packed, so make sure to make reservations. Once seated, we were able to order quickly, with the food coming out even more quickly. I ordered the Butternut Squash Pizza with smoked onion, organic kale, vegan almond ricotta, dried cranberry. The pizza was outstanding, and easy to share with a group. If you're ordering only for yourself, it will be more than enough and you'll probably need to take some home, so sharing is a great option. I also ordered the Seared Albacore Tuna salad, with  avocado, grapefruit, cabbage, cashew, watermelon radish, thai basil, sesame, chili garlic dressing. It was one of the beautiful and one of the best salads I've had in awhile. In fact, although full there was no way I was leaving my leftovers behind. <br><br>Overall, loved the natural light and simplistic aesthetic of the restaurant and everything that our entire group ordered seemed to have been enjoyed. Now that I've discovered True Food, I look  forward to stopping by the location in the DC area in the near future.", "pics": null}}, {"review": {"des": "I'm a fan of True Food. Really delicious food that tastes like the ingredients in them. I want to come back to try their cocktails. Have had the noodles, gauc, pizza and all were good. One star off because the food doesn't travel well for to-go orders or delivery.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MUJZM3sEqUxGm41SUJ8lUw/348s.jpg", "caption": "Red chili noodles"}]}}, {"review": {"des": "as yelp says: as good as it gets...<br><br>the airy atmosphere, smiley staff, colorful food and yummy drinks. i can't wait to go back. my ancient grains salad was a bit on the salty side - which would be my only (small) complaint. the restaurant is obviously disneyland for a vegetarian - i can't wait to make my way through the menu.", "pics": null}}, {"review": {"des": "My second time here was a much better experience! Our server Trevor was super attentive and friendly. I ordered the Mediterranean chicken pita and my friend ordered the T.L.T. I'm not usually a huge fan of kale salad but it was really yummy! My Mediterranean chicken pita sandwich really hit the spot. I love that they added grapes in the sandwich. The lighting and decor are really lovely. It's a nice cozy place. My only issue is that the portion sizes are pretty small. I had to eat more after I left. Otherwise it was a really nice experience and my friend and I had a wonderful time.", "pics": null}}, {"review": {"des": "I LOVE THIS PLACE! So happy to have a healthy spot in the River North Neighborhood. You MUST get the lemon ginger tulsi tea. I've noticed a few times that it's not on all of the menus but if I ask for it, they always can make it. For brunch, the egg sandwich is amazing as well as the garden scramble (it comes with cheese sprinkled on top even though it's not noted on the menu). For dinner the vegan ricotta pizza is great but my hands down favorite are the bowls! Also had the grapefruit martini which was light and refreshing!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bwooGKLXvOgzY4Airt13NQ/348s.jpg", "caption": "Garden Scramble"}]}}, {"review": {"des": "Such an amazing experience here! I went out with my cousins and we ordered the butternut squash ricotta pizza for an appetizer which was incredible; I would DEFINITELY recommend. I had the kale salad with grilled shrimp and the shrimp was incredibly flavorful and cooked perfectly. Whenever I come here I usually get my salad with steelhead, but I must say the shrimp blew me away. <br>My cousin ordered a salad with steelhead but the kitchen messed up and put shrimp on her salad. My cousin had no problem with the shrimp although our waitress brought us a side of steelhead on the house! It was so sweet and honestly unnecessary. Great experience and I would definitely recommend.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Qjdmu1rai61hp77C3D7w6g/168s.jpg", "caption": "butternut squash ricotta pizza for the table"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dtYmvW46hs-kWCd2RGzxpg/168s.jpg", "caption": "kale salad with added shrimp was AMAZING"}]}}, {"review": {"des": "Finally a restaurant that serves food made from scratch! Every single item we ordered was full of flavor, freshly prepared and nourishing. I did not feel the usual bloating or heaviness in my stomach that comes with eating out. I had honey lemonade, charred cauliflower as an appetizer and Korean noodle salad. Portions are small but enough. Staff is very friendly and knowledgeable. Also, I like the open concept kitchen. You can see how your food is being prepared - fresh vegetables being washed and cut, noodles cooked, etc..  the restaurant is very clean, beautifully decorated and has a lot of natural light. Try it, you will be hooked!", "pics": null}}, {"review": {"des": "Zen atmosphere and healthy choices for breakfast, lunch or dinner. I got a skinny margarita which was a cocktail option on the menu and it was the best skinny marg I've ever had. The turkey burger was ok and definitely needed tons of ketchup. The kale salad and sweet potato hash it came with were both really good, but in need of salt. We had a friendly server and in general service was very good and fast for River North. I would come back and try some of their other healthy options.", "pics": null}}, {"review": {"des": "As an update to a previous review, and after coming here a few times, I have to say it can be hit or miss. <br><br>What to order: Inside Out Quinoa Burger, Grilled Salmon, Charred Cauliflower, Mediterranean Quinoa Salad, <br>What NOT to order: Moroccan Chicken, Spaghetti Squash Casserole, Crudite<br><br>Additionally, the food sometimes comes out lukewarm at best and the service can be subpar. <br><br>So, why am I giving it 4 stars? I have hope for this place since it's so unique and I appreciate what they are doing by bringing healthy, approachable food to the masses. Their menu has something that appeals to everyone and they DO have many good dishes. However, the inconsistency in flavor and quality, along with the service leave things to be desired. I do think the restaurant is so massive, it is hard to provide excellent service to everyone and this is disappointing.", "pics": null}}]}