{"name": "tweet-chicago", "reviews": [{"review": {"des": "I LOVE Tweet. Whenever I visit Chicago, Tweet is a must. As a newly gluten-free individual, I couldn't ask for more from Tweet. They have a dedicated GF menu. Not just choices, a whole menu. They even have GF cake they bring out to start your meal with! The staff was friendly and attentive. They have a wide variety of breakfast/brunch items, including GF pancakes, egg dishes, and Mexican-inspired dishes. I would recommend to anyone in general, but especially if you have someone with dietary restrictions or a vegan in your party. <br><br>Only downside is that it is cash only, but it's fine if you come prepared with that knowledge! There's an ATM if you don't.", "pics": null}}, {"review": {"des": "Extremely disappointed. I've been wanting to come here for a while and today I finally made it here. I ordered avocado toast and my friend ordered the eggs benedict with hash browns and sausage.<br><br>The service was a little odd... First a man came over and told me if I wanted water I would have to retrieve it from the water station. Me and my friend sat for over 10 minuets without water, so I went to get some from the water pitcher from the corner of the room. By the time I made it back to the table, the same server who told me I had to serve myself water was standing at our table telling me he was sorry he had no idea we needed water. I'm confused...<br><br>Okay time to order...I order than my friend orders and there is a back and forth about sausage. My friend says...\"Sausage on the side.\" Server says...\" \"Sausage inside the eggs is cheaper.\" Um...We're confused as my friend is ordering eggs Benedict. My friend just says \"fine,\" just to end this sausage back and forth.<br><br>The food comes. My avocado toast is chunks of not ripe avocado chunks on Texas toast. No flavor what so ever. When ever I've ordered avocado toast elsewhere the avocado is treated with seasoning, lemon juice and delicious tasting bread. This was far from tasty.<br><br>My friends dish... Well she used damn near an entire shaker of salt just to give her food some flavor. <br><br>We were very disappointed when we walked out.  The food is tasteless and overpriced. Don't waste your money here.", "pics": null}}, {"review": {"des": "Awesome brunch. Delicious Bloody Mary. Ask for the spicy! Fresh fruit and coffee cake with every meal. <br><br>Vegan and gluten free menu available <br><br>Crab cakes rocked!", "pics": null}}, {"review": {"des": "The place is really cute and for the instagrammers i think photos will look really great here. They gave us two cute coffee cake slices on the house and the taste pretty good. A tad sweet, but the cake itself was crumbly yet held. I got the sausage gravy w biscuits and eggs and my friend got some type of Benedict. She loved her dish and I thought mine was okay. The flavor just wasn't there but I can see why some may find it appealing. The egged were well done and not dry which I appreciated. I also had the pineapple vodka drink - Smt Btch and that was great. The waiter was lovely and was one of the best parts of the meal. The menu is quite expensive and I think I chose the wrong thing but that's my fault to some extent though I do think each dish should be flavourful (albeit wvennif it's not to my liking). I would def go and when I go back I'm going to have the chilaquiles. I hear they are fab.  Oh prices are awesome for all the food one gets!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vo-YJg8B26Xm7qFL-cnaPw/348s.jpg", "caption": "Smt Bitch. I forgot the name but pineapple and vodka.  t'was good."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RIDN6CnRF3py9OoG50-eSw/168s.jpg", "caption": "Sausage and gravy. Idky but it was mainly a white flour taste? Tried sousing it w hot sauce and black pepper to no avail.  Meh"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_f1wgYuBZfLzLoJ2RrXXdw/168s.jpg", "caption": "Eggs were great"}]}}, {"review": {"des": "I'm full just thinking about the brunch I had here yesterday. Boy, was it delicious, and wow, the portions are humungous. They offered us cute chocolate tarts as we sat down, and a lovely fruit cup came with each of our meals. Their drinks are also awesome -- my friend got a wasabi bloody mary and it was amazing. We got the corn arepas and the corned beef hash to eat. Both were very tasty -- although I wish I had known ahead of time how large the portions would be! This was truly a dining experience! Can't wait to return with more friends!", "pics": null}}, {"review": {"des": "My boyfriend and I come here every weekend for brunch since we live down the block. Awesome cocktails, tons of choices. Very reasonably priced. They have a huge GF menu which is awesome for me. It's consistently the best brunch place in the area.", "pics": null}}, {"review": {"des": "This spot is definitely vegan and gluten-free friendly, and I love how they provide a piece of cake to start. I'd definitely try to get here early, since it gets busy, but the wait isn't even too bad considering they have a waiting area with a bar, board games, and Where's Wally? books (the latter of which my friend and I made great use of).<br><br>I got the tofu scramble, which came with a variety of pieces:<br>- The fruit cup was a great touch. I really liked the strawberries and pineapple.<br>- The black beans were a bit bland, but they were better than nothing.<br>- I wish they had vegan hash browns, but since they didn't, I got brown rice instead. The rice was pretty decent.<br>- The tofu scramble and salsa were pretty good. I'd probably get a different dish next time since it wasn't spectacular, but nothing to complain about.<br><br>Overall, this place is great for brunch. It was actually a little overwhelming that there were a good number of vegan options, and I would definitely come back to try something different.", "pics": null}}, {"review": {"des": "This is brunch paradise. The entire staff was so welcoming and sweet. The back patio is a mini spa getaway. Need I say more? Seth, our waiter was the BEST server I've had in years. He went above and beyond to make sure this wouldn't be our first and last visit. And it won't be  The Bloody Mary i had was infused with Wasabi and had SO much flavor it was unreal. I had the \"Dirty Man\" burrito that also didn't disappoint. Filled with 3 kinds of meats, onion and came with a fresh fruit bowl and different sides of fresh salsa and sour cream to top it off with. They also greet you with fresh bread - coffee bread of the day - that was wonderful! Overall, this place was great, a hidden gem at that. They have tons of indoor steaming, outdoor seating with water bowls for your dogs, and games to play! LOVE their vibes.", "pics": null}}, {"review": {"des": "Returning after a while (8 years) and both the place and me have grown. The service was excellent (Theodore) and the food was really good, especially for this gluten-free gal. They have about 20 options for gluten-free brunch, everything from eggs and waffles to burgers and sandwiches. We ordered the California Benedict and loved it. The Santa Fe Special was good but didn't stand up to the Benedict. The place does have a unique vibe and eclectic art, with the inside rooms loud and energetic. My personal preference is sitting outside, especially the back patio, which feels like an oasis of quiet on a Sunday afternoon. By the way, they have free parking lots in the alley saying Tweet behind the restaurant.", "pics": null}}, {"review": {"des": "In addition to obviously liking the name, Tweet turned out to be a lovely little breakfast joint that was truly unique and fun. It's a cozy spot, and you should expect to be up close and personal with the folks you are sitting near. We had a party of five, which they crammed into a table for four with a chair on the end after a short wait at the bar. The bar was fun and had a lot of character - the bar tender was personable and friendly. The cocktails are served in cool glasses with fun flair. One thing I particularly enjoyed was that they have a real loudspeaker system so that you can comfortably hear when your table is called anywhere in the restaurant. <br><br>Once we were seated, we were surprised to find a piece of some sort of spice cake on the table for each of us. What a warm and welcoming treat. It really set the mood for the meal. And it was delicious. We perused the absolutely insanely huge menu and placed our orders. Then we were again surprised when they brought each of us a fresh fruit cup to snack on while we waited. I of course ordered the country benedict. It was good, though I was slightly disappointed that one of the yolks was busted in my eggs. I asked for cheese on my hashbrowns and was somewhat disappointed to find they just slapped a slice of cheese on top. Still, the gravy was delicious, the sausage was delicious and I overall enjoyed my meal tremendously. Everyone else in our party did as well. We would definitely come back.<br><br>One caution: Cash only.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kKBlcoyaStwmjPb0hi3ocg/348s.jpg", "caption": "Crab cake sandwich"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iucTRiTjwOcqM2imdFp78Q/168s.jpg", "caption": "Country Benedict"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ILZOBPuWdzVaZEF2PAMUlQ/168s.jpg", "caption": "Omelette"}]}}, {"review": {"des": "I ordered and loved the lo-carb Eggs Benedict (the poached eggs sit atop a skirt steak instead of the usual English muffins, and comes with sautéed spinach, and grilled tomatoes, with Hollandaise sauce. Set me back 16.00 but I thought it was worth it. <br><br>A big part of why I was happy to find this place was that they serve Intelligentsia coffee that was specially blended for Tweet. Robust, straightforward, coffee. Because sometimes, frou-frou don't impress me much at all. <br><br>One caveat: CASH only (for a hipster place, this comes as a big surprise. They offer ATM but I didn't need to try that since I had enough dough on me. Breakfast for three people cost 55.00+ plus tip.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SHS8IrfHzkxz6Ww_HsB43w/348s.jpg", "caption": "Lo-carb Eggs Benedict"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/onWP5LqAkJ2vd-Zmz0Skog/168s.jpg", "caption": "Biscuits and gravy"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GLrCr1Qgak0h62ZdkgncGw/168s.jpg", "caption": "Loaded burrito #8"}]}}, {"review": {"des": "Seth, our server was a rockstar! I am gluten free (not celiac) and the options/quality of food here is ridiculous! Had the GF California eggs benedict and GF pancakes, came with extra crispy hash browns, a fruit cup, and a delicious gf pastry to start! Also had the \"some like it hot\" Bloody Mary-- hand made personally by Seth, might be the best Bloody I've ever had! Thanks tweet, Sean and my sweetie for a delicious late breakfast", "pics": null}}, {"review": {"des": "This was the best breakfast experience I've had in a while, possibly ever. Greeted at the door with a tea cake ensuring if I was vegan or gluten free. Gave me the vegetarian menu to suit my response. Soyrizo tacos were delicious!! Watched the manager greet and hug some regulars and then even come bus the extra scraps of food off of my table..really a beautiful vibe in here.", "pics": null}}, {"review": {"des": "Awesome food, awesome people, awesome art, awesome service, awesome cocktails - and even kid friendly to boot, but get there super early. Long lines for a place this good. I'd give it 100 stars if I could. The best!", "pics": null}}, {"review": {"des": "Most amazing experience at Tweet! Went for a friends birthday and every single thing we tried was outstanding! Our server, Rex, made the experience even that much better! He was so funny and attentive. We absolutely loved his recommendations and he was so personable. When we go back, we're going to request to be seated in his section because he was that memorable and amazing. Thank you Tweet for one of the best brunch experiences ever and I brunch a lot!", "pics": null}}, {"review": {"des": "My friend recommended this place for breakfast. We went post our 12 hour shift and it was phenomenal! Service was wonderful (i can't remember the server's name but she was so sweet!) and the food was delicious! When we were first seated, we were greeted with coffee cake. After that was cup of fresh fruits before your meal. I ordered the biscuits and gravy, it was perfect! I will definitely be visiting here again!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7OioVrlqOa1dACrPfDYEUg/348s.jpg", "caption": "Grilled Pork Chop"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/raxC6CM7InDGZdxaC1Wd6A/168s.jpg", "caption": "Biscuits and gravy"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/v0ra3WRTov84IraVwvns-g/168s.jpg", "caption": "#8 burrito"}]}}, {"review": {"des": "Rex is the best! He's very attentive and friendly. The food was pretty good but the service was top notch! Tweet needs to give Rex a raise! I originally was going to order the biscuits and gravy with poached eggs but he suggested the country Benedict instead and it was a great suggestion! The portions are big enough for you to leave full and the cocktails are delicious!", "pics": null}}, {"review": {"des": "I definitely recommend Tweet for breakfast/brunch. A few things to note: Some how, I missed they DO NOT take any cards - *it's cash only.* Not a fan of that in 2018. So make sure you have plenty of cash or Venmo to payback your cash-carrying friend. Two, it's pretty loud inside. So, if you're looking for a super quiet place, this isn't it. BUT - Tweet's got fun, great energy and there's interesting art! The food was good and so was the friendly service. It was packed and it was definitely a two hour experience. They have quite a large menu and vegetarian and gluten-free options. House coffee is intelligentsia - delicious! Plenty of hot sauce choices and the portions are quite large. Would totally go back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/o6t2z1Xn4JJ_3iNjOhjiLQ/348s.jpg", "caption": "Plenty of hot sauce options"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iHQe7fK3SrC_gVfQNkgAkw/168s.jpg", "caption": "Ed's omelette - so good. Under the tomatoes is a delicious slice of portabella mushroom."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/x0zhProxOkTTgD-uCnk8JA/168s.jpg", "caption": "Great coffee!"}]}}, {"review": {"des": "As a vegetarian, I was super happy to see that they had dozens of different vegetarian options. <br><br>When you first sit down, they give you free coffee cake which was exciting. The icing was really good but overall the cake was a little dry and not that flavorful. <br><br>I liked the coffee a lot - it was the perfect medium roast. <br><br>I ended up getting the kale burger. I was disappointed to find that it had huge chunks of kale and that it was essentially just cooked kale stacked together with a few other vegetables. The texture just seemed off when I was expecting a burger and the kale taste was more overpowering than in most veggie burgers. The hash browns were ok but just your ordinary frozen hash browns. <br><br>The service was attentive in tends of quickly getting coffee and water refilled but we had trouble getting the check at the end. <br><br>Overall, none of the food was too impressive and the service was a little slow so I probably wouldn't go back.", "pics": null}}, {"review": {"des": "Years later, still solid AF for brunch. Nope, not much has changed and that's a good thing!<br><br>I've made it to Tweet two times in the last week after not coming in for almost a decade. Not sure how I forgot about this cozy and dependable brunch spot.<br><br>On a busy Saturday around 11am, we only waited about 20 minutes for our table. And on a Tuesday, we waltzed right in (as to be expected)!<br><br>I've got a thing for Latin-influenced brunch dishes and recently indulged in the arepas and chilaquiles. While neither is especially true to their authentic versions, I very much enjoyed the chilaquiles. I make arepas at home, and Tweet's take on the dish was admittedly not my favorite. However, the menu is long and distinguished and there's plenty to make everyone happy.<br><br>Bonus: the dedicated gluten-free menu is so impressive! I can finally enjoy an eggs benny dish as Tweet has gluten-free English muffins (they're the Food for Life brand).", "pics": null}}, {"review": {"des": "Absolutely one of the best gems in the neighborhood. Place is welcoming staff is amazing and the food is out of this world.live close to Tweet so we come here often and never once have we had a bad experience. So keep up the great work and we will be back", "pics": null}}, {"review": {"des": "Okay - so this 'tis one of my favorite places for breakfast food or bunch hands down!  Remember to bring cash to the place or you will be going to the ATM in the restaurant. No biggies if that is the case tho. <br><br>Your dining experience starts out with a beautiful fruit compote and usually some small morsel of yummy baked goods. This is just a complimentary starter.  Always impressed at how fresh the fruit is that they bring out.  Solid fruit salad. <br><br>Then, you pick out your meal.  Honestly, I have had NOTHING but the best food here.  It could be an omelette or Eggs Benedict or the bagel platter or, or, or, or, or.  The food is fantastic, organic and very generously proportioned. <br><br>The staff is ALWAYS wonderful.  Really. If you are lucky, you might go there when Michelle is working. She has owned Big Chicks (adjacent bar) forever and opened Tweet about a decade ago. It is no doubt that this place does so well because both places run on love and commitment to the community. <br><br>You really can't beat Tweet!!!  Let's Eat!", "pics": null}}, {"review": {"des": "Here visiting and was told that this is a great place to eat. <br>Suzanne was our server and she was excellent, the food was delicious and the device again was Excellent!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6kIGEcDthA_kYu6R6S9lXw/348s.jpg", "caption": "HOT chocolate."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xcB77f5iJ-ryDarbRgN1-Q/168s.jpg", "caption": "Scrambled eggs and bacon with hash browns."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4t7TKNkD7snaEdQboC5JNA/168s.jpg", "caption": "Cinnamon buns (complimentary)"}]}}, {"review": {"des": "Number one tip: Bring cash!<br><br>Tweet is a fun, cozy restaurant for filling Sunday brunch. By cozy, I mean that they try to fit as many tables as possible in a small area, which makes for a very intimate dining experience with the others around you. It is not a bad thing but is something to be aware of if you are planning to come with a big group. The interior decor is vibrant and unique. I always find something new and interesting on the walls that catches my eye every time I come here. <br><br>Having been here numerous times for brunch, I've be fortunate to try many of the items on the menu. I always enjoy the pastry/cakes that they have at the table as you sit down. It is nice to have something to nosh on to curb whatever crazy appetite you've built up from waiting for you table. Also, there is the cup of fresh fruits that come soon after, which is excellent and refreshing. While the food is tasty and hearty, it is hard to point at any one dish that holds any superlatives. From my most recent visits, the chilaquiles and the country benedict were both very good and filling with decent flavors all-around. Despite having any stand out items, Tweet offers an excellent variety of food, especially with many vegetarian and gluten-free options.<br><br>Finally, the Bloody Mary's here are great! I like that you can control the spiciness of the drink, which I appreciate as a person who loves spicy foods. The Hot Hot with Sriracha sauce is the usual go to for me. Overall, I'm fortunate to have such a reliable and delicious go-to brunch place as Tweet in the neighborhood.", "pics": null}}, {"review": {"des": "Any restaurant that serves chocolate chip coffee cake while you wait for service is a restaurant I must support.<br><br>I went to Tweet for Sunday brunch and was very pleased. This Uptown(?) joint is fantastic. The menu is pretty basic and the food was great! I ordered an omelette.<br><br>The service was very quick despite the brunch rush. The only inconvenience is that Tweet is CASH ONLY. Take note!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QCPFpo06kkzeeTd9TbElNA/348s.jpg", "caption": "Complimentary coffee cake!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GW6NWHl_W6cXfv1-q4ouig/168s.jpg", "caption": "Bloody Mary"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ce-GhM8JvkD7dpYsQGVqcg/168s.jpg", "caption": "Fruit cup"}]}}, {"review": {"des": "Cute little brunch place. Food was okay and I was just shocked that they only accept cash with this time of year. So I had to use ATM with extra cost for me to pay for my brunch meh hope they change that.", "pics": null}}, {"review": {"des": "Oh Tweet, you are so fun. I've been here for brunch a coupla  times, and the food is super fresh, bountiful, and delicious. There's always seems to be something goofy happening, too, ( in a good way).  I don't know the history of the space, but one of the rooms looks like it contains a former puppet show stage. On my most recent visit, we waited for a short time at the bar and felt like that was a sign for us to have drinks. The bloody Marys were good. We were quickly seated and this model/ waiter came over , ba bam. He was really nice and helpful and crud. Across from our table were two other male models feeding each other fresh fruit. Now I know this probably doesn't happen every day , but fun goofy stuff is kind of in the air here. Ok, the food is amazing too. I always get the Benedicts, because they rock. So, you'll like it I'm pretty sure, ok?", "pics": null}}, {"review": {"des": "I love this place!  Before you are seated they determine food allergies or gluten free.  Great little pieces of coffee cake are placed on the table as you are seated. Amazing wait staff swarm with pots of hot coffee.  Delicious bloody Mary's.  Wonderful selection of traditional brunch items, veg and gf items!   You get a choice of hash browns OR salad OR tomatoes!   Fruit or cobbler?  With comes with too!   Crazy delicious.", "pics": null}}, {"review": {"des": "Exceptional service! We came here straight from the airport and they took our luggage and got us a table immediately. The table was set up with pastries already which were really good. We got our coffees and orders taken right away. I ordered the Santa Fe special which comes with black bean patties and two eggs any style and hash browns. I wasn't a huge fan of the black bean patties. I expected the patties to be grilled but they were mashed black beans. Also all of us got a cup of fruit salads with our meals. The presentation of the food was excellent! <br><br>Also there are many vegan and vegetarian options available. I would highly recommend checking out this place. <br><br>It's cash only so make sure you have cash. If you don't, there is an atm inside.", "pics": null}}, {"review": {"des": "One of my most favorite breakfast spots in uptown Chicago! Staff is very friendly and welcoming, they are always cheerful and all smiles. I love the complimentary coffee or carrot cake that they greet you with when they seat you. Always yummy with coffee of course. In the summer, they offer outside patio seating if you like but I always opted out cause I really don't like flys and insects eating with me, I don't like sharing . I'm greedy with my food haha. I always get the country Benedict or biscuits and gravy with a side of corn beef hash. Never disappointing and that's why I always come back cause the food is always consistent. Although one time, I did catch a moldy piece of fruit in my fresh fruit cup, I told one of the guys and he fixed it right away. I don't know if he just took it to the back and removed that piece or replace it with a entire new cup. Who knows till this day but I don't care, it happens. No restaurant is perfect. Other dishes I had that was yummy was the danske and Portland omelet, chilaquiles, French toast, salmon bagel you put together yourself, crab cake plate and the steak and eggs. You really can't go wrong with their breakfast menu.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4u6c7flSBYfpRwgk8zF7pA/348s.jpg", "caption": "Sausage and mushrooms omelet, side salad, and toast"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LVxnrFERMYxBX25ozNvISQ/168s.jpg", "caption": "French Toast and turkey sausage"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MI_V1G0h4dZchqMPpt6jHw/168s.jpg", "caption": "Complimentary Coffee cake is so good..."}]}}, {"review": {"des": "This my favorite brunch place in the world, period. From Beijing to Berlin, there's no place better than Tweet and no better host than Michelle Fire. I love her and this place to pieces. Give me a good cuppa joe (and if you like bloodies or mimosas they have them too) and a plate of Mary Lou Zeleny's Biscuits and Gravy and I'm good to go for the day. The wait is worth it!", "pics": null}}, {"review": {"des": "Wonderful service and delicious food. The arepas are my favorite, but today I was healthy-ish and got the Portobello Benedict. It was very tasty. The classic bloody Mary is really the best, though it could use a couple shakes of Tabasco. I'm just not keen on the taste in the wasabi or sriracha verdone. <br><br>Today I brought a friend who moved to Chicago almost a year ago and had never been! He really like the brunch, the bloody Mary, AND the place itself. We hung around in the bar for a couple drinks after. <br><br>The ATM fee is still outrageous, but luckily I remembered the policy.", "pics": null}}, {"review": {"des": "CASH ONLY. <br><br>Tweet is a cute, hip spot for a casual brunch. The restaurant is connected to Big Chicks, the bar next door. They have both areas open so folks could wait at the bar and/or tables on the other side while waiting to be seated. They also have a free coffee and water station on the Big Chicks side, which was a nice touch, and lots of board and card games available as well. The ambience was not bad - the music was a little loud for my taste, but can't complain too much about that. The service was nice. <br><br>The food was really good and prices are very reasonable. They serve Intelligentsia coffee, but for some reason, it tasted better than any Intelligentsia coffee that I've ever had. They have a pretty decent size gluten free menu as well, if you need that. I got the Glen's Savory sandwich, and that did not disappoint. I was pleased with the menu as I found myself undecided between a few different options that all looked really tasty and different from what I've had elsewhere. They also had a generous spread of hot sauces on the table, which of course, I had to try all of. And they also gave us complimentary spice cake to start!  <br><br>Apparently, they have a back patio, although I did not see it. The front patio had reserved for dog owners so that must be nice for folks with pooches in the area. Lots of street parking. Pleasant area to walk around in afterwards. My only complaint was that they won't seat you until your entire party is there and even after we had all arrived, we had to wait awhile to be seated. It's not unheard of and totally understandable given how busy they were, but still, I would have rather been seated at a table than hovering at the bar for that long. Overall, I liked it a lot and would recommend it to folks trying to grab brunch in the Uptown area.", "pics": null}}, {"review": {"des": "Went here today for brunch.  Super busy and understandably so.  Their food and service are great!  They had many options for different kinds of dietary needs (Vegan, Vegetarian, Gluten Free).  There's also free coffee at the bar.  <br><br>I ordered the Corn Arepas off of their gluten free menu and it was delicious.  The arepas were light and fluffy with cilantro baked in them.  They were topped with two eggs, avocado, and sour cream.  I would totally get it again, however, there are so many other dishes on the GF menu I want to try.  <br><br>Their service was awesome.  Everything was out super fast and the servers were friendly.   <br><br>Would definitely recommend and go back to again.", "pics": null}}, {"review": {"des": "I have been here many times and it never disappoints!! I love their vegetarian biscuits and gravy, the veggie patties served with them are awesome. My boyfriend can't get enough of their French toast and Belgium waffles. <br><br>Additionally, their service is on point with clearing dishes and refilling drinks. Yes, at peak times you will have to wait for a table... but they are so worth it!! You can't go wrong!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ip-nujvndo8dn_DNwcdBQg/348s.jpg", "caption": "Vegetarian Biscuits & Gravy and Belgian Waffle"}]}}, {"review": {"des": "Amazing lunch/brunch. Amazing service. Amazing atmosphere. I would highly recommend. Got the omelette, biscuits and gravy and have had the eggs benny. All are delicious!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/i_nVu-0oyVNNuJI-0VO7Jw/348s.jpg", "caption": "Ed omelet"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LQ-HLRS9crwIxAz6pK-lCA/168s.jpg", "caption": "Vegetarian biscuits and gravy"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/l4JZGKGpShlkLaVbRHo5rg/168s.jpg", "caption": "Eggs Benedict"}]}}, {"review": {"des": "Except for not having enough seating this place hits the spot. The food is good enough that on Sunday there is always a waiting line. Most customers were mid 20's to 30's . They all seemed happy. I enjoyed my omelet very much. They offered a salad instead of the hash browns. They also gave small fruit salad with the meal. The waitress was very efficient and attentive. Even the coffee was good.", "pics": null}}, {"review": {"des": "This was the closest place to eat near where we were staying so we decided to check it out & see what they had. Their menu is huge! So many different things to choose & they portions are big. <br><br>When they seat you they give you a slice of what seemed to be a spice cake. Kind of random but it was good.<br><br>I had a spinach & cheese omelette- let me tell you they did not skimp on the spinach! There was almost too much & I love spinach. Better too much than not enough. <br><br>My friends both got the Cobb salad. That was HUGE and the dressing came in cute little pitchers. <br><br>I would eat here again for sure. Staff was very friendly & attentive. But FYI - they don't take cards!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AgeCj4nGQ6-ZApruD0RFPw/348s.jpg", "caption": "Cobb salad"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TeO6j8om0tEEaZSXNBu3Uw/168s.jpg", "caption": "Cobb salad with ranch & honey mustard dressing"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/atNHDzQ1hQI98KwK0SrVUw/168s.jpg", "caption": "Spinach one letter & hash browns"}]}}, {"review": {"des": "We ordered the protein platter (it was not what I expected, I thought it'd have more protein honesty, but what I got was tasty and fresh) and the pancakes with chocolate chips (we ordered the gluten free pancakes because that was what our server recommended us; and it was good!).<br><br>The place has a great vibe. Our server was really nice, the host and the busboy too, no complaints. One of the best rated places to have breakfast. <br><br>FYI, this is a cash only place. (They have an ATM though, if you don't mind the fee)", "pics": null}}, {"review": {"des": "Omg. I've lived around the corner from this place for years and just yesterday experienced the best customer service I've ever had EVER, right here in Uptown. I can not believe it has taken me this long to try this place, but it has hands down become my favorite breakfast spot. The second we walked in, the waiters all catered to us like we were the only ones there (in a full house!), sat us down with some complimentary homemade banana bread to snack on and gave my nephew a bowl of sliced bananas. They give all the kids a cute basket of toys and books next to them to use, perfect for when the little ones get fussy. This should be the standard everywhere! Amazing service. They paid attention to every detail, were always around to make sure we were taken care of, every single waitstaff was so so friendly and warm, and the food was delicious. I went up to pay when we were done and told one of the guys up front how yummy the banana bread was and this sweet sweet angel went in the back and wrapped up 3 more for us to take home. Will mostly be coming back for the service. So glad we finally stopped in here. Definitely just became my number 1 place.", "pics": null}}, {"review": {"des": "We enjoyed some very delicious food here, including a veggie Reuben, which I have never eaten anywhere else. Though this is not a vegetarian/vegan restaurant, in that the fare is not exclusively vegetarian/vegan, we found the quality of this food here to be superior to that of some exclusively vegetarian/vegan restaurants, such as Alice and Friends, not far away.<br><br>The prices were also quite reasonable, the portions generous and the staff very friendly and accommodating. The sweet potato fries were excellent and a diner at the table next to ours highly recommended the spinach omelette.<br><br>The main downside of this restaurant for us was the noise. The nature of the acoustics (high ceilings with no sound-absorbing materials, apparently) is such that we found it difficult to hold a conversation, even during off hours. The main suggestion I would offer if you eat here is to avoid peak hours as much as possible, unless you enjoy noise. Also, be aware that only cash is accepted (you will pay a hefty surcharge to use the ATM on premises) and parking in the area can be challenging.", "pics": null}}, {"review": {"des": "Tweet delivers a consistently good brunch. They keep the coffee flowing and have a ginormous menu of options. Nice freebie touches like coffee cake and legit fruit cups rather than the same old freebie cantaloupe. We had a 3 year old with us and they had our table prepped with kids books and cut up banana all ready at the table for him which was very thoughtful. Great place to go with groups but expect a wait.", "pics": null}}, {"review": {"des": "CASH ONLY. Wish I didn't find out just as I was about to pay. <br><br>Regardless, good food. I got the country Benedict and my friend got a Denver omelet. They also give you complimentary cake to start! The country Benedict was amazing. The gravy wasn't too salty (which is often the case), and the biscuit was a great texture. Recommended, but bring cash. Also, get the hash browns (: <br><br>Oh btw, they ask you to wait by the bar area which is packed with games to make the time go by a bit faster. So pack up your brunch crew, play some candy land and eat good food.", "pics": null}}, {"review": {"des": "One of my favorite breakfast places in the city! A hidden gem in the Uptown neighborhood. My favorite item in the menu is the country Benedict. Who doesn't love their sausage and biscuits covered in gravy?!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EIzBhNIrpheJuyb9JgC0Bw/348s.jpg", "caption": "Corned Beef Hash"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bBmtCn-WeKNL5OCcPNzufg/168s.jpg", "caption": "Country Benedict"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hRtjFyRqwM6O3RdV9QIbEA/168s.jpg", "caption": "Tea time"}]}}, {"review": {"des": "My favorite meal on our latest Chicago trip. <br><br>The host was really friendly and helpful, directing everyone to the adjacent bar while the group waited for the last 2 of us to show up, and then having a table available as soon as the group was there.<br><br>The drinks were very good at a great price. I really enjoyed the Wasabi Bloody Mary--the right amount of kick, and served in a Tiki glass. There's also a variety of mimosas and a full bar. <br><br>The menu is over-full to the point that there are added on attachments, and everything looked appetizing. There's also a gluten free menu.<br><br>I got the steak and eggs, which was perfect. The salad and sliced tomato options made it possible to enjoy a big brunch without bread or potatoes without feeling like I was missing out on anything (the salad was particularly well done.)<br><br>(It's cash only, but there's an ATM in the lobby. Plan accordingly if you wan't to avoid the charges.)", "pics": null}}, {"review": {"des": "Tweet definitely showed a lot of promise at the beginning. this place was recommended to me so i decided to check it out for sunday brunch. i checked out the menu online and saw some items that peaked my interest. when i walked in, i was promptly greeted by the friendly host. i sat at the bar, while i waited for the other member of my party to arrive. <br><br>I ordered the burrito #4 was with eggs, black beans, avocado, and cheese. I was really disappointed and barely ate anything - minimal flavor, and the eggs were stiff. Then as we were wrapping up, one of the employees (with the mic) came over and hovered over our table (we were on our phones) to tell us \"ladies, once we get to the Instagram portion, we ask you to get up and go to the bar.\" RUDE RUDE RUDE. i have never in my life had an employee at a restaurant be this condescending and to be frank - nasty. And all for some mediocre (at best) food. I was actually looking up directions for how to get home, NOT on Instagram. all in all, Tweet is trash. they need to train their employees to learn how to speak to paying customers better. I'll never go back.", "pics": null}}, {"review": {"des": "The staff, the host, and my waiter were amazing. They accommodate all types of diets and are very friendly. The food was outstanding. A must-eat spot for everyone, including gluten-free, vegetarian, and vegan", "pics": null}}, {"review": {"des": "I came to Tweet's fifty minutes prior to it closing! The place was crowded, but i did get seated upon walking in. This place has a different feel to it considering its hooked to a bar which is named \"Big Chicks\". I couldn't stop looking around, and at the pictures because of the different feel. It has the scenery of a bar, but serves breakfast & brunch. Anyway, what ever their doing it's sure working, because it's rated four stars on Yelp, and had every seat filled, except the two seats at my table : )<br><br>The service, and food was great! Even though they were packed; the waiter's and waitresses acknowledged me and other customers in a friendly manner, even while leaving.<br><br>Tweet's takes cash only, but does have an ATM inside, but to be safe I'd carry cash upon arriving in case there is a malfunction with the machine. <br><br>As for parking i recommend parking in the neighborhood, or either taking the train. You can get off at CTA Argyle; walk towards the Lakefront, and take a left on Sheridan. Tweet's will be right there on Sheridan.<br><br>I enjoyed Tweet's, and this definitely will not ne my last visit. Even though it took me a good fifteen minutes to order, i wasnt disappointed with what i ordered, it went down quickly. I came in angry and hungry, but left happy and bloated!<br><br>Enjoy! : )", "pics": null}}, {"review": {"des": "Amazing! Found this place after staying at an Air Bnb near by, and I can't wait to go back! The staff is friendly and makes sure your coffee is filled! And the coffee is sooo good! They offer so many options for Gluten Free and vegan eaters which is so convenient. The menu offers a wide range of choices; it was hard to make a decision! I had the Vegetarian Biscuits and Gravy, and OH MY GOSH! LOVED IT! Highly recommend you visit Tweet!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/63CUcFDuQ25RvwzhLsLokQ/348s.jpg", "caption": "Vegetarian Biscuit and Gravy!"}]}}, {"review": {"des": "This is a great place just north of Argyle on Sheridan. We went in for Sunday brunch expecting a monstrous wait but it was less than 20 minutes so we sat at the bar and had a cocktail before getting a seat on the patio. I'm off hard liquor right now so I had a Kir Royale but they have a great cocktail list and 4 different heat levels for their Bloody Marys. <br><br>I had a build your own omelette with gouda cheese, chicken sausage and tomato. It was served with hash browns, toast and a fruit cup which was awesome! I had enough to bring home with me. They had two little pieces of coffee cake on the table when we sat down; I think it was a pumpkin chocolate chip flavor. We also each had a glass of Sauvignon Blanc which was only $5. I'm certainly no wine expert but $5 for wine outside is right up my alley. This was a great brunch with a ton of variety as well as plentiful gluten free options if that's something you do! They are cash only but there's an ATM on site! So glad we checked them out.", "pics": null}}, {"review": {"des": "In my opinion this is as good as it gets! Excellent gluten free menu for breakfast, including cocktails. Sunday's in Chicago serve alcohol after 10 a.m., so we didn't imbibe. Service was consistent, friendly, and knowledgable of their menu. Food was excellent in taste and presentation! I had the Santa Fe with a side of avocado and chorizo, hash browns with my eggs poached. They nailed it on all dishes. My partner had the GF pumpkin pancakes - delicious! Another had the Hollywood plate - a healthy spread of vegetables and protein. The photography and art donned on the walls were great conversation starters, incredible and diverse work. Small outdoor street side dining and three rooms to fill for indoor dining. Two bathrooms with a good chance of waiting to use.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/va4Fqwi4QS3mSrLU1u4qUg/168s.jpg", "caption": "Pumpkin pancakes"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/P87CIFY_FsIqauapek_gxg/168s.jpg", "caption": "GF Bloody Mary"}]}}, {"review": {"des": "I go here once every few weeks. The food and service is always amazing which is what keeps me coming back. They start you off with coffee and yummy pieces of cake so you have something snack on while you look over the menu. The fresh fruit they give you after you order is a nice touch and always appreciated. Will be back again and again I am sure.", "pics": null}}, {"review": {"des": "Gluten-free pumpkin pancakes... nothing else you really need to know here, folks! I cannot stress how amazing these are served simply with just a little bit of butter and whipped cream; definitely no syrup needed! These pancakes, while light and fluffy, pack a soothing flavor profile. The pumpkin isn't overpowering like typical pumpkin dishes, yet still maintains just the right about of Fall-esque spices.  I usually get this with a side of egg whites and turkey sausage to complete my meal, and I am totally satisfied! <br><br>I've also ordered the lox platter before which is humongous! Bagels, onions, capers, tomatoes, fruit and of course the lox... you name it, this platter definitely has it! It's definitely a choice for the indecisive as it has got a little variety of everything on that plate! <br><br>Overall, this place is a quaint little breakfast place that takes simple classics to the next level! Definitely a place to keep in rotation whether you're taking a group to brunch or you relax here solo! Cash only! I'm", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cDXqh0Jv07U3oRukSZkhNw/348s.jpg", "caption": "Lox platter, GF pumpkin pancakes and steak & eggs!!"}]}}, {"review": {"des": "This place was so so great! It was a madhouse when we got there at 12pm on a Sunday, but it was only a 20 minute wait for our party of 4 to be seated. We got a free little coffee cake (delicious) when we sat down, and our sever Seth was just so cute. The Crabcake Benedict was phenomenal, and when the kitchen was backed up, the owner walked around and freshened our drinks with champagne. She stopped by a few times to chat, offered us a round of drinks on the house for the wait, and couldn't have been sweeter. Will definitely be coming back!", "pics": null}}, {"review": {"des": "Amazing food, wonderful service and lively atmosphere! My husband and I love going to Tweet! It's a favorite for sure.", "pics": null}}, {"review": {"des": "Came here over the weekend for the first time and it did not disappoint!  The portions are huge, food is fresh & tasty and the staff is super friendly.  Just make sure you have cash as it's cash only!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/E0Mb2HmyNHu_eOE3d_JiXA/168s.jpg", "caption": "Veggie Chili"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iotZ0XDrIdt245r9CTnSlg/168s.jpg", "caption": "Bim in bop"}]}}, {"review": {"des": "This place is wonderful! Great food, quantity and price plus very gluten free friendly. The wait staff are super charming. Colorful atmosphere and lovely sidewalk area.", "pics": null}}, {"review": {"des": "If you're gluten free and looking for brunch...go here!! When we sat down, our waiter brought us each complimentary blondies (one sans-gluten for me). The menu is incredibly versatile. My friend ordered the eggs Benedict and I was able to get a gluten-free Belgian waffle. Simply put, the food and service are great! The interior doesn't quite match the experience, but all and all great for the gluten free!", "pics": null}}, {"review": {"des": "My wife has Celiac and we eat here regularly.  They have plenty of gluten free options so it's a favorite.  If you are going to brunch, go before 9:30. <br> They won't serve drinks right away, but there is also no line.  When they are really realy busy, the food is good.  When it's slower the food is really good.", "pics": null}}, {"review": {"des": "A good family friendly restaurant. It can be pretty busy on a weekend though, so I recommend going early. <br><br>The food was decent and appropriate, but nothing blew me away. I would definately go again as it was a good atmosphere with friendly staff; however, if I have the opportunity to check other places out I would probably do that first. <br><br>This place is really lively and can be busy. If your children are not a fan of that it might be best to go during the week when it is less busy.", "pics": null}}, {"review": {"des": "Always a good breakfast!  I have had many great meals here... my only complaint is that there are too many items to zero in on!  They serve large meals and have a friendly staff!  Love this place!", "pics": null}}, {"review": {"des": "*Cash only!* Come prepared and learn from my mistakes. Damn those ATM fees.<br><br>I honestly was not that impressed with Tweet. The corn arepas were just mediocre pancakes with a few kernels of corn mixed into the batter, topped unceremoniously with squiggles of hot sauce, avocado, creme fraiche, and whole sprigs of cilantro. Portions are indeed huge, so I begrudgingly took my leftovers to go and ate them at work later. They almost tasted better cold.", "pics": null}}, {"review": {"des": "Love this place! The food here is worth to wait!!!! <br>Good services and their Egg Benedict is Amazing. Fresh Veggies.... great place for brunch!", "pics": null}}, {"review": {"des": "SO gluten free and vegan friendly. I was astounded by the number of options. I also went on my 21st birthday and they gave me a free drink and everyone was so kind and welcoming. my new favorite place", "pics": null}}, {"review": {"des": "The host carried out pastries for us as he sat us. They were delicious.<br><br>What a delightful brunch on a Monday morning. I had the corn arepas, which came out stacked with huge corn pancakes, eggs, avocado, hot sauce, a soft sour cream, and cilantro. Black beans came on the side and I ordered the chorizo, which I would probably go without in the future because there was plenty of other deliciousness.<br><br>The ice tea was clearly house brewed and delightful. My food came with a great fruit cup.<br><br>They had a ton of options, including vegetarian, vegan, and gluten-free.<br><br>I can't wait to go back.", "pics": null}}, {"review": {"des": "This place never disappoints! The food is great, the staff incredible, and the owner one of the kindest and most selfless people out there! I recommend my usual, the country benedict!", "pics": null}}, {"review": {"des": "Two friends from Indiana were in Chicago for their 30th anniversary and wanted to have a late lunch.  I couldn't think of a better place for that than Tweet.  The couple must've enjoyed what they ordered, because they cleaned their plates quickly.  I ordered the \"quiche platter\" which featured one of their daily quiches...  sun-dried tomato, spinach and goat cheese.  Salad, fruit and a croissant came with it.  And even I couldn't finish it all (which is saying alot, as my stomach tends to be a bottomless pit).  I had some freshly-squeezed orange juice, too.<br><br>Our darling waiter noticed the anniversary card I'd given to the nuptial honorees and brought out one of their magnificent chocolate cupcakes (gratis).  What a delight?!<br><br>I'm so glad Tweet is in my neighborhood.  I relish being able to introduce it to dear chums.", "pics": null}}, {"review": {"des": "Wonderful kitsch place.  Awesome bloody mary's...get the hot hot hot...it's not too hot...just the right amount of spice.  Extensive menu...corned beef hash is good and the bacon swiss quiche was stupendous.  Only issue with this place is that they push you out the door.  This morning, no sooner had I finished the last bite of my quiche and they were taking everything off the table and asked/told us to get up.  They suggested we go to the bar to continue our conversation, but with the \"warm\" vibe emanating from the staff, decided our money was best spent someplace else.", "pics": null}}, {"review": {"des": "Love this place! Have been here maybe a dozen or so times the past few years with my wife and friends for brunch. Went again last week when my nephew was in town from Oregon and we all really enjoyed our brunch once again. Super busy on weekends but they can usually get you seated relatively fast. Be advised... I think its cash only.", "pics": null}}, {"review": {"des": "This is the best place to have breakfast or lunch any day I love this place especially that crab benedict in it it's this is my favorite place to get crab Benedict....You gotta try it.....", "pics": null}}, {"review": {"des": "Super dooper everything except for the wait and the rush to move us along. This place is fancy. As in dapper hipster-like put on your fresh threads, hair dye and tattoos. You can pose for a photo with a Marilyn drag poster. My aging Aunt got a cameo photo but I'm not allowed to include it online. <br>We came because my aunt needed gluten-free and this place had high ratings for it. Which would have been great but not for people who have celiac.... they only do \"kind-of\" gluten free here, so if you've got celiac or any more than just whole-foods-yoga-studio-kale-lovin gluten-free, this is not the place for you. The only thing for folks with celiac is the oatmeal!!<br>My honey and I hot some kicking good food. I had the California Benedict with loads of avocado, yummy sauce, and not quite enough roasted tomatoes, but all in all very tasty. My honey got a tortilla soaked in tart green tomatilla sauce, smothered with spicy chorizo and veggies. We'd come again, just not with a person who had celiac, and not on a Sunday at Lunchtime​!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xK56ndX3XEi4N8cVEfbqwg/348s.jpg", "caption": "Gluten-free oatmeal."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qNFYWkJz4dmtWBN_YWNxOw/168s.jpg", "caption": "California Benedict"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nlO_gF32AKw3ZHf827Sjwg/168s.jpg", "caption": "Chilaquilas-smothered in tomatilla sauce"}]}}, {"review": {"des": "Seth was the best!!! Service was incredible, menu was extensive, atmosphere was unrivaled!! Thank you!!", "pics": null}}, {"review": {"des": "An amazing brunch spot in Andersonville! Definitely recommend if you're in the area! Super friendly and nice staff, amazing artwork on the walls, & expansive menu with vegan and gluten free options. This restaurant is cash only, but still amazing. There are lots of cute shops nearby so it's nice if you want to hang out in Andersonville for a while. Would definitely go back if I was in the area.", "pics": null}}, {"review": {"des": "I used to love this place but the service has gotten pretty hostile as of late.  I understand people have bad days but there was no reason why so much attitude was thrown at us upon arrival.  Well this is an easy one; we left before our server could even arrive because I refuse to be treated (and my party of 6) like we're an inconvenience so we can pay $15 for omelettes?!?! If you want a little longer wait but much less attitude, sure you may not have \"grass fed\" meat dishes or \"free range\" poultry/dairy but hey I'll trade good ol respect and manners to \"gourmet\" UPTOWN attitude (no insult to Uptown because I'm a resident.).", "pics": null}}, {"review": {"des": "Oh my gosh! What's not to like about this place? I'm in town visiting a friend and some other we were meeting for brunch today recommended Tweet. Incredibly friendly staff, delicious food and huge portions! The wait wasn't bad, about 20 minutes for a group of 4 at 10:30 on a Sunday morning. We sat at the bar and had Irish coffees. Tweet stocks plenty of board and card games in the bar area to help with the wait too. Brunch was amazing! I had the pork chop plate with eggs, hash browns and fruit. One had the lox plate. She was served half a farmers market worth of veges! Another had the corn arepas and loved it. I would definitely recommend this for anyone in Chicago or visiting the city.", "pics": null}}, {"review": {"des": "One of the hot spots of Uptown! Being cash only does NOT deter people from coming here and waiting in line to brunch! While the dining room is small for the popularity of this restaurant, they offer free coffee and boardgames in their bar area! An easy way to pass the time quickly with friends as you're waiting for a table. Once seated, you're greeted with complimentary coffee bread that is amazing! Even if you have a gluten intolerance, there are plenty to choose from on this restaurant's menu. <br>There is a massive amount of food that comes with most of the breakfast items so come hungry! This is an easy place to either eat gluttonously or be healthy. Either way there are options to enjoy delicious food whichever route you choose.<br>The crab cake croissant sandwich is good but i wish the crab cakes were a bit bigger since there were bites without any crab cake. Their side salad is nice and light and pairs well with my sandwich. I've also tried their lox platter which was presented beautifully and was a great portion size. <br>One thing to note is that this is NOT the place to sit and enjoy breakfast for hours and hours. Because they're so busy, they will kindly nudge you to leave to allow other patrons who have been waiting for a table to be seated. Understandably so but good to note coming in. They also will not seat you until everyone at your party is present.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WbVmgwN2Jplcvf9uhWuvkQ/348s.jpg", "caption": "Crab cakes are a little small compared to croissant so I'm glad I got bacon on top to supplement. Overall this was really tasty!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UomDAOQQHcLhtTLYNu2kEQ/168s.jpg", "caption": "Crab cakes with bacon on croissant with salad and fruit"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/m9TmyNYRpMWQNwFbp7X3xw/168s.jpg", "caption": "Iced tea comes with a little refill bottle!"}]}}, {"review": {"des": "This is my last time eating at Tweet. The food is good, but the service was simply atrocious. I went there with two other people for a birthday celebration brunch, and the third person dropped two of us in front while looking for a parking spot. They wouldn't seat us until the third person arrived (I get, but hate, that policy) even though we told the host she was parking. The guy at the host table said, let us know when your whole party is here and we can seat you (it wasn't busy, there were many free tables), and when the third person arrived, I told who I would presume is the owner, that all three of us were here. She snapped at me \"I don't have a table for you, sit back in the bar.\" I explained the other guy said there was a table available, but she just snapped, \"NO.\" Literally 2 minutes later, she came back to seat us.<br><br>Meal was good, not spectacular, but about a half hour into our meal they were rushing us to leave. Any time we put a utensil down, they were trying to take our plate. When we were about to leave, and I went to the bathroom, my friend gave up the table because she felt too much pressure to be able to wait until I returned to leave. When I started putting my coat on, the owner grabbed my coat while offering to help with it. I said no, I didn't want any help. I know this may be a nice impulse, but you shouldn't put your hands on anyone without asking BEFORE helping, especially after our whole customer service experience, especially from her was atrocious, and I suspect it was more to rush us out than to help. It soured my birthday brunch fo sho.", "pics": null}}, {"review": {"des": "Excellent brunch restaurant. Clearly one of the most popular places in Uptown. We arrived at noon and there was a long list. The waiting list was expertly handled by the talented host staff. The waiting area is connected to the bar Big Chicks, which made the nearly hour long wait bearable. The bar has a good beer, wine, and drink list as well as complimentary coffee while you wait. <br><br>Once we sat down service was friendly, prompt, and accurate. I ordered the corned beef and eggs while my wife ordered the breakfast burrito. All breakfasts are served with a fresh fruit cup. There were 8 different burrito varieties to guarantee a return trip! Everything was fantastic.", "pics": null}}, {"review": {"des": "Best eggs Benedict of my lifeeee! My boyfriend always gets the breakfast burrito (perfect for a big appetite), and he can't really speak about anything else because he gets that every time because he loves it so much. The staff is super friendly and for you gluten free folks, they have a menu just for you! But seriously... get the eggs Benedict.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qldzjqJjYWA_SsyGqZRkiA/348s.jpg", "caption": "EGGS BENEDICT"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zbePImc-pHbT5oKL95Ri2w/168s.jpg", "caption": "Santa Fe special"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1iVgv0-Q0pII9sNPwaN37w/168s.jpg", "caption": "Sausage gravy and biscuits"}]}}, {"review": {"des": "Having been here several times, Tweet never disappoints! They have a large brunch food menu with an even more extensive drinks menu. I've not heard of beermosa before coming to this place, and it was surprisingly good. The service was efficient and polite. One thing that I didn't quite like was that I did feel a little rushed every time I was there, but unfortunately that's common in a popular place like Tweet. <br>Of course, the bar where you get complementary coffee is a really nice touch.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kh2flX1cmjraqIZmqfT8zw/348s.jpg", "caption": "Belgian Waffle"}]}}, {"review": {"des": "We stopped in for Sunday  brunch--thank you to my fellow Yelpers for the great recommendation.<br><br>Tweet is a fun neighborhood restaurant with a great, casual vibe.  The menu was very large and had something for everyone--vegan, gluten-free, organic and really really bad for you but delicious.  The service was really great and that is huge for me.<br><br>I ordered an egg white omelet with hash brown and my boyfriend ordered a chorizo breakfast burrito.  As soon as we sat down, there was complimentary chocolate chip coffee cake on the table and they brought the cutest little cups of fresh fruit while we waited.  The coffee was delicious and bottomless with lots of people offering refills.<br><br>My omelet was delicious.  The hash browns were nice and crispy on the outside and soft on the inside.  My boyfriend's omelet was a little disappointing.  It looked like a deflated balloon.  It was probably the most under-stuffed burrito I have ever seen and it was not rolled evenly.  One side of it was almost completely flat.  I wish I had stopped to take a picture.  He said the flavor of the burrito was fine.<br><br>I will definitely go back and give Tweet another try for lunch.", "pics": null}}, {"review": {"des": "We sat out on the back patio and it was perfect! Inside was really​ crowded, which I guess is a good sign for weekend brunch. Food was great and a lot of options, even for vegetarians.", "pics": null}}, {"review": {"des": "We just discovered this little gem today and we will definitely be back! I don't know if we've ever been to a more kid friendly restaurant- they had a bowl of fruit and a basket full of books and toys waiting at the table for our toddler when we sat down! They are incredibly accommodating for food allergies and have phenomenal customer service. Overall an awesome experience!", "pics": null}}, {"review": {"des": "Absolutely love this place. My girlfriend and I go as often as we can. The staff is great, dine-in comes with complimentary coffee cake slices (type changes, but always delicious), and the food is always on point. I literally leave late some days just to get a large side to-go-order of the corned beef hash.<br><br>Dine in, my go-to is the eggs benedict.<br><br>My only complaint is they don't open until 8:30am. Which is too late for me most days.<br><br>If they opened at 7:00/7:30am M-F (even if they only sold to-go easy breakfast sandwiches) I would be very happy... happier. There's really no other place in the walking area for breakfast. Please open earlier!!!<br><br>Great food, great staff, patio seating and a great eggsperience!!!", "pics": null}}, {"review": {"des": "Best Gluten Free Pancakes in the Midwest. You will experience one amazing breakfast here. Everything is delicious! The food is great and the portions are huge. Love this place!", "pics": null}}, {"review": {"des": "Super nice staff and food that is delicious. I had the Eggs Benedict and it was one of the best ever.  The potato mash was also delicious. The staff was super helpful. They also have a great cocktail menu. I had a tiki cocktail, which was nice and refreshing.  We were able to sit on the deck with our dogs nearby (on the other side of the dining fence where we were dining).  This was one of the best breakfast experiences ever!", "pics": null}}, {"review": {"des": "Cash only, but they have an ATM on-site.<br>Service was pretty good. We walked in and were seated immediately, with little pieces of...spice cake? Coffee cake? Whatever....it was tasty!<br>I ordered the chilaquiles (if they are ever on a menu, I order them) with added chorizo. The corizo never made it in to the dish, which is a bit disappointing, because after tasting my sister's dish with chorizo, I think it really would have added something to it. But it wasn't bad without it. And good lord there was so MUCH food! I ate maybe half of my meal and left very full.<br>I have to say, the best part of my meal was the lavender lemonade. It was delicious! I was pleased when they offered me a to go cup for it!<br>I would certainly go back when I am in Chicago again!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/e7TUdk2K69uAa4B16SOmhQ/348s.jpg", "caption": "Brought when were were seated. Not sure what it is, but yummy!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/d4TOn_uN80Qk8BPPGCDGgg/168s.jpg", "caption": "Chilaquiles. They forgot the chorizo :-( Still tasty though!"}]}}, {"review": {"des": "BIG THING TO KNOW! CASH ONLY! They do have an ATM onsite<br><br>Great place for breakfast! This was just down the street of where I stayed in Chicago and the art-deco look and yelp reviews drew us in. My sister and I were seated quickly with a small plate of some type of spice bread.  We ended up having a gentleman sitting right next to us at the 4 seat table we had, so if you like having your own space, pay attention to the tables you get.  Our waiter was a little slow to get over to us and people who were seated after us were helped a little faster, but that allowed us to have our order ready right away. While everything looked good, I ordered the Numero Tres breakfast burrito (eggs, chorizo and cheese with sour cream and salsa on the side). The only thing that could have made this better would have been a side of guacamole or sliced avocado on the top.  Great place to stop of breakfast!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_SFQUSP302uJB0wsOd2J2Q/168s.jpg", "caption": "The Numero Tres breakfast burrito"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HZKh2H-H1geXkX9mVrQMBg/168s.jpg", "caption": "Fresh fruit and fresh orange juice"}]}}, {"review": {"des": "I love tweet. It's close to home, but I would travel far for their biscuits and gravy because they make it vegetarian. I know they use the morning start sausage patties, but I don't care, it's still amazing.<br>Staff is overly friendly, and Michelle the owner is amazing. Dollar burgers on Mondays, free buffet on Sundays!!", "pics": null}}, {"review": {"des": "This place is great. The food presentation is so creative for a diner and the food is delicious. They also have something on the menu for everyone. You can be vegan, gluten-free, or on a high protein diet. I highly recommend.", "pics": null}}, {"review": {"des": "Been a while since I've been to Tweet.  Today's experience was meh.  First, food was OK, but overpriced.  <br>More importantly: <br>1. Waitperson acted like a robot and was not really friendly--exactly the opposite of the owner, Michelle.<br>2. When placing the order, I asked for hash browns extra crispy and scrambled eggs to be a little \"loose\" meaning not overly done.  She said that she couldn't honor the request on Saturday as they are busy.  So what the hell do you go to a restaurant for if not to have food cooked the way you want it?  Especially breakfast.<br>3.  They wouldn't seat us outside, but the moment they seated us inside, they then decided they would seat people outside.<br>4.  For a tab that was $25 a head, I expect better.<br>5.  Tons of screaming kids.<br>6.  Way too many \"rules\" for a casual Saturday breakfast at 9am.<br><br>There are better places for breakfast on the north side.", "pics": null}}, {"review": {"des": "Service was great. They spoil you with coffee cake and fresh fruit cups prior to your meal. Very casual and fast paced service. Fun and warming environment. We will be back! Food was on point and most importantly corned beef hash was actually homemade!!", "pics": null}}, {"review": {"des": "This might be the greatest brunch place I've been to in Chicago-amazing meat alternatives and gluten free options, fantastic service, and a cute and quirky atmosphere. Every single person I've introduced this restaurant to has loved it! Not the cheapest meal but well worth it. As a vegetarian I highly recommend the chilaquiles with soyrizo- it's truly second to none.", "pics": null}}, {"review": {"des": "This was hands-down one of the best service experiences of my life. When we got to our table, they had a basket of toys and two bowls of fruit ready for the 4-year-olds in our party and pastry for the adults. The server was well-spoken and knowledgeable and did that thing that great servers do where she checked on us constantly, but almost never interrupted us to make her presence known. The food was above average for breakfast fare, but not mind blowing. It doesn't really matter. I'm not in Chicago very often, but I'd go back in a heartbeat for the overall quality that Tweet delivered.", "pics": null}}, {"review": {"des": "The food was filling. I personally didn't think the food was that good, but I be been called picky. the experience was great overall. The greeter even gave us cake as first timers. <br><br>I had a numero seis which is a steak burrito. And pancakes. They were alright. Nothing to praise but it was filling and not very expensive. I'd go back to try other things.", "pics": null}}, {"review": {"des": "Not only does Tweet offer the finest in Gluten-Free wonderfuls, they offer PUMPKIN pancakes in May. That's right, the tastiest, most flavorful, most delicious, most heavenly cakes on the planet. Inhaling the aroma is enough to know you're going down the path of wonder and there is no reason to return. The coffee is hot and robust, the ambiance is cute in a perfect way. It can be a bit crazy on the weekend, but if you have an opportunity to stop by during the week, you will be so glad you did. The best pumpkin pancakes on the planet. The spices are just right, nothing overpowering, but you know it's a PUMPKIN. Pared with a tiny bit of butter a few dribbles of maple syrup and whipped cream, although definitely not needed, this is one amazing breakfast. For those loving meat at breakfast, the bacon is pretty spectacular, too!", "pics": null}}, {"review": {"des": "The perfect brunch! Friendly crew, smooth operations, and good, healthy food. <br>Proper plates & cutlery (paper & plastic is so bad for mother nature) & not too cold inside (air conditioning can be such a curse) made the fifth star well deserved!", "pics": null}}, {"review": {"des": "I love this place! Highly recommend grabbing a spicy bloody. Grab a board game while you wait for your table because it's always packed here-for good reason. The food here won't disappoint!", "pics": null}}, {"review": {"des": "I came here thinking this place was a small whole in the wall but once I walked on I saw this place was pretty big. The hostess asked if we needed a gluten free menu so this place is gluten, vegetarian and vegan friendly! They even have tempeh! (Vegan bacon). Our server Teodore was amazing best server everrrrr !!!!! He was friendly and quick. Our coffee and waters were always full too. The mimosas here are delicious and made with fresh squeezed juices! And the food was even better and it came out super quick. Overall great experience if your Chicago I highly recommend this place! I wanted to add some photos but the app wouldn't let me but if the weather is nice sit outside the patio is beautiful", "pics": null}}, {"review": {"des": "Ok this was definitely an amazing find! I was not expecting the quality or amount of food we got. First off the place is kinda tucked away near Lincoln park in an older building with great character. When you walk in you can hang at the bar and get free coffee or order s mixed drink which was pretty cool. <br><br>Once your table is ready fresh baked breakfast bread is complimentary as is a bowl of fruit to start the meal off. The break comes normal or Paleo as does most of the menu. <br><br>We got the Gluten free steak and eggs, the gluten free pumpkin pancakes ( totally amazing) and the Lox platter which was HUGE and came a a great price. <br><br>The gluten free menu was extensive and everything on it tasted amazing. I can't say enough about the Pumpkin pancakes. I'd go back just for the pancakes to be honest they serious took the cake. <br><br>The prices are very fair for the portion size, the staff is attentive and the atmosphere is interactive. This place is s home run!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gmP_f9Eg7AKAcKJv_ScFvg/348s.jpg", "caption": "Gluten free pumpkin pancakes, Lox Platter and Steak and eggs"}]}}]}