{"name": "twin-anchors-restaurant-and-tavern-chicago", "reviews": [{"review": {"des": "Anything that was a favorite of Frank Sinatra's is good enough for me!<br> <br><br>Absolutely love Twin Anchors, and not just for the food. The atmosphere here is just unlike most places in Chicago. Absolutely love it! Service is unlike any other and that is saying something since we had a party of 7+. <br><br>Secondly, be sure to get the ribs. Just do your mouth and taste buds a favor and do this. Otherwise you will leave here with severe regrets. <br><br>I was just sitting here thinking it's been a little while since I've gone here, and now I think I'll be going here this weekend for sure.", "pics": null}}, {"review": {"des": "This place is awesome!  When you walk in, you really feel like you're in Old Chicago.<br><br>I got the full-rack of ribs w/spicy bbq sauce and onion rings.  Seriously good food, good beer, good times!", "pics": null}}, {"review": {"des": "Been going here for 25 years .. very disappointed <br>Worst ribs ever.. asked for them charred coming out <br>Steamed and taste like they were sitting in grease <br>The portions for a full rack ..24.00 looked like mini riblets ... baked potato was brown  .. the onion rings which usually fab were cooked in old nasty oil .. <br>This place was a institution at one time ..... they need to get it together .. too much competition out there for us to spend 75.00 for a bad meal<br>The servers didn't do a thing but take the order the super nice bus boy did everything .. hope he got part of the nice tip my husband left .. why I asked my husband did u Tip her  .. should have given it to him !!!!  Not going back <br>Sad", "pics": null}}, {"review": {"des": "As if this establishment needs me to give it a higher rating! Twin anchors is simply the best local restaurant for ribs and barbecue you will find if not in the entire city of Chicago I would argue the entire state of Illinois. If you are looking for a consistently outstanding experience in a local tavern this is your place. Don't just go to all of the popular places in town. If you are here for one night or five nights you must go to twin anchors. let's break it down:<br><br>Atmosphere 5 stars - This is not white tablecloth. It's a tavern that will take you back to the 30s. I have been there multiple times and eaten at the bar to be waited on by the same woman who is pleasant and inviting.  Tonight was unique because there was no weight and not a crowd. However, if you go later in the evening and certainly on the weekend be prepared to wait over an hour. My only advice is that every minute you wait is worth every minute you wait.<br><br>Service 5 Stars - I have never had a bad service experience. All the wait staff is very helpful and knowledgeable about the menu. I also like the fact that their beer selection is very local.<br><br>Food 5 stars - if I could give this 10 stars I would. If you go please please please order the ribs. I have not tried any other item because I cannot get past the ribs. I am from the south, and these are the best ribs you will ever put in your mouth. As the side I would highly recommend the baked beans but you can never go wrong with the fries.<br><br>Value 5 Stars - I had two beers a half rack of ribs an additional side and my ticket was less than $30.  For the quality of everything you get.<br><br>Simply stated if you are in Chicago get your ass in an Uber and head to Sedgewick to the corner bar known as twin anchors. You will not be disappointed.", "pics": null}}, {"review": {"des": "Everybody has their favorite rib joint. This is mine. Twin Anchors bakes their lean baby-backs slowly for several hours before grilling, so some of the fat has a chance to cook off. The meat is moist and tender and falls off the bones. A half order is plenty for me, but my friend usually gets the full and polishes it off with no problem. <br><br>You can order Zesty (sweet) or Prohibition (spicy) sauce.  I'm a rib purist of sorts, and I don't add any additional sauce because the meat is seasoned so perfectly when it comes to the table.<br><br>Lots of sides to choose from. I usually order the fries or baked potato, but you can't go wrong with any of them (except the creamed spinach, which I guess it an acquired taste). Wish the portion of slaw they give you was bigger.<br> <br>But there's more here to like than the ribs. I order the barbeque chicken with a plain baked potato when my jeans are too tight. And the pulled pork sandwich is terrific. Never ordered a burger here, but they look tasty coming out of the kitchen. I had the filet once and wasn't impressed.<br><br>Twin Anchors looks a little like a dive bar, but it isn't. You can tell from the photos that this is a neighborhood place. Been In the same spot in Old Town for over 70 years. Family run, which shows in the atmosphere and service. This isn't a big place, but the long mahogany bar helps if you have to wait for a table. Don't like to wait? Visit during the week. There's a small area outside for dining but have never used it.<br><br>A lot of Chicago history has taken place here. If you want to learn more about it, they have an excellent website with info on Sinatra and his gang, Emeril, celebrity fans, and the movies shot here.<br><br>I used to live near Old Town, and this was very convenient, so I came a couple times a month. Now I'm a few miles away, and it takes more of an effort. Don't come as often, but it's always an effort worth making.", "pics": null}}, {"review": {"des": "Really amazing food, in a lively atmosphere, with solid service. We had a group of six on a Friday night, and we were accommodated nicely. I ordered the half-rack of ribs, and two of my friends were hungry, so they ordered the full rack, but neither of them could finish it.<br><br>I also ordered a manhattan and an old fashioned cocktail, and both were solid and well made.<br><br>My only gripe is parking... holy smokes, don't even try to drive here. Just rideshare. There was a sign for valet parking out front, but we never saw the valet. We ended up parking a couple of blocks away.<br><br>The service was really attentive and spot-on, and much more on point than the fancy restaurant we had eaten at the night before.<br><br>The only reason I can't give five stars is because in a town with Michelin starred restaurants, I don't want to give a false impression, but Twin Anchors is five stars in its category.", "pics": null}}, {"review": {"des": "I was insanely surprised and impressed with my experience at Twin Anchors! After months of driving past it multiple times a week, I thought it was just a dive bar. Now, don't mistake what I'm trying to say here: I've been wanting to visit for a very long time *because* I thought it was a dive bar. I love dive bars. But this past weekend I learned that it's a RESTAURANT that supposedly sells some of the best ribs in the city, so I MADE time for Twin Anchors as soon as possible.<br><br>Sedgwick St was unusually busy this past Saturday because of the Old Town Art Fair, so I was a little worried about having to wait when we arrived around 1:15 or so for lunch. But I once again wasted my energy on worrying, because we waltzed right in and were seated immediately in the back dining area, with many open tables around us.<br><br>The inside of Twin Anchors definitely had that divey feel I was expecting, but it also had a lot of charm: A giant frame that fittingly held two anchors, wooden walls throughout, very interesting bathroom doors, and frames all over the place showing who has dined within its walls. I had no idea a very famous scene from \"The Dark Knight\" was filmed inside, but we were seated next to a few frames that gave us a lot more info on that collaboration. SO cool.<br><br>Anyone can tell from the outside that Twin Anchors sells alcohol, but they've got a few more beer items than most divey bars tend to have. I ordered a Lagunitas Aunt Sally, which I'd never had before, but is a sour beer that tasted amazing. Our waiter immediately brought out a basket of bread, packaged breadstick crackers, and butter as well.<br><br>My boyfriend and I ordered Twin Anchors's signature meal: Ribs! We each got a half slab: I ordered the zesty/milder sauce, while he went with the Prohibition-style, which was more spicy. I had a little taste of the Prohibition-style ribs, and they were FAR too spicy for me, so fair warning! The thing I really appreciated about this meal was that it came with a side of my choice (I went with a baked potato), along with a pickle and slaw. Sure, the ribs were a biiiit pricey ($17 for a half slab, $24 for a full), but when you've got a famous dish and a touristy spot, it makes sense that the price is hiked up a bit.<br><br>Since it looks like a dive bar from the outside but is a fully functioning famous ribs spot inside, Twin Anchors taught me to never judge a book by its cover. If you're looking for a sort-of hidden gem in Old Town/Lincoln Park, Twin Anchors should be your go-to spot to impress! Cheers!", "pics": null}}, {"review": {"des": "Good ribs in a great setting steeped with history. This place is tucked in an area of Lincoln Park that is mostly residential, it is worth the trek to. Each time I have gone here, the wait has usually been about an hour so be prepared to wait.<br><br>While this establishment has a varied menu, I have only had the ribs here. The ribs are amazing and fall off the bone. My favorite part about the ribs is eating them with the prohibition sauce which is just right with a hint of spice. If they bottled and sold that sauce, I would totally buy some! The sides they serve with the ribs are all pretty good. I enjoy having either the beans or the onion rings as my side. I usually come here with a couple other people and what we do is we each order a different side so we get a little bit of everything!<br><br>I will definitely be back for the ribs and maybe one day I will try something else! But the ribs are too good!", "pics": null}}, {"review": {"des": "I was looking for a good place for dinner before seeing a show at Second City, and thought the menu here sounded pretty good. Perhaps I should have gone with the ribs as many people around me were, but I wasn't feeling it at the time. I had the fish fry and it was just alright. The cole slaw had way too much mayo making it inedible. The potato was fine, but I prefer loaded potatoes, so it was too plain. I was however pleased with the service while sitting at the bar. I also appreciated the history of the place, and it was neat to see the celebrity photos of who have visited here throughout the years. Notable for me is Jason Alexander since I'm a huge Seinfeld fan! Not sure that I would give it another chance when I'm back in town though.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0PXU_kBOJgfYEmUD38VQbw/168s.jpg", "caption": "Fish Fry"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RXxGTzz3xHHVTTZhp4UutQ/168s.jpg", "caption": "Chicken tenders"}]}}, {"review": {"des": "Came after a Bears game which is usually a busy time for them and there was actually availability to be seated immediately. Service was (ad always is) friendly and prompt with lots of post-game goers getting grub. We got chili, ribs and onion rings and everything came out hot and quickly. Big enough portions and the prices can't be beat.", "pics": null}}, {"review": {"des": "I'd give this place 5 stars on the service alone!  It feels like you are totally at your families home and they are taking great care of you!  This was some of the best service I've ever had!  I can still hear the little old lady who was our waitress asking if we want a side of zesty or hot sauce!  <br><br>Went here after a failed dinner experience at another place!  When you go here you feel like you're walking into your grandmas kitchen for a good old dinner.  We came here as my friends wanted me to try a different type of bbq place.  <br><br>I ordered the full slab dinner with zesty sauce.  This place does bbq different where they start out by cooking the meat in the oven to get off some of the fat and grease before putting it on the grill to finish up.  The meat was super tender and the full rack had about 13 bones on it.  We for sure needed the extra sauce here to put on the bbq.  <br><br>As a side I got the onion rings but a friend got the creamed spinach and it was by far the best side!  It tasted like heated up Spinach dip and was very good. <br><br>This place is pretty cheap. <br><br>Cons would be that they use a country style rib so they are not big and meaty but more smaller.  This place is not super fancy but it's okay.  Finally it needs a sauce on the meat and I wish it didn't.  <br><br>Overall a great first time here!  Great service and great food!  I would for sure recommend!", "pics": null}}, {"review": {"des": "I love old-school places, and Twin Anchors has exactly the sort of ambiance I expected from a place where Frank Sinatra dined. It looks untouched by time, which is just the way I wanted it. I wish the service and food had measured up. <br><br>First of all, the service was rushed--really rushed. We placed our order, including a salad, and the salad arrived in less than a minute. Then, the main course arrived minutes later before I'd eaten even a quarter of the salad. From the time we sat down to the time we got the check was 30 minutes. I get this is a popular joint and they want to turn over tables quickly, but a dinner that hurried is not pleasant. <br><br>As for the food, people seem to rave about the ribs here, and I wonder if they've had other ribs. I've had better in Chicago. While they fell off the bone, they were not particularly tender or tasty. The BBQ sauce provided was excellent, but the ribs rely too much on the sauce.  The salad was average (what little I had before our dinners were raced out to the table.) The best things about the meal were the ambiance, the drinks and the perfectly-prepared baked potatoes.  My wife had the chicken and ribs, and she found the chicken tough. <br><br>Twin Anchors had the old-fashioned mood I wanted. The food was disappointing the hurried pace was frustrating. <br><br>Twin Anchors doesn't take reservations.  We arrived at 5 pm on a Saturday and found the dining room mostly empty, but by the time we left little over a half hour later, the dining room was already filling up.  Plan to get there early or wait.", "pics": null}}, {"review": {"des": "I loved this place. Came here after a show at second city (tourist) to try the ribs and it did not disappoint.  There are plenty of new hip restaurants in Chicago but I can get that at home. Twin  Anchors provides that ambiance you can't really recreate. Part neighborhood bar part old school restaurant, highly recommended. Had a good selection of beers and games in tv over the bar.", "pics": null}}, {"review": {"des": "This restaurant is famous for ribs and it's reputation goes back to the days of Prohibition and even before that.<br>Frank Sinatra liked to eat here with his pals back in the day.<br>The ribs and chili are absolutely DELICIOUS.<br>We will be back again soon..", "pics": null}}, {"review": {"des": "A great old school restaurant with history, amazing food and quick service once seated. If you go at peak times expect to wait at least an hour at the bar, however the bar staff are very accommodating and there is plenty of room to stand or sit.<br><br>The wait is definitely worth it..", "pics": null}}, {"review": {"des": "So we came here tonight for my birthday dinner.  I love the atmosphere of this place; it's old school and reminds me of places I might have gone to when I was a kid.  Okay, so first all the good.  Had the Autumn Mule cocktail which is, essentially, a Moscow Mule with a cinnamon stick in it and, for some reason, the addition of the cinnamon stick made it taste so much more sharp and tasty than a regular Moscow Mule.  The french fries were piping hot and fresh, great cole slaw, and my cheesecake dessert was dense and just perfect.  My partner had the strip steak and I had a taste and it was delicious.  I so wished I would've ordered that.  Which leads me to the bad:  the ribs.  They were barely warm so that, by the time I was finishing eating them, they were starting to get on the cold side.  The meat was tender and fell off the bone and the sauce was good but, ultimately, I've had so much better at so many other places.  I ordered them because it's what this place is known for but they were the most disappointing aspect (only disappointing aspect) of the whole meal.  I make better ribs at home myself.  I did like the place and I will come back and order that steak but I just am baffled as to why and how this place is known for their ribs given what I ate tonight.", "pics": null}}, {"review": {"des": "It's been many years since we've been to Twin Anchors. Nothing's seems to have changed to the place. <br><br>I recall the ribs, to my taste, as not being great. And in this area, Twin Anchors remained the same. <br><br>It was lunchtime on a Saturday. They were nearly full. We got lucky and we're seated right away. Our waiter was cheery and helpful. <br><br>I order a half-rack rib meal. For my side, I chose their homemade zesty baked beans with pork.  The meal also came with a tiny order of creamy coleslaw and a pickle spear. <br><br>My wife ordered a side salad and a cup of their acclaimed homemade chili. We shared both meals. <br><br>The ribs, as mentioned above, we \"just okay\". They were tender and meaty, just not my style. But I ate them nonetheless :)<br><br>The real star in my opinion was the beans. I also really enjoyed their Prohibition BBQ sauce. Lots of kick. I added it to the ribs and the beans. <br><br>Twin Anchors has been here since the '30s and is likely to remain a neighborhood restaurant and bar for a few more decades. And while the ribs weren't \"my style', in 5 years, we'll come back, just for the tradition of it.", "pics": null}}, {"review": {"des": "Ever since I watched the movie Return to Me, I've wanted to eat here...and finally many years later, I had dinner here this past weekend.  We got there right at 5 pm in order to snag an outside table and I'm glad we did.  It was a lovely night to sit outside and enjoy.<br><br>For drinks, we started with a glass of Rose and the Mexican 75 - tequila and prosecco mix.  I loved the Mexican 75 and would get that over and over!<br><br>We got the ribs - delicious fall off the bone ribs with no fat - exactly how I love them!  I got the Zesty sauce and my husband got the Prohibition sauce.  We both loved the spiciness of the Prohibition sauce and would highly recommend that to everyone.  I got the Onion Rings (just okay) and my husband got the Pepper Jack Creamed Spinach which he then added the Prohibition sauce to and loved it.<br><br>Our server was wonderful and so extremely nice, and we would definitely come back for the ribs and drinks.  It was a wonderful night!", "pics": null}}, {"review": {"des": "\"This is my kind of town, Chicago is<br>My kind of town, Chicago is<br>My kind of people, too<br>People who smile at you\"<br><br>-Frank Sinatra<br><br>Every time I step foot into Twin Anchors I can only help but have this song play through my head over and over again. Walking into this Lincoln Park institution makes me think I'm going back in time to the late 1940s, post WWII. I just got back from my service and there's only one thing I want, a giant slab of hot ribs. <br><br>I'm going to be blunt here, if you're coming to Twin Anchors and you don't get ribs, then I you are not getting the right experience. Their ribs are one of a kind - I honestly have no clue whether they smoke them, grill them, or bake them and I don't really care because they are amazing. <br><br>The prohibition sauce is one of a kind, it starts off very spicy, but with each bite it becomes less and less spicy. It may be the tolerance you build with each bit, but the phenomenal tang and flavor overpowers the hotness. <br><br>Pro Tip - end your meal with a shot of malort, it's the best way to digest the entire cow you just ate.", "pics": null}}, {"review": {"des": "Cool little neighborhood tavern in old town. Good for kids, so don't feel like you need to leave them at home. If I lived here I could see myself coming here to hang out at the bar with some friends. Overall the experience was fine, but I was less than impressed with the food we ordered. Ribs were way overdone, bordering on dust. Burgers were good, but a medium burger came out medium well. Neat place though.", "pics": null}}, {"review": {"des": "Ridiculous ribs, literally fall off the bone. I took my friend and our two dads here. Both Frank Sinatra fans and loved the history of the place, so it was obviously a hit. I would recommend this place to anyone and I'm so happy that I finally got to try it out. The wait was about an hour long for a table of 4 on a Friday night, however it was extremely worth it and I'll definitely be back.", "pics": null}}, {"review": {"des": "Fun old school restaurant clearly with a lot of history. Place was from the 30s/40s which was cool, and they had been making their ribs the same ever since.<br><br>The only move according to the waitress was to get the ribs so I complied. I got a full rack with zesty sauce and prohibition (spicy) on the side. The meat was really tender and charred to perfection. The sides of fries and cream spinach were great too, and a good balance with the meat.<br><br>The service was outstanding, and we were not rushed at all like we thought we may be.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Wt3eGmlC7ZqaXajvc5mQKA/348s.jpg", "caption": "Ribs with fries and pickle."}]}}, {"review": {"des": "BF and I were going to a show at Second City and stopped here for dinner because it was in walking distance. Restaurant had a lounge vibe to it and we had quick seating. Our server was the sweetest lady ever. Water was always full. Food brought out crazy fast. Decent menu and good beer menu. I had the fish fry for 15$. It included 3 good sized pieces of fried cod. A small standard cup of slaw and a hefty portion of crinkle cut fries. I would get it again. We told her we were rushed with the show time and she had our ticket at the table in no time. Would return if in the area again but probably wouldnt go out of way for.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pQsMgb2H8zCxXM06xfhR9g/348s.jpg", "caption": "Fish fry $15"}]}}, {"review": {"des": "Best ribs in the city, get the zesty sauce. Fall off the bone without any effort the menu is large but really there is only one item needed. To anyone complaining about parking, its the city so take the CTA the Sedgwick stop is not even two blocks away. Its a neighborhood classic show it local support.", "pics": null}}, {"review": {"des": "Always packed but worth the wait. Twin Anchors is a small neighborhood bbq joint that draws crowds from across the country. There is a lot of history on display, plus trivia for movie fans (on both the walls and menus). For seating, you can snag a chair at the bar and catch a sports game, or put your name on a list for a table or booth. Be warned: no reservations means you could wait up to 90 minutes like we did, and it can get very crowded! There is additional outdoor seating in spring and summer, but half the fun is being inside and reveling in the 1930s/1940s Chicago atmosphere.<br><br>The main event is the ribs. I'm not a big meat eater, but the full slab is enough to make vegetarians change their minds. The pulled pork sandwich with prohibition sauce was tasty, and a variety of traditional bbq sides made for a hearty meal. Twin Anchors has long held its own in Chicago, but in my opinion, contends with the best bbq in the US.", "pics": null}}, {"review": {"des": "The cheeseburger was great! Comes with a bread Basket, french fries a tiny bit of coleslaw. However I think the price rating should be three dollar signs. Cheeseburger and a coke was $21 with the tip.<br>Maybe I'll get the ribs next time if I'm going to spend 20 bucks lunch. Maybe you should open an hour earlier and close an hour later. The Limited hours are causing the rush", "pics": null}}, {"review": {"des": "Went back on 10/8/18 for our grandson's 8th Birthday- his choice of restaurant. Our server was Deborah and she was excellent- friendly and full of energy. All four adults had full orders of ribs with Prohibition Sauce and the Birthday Boy has the Kids Ribs with fries. As usual, the ribs were delicious and the onion rings were super tasty. One of the adults had the baked beans for a side dish, and they were wolfed down in no time. When we were done with our ribs, Deborah brought out a slice of cheesecake with chocolate syrup and everyone sang Happy Birthday for our Grandson. Everything was perfect- swift service, tasty ribs and sides and cold drinks. We'll keep coming back again and again.", "pics": null}}, {"review": {"des": "One of the most overrated restaurants in the city. Their ribs are tender because they are boiled! They aren't smoked as nature intended. This is a trendy Lincoln Park crowd of yuppies drinking over priced swill masquerading as beer. If the staff doesn't know you, don't expect much kindness.", "pics": null}}, {"review": {"des": "Love this old school place. Staff/service is great and the food is awesome. The Prohibition sauce is the best!  Has just the right amount of sweetness and hot kick!", "pics": null}}, {"review": {"des": "Let me be honest, there isn't much that would make me want to move to Chicago (sorry... cold... traffic), but Twin Anchors does.<br><br>First, this is the quintessential Chicago and American bar and grill.  It looks like it hasn't changed much since 1932, because it hasn't.<br><br>Second, the rack of ribs, cole slaw, and pepperjack creamed spinach were phenomenal, as is the Prohibition Sauce - thick, sweet and a lingering, surprisingly spicy finish.<br><br>Third, they are located a quick 3 block walk from Second City.  I had a great meal and cocktail at Twin Anchors, then walked around the corner for world-class Improv comedy.<br><br>Very friendly staff. Great prices.<br><br>All in all, a really nice night in Chicago.", "pics": null}}, {"review": {"des": "Great place for ribs and great customer service. Enjoyed the history on the wall as well.", "pics": null}}, {"review": {"des": "The best thing about this place, it has a cool backstory. Is it old school cheesy inside? Absolutely with a capital A, part of it's charm. <br>Located in a nice neighborhood with no parking outside of permit. So you either Uber it, valet for $11 or you find meter parking on North. <br>Driving can be challenging in this area prime time weekends, what with all the foot traffic, bike lanes, and cars passing you on side streets, it is very stressful to navigate, almost like running the gauntlet, so I would advise more caution than normal. <br>The ribs are the go to here, I was not up for that much food so opted for the burger instead. It was a good burger. I also opted for the beans as my side, they brought out some of their bbq sauce so I threw some of that in with the beans. Even the coleslaw was good. Was not impressed with their fries. The old nasty frozen meaty krinkle kind, not a fan. <br>I sat outside and the space is tight. Good selection of beers to choose from, although you will pay about 1.50 more for them. Is it overpriced? Yes. <br>My advice, If you are not coming for the ribs, then you may want to keep going.", "pics": null}}, {"review": {"des": "Found this on Yelp.  Bartender picked me a beer based on my preference. I asked him if the ribs were good.  He said \"order them\". I did and was not disappointed. The meat fell off the bones.  He even let me upgrade later to a full rack.  I liked their regular sauce.  Not a fan of their spicy option.  Too sweet.  Love the ambience. Not the ritziest of places, but clean and the employees are super nice.  Bathrooms were spotless clean.  Bartender was the bomb.  Guy with a beard but can't remember his name. Awesome dude.  Going back tomorrow because I am here on business. TRY THE RIBS, PEOPLE!", "pics": null}}, {"review": {"des": "The famous Ribs were were the most dried out, tasteless barbecue ribs I've ever had. The micro wave must be working overtime. If you're looking for BBQ ribs try elsewhere. Eat hear at you own disappointment. And I must also mention overpriced.", "pics": null}}, {"review": {"des": "Sinatra's favourite Chicago rib place is always a treat. <br><br>Good atmosphere and good food. <br><br>I usually ask for the sauce on the side because they give you so darn much.", "pics": null}}, {"review": {"des": "Came here for the first time after hearing about how good the ribs were. We came in with a party of 4 on a Saturday evening and the place was so crowded it was hard to move to the front to ask for a table. Walking inside you get the feel of a dive bar that is somehow extremely crowded. We waited around for an hour before finally being seated. We got placed behind the waiting area and it was much less crowded.<br><br>The waitress immediately took our orders. We all came to eat the ribs so as we got drinks we also ordered our meals. I got the full slab of ribs with a side of fries topped with the prohibition sauce. It only took about 20 minutes for the ribs to come out of the kitchen, which was good considering the amount of people in the restaurant at that time. <br><br>The ribs lived up to their reputation; extremely tender and the meat falls off the bone. The prohibition sauce is labeled as spicy but don't be fooled, it is not. It leaves a nice lingering taste that pairs well with the ribs.<br><br>If you are feeling like eating ribs and are fine with a wait, I would recommend eating at Twin Anchors.", "pics": null}}, {"review": {"des": "My favorite ribs joint.  If you like the kind of ribs that fall off the bone, you'll likely love this place.  I often make a point to visit when I'm in Chicago.  You have to go with the zesty sauce (it's really not spicy...just sort of tangy).  Also, the prohibition sauce is amazing but it is super spicy.  It doesn't seem like it, but it quickly catches up with you like a slow burn.  The crinkle fries are also great.<br><br>They don't take reservations, so on the weekends especially, expect a bit of a wait.  But you can just order a drink at the bar in the meantime.  The parking is nearby is challenging because it's in a neighborhood that requires a permit, so I would try not to drive, or if you must, I'd recommend using their valet service just because it's so much easier (though I don't think the valet is always available...probably just during peak times).<br><br>Lastly, it's only a couple of blocks from Second City, so if you are looking for a \"dinner & a show\" kind of evening, it's a great combo.", "pics": null}}, {"review": {"des": "I've been coming here for 15+ years. Always been my favorite rib place. Yesterday was one of the worst experiences I've had there. I ordered my ribs half slab charred with zesty sauce, not spicy at all, and they came out with the prohibition sauce, which is super spicy. I can't do spicy and I told the server about the sauce. He took it back and said they were making new ones. The \"new\" ones came out in minutes and still tasted spicy...like they just wiped the prohibition sauce off and brushed it with zesty. I had my mom try it and she said it was still spicy as well. I couldn't even eat it. I just ate the onion rings and called it a night. The kitchen staff needs to be talked to about not being lazy and to just redo the meal the right way. All in all, I've usually had great meals here but this time was pretty bad. I will be back, I'm sure, but just not for awhile.", "pics": null}}, {"review": {"des": "I don't give five stars, that's my rule.  Too bad, this place gets five stars.  Why?<br>1. It is off the beaten path.  You are not going to happen by it, and even if you did you wouldn't stop in.  You only go here if a friend tells you how awesome it is. <br>2. Barmaid and atmosphere very friendly.  They have a bottle with a sock puppet on it and a sign that says \"Mystery Shot $2\".  We drew straws and the short straw did it.  Some kind of minty Vodka.  Horrible booze, but a great laugh!<br>3. The slogan, \"Positively, No Dancing\".<br>4. Frank Sinatra went here all the time.  There were also a bunch of movies filmed in here. <br>5. Most flavorful ribs I've ever had, and I've had ribs in KC and Memphis and Dallas and NYC.  <br>6. Prohibition sauce -- just the right kick.  I want to shower in it.<br>7. Great atmosphere -- a small classic Chicago tavern with friendly folks, great food, good service.  <br>8. The ribs were awesome.", "pics": null}}, {"review": {"des": "Little neighborhood place with awesome service and excellent ribs. This place has soul and you can tell it.", "pics": null}}, {"review": {"des": "I can't believe it's taken me this long to review Twins. <br><br>Saying that Twin Anchors is incredible is doing them a disservice. Twins it, by far, the best restaurant in Chicago. There's a reason it's almost always listed on the Michelin Guide's Bib Gourmand list -  \"quality food for good value\" sums this place up to a T. <br><br>Twins has the best ribs I've ever had. Hands down. The tenderness and smokiness of the ribs as well as the amazing flavor of their sauces (zesty all the way) is always a treat. We always bring folks here when visiting from out of town, and it's a birthday dinner staple as well. I can tell that this Chicago icon is here to stay, and I'll definitely be along for the ride.", "pics": null}}, {"review": {"des": "Best ribs in Chicago. The rib meat falls off the bones and melts in your mouth. I was here approximately a month ago and I honestly can't stop thinking about these ribs! Must go back soon.", "pics": null}}, {"review": {"des": "A lot of reviews say how busy it can be and I've heard there's usually a wait but we went after there was a lot of snow around 1:00pm and it was pretty empty which was a nice surprise since we were expecting a wait. The waiter was friendly and tentative, had a nice selection of beer and the food was good. The ribs are their famous dish, I tried my boyfriend's ribs and I must say they were fall off the bone good. I got the chicken entree with the spiciest sauce (can't remember the name of it) and it was really good. The sauce was really flavorful and had a nice kick. I would recommend!", "pics": null}}, {"review": {"des": "I came here with some coworkers and my manager when visiting Chicago. Not to confuse this with Twin Peaks, as I had originally thought it was called (which is a completely different atmosphere and perhaps not appropriate for a coworker dinner),  I do LOVE the atmosphere of Twin Anchors though. This restaurant has been around since the 1940s and they have kept the old-school, retro decor. It's very charming and cozy and you can just breathe in the history. <br><br>The ribs are pretty good, a little on the smaller side and not a lot of meat on the bones, so if you are feeling hungry you should opt for the full rack. Not to worry though, if you get the half and want to add on, they will do that for you and you can just pay the price of the full rack (instead of two half racks, which will cost you much more). Admittedly, this is not the BEST ribs I've had, but they are decent. The meat falls easily off the bones and with the sauce it is perfect. The spinach side was also great, but very heavy on its own.  It kind of reminds me of a spinach dip appetizer that you would normally eat with pita chips or bread. <br><br>I think what pushes this place to four stars is the ambiance. It's worth a visit if you are ever around old town!", "pics": null}}, {"review": {"des": "This is my favorite spot for ribs in chicago. Their prohibition sauce is sweet but spicy, I like to add it to their regular sauce. Onion rings are my favorite side. They are perfectly crisp and go great with the prohibition sauce.  There is usually a wait and they don't take reservations but it's definitely worth the wait. Service is always friendly and fast.", "pics": null}}, {"review": {"des": "This place is amazing. Came here with 3 other people (been here before) and the wait was less than an hour. I'm not sure why you would order anything but ribs here. Full slab for the win. Our waiter was in a bit of a rush whenever he came to our table so I had to ask for a refill twice, not too big of a deal. Back to the food - fall off the bone ribs and every sauce they have is good. Prohibition sauce is my favorite. I highly recommend this place, a scene from TDK was shot here and Frank Sinatra used to come here, it has to be good :-)", "pics": null}}, {"review": {"des": "Historic Chicago restaurant, dates back to the 1800s.  Very relaxing neighborhood establishment, family-owned with pictures on the walls of famous celebrities who have been to this restaurant.  It has a decent bar and back area where you can dine with some long tables and an outside patio.  It was a Sunday and it was pretty busy in the evening.  It's casual dining at its best.  We enjoyed your Famous Ribs but everyone seems to come there for but they also had decent-looking burgers and sandwiches. The onion rings looked fabulous. I didn't try the onion rings but I saw them and they did look good.  Caesar salad was tasty and enjoyable.   Now to the ribs, they were  just the right amount of tenderness which some crispiness on the outside, charred nicely.  You have a choice of three different barbecue sauces. We tried two of them. One was kind of tangy  and the other more plain.  I actually liked mixing them both which made sauce that I prefer.   Come on over to Old Town for some down to earth cooking and friendly staff. Don't forget don't forget to vote Yes if you liked my review very much appreciated thanks a lot. Love Chicago!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RUuDtNBV2H6mG3CYHCPswA/348s.jpg", "caption": "Yummy for the tummy!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/szNbPhIUiSeszLe-hD79gw/168s.jpg", "caption": "Family memorabilia on the walls"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uRLb9PUTkXy2icDu1SNL8w/168s.jpg", "caption": "Neighborhood type bar"}]}}, {"review": {"des": "This place is so great! I come here with my family at least once a year when everybody's in town, but I wish it was more!<br><br>Let's start out with the general vibe. TA is exactly the kind of place it claims to be - a tavern. There's old-fashioned booths and the bar is long and narrow. Makes sense, seeing as this place used to be a speakeasy. There's always a long wait, but when you're waiting at the bar (with the great, knowledgeable bartenders), it doesn't feel like a wait at all. <br><br>Once you sit down, the real party starts. they take your drink order with lightning speed, and everything gets to you as quickly as possible - even when the place is  packed during a Hawks game. They're always so friendly too, as if you're their only table. I love that. <br><br>Then the food comes. Ohhhh boy. If you're not getting the ribs, you better rethink that, but its OK since everything on the menu is delicious. My personal order is a slab of ribs with zesty sauce and baked beans. But the onion rings and creamed spinach are also great choices for sides. The dessert is also great - they have Eli's cheesecake on tap every night. It's so great. <br><br>I can't wait to come back here again. I'm getting hungry just writing this.", "pics": null}}, {"review": {"des": "Prohibition sauce is my jam.. so good. <br>Ribs are pretty damn good but honestly anything would taste great with that sauce.<br>Chicken tenders are big and juicy, but my fave is the ribs.<br>Cozy atmosphere that's perfect for a cold winter night in Chicago.<br>No frills place with good food.. can't go wrong", "pics": null}}, {"review": {"des": "Love this place! The best ribs in the city and I love the onion rings here. I typically try to save my Twin Anchors visits for non-peak dining hours since they do not take reservations and there can be a long wait during dinner time. The bar area is cozy and the interior makes you feel like you're in a boat.", "pics": null}}, {"review": {"des": "In town for a convention and ate here per the recommendation of a local. 20 minute wait on a Tuesday night but feel free to make the time pass quicker with a few drinks at the bar first. <br><br>Everyone at our table ordered the ribs and there was not a morsel left at the end of the meal. Get a full rack of fall off the bone ribs for $24 or half a rack for $16, comes with a side of cole slaw and choice of fries, baked potato or onion rings. All are good options (the onion rings are hot, crispy and delicious!) You also get a choice of sauce, all good options as well depending on your preference.<br><br>Our waitress was super attentive, nice and down to earth. Couldn't ask for a better meal in Chicago!", "pics": null}}, {"review": {"des": "I love this place, my go to spot when in Chicago. Ribs and onion rings, no discussion. Just awesome. Cool old style vibe that makes going back cool. They always have a great beer list.", "pics": null}}, {"review": {"des": "I'm such a fan! Great service, delicious food, and steeped in Chicago history. Went there on Father's Day and although there was a bit of a wait the bartender took great care of us and we had a beer. When we got seated not to long after, I got a slab of ribs and asked for the Prohibition Sauce. The meat falls right off the bone! My friend got shrimp that were HUGE and we shared everything. Best meal I've had in a long time! Highly recommend and would come back in a heartbeat.", "pics": null}}, {"review": {"des": "Best ribs in Chicagoland ever!! You don't need the menu, just order the fall off the bone, smoked for hours RIBS. Zesty sauce. Even the coleslaw is great. Truth is: Almost don't to want to tell you about it, cuz it is busy enough. Been around for over 70 yrs (that says something this age of places coming and going) Celebs love it, movies have been filmed here. Comfy, nothing fancy, neighborhood restaurant / bar. TIP: Leave the kids and strollers at home with a sitter....and enjoy yourself. Sarah at the bar, Sureas the waitress (and Tina) and Mary Kay thanks for always a great evening, we live in the neighborhood and come about twice a month. Some jerk was giving them a hard time on July 4th, so I went up and shared with Mary Kay what a wonderful evening we had, and will be back again and again! We always bring out of town guests, they request it now ;)", "pics": null}}, {"review": {"des": "MINDBLOWING ribs. I mean last weekend I went and got a half-rack and have been mourning since. I won't make that mistake again. ALWAYS GET A FULL RACK.<br><br>The prohibition sauce is the best BBQ sauce I've ever tasted.", "pics": null}}, {"review": {"des": "Absolutely best ribs we've ever eaten had the zesty and prohibition sauces nothing else has ever come close to being this good plus the onion rings were also the best ever and the call slaw was killer definitely recommend this place Service was great as well places about 100 years old love these old-school places that learn how to do something great and last forever", "pics": null}}, {"review": {"des": "A Chicago institution worth visiting. Given Twin anchors is well known for their chicken and ribs, I was happy with my reasonably priced ($21) combo plate. They unfortunately don't have any healthy options for side dishes so I ended up with the onion rings to complete my pig out meal. Portion sizes are generous which made up for the 45 minute wait.", "pics": null}}, {"review": {"des": "My family has been going here for years. Hands down the best ribs in Chicago AND outside of Chicago. I have tried a lot of BBQ and I haven't found better ribs than Twin Anchors. The meat falls right off the bone and the Prohibition sauce has the perfect amount of heat. Make sure you try their onion rings too.", "pics": null}}, {"review": {"des": "Excellent ribs! The meat fell right off the bone! Great beer list and short wait for a seat and food!", "pics": null}}, {"review": {"des": "Walking home from Lincoln Park my family was  craving BBQ. Thanks to yelp we found Twin Anchors. I love that it's tucked away on a nice neighborhood street. Upon walking into the restaurant the low level lighting, wood paneling and non hipster vintage decor made me feel like I walked out of a time machine. <br>We went on a Saturday afternoon for late lunch. All the booth seating was taken so we were seated in the back. We were greeted immediately and the staff offered to take our son's scooter and rollerblades our if the way and put them back in the bar. <br>The menu is pretty straight forward. We ordered the pulled pork sandwich w creamed spinach and full rack of ribs with onion rings. The pulled pork was so tender and flavorful with their signature BBQ sauce. The ribs were falling off the bone and cooked to perfection. Normally I'm used to BBQ joints that have sides like collard greens, cornbread and etc. but this place just had sides of onion rings, fries, slaw and creamed spinach. Even though I like more southern sides when I eat BBQ, this place made up for that with their tasty BBQ meats. We will definitely be coming back !", "pics": null}}, {"review": {"des": "Everyone knows this place is awesome. The prohibition sauce is u like any other in the world. The ribs are delicious. The ambiance is perfect. Not too dirty not too pretentious. Drinks are perfect which means the bartender is perfect. Our waitress, can't remember her name, was the sweetest lady ever. Explained everything and anything for us. So why does this place lose 1 star? A few reasons. The ribs were fall off the bone. Now, most ppl think this is perfect, but no. I like my ribs with a bit of a tug. And I'm not sure if there they are supposed to be smoked, but it lacked smokiness. Still delicious though. I wouldn't have knocked down a star if it were just that. What did it for me was the policy that the entire party needs to be there to be seated. Or even request a table. We had 7 in our group  ur 2 of them were going to come 30 minutes after we got there. No biggie, I was thinking that would work well since there's usually a wait. But nope, they refused to take our request even though 5 of us were there and the 2 were on there way. Unfortunately the 2 felt bad and told us to get ourselves a table without them. They had to grab diner somewhere else. Other than that though, this place lives up to the hype. Just be sure to have your entire party there.", "pics": null}}, {"review": {"des": "We lived in Chicago twenty years ago and frequented Twin Anchors back then.  Great ribs.  We returned from SoCal two years ago and have been to the restaurant three times since then.  It was disappointing the first two times, inedible the third.  The rib portions (and actually side portions) are a fraction of what they were.  The ribs used to taste freshly prepared and, well, \"grilly.\"  Not anymore.  The ribs we were served tonight were half the size of those we remember and were cold.  We were told that they had actually been cooked the day before and that the chef had not brought the grill to temperature before heating them up. This is wrong on so many levels that, if it makes sense to you, come on in.  For those of us who actually like ribs, Carson's has moved to Streeterville, but they are still pretty good.  Asta la Vista TW.", "pics": null}}, {"review": {"des": "I came here for dinner around 6:30 on a Wednesday night and the wait quoted to me was 2 HOURS. On a Wednesday? I figured it had to be good. So I put my name in, and luckily only had to wait about an hour fifteen. <br><br>The place is kinda divey, but I think that's part of appeal. However, because it's so popular, it's also very crowded...even once seated, the tables seemed super close together and it was hard to make it to the bathroom through the people. Besides that, the service was great and despite the crowd, our waitress was very attentive. <br><br>The food - out of this world. I ordered the ribs (get a full rack. I don't care if you're on a diet or whatever. Get the damn full rack. I don't judge). Coupled with the prohibition sauce, which definitely has a kick to it but isn't unbearable, these ribs were amazing. The meat was tender and they were cooked to perfection. I ordered onion rings as a side, and they might be the best damn onion rings I've ever had. You know when you bite an onion ring and all the onion comes out and you're just left with breading and it's the worst? Not the case with these bad boys. You bite in and they're cooked perfectly and the onion stays in so you can finish the whole ring. <br><br>This place is definitely worth the wait. If you can deal with the crowds, you're in for a great meal!", "pics": null}}, {"review": {"des": "Solid American Bar and Grille with BBQ. If you picture what you expect from an American BBQ place, this place should come to mind. Her Royal Highness (wife) , my daughter had just left the Ginza Fest when my daughter pointed to this place and said that they had good BBQ. I asked the boss and she allowed it. I had BBQ sandwich, chili and a baked potato. All of them matched up to my expectations and since that is what I wanted, I was satisfied.", "pics": null}}, {"review": {"des": "I been here multiple times. Just sent my friend here from Texas.    Last trip I took some ribs to go, back to nyc.  Enjoy them that night.   I shall return for more ribs !!!", "pics": null}}, {"review": {"des": "Fall off the bone ribs like you read about.Lot of variety in the sides (beans and onion rings are great, skip the fries). Great beer selection and awesome atmosphere. Very busy, but after you put your name in, try to snake your way into a bar seat and enjoy this tavern for everything it is. Thank me later.<br><br>PS get prohibition sauce", "pics": null}}, {"review": {"des": "I've been here before and the wings were fresh and delicious.<br><br>I came with a friend Sunday afternoon and the wings and chicken tenders were room temperature. <br><br>I also don't mind paying $12 for a Bloody Mary but my god, it was weak as hell! <br><br>won't return", "pics": null}}, {"review": {"des": "Yes the atmosphere was old school/great but the ribs were not even cooked in a smoker, they're baked! Chicago is not a BBQ town so the customers don't know any better. And the side dishes were nothing special.", "pics": null}}, {"review": {"des": "Omg the ribs are amazing. Really that's all I need to say. You can get beer and cocktails like any other bar, but again let me focus in on the ribs. (Also, disclaimer: I've been here twice and only had the ribs.) Pork ribs by the way for anyone who it matters. They fall off the bone, you have three different sauce options. Get a nice side of your choice in addition to a pickle and coleslaw. And it's not coleslaw that too mayonnaise-y. But even if it is, it's free so you really shouldn't be complaining. Also great, chill, laidback atmosphere. Basically just a cool place to kick it and hang with your friends while enjoying bomb ass ribs.", "pics": null}}, {"review": {"des": "Best ribs in Chicago. If you like hot get prohibition sauce, if you don't get zesty sauce. Maybe get zesty even if you like hot.", "pics": null}}, {"review": {"des": "If someone asked me for a perfect example of an All-American diner this place would be it - simple yet cozy atmosphere, a wide selection of beer (especially happy with them carrying 3 diff brews from 3 Floyds), gigantic portions at reasonable prices, screens featuring baseball games, and serving all sorts of popular classics like wings, ribs, and burgers with sides such as fries, onion rings and slaws.... <br><br>We tried the wings in both zesty and prohibition sauce, and both were very good but on the sweeter side of the BBQ spectrum (another sign of being super American? =P). At first we were wondering if the prohibition sauce would be really spicy considering it contains ghost peppers, but in reality it's merely a hint of fire. The ribs also live up to the hype. So tender they fall of the bone! Only complaint is the fries it came with were very coarsely cut so it's not very crispy, but I suppose some people prefer it this way so to each their own. <br><br>The service was also extremely attentive. Highly recommend!", "pics": null}}, {"review": {"des": "The food is amazing. An excellent choice of beer, which is a bit surprising for such an old place. The atmosphere is cozy and the service is great. It's a Chicago landmark!", "pics": null}}, {"review": {"des": "They are quick, great service, and food is amazing. A staple for whenever I crave BBQ. Their prohibition sauce has the perfect amount of heat. I always leave with a bottle to take home.", "pics": null}}, {"review": {"des": "Truly a neighborhood staple Very tight quarters The waits can be long. So let's talk about the ribs. The bye a good domestic rib  Pound and a 1/2  to pound and 3/4 size  Fairly meaty  Good compliment of sauces", "pics": null}}, {"review": {"des": "I spent my bachelor days dining at Twin Anchors 50 years ago. It was great then and it's still great today. <br><br>Most restaurants change over the years, owners, menus, prices. Twin Anchors is still a neighborhood bar and restaurant, that offers just what we were looking for 50 years ago, and they are still offering it today. Small, cozy bar and dining area, convenient location, great ribs, reasonably priced wine and beer--my kind of place to dine. <br><br>It's been 50 years since I last dined at Twin Anchors, but it won't take me very long to return! <br><br>F. Coggin", "pics": null}}, {"review": {"des": "I came here a few years ago with my dad. His friend Arnulfo works there and he was an amazing host. The food is incredible and he told me all the stories about the place. Back to its Prohibition days and the movie scenes that were shot in that place. He told me about where all the stars used to sit and it was an absolute joy. The ribs were out of this world, years later I'm still salivating when I think about it. The atmosphere alone is worth the price. The food just knocks it out of the park. I miss you guys. I can't wait to visit again and eat there. Now that I'm old enough to visit the bar I'm going to spend some good quality time there. Thank you for the fond memories. See you in the future!", "pics": null}}, {"review": {"des": "I really wanted to like the place as a whole, but beyond the quaint look of the place, I have to say that the food was a little below average.  Very little meat on the ribs and the sauce was just not good.  Bummed.  I really wanted it to at least come close to meeting my expectations.  Sadly, it didn't even come close.", "pics": null}}, {"review": {"des": "LOVED IT here! Best ribs I've ever had-- and frank Sinatra could agree! Came early and snagged the iconic booth that Sinatra himself sat at  extremely nice waiters, and the setting is a Chicago classic! BBQ ribs with the classic \"zesty\" sauce were amazing, super tender, but also crispy on the edges,, truly a remarkable experience! If you're in Chicago, you HAVE to come here!", "pics": null}}, {"review": {"des": "Exceptional ribs in a VERY casual atmosphere. Love this place. Great, friendly service. Wide selection of beers. I will definitely return. <br><br>Positively no dancing!", "pics": null}}, {"review": {"des": "If you come on a weekday, you can usually be seated immediately for dinnertime. Weekends are another story - be prepared to wait an hour or more!<br><br>For me, a half of ribs with the creamed spinach was a perfect meal. Make sure to get the prohibition sauce - it's so good and absolutely made the meal for me. If you're very hungry, get the full slab of ribs, they are finger lickin' good.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EQFcU4BiK_2Tc4SFo2-tFQ/348s.jpg", "caption": "Half ska with creamed pepper jack spinach"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SzKtYxpUk-_Udy5NY_OLIg/168s.jpg", "caption": "Half slab with onion rings"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9dxmnbyWYS5V56rduCKS2g/168s.jpg", "caption": "BBQ chicken with French fries"}]}}, {"review": {"des": "Wow! This place didn't disappoint!<br><br>Came in around 4:30 for an early dinner before a show at UP. Waitress let us pick our booth, no wait on a Sunday afternoon. <br><br>We got a basket of fries to start. Waitress brought out all their own rib sauces. I'm not a fan of bbq or bbq sauces, but these are tasty, try them out! Zesty was by far my favorite, good flavor-spicy but not hot. Boyfriend was all about prohibition, definitely a more bbq flavor. <br><br>I got the fish fry with onion rings and boyfriend got a burger with more fries and prohibition sauce. His burger was cooked to perfection (a rarely for him). While the fish fry wasn't the best I've had, the onion rings saved the day! <br><br>I'd come back for sure!", "pics": null}}, {"review": {"des": "The food was decent and the waitress was lovely. It was a Saturday night with a one-hour wait. My husband, son and myself had just reached the one hour mark when a group of 5, who had strolled in about 20 minutes after us, were called to be seated. My husband asked the host why this group was seated before us, and we were told that \"there are big tables and there are small tables\", and that we would be seated at a small table. About 10-15 minutes later we were seated. Here's the punchline: we were seated right next to the party of 5 at a table of identacle size! So, the question then was why were they seated before us? Was it because the restaurant had more to lose if a larger party were to get tired of waiting? Disorganization? I don't know. I just know that it left a bad taste in my mouth!", "pics": null}}, {"review": {"des": "First, see a Robbie at the bar. He's your guy. Next...eat the ribs. Lastly, get there early or be ready to hang with some cocktails while you wait.", "pics": null}}, {"review": {"des": "Pretty damn good.  This place gets packed, so plan accordingly.  We got there around 6:30 and we were able to slide into some seats at the bar.  By about 7, place was packed till about 8:30.  So you have been warned.<br><br>Pretty good beer selection and they make some good drinks.  Even though there was this old timer complaining about the size of the martini glass.  But got a quick Sinatra story out of him, since he said he worked there in the 70's.  <br><br>As for the food, just get the wing appetizer with Zesty sauce and prohibition on the side.  Then just get a 1/2 rack of ribs with a baked potato and baked beans.  You can thank me later.<br><br>Ribs fall of the bone.  Beans have some pulled pork in them and the potato cooked perfectly.  Make sure you mix Zesty and Prohibition together, little sweet and spicy.  Great combo.<br><br>Again, thank me later.", "pics": null}}, {"review": {"des": "In le 00s i was hired 2 ghost write something 4 a writer who put me up on the Gold Coast because LA was \"The A**Hole Magnet\" according to him &we ordered food from here<br><br>He wanted to give me a classic Chi City BBQ experience & this place was the one that had the most history<br><br>When the grub arrived, he pretended 2 have lost his wallet &i had 2 pay & so el tema de ese proyecto was established.  <br><br>Nonetheless, the baby back ribs (my standard BBQ) were worth it.  I especially remember the sauce & how open the people were in The Chi City 2 actually getting 2 know mi & not just what they could get from mi.<br><br>I don't like LA hate, cuz hate doesn't solve anything but anyone who thinks that anything but themselves & LOVE is the answer to their problems is weak <br><br>The food from here was memorable enough to write about today", "pics": null}}, {"review": {"des": "Ribs get five stars.  If you aren't planning on getting these, might head somewhere else.  <br><br>Atmosphere 5 stars also in my opinion.  <br><br>Tuna steak sandwich is ok too.  <br><br>Filet and about everything else is about 3 stars max.  Very bad cuts of beef.", "pics": null}}, {"review": {"des": "The place certainly has history.  My wife and I ate there last night and both had the same opinion.  Very Average at best.  Ribs were tasteless and boiled for what seemed to be all day and came with sauce simply drizzled over the middle of the slab. Eh on the ribs good service, great salad dressing but the ribs eh...", "pics": null}}, {"review": {"des": "Atmosphere was cool, except the manager was very rude. We tried to bring a whole group of family to have lunch and drinks on the patio. She kept getting upset with how many people were joining us for drinks as she requires those outside to be eating (and it's understandable that the patio is small, but the place was empty). We had already received our food or I'd have suggested that we take our business elsewhere.", "pics": null}}, {"review": {"des": "Great food and beer list and even better service.  Many of the servers/bartenders have been there forever which says something about the family atmosphere.  Tasty cocktails as well.  A place I love to take visitors to get a neighborhood feel away from busy tourist hotspots.", "pics": null}}, {"review": {"des": "Great location in Old Chicago. We visited from out of town. Really like the ambiance and the service was fast. Our server was really attentive. Good people running the place. The pulled pork is what we ordered, tender and good sauce. The bar area seems so cool the just hang out tang shoot the mess over a few. Thanks again", "pics": null}}, {"review": {"des": "You have to go at least once....  I like the place, but it's just OK.  Here's how I grade it:<br><br>Atmosphere - A+  (old-school antique charm)<br><br>Service - A+ Very nice, Fast, etc...<br><br>RIBS - C-  Seriously, they really lack flavor.  Not good.  Maybe they boiled them to death.<br><br>Chicken - C - Again, very bland... nothing special.  <br><br>Parking is very tough but they do have a valet. There are some great old pictures and history associated with this place.  Next time I'll order a burger.  They're sort of on the expensive side for ribs, so I would expect better quality.  Oh... and they trim the ribs so that they are a bit smaller than what one would expect, much small... almost as if they cut off the ends for rib tips but cut off too much.", "pics": null}}, {"review": {"des": "Onion Rings, awesome. Wings, awesome. The pork sandwich was alright. Everyone enjoyed their meal and will keep as a nice spot for a quick bite. Certainly go with the prohibition sauce on your selections.the waitress Deb was great too", "pics": null}}, {"review": {"des": "I have not been here since before the internet. Okay, There may have been email, but there certainly were no Yelpers. I returned with my wife recently for my birthday lunch.  I remembered this place as being good, but could not recall details.<br><br>We both had the famous ribs (I think they are baby back ribs). The full slab is enough food and delicious. The wife ordered a half slab and wanted more. The original zesty sauce is not impressive.  It is no better than the sauce you can get at the grocery store, Heinz, etc.  I strongly recommend the prohibition sauce. <br><br>For some reason, my full slab was cooked perfectly while the wife's half slab was slightly undercooked. <br><br>The sides - baked beans and onion rings were good. Cole slaw was good to go.<br><br>I ordered a cup of the chili with cheese and onions. It was good as well. <br><br>Service was good. The waiter refilled my iced tea a number of times.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Amy-JdOis93Ax5gxUMwFJw/348s.jpg", "caption": "Full slab"}]}}, {"review": {"des": "Overall: Great ribs, fun atmosphere, and good service all make for a great Twin Anchors experience. <br><br>The good: The ribs were very tender and delicious. The sauce is definitely the highlight. The prices are reasonable and the portions are big. You won't leave hungry. A lot of other non-rib options. Service was very friendly and attentive even for our big group. Great (and historic) atmosphere. <br><br>The bad: If you aren't careful, the wait can be VERY long. Not a lot of space. The BBQ, while great, wasn't the best and didn't quite live up to the hype. <br><br>Atmosphere: 9/10<br>Service: 9/10<br>Food:8/10", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EGBHPp6b2nWrWPhrlrvWwA/348s.jpg", "caption": "Half slab with baked potato"}]}}, {"review": {"des": "Twin Anchors is a Chicago favorite. It has been open in the same spot since the 30s, a true testament to how good it is. Old school atmosphere, small seating area and great BBQ. I prefer the zesty sauce above the other options and have had better onion rings but the pulled pork sandwich keeps me coming back. I hear their ribs are the best in town. Definitely go visit for something different and laid back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/k1Wf9ovOMqaQ3Wf-etEuUw/348s.jpg", "caption": "Pulled pork sandwich with zesty BBQ...comes with cole slaw to put right on top"}]}}, {"review": {"des": "Unlike Harvey Dent you do not need to come in to this restaurant gun brandished ready to take a 50-50 chance on the place like he did in The Dark Knight (they shot the scene where Harvey shoots an off-duty officer at a bar in Twin Anchors). No, you simply need but to put in your name as they don't take reservations and either stand around the crowded bar looking at all the fascinating photos of famous folk on the walls and trying to breath in some of the cool history that has happened at this awesome place. Every year for the last 8 years I come back to this place especially on occasion when I have friends in town. Any every time it does not disappoint and remains timeless among a constantly changing and evolving Chicago restaurant scene. If you are coming here for the first time you are obligated to try the ribs with their 3 delicious bbq sauces. If you are coming here second, third, fourth, or fifth time you are obligated to get the ribs again with their 3 delicious bbq sauces and then adventure into the chili, anchor burger, or bbq pork sammy. It's gastro pub heaven and you better believe the authenticity flows from the staff, atmosphere, and food.", "pics": null}}, {"review": {"des": "The ribs are Boiled!! No seasoning. But when u add the prohibition sauce it was great!! The wait wasn't bad for a Sunday night. About 25 mins. Glad I made the trip!!", "pics": null}}, {"review": {"des": "Great bartenders making drinks with fresh squeezed limes.  NOT the mixes.   Very good tap beer selection.  <br><br>Atmosphere is still as great as it was for years.  <br><br>Ribs portion were small.  Chicken was dried out inside.  Dark meat portion was very small. <br><br>For the price it was overall good.  I'd come back for the price value.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PEK7H5FIyoekvNQNOdtKZg/168s.jpg", "caption": "Rib and chicken dinner.   Very small chicken.  Great o rings"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vp42PcwcyaE4bhe1BQp2Aw/168s.jpg", "caption": "Great old fashioned bar"}]}}, {"review": {"des": "Outstanding!  Have been wanting to go here for many years. I finally broke down and went last Friday!  The ribs were some of the best outside of Memphis, TN. THE SAUCE WAS FLAVORFUL, with just a hint of spice. The ribs we cooked to perfection and the meat just fell off the bone. It was some of the best BBQ I've ever eaten in Chicago!  I will be going back again and again!", "pics": null}}, {"review": {"des": "I moved to the neighborhood and was really looking forward to going here. I had heard they had the best ribs in all of Chicago. A lot of people go visit this place because of the hype. I think this place used to be good, but now it has just turned into a business. Get as many people in and make as much money as possible. The food quality is just not there. The ribs were burnt and everything else was from a freezer bag. It's not terrible food, but the quality is not there.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oknRKmgiU-3K51X3LIysnA/348s.jpg", "caption": "Burnt ribs and onion rings from a freezer bag"}]}}]}