{"name": "two-hearted-queen-chicago", "reviews": [{"review": {"des": "Two Hearted Queens is one of my favorite coffee shops in Chicago for many reasons<br><br>1) [the most important] their coffee is amazing! Not only does it taste good but its strong! It's the only americano that will give me a nice buzz to start my morning. <br><br>2) their food is bomb. The scones are the best i've had - hands down. I LOVE their blueberry vanilla and they just came out with a cracked pepper maple glaze (i think that's what the glaze was) that is to DIE FOR. the flavors pair amazingly. My roommate loves their paninis (great quality, and amount for what you pay) I have yet to try it but I am planning on trying it next time I go. <br><br>3) Atmosphere. I am a big coffee shop studier and I love it when I don't feel like i'm a nuisance (there's a coffee shop a few blocks down that will shut off their WiFi from 9-5 on the weekends so you can't stay there to study.. like what...). <br><br>4) Backstory. I am a sucker for cute \"Our Story\" shops and this is definitely one of them. I also love the fact that the owners are there all the time working and you can tell they care. Everything about the shop is A+. Everything is clean, smells nice, bathroom is always functional, stocked, and clean. Temperature control is great. Workers are friendly. <br><br>I've been here so many times and will be here many many more. Keep up the great work Queens.", "pics": null}}, {"review": {"des": "Aesthetic and quality coffee are the two things I look for in a coffee shop, and Two Hearted Queen definitely hits the mark for both of those criteria. <br><br>Very cozy coffee shop with a moderate amount of seating (it can get pretty full though so you may not always be able to find a seat with a table). I've been here a few times at different times of the day and haven't really had a problem with seating, though.<br><br>The specialty drinks like the Queen of the Night are pretty delicious! The baristas are all really friendly and helpful, too.<br><br>Also, there's a fun little game you can play after placing your order where you draw a card from a deck and if it's the queen of hearts, you'll get half off your order and a $2 coupon on your purchase next visit. <br><br>Definitely recommend this place if you're in the area!", "pics": null}}, {"review": {"des": "Two Hearted Queen was super adorable. However we visited on a rainy day, which meant that there was a distinct lack of seating, with lots of people taking refuge out of the rain.<br><br>There's a whole back area with a ton of quaint mismatched furniture, slightly like a playhouse or a lovingly decorated rec room. It was fun to just take a moment drink tea and relax.<br><br>I will say that I would have liked to have seen more side tables even if they were smaller, and more unobtrusive. Because I did notice that a lot of customers had to utilize the squares to sit and were forced to set their drinks further away from themselves than normally they would.<br><br>All in all, definitely a fun stop in Chicago.", "pics": null}}, {"review": {"des": "The best. Coffee + staff make this place lovable. So lucky to have 2HQ in my neighborhood!", "pics": null}}, {"review": {"des": "Still the best place to go for amazing coffee! Cely roasts her coffee beans on site to perfection! I love the different blends! They also have more sandwich options available! Love this place!", "pics": null}}, {"review": {"des": "Inconspicuous, adorable, and vibrant are words I'd use to describe Two Hearted Queen. After inhaling a large lunch around the corner, my friend and I were in desperate need of caffeine one afternoon last week. I noticed the little word \"coffeehouse\" under a huge sign for a cleaner's while driving past Roscoe Street, so we pulled over to fulfill our coffee dreams.<br><br>I'd bought lunch so coffee was on my friend, and right before she paid the barista handed my friend a deck of cards. At Two Hearted Queen, if you miraculously choose the Queen of Hearts from the deck on the counter, you get half off your entire purchase! Who doesn't love a bit of charm?! My friend didn't pick the winning card, but the game was fun, anyway.<br><br>We grabbed our cups of coffee, which were given to us in glass mugs, in true local coffee shop fashion when you say you're staying. When we entered the sitting area, I was blown away by how much space was tucked away back there! There were colorfully painted walls, a ton of bookshelves, tables, couches, and armchairs. There was a printer, a community bulletin board, and a bathroom. A lot of art was scattered throughout, too. The baristas walked through every once in awhile to check on people and pick up dirty dishes.<br><br>I'm very rarely UNimpressed with my coffee shop orders, because I usually get a cup of black coffee (that way I can really decide whether or not the coffee is good!) and a snack. Two Hearted Queen's coffee has a unique taste -- almost chocolatey -- which was a nice little touch to my usual coffee experience. <br><br>I'd been wanting to visit Two Hearted Queen for quite awhile, and I was really impressed with the amount of space and the way it looked inside, the staff, and of course, the way the coffee tasted. Try it out!", "pics": null}}, {"review": {"des": "Oh my GOSH, the scones. To die for. The house made chai was perfect. Super nice baristas and lots of cool places to chill.", "pics": null}}, {"review": {"des": "A very cozy hidden gem in Lakeview not too far from the Southport Corridor. I love to come here especially on rainy and cold days for their mint tea and panini's and play chess with my husband at either the comfy armchairs or cute cafe style tables. <br><br>They have a great menu of fun queen of hearts themed coffee drinks and their panini's are absolutely delicious! When you go to pay they place a deck of cards in front of you and if you draw the queen of hearts you get a discount on your order. <br><br>They are always super friendly when I go there and I love the bookish boho vibe that creates their space. Always look forward to coming back here!", "pics": null}}, {"review": {"des": "This is first time here and I am quite the vibe seeker for my coffee shops and this place has delivered. Great customer service, great music, great environment, and great coffee. Best iced coffee, can taste the coffee not only the milk! Love it.", "pics": null}}, {"review": {"des": "A good coffee shop is a place that feels like a home away from your home, except it's better because you don't have to wash the dishes or pick up after the cats. A great coffee shop is a place where you can just enjoy the coffee, the atmosphere, and even the other customers. Two-Hearted Queen is one of my all-time favorites.<br><br>I visited because a friend said it was \"a cute place\", but the real kicker for me was that it made all sorts of coffee drinks with plant milk, on request. I do not do dairy at all, except on the rare occasions when I need to be reminded that dairy makes my skin break out. I haven't had a coffee drink with any kind of whitener for almost two years.<br><br>Two-Hearted Queen offers 3 kinds of plant milk; soy, almond, and an almond-coconut mix. I've had cappuccino and latte with almosd milk. My friend Jeannie asked, does the fake milk foam? Yes it does. These were terrific drinks.<br><br>On one visit I thought that I needed to be more caffeinated (which turned out to be wrong, by the way), and I had a coffee of the day, black. I don't know what kind they serve, but I liked it. It has to be good, if you're going to drink it black. There's nothing to cover up any bitterness or burnt flavor.<br><br>The main room is comfortable, cozy, and welcoming. My congratulations to whoever designed it; I wanted to take pictures for all you Yelpers out there, but the people and atmosphere were so chill, it seemed a travesty to disturb the setting with snapping cell phone photos. Suffice it to say, it's even pleasurable just to sit back with your coffee drink and look at the room.<br><br>I got hungry and had a blueberry scone, which was moist and delicious. Hey, any scone that doesn't have the heft and dryness of a hockey puck gets at least a couple points from me, but this one exceeded expectations. <br><br>I love Two-Hearted Queen. It's a little out of my way, but it's well-worth the trip.", "pics": null}}, {"review": {"des": "Try their Oueeb of the hearts, amazing coffee with a nice ambience and crowd. They let you choose a card from the deck and if you get queen of hearts, I think you get a 50% discount, which I didn't get unfortunately.", "pics": null}}, {"review": {"des": "This is my favorite coffee shop so far that I've been to in Chicago!  (I've only been here about 7 months so still have lots to explore!)  I ordered a 16 oz mocha with some of their homemade whipped cream...yuummm.  The baristas were very nice and I noticed one of them seemed to know most peoples names that came into the shop which I thought was just awesome!  They let me know that my 16 oz mocha would have 4 shots in it which sounds about wonderful to me!  I came here to work so was worried about the space as I've never been but this place is big!  Plenty of space.  The music wasn't too loud which I appreciate when I'm working.  The coffee was perfect!  Really enjoyed everything about my mocha.  Look forward to my next visit here!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MLRKK-xKZuVO4Bdk1mLaKA/348s.jpg", "caption": "Mostly drank, delicious 16oz mocha!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/51600hxafOpAiVcSGuotog/168s.jpg", "caption": "Cute wall art"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DIWzEhwJxGc1DeufSxT-2g/168s.jpg", "caption": "So much space inside!"}]}}, {"review": {"des": "Such an awesome place that satisfy the feeling of great coffee and an incredibly comfortable environment. The staff is so friendly and attentive from the moment you walk in. I have been to several coffee spots and by far this is my favorite thus far.", "pics": null}}, {"review": {"des": "Very nice and cozy coffee shop! I work from home so I've been looking for places to work and this seems like a great spot if I'm trying to be efficient. I say that because I had no idea it would be so quiet so it was super awkward when I took a video call. I obviously had headphones, but every time I spoke I felt like I was bothering everyone. Some people were reading and others were working on their laptops.<br><br>I had a chai latte and it was good, not great. Not sure if there was a size option, but my mug was pretty small. <br><br>I'll definitely go back though!", "pics": null}}, {"review": {"des": "Such a cute neighborhood spot. I've walked past this place tens of times, always promising to go in and I'm so glad I didn't wait any longer. The baristas were incredibly friendly and knowledgeable, the space is so cute with a huge room attached for doing work or hanging out - tons of tables and chairs. The patio is great as well. Menu is full of great coffee and tea options which I can't wait to try more of.<br><br>Definitely stop by if you're ever in the area - I know I'll be back ASAP. As a bonus, they use unsweetened almond milk which is pretty rare in coffee shops and very much appreciated.", "pics": null}}, {"review": {"des": "This coffee shop has a lot of character. We stopped in on a Sunday afternoon - while it was crowded, we still found somewhere cozy to sit. A number of people were studying, but it did not create an oppressive vibe of doom. Oftentimes, I find coffee shops full of stressed out undergrads/grad students to be awful to chill at. <br><br>We just went to lounge and have some coffee and we really liked it! The storefront was open and roomy where you order with a seat or two there. The back of the shop was spacious and was where most of the seating was located.", "pics": null}}, {"review": {"des": "Very friendly staff. Loved the card draw for seeing if you got a discount. Lots of seating. Cozy. Great place to hang to get work done. Cute bathroom.", "pics": null}}, {"review": {"des": "Absolutely love this coffee shop! The staff is extremely friendly and the decor is homely, dainty, quaint, and unique. I've always been a fan of small specialty coffee shops, and the Two Hearted Queen is an exemplary example of one. Their hot chocolate is delicious, as well as all of their specialty and coffee drinks. The bathroom is well maintained and there is comfortable seating everywhere. Definitely come shop by for a quick to-go drink and get your morning coffee!", "pics": null}}, {"review": {"des": "Great neighborhood gem. Great quality coffee, incredibly friendly staff, amazing atmosphere. It feels like having a good cup of coffee in a friend's living room.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sM_Hwm7UCddEAwtufZinrw/348s.jpg", "caption": "Cappuccino"}]}}, {"review": {"des": "I love love love this little gem of a coffee shop! I've gotten their chai tea and it's delightful. The vibe in there is so great and I always am able to grab a table and work for a few hours. Employees and customers alike are super friendly, it almost feels like a camaraderie when you walk in the door. Highly recommend!", "pics": null}}, {"review": {"des": "This place is the bee's knees. I simple but wide variety of espresso beverages and food. The ambiance is a blend of cozy and productive; you have your choice of couches or tables and chairs. <br>The WiFi and printer are reliable, the drip coffee is robust.  They also have sugar free vanilla that's not too sweet.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bTX472Hv8vsXtEUkIDDcZA/348s.jpg", "caption": "Come thru, ."}]}}, {"review": {"des": "This place is honestly such a cute idea for a study cafe.  They have this super fun game in the beginning, like everyone's been saying, where you can try and pull out a queen from a deck of cards and get a discount (although once all the queen's have been pulled, you can no longer play-- it was sad to say that by the time I got there around 2 pm, all of them have been pulled :( -- it's still a unique concept though).  The drinks are reasonable-- the mocha is very, very coffee heavy (I think they told me it had 4 shots of espresso in it!!!), but it's still good! <br><br>The atmosphere is perfect for a study environment.  There's plenty of spaces and plugs and couches, and the music isn't so overwhelmingly loud that you can't focus (and some good noise-cancelling headphones can definitely block out any excess noise).  The baristas were very nice, and all in all, it was an ideal place to spend 4-5 hours studying for an upcoming test!  Would definitely recommend!  I just wish they kept the water jug filled as I had to keep asking the baristas for water and I felt as if I were bothering them each time.", "pics": null}}, {"review": {"des": "This coffee shop has it all: cozy, eclectic and quality coffee. The service we received was very helpful and friendly. There's a deck of cards at the register that you cut and draw from; if you draw the queen of hearts you get 50%! Lots of indoor space if you need to work and a lovely outdoor patio with plenty of tables for conversing and enjoying the sunshine. The chai latte I had was perfect! A perfect blend of sweet and spicy. I highly recommend if you live in the area or are near the baseball park and are willing to walk a couple of blocks to avoid Starbucks.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ykUbc9pJ0sLd6khnIHDWiw/348s.jpg", "caption": "Adorable outdoor patio area"}]}}, {"review": {"des": "First time here. You walk in and get straight to the good stuff. <br><br>We got two 16 oz soy lattes, super nice.<br><br>You turn right after paying and there's a whole other room with tables, couches, etc.<br><br>It was busy but quiet. You could still chat with a friend quietly. Great atmosphere and good coffee. <br><br>We will be back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jhRuU4GBvmMEShOZYMhTpQ/348s.jpg", "caption": "Next to a cleaners on the corner, you won't miss it."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6j0cI3ei9zm3S9pHURsM5g/168s.jpg", "caption": "Clean couch"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5NWkhzq3AixvUrSMQhAhMw/168s.jpg", "caption": "Soy latte! Yum"}]}}, {"review": {"des": "Best coffee shop in Lakeview in my opinion. It has a friendly, community-like vibe unlike some other coffee shops I've been to. The baristas are great and I appreciate that they always bring my coffee to where I'm sitting outside. The inside is adorable, but what I love most is their outdoor seating (and lots of it). It's in a peaceful, relatively low-traffic area. It makes it a relaxing, quiet place to hang out. There's usually not a long line inside. Read their story on their website, and you will fall in love with this place even more. I also love that they have treats and water for dogs. My current favorite summer drink is the Ice Queen with maple. It is perfection.", "pics": null}}, {"review": {"des": "Amazing service, drinks, products, ambience and community space.  You absolutely should come here.  Full stop", "pics": null}}, {"review": {"des": "Love this place and have been coming here for a year now. The staff is super sweet and they take the time to learn your name. I always get a chai latte and the queen panini which never disappoint. If you haven't gone please do!", "pics": null}}, {"review": {"des": "This authentic old-school coffee shop stands out as a gem amongst the high-class renovated comp set coffee joints in the area. A solid quality cup-o-joe, a quiet and inspirational creative work environment, as well as an extremely kind staff make Two-Hearted Queen a high recommendation.", "pics": null}}, {"review": {"des": "Good food (I ordered an egg sandwich), good coffee (I ordered a skim latte), and good service.", "pics": null}}, {"review": {"des": "Tips:<br><br>The Ice Queen - double shot espresso with milk of your choice and a flavor. ~$5<br><br>If you choose the \"Queen of Hearts\" from a deck of cards you can get 50% off your order!<br><br>Wifi available.<br><br>-------------------------------------------------------------------<br><br>The vibe, idea, and theme of this coffee shop is extremely adorable. The place is small, but there is plenty of seating from tables to armchairs.<br><br>The two Queens working here are extremely nice and helpful. I would absolutely come back to do some work at this cafe and to also try some of the other interesting things on the menu as well.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tYWCWL4uZHkxH7dvkMeTiw/348s.jpg", "caption": "Ice Queen"}]}}, {"review": {"des": "Moved to Chicago from Seattle and was a bit worried about (what I thought was going to be) the coffee letdown. Two-Hearted Queen has totally erased any worry or doubt I had about Chicago coffee. I'm obsessed with this place. Lucky for me, I live within a few blocks and can enjoy it at least once a week. <br><br>Service is above and beyond, with super friendly staff who are clearly invested in their work. Ambience is absolutely perfect for getting work done IF you are like me and prefer some good music in the background. That said, if you need complete peace and quiet, not sure why you'd pick a coffeeshop to get work done anyway. That's what libraries are for. There's also a cute outdoor seating area for nicer weather.<br><br>Food and drink - their cherry orange scones are quite literally my favorite breakfast item in Chicago. I'd let you know if the other flavors are good as well but I keep getting sucked in by that cherry orange deliciousness and haven't tried them yet. Their coffee drinks are tasty and strong; four shots in a latte is standard (YAS). Ice Queen and Queen of the Night are my favorites. Overall, an absolutely terrific local coffeeshop that I'm thrilled to have as *my* local coffeeshop.", "pics": null}}, {"review": {"des": "I've been here a handful of times and consistently love Two-Hearted Queen. The baristas are super chill and overall the place has vibes like you're in your best friend's living room; relaxed, in good company, happy, and right at home.<br><br>THQ is located right at the corner of Roscoe & Racine, and I couldn't be happier that another café is in the 'hood. The other ones I like close by (aside from Sbux or Dunkin') are Asado on Irving Park or Lobe Pastry by the Paulina Brownline; I really hope other ones pop up at the Ashland/Irving Park and Lincoln intersections, especially on Ashland.<br><br>After you place your order at THQ, you can choose a card from a deck on the counter. If you draw the Queen of Hearts, you can get a discount off your drink. If that card has already been drawn, they'll place a mini placard stating just that, and the deck will be placed off to the side.<br><br>I've ordered the King Panini several times (ham, egg, cheese, sriracha aioli), the Ice Queen (iced latte with your flavor choice) and their caramel latté. All were excellent, and I really like their almond croissants and scones.<br><br>They have eclectic furniture, perhaps salvaged from thrift stores around town, which gives their seating area a quirky mad-hatter feel (not unlike my own home!). That's probably why I love this place so much.<br><br>THQ is a little oasis in the residential part of Southport Corridor. They have wifi, cozy indoor seating, plenty of outdoor bench seating, food & drink. I come here to work on my laptop, meet up with friends, or grab a drink to-go. Good vibes and good coffee, all around, all the time.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NtAEbjlIF-toIkGGN0NT6Q/348s.jpg", "caption": "Ice Queen: iced latté with flavor of your choice (dark choc; white choc; maple syrup)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jzig8Z3EDSvBY-lRxEyaqw/168s.jpg", "caption": "\"The King\" panini"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LkADV62irv3RA4ON5ib51w/168s.jpg", "caption": "Almond croissant and lavender scone"}]}}, {"review": {"des": "Two Hearted Queen is a cozy little corner of heaven. Cely Garcia and Cassandra Andrewson share their love of coffee and community with Chicago's Lakeview neighborhood.<br><br>Cely, along with Cassandra are not only inspiring, female entrepreneurs... the people behind the counter are equally as inspiring. From actors to screen writers, musicians and vagabonds, everyone has a home at Two Hearted Queen.<br><br>When entering the Queen you are always greeted with a friendly hello. It doesn't matter how long you have been a customer or how long you stay. They remember your name. On the counter lies a deck of cards, with a small sign inviting you to \"Test your luck in the Royal Draw\" where drawing the queen of hearts provides a 50% discount on your crafted coffee beverage along with cheers and high fives from the staff. They stop at nothing to make a personal connection with you. When is the last time you really felt the care only a personal connection provides?<br><br>Along with the excellent service, Two Hearted Queen provides an ethically sourced, globally conscious cup of coffee every day. They are finding the best coffee regardless of its \"organic fair trade\" label.<br><br>They are out to change the way the world looks at coffee production. Coffee farmers in the countries that rely on the export of coffee (that are located between the Tropics of Cancer and Capricorn) are often very poor and can not afford the \"organic\" farming label despite the farms themselves actually farming organically, simply because they can not afford pesticides in the first place.<br><br>Two Hearted Queen also takes into consideration the global origins of coffee and the methods of brewing and roast profiles that are preferred by the coffee drinker's palette in the country of origin.<br><br>The coffee is roasted by hand weekly and \"painstakingly\" tasted and refined by many coffee professionals even before the liquid gold reaches your hands as the customer. When you indulge in a coffee beverage from Two Hearted Queen you can be assured you are drinking what they believe is best that day. It makes for one very tasty cup of coffee.<br><br>Their global mindset is not overshadowed by their love for the local Lakeview community in Chicago. Every few days the sign on the corner will rotate, one side for \"The Queen\" or promotional information about what is going on inside the shop (My Favorite features: Strawberry Banana Smoothie, Spiced Apple Cider).<br><br>The opposing side of the sign faces outward and has created a space to voice unique insight, sympathy, or encouragement to the members of the neighborhood. It also creates a space to inject the insight and vision of a variety of under heard people groups such as small business owners, women, trans folk and minorities directly into the world in which it faced. I remember the sign the morning after our now President Trump was elected: \"Puppies, Kittens and Baby Otters.\"<br><br>Throughout the day the baristas there were a beacon of light. They were there to hear the heart break of the community in full force, uniting in solidarity with everyone. Share humor, understanding and love.<br><br>I have never seen a space that offers more inclusion than Two Hearted Queen. It does not matter who you are, whom you love, what gender you show the world. It is simply about being a person, on the earth who exists, and its nice to have someone remember your name.<br><br>These are just a few reasons I would recommend stopping in for a lovingly crafted cappuccino or any of their globally conscious brews! If you want to learn more about Two Hearted Queen and their mission to change the world one cup of coffee at a time you can find them online at <a href=\"/redir?url=http%3A%2F%2Fwww.2hqcoffee.com%2F&s=78ba2fda93ea67df576f86b500a7da89b8ee28ec42ee63c195fdbe6779f38d60\" target=\"_blank\" rel=\"nofollow\">2hqcoffee.com</a>", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qbJ3VfNeT7t1nONfX6w_4A/348s.jpg", "caption": "Get a cup of coffee and read a book."}]}}, {"review": {"des": "A good neighborhood coffee shop needs a few things. 1. Good coffee - check.  E and I had outstanding elixir blend pour over and the milk drinks looked well made as well. 2. Plenty of work space -  check.  Numerous indoor and outdoor tables and many people in there had laptops out and studying or doing work. 3. Good food - check minus. We had a scone which was really flaky and soft not dry like they normally are.  Minus as there aren't a ton of food options, looked like a few paninis and scones but this isn't the focus of the joint. 4. Friendly staff - check. Definitely very nice folks working here. As the clincher, this place has a fun game.  If you're lucky enough to draw the queen of hearts from a deck of cards, you get 50% off.  If you are lucky enough to find yourself in Lakeview, check this place out!", "pics": null}}, {"review": {"des": "Great local spot in the neighborhood. Always great coffee. The sandwiches are amazing. The staff is always friendly and recommends great drinks if you are looking to change it up from the ordinary basic.<br><br>And who doesn't love pulling a card from the deck to try and get 50% off?!?!", "pics": null}}, {"review": {"des": "This place is JUST the best. Quality coffee drinks served by lovely folks. Plenty of room and tables inside (and out, when the weather is right). Great space to work, read, or catch up with a friend. Lucky to have this spot a few blocks from home!", "pics": null}}, {"review": {"des": "Amazing, very strong lattes (lattes have 4 shots of espresso). Great atmosphere to get work done, and amazing paninis! I also really liked their community board where you can see what's happening in the neighborhood!", "pics": null}}, {"review": {"des": "A delightful study spot in a beautiful neighborhood! The cafe has lots of seating and plenty of outlets spread out across a coupe rooms -- so you don't have to hear all the cafe sounds if you need to concentrate. Indoor and outdoor seating as well. Good menu selection -- coffees, great tea selection, smoothies, baked goods and paninis. Scones are very tasty and thoroughly enjoyed my chai latte.<br><br>Cons: internet seems to go offline every once in a while, AC on full blast in the summer so you get a bit chilly sitting inside.", "pics": null}}, {"review": {"des": "I live in the suburbs but when I'm in the city I love trying new coffee shops. I came here because of the great Yelp reviews. <br>The good: I walked in and everyone was super nice, smiling and helpful with recommendations. The space is HUGE and a great atmosphere if you need to work.<br><br>The bad: I ordered a maple syrup, almond milk latte. I went and sat down to drink it and the lid wasn't on right, a quarter of the 16oz HOT latte spilled on me. Mind you, I was holding my 7 month old daughter. I ran to the bathroom and cleaned us up. I came back, closed the lid and drank from the most bitter, burnt latte I'd ever had. And that's not an exaggeration. I placed it on the window sill and had a 20min conversation with the woman next to me. I had to leave, so I gathered my stuff, picked up my daughter and started walking out.<br><br>The ugly: I forgot the latte on the window sill. As I walked out, the extremely nice gentleman that made my latte asked how it was. Being that I can't be a mean person (I literally can't be confrontational, mainly due to me having panic disorder), I said, \"oh it was good, it just spilled on me.\" He offered to make me a new one and I told him no, it's okay, but he insisted multiple times. Another barista, which I assume is one of the owners came out with the latte I left on the window sill which was 2/3 full. She tried to humiliate me in front of customers and accuse me of lying. \"If you liked it, why didn't you drink it?\" Because I'm not rude enough to tell you it tasted like dirt, that's why. Her rude manner, dirty looks towards me and accusatory tone were uncalled for. I paid $9.13 for a latte (I always tip well) and deserve to treated like the good customer I am.<br><br>They lost me as a customer, I will never go back or recommend this place.", "pics": null}}, {"review": {"des": "Chicago in general has great coffee choices and with all the competition, places in general have minor competitive and differential advantages that make them truly special. Two hearted Queen...where do I even start. <br> Staff- hard working, greet you with a smile, prompt service and forthright if they need some time to get you your drink because of this or that. <br><br>Space- great atmosphere with a just right combination of tables, chairs, couches and the rest. Music system is properly spaced so you can dive into work or sit back and enjoy conversation. Art work adds to the place while supporting local artists<br><br>Beverages- I have ordered coffee in the manners of Latte, espresso and Macha tea. All right on point. I'll need to check where they get their beans but I believe they buy wholesale or are transitioning to making their own blends. Regardless it is fresh and on point. Yet to have an average cup of joe, and trust me; they aren't robots because damn they are just too friendly for that<br><br>Uniqueness- draw a queen of hearts from a deck and get 50% off. Cool quirk of the place. <br><br>Food- probably one thing that could be improved to make them legendary. They are excellent and the sandwiches do the job but come on, I can't say they are killing the game in everything. I have had a couple paninis, always good but as this place continues to grow into itself I bet they will step up this side as time goes on<br><br>WiFi- free, books available to read- good options at that also<br><br>Saturday's and Sunday's- usually packed but nothing out of control, it may be a take and go situation rather than a sit down. Just know that before hitting the spot. Outdoor sitting is on the north side so will only have specific hours of sun Trees to the west will most likely block afternoon sun. <br><br>Overall the ladies at this place have worked so hard to find the right combination to start a damn good coffee shop. Love supporting this place and I wish continued success to them!", "pics": null}}, {"review": {"des": "Good coffee, nice staff, homey atmosphere. Nice place to get some work done without feeling pressured.", "pics": null}}, {"review": {"des": "\"Two Hearted Queen\" coffeehouse is hidden on the corner of Racine and Roscoe.  Once you're here, the warm, homey atmosphere will shut your poker face!  <br><br>Hubby and I came over before the Star Wars premier.  Apparent Yelpers have given THQ a stellar review, \"wholeheartedly,\" so I really wanted to find out why this place was this awesome. <br><br>I went with the choice which Whitney Houston would concur, \"Queen of the Night.\"  This drink features mocha, a hint of Himalayan sea salt, and peppercorn.  At first, I thought this caffeinated beverage contained cayenne pepper since I have had something else similar to this.  Nevertheless, it tasted more smooth without the signature \"punch\" cayenne pepper would render.  As I was finishing it up, I detected the presence of salt.  Yes, I felt like a self-proclaimed queen after my coffee therapy.  <br><br>Hubby commented that his matcha latte was stronger than what he anticipated.  Well, this was how real tea should be.  <br><br>In terms of the ambiance, there are a variation of seating available, comfy couch, working-friendly two-person table and chairs, and a small round table for the mother-daughter pair.  <br><br>Prices for their coffee are the reflection of the neighborhood: slightly elevated ($9 and some change for 2, 16oz. signature drinks), but I would say THQ was a great discovery.  The location isn't awfully far from the Wrigley Field, just in case you aren't too fond of the commercial coffee shop on Clark.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1uHuubBVgoNrJH9GCI_I7g/348s.jpg", "caption": "Matcha latte"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Eg883sLt-LeMqrhhBg_Fng/168s.jpg", "caption": "Queen of the night"}]}}, {"review": {"des": "Cute little cafe with a nice loose leaf tea selection! They have a super cozy seating area, making it a wonderful place to drink a cup of hot tea and play a board game. Employees are always nice!", "pics": null}}, {"review": {"des": "I LOVE this place!  As a Miami native I visit my daughter in Chicago and luckily she lives very close to this coffee shop.  One of the pleasures of my visits is getting coffee here every morning.  I have tried most of the specialty drinks and they are wonderful but lately I have been drinking whatever coffee is \"the brew of the day.\"  Wonderful, hot, delicious coffee!!  I have also tried the scones which are moist, flavorful, and homemade.  However, the best thing about this coffee shop is the staff!  Everyone is friendly, knowledgeable, and makes an effort to know your name.  Also, in addition to a lovely inside room for eating, socializing, or working they have recently added an outdoor area as well. <br><br>Definitely recommend and I encourage support of this local business.", "pics": null}}, {"review": {"des": "Sometimes when I have some spare time, I'll try to find a new coffee place.  I was pleased to find this spot.  It seemed almost hidden.  When you walk in, you are struck by its hospitality and warmth.<br><br>It's one of those places where everything feels relaxed and un-rushed, slowed to a pace where you can enjoy your latte.<br><br>I don't know if they do it all the time, but they have a fun pick a card game.  If you pick a certain card (always the same) you get a discount.  If your pick is not the one, they keep that card out--eventually someone gets the lucky card.  A small fun thing, but enjoyable.<br><br>My latte was in the good category, more bitter (not bad) than some--maybe causing me to add just a touch of sugar next time.<br><br>Definitely an enjoyable nook in the City.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TDjBY57l2stxXapL1x9Ocw/348s.jpg", "caption": "Comfy"}]}}, {"review": {"des": "This little coffee shop is as good as it gets in my opinion. It's truly a neighborhood coffee shop - far enough off the main drags that it really is the coffee hub of choice for the folks who live right here. My brother and his husband live close by, so when we're in town, this is often our first stop before a fun-filled day of Chicago-ing. <br><br>They've made the inside so cute and homey, and the outside is as darling as it can be with picnic tables and little planters with seasonal flowers to mark the boundaries of the space. <br><br>Every coffee I've had from here has been wonderful - wether it's an iced coffee or a handcrafted latte. All the ingredients are of the highest quality and the baristas clearly know their way around an espresso machine. I also really like their scones and their breakfast panini. Everyone who works here is really friendly and I love the little touches - like biodegradable coffee stirrers in the form of long sticks of uncooked linguine! Who's genius idea was that? (They also have wooden ones on hand in case the idea of pasta in your coffee for ten seconds bothers you). <br><br>They've really thought of everything and for this, I give them five stars!", "pics": null}}, {"review": {"des": "Great staff - always greet you with a smile, ask your name and always remind you try to pull for the \"Queen\"!<br><br>Oh and good food and coffee", "pics": null}}, {"review": {"des": "I'm glad I found this place through yelp. I needed to get some work done and wanted to find somewhere with coffee and wifi. As soon as I walked in I was greeted and the staff are super friendly. The decor is cute and fun to look at. <br><br>I ordered an iced coffee (which comes in a cute mason jar) with white mocha and a blueberry scone. Both delicious!<br><br>A fun game they have when you are about to pay is you get to select one card out of a deck. If you get the queen of hearts you get half off your order!", "pics": null}}, {"review": {"des": "3?  4?  That's about the number of times I've ever reviewed something on Yelp and I felt compelled to review Two Hearted Queen.  This is the kind of place that only creative people with a vision could have put together.  You want personality, character and ambiance and a good cup of joe?  Come on down.<br><br>Coffee shops are where I get away from it all or burn the midnight oil either studying or catching up on work.  I'm from the Phoenix area and love living there but we just don't have any (literally) indie coffee shops with personality.  Starbucks have put the indies that I used to go to out of business and I hope SBUX doesn't get their paws anywhere near this place.<br><br>If Two Hearted Queen were located within 10 miles of my home in Scottsdale, I'd be there virtually every weekend.<br><br>A tip of the cap to the owners and the incredibly friendly staff.", "pics": null}}, {"review": {"des": "Love coming here in the mornings. Satisfied with every purchase. I'm a fan of the regular drip coffee and a pastry, but everyone who orders the \"queen of the heart\", the signature mocha, looks happy :). The best part of this place is the small coffee shop vibe. The people take their time when they take your order, answer questions and help make suggestions. The employees seem like the most patient and genuine people, which is a total break from the normal coffee shop experience where chains and convenience rule all. keep it up guys! You are appreciated! <br>Ps try the breakfast panini! A little pricey but good to split with another person and soo yummy!", "pics": null}}, {"review": {"des": "Beautiful place, and nice clean bathrooms. :) drink was yummy too :) I think I will come again.", "pics": null}}, {"review": {"des": "A café finally suited for a queen - the real success story behind any king.  All you kings can go find a café of your own...oh that's right - you don't have one!  I guess I can share my newfound love, Two Hearted Queen, with all you men and women.  Although I'm not a big fan of sharing anything, I will gladly share this café with you.  The Two Hearted Queen deserves all the love that you can give them, and in turn they will reward you, their royal court, with great treasure...aka, delicious coffee and treats!  <br><br>Although I didn't partake in any of their sandwiches, I did try one of their signature drinks - the Queen of the Night.  It seems that in Chicago a new fad has arisen - putting salt and pepper in coffee???  The Two Hearted Queen follows in suit and in this signature drink you'll find peppercorn and Himalayan salt cleverly mixed with mocha.  In theory it sounds odd, but in reality it's really quite intriguing, but in a good way.  When first taking a sip I was taken aback by the variety of flavors mixing together, but after a couple more sips I got used to this chameleon-like drink; I came to really love the Queen of the Night after drinking it.  Every sip I took almost tasted different than the last - how weird, but how awesome?  As much as I liked this drink I'm going to leave it to the professionals here at Two Hearted Queen instead of trying to serve it up myself.  I fear I would not do well at getting the ratio of salt correct.  Like I said, I'm leaving it to the very capable servers at the Two Hearted Queen.<br><br>Speaking of which, the servers here are super cool and relaxed.  They make the café feel like the true local coffee shop that it is.  I'm sure this is intentionally done to ensure that customers feel comfortable, but I loved how the staff made the drinks and brought them out to the table once they were ready.  Since we're talking about the seating let me just cover that base real quickly.  Two Hearted Queen is an eccentric, but cozy café and therefore the furniture is totally mis-matched, but it works so well in creating a setting that is exceptionally easy to settle into.  They have a variety of couches, chairs, and traditional table settings available and although this café is not huge, it's not tiny either.  What also makes this place beyond adorable is all the signage in and around the café.<br><br>The last thing to mention is this: there is a deck of cards located right next to the cash register and when paying you can shuffle the deck and choose one card from it.  If you choose the Queen of Hearts then you get an awesome discount on your order.  I was not so lucky, but you could always be the lucky winner!  <br><br>One more thing!  They also have a \"frequent flyer\" card (as I like to say).  If you get 11 coffee's, the 12th one is free with the punch card!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TY1x9JTXrYw7yqSsifrSIg/348s.jpg", "caption": "The Queen panini, good and healthy"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DQHdOLGEiZ18VF0Rtt-Q6A/168s.jpg", "caption": "Sweet little setting"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hZP4HuBQpAudHNFI7v-DEQ/168s.jpg", "caption": "The queen of the night, awesome concoction"}]}}, {"review": {"des": "I kept hearing how great this place was from one of their regulars, so I finally ventured over to check it out. Two Hearted Queen did not disappoint. Located at the corner of Roscoe and Racine, it's a great little coffee shop with cute decor, a cozy atmosphere and really friendly staff and owners. They know practically everyone's name that comes in the door! That's a quality I really like in neighborhood establishments. <br><br>I'm a big fan of hibiscus lemonade, though their paninis also look great if you get a bit hungry. It's a solid work space with a good vibe, food, and drinks. Definitely a five-star experience from Two Hearted Queen!", "pics": null}}, {"review": {"des": "What really makes this place for me is the warmth and friendliness of the staff. Every time I visit, the baristas are extremely friendly and genuine, making the experience that much better. Of course the coffee and atmosphere is amazing as well. I appreciate a coffee shop that doesn't try to do too much. The charm and simplicity of this place makes it a solid 5 stars.", "pics": null}}, {"review": {"des": "My husband says this spot is \"A royal flush!\"  The Iced Queen is a perfect drink on a warm day and the baristas are all incredibly friendly, personable, and kind.  Their scones are also delicious.  We love visiting this special neighborhood spot and would recommend it as a Lakeview favorite!", "pics": null}}, {"review": {"des": "I am a regular here - have absolutely no complaints. The service is fantastic and unlike the service of any other coffee shop in Chicago. They have genuine, personal service vs. either a) arrogant hipster service and/or b) corporate service.<br>There isn't an arrogant vibe like what you might find at some independent coffee shops. They don't time how long you use their WiFi and passive aggressively kick you out. They serve like a restaurant and bring your coffee and/or food out to you as well as pick it up when you're done.<br>Oh have I mentioned the coffee yet? The coffee is fantastic! Unique, homemade, and lots of variety. They serve homemade scones and sandwiches as well. It can get busy, but it's never too \"bustly\" you don't want to work/study. The décor is quirky and fun. Mostly tables with a couple comfy chairs and 2 couches.", "pics": null}}, {"review": {"des": "Visiting from out of town and found this coffee shop not far from our Airbnb. I had an excellent mocha and the blueberry scone was to die for! Friendly service!", "pics": null}}, {"review": {"des": "Clean, friendly and delicious coffee. Great for studying. The ladies that work there are very nice and the environment is great. I will continue to study there for a very long time.<br><br>P.S. If you're coming here expecting a quiet place to work, this may not be the place for you. They play music pretty loud in the back area", "pics": null}}, {"review": {"des": "Good tunes, friendly staff and great coffee. Really friendly neighborhood vibe that allows for both working and chatting. Hidden gem!", "pics": null}}, {"review": {"des": "I came here tonight on a whim with the bf to grab a cup of coffee and lucky us, they were having an open mic night!  I had the iced queen with dark chocolate and soy milk and sipped on it while they wrapped up comedy night!  What a cool spot, I can't believe it has taken me so long to try this hidden gem!  I will definitely be back!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rdSLyXYFZlC11S5YNkZejA/168s.jpg", "caption": "Iced queen"}]}}, {"review": {"des": "This place deserves 5 stars for the service.. amazing staff .. fun social and always with a smile. <br><br>Nothing special about their coffee but they have a lot of speciality lattes (not my thing). <br><br>They also serve some really good teas. ( Try the pomegranate green tea ).<br><br>The place is good for studying or reading, it's not that loud. <br><br>Overall:<br>Atmosphere: 9<br>Service: 10!<br>Drinks: 7", "pics": null}}, {"review": {"des": "Super cute local coffee spot. I came with my roommate and we hung out in the back area - the place definitely is bigger than it looks! They also have a great little outdoor seating area during the summer. Service was wonderful and I love having a local spot to support!", "pics": null}}, {"review": {"des": "It is a super cute coffee shop.  Sandwiches are delicious but small.  If you are sensitive to noise, or need an outlet for your computer, then this place might not be your favorite.", "pics": null}}, {"review": {"des": "This is my favorite cofeeshop so far. Its cozy with wide option for drinks and seats. It feels like home more than a shop.", "pics": null}}, {"review": {"des": "Found this car through Yelp and soooo happy we did!! The baristas are super sweet and the little game with the cards is awesome!!! The atmosphere and seats are perfect for a chill day!! It's a great place to take friends and dates! This is my new favorite cafe in Chicago!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/M1MapWdDdBHhXDUWi7a_xg/348s.jpg", "caption": "Matcha latte"}]}}, {"review": {"des": "This was my absolute favorite coffee shop in Chicago. In all of Chicago. Yes, in all parts of Chicago. No, I'm not exaggerating. I am an avid coffee shop lover and this place was amazing. Now, they don't get all fancy with pushing brands and labels in your face. They don't use buzz words like organic, fair-trade, etc. Instead, they provide you with a warm heartfelt experience. They have amazing motivational posters on the wall. My table had a rose on it. My coffee warmed my soul. Justin and I tried the \"queen of all queens\" and the \"ice queen\". Both were amazing. Both names were awesome too. My ice queen had vanilla in it and it was great. The Two Hearted Queen warmed my heart because it had a little himalayan salt, black peppercorn, and the combination was perfect for the chilly morning. There was more than enough space there. They had books on a bookshelf and even games. Also, its fun because they ask you pick a card at the register and if it is a queen of hearts you get a discount on your coffee. Love this place.", "pics": null}}, {"review": {"des": "Two hearted queen is a hidden gem as my BFF Kris said. <br>We have been thrice now already and I had bookmarked it to try several weeks ago but just happened to walk past it on the way home from a walk the other day. <br><br>I wanted to take a look around without looking like a weirdo so I ordered a blueberry muffin to go while I did preliminary reconnaissance.<br>the cafe area is in a small entry room and the rest is almost like two living rooms. <br>there's a gigantic bathroom too.<br><br>Since going back a few times have gotten a mocha and a chai latte as well as tried several more pastries and a breakfast panini.<br><br>They allowed me to modify the panini and it was made on the spot not pre-made so it took a little time to cook the egg. totally worth the wait. <br><br>I enjoy my time at 2HQ. The music can go from too quiet making it seem almost library like to obtrusive and jarring but overall the ambiance is CHILL AF.<br><br>The people who work there have been really great and remember my drink order already!<br><br>I was also pleased to find that it is a queer owned establishment!", "pics": null}}, {"review": {"des": "The reason for the Queen having two hearts... to allow for all the additional love that goes into each cup of coffee, each \"Hello\" as you enter, the attention to the decor, the smiles that greet you, and people who care.<br><br>I may daydream at times of being a Queen, but this coffee shop will make you feel like one from the time you enter until the time you leave. My advice, grab a cappucino, order one of their new cooked-to-order breakfast sandwiches, take a seat and read while enjoying the love that fills the place.", "pics": null}}, {"review": {"des": "Pleasantly surprised by this place.  Everything we ordered was high quality, tasting fresh and fulfilling without being overly sweet or seasoned.  When we ordered, they had us pick a card out of the deck, and if we chose a queen we got 50% off an item...and we did!  <br><br>The ambience is what you would typically expect in a coffee house.  There are tables and couches you can sit at.  As we sat down and enjoyed our food and drinks, it was easy to forget that almost the entire place was full because everyone was quietly reading or working on their laptops. <br><br>This is a great place for a relaxed eating experience.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/e2PMavEnPDK9E4OnzaaVNA/348s.jpg", "caption": "Matcha"}]}}, {"review": {"des": "Love this place. Adorable, so much seating and great coffee. The seating areas are spacious and the walls colorful. Staff have been kind and helpful. Unique find!", "pics": null}}, {"review": {"des": "Great place to spend a few hours and get lunch or just grab a chai and a scone... Best scones in the city.", "pics": null}}, {"review": {"des": "Two hearted queen is a quaint coffee shop in a neighborhood location. The cute gimmick is that you receive 50% off if you pick the queen of hearts from a deck. The coffee was good but not memorable. They use Kirkland milk which is fine but nothing special. Decent place unless you are a coffee snob.", "pics": null}}, {"review": {"des": "I've been going to this great coffeehouse for over a year. They provide an excellent spread on coffee drinks, teas, and some other options. Coffee is great, and recommended place to go and hang out.", "pics": null}}, {"review": {"des": "I LOVE this coffee shop. Classic neighborhood cafe with homey decor and great coffee. You can receive a discount on coffee by selecting the Queen of Hearts from a deck of cards- very fun idea! Worth checking out if you're in the area.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/I7wdRGCl5-DNOlJC2jciqw/348s.jpg", "caption": "Watched the first snow from this cozy cafe. It was perfect."}]}}, {"review": {"des": "This place is a refreshing surprise.  You walk into what looks like a tiny counter service only coffee shop, however, in the back corner is a doorway opening to a large sitting room with multiple tables couches and chairs.  It is uniquely decorated and appointed.  The music is at a level that makes it rhythmic background music so it is a coffee shop where you can actually hold a conversation, read a book or get work done without wearing earplugs.  Keep up the good work and service with a smile.", "pics": null}}, {"review": {"des": "Extremely friendly staff and probably the best coffee I have had in the city to date. Really nice vibe and location.", "pics": null}}, {"review": {"des": "First and foremost, the people running this place are wonderful. This is my second visit here, and I was welcomed back when I arrived this morning.<br><br>I am a black coffee drinker, and I'll say that the roast on the coffee here tastes as though the beans may have been a bit scorched during the roasting process.  I think next time I'll try one of their signature drinks; a few more ingredients to the cup might ease some of the bitterness.<br><br>Refills are $1, which is a tad high to me, but I'd rather pay a little extra to support a locally owned and operated business than some behemoth chain.<br><br>I had a blueberry scone this morning, and it was yummy!  Very fresh and tasty. They also offer some breakfast panini and other pastries.  I'll definitely be back to try other menu options.<br><br>Others have mentioned the deck of cards at check-out.  You get 50% off if you draw the queen of hearts.  (For some reason, the jack of spades has been my choice both times I've been here.) They also have a rewards card, so be sure to get yours when you go.", "pics": null}}, {"review": {"des": "Quickly becoming my favorite coffee. Not just because of the quaint environment but because I bought a bag of their small batch roasted coffee, Elixir and had the nicest coffee pressed black \"elixir\" since I moved to Chicago from California where we are blessed with many good coffee houses.", "pics": null}}, {"review": {"des": "Hip and soul atmosphere. Very cozy. Has lots different sitting areas. Has good music that is not too loud. You can definitely hear have  conversations. Good mixture of feelings when I'm here. Coffee and teas are tasty. Their hibiscus lemonade is definitely a must have", "pics": null}}, {"review": {"des": "This is by far my favorite coffee shop in Chicago. The location is in a lakeview neighborhood away from the hustle and bustle of major commercial streets. The staff/ owners will make your drink on point and genuinely look like they enjoy being there. Lots of seating with a warm cozy feeling. So happy I found this place and can support a new small business that deserves recognition!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/V-SK7i67AZbXSebmuLu6bg/168s.jpg", "caption": "Best iced mocha! Always make it perfect for me! Love that they use Monin chocolate sauce."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RoOtd9GT4vlpaVZ-f46xvQ/168s.jpg", "caption": "Ambience makes you feel like you're in a small town!"}]}}, {"review": {"des": "Quaint and comfortable. Pour over is decent, but nothing to shout about. Better than most tho", "pics": null}}, {"review": {"des": "I love this gem of a coffee shop. Great coffee, friendly staff and perfect atmosphere for working and reading. It might seem off the beaten path, but this coffee shop is worth the effort to visit.", "pics": null}}, {"review": {"des": "How often do I think of this place? Probably every other day. See I live across lake and land all the way in Detroit but that doesn't stop my mind from wandering to the most delightful coffee and breakfast house I've been to. The coffee was insanely good. I have reviewed many a coffee shops and this is my favorite ever!! Now let's talk food .... Breakfast sandwich was literally perfect taste wise and they present it in the shape of a heart - not even kidding. What is this place?? It is the best. Lavender scones .... Life changing. I don't know how I am supposed to live so far from this glorious place.... life's not fair, guys. I digress, the staff..... Honestly their coffee and food is so good that I would not even care if they were big jerks but guess what - they are amazing humans. Excellent service, so kind and genuine and helpful. The air is full of friendliness. The space is incredible too it really is a coffee HOUSE - whether you need a small table by a window, a large table to spread out tons of books or work on, couches to meet with a group of friends, a chair for some alone time with a book, a quick seat at the \"bar\" when you're in a rush.... They have it all. I cannot recommend this place enough, truly. It will be my first stop when I make it back to Chicago.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yVsSM5L4JJUvEDrpjLLWPA/348s.jpg", "caption": "The best."}]}}, {"review": {"des": "This place is another great coffee shop in the north side . The coffee is great and so is the breakfast sandwiches ! <br>It is really a great place to read and get work done . <br>The only downside to this place is parking ! The parking is permit parking and after 6 pm is when you need a permit .", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6W1YZfD1NG4OukkleJUNhw/168s.jpg", "caption": "Latte"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jKzUMqULaM-WajBCDb-orA/168s.jpg", "caption": "Egg sandwich"}]}}, {"review": {"des": "Great place to work/study. Friendly staff. Delicious sammies and of course delightful coffee. This is my go to place for working remote.", "pics": null}}, {"review": {"des": "This place deserves all 5 stars. They operate not only as a coffee shop but a community center that enriches community efforts around the neighborhood as well as where they source they're coffee. As their website explains,<br><br>\"this coffee house is intended to fund land ownership in coffee country to begin work on a community system of people who can farm the land while sustaining their families.\" This is just one \"heart\" of the \"Queen\"...<br><br>The second \"heart\" represents the surrounding community of coffee drinkers, family, and children. The shop operates as a place where \"people feel less like customers and more like family.\"<br><br>You wont get a more comforting and welcoming reception when walking in. You can feel the cohesion throughout the shop as people are relaxed in one of the many almost home-like seating options. Add in fairly-priced, house roasted coffee, good food, good music, you get nothing but good vibes.", "pics": null}}, {"review": {"des": "Wow!! Just starting to deviate from my typical Peet's coffee shop work days! Super glad I checked this gem of a coffee shop out! Scotty took my order and customized my beverages while making me laugh and Rachel had such a servant spirit! Even offering to re-steam my beverage if it got cold to make my coffee aesthetically pleasing in the beautiful ceramic coffee mug :) she didn't have to because my QUEEN of the NIGHT coffee with almond milk (only 48c extra vs 60c) was GONE in a mere 20 min because it was SOOO good. Like nothing I've ever had at Sbucks or Peets. Way to go, 2HQ!! I'll be a regular from now on!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2bvdt_cypFZHmCYkjFwXTw/348s.jpg", "caption": "A mompreneur (mom + entrepreneur) rocking it!! Love this place!!"}]}}, {"review": {"des": "I wish I could give this place a good review because the people seem friendly and the place is nice and spacious. I've been looking for a good local coffee shop to work from and this place looked really promising. Unfortunately, the drink I received might very well be the worst I've ever gotten from a premium-priced coffee shop. <br><br>I ordered their specialty drink \"Queen of the Night\" mocha and what I received was a lukewarm, over-extracted and extremely bitter beverage. It lacked any creaminess or hint of chocolate you would expect. I had to add sugar, something I rarely ever do, just to drink it. Thankfully, my husband didn't order anything here so I didn't feel bad going to Intelligentsia on our way to the lake. I ordered a mocha from there too and lets just say there was no comparison what so ever. <br><br>I really hope this experience was just a fluke. The barista was not one of the two owners shown on their website so it might just be an employee that screwed it up. Unfortunately, I would not be returning to take that chance.", "pics": null}}, {"review": {"des": "Couldn't ask for a cozier atmosphere. After our initial selection for a place to sip coffee and get some work done turned out to be far too crowded and loud, we stumbled onto Two Hearted Queen, and glad we did. The Italian soda was flavorful and not too heavy as it can be in many other locations, and the chai was smooth and nicely spiced. I would have loved to try some of the house blended teas, but as it was, Queen is a down to earth place, spacious and comfortable, lots of good seating and a bookshelf of interesting volumes if you did t bring anything of your own to read.", "pics": null}}, {"review": {"des": "I live nearby and had no idea this place existed. It blends in perfectly with the corner dry cleaning shop and the houses in the surrounding neighborhood. But once you're inside the interior is spacious, clean, colorful and the baristas/owners are super friendly. Coffee is great and hanging out here is even greater. They also do a neat little thing where you turn over a card in a deck of cards and if you happen to get the Queen of Hearts you get half off your order. This is an excellent spot to hang out and have coffee, and finding out about it late is better than finding out about it never.", "pics": null}}, {"review": {"des": "One of my favorite coffee shops in Lakeview. Great signature coffee socials, fantastic sandwiches. And don't make start talking about the service, they are amazing and super friendly and nice.", "pics": null}}, {"review": {"des": "This place is so great. It has amazing coconut based drinks and great veggie sandwiches. And I love the entire design of the space. One of my favorite places in Chicago", "pics": null}}, {"review": {"des": "Coffee is great and those chocolate coconut chai scones are to die for. The staff is incredibly friendly. This is the perfect coffee shop for studying/working. Also, there is plenty of parking (from 6am to 6pm). By far my favorite coffee shop in Chicago.", "pics": null}}, {"review": {"des": "Yum! Coffee was fantastic- real depth and flavor. Panini also yummmm.  Service yummy, attentive and warm. Drove out here from the burbs to hang for the day and really enjoyed it!  I just want more food choices- muffins, pie, and that would get me to 5 stars.", "pics": null}}, {"review": {"des": "This is definitely a go to place for studying, great coffee/tea and a meetup with a friend or two. The atmosphere is laid back and the workers make you feel welcomed anytime!", "pics": null}}, {"review": {"des": "This place is such a hidden gem. Nestled in a quiet corner of a humble neighborhood, this place is perfect if you wanna get way from the craziness and cozy up on a couch to get work done. <br><br>The inside is super comfy with couches and bucket chairs at random corners. I had an iced coffee that was served in a mason jar. I really enjoyed my coffee and it was the perfect refresher after being out in the sun for awhile. They also have pretty good background music, so I didn't need to plug my earphones in at all. <br><br>I got hungry halfway through and got myself a cookie for $1.25 each. And let me tell you, their cookies are the best. So good that I nabbed the last two to take home for my roommates to try. They loved it as well. <br><br>Definitely give this place a try if you're looking for a new place to hang and chill out with a good cup of coffee :)", "pics": null}}, {"review": {"des": "What an adorable coffee shop!! Must try the \"Queen of All Hearts,\" so good!! Good drinks and food! Will definitely be back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XGM5SkHk7f8N9Hgw8Cckcg/348s.jpg", "caption": "So cute!!"}]}}, {"review": {"des": "A very cute coffee shop in the Ravenswood neighborhood. minimalist Bohemian atmosphere and super friendly staff. Give it a go!", "pics": null}}, {"review": {"des": "I work from this coffee shop about 3 times a week. Amazing staff, amazing coffee (especially the espresso), and a great vibe.", "pics": null}}, {"review": {"des": "Just moved from Dallas to Chi, and this was probably the first businesses I visited in Lakeview. The ambience keeps bringing me back. Excellent staff. Excellent coffee.<br><br>This place is the definition of a fair trade community coffee shop that offers plenty of cozy seating and wifi to get work done.<br>The baristas go above and beyond to serve the interests of their customers.<br>Iced Coffee is one of the best blends I have ever tasted. If that's not your thing- try their signature coffee drinks or smoothies. Limited food options (Paninis: 1 Veggie and 1 w/ham, pastries, snack bars), but they are crafted very well and taste great!<br><br>Gold Stars to this coffee shop and the baristas who run it.", "pics": null}}]}