{"name": "two-restaurant-chicago", "reviews": [{"review": {"des": "My wife and I went here for our anniversary based on a recommendation from a friend. It was perfect for the occasion and the food was amazing.<br><br>The maitre d made us feel like we were the only ones there on a very busy Saturday and the waitress steered us to some fantastic plates. <br><br>My favorites were the homemade bread with edamame hummus and the mussels in a curry broth. Both outstanding!", "pics": null}}, {"review": {"des": "A friend and I came here for dinner last night.  The restaurant is cute and unpretentious. <br><br>Service was a little lacking at one point in time we had a 30-minute wait between dishes and we didn't see our server the entire time.  Not a great experience.<br><br>Based on several of the reviews I read on yelp we ordered the Edamame Hummus (I think the dish is actually called \"Homemade Bread\" )- the dish was fine but the combination of the light flavor of edamame and hummus wasn't particularly mindblowing.  <br><br>Next we had the Duck Fat Potato Croquettes.  They came with a slightly spicy dipping sauce... only the sauce was really too thick to dip and the crust on the croquettes was actually -very- firm.  Ultimately, it was just deep fried potato without much flavor.  <br><br>After the croquettes, we had the mussels which were the low point in the meal.  The sauce (a coconut milk sauce-- kind of like a pangang curry) was delicious but it didn't go well with the mussels and I don't think the mussels were fresh... though this is chicago and this isn't prime mussel season so I can't expect much.<br><br>Finally, after 30 minutes of waiting, we have the cavatelli which was fine but the balance of salt was off-- it was just too salty.  <br><br>I struggled between 2 and 3 stars but I think this is a more honest assessment on where our meal ended up.  \"meh, I've experienced better\" basically sums it up.", "pics": null}}, {"review": {"des": "I took my mother to Two for a birthday dinner last Friday and we had a great experience. The wait staff and manage were so friendly and inviting - it really made our experience. I called to let them know it was my mom's birthday and they brought her a birthday dessert unprompted. <br><br>The menu is always changing and quite affordable for the quality. We tried the duck fat potato croquettes (which were light, fluffy & phenomenal), seasonal squash, walleye with farro and ricotta cavatelli. Everything we tried was delicious and really well done. They also offer a wine pairing night... we will be back!", "pics": null}}, {"review": {"des": "The food was amazing!! Service was great!! <br>The customed the menu to include my sister name. Every dish we had was so flavorful.  Their drinks were just as good too.", "pics": null}}, {"review": {"des": "*3.5 stars* <br><br>I was all ready to go here and convinced my family to dine here rather than at a buffet for a little more money, due to the great reviews. <br><br>We dined here in June for my brother's graduation. It was easy to make a reservation and even easier to move up the time to around 5pm (said it was less busy). <br><br>Ambiance: Nice and simple. My folks weren't too impressed because hardly anyone was eating at this hour and the neighborhood was quite empty. <br><br>Service: Can't remember our waiter's name but he came around often enough to check on us. <br><br>Food: Potato croquettes - I love apps like this. It was perfectly crunchy on the outside and creamy on the inside. Loved the sauce too. 5/5<br><br>Arugula salad - good portion and refreshing. Would have been nice if the bacon was cut up rather than one big piece. 4/5 <br><br>Duck egg fettuccine - I was really looking forward to this dish but it wasn't anything I'd write home about. The duck was pretty salty (as duck usually is) but the pasta was harder than I like. This dish is enough for one person but I didn't even finish the pasta because of its texture. 3.5/5 <br><br>Alaskan halibut - my mom thought it was good but wasn't wowed. 3.5/5 <br>Double cheeseburger - big burger but my dad said it was too salty for him. 3/5 <br>Prime hanger steak - my brother ordered this first and liked it, but the portion was way too small for $25. 4/5 <br>Berkshire baby back ribs - my brothers enjoyed an order each, said it was yummy, but wished it came with a side of anything (rice, potatoes, etc). They also said it was salty. 4/5 <br><br>Other cons: Saffron spaghetti wasn't available today and my mom's heart (and tummy) was set on it. Also, I asked after the meal if they have dessert for celebrations (I told them ahead of time it was a graduation dinner). Our waiter said no...they don't have special dessert for that. Hmm, usually dessert for celebrations is right off the menu so I don't see why they couldn't do that here? I don't normally ask ahead of time but I should've in this case. <br><br>Overall, everything was okay or even good but not amazing. Most likely will not return.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/thESsPzWpMAhOYW_IKZ-uw/348s.jpg", "caption": "Arugula salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DINBI4_gLmWcGNqCXS_OhA/168s.jpg", "caption": "Potato croquettes - best thing I ate here"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uvVZ_Teo0UAy0_7ZsHq6-Q/168s.jpg", "caption": "Duck egg fettuccine"}]}}, {"review": {"des": "I really like TWO and think that the chef and staff are extremely talented. I think that's why I was so disappointed after my last dining experience and subsequent email.<br><br>I'm a big fan of TWO's wine education dinners. They're about once a month, $55, and a three-course prix fixe with wine pairings. It's an absolute steal and a great way to learn about wines.<br><br>My spouse wanted to join me at one of these dinners but is vegan. I noted that in the reservation. Yamandu, the manager called me and we discussed the changes to the menu for my spouse, agreed to still pay $55, and understood that the pairings might not go as well with the modified menu. It was a lovely conversation and I even agreed to buy $75 worth of wine from a previous wine education dinner!<br><br>We arrived and everyone was served a fish crudo for the first course. My spouse got a leafy salad. The second course was pasta with shell fish. My spouse was given asparagus spears. Finally, the third course was duck and my spouse got a dish of broccoli florets.<br><br>The vegan offerings seemed out of character with the standard of excellence usually provided by the chef and the staff. We were both disappointed. I waited weeks after the dinner and then emailed Yamandu and it has been over a month and still haven't had a response.<br><br>I was hoping that the dinner was just a misunderstanding or that the regular chef wasn't there. Yamandu seemed to know what vegans eat and it would absolutely astound me if the chef thought that vegans can only eat lightly seasoned vegetables. Anyway, it was a mind-boggling experience and my attempts to reconcile have been unsatisfied.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/a9aC4T6-TGymHQGCxDAxEw/348s.jpg", "caption": "Beef Wellington"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Yawd6T3ydxLhOHCMC4-n4Q/168s.jpg", "caption": "Pan roasted Mediterranean Sea Bass"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RqTi2kazrVIf5NZ_rB9tfg/168s.jpg", "caption": "Citrus cured Ora king Salmon"}]}}, {"review": {"des": "I'm between a three and four stars on this one, but decided to round up given that I really enjoy the tapas style of dining. They recommend that you order 2-3 dishes per person and I think 2 dishes per person is perfect amount if you don't want any leftovers. As for their food, I liked the variety on their menu but wasn't blown away by any particular dish, although I did enjoy each individual dish. The best dishes we tried were the walleye and the PEI mussels. I would come back due to the seasonality of their menu, just to try out new items.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bfHI1qX7O4eXV-FPQcXk4Q/348s.jpg", "caption": "Homemade bread"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vRMa7293ynYKXcRs5G2eIg/168s.jpg", "caption": "Walleye"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ob_dljv0_C-_xkYpW4nHXQ/168s.jpg", "caption": "Duck fettuccine"}]}}, {"review": {"des": "Came here for the first time yesterday and was very impressed. Reservation was easy to make, was greeted when we first walked in. Love the modern interior design, everything about this place just pulls you in. They have a huge wine list, a lot of bourbon options as well. <br>The menu is tapas style, usually 4 dishes is good for 2 people. We had the duck fat croquettes, sea scallops, burger and duck fettuccine. We ended up getting a second plate of croquettes, it's simply amazing. The scallops were great, but didn't knock my socks off. The burger is a must try, super juicy and fettuccine is just alright in my opinion. <br>Over all had a great time.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/woRBDJC4-R5S-lk8ucubVw/168s.jpg", "caption": "They can add alcohol to this non alcoholic drink if you ask."}]}}, {"review": {"des": "We came for a chef's tasting menu and it did not disappoint. They didn't stick us with trash wine, which was nice. I'm always amazed by how restaurants can make salad desirable. The trout was perfectly cooked with crispy skin. The steak was to fucking die. I thought that'd be it but then they brought some kind of duck fettuccini that was so flavorful and amazing. And for dessert, HONEY CHEESECAKE WITH RASPBERRIES it was a dream come true.", "pics": null}}, {"review": {"des": "Made a reservation for two on a Saturday around 7 and when we got there it wasn't too packed. The service was prompt and our waitress had us start off with drinks and explained to us that their dishes are meant to be shared and that they recommend around 3-4 dishes for the meal.<br><br>We started off with the homemade bread which was probably my favorite out of everything. So soft and warm. The honey butter was delicious while the edamame hummus was a more fresh taste which was great too. <br><br>After that they brought out all our dishes one after another just as we were finishing each which was great timing. The octopus and prime hangar steak were amazing. For the steak, you would never think to put coconut in corn but damn it's good. <br><br>Overall, I loved this place and would definitely come back when I get a chance. Make sure the make a reservation bc by the time we left it was definitely a full house!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Q6efhha_iiwZT12Ps-_MRw/348s.jpg", "caption": "Prime hangar steak"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/U7E8TQKiKpZ0AQxvHXxFGg/168s.jpg", "caption": "Octopus"}]}}, {"review": {"des": "I suggest making this your next stop. Good ambiance, good service, good vibes, GREAT food. <br>Started with the homemade bacon jam and the duck fat croquettes. Both delicious, no comparison because they're so vastly different but if I had to choose one again I'd probably order the croquettes- they were perfectly crunchy, fried, and creamy. Soooo tasty. Also tried the Brussels sprouts but they were my least favorite, they tasted boiled and flavorless so I could've gone without those. The short rib cavatelli was also one of my favorite dishes. Just a really delicious and comforting bowl of fresh handmade pasta. <br>  Ended the meal with the s'mores panacotta which was... fine.. didn't need dessert but I guess it was nice to end the epic meal with something sweet. Four dishes between two people is the perfect amount of food. <br>Make your reservations and try this place... stat!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tSrepzJ-lZpKpUm7ply-pw/348s.jpg", "caption": "Brussels sprouts"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/AJgED3VJV_hcbEnege-mbw/168s.jpg", "caption": "S'mores"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2Q5udvIlmSKlTIYC34CI-A/168s.jpg", "caption": "Duck fat Duck fat potato croquettes"}]}}, {"review": {"des": "Well, four and a half stars...my dining companion thought the Potato Croquettes were a bit too salty.<br><br>I'm leaning heavily towards the five full stars.<br><br>We were warmly greeted at the front and led to a cozy window table in the corner. When we arrived, we were the only diners. But that quickly changed.<br><br>A Groupon rewarded us with four courses and dessert, chef's choice, and a bottle of wine. <br><br>For starters, we were presented with a fresh Arugula Salad with Jicama, Manchego Cheese, and Bacon. It was the precursor to a wonderful dining experience.<br><br>Next, a nicely grilled Sea Bass with Trumpet Mushrooms and Zucchini. The fish was very fresh and prepared nicely, drizzled with a bit of olive oil. The sauteed mushrooms and zucchini complimented the seafood nicely.<br><br>Hangar Steak with Green Garlic Sauce and Cauliflower Mushroom was served next. The steak was grilled to a perfect medium rare. I had never heard of Cauliflower Mushroom (Sparrasis) before. It was delicious. The Green Garlic Sauce was not overpowering.<br><br>And finally, Fettuccine with Duck Confit and Duck Cracklings. This might have edged out the Sea Bass as my favorite course of the evening. It was very rich. Delicious!<br><br>We had read a lot about the Potato Croquettes. Even though there was an additional charge for them, I went ahead and ordered. I really liked them, but my companion found them a bit too salty. A spicy aioli accompanied the crispy, but pillowy, potatoes.<br><br>And for dessert, we were presented with the chef's take on S'mores. It was a velvety chocolate, almost pudding-like, but firmer, with Graham cracker crumb sprinkles and a dollop of marshmallow. A deconstructed take on the popular campfire dessert. The coffee I had after dessert was very good.<br><br>Service was very friendly, helpful, and professional. The atmosphere was pleasant and quiet. <br><br>This would be a nice place for a first date. Prices are moderate, but the high quality of the food makes it a bargain.<br><br>We will be returning to try more of their menu, but I may just order the Duck Fettuccine again.<br><br>Highly recommended. Great date night place, or dining out with a group of friends.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3THuggRaxZtvtf3_w8ZBgw/348s.jpg", "caption": "S'mores."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Wdd-cc0NpTTl0oGJnNNz9w/168s.jpg", "caption": "Potato Croquettes."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/j5UT8530XenTm_lukqOtUg/168s.jpg", "caption": "Fettuccine with Duck Confit and Duck Cracklings."}]}}, {"review": {"des": "I LOVE places like this!!!!!!! Kind of smallish, neighborhoody type eateries that don't bill themselves under the \"moniker-du-jour\" of bullshit titles like \"gastro pub\" or \"eatery\" etc..... Two is simple:  varied and diverse spirits and wines (more on the wines later) and smallish plates that are in a word.... one better than the next.  Now my caveat to this review is that this was a business dinner, so my lack of photos will have to be replaced by my exceptional prose........ thus I will do my very best to appease you all!!!!!<br><br>My colleague and I arrived early, so we sat at the bar and ordered a cocktail as we awaited our others.  Graham was a welcoming and efficient bar steward as we perused the generous offerings that I believe.... are tilted to the spirits.... and thus I chose a semi familiar \"Weller's Antique\" with a sphere cube for a competitive price of 14 bucks on the pour.  We were seated in the main dining room and our attentive waiter navigated ya through their \"small plate\" array that was ample, varied and all locally sourced from what they tout.  We were a hungry bunch so we ordered a lot of dishes and the kitchen paced the parade appropriately.  Our first dish was the heirloom tomatoes with home made bacon..... or more like pork belly.  This dish is greatness incarnate.... a generous slab of glazed belly balanced with acid and cream with the fresh tomato and aioli.  14 bucks seems a bit steep for this plate but I digress.  I could go through every dish but that would take far too long.... and they were all expertly executed and amazing in their own right, even the home made bread made this gluten light foodie break the ole' diet.<br><br>The standouts were many but the cheeseburger was the stuff of dreams: rich and fatty with a deep beefy flavor nestled in a fluffy but not overbearing bun.  The duck confit pasta was amazing too as the homemade noodles had that doughy freshness one only gets when made fresh.  The grilled octopus was perfectly grilled with crunch edges and a tender middle..... and oh the hangar steak........ medallions of rare high quality hangar served atop a sweet corn succotash of sorts..... wow. .....so you can see that they do cuisine amazingly well.<br><br>So why not 5 stars you may think?  Here's why.  Now let me declaim that I am not a sommelier by any means but as a wine enthusiast and playful collector I know a thing or two about the trade.  My colleagues ordered the Trapiche Malbec which I would have advised against based on the markup.  This label, while it's a decent and cheap red, was priced at 40 bucks though I know it retails in your average supermarket for about 10.  My frugal Argentinian mom stocks this bottle by the gallons at her home.  But no matter..... I was given the wine list from that point on from which to choose.  I stayed with the Italians beginning with a 75 dollar Tuscan blend.   This was a business dinner so sending anything back or refusing a wine, to me, is in bad form, but had I been with family or friends, I would have refused this one as the price tag did not..... did not....... match the quality here.  It was as flat and unexpressive as the Trapiche, which my colleagues declaimed was better than the Tuscan.  I tried once more with a 50.00 bottle of something out of Tuscany, probably a Chianti...... and again it was a dud...... I worked so hard to extract the clay and mint and mushroomy undertones of the region..... but they were not there.  Constructively speaking I would encourage TWO to assess their wine list and pricing format to make certain they are providing an appropriate experience to match the quality of their dishes.  I fear they are overreaching on markups and under-reaching on wine quality, thus dumbing down the overall experience.<br><br>While I look forward to coming back to TWO in the future..... I may stick to the whiskey next time..... <br><br>Gotta keep it as real as ever!!!<br><br>Robbo, Parker, CO", "pics": null}}, {"review": {"des": "I loved it.  TWO has been on my list for several years and I used restaurant week as my opportunity to try it out.<br><br>I asked the server for a glass of pinot noir to start and was surprised by how smooth it was!  Such a great way to start things off.<br><br>I am not the hugest fan of Brussel sprouts, but the ones at TWO are among the best I've ever had.  They were cooked and seasoned perfectly.  I'm told the bisque was tasty as well.<br><br>I also had the spaghetti which was a more interesting dish than you might think (bacon always helps).  For our main entrees, I had the wagyu brisket and my friend had the pork tenderloin: both were good, I probably preferred the pork even though it was a touch too salty.<br><br>The nutella panna cotta was wonderful, it was light, smooth, and delicious.  Service was average, not as good as what I expected, but not bad.  But the food was amazing and that's the most important part.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/85nU8I3_vF8lZlHMQmv16Q/348s.jpg", "caption": "Shrimp and crab bisque"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LuMSgvvN8oRWBabomz5hDw/168s.jpg", "caption": "Nutella panna cotta"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/G9Bmfoto6DSuNJg1HEE3Hg/168s.jpg", "caption": "Pork tenderloin with sweet potatoes"}]}}, {"review": {"des": "TWO was the BEST surprise of Restaurant Week. I can already say that I will be back again and would recommend to friends in a heart beat. <br><br>I love what it's about - sourcing locally with an ever changing menu. The food is innovative and unique without being pretentious. I love that I can come here in jeans and feel at home while dining on spectacular food at extremely reasonable prices. <br><br>Restaurant week was a phenomenal value. $33 for four courses!!<br><br>I chose;<br>CRAB BISQUE - unabashedly briny with rich crab flavor. the portion size was small but was perfect for how rich it was. the chili oil added just a hint of heat <br>GULF PRAWNS - three large prawns with creamy grits. the sauce was peppery and a great balance for the richness of the grits. <br>SPAGHETTI WITH MUSHROOMS - I tasted my friend's homemade spaghetti and it was amazing as well. the mushroom almost smacks you in the face with flavor (but in a good way). the spaghetti was also handmade and perfectly cooked. <br>WAGYU BRISKET - I love brisket and this brisket was beautifully tender. the sunflower pesto was super unique and added just the right amount of crunch!<br>NUTELLA S'MORES - I could have eaten five of these. I was so full but I could have eaten so many of these. I would come back just for this alone. <br><br>Overall, yes yes yes!! I can't wait to come back and try their new innovative dishes next year for RW 2019 and for many weeks in between.", "pics": null}}, {"review": {"des": "I visited Two Chicago this week for their Chicago Restaurant Week Menu. I made my reservations through Open Table for my friend and I. We arrived at the restaurant a couple minutes after our 7p reservation. <br><br>There are two spaces to the restaurant - the front bar area with communal tables and the main dining area. We walked in and were slightly confused but saw the host stand and approached it. <br><br>From the time we walked into the restaurant to the time we reached the host stand no one greeted us. As we stood at the host stand, a few servers looked in our direction and/or walked by but still no one greeted us. <br><br>Then finally, we were acknowledged by the host (who may have actually been the manager), but he could not find our reservation at first. I don't know if this was due to the restaurant or open table. Even though our reservation was found, there were no tables available. We were told it would just be a few moments as some tables were paying their bills. <br><br>In the meantime, we stood near the host stand with our coats and just felt like we were in the way. It was actually quite awkward. I wish the host or manager would have handled the situation better. He could've asked if we wanted to sit at the bar or offered to take our coats while we waited.... really anything. <br><br>We were finally seated around 7:20p and ordered from the CRW menu. Items came relatively quickly. For the most part, portions were small but food was tasty. Some items were better than others but overall I enjoyed everything. While we were enjoying the food, I was a bit disappointed that our server never checked in asking how we were doing or if we needed anything. <br><br>We tried almost everything on the CRW Menu, which I posted below, except for the Pork Tenderloin. The shrimp and crab bisque was good but it was such a tiny portion. We also enjoyed the brussel sprouts. Though not the best I've had, I liked the addition of the chorizo and feta. The prawns were quite tasty but the spaghetti dish stole the show. This was definitely one of the best dishes on the restaurant menu. It was packed full of flavor and so delicious that I am actually going to try to recreate it at home this weekend. The brisket was also quite good - it was so tender and juicy and bursting with flavor. <br><br>I appreciated that most of the menu is gluten free and they also offer vegetarian options though I found out that another friend of mine was dining at Two the same night as me. She is vegetarian and they offered her the same dishes minus the meat... not really sure how they could present the 3rd course as an option though.<br><br>Two is one of the few places that offers a bonus 4th course - dessert - which was a Nutella s'mores pannacotta. My friend and I were pleasantly surprised by this dish. It was light and sweet but not too sweet and just very enjoyable. With that being said, I also found out that someone else I know dined at Two the following night for the CRW menu and the Nutella pannacotta was served completely different from the night before - not sure why. I believe consitency is key to qulaity.<br><br>Two definitely offers one of the best restaurant week deals with 4-courses at only $33. The deal was great and the food was delicious but service was definitely lacking.<br><br>When I patronize an establishment, I expect to feel welcome and treated well. Unfortunately, I felt like more of a bother than a guest from not being greeted to being made to feel awkward while we waited past our reservation for a table, and then feeling rushed as we ate our meal. <br><br>It wasn't the worst experience but it definitely wasn't the best. Knowing that other friends of mine experienced similar poor service is a red flag to me. Two may serve incredible food but their service needs to improve. <br><br>Based off my one experience I am hesitant to go back though at the same time I won't rule it out as I believe everyone deserves a second chance. <br><br>CRW Menu<br><br>1st Course<br>Shrimp and crab bisque, homemade bread, chili oil<br>or<br>Roasted brussel sprouts, homemade chorizo, feta cheese,<br>Aleppo chili vinaigrette *GF<br><br>2nd Course<br>Gulf prawns, heirloom grits, pepperonatta *GF<br>or<br>Homemade spaghetti, wild mushrooms, homemade bacon, porcini cream<br><br>3rd Course<br>Smoked Slagel Farms pork tenderloin, sweet potatoes, cilantro vinaigrette *GF<br>Or<br>Wagyu brisket, sunflower pesto, confit sunchoke *GF<br><br>Bonus Course<br>Nutella 's'mores, Nutella panna cotta, homemade marshmallow, graham<br>cracker crumble", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LPUfaLafeHyTREBPRvcK7w/348s.jpg", "caption": "Nutella ‘s’mores, Nutella panna cotta, homemade marshmallow, graham cracker crumble"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7pTjzVzJGXXvs78Fh71Djg/168s.jpg", "caption": "Wagyu brisket, sunflower pesto, confit sunchoke"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HfG03c9f1KLfKaMPt_mrYA/168s.jpg", "caption": "Gulf prawns, heirloom grits, pepperonatta and Homemade spaghetti, wild mushrooms, homemade bacon, porcini cream"}]}}, {"review": {"des": "Restaurant week menus are sometimes a hit or a miss - TWO's selection was definitely a hit for us!! Service was very attentive and friendly. <br><br>The dining area has 2 separate sections, one with individual tables and one with the bar and a communal seating space, which is pretty unique. Has sort of that modern rustic feel.  <br><br>We enjoyed all 4 courses and were impressed with the value and quality. Bisque was a nice creamy starter, the prawns were large, the spaghetti had this unique white sauce that was delish, and the brisket was so tender and juicy in the stew/broth. The panna cotta was very tasty to finish the meal. They also have a cocktail and beer selection. I forgot which cocktail I had but it was the right balance of alcohol. <br><br>Will come back to try other menu items!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/46jXACMQw_GCo1kp94vdBg/348s.jpg", "caption": "Posted restaurant week menu 2018. some items were changed."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5iPvPtquOCh9FPrXxMEVQg/168s.jpg", "caption": "Shrimp and crab bisque"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4rWZBtw9FqGNVnca5fpqSg/168s.jpg", "caption": "Roasted Brussels sprouts"}]}}, {"review": {"des": "The sharing of small plates was really fun and delicious. The atmosphere is cool and laid-back but the food is top notch. Everything was delicious. I liked the beer and goat cheese pita bread as well as the pork Ribs and beef ribs. Everything was fantastic. Don't forget to end with a cheesecake and cup of coffee. You won't regret it.", "pics": null}}, {"review": {"des": "A great place for dinner for a group of people. They serve food similar to tapas style. If you are group of 4 I would recommend 6-8 dishes. (Basically multiply the number of people by 1.5 and 2 to get the range of dishes)<br><br>We tried a lot of plates and all of them were great!!!<br>We were four and ordered halibut, scallops, ribs, the special (beef), broccoli, mussels and a dish I can remember it's name but was the most delicious! <br><br>For dessert we went for both the cheesecake and the Nutella s'mores. Both were great but I liked the Nutella more.<br><br>Overall great place to share food with friends and prices are reasonable.", "pics": null}}, {"review": {"des": "Two comes off as a neighborhood whiskey bar kinda place, but its much more. Its called two because all the decor is re-purposed, on it's second life. Also its the 2nd restaurant for the owners.  Locally sourced products, well curated. Unfortunately I was a little under the weather dining there, so I couldn't really booze it up much, (did have a couple anyway) but I could taste food. Two was very good indeed. My favorite, most memorable dish was the scallops on a spicy Brussels sprouts hash- Perfect scallops, creamy, spicy shaved sprouts, damn fine. Duck Confit pasta was a winner as well, Duck fat fried potato croquet - creamy deliciousness!   A memorable meal, excellent hosts, who put up with our constantly changing party number....without any attitude. Highly recommend.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XWsga5WMenrqUNyv5gWfew/348s.jpg", "caption": "Broccolini"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KtGAcsfmw3nXfWswpP2emA/168s.jpg", "caption": "Chile cream sprouts with scallops"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hVerK5h6kyuBKZH5xwx99g/168s.jpg", "caption": "Bells Two Hearts IPA - yum!"}]}}, {"review": {"des": "Pretty good food! This place is worth checking out for the duck fat potato croquettes alone. They are so delicious! My fiancé got the burger and fries. The meat on the burger was well cooked and well seasoned. I got the crab pasta. It was a pasta dish with crab soup topped wit Thai chili and peanuts. It was interesting, but a little weird. We finished the night with the honey cheesecake which was quite delicious. <br><br>Overall, this place has pretty good food and excellent service. Worth checking out if you're in the area.", "pics": null}}, {"review": {"des": "From the moment we walked in the door, the service was excellent. The host/manager had awesome energy, took our coats, welcomed us, sat us. Our waiter, Oscar, was perfectly attentive - always there when we needed him but not over bearing. The food was delicious and the puppy chow as dessert was SO GOOD. Will definitely be back. Thank you Two!", "pics": null}}, {"review": {"des": "Came in for restaurant week and had a great meal!! Our party was seated immediately at our reservation time, our water glasses were always full, and our waiter did not pressure us into getting stuff that's not on the restaurant week menu aggressively, as I have seen happen some places.<br><br>They had 2 cocktail specials for RW, an old fashioned and a lemony pineau de charentes drink. Both were amazing and a steal at $9.<br><br>I tried the brussel sprouts 1st course, which was delicious. The bisque option is also a great choice (stole a bite from a pal). The prawns and grits was maybe my favorite course, the green sauce and creamy grits went together so well with the prawns! I had the roast pig over the wagyu, which came with sweet potatoes. I thought it was a little salty, but would eat it again. FINALLY THE NUTELLA DESERT JUST WOW. Elevated s'mores are IT", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1PgkE0kIfbJ5yVx4Y40RRQ/348s.jpg", "caption": "RW 2018 Brussels"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FtrydwFgP8iQJfrt_uvCxg/168s.jpg", "caption": "RW 2018"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Kpt4NrzQ_3wZaHK_GXZBog/168s.jpg", "caption": "RW 2018"}]}}, {"review": {"des": "My hubby and I love TWO! We live down the street and every time we go I say \"we don't come here enough!!\" It's foodie small plates, and everything is unique and delicious! Their menu is ever changing but we have had consistent great experiences. Don't leave without the puppy chow dessert- even if you get it to go! Nothing special but just some delicious homemade puppy chow.;)", "pics": null}}, {"review": {"des": "Amazing first time experience. We came here for our 6 year anniversary. We had reservations but there was a bit of a wait so we went to the bar, which was packed. Excellent drinks. Especially this coffee gin cocktail. We felt we had to tell the bartender how good they were. Next thing you know he's putting down 2 more gin cocktails in front of us, on him. I tried paying. But he wouldn't take it. This was around when the host was coming to seat us.<br><br>The reason for the wait? He was waiting for a table closer to the window to clear up rather than just sitting us on the first one that became available. I thanked him and told him how cool that was since it was our anniversary. I felt a little cheesy telling him. Because I didn't want to try and get anything else from them. But we were being treated as if they knew. <br><br>The service at the table was just as special as everything else so far. It's not a cheap place but it is reasonable and not pretentious either. It's more of a \"tapas\" style meal. So we ordered the homemade bread with edamame hummus, the beets on homemade pita, the octopus and the steak. Every dish was better then the one before. Full of flavor and fresh tasting. The grilled octopus was the most tender I've had in years. The steak just melted in your mouth. <br><br>I'm not much of a dessert guy and not really impressed by cheesecake. But the waiter recommended it. So we got it. It was delicious. Everything in it was homemade. From the cheese to the graham cracker. To finish things off. They brought us 2 complimentary sparkling wine cups for our anniversary. What?! <br><br>Can't recommend this place enough.", "pics": null}}, {"review": {"des": "This was the best dinner I've had in this city, and probably one of my top 5 dining experiences ever.  Everything was delicious!!  We ordered the:<br><br>-Duck fat potato croquettes - perfect. We couldn't get enough of these.<br>-Grilled beef short ribs - Yummy, but not memorable.<br>-Saffron spaghetti/pork belly/bok choy/peanut sauce - Excellent combo of rich flavors and textures.<br>-Ramp cavatelli/homemade sausage/pistachio-basil pesto - Savory and nuanced. This was one of the best things I've ever tasted.  <br>-Honey cheesecake - light and bright<br>-Walnut brownie - decadent<br><br>Wow - I'll be talking about this dinner forever!  I can't wait to come back and try different things.", "pics": null}}, {"review": {"des": "I was on a business trip in Chicago and decided to extend my stay to hang out for a night. I wanted to treat myself to a nice dinner and chose to go to Two on a Friday night around 530. <br><br>Five stars all around. I would pass up the main stream, touristy spots for this place any day! <br><br>Setting: it's beautifully simple. Tables are spread far enough apart where you can't hear every word the table next to you is saying and the music is low enough for intimate conversation. Great for a date night<br><br>Service: fantastically attentive. My water glass was always full and meal timing was perfect. I didn't feel rushed and I was able to enjoy all of my food. <br><br>Food: absolutely exquisite. I had the bread and butter, duck fat potato croquettes, lamb belly with porcini mushrooms, honey huckleberry cheesecake, coffee, and a sour beer. Every single thing was delicious. I was tremendously full but well worth it. The lamb entree which was the special of the night was perfectly portioned and so so great. I can't say enough good things about it. Best of all, for an amazing dinner with PLENTY of food for one person, I paid less than $60 plus tip.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tUBcSa6ymsTZyFxNl8eAzA/348s.jpg", "caption": "Huckleberry Honey Cheesecake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ihQxQHqDBAX8RUvO-ZCMCg/168s.jpg", "caption": "Lamb belly with porcini mushrooms and parsnip purée."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zuSc10V1nYoUeHNwBl4Dxw/168s.jpg", "caption": "Homemade Bread"}]}}, {"review": {"des": "Okay, so where do I begin with Two.  Firstly, the staff here are so friendly and I love the atmosphere that this place gives off-- it's classy but not snobby. This place is definitely, 100% worth if you buy the Groupon which pretty much gives you a 5 course chef's tasting menu + a bottle of wine (the bottle of wine totaled up to be $50 so that itself is worth) for about ~$89. Overall, for one of the best tasting menus I've ever had in my entire life, for about ~$55 per person (including tip and tax and with the groupon) it's so worth it, and I would go again and again.  Especially since TWO is a Michelin Bib Gourmand (although to be honest, it deserves to be Michelin seeing how I feel like TWO really got down the right quantity and quality of food and honestly might be better than some other places I've been to).<br><br>Heirloom Tomato Salad (4.5/5)-- $14-- I've honestly never had such good tasting tomatoes before.  I'm not sure how they made it, but even though the dish may first look skimpy, the taste of it is amazing.  The bacon is (they told us) house made, and I thought personally it was a bit too salty for my liking and a little bit too hard, but the tomatoes 100% made up for it.<br><br>Alaskan Halibut (5/5)--$20-- TWO continued to impress with this dish.  The fish was so tender on the inside but crunchy on the outside, and overall, mixed with the sweet creamy corn that was on the bottom of the dish, this easily was one of my favorite dishes of the night. Please get this dish-- 100% worth it, you won't regret it.  The fish is so fresh and tender and they make it perfectly.<br><br>Duck Egg Fettuccine (5/5)--$16-- This was the thing that caught my eye on the menu when I first saw this restaurant, and I'm so glad this was part of the tasting menu. I love, love, love duck and the way they made this dish was so delicious I wanted more. The fettuccine was one of the best I've had and they made the duck perfectly.<br><br>Slagel Farms Pork Tenderloin (3.5/5)--$20-- This dish was where TWO fell a little flat-- the dish was a little bit too spicy for me but even besides that, although the meat was very tender and cooked well, it wasn't anything too special.  I feel like thus far, all the other dishes have seemed unique and special in some sense and this was just some well-cooked tenderloins that were a bit spicy. <br><br>Honey Cheesecake (4/5)--$7-- Again, same as above, this cheesecake was nothing too special but still good to eat and delicious. I wish they added more fruit to top the cheesecake<br><br>Overall, the meal was supposed to be around ~127 before tax and tip and we paid $89 for it so worth!!!  Definitely, give TWO a try.  It doesn't disappoint.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VJ3mzn7zmU_laK32rxCoBQ/348s.jpg", "caption": "Heirloom tomato salad"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/g-6ymrPbUNp9-sok0QJSFQ/168s.jpg", "caption": "Slagel Farms pork tenderloin,"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/h1sJsC5kK88ztbS52LI2VA/168s.jpg", "caption": "Alaskan Halibut"}]}}, {"review": {"des": "This place in West loop has been on my list for a while and my lil brother surprised me with a chef's selection for 2 dinner . <br>We finally got to use our gift last night and it was amazing. We had no idea what we were in for. We started with a bottle of wine. The Sauvignon Blanc that the waitress picked for us was amazing, not very dry which is how I like it. <br>The first course was the Arugula salad with bacon and it was delicious. The dressing was nice and the salad had apples, cucumbers, and radish as well. The star was the bacon though a perfect thick cut with a layer of fat that just melted in your mouth. Then they brought in the sea bass cooked perfectly with skin on along with zucchini and mushrooms. I really loved the tangy flavor it had. We then moved on to the fried chicken with grits. The chicken is nice but the sauce that it comes with is what makes this dish great, 'awesome sauce' indeed. The next was the duck egg fettuccini which was the only dish that I was disappointed in and why this place did not get the 5 stars I was already thinking of giving in my review. Honestly I am not a big fan of duck but that was not the problem. The pasta was not done at all. It was hard and incompletely cooked. Why would you serve partially cooked pasta when you have clearly demonstrated that you can belt out some amazing dishes. <br>Coming to dessert, we had the honey cheese cake and it was fresh, light and absolutely worth stuffing my face in. <br>The decor is minimalistic but very tastefully done. The restrooms have the rustic old tasks that were cute. The waitress was very helpful and attentive.I am definitely going back to check out their regular menu and wine.<br>PS lots of street parking in side streets and meters in front of the restaurant.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PbhPf8MmFNP3j_uJiYgbIQ/348s.jpg", "caption": "Honey cheese cake with blue berry sauce and cream"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8KnvJZU_x0fymxqBNLaeUA/168s.jpg", "caption": "Duck egg fettuccini"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AAH-Y1abCjsCT32C12C1OA/168s.jpg", "caption": "Chicken and grits, a must try!"}]}}, {"review": {"des": "I highly recommend this restaurant to everyone!! From the service to the food and the drinks to the atmosphere...5 stars all around! Every dish was phenomenal and the staff was amazing! We will definitely return and bring our friends too!", "pics": null}}, {"review": {"des": "I've heard lots of good things about TWO and only recently got a chance to try it for myself during Restaurant Week. The space is actually quite larger than I expected it to be. Looks like it would be great for anything from date night to large group dining. <br><br>We ordered the shrimp and crab bisque, prawns, spaghetti with wild mushrooms, waygu brisket, and nutella panna cotta. The sauce for the brisket was kind of salty but otherwise everything was awesome. I only wish that there was more of it!<br><br>The nutella panna cotta was my fave - will def be back for more of that!", "pics": null}}, {"review": {"des": "Hanging out for 2 hours here has been great. I know virtually nothing about whiskey, but the bartender has kindly hooked me up with 2 really enjoyable drinks - one neat and one cocktail. He's listened to my vague preference and delivered, without condescension. Definitely a good pit stop if you want to learn what you like.<br><br>If you know wtf you're actually doing, I expect you'd like it here, too. They have a huge selection.<br><br>Thanks, Graham!", "pics": null}}, {"review": {"des": "loved all dishes here, with the locally sourced ingredients and rotating menu. they recommend 2 dishes per person, and everything is shareable, among the 6 of us, we were able to try quite a few things.<br><br>the things that i really liked include the grilled asparagus, very good texture and flavour. the back rib is pretty good too, loved the chimichurri sauce. The scallop is really good too, you can just mesmerize in the grilled smell. the pasta with the uni butter is pretty amazing.<br><br>the dessert is pretty good too, puppy chow is an interesting one, the cheesecake with huckleberry is good too", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/22YugHC3dEZ4HC40K8V7LA/168s.jpg", "caption": "Ribs"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/d1xAplIRPQ244FC-qfvgcg/168s.jpg", "caption": "Asparagus"}]}}, {"review": {"des": "One of my favorite restaurants in Chicago hands down. Awesome concept. Delicious cocktails & food. Wonderfully warm atmosphere. Service is impeccable & don't be surprised if the owner comes over to your table to say hi. He's awesome.", "pics": null}}, {"review": {"des": "5 stars for excellent service, toothsome  food, great value, location, and warm ambiance. This restaurant is close to the highway and close to the city without having to deal with the insane city parking rates. <br>I came here because of a Groupon deal. For $80, you get a bottle of wine and a chef's selection five course meal. Amazing deal!<br>Arugula salad- fresh, crispy, and had a balanced sweet and salty taste with the addition of the apples and shaved cheeses. <br>Trout- this fish is cooked in its skin to secure the flavor and create a soft and crunchy texture to the fish. EXCELLENT dish. It was so flavorful with the addition of the caviar that add another layer of texture and taste. Magnifique!<br>Half chicken- sounds boring but it's not! The meat was so tender, juicy, and infused with flavor. There was so much flavor and extraordinary tenderness you would think you're eating duck. It's chicken, No worries! <br>Pasta cavatelli- another chef's creation that is surprisingly and wildly tasty! The mixture of the pasta and pumpkin with the chorizo plays a mini festival in your mouth. There's a lot of flavors competing and they're all winners! Great dish if you're looking for a non mundane pasta dish. <br>'Smores- this is an upscale jello pudding made out of Nutella with crushed graham and a super fancy roasted marshmallow. Pretty and decadent. <br><br>TIP: on Thursdays, they have half price burgers.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hQj7oDimEe3o-3ZK91TVgw/348s.jpg", "caption": "Arugula Salad"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/X6RvvqnGYfkkiWyL5hQQog/168s.jpg", "caption": "Potato Crusted Rushing Waters Trout"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Yu_FP20FYDqMsB1vQ5QlGQ/168s.jpg", "caption": "Half Chicken"}]}}, {"review": {"des": "My husband and I went to TWO for our anniversary. Our reservation was for 6:30 pm and there was only 1 other table in the restaurant at the time. By the time we left at 8, the place was almost full!<br><br>Upon being seated, we received free champagne which was unbelievably thoughtful. We ordered:<br><br>-Duck fat potato croquettes with a chili aioli. Very good, large quantity, definitely recommend.<br><br>-Bacon jam and toast. This was not so much jam as a pork pate. Slightly odd, but tasty. <br><br>-Tri-tip steak. It was prepared well with seasonal zucchini two ways. Definitely something I would order again.<br><br>-Duck egg fettuccini. Very rich. The dish doesn't have a duck egg on top, the pasta is made with duck eggs. It then has duck meat, and duck cracklins.<br><br>They had a peach pie on the menu but we were too full to try it.<br><br>Overall I would return!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9O7LsLS4iDeMZXaYciTA_Q/348s.jpg", "caption": "Tri-tip with zucchini"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pzrOFpwpDuWSYq2OwakbfA/168s.jpg", "caption": "Bacon jam with ricotta and toast"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4Dopr1rzAVJ00TDloY8dLQ/168s.jpg", "caption": "Duck fat potato croquettes"}]}}, {"review": {"des": "I'd like to give them four stars based on food but in good conscience I cannot due to the horrible service here.<br><br>Came here for the restaurant week menu with 3 other friends and we were ready to drink, eat and catch up. <br><br>We were greeted by a guy who didn't say much or make any eye contact and just sat us in the corner and left the menus on the table. I understand it's restaurant week but a warm greeting never hurts.<br><br>Our server seemed rushed to take our order and half of the time he did not bring us new set of utensils after the old ones were taken away.At the end of our meal, he told us we have to leave since the next reservation was waiting.<br><br>It's really unfortunate since the food was really good and well executed. The meat course was slightly on the salty side but I didn't mind it that much. However the quality of the food was totally overshadowed by the poor service and indifference it was very off putting.  I think it's important for restaurant to create a memorable experience with not only their food but also with service. TWO will be memorable for me but definitely not in a good way.", "pics": null}}, {"review": {"des": "Came here for my boyfriends birthday dinner and was pleasantly satisfied. We had an intimate party of 3 with him and his brother who was visiting from nyc. <br><br>We ordered 7 dishes and left feeling quite full. But when I got home, I did feel a little sick. Not because the food wasn't fresh, but because it was verrrry heavy. A lot of duck fat that night lol<br><br>We ordered the croquettes fried in duck fat, a salad, scallops, roasted half chicken, cheeseburger, special of the night which was roasted lamb ribs, duck egg fettuccine, and another half chicken because it was so good.<br><br>My favorites of the night was the half chicken and the salad. I'm not a salad gal, but this arugula salad was so delicious I almost ordered a second. <br><br>The roasted half chicken was hands down the best chicken I have ever had in my entire life. I didn't even know chicken could taste like that. What \"chicken\" have I been eating all my life before this? <br><br>The scallops were not great though, they didn't have any flavor to them. But that's ok because all of the other dishes were great.<br><br>I was really disappointed that our server didn't do anything special for my boyfriends birthday, even though I made sure to note it on my opentable reservation :(<br><br>But that's okay. We still want to come back once the menu changes, the quality of the food and the skills of the chefs are insane. Can't believe this place isn't packed to the brim every night!", "pics": null}}, {"review": {"des": "This is an awesome place through and through. The restaurant is all about sustainability and quality. The decor and the overall theme is really nice and cozy. I originally came to have dinner but instead opted for the bar. Graham was absolutely flawless and really kept things chill. The cocktails were exceptional and Graham will give the perfect pairing for your needs. Food wise, this place is tasty. The menu changes quite often but if you see the double cheeseburger, order it without hesitation. I highly recommend trying this place out whether it's for a drink or for a tasty meal!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/69HSdJFWKi4pc4tcvgFuow/348s.jpg", "caption": "Double Cheeseburger -Yum!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DM4qbKJCeaMuX5BpF5ADIA/168s.jpg", "caption": "Duck Fat Potato Croquettes"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rqh8B6PtByOQuvzLuIlteQ/168s.jpg", "caption": "Killer cocktails!"}]}}, {"review": {"des": "My family and I had a wonderful dining experience at Two recently. My sister lives in the area and had walked by it multiple times and has been wanting to visit. The restarting is very open with a lot of beautiful woodwork. It is quite inviting and cozy! We started out with a cocktail at the bar. They have an extensive cocktail list which were all freshly made and tasty. The bartender was quite knowledgeable and friendly! We did choose a few bottles of wine for our dinner and they were great. Two has a very extensive wine list, as well!<br><br>We came here with a party of 6 and chose the chef's tasting menu. It was about 35 dollars per person (which was a great deal). I honestly cannot say one negative comment about the dishes we were served. Everything was perfectly prepared and had such great flavor. The halibut dish and Nutella smores were my personal favorite. The service was also exceptional!<br><br>Overall, I highly recommend Two. It is officially one of my new favorite restaurants. Thank you for a wonderful dining experience!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dcWbRXFQU6juQk8iOtrRtA/348s.jpg", "caption": "Fresh peach dessert."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yNdELUKFSFw54sX-RYklpw/168s.jpg", "caption": "Nutella smores"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6qklOUFuO1LF3QwgbN4J2Q/168s.jpg", "caption": "Amazing tenderloin!"}]}}, {"review": {"des": "This restaurant is such a cool find. Get out of the regular west loop and try this one out. The farm to table style food is brilliantly crafted in small portions for everyone on the table to try. The varieties offered cover many different cultures and are made with care and intricacy. The owner helped us out with our wine selection (also a sommelier), got to meet his family and lil baby as well. This level of involvement is rare to see in most modern restaurants. Enjoy the food and learn how it came to be. Will come back !", "pics": null}}, {"review": {"des": "Overall very good experience start to finish. Started out in bar for a couple unique and tasty cocktails. We were then treated like royalty by host and were seated at a perfect table. Started with the duck fat potato croquettes which would be very well suited for a hungover Sunday bar snack. They were good, not great. Next was a salad. Entrees of scallops and duck egg fettuccine. The fettuccine was by far my favorite dish. Absolutely delicious. Fresh house made pasta is the key. The scallops were as good as any high end seafood restaurant I've dined in. For dessert we had the Smores, Nutella panna cotta and cheesecake. The cheesecake was forgettable and the panna cotta was very good. Overall I would definitely recommend Two. Very solid food with great service. Very good price point for the entire experience.", "pics": null}}, {"review": {"des": "Had an excellent dinner at TWO tonight. I don't often write reviews, but felt the need to after this experience. From the food and service to the atmosphere and impressive wine and cocktail list - was thoroughly impressed from start to finish. <br><br>Some highlights included the bacon jam and homemade ciabatta bread - YUM! The Hanger Steak with coconut cream corn was also a delight. Last but not least, I'd be remiss in not mentioning the puppy chow dessert. Yes, puppy chow - from your childhood. What a treat!", "pics": null}}, {"review": {"des": "I brought the boy here for his birthday dinner.<br><br>When I arrived, I didn't know the host stand is located in between the bar area and the dining room. So I stood by the front door, waited for someone to direct me, asked the bartender who didn't respond, walked to the host table which was empty, watched waiters and bussers walk past me until someone came. <br><br>We ordered the croquettes (nice kick in the sauce), pate (eh), crab spaghetti and the fish (disappointing). We were told that they serve tapas style but we couldn't course out the meal (more entree-like dishes towards the end) and would receive food whenever it was ready. While we were dining, a group of friends sat at the table right next to us. While we were eating our meal, I noticed one person was missing his entree while everyone else was devouring their food. After about 30-40 minutes of waiting and about to ask for the check, he asked about his food and the waitress (our same waitress) told him they don't serve food while there's still food on the table. Are you serious? After a waiting for a total of an hour, he finally got his roasted chicken.<br><br>I would not come out of my way to eat here but I guess if you're in the area? Seems to be a neighborhood spot.", "pics": null}}, {"review": {"des": "Was there for a celebratory dinner during Restaurant Week. We got three RW menus and a side of the bread/butter/eggplant appetizer.<br><br>The initial courses were all very delicious - they were seafood bisque, Brussel sprouts, prawns (though the salsa verde on top wasn't so good), pasta. The main meat courses on the other hand were less good - the brisket was too salty and the pork was too heavy. We didn't finish those.<br><br>The dessert - the Nutella chocolate marshmallow thingamajig was not good at all - we left almost all of it untouched.<br><br>Finally, we also had cocktails which were excellent.<br><br>Overall a decent experience. Would be interested to try the non RW menu.", "pics": null}}, {"review": {"des": "We came here with friends for dinner and sat at the bar. The bartender was great with recommendations and the cocktails were yummy. We split the cauliflower which had nice flavor, the duck egg fettuccine was really good. Fresh pasta was cooked well. We also got the burger which was good but not great. It only comes one way which is rare/medium rare. I like my meat pink but it was underdone for my taste- and with two large patties stacked on each other all you could taste was the beef. I couldn't even tell you what else was supposed to be on it to balance out the meal.  The fries were awesome. <br><br>For dessert we got the puppy chow which is just as you would expect when you make it at home- but nice to snack on with a drink in hand <br><br>I would go back and try more pastas and other things on the menu :)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6Nxb_uCVwUV5U0NDITpPCA/168s.jpg", "caption": "Puppy chow"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7tY5rvvXL0TIeAOI7WJaUA/168s.jpg", "caption": "Burger and fries"}]}}, {"review": {"des": "Holy moly, this may be my new fave restaurant in the city! I came here with a group of 8 for a client dinner and we decided to go with the 8 course meal! Every dish we had was full of flavor and absolutely delicious. My favorite dishes that we had was definitely the bread and edamame hummus, the steak, and the halibut. I'm not usually one to order chicken dishes at restaurants but the chicken was also outstanding. We topped it off with the s'mores mousse and cheesecake. Probably the best cheesecake I've ever had and I am not even a big cheesecake fan. Hats off to the chef, just an absolutely incredible meal. I cannot wait to come back!", "pics": null}}, {"review": {"des": "Been here twice, absolutely blown away both times!<br><br>First time it was just 2 of us and we ordered a la carte.  The venison entree was mouth watering and left us remarking about it for days.<br><br>Second time we had a group of 6 (the minimum) and ordered the chef's tasting option.  It was less than $50 a person, and was almost too much food for us to eat.  That wasn't an issue though as everything was rave worthy.  They brought 2 plates of each course to the table to share.  I think it was 2 veggie plates, 4 entrees, and 2 desserts.  The most memorable was the crusted halibut and the raspberry cheesecake.<br><br>They do a great job of making you feel welcome and at home here.  A plethora of tasty cocktail and wine options as well.<br><br>My favorite tapas in Chicago so far.", "pics": null}}, {"review": {"des": "What a treat!  It generally falls on me to plan Restaurant Week excursions. I try to pick places no one in my group has tried and with some variety in the menu. Two fit the criteria so I was quick to scoop up a reservation.  The restaurant description had all the buzz words to make some of my friends nervous, \"farm-to-table\" \"locally sourced\" \"sustainable\"...there was a fear we were gonna get flowers and twigs and have to get pizza after we left.  After this dinner, I'm confident my girls will never doubt me again!!!!<br><br>The decor is rustic and comfortable. It's larger inside than you would assume from the street. The hospitality from the moment you step through the curtain was second to none. There is something so welcoming about a place that presents as genuinely excited to have you dining with them.<br><br>Cocktail menu was varied and reasonably priced. Also a solid wine selection.  Because Two features a rotating menu based on what is in season I'm not sure how long any of the restaurant week fare will be around but everything we had was amazing.  The homemade hot sauce in the head on shrimp and grits had a nice lunch without blowing out your mouth and the grits were creamy and delicious.  We all had the tritip entree (sorry porchetta I'm sure you were delicious but we were all wooed by the red meat).  Recommended mid-rare I thought is was magical.  They accommodated other temps as requested as well.  It was well seasoned and melt in your mouth tender. The portions were all generous but restrained enough to make it through the 3 courses and bonus dessert without feeling like a huginormous glutton.<br><br>Despite all the time I have spent dining in the west town/west Loop area I am so disappointed i have never visited here before.  Will be back for sure.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/X6qEbsWUiJHKCRNqW3IhCQ/348s.jpg", "caption": "Dark Chocolate Mousse, Macerated Berries, Homemade Cookies"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/b4JzxBAvX1-iuAmHIHn6UQ/168s.jpg", "caption": "Tri tip, heirloom potatoes, herb butter"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QhXlauXyT5DTj99GxqZBPQ/168s.jpg", "caption": "Head on Shrimp, Illinois Heirloom Grits, Homemade Bacon, Homemade Hot Sauce"}]}}, {"review": {"des": "AMAZING! This place is just fantastic!!! Came here for restaurant week and the experience was just wonderful. The way it's set up is very chill. You have some tables where you can be isolated while others are like a community table. Everyone is so friendly to each other and having a great time. Even the host was super friendly and that playful interaction with you. Like when we were taking pictures of our food, the host came by and took my friend's phone to take it for her which was really random and funny. <br><br>The food was freaking amazing! Everything tasted so good. At first I was skeptical to eat spaghetti at a restaurant but this is no ordinary spaghetti. It's much creamier and the poached egg just topped it off. When we had the steak, it was was good and tender, just overall delicious. For restaurant week deal, the dessert was on the house and it was delicious. Even gotten a chance to try some cocktail drinks and it was amazing. I really enjoy my experience here at TWO and can't wait to come back again! I'm in love with this place... still dreaming of that tender steak...", "pics": null}}, {"review": {"des": "We went to TWO on a Thursday night because we had a Groupon. We had 6:30 pm reservation and when we got there the place was almost empty and to be honest I have no idea why because we had a wonderful experience and will be coming back soon! The food was absolutely delicious, everything was brought out to the table by one of the chefs and the ingredients of the dish were highlighted. Every course stood out, from the appetizer to the dessert. I think we didn't leave any food on any of our plates and I am 100% sure that we licked the poster plate clean. We will most definitely be back!", "pics": null}}, {"review": {"des": "We arrived 10 minutes before our reservation. When we checked in we were told it would be about 7-10 minutes passed the reservation time before we were sat and we were totally fine with that. While at the bar, we received two updates from who I believe was the manager, letting us know it wouldn't be much longer. He was very friendly and accommodating. <br><br>We sat about 15 minutes after our reservation time and were greeted immediately. Our server was also very friendly and accommodating and gave us the low down on ordering. <br>Although it was restaurant week, we decided to order from the menu. There were so many things we wanted to try so we decided that was the best way to go. <br><br>On to the food... <br><br>Sourdough bread with garlic and butter - delicious but filling so use caution.. our server warned us but we didn't listen. <br><br>Duck fat potato croquets-Awesome! These are a must but be careful, the sauce was spicy. <br><br>Cauliflower- with beer cheese?! No way you can pass these babies up! Perfectly cooked and seasoned. Delightful! <br><br>Brussels - I usually love Brussels but these I didn't care for. Way too much vinegar in whatever they cooked them in. <br><br>Duck breast- yessss! Get this. Perfectly cooked, tender and packed with flavor. <br><br>Lobster with potato bisque- THIS was my favorite of all. The potato bisque was full of flavor and the lobster was perfectly cooked. <br><br>The meal and experience at Two was vey enjoyable. Service was terrific and everyone was so accommodating. Oh & the guy who gave us a play by play for our wait time, the one I think is the manager.. extra bonus points for him.. when we were getting up to leave, he went out of his way to help me put my coat on. Class act!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sUTWKIfRjDLgLCNsyacq0w/348s.jpg", "caption": "Duck breast"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RuKeOCI-RzQfFf1vX0rkvA/168s.jpg", "caption": "Cauliflower"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/F_iDdMf78kIZP_i_F-YBrA/168s.jpg", "caption": "Lobster and potato bisque"}]}}, {"review": {"des": "3.5 stars rounded up to 4 because the staff was nice<br><br>Pros: friendly and attentive servers, nice ambiance<br>Cons: long wait between dishes, hit-or-miss dishes<br><br>My boyfriend and I went here tonight for Restaurant Week ($33 for 4 courses). Our reservation was at 6:30pm, and after checking in with the host we found out they were running a little late and that it would be approximately an extra 7-10 minutes wait. Unfortunately, we weren't seated until like 7pm. I was annoyed with this extra wait, but the host's stellar customer service helped make up for it. He checked in with us during our wait and thanked us for being patient. He explained they were running behind due to the earlier dinner crowd arriving late, so I understand that this was an unfortunate circumstance that was out of the restaurant's control. <br><br>I ordered the shrimp and crab bisque, spaghetti, and wagyu brisket, while my boyfriend got the gulf prawns and pork tenderloin for his second and third course. <br>Good: The gulf prawns were flavorful albeit smaller portions. Wagyu brisket was juicy and savory. The bonus course, nutella panna cotta, was yummy and a nice way to finish the meal.<br>Okay: The shrimp and crab bisque was good but lacked the extra oomph to be great. <br>Bad: The spaghetti was barely flavored. Pork tenderloin was kind of dry and portions were tiny. <br><br>The servers were nice and attentive, but our food came out really slow. We waited about 10-15 minutes between each course (except for dessert which came out really quick). I don't know if this is how it usually is or if it's just the kinks due to the start of restaurant week, but dinner felt like it dragged on for longer than it needed to be. <br><br>Overall, I had an okay time, and I can see that so many people love this place so I wish I had a similar experience. Unfortunately, the wait times and the slightly disappointing food are just too much for me to want to come back when there are so many other restaurants to try in Chicago.", "pics": null}}, {"review": {"des": "Actually found out about this restaurant because there were running a promotion with Lincoln automakers<br>The promotion was if you came and did a survey and talked and learned about the new Lincoln models thank you got treated to two entrees off a preset menu that was just for people who did the Lincoln demonstration so for us it was a win-win when he got to get in this car and ask questions and learn about it and get info about it and then going to this wonderful restaurant we actually came as soon as they open so we got to see right by the window no line no waiting the windows that I think about it run about the full length of a wall and the seats they have a couple long benches along with more integral intimate tables is pretty spacious bathrooms were clean and user-friendly the staff because it was only us and there was very eager to get our order and get it out to us promptly which we appreciate it for us the food we had like a duck croquette reminded me of like a hushpuppy type of consistency and for the Andre we had prawns which are just large shrimp in my opinion with the shell still on so you have the kind of shell them yourself for t this food is French so the dishes are french-inspired the grits were not the kind of grits that I'm used to if I would have had the things available I would of doctored them up just a little bit made them a little want to say sweet a little bit but it was enjoyable it was nice to try out a place that I probably never would have found on my own", "pics": null}}, {"review": {"des": "First time experience at TWO can be summed up as loud and slow.  I believe the restaurant had a Groupon deal at the time so it was crowded, which was fine.  However, the restaurant should have anticipated the crowd and not compromise the quality of service and the speed of the kitchen production line.  I ordered 4 dishes and as a tapas style experience, dishes came out only after the previous dish was finished.  We spent 3 hours for this meal!  The waitress was clueless and inattentive. The restaurant was so so so loud and it was hard to hear the waitress and hard to have a conversation at the table.  The food itself was ok, I would give it 3/5, everything was ok but not amazing.", "pics": null}}, {"review": {"des": "We had five dishes and a cocktail and everything was incredible. A little introduction to \"foodie\" stuff while still being approachable and not pretentious. I highly recommend the green beans, heirloom tomatoes, chicken, duck egg fettuccine, and the duck fat potato croquettes.", "pics": null}}, {"review": {"des": "I cannot say enough great things about this restaurant! Graham at the bar is a master at his craft and will even whip up a special cocktail based on your preferences. The wine list is always superb, and cocktails to die for. Don't know what to order at the bar? Go for Graham's recommendation, it will never disappoint. The food is always served piping hot, in perfect portions. The meat dishes are always seasoned perfectly, and I HIGHLY recommend the lamb ribs or burger. Vegetable and seafood dishes are never over cooked and always fresh. I would highly recommend TWO for a nice evening out.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eAhhUy05yhQddDofXRKayQ/348s.jpg", "caption": "Menu"}]}}, {"review": {"des": "10/10 for two. <br><br>What we ordered: We had the potato croquettes, asparagus, Brussel sprouts, lamb on a potato cake and the duck pasta. The best thing of the night though was the honey cheesecake with huckleberries. It was out of this world good. <br><br>Service: From the host to the bartender to our server everyone was amazing. They were attentive without being over bearing recommended good portions and options and were very friendly. <br><br>We will be back :)", "pics": null}}, {"review": {"des": "I absolutely love this restaurant! The waiter was extremely nice, and helpfully. The restaurant had a beautiful ambiance, it was clean, and intimate. All of the food was delicious, especially the prawns and grits! The food was presented beautifully. I totally recommend this place to anyone seeking comfort food in a beautiful atmosphere!", "pics": null}}, {"review": {"des": "The duck fat croquettes and hanger steam with enoki mushrooms were tasty, but most other dishes were disappointing. The pasta dishes had a disappointing texture and the pasta  was overly hard. It didn't seem like an issue with cooking time, more with a texture of the dough. The duck confit was dry, stringy, and too salty in the duck eggs pasta dish. The shrimp in the saffron spaghetti were overcooked. The beef short ribs were too charred and over salted. (If you like Korean style shirt ribs, you can get a large serving of LA kalbi at h-mart for a similar price of a small plate of three short ribs). The aperol-ish sprtiz was a very refreshing cocktail and the coffee negroni was a hit. Some of the other cocktails, like the tequila and mezcal drink lacked balance. For dessert we had the almond cake and the puppy chow. Puppy chow was tasty, but the almond cake was mediocre. Dinner for 3 with drinks with slightly below 300. We will probably not return because it was a bit too hit or miss. Service was fine and the ambiance was inviting.", "pics": null}}, {"review": {"des": "Great neighborhood spot. The staff and ambiance are extremely welcoming. The food is tasty and the menu changes often. Always a solid option for a fun date or a delicious meal w friends and family.", "pics": null}}, {"review": {"des": "First of all the service was amazing. The owner set us up at the \"date table\". He was very personal and friendly. I asked for some recommendations on wine. He told my girlfriend to scoot over and sat down with us for a good 10 minutes and we talked about wine and food and how we came across his restaurant.<br><br>The food:<br>We started with the duck fat potatoe croquettes and the bacon jam. So rich and flavorful.<br><br>Next we had the arugula salad which was great.<br><br>We finished with spaghetti and duck egg fettuccine. We were honestly so full By the time we got the pasta we could only eat a few bites. We got a doggy bag and finished in the hotel. <br><br>Seriously awesome spot. Great ambiance, service, food and wine list.<br><br>Will be back", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CM9YHoC3bFNgZDfZz5lZBg/348s.jpg", "caption": "Duck egg fettuccine. This place also has a pretty bad ass wine list"}]}}, {"review": {"des": "Dined during restaurant week and did the prix fixe menu.  Highly recommend and great value.  Unique cocktail menu.  Excellent service.  Favorite dish was the wagyu beef.", "pics": null}}, {"review": {"des": "I honestly cannot believe I had not only never been here, but hadn't even heard of it. Every. Single. Thing. was amazing. Small dishes with the most flavor. The service was on top of their game & ambiance very homey yet contemporary. Would definitely recommend to anyone looking for a distinct-fully flavorful and diverse menu. Also, the drinks are completely worth having on their own or with dinner.", "pics": null}}, {"review": {"des": "Wonderful dining experience at TWO. Brussel sprouts were definitely the highlight. The fettuccine and spaghetti dishes were delicious but slightly too salty for my taste.<br><br>Gulf Prawns (5/5): wonderful flavors and crisp prawns. Love the sauce<br><br>Duck Fettuccine (4/5): this dish was delicious--but would have been better if it were less salty!<br><br>Lamb Loin (4/5): the waitress really recommended this dish, but I did not think it was spectacular. The puree at the bottom was great though.<br><br>Brussel Sprouts (5/5): brussel sprouts are hard to make right, and TWO did a fantastic job. I'd say that this is probably my favorite dish at this place. The cheese and the balsamic taste complemented the brussel sprouts so well!<br><br>Clams Spaghetti (4/5): quite a mediocre dish, and again slightly too salty<br><br>Chocolate cake (5/5): delicious cake, was a little heavy by the end but great!<br><br>Great service and ambiance. Though the drive out was a bit far, it was worth the trip.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/b82MAK5PRH8Q1VcdfH0dTA/168s.jpg", "caption": "Gulf shrimp"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wpmWZGhU02TuShuBjyadEQ/168s.jpg", "caption": "Lamb Loin"}]}}, {"review": {"des": "TWO is a consistently solid, cozy neighborhood restaurant that epitomizes what I think classic midwestern cuisine is all about. They place a heavy emphasis on being farm-to-table, using local ingredients that are in season and taking inventive approaches to common dishes. I always have a hard time deciding what to order, so I'm a big fan that TWO encourages a tapas-style approach to dinner. <br><br>The menu changes often and fortunately it's way more hit than miss, but here's what I had on my most recent visit:<br><br>Arugala salad (8/10): It's funny because when I think about this dish I think about that thick slab of homemade bacon which comes on the side. It's like they took a hearty pork belly and infused a wonderful smoke and maple flavor into it.<br><br>Homemade focaccia (9/10): They were out of the bacon jam so we opted for the homemade bread with brown butter and preserved eggplant instead. The focaccia was light and airy and had a crispy, oily crust, like in deep dish pizza, that was perfectly complemented by the whipped brown butter.<br><br>Arctic char (9/10): Beautifully light pink filet of arctic char, which tasted milder and creamier than salmon, with a chunky pesto on top. The skin was so incredibly crisp that we all wondered how the chef did it, call us impressed. It came resting on a bed of carrot puree, which did a great job showing off the quality of the ingredient.<br><br>Slagel Farms Lamb (8/10): Cornbread pancake base topped with a beautiful pile of tender shredded lamb and mushrooms. The lamb wasn't gamey at all and the mushrooms added a wonderful richness to the sauce. <br><br>Duck egg fettuccine (8/10): I like how the noodles, which you can definitely tell they make fresh daily, are thicker and have more of a bite and chew to them. The sauce was creamy without being heavy, and the fried duck skin added some much needed texture to the dish. I only wish that the duck played a larger component in the dish.<br><br>Shortbread cake (1/10): Yeah this was just awful, we pretty much left it untouched. The cake was dry and stale, and tasted as if it were a couple days old. Unfortunately I remember always being let down by their desserts.<br><br>Pro-tip, they have a groupon where you can sample 5 dishes and get a bottle of wine, which is a great deal.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/auniO07ZL1X29cA3tHO12g/348s.jpg", "caption": "Shortbread dessert, unfortunately one of the worst desserts I've had recently"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gos-Ue4dmfqoKYoRVexbXw/168s.jpg", "caption": "Arugula salad, but really it was all about the bacon on the left"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KjRq41O9YXxUAf218-cOqw/168s.jpg", "caption": "Arctic char"}]}}, {"review": {"des": "Came here on a Sunday for brunch & had a phenomenal experience.<br><br>YES - hip/industrial/wood-y interior <br>YES - service was excellent!<br>YES - food came out in a timely manner <br>YES - called before, no wait on a Sunday morning!<br>YES - outdoor & indoor seating <br><br>FYI - solid Brunch menu (not too many items, but the perfect so you can quickly choose without feeling overwhelmed) <br><br>W H A T   W E   O R D E R E D: <br><br>(1) POTATO PANCAKES & DUCK CONFIT ($15):         i personally do NOT eat duck because i have been deathly afraid of it since I was little. However, my best friend & her BF loved it & ate it clean! (5?/5) <br><br>(2) LOBSTER TOAST ($18): this dish was on the saltier side & you definitely get a whiffff of the fishiness from the lobster. I wish this dish had something to counteract the saltiness from the lobster & the sauce. However, the lobster was cooked perfectly & the toast soft & airy with a crunchy crust! (3/5) <br><br>(3) CHILAQUILES ($15): MY FAV. Of the 3! This was also our servers recommended dish! If you like TAKIS (the Mexican chips) than you will Iove this dish! I guess you can think of this dish as an ELEVATED version of the takis as the flavor profile is very similar (sour + spicy). The Meat, the Guacamole, Sour cream, Cheese, & the Nachos  all work in harmony &  your mouth is salivating for another bite! <br>*this dish is big & heavy so expect to share. (5/5)<br><br>Last but not least, without my even asking I just shared that it was my BFFs bday and our server brought out 3 STICKY BUNS & a candle and sang HAPPY BIRTHDAY in Mexican for her! <br><br>the STICKY BUNS was delicious but too sweet for me (but I'm not a sweets person). My BFF said that it was the perfect amount of sweetness & a great way to close out the meal!<br><br> D R I N K S: <br>+ WATERMELON LIME/MINT JUICE - non alcoholic. This was the special for the morning & it was SOOOO GOOD! I wish I could wake up to this drink every morning! It was so fresh & refreshing! I would come back for this drink alone! <br><br>Overall, <br>+ great ambience<br>+ wonderful service<br>+ highly recommend<br>+ will return to try out their dinner menu", "pics": null}}, {"review": {"des": "Most of the staff was amazing, ambiance is great,  late reservations available. <br>Went for restaurant week menu @ 4 courses for 33$. I do love this week because it opens us up to restaurants we haven't tried or known about before. The soup was amazing,  flavorful. The spaghetti was different and good. The waygu brisket and pig were okay. I would give this place 3.5 stars. I'm not a snob but I didn't feel a good connection with our waitress which made the night kind of awkward. Not everyone likes to drink with their dinners. She seemed upset and surprised when we did not want to order drinks.  Asked us a second time about the drinks then topped it off sarcastically a 3rd time if we finally would want a round of shots when desserts came out. It felt really pushy and awkward. Trust me if we want something, we would let you know. It was really awkward but the rest of the staff was great.", "pics": null}}, {"review": {"des": "With both Michelin Bib Gourmand and Yelp giving this restaurant great reviews, I had this place on my radar for many months.  I wish I tried here sooner.  Unlike the super trendy Randolph or River North, Two sits in a quiet neighbourhood but it executes better than most places I've had recently tried.  Everything out of the kitchen is very very well done.  The menu is curated and flavours are just fantastic.  I would definitely return here over other places if I'm back in Chicago.<br><br>One of the great things about Two is the atmosphere... casual but clearly modern.  The most amazing thing... the table seating.  You actually have your own personal place... you're not bumped up and within 2 inches of another table.  It's a wonderful thing to have it... almost a luxury in some restaurants.<br><br>We were recommended to have 2 to 3 items per person from the menu.  We ordered the potato croquettes (one of the best potato dishes I've had all year.  Super crunchy with perfectly salted rich whipped potato inside), prawns (MUST ORDER... whoever makes the sauce and cooks the prawns... seriously so good.), brussels (a ridiculously generous portion of good veggies), walleye (tasty but beware it has bones... not the easiest to eat), cauliflower (good but overshadowed by the sprouts), and the purple sweet potato pie (interesting dessert as it reminded me of many South East Asian takes on dessert minus the crust.)<br><br>Service was great.  Professional, attentive, warm, inviting, and super effective... they clear each dish between courses.  Even top end places in Randolph doesn't do that.  Nor do they even try to make conversation.  Two clearly has great staff and this is second reason why I need to come back here.  The first being the great food at reasonable prices!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aoT5f0dcpqq67leNcRr7Xw/348s.jpg", "caption": "Their shrimp ... wow this was amazing"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WrZ6s-ztM9pFnrCJWLzBEg/168s.jpg", "caption": "Brussels"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DZ7vX9t0oOvu8HdNLebZng/168s.jpg", "caption": "Their walleye .. very tasty but be awake there are bones in it"}]}}, {"review": {"des": "We made reservations beforehand for a Sunday AM brunch, but they really weren't necessary as much of the restaurant was vacant. Brunch is my absolute favorite meal and there are some stellar brunch restaurants in Chicago. While this food was incredible, I did leave preferring some of my other favorite brunch spots. Their menu changes frequently/seasonally, so I would not go into the experience knowing what you want to order because it may not still be on the menu. <br><br>The restaurant has a very modern/urban/industrial vibe and I love the details around the bar, which are supplied by local artists (see fan lights photo below). <br><br>Cocktails:  They have a small selection of brunch cocktails. Strawberry Mimosa, which was very refreshing. <br><br>Food:  I ordered the Chilaquiles, which had pork, avocado mousse, cheese all served with an over-easy egg on top. There were a lot of awesome flavors jammed into one dish and it was definitely plenty of food. It was our favorite brunch item here, but it did pale in comparison to CRIO's brunch chilaquiles (in my opinion). My fiance ordered the Fried Chicken & Waffles. This is typically served with a hot sauce, which he requested on the side, because he's a wuss. The hot sauce was perfect and creamy, the chicken was fried nicely. It was a really tasty dish, but once again not our favorite chicken/waffles dish we've had. <br><br>All in all, the atmosphere is awesome and the food was delicious enough to have me curious about their dinner options/cocktails. You'll see us back, TWO!<br><br>UPDATE:  I came for dinner and I'd still say 4 stars. Cocktails at the bar mixed by Graham are amazing! Seriously, this place is worth visiting for his mixology skills alone! <br><br>Roasted Cauliflower dish with white cheddar fondue is great and so is the Duck Egg Fettuccine! I would order both again! I was really disappointed by the burger though. It looked delicious, but it was undercooked for a hamburger. No other flavors shown through and the bun was bland .", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/alc65WxeE0f8i5g7DCopOg/168s.jpg", "caption": "Fan lights surrounding the bar"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HF0SUBqIXfsEPnxDy-6BOg/168s.jpg", "caption": "Chilaquiles"}]}}, {"review": {"des": "Came in here for our two year and it was fantastic! The plates are tapas style so I'd get about 2-3 plates per person. (just like the waitress recommended.)<br><br>We got the potato croquettes, the halibut, The crab spaghetti and the beef plate. Everything was spot on! The food was cooked perfectly, plated perfectly, and tasted perfect. The quality of the food comes through with every bite. <br><br>Thank you guys for a great night and fantastic service.", "pics": null}}, {"review": {"des": "My roommate and I first discovered Two through a Groupon on the chef's tasting menu (for 2, including a bottle of wine). It soon became tradition for us to go here every year for Christmas or my birthday (on June). <br><br>The staff are all incredibly friendly and hospitable. The hostesses and wait staff are helpful and kind. <br><br>Each time we went we had different courses chosen through the tasting menu and each time it was more delicious than the next. Some highlights: <br><br>Their home made bacon. Wow. So good.<br>The duck croquettes. So smooth and rich and savory.<br>The mussels, a first for me and the most delicious experience. <br>The wagu beef - oh man, I died. So good. <br><br>I could go on, but instead I'll just post a ton of not professionally lit photos. :)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/060JVSoTzOIF86emT9KH8A/348s.jpg", "caption": "Wagu beef. Man."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SwNw4Sl3xtZASS30pO2TBQ/168s.jpg", "caption": "Duck confit pasta :)"}]}}, {"review": {"des": "Two things I hate the most in life are 1) being a Yelp outlier and 2) writing mediocre/bad Yelp reviews.<br><br>TWO is definitely a cool restaurant with cool, sleek, comfy decor.  The service was off the chart.  I've been to a few nice restaurants in my day and the service surpassed all of them.  We were checked on frequently by the waitress, a guy kept our water glasses full, another guy changed our plates AND UTENSILS with each dish, and the food came out fast!  It was unbelievable.  Unfortunately this is where the awe ended.  The food just fell a bit short.  <br><br>First of all, I was a little thrown off when we were told that 3-4 dishes per person was standard.  I mean, I'm not a small girl but dang!  3-4?  That's a lot!  <br><br>The flavors of our dishes were great but a few flaws stole the spotlight.  The bacon jam was great.  It didn't blow me away.  It was, just, well, good.  The tri tip was amazing!  Delicious all around.   But amidst  our excitement, we didn't realize we were not asked how we wanted our meat cooked.  Our steak was seared.  We ate the whole thing because it was delicious, I just wished it were cooked a bit more.  The prawns.  Again, the flavors were so good.  But as an avid seafood eater and an avid shrimp cooker messer upper, I knew for a fact the prawns were not good.   One time I went to one of those Cajun crab boil places and bought a big bag of shrimp.  I made the mistake of leaving it out.  I ate it the next day and it was no bueno.  The last item we tried was the coconut cake.  Again, great flavors but it was cold and a little dry.<br><br>You read right.  We only had 3 plates and a dessert.  Mostly because we were not crazy hungry.  I think 4-6 per couple would be sufficient.  Our bill with 2 drinks totaled about $80 ish with tip.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kY6DQPk-1gsLfAZnXIMeAA/348s.jpg", "caption": "Menu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WgYd0q-mYY6nckHKLUbP2g/168s.jpg", "caption": "Bacon jam"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Daz2Oem07-Ub4hQCxeIJvA/168s.jpg", "caption": "Slagel farm tri tip"}]}}, {"review": {"des": "The place was great. We went for a date night and we had a great time. Some dishes we thought were better than most was the arugula salad with pork belly, the hanger steak and the ribs in Chimichurri sauce! The wine was excellent. The dishes were priced accordingly. We tend to spend over $200 on date night dinner with a bottle of wine. They came in under that with tip. The owner came to greet us to make sure we where having a good time. I love this because we got an insight as to the essence of the place. The server was attentive and kind. We will be coming back again and again!", "pics": null}}, {"review": {"des": "What an AMAZING place. We came here for my birthday dinner this weekend and were able to snag a 6:30 reservation the day before. By 7 they were totally full. <br><br>I would describe the style as 'large tapas', a little bit bigger than your traditional tapas bars. Our server (who was AWESOME) recommended starting with 4-5 items. Although everything sounded really good, we narrowed it down to five things and placed our order! The first plate was the duck fat potato croquettes. These were served with a spicy aioli and were perfectly crisp and crunchy on the outside and creamy on the inside. I love pretty much all potatoes anyway but these were insanely good. Plate two was scallops, perfectly seared on the outside and served atop a Brussels sprouts slaw. I thought no way could these be topped but something did- keep reading! Item number three was roasted broccoli which was tossed with Iberico jamon, burrata mozzarella and Calabrian chilis which were about as spicy as a cherry pepper. You wouldn't think broccoli could blow your mind but this was pretty much the best broccoli ever. So far, crushing it! Plate four was the pumpkin cavatelli and it was my favorite of the night. This was served with a brown butter sauce, chorizo and a poached egg which sort of melted into everything and tasted so creamy and delicious. This is chef genius at its finest. The fifth and final part of dinner was the tri-tip steak. Shockingly, this was my least favorite item (and I LOVE steak). I would rate it a solid 4/5 but everything else was so good so it stands out as the weak link. Since it was my birthday, we had to get dessert so I chose the honey cheesecake-- I'm a sucker for things with raspberries. It was topped with fluffy whipped cream, raspberry coulis and a few fresh raspberries. Sinful decadence and some of the best cheesecake I've ever had. No exaggerations, this was a damn good meal.<br><br>As if the food wasn't good enough, the service was also impeccable. Our server made fantastic recommendations from start to finish. I was initially a bit disappointed that there was only one vodka based signature cocktail. We asked the server if the bartender could make the 'Gleaming the Cube' with vodka instead of the gin on the menu and she was happy to do it. She also recommended me a fantastic Albarino which I greatly enjoyed. All the other people working were excellent too and the service was attentive but seamless. <br><br>This was a wonderful special occasion dinner. The vibe is classy but not pretentious and the food is delicious. I highly recommend checking it out.", "pics": null}}, {"review": {"des": "The meal that I had at Two was absolutely fantastic. The only disappointment of the night is that they would not do the tasting menu for 2 people, but because of the small plates style of the place we were still able to try a ton of different dishes. The price point of the restaurant was also fantastic. Often I find small plate restaurants can get extremely expensive quick but it felt very reasonable at two. We had a fantastic French malbec. The bacon jam is a MUST. Do not be shy in asking for more bread. Next we had the croquettes which were also delicious. We then opted for the duck fettuccine and the cavatelli. Both were great but the cavatelli was simply unbelievably. It was the perfect fall meal with tons of squash and pumpkin. Finally we finished the night with the best cheesecake I have every had in my life.", "pics": null}}, {"review": {"des": "My girlfriend and I bought a Groupon ($92) and came here yesterday for Sunday dinner. We live a few blocks away and have been always wanting to check this place out especially since the restaurant has been in the running to receive a Michelin star. As we got seated I was excited to look through the wine list since the groupon states we can choose a bottle \"up to $70 value\" well when the waitress came up to us she asked if we wanted red or white. I was a little puzzled and said red. Then she asked Cabernet or pinot noir. I asked well can I see some of the different options and she said sorry we already have a bottle specifically picked out that goes with the groupon deal. I wasn't thrilled about that, a moment later she brings us out a bottle of Deloach Pinot Nior. That felt like a slap in the face because that is a $9.99 bottle of wine at a store. I'm not quite sure how a restaurant that is aiming for a Michelin Star can serve such low grade wine. I was highly disappointed with this so minus 1 star. <br><br>I've deducted a second star due to the portions of the meals along with the nonexistent choice that we had similar to the wine. Again on the groupon it says it has to be up to a certain dollar amount. For my understanding that means I pick what I want that falls in that criteria. This wasn't the case. Each item we received was already arranged and we had no choice besides dietary restrictions which we didn't have. Let's get to the portions. First salad tasted great but there was 1 small piece of bacon on it.... 2 people 1 piece of bacon. Yeppp doesn't add up. Next came the fish. It was delicious but again not enough for 2 people. After that was the meat dish which was a steak. (Shoulder cut) seemed to be about 4oz cut into 4 small pieces. Meat was a bit rough for my taste, they should have gone with a filet mignon. Next was pasta biggest portion out of everything (figures because it's the cheapest) tasted great. And last the dessert. Tasted nice too. <br><br>Was all of this worth the $92 that I paid not in a million years. My recommendation to the restaurant is to hire a sommelier and reconstruct the portions for the proper amount of people. I would like to come back again and hopefully have a better experience because I can see a lot of potential for Two.", "pics": null}}, {"review": {"des": "Playful, local food with filling portions and bold flavors!  <br>Servers were friendly and excited about their food, which always helps me get excited about the food that's coming.  <br>Favorites: <br>- Duck fat potato croquettes with chili aioli and parmesan-   Crispy, hot, potato-tastic comforting goodness. <br>- Gulf prawns- the flavor on these was bold and so delicious, everyone at our table was slurping the prawn heads to get the rest of the flavor out.<br>- Duck egg fettuccine- Tender duck and the duck skin cracklins added a great salty flavorful crunch to the dish.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nGOe9Qi50H7w_nMQYqadAg/348s.jpg", "caption": "Duck fat potato croquettes with chili aioli topped with Parmesan"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pgJvajrYJvQUvaxs0RHmVg/168s.jpg", "caption": "Duck egg fettuccine with delicious duck skin cracklins"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cEMYJkOAD0JackYQTV81aA/168s.jpg", "caption": "Prawns"}]}}, {"review": {"des": "Excellent quality, excellent value. We shared 8 options between 4.5 of us (the .5 is a 2 year old :). This was really too much food, but was fun to try a lot!  Interior was nice - a good spot to catch up with friends and share tapas style meal.<br><br>- bacon jam - amazing! Great bread too.<br>- duck fat potatoes - delicious (though if I was going to subtract a dish, this would be it)<br>- green beans - perfect crunchiness and yummy sauce<br>- duck fettuccine- wow! And I didn't think I was a duck fan (warning - very rich!)<br>- shrimp- not a fan. <br>- Tri tip- pretty good, well prepped and the sauce was tasty <br>Cavatelli with ricotta - awesome and loved the addition of pepper spice <br>Heirloom and motz - great!<br>Puppy chow - just like I remembered it from childhood (and the 2 year old was in love)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_oa486DaxfGmla_0ogSMtw/348s.jpg", "caption": "Shrimp"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/drrLT4LvlLkNsDbfdh-ORA/168s.jpg", "caption": "Tri tip (with a few pieces already eaten)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Z1ZmBUXgbilJWO5EINSXOw/168s.jpg", "caption": "Duck fat potatos"}]}}, {"review": {"des": "This place was a 3.5 for me. Boyfriend took me here for our anniversary. He'd put a note in before and we expected some acknowledgement verbally or on the menu like shown in other pics, but the waitress simply said Happy Anniversary when she brought us our check and that was it. Dissapointing!<br><br>For drinks, I started with the Cabarnet and bf tried the New Style and some other smoky drink. He said the New Style was basically an average old fashioned and the other drink was nice and smoky. Unfortunately, I didn't see the Pink Elephant drink on their current menu so looks like their website is out of date.<br><br>For the food, we were recommended to get 2-3 dishes per person. We got 4 dishes between the two of us and definitely could've fed 1-2 more people. We ended up bringing home leftovers of just about everything.<br><br>We started with the Pimiento Cheese and Duck Fat Potato Croquettes. The Pimiento cheese was nice and spicy, but the ratio of bread to cheese was off. Even though they did offer us more bread at the end, we were over it at that point. It was too overwhelming after a few bites. The Croquettes were delicious! They just tasted like fried mashed potato bites, but there was definitely something homey and delicious about it. <br><br>We then got the Amish chicken (which again is different than the menu). This one was served with bacon chicken sausage which we asked not to get since we don't eat bacon and white corn grits. This was by farrrrr the best dish of the night. SO flavorful. I couldn't get enough of it.  The gravy and grits went perfectly together. I would've probably licked the plate clean if we weren't at a nice restaurant! <br><br>We also got the Duck Egg Fettuccine and were so underwhelmed. It was super gamey but lacked seasoning. It was also too dry for our tastes, might help to have a duck egg or something on top. We probably ate about 3 bites total and were done with it. <br><br>Lastly, their dessert menu was really disappointing, but I have the biggest sweet tooth so we got the Freshly Baked Cookies. 4 basic chocolate chip cookies with some whipped cream on the side for $8.... skip. According to the menu its supposed to be served with sweet milk custard, ours definitely was not. We ended up bringing 2 home and it tasted super grainy the next day. Wish they had more intricate dessert options. <br><br>Overall, it was fun to try a new place but I had higher expectations based on the reviews. The ambiance was cute, but not very romantic. It's probably better to come with 3-4 people and try a couple different things.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/njt6zRXd-aPoqX4rFu7NXg/348s.jpg", "caption": "4 Freshly baked cookies $8.. skip."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Fjkpm98Dggm2qOm3IKJZYw/168s.jpg", "caption": "Amish chicken w/ grits.. SO GOOD"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KJe8WfX9VbCRYSuSZy7w4g/168s.jpg", "caption": "Duck fat croquettes.. yum!"}]}}, {"review": {"des": "Ambiance: A cross between urban and rustic comfy feel. I love that they had pillows on the dining benches that added to the comfort. Smart casual. Noise level is average, good for catching up with friends or a date night. <br><br>Food: Tapas style, 4 was more than enough for two girls with voracious appetites. Menu changes, but we got the arugula salad, cauliflower, chicken, scallops and red velvet cake. <br><br>Cauliflower: Purple cauliflower topped with cheese, so yummy. It was kind of on the heavy side in that we started to feel full after finishing most of it. <br><br>Arugula salad: The salad itself was nothing spectacular, but the in house bacon was really good. Nice thick cut of bacon, crisp at the edges and tender in the middle and well it's bacon! <br><br>Chicken: Served on top of a cornbread like food. Chicken had a flavor that almost resembled adobo and was very tender. Recommended by our server. <br><br>Scallops: Three largely sized scallops served on a bed of pickled like carrots. Scallops were really tender, but most of the flavor came from the sauce that carrots were marinated from, a vinegary like taste. The scallops have a really fishy day after smell. They still tasted good just beware if you bring them to lunch with colleagues the next day! <br><br>Red velvet cake: The cake itself were bitsized pieces. It was interesting. The cake was served with chocolate, a fruit I believed to be passion fruit, and beets. Very unique...we licked the plate clean :) <br><br>As for drinks, I ordered the Semillion. Nice and fruity, but not too sweet, with some body. For four plates, dessert and one wine it cost us about $110 with tip. A bit on the pricey side, but... Chicago. <br><br>Service: Great no complaints! I loved that towards the end of our dinner Yamandu, one of the owners, came and chatted with us. I believe he was the one that also answered the phone when I needed to change my reservation. I called half an hour before our reservation pushing it 15 minutes later, I loved that on the phone he was like \"I'll mark it as you're running late, get here safe.\" My friend and I came here by recommendation of our best friend and Yamandu wanted us to call her to thank her for bringing us to his restaurant. He definitely takes pride in his restaurant and genuinely appreciates the referrals. <br><br>Definitely recommend!", "pics": null}}, {"review": {"des": "Oh, I don't know how I feel about this place. I wish I could give it 3.5 stars. This was another restaurant week pick for me. The cured salmon and the shrimp and grits were done really well.  But unfortunately, my porchetta was dry and salty. The chocolate mousse dessert was delicious. The others at my table, who both ordered the spaghetti and tri-tip, complained quite a bit about how salty their dishes were, too. Womp, womp. Well I'm glad I finally tried this place out, but I don't think I will be coming back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KJfaId33Y5v6gw5VAEP8Nw/348s.jpg", "caption": "Chocolate mousse with macerated berries"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VuSGsy_gWgi64g8r3ZN-sg/168s.jpg", "caption": "Porchetta with cabbage"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7WA0KAhvstwa4ZUy2Roxgg/168s.jpg", "caption": "Shrimp and grits"}]}}, {"review": {"des": "I've had better food but I've never had better service. Every member of the staff was unusually attentive and accommodating. Our waiter was outstanding.", "pics": null}}, {"review": {"des": "3.5 stars: Lovely ambience, great staff but unfortunately the food fell short here. Nothing particularly wowed me, and be price point is higher than I'd like for the quality.<br><br>Duck fat croquettes - nice and crunchy, not too heavy but not particularly flavorful even if you dip it in the sauce<br><br>Chorizo stuffed squid - the most unique dish here but I wish the portions were bigger and there was more sauce<br><br>Gulf prawns - decent, nothing out of this world. The radishes underneath I thought were even better than the prawns!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gZ8qqUH10FQTT_4uZWkVYw/348s.jpg", "caption": "Duck fat croquettes"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/U5ErLCsyOojeQzY9vDl8DA/168s.jpg", "caption": "Chorizo stuffed shrimp"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SSzvubVnj3iSnmHbB_fQ0w/168s.jpg", "caption": "Gulf prawn"}]}}, {"review": {"des": "I dined here for Restaurant Week 2016. <br>(+)<br>-Service was good and attentive. The manager even took the time to walk around and greet every single table. When he saw me taking pictures on a dSLR camera, he sat down next to me and asked if he was going to see the pictures published in a magazine somewhere. He was very warm and conversational; I loved it! <br>-Prices were very reasonable. $33 for this meal was a STEAL, especially for the quality of the food and the portions. We enjoyed three full courses PLUS the bonus dessert course (which was just the right amount of food).<br>-I loved my food choices! My absolute favorites were the truffle risotto and salmon. Yummmm. This was definitely one of the best risotto dishes I've ever had. The salmon melted in my mouth and the beets were perfection.<br>-The decor is very cool! Love that minimalist look.<br><br>(-)<br>-The frisee salad, by no means negative (so this is a bit of a misnomer), but it was a bit underwhelming. Nothing special. There was also no interesting plating, even though there was a lot of potential. <br><br>I can't wait to come back and try the very reasonably priced tasting menu sometime soon!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nGNlRIvT1XuwnYKB7RQp6A/348s.jpg", "caption": "King salmon!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LpXtH9WBdVH7wVLBZzfRFw/168s.jpg", "caption": "Truffle risotto with duck egg (extra $3)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kHpCeA0Lw0HCN1uhe_uvJw/168s.jpg", "caption": "Suckling pig"}]}}, {"review": {"des": "Ugh this place is just so incredible. I've been in Chicago less than a year, but I can safely say this is my favorite restaurant in the city. The service, vibe, and venue are all impeccable, but the food still takes the cake (no pun intended?). <br><br>This time around, we ordered the Duck Fat Potato Croquettes, Saffron Spaghetti, Duck Egg Fettucine, Elk Loin, and Arugula Salad. I was going to try and single out a few of these dishes for being particularly exceptional, but I really can't. Everything was just so good. <br><br>I asked them to \"surprise us\" with the dessert, so I actually have no idea what they ended up bringing out haha. The pastry chef, Chef George Kovach came out with two additional desserts for us to try as well. Everything was, again, amazing. He also told us about a new restaurant that's in the works called \"Antidote\". I will be anxiously awaiting opening day :)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rz7eLrGAGoxcR29ivO2RpA/168s.jpg", "caption": "My first time trying elk loin :)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/evbPnPUc0HCVMbGnZBqM1A/168s.jpg", "caption": "Dirty martini"}]}}, {"review": {"des": "I was in Chicago on a business trip and met my son and his friend for dinner on Wednesday. I chose this place based on its interesting menu and the many positive reviews of other Yelpers.  All three of us shared appetizers and each ordered our own entrees.<br><br>We sampled the pimento cheese, mussels with chourizo and grilled asparagus. While I am not a fan of asparagus, it was grilled to perfection and served with a mushroom. Very tasty. The mussel dish was served with grill-charred bread for soaking up the broth. Again, this was top notch.<br><br>For entrees, my son ordered the half chicken, his friend ordered the duck egg fettuccine and I ordered the scallops. The scallop dish was garnished with green lentils and creamed brussel sprouts. The scallops were cooked perfectly and the garnishes complemented the dish.<br><br>My only gripe (and it is minor) was that our waitress kept telling us that we had to order at least 6 plates and this point was hammered in to us multiple times. I would have preferred that this be made as a suggestion. This did not put a damper on the night and I would definitely return.", "pics": null}}, {"review": {"des": "Warm and welcoming. Service is always great. Their food is excellent. Duck fat potato croquettes are my fave.", "pics": null}}, {"review": {"des": "Get the ramp chimichurri ribs...they are unbelievable and the best ribs I've ever had. My husband was obsessed with the chile broccoli. This place has a nice vibe and cozy feel. Service was nothing spectacular.", "pics": null}}, {"review": {"des": "TWO for you, two for me was what I was wishing of the delicious plates I tried. A friend of mine suggested this place for restaurant week and I'm glad she did. It was intimate and comfortable place to catch up with your girlfriends. We had all our glass of wine to go along with our restaurant week menu. <br><br>I went with:<br>Course 1: Yellowtail, crispy pork belly, lemon vinaigrette, pickled chilies  <br>Course 2: Wagyu pastrami, fingerling potatoes, mustard jus<br>Course 3: Black truffle risotta, wild arugula, walnuts gremolata and fried duck egg<br>Bonus: Cheesecake mousse<br><br>The flavors of the crispy pork belly and lemon vinaigrette complimented the freshness of the yellowtail really well, my favorite course of the night. The waygyu pastrami was tender and flavorful, however, a bit too much fat on it for my liking. Fried duck egg on black truffle risotta was the only way to go, but this lacked a bit of flavor and very heavy as a last course. The sorbet on top of the cheesecake mousse was extremely tart, I had to eat it separately from the mousse, which I enjoyed. A yummy meal that will get me to come back to try the rest of the menu.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Av3wfohN4TnHG21yAErwdA/348s.jpg", "caption": "Cheesecake mousse"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5NNndMjHHXJ2dch-NQvNzA/168s.jpg", "caption": "Black truffle risotta, wild arugula, walnuts gremolata and fried duck egg"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6qDkKFlOsCACMCjQ2KCkVw/168s.jpg", "caption": "Wagyu pastrami, fingerling potatoes, mustard jus"}]}}, {"review": {"des": "How do I go to a three-dollar-sign restaurant without breaking the bank? *insert thinking emoji* Ah, yes. Restaurant Week. Four courses for $33/person is a win in my book.<br><br>It's a very cute and cozy spot that can be great for both friends and dates. The service was good, but I did get slightly confused on who was our server since multiple people came by our table the entire time.<br><br>My friend and I ordered the same thing off the Restaurant Week menu. Actually, it was more like I ordered off the menu, and my friend copied what I ordered. So much for trying other dishes off the menu. :(<br><br>First Course - Yellowtail, crispy pork belly, lemon vinaigrette, pickled chilies: I really enjoyed this dish. It wasn't heavy and had the right amount of vinaigrette to not overpower the entire dish. Very refreshing!<br><br>Second Course - Wagyu pastrami, fingerling potatoes, mustard jus: What a big chunk of meat and a pleasant surprise! This was a very savory dish, and the potatoes definitely complemented the pastrami.<br><br>Third Course - Slagel Farms Suckling pig, pork jus polenta, stone ground mustard vinaigrette: This was yet another savory dish and flavorful.<br><br>At this point, I was thinking, \"Okay, I'm not going to be full by the end of this meal. I feel like I just ate one appetizer even though I just went through three courses. I spotted multiple tables getting a big loaf of bread, so I asked one of the employees if the bread was complimentary. Sadly no, it's $6. We decided to order it anyway. I have no regrets! The bread had the right balance of being crunchy on the outside but soft on the inside. It came with butter and roasted garlic. I seriously debated whether I should be loading up on the garlic since I had a weekly meeting with my manager the next morning. After some debating in my mind, I decided to only put a little bit of garlic on each of my bread slices. Eating 95% of that bread finally made my stomach feel satisfactory.<br><br>Bonus Course - Cheesecake mousse: passion fruit, caramel, coconut sorbet: I'm not a big fan of cheesecake so seeing that option as the only dessert on the menu caused my facial expression to resemble one's reaction after eating a Warheads candy. However, to my surprise, it didn't taste or look like a traditional cheesecake! In fact, the passion fruit ice cream was the most powerful flavor. The dessert was simply delightful.<br><br>I definitely recommend coming here for Restaurant Week. It's a great value!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/M-S9T-KmCTV1qHa3aYlPdw/348s.jpg", "caption": "Cheesecake mousse"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/d0Zg5EDNgy9K35vgzybzqA/168s.jpg", "caption": "Bread with garlic and butter"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ylJF0qHxp-XGBYpPG3LDmA/168s.jpg", "caption": "Suckling pig"}]}}, {"review": {"des": "Had an overall great experience at TWO and would recommend!<br>Bacon Jam-7/10<br>Duck Fat Croquettes- 7/10 <br>Tomato Salad-7/10<br>Halibut- 8.5/10 <br>Pork Tenderloin- 6/10<br>Duck Egg Fettuccine- 9/10 <br>Panna Cotta- 8/10", "pics": null}}, {"review": {"des": "ABSOLUTELY OUTSTANDING. Cannot heap enough praise onto the people of TWO. Went for the amazing restaurant week menu, but will be back soon and often to try the frequently updated regular menu! It takes a lot for me to fall in love with a place so quickly, and I'm usually hesitant to give 5 stars without at least a couple visits, but TWO deserves that and more. Plus, their restaurant week menu,at $33, is probably one of the best deals out there.<br><br>First, the farm to table menu. All the ingredients were fresh and expertly prepared. I'm not sure if the dishes I ordered were on their regular menu, but if they are, I'd recommend any of them! First course, two  sashimi-sized cuts of cured salmon that were buttery and delicious with rye bread and sumac cream cheese. Second, house-made pasta with pancetta, oyster mushrooms, and a poached egg. OUTSTANDING. The pasta was the perfect balance of soft and chewy. Third I had tri-tip with heirloom potatoes, cooked to a perfect medium rare (as all steaks should be. Finished with dark chocolate mousse and homemade cookies! YUM!<br><br>All of that delicious food, and on top of it the service was the best I've ever had. Many compliments to the waitstaff, who went above and beyond to ensure we were not wanting for anything! <br><br>I can't wait to go back and sample some of their other offerings. Thanks again!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2tw8Fx5VvD_XBMPVMmvSEQ/348s.jpg", "caption": "Dark chocolate mousse with homemade cookies and macerated berries"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/evI_8mnW12Trow5qn_KUZw/168s.jpg", "caption": "Slagel farms tri-tip with heirloom potatoes and herb butter"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gr5RU27DrNQscnifxm3S3g/168s.jpg", "caption": "Za'atar cured salmon with rye bread and sumac cream cheese"}]}}, {"review": {"des": "We thought potato croquettes were overrated and bland, but still managed to enjoy scarfing them all down!  The cocktails were fun and almost well executed.  The cocktail that the menu went into such detail to describe having two maraschino cherries came out with only one, with no comment from the server that they ran out or some other reason. Seems odd to call out such details if they aren't consistent.  Yes, this is a small observation that is nearly not worth noting. The food was good, especially the mussels. I hate the adjective 'good', but that's what it was. No regrets going, but won't rush to go back. One ladies toilet for a restaurant of that size seems unusual, but I was ok waiting for 5 minutes in line during dinner, others may not be. If you haven't been, give it a shot.", "pics": null}}, {"review": {"des": "This place is great. Went in date night with my wife. We ordered 5 dishes. Scallops, half chicken, arugula salad, lamb belly, and Brussels sprouts. All great, but I listed in order of our favorite. We each also had a couple cocktails. Lots of bourbon and whiskey choices. Would definitely recommend coming here. Easy street parking and got a primo Saturday reservation time earlier in the week.", "pics": null}}, {"review": {"des": "Love this place! Excellent service, relaxed vibe, great food and drinks. <br><br>We visited over the weekend for a celebratory dinner and had a great time. Our waiter was top-notch, and we stayed a little late after closing to wait out bad weather (while we waited for a Lyft), and the owner could not have been more gracious. <br><br>Will definitely be visiting again!", "pics": null}}, {"review": {"des": "Awesome ! If you like bourbon manhattans try their signature drink- scallops were perfect and risotto blended well with everything on the menu.", "pics": null}}, {"review": {"des": "Judging from the overall Yelp rating, perhaps my dining experience was a misstep. <br><br>Our 2016 Restaurant Week selections were as followed:<br><br>My first course consisted of the yellowtail and crispy pork belly. The pork belly was slightly overdone and beyond crispy. It was crunchy and sat upon a small mound of what seemed to be mayonnaise. The yellowtail was complimented with ginger vinaigrette, pickled chilis, and flakes of salt. Although it was delightful for the most part, the salt gathered atop one piece of fish, making it overly salty.<br><br>For second course, I had long set my mind on the wagyu pastrami and ordered without hesitation. It's rather atypical to associate waygu with pastrami, since pastrami is usually made with the cheaper beef navel. I am the usual annoying person taking pictures of food before digging in. All the while I was testing different angles, the aroma from the meat was so enticing and distracting. I quickly put my phone down and took a slice at the meat. Like a steak, it was thoroughly pink on the inside with a beautiful brown, glazed crust. Can't go wrong with this selection.<br><br>With third course, I had some regrets with my Slagel Farms suckling pig. I anticipated a tender, gelatinous roasted slab of pork. Instead, it was pulled, pale pork over a lean pork tenderloin with polenta. The flavors were as bland as the presentation. Sad to say I was underwhelmed.<br><br>Last but not least, the fourth course was the coconut cheesecake mousse paired with passion fruit sorbet, caramel, and candied coconut. I am not a fan of coconut and this dessert came as a pleasant surprise. The cheesecake was very light and frothy. I wished the portion was bigger. The sorbet was much more blatant and tangy. So with that combination together, the dessert was far from sweet but still enjoyable.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/R4AQBZ4c3JMSrHwGWerZFQ/348s.jpg", "caption": "CRW16 Coconut cheesecake mousse, passion fruit sorbet, candied coconut"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cS78hwa2KrENpidIpMwjCg/168s.jpg", "caption": "CRW16 - Slagel Farms suckling pig, pork jus polenta"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0Yrm-FYDzeG7YbFw19huxA/168s.jpg", "caption": "CRW16 - Waygu pastrami, fingerling potatoes, mustard jus"}]}}, {"review": {"des": "Had reservations for 2 at two on last Friday, it was nice that they allowed reservations to be made the same day, because without reservations I'm pretty sure we would not have been able to eat here! <br>The food was good but the flavor profiles could have varied more. most everything we ate, had the same spicy aftertaste which was fine but they could benefit from more variety. I could have done without the $8 bread on the menu (obviously I didn't order it) but it still peeves me that any restaurant would charge that. <br>The wine selections was perfect- for lovers of dry wine, nothing sweet here. <br>On another note, our waitress must have been new-ish because she was oddly awkward for the caliber of restaurant/cost of meal. Maybe she was having an off day but every time she came to the table it felt forced. She was nice enough but could use more practice. <br>Overall a solid meal but with some room for improvement.", "pics": null}}, {"review": {"des": "This place was great. The service is fantastic...we had a show afterwards and the waiter was really helpful in making sure we left on time. All the dishes are pretty small, tapas style. For 4 people we orders 7 dishes, which was a good amount but we could have gotten a few more if we had time. Everything was good. The croquettes are amazing, crab spaghetti was so good and a perfect amount of spicy, steak was good, Alaskan halibut was ridiculously good (must order), duck fettuccine was ok. Bacon jam was also good but nothing to write home about. Can't wait to go back", "pics": null}}]}