{"name": "umai-chicago", "reviews": [{"review": {"des": "This place was amazing! First off, if you don't want to read the rest of the review, just go here! I had a great experience.<br><br>My friend and I came here really late. Their kitchen was 10 min from closing and they still let us order quick. Our order came real fast and it was so great how friendly the staff was. They were so accommodating. Really made a great experience!<br><br>I got the miso ramen which was $13. I loved it! It was so good. It had seaweed, hard boiled egg, and everything you would expect on a typical miso ramen. The broth was great. The temperature was good enough that you're not burning your mouth and warm enough to enjoy it. The meat was tender and easy to eat. <br><br>I would definitely come back here again and try other things on the menu. My friend had the udon and she really really loved it. She said she would go back!", "pics": null}}, {"review": {"des": "We came in with reservations for 7 and were seated promptly, they are pretty good about getting you situated accordingly! Our server was attentive and even helped us split the check as well as he could on a busy Wednesday night. <br><br>I got the Winter Ramen and also a Fresh Philly roll, both were delicious and the Winter Ramen was the perfect amount of spice for the beginning of the cold winter nights! My friends were also quite happy with their meals... That is until later in the night. I ended up feeling extremely sick and eventually throwing up after dinner (which has NEVER happened to me before! No alcoholic drinks accompanied my dinner!) I'm chalking it up to the ramen because my friend also had a bowl and she also complained of a major stomach-ache the next day. I enjoyed the experience I had at Umai because it was lovely, I really just wish I hadn't gotten sick from their food. That is the main reason for my stars taken off.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FBlVvQw5pmCU1yPkCIx7og/348s.jpg", "caption": "Winter Ramen"}]}}, {"review": {"des": "I only live one blocks away so I used to go there frequently, at least once per week to be specific. I literally tired every single piece on their menu for at least one time. However the quality of their service and food has been dropping in a speed that everyone can tell with their bare eyes.<br><br>Not to mention my friends and I experienced food poisoning once by their raw fish one time. (About a month ago)<br><br>And until today I went there 4:20 in the afternoon with two others for an early dinner. There were only two tables taken at the time and we were brought to a small table (should be only serving two people) with an extra chair. Everyone who went here before should know how small the tables were already. Too small that can't even place three menus. <br><br>When we kindly asking the host for a larger table, he simply said all of them are reserved. Again I walked by this restaurant all the times I knew what this restaurant looks like 5pm on a weekday. Too bad that they did not hire people that met the standard, or I should say they found exactly the kind of host that they are looking for.<br><br>Although I hope it is true that all the tables are taken at the time. Best wishes:)", "pics": null}}, {"review": {"des": "Best ramen I've had in Chicago! First time trying this place out thanks to my friend. I got the spicy roasted garlic pork ramen and a half roll of Chicago maki...beautiful combination! The broth was so rich in flavor (not too salty) and the noodles were sooooo tangy. The texture of the noodle is one of the most important part and they got it just right! Perfect runny yolk, tender pork (chashu), and rest of the delicious toppings. Japanese ramen can feel a little heavy afterwards, but having the fresh Chicago maki on the side balanced that out so well! I personally didn't find the ramen spicy at all, but then again I have a very high spice tolerance. Definitely give these two a try--it was delicious! <br><br>Aside from the food, which is the most important part, nice interior design and good service! (:", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PE4_pZ6ttbr4vN2TV6K_vg/348s.jpg", "caption": "Half roll of Chicago maki  so fresh"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/n-ep1Z4VNJxl9qv46Wyieg/168s.jpg", "caption": "Spicy roasted garlic pork ramen+Chicago Maki"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/D8yXqyuySsTZN2tDzvrraA/168s.jpg", "caption": "Spicy roasted garlic pork ramen (3 same pics in 3 different angles cz it's that beautiful)"}]}}, {"review": {"des": "While in town visiting, my friends and I came in for a late lunch on a Saturday. The hostess asked if we had a reservation and I looked around. The place was not busy. I replied no and she proceeded to show us to a table. Initially I thought it was weird but reading the reviews afterwards, I see they are usually super busy and reservations are recommended. I suppose we got lucky that day without one. <br><br>Our server came over automatically with ice water. He was friendly and helpful. One of my friends had some dietary restrictions and he made suggestions to accommodate him. He ended up ordering a ramen, I got the katsu don, and our other friend got the mexicana maki. We also shared the shrimp shumai and shishito peppers apps. <br><br>Both apps were good though not extraordinary. My katsu don came with a salad and miso soup. The katsu don itself was a super generous portion. The bowl had a good amount of rice and was topped with a huge pork cutlet that covered the whole top. It also had a fried egg, mushrooms, and green onions. I could not finish it alone but it was delicious. I had a piece of the Mexicana Maki and it was surprisingly really good! <br><br>Great place with cool vibes. The food was good and, although pricey, the portions were satisfying. Big windows with nice views of the city. The place is not that big but I like that kind of intimate setting. Definitely would like to come again if ever back in the area to try out their ramen and sushi.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RsClwRg0wmRHjSzMQwUUjQ/348s.jpg", "caption": "Shrimp Shumai"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RPHamjqChOOoCr_iZgbK_w/168s.jpg", "caption": "Ramen - not sure which one :)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wi_Vk9dGOtAXNpM9wPRmvQ/168s.jpg", "caption": "Mexicana Maki"}]}}, {"review": {"des": "If I could give this restaurant 4.5 stars I would. Efficient service and fresh sashimi.  Noodle dishes (we got the spicy pork ramen and sukiyaki) were excellent, the flavor really popped.  Agedashi tofu was just okay.  This place is reasonably priced which is a plus!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/irAHNAllJGbQjv9BTTB8MA/168s.jpg", "caption": "Sukiyaki - flavor was quite good but I wish there was more broth. Has watercress which can be hard to find!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0Th28MnM_CQirmnA4llQHA/168s.jpg", "caption": "Spicy pork Spicy Roasted Garlic Pork Ramen - delicious and has bomb chashu"}]}}, {"review": {"des": "Decided to try Umai because it had great reviews and was a short walking distance to my friends apartment. We walked in without a reservation around 7pm Sunday night and was seated at the sushi bar. Started off with a bottle of hot sake (holds about 6 'shots') to share. <br><br>I love Amaebi (Sweet Shrimp) and put in a order of 2 as my appetizer, but the waitress came back 5 minutes later after taking our order to tell us that they were out of Amaebi. Highly disappointed because it wasn't even that late into dinner time and they were out... Decided to just order the Seaweed Salad (4/5 standard) as an appetizer after finding out about this. <br><br>I ended up ordering the Chicago Maki (half portion 5/5 pretty decent portion even for the half size and I loved the fish to rice ratio), and the Mexicana Maki (5/5 full portion and SO much more fish compared to the Chicago). My friend was fancy and ordered the Umai Grand (5/5 decent amount of food for 1 person and the sashimi was fresh). <br><br>Solid sushi restaurant in Printer's Row, and Lou Malnati's was on the way back to my friends apartment so I was able to order some pizza to-go for a late night snack :)", "pics": null}}, {"review": {"des": "This is a great go to spot for date nights or a quick good quality bite. The food is great but the service is even better!", "pics": null}}, {"review": {"des": "A solid 4-star! The spicy pork ramen lives up to its reputation and the salmon carpaccio and the Nebayaki udon are great as well. However, the lollipop chicken and the Gyu-Don both were pretty much flavorless. I had to add the ramen soup to the rice in order to finish it. The service is descent though and the atmosphere is friendly. Regardless, I'll be coming back, but just for the ramen.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/N36S8jMNPxrIEnnGVcYF3Q/348s.jpg", "caption": "Fresh and delicious!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DlMzjidLjiruBp_CuU3G5Q/168s.jpg", "caption": "Flavorless even with the mayo..."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GwTEYRH3QglTrJ3KVSK4wg/168s.jpg", "caption": "Not as spicy as it looks!"}]}}, {"review": {"des": "I love finding gems like Umai. Sushi is very fresh and delicious! There are so many awesome Japanese dishes other than sushi here so if you're not into raw fish, you're safe. <br><br>We ordered WAYYYY too much food because everything on the menu looked so good! And the team here are SO hospitable and I couldn't ask for a better dining experience. <br><br>I can't wait to come back already and so happy to have found my favorite sushi restaurant in Chi town.<br><br>p.s. shout out to Tira for being an amazing server.", "pics": null}}, {"review": {"des": "There's three pieces to this review. I hate to one star, but...<br><br>1) The ramen was really bland. Really bland. Chicago has a lot of boring ramen, but this tops it. <br><br>2) Sushi. The sushi was phenomenal. Some of the best in the south loop...until the next day...when...<br><br>3) It turned out we got a lot of Escolar and not tuna and spent the next day leaking oils unexpectedly. That's not fun. Neither is spending the day on the toilet. I've never run into this anywhere and it seems like they may need to find a new supplier.<br><br>Boring ramen, great sushi of you're willing to risk it...", "pics": null}}, {"review": {"des": "This place has really cute ambiance. It has a lot of wood but has huge windows so it gives a very ancient yet sunny look. <br><br>I had the garlic pork ramen. It's really good! The noodles in this ramen are sooo good. The flavor has a kick and the chasu in it is quite tender. I've had better ramen but this is pretty good. <br><br>Also had their crunchy avo eel roll. This is literally the best eel roll I've eaten anywhere. It is so fresh and well made. <br><br>Definitely coming back. The service here is good but when they're busy.. they stop paying attention to you after you get your food which to me is fine... till I ran out of water lol", "pics": null}}, {"review": {"des": "Umai is truly umai! (Japanese for tasty or delicious) I'm Japanese and I like to try ramen in the different cities I visit. I came here for my last meal in Chicago (don't worry -- I got my share of pizza while there!). <br><br>I came by on a Tuesday evening around 5:30pm and waited about 20 minutes for a table for 1. My server recommended the Winter ramen so I ordered it and one order of hamachi nigiri. The broth was tasty and not too salty. The ramen had a generous portion of toppings (meat, fish cake, veggies). For a restaurant that serves a number of ramen options, I would expect better ramen noodles. Not sure how to describe it-- but they didn't taste as fresh as ramen noodles in Tokyo. For a ramen lover I'd rate this 4 stars but the ambience, service, flavor and decor proves it to be 5 stars. <br><br>A great place for groups! I would visit again the next time I'm in town.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4_kg_W3AKR8bd44FDugFcw/348s.jpg", "caption": "Winter ramen"}]}}, {"review": {"des": "I ordered Umai delivery so I can only speak to the food and not the restaurant service. This is currently my favorite sushi stop in the area. I ordered the 4pc nigiri sushi appetizer, escolar sashimi, spicy tuna roll, and beni imo roll (veggie). The beni was the best veggie roll I've ever tried and I would even recommend to those not interested in a veggie roll. Escolar was not disappointing, but cuts could be thicker.", "pics": null}}, {"review": {"des": "I got the spicey pork, really good, not that spicey at all tho. Also the ground pork is minimum , you can pay extra for more. The noodles were tender and really good. The pork cutlets were amazing. Small place but super cute and romantic lighting. Good music playing. Not portion, I ordered sushi and couldn't finish it. The staff are on point as well. Super recommend!", "pics": null}}, {"review": {"des": "I want to LOVE Umai but I just don't.<br><br> I ordered the hamachi kama.  it was supposed to be grilled but it was coated and certainly seemed deep fried.  While the interior was good, save the dry sections, every other kama i've had has been entirely tender and flaky without any sort or breading. I consider this one to be okay but i'd rather eat yellowtail collar somewhere else.  <br><br>also got sashimi (as I alway do) this time hamachi, escolar and uni. <br><br>the hamachi was superfresh, but suffered from the lack of fresh wasabi.  I don't mind paying a bit extra for that but it wasn't offered - I was told their wasabi was good quality...but once you've had fresh you are ruined for all other wasabi.<br><br>. the escolar was okay but had stringy inedible portions. <br><br>the uni was a bit past fresh...melted on the lettuce not in my mouth. So terribly unfortunate and disappointing.<br><br>overall the food was underwhelming.  that said I've heard tell of their Ramen so since I live nearby I'll probably try it and perhaps find the sweet spot that has given umai a good following.", "pics": null}}, {"review": {"des": "そんなにうまくないんだけど？？？<br>I was taking my parents who were visiting from abroad out for dinner and I yelped this place which seemed to have promising reviews. We made a reservation for 6 and it wasn't even remotely full when we got there yet the waitress tried to place us at the center large table instead of at a private table. <br>The food was also just...so salty and plain. We got fried chicken which wasn't even Japanese style karaage but more of the dry fried chicken you'd expect from KFC. The curry was way too salty and the pork cutlet had too much flour and not alot of meat. The noodles were also rather salty but otherwise flavorless. I felt so awful that I brought my parents there.", "pics": null}}, {"review": {"des": "Was in Chicago with some coworkers. Not all of them are adventurous eaters (one of them just ate cornflakes the entire time we were there) and I wanted something I could write about. I searched Yelp for some sushi since I was craving it and Umai pops up with amazing reviews. I was staying at the Hilton Chicago which was a ten minute walk away. Made a reservation for one online just in case it was super busy.<br><br>My table wasn't ready when I arrived, so I sat in the waiting area which is right near the entrance. Not a good idea. It's a small place, so they make do with what they have. You'll be in the way if you choose to sit down. I made my way the sushi bar since it was just me. I don't normally say this, but I'm glad I sat at the bar. The guys making the sushi were very nice to look at and extremely skillful. I could have watched them all night. I'm terrible, I know.<br><br>My server, Nuii, came over and made some recommendations. Such a sweetie pie. I had no idea what I wanted, so I had to really dig through the menu. She brought me over some water and let me stew over what to eat.<br><br>Looking through the menu and I already know I want to get as much as I can just in case I won't make it back again. The first thing that caught my eye were the shishito peppers. I've seen videos on YouTube of people cooking with them, but I had never had the chance to try them for myself. I also got some of the bbq hanger steak. <br><br>What a good decision. The peppers were nicely charred and smokey with a vibrant green color. The lemon and bonito flakes were such a nice touch. Plus, I loved watching the flakes wilt under the lemon juice. If I didn't care for the rest of the menu, I would have ordered two more plates of them. The hanger steak was marinated properly and wasn't as chewy as I thought it would be. Came with a little shishito pepper on the side.<br><br>At this point, I still don't know what I want, so I just take anything: beef gyu-don bowl with an onsen egg. I love onsen eggs! They remind me of the steamed eggs I used to make in Italy years ago. They really do transform a dish. If you're looking for a sauce or something to bring the dish together, an egg will do it.<br><br>As soon as my server brought the dish out, I knew I had made the correct choice. Along with my bowl came some udon soup (with a pink fishcake!) and a small salad. Demolished the salad and drink the broth from the udon.. and the little fishcake, of course. And then I set my eyes on the gyu-don. My bowl is loaded with rice, beef, onions, pickled ginger, sesame seeds, and a softly boiled egg. I don't mix everything together because I want to taste each ingredient individually. <br><br>The rice had a great, chewy texture. Beef was cut and seasoned properly. The ginger was a good palate cleanser between bites after I decided to mix everything together. And the egg was amazing! Nice and gooey! Check out my videos to see some drippy egg action.<br><br>This is the point where a normal person would get dessert or call it a night, but not Urs. Urs wants more even though her belly was already bursting. I ordered some uni just because it's sweet enough (to me) to be dessert. It has this nice custard-y thing going on and a slight sweetness that I live for.<br><br>The chefs apparently messed up my order and gave me some sashimi on the side. I will never complain about extra, free food! Fish was super fresh along with the uni. It was great.<br><br>But... yeah, my fat self couldn't stop. Finished the night knocking back raw quail eggs and soy sauce. To top it off, I got a sushi roll and some bbq pork shoulder for later on. I was a true mess when I left. I ate the pork and never even touched the sushi during my stay. What a waste.<br><br>All of this good food came to $63.00 with tax. I did a bit of damage by myself, but I just knew I wouldn't be able to go back with our busy schedule.<br><br>Yeah, I went back the very next night. I'm so fat, ya'll. <br><br>My server this time was Megumi. She was so cute! I'm an awkward person, so I'm sure I made her uncomfy while ordering, but I tried. I finally looked at the drink menu and ordered a lychee martini. So delish. It wasn't overly alcohol-y which is what I fear with martinis. Just the right amount of sweet and bitter.<br><br>Got some more shishito peppers to start my meal off right, but I was in no mood to eat as much food again. For my main, I had a plate of katsu kare with an onsen egg on the side. I love me some fried pork and gravy! The color of the curry was dark and luscious and the taste was on point. Paired with that crispy pork cutlet... I could have died right then and there. Mostly from clogged arteries, but happiness, too.<br><br>Y'all will be proud of me! I got an actual dessert this time: lychee sorbet. It had these squishy chunks of lychee in it. A very refreshing way to end a meal. Damage: $35.00.<br><br>Going to a big city when you're from a small town does you no good; it just spoils you. I will never find an experience like Umai anywhere nearby.", "pics": null}}, {"review": {"des": "My boyfriend and I went to dinner on a Thursday night. We tried to call ahead of time for a reservation but the waitress told us we didn't need them and told us to just walk in. Lo and behold, we walk in at the time we inquired about and we were told the wait would be at least 30 minutes. I felt a little conned but put down my name anyway. We just decided to make a quick trip to Target during our wait time. It ended up taking just around 30 minutes. <br><br>We ordered: pork gyozas, spicy chicken wings, the Umai Crunchii roll, and the Spicy Roasted Garlic Pork Ramen. The pork gyozas were really good! Not sure if each gyoza was worth $1 but I have no complaints about the flavor itself. The sauce for the chicken wings was really good as well! Unfortunately, the majority of the wings were over fried and too dry. I believe there was only one wing that was cooked well and I was lucky enough to snag it from my boyfriend! The sushi roll was good as well. It fell apart too easily but very yummy. As for the ramen, the garlic was NO joke. Our breaths literally still smelled like garlic the next morning. The noodles were a little bitter but the broth was good. It was also a pretty large portion so the price tag was justified. <br> <br>Would definitely come again to try some of the other dishes on the menu!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/y1jPxHna5URGMpGOpIZe2A/348s.jpg", "caption": "Umai Crunchi Maki & spicy Spicy Roasted Garlic Pork Ramen"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iSzPybhSg8WpjKFnFs1M0w/168s.jpg", "caption": "Spicy Chicken Wings"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4FW6cbMz3HePlZlOK6OdGQ/168s.jpg", "caption": "Pork gyozas"}]}}, {"review": {"des": "Came here for dinner with my s/o on a Saturday evening. I was a little worried about going without a reservation, but we waited maybe 15-20 minutes for a table. The ambience is casual yet \"cool\" I'd say. We ordered a rainbow roll, which was good- nothing out of the ordinary but good.<br>We then split the spicy roasted garlic pork ramen, at the suggestion of our server. They split it into two separate bowls for us! So nice! <br>I wouldn't say it was the best ramen I've had but very solid. I would return next time I'm in the area!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MXHM0Yrp-tYjv0WJ5uI_qg/348s.jpg", "caption": "1/2 of the spicy garlic pork ramen! They'll split it into two bowls for you, if you would like to share"}]}}, {"review": {"des": "Umai is amazing. They also have another location in Fullerton but I go to this one quite often. For ramen, I recommend the spicy pork ramen and I love the dragon roll sushi. Prices are good, cheaper than similar downtown restaurants. Be sure to get spicy mayo sauce on the side.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UJz-_hCbg98e3hk274m0XQ/348s.jpg", "caption": "Dragon roll and Spicy Roasted Garlic Pork Ramen"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YxJpPwYo3g9a9bN4YL3faA/168s.jpg", "caption": "Spicy pork"}]}}, {"review": {"des": "Excellent!!!!!! From the sushi to service delicious.<br>The white ginger dressing had my senses going off immediately!!!!", "pics": null}}, {"review": {"des": "We ordered sukiyaki, unagi don, and chef special sushi selection.<br>Unagi don is the best among the three -- the eel tastes super fresh. And it's not entirely covered in heavy unagi sauce. It's among the top three I've tried in Chicago.<br>Quiet disappointed to find out that they don't offer raw egg for sukiyaki. The beef is slightly over cooked. It's a bit chewy.<br>May come again for the unagi don, but would not recommend sukiyaki to others.", "pics": null}}, {"review": {"des": "Umai (you my) favoriteeee! <br><br>I stopped in for quick dinner while on a work trip in Chicago. Needed something quick and delicious, and room service wasn't going to meet these needs. I was able to snag the last open seat at the sushi bar, to my relief, because I probably was going to fall over any minute from a combo of starvation & exhaustion. <br><br>Glad I chose Umai because their service was prompt, polite and sharp... and the sushi chefs were skiiiiilled. I can attest because I watched them make my delicious rolls super duper fast but with much precision, and whilst note forfeiting their deliciousness. I ordered the dragon roll, a half Chicago roll, as well as a bowl of tempura udon. The tempura udon was legit - came with a hefty bowl of fried goodness that I dunked into my piping hot soup!<br><br>Though now I have a problem because i literally inhaled all my food and am having so much trouble breathing...", "pics": null}}, {"review": {"des": "Umai was my first Japanese restaurant I've visited when I moved to Chicago (2.5 years ago!) but it's also my favourite Japanese/sushi restaurant in all of Chicago. Service is great, the vibes are relaxed/chill, the food here is consistently good and the sushi/fish here is fresh.<br><br>I would highly recommend ordering an udon and half order of the Chicago Roll - my two favourites! Honestly, I feel like the half order of Chicago Roll is the perfect portion in comparison to the regular order (isn't it awesome that Umai does half orders? Prices are just half the price).<br><br>I ordered the chirashi the first time I came here, it was good but a little pricier than other places but the quality is there. Wouldn't recommend ordering it if you are hungry!<br><br>My most recent visit, I tried the omakase. It's pretty good! It's not the same as the table side fancy omakase places where you eat the sushi and the chef makes it but it's very good. Fish is fresh and you get a great variety.<br><br>It gets pretty busy here too, so I would recommend making reservations. Bonus tip: They are on Seated! If you have a party 4 or less, use Seated to make reservations so then you can get some starbucks/amazon gift cards!", "pics": null}}, {"review": {"des": "We have travelled the world in search of good tsukemen. We did not find it here. <br><br>Umai has a basic misunderstanding of tsukemen ramen: watery broth (?), grilled chashu (?!), undermarinated egg (??!), and completely mishandled, dried noodles that congealed together into one giant cold cylinder (???!!). In a good bowl of tsukemen, the noodles should carry the richness of the broth, the meat should be tender and a little sweet, and the intensity of the umami should marry with the starchiness of the noodle. <br><br>We had previously tried Umai's black garlic ramen  which is why we're adding one star to our most recent experience. The other star goes to their hand painted poster of 'In the mood for love.' Just do yourself a favor and save yourself the disappointment of trying their tsukemen.", "pics": null}}, {"review": {"des": "Went back but this time wanted to try something besides the ramen. I got the Japanese bbq pork shoulder which was small and very flavorful, so good for an appetizer. The yellow tail nigiri was so good and fresh. Sloopin roll was ok, nothing to write home about.", "pics": null}}, {"review": {"des": "Every now and then you hit the restaurant jackpot and we did just that on Friday night with Umai. It has an ideal can't miss corner location with a nice vibe and a welcoming staff.<br><br>We got a hotel downtown for our city weekend before the years end and I was craving for some ramen and curry due to the awesome weather we have had this Winter so far:).<br><br>The place was fairly packed on Friday night. We met a couple more friends and decided to try a number of dishes. The steak entree's were my favorite although the maki rolls we tried were also yummy.<br><br>We ordered the Shrimp Shumai and beef tataki for our appetizers mexicana and sloopin special maki rolls, udon kary with beef  and gyu- don for our beef entree's. Everything was amazingly delicious. My only complaint is that their ramen are all pork based so folks who don't eat pork would not be able to try them.<br><br>We will definitely be back at Umai to try some of the other items on their menu.", "pics": null}}, {"review": {"des": "We ordered a lot of food and the service was very attentive. The fish: the nigiri pieces were very large and flavorful. The sashimi was good too - served on ice. Try the toro - though expensive, it is worth it! It has a pretty unbelievable texture. We also got the orange sea urchin. I although that wasn't to my taste, I can really appreciate that dish too.<br><br>Other dishes like the tempura have a good crispiness to them, and come with a great dipping sauce. The portions are a good size too.<br><br>One thing that I think that I think umai does especially well is the presentation of the food. Each dish has a very nice and unique plating style that makes the food very appetizing.<br><br>I would say this is one of the best japanese places in chicago!", "pics": null}}, {"review": {"des": "We are actually a regular customer here. My husband and I love this place for our lunch date since its not possible for us to have a proper date night <br><br>Anyways, back to the review. The place is amazing. Service is a hit and miss. If you get a nice server, she/he will check if you need anything else from time to time. If you get a not nice one, they will totally forget about you unless it's check time.<br><br>The food is definitely delicious. We always get like a couple rolls and one/two appetizers to share. So far, we like all the sushi (we tried all the special ones). For appetizers, we definitely recommend the beef tataki and the agedashi tofu. They are to die for!<br><br>Ambience is casual. Just don't come during rush time or you will have to wait. <br><br>Anyways, keep up the good work!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ds5bMLge1udfw2DE8mGNDQ/168s.jpg", "caption": "Omikase sashimi (we ate a couple pieces already!)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hfgtnbaXYiA4SYWv_1-Gcw/168s.jpg", "caption": "3 types of sushi rolls"}]}}, {"review": {"des": "Normally order the 10 piece omakase sushi but accidentally ordered the 10 piece sashimi omakase, while it's ok, I definitely recommend getting the sushi omakase instead.  The sushi omakase comes with 10 different fish while the sashimi omakase only came with 7 kinds and actually repeated the fish that are of lesser quality (the escolar, salmon, and one other fish I can't remember the name of).  Also the sashimi slices are smaller than sushi slices, don't come with rice, and the entree is $3 more expensive.  Overall a worse deal.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/e2CEdKQHbPb8gN11tutUiQ/348s.jpg", "caption": "Sushi omakase delivered.  This entree also comes w salad and miso soup"}]}}, {"review": {"des": "The spicy garlic ramen is so good that I keep coming back to Umai just for a bowl even though I have to drive 40min and spend another 20 finding a parking spot. When I have that bowl, all cost pays. Always cheer me up especially in a chilly winter. Not to mention the great manner of waitresses. Thanks, Umai.", "pics": null}}, {"review": {"des": "The Costco freezer isle dumplings were just what the doctor ordered and the same packaged frozen gyoza/potstickers you get at every restaurant like this nationwide really hit the spot. But the icing on the cake is what made me want to put this review on yelp for all of Chicago to see! 18 missed phone calls AFTER my food was delivered...... WHY?<br><br>Well I never answered or called them back, and here's the story of why. <br>Maybe finish finding a different place for delivery so you can have \"dinner and a show\" while reading this.<br><br>Honestly the food wasn't that bad. I actually might go back because the price point for the food you get is great and I'm only being harsh on my appetizers because of what happened. I am also just spoiled in the food world and acting that way when talking about my appetizers. <br><br>I ordered delivery through yelp late Sunday night and the ETA read up to 80 minutes. That's perfect because I wasn't going to be ready for a while for my dinner plans. They showed up within maybe 30-40 minutes and delivery guy seemed nice. He brought food to my apartment door and I gave him cash and cash tip for about a $45 dinner (before tipping). As I put the food on my counter and began getting ready to leave the apartment with my food, I got phone call and knock on my door from delivery guy saying it was actually paid for on the app but they didn't have tip included. Ok- cool. My card is on file and I make little errors like that more than I blink my eyes. I gave the kid a $10 cash tip and apologized to him if I made him take a longer trip than he was supposed to. I also greatly appreciated the honesty and this place might have been a new go-to spot for me, as I am new to the neighborhood. <br><br>I leave my phone at home (or occasionally in my boyfriends pocket when he's around) constantly because I lose things, break things, and simply don't need my phone to eat delivery food at a neighbors place. <br>*foreshadowing*<br>Any single human being that knows someone who knows a guy that knows me will tell you that, and I can be difficult to reach.<br><br>All of that being said, I went back to my apartment from my neighbors later that night. Let's call it 11pm-midnight. Went immediately to bed without brushing my teeth... sorry mom... and checked my phone to see nearly 20 missed calls. From the restaurant, I'm assuming the delivery driver, and then eventually... my apartment. First call was at 8:48, last call (I fucking hope) was at 9:40. <br>I understand that the 8 and 9 are close together on an iPhone keyboard, and you think I typed that wrong. No. They kept calling for 8 minutes shy of an hour and 2 phone calls short of 20. <br><br>My first thoughts went from \"who the hell is this\" to \"oh it's that place I ordered food from!\" Followed by \"Why did they need to call me after my transaction was done...\" and then \"why did they do that so many times and eventually have my apartment involved at 9:40pm on a Sunday?\"<br>By the way- no voicemails. I'll give benefit of the doubt that my voicemail is just full again. It typically is. That speaks to how little I'm on my phone. <br><br>After connecting some dots I'm wondering if he made a totally honest mistake about my bill of about $45 not being paid by card, and needed that cash back. Had I known this was something going on I would have put my slippers on, run downstairs, and paid the kid as I was clearly willing to do when I received my food. I never want to get a delivery guy in trouble for an honest mistake nor screw someone over like a business. <br><br>But the amount of persistent phone calls I received was not only UNPROFESSIONAL COMPLETELY, but a bit creepy and concerning. I had the apartment gatekeeper (amazing receptionists/security guards which I love about my community) let him into the elevator and directly to my front door, when my food was delivered. If they're going to act like THAT over a $45 - ish tab that wasn't paid, they know exactly where I live and how to get there.  Not that I realistically think the Umai mob is going to come after me. Regardless, this is now how I should be thinking or feeling after ordering food. <br><br>I wanted to call back this morning to see what's going on and if that's what actually happened, to settle it. But I won't. I don't think. I'm having a battle of morals at the moment. <br><br>They way I would have handled this, and feel anyone should, if they want a successful business? Maybe a 3 phone call spree MAX. No answer? That sucks for you. Take the $10 from delivery driver if you want to punish him for a mistake and put that towards your clearly horrific $45 loss. Now you're $35 or so in the hole and will have to rob a small family to make up for it. <br><br>Well folks that's the end of my tale. Again, I'm still determining the fate of my $45. And will honestly tell you the food and price point are worth checking out casually. But maybe have your delivery done in the alley way with a burn phone.", "pics": null}}, {"review": {"des": "Chicago Roll (5/5) - It's almost as if this roll is tailored for my tastes. Tuna, salmon, avocado, black tobiko, honey miso all garnished with this crunchy element that I'm not sure what it is but it's commonly used in sushi rolls. The honey miso wasn't too strong and overpowering, and the crunchy thing really rounded out the flavor and texture profile of the roll. You also get the fresh salmon and tuna. It does seem like there is a little too much going on and I wish it were prepared a big smaller so you don't have to take multiple bites to eat each piece, but it's a solid roll. Chicago Roll better than California Roll anyday (obviously).<br><br>White truffle tails (3.5/5) - Decent roll but it's a bit bland. The asparagus was a nice touch to add some texture to each roll. You do get a bit of the truffle taste but it's very subtle. This roll could use a bit more flavor but overall not bad", "pics": null}}, {"review": {"des": "Great place to try amazing ramen, and udon! I went here for a dinner with my friends, and we got greeted at the door and sat down pretty quick. The restaurant seems small but enough space for large groups of people and tables! I loved all the decorations and painting. <br>Their menu is pretty big and also great selection of drinks! I've had Gyoza for appetizers and these dumplings were so yummy! And also their delicious sushi rolls! One thing that I like about this place is you can order half or full amount of sushi rolls. In case you didn't want to eat too much! <br>I've also tried their Deeping Noodle Udon (honestly forgot the name of it) but it had the best ramen I've ever tried! At first I was very confused on how to eat this dish, since it came with two bowls, but then figured it out. Anyway, it was very delicious and had no flaws at all. I'd recommend this place to anyone to try!", "pics": null}}, {"review": {"des": "A delightful find! Really enjoyed our time here. <br><br>Located on a random average street, Umai looks unassuming from the outside but it's very trendy, clean, and surprisingly spacious inside. We went on a Saturday night with no reservation and waited for only 15 min, so not too bad. We actually meant to get deep dish pizza since we just got back from Japan the day before, but the line was too long there and that's how we ended up at Umai - obviously not with very high expectations because, well, we were eating Japanese food IN Japan less than 48 hours ago.<br><br>We were pleasantly surprised! The agedashi tofu appetizer has a surprisingly generous portion, and the light soy sauce broth, slightly glutinous layer and the silky tofu underneath is a delicious combination. The nabeyaki udon is sizable, and maintains a delicate balance of tastiness while being light and clean. The fish on the rolls we got were fresh and satisfying, and at reasonable price points! Experience-wise, the servers are quick and attentive even though the restaurant was full. The restaurant never got too loud and rowdy while we were there (a relief for 2 jet lagged travelers), and the music was always at an audible but bearable level (aka low enough to talk to the people you're eating without raising your voice). <br><br>It was a pleasant and enjoyable dining experience, would definitely recommend it!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_GLtMRlePMhm_TIuz-ud1w/348s.jpg", "caption": "Nabeyaki udon"}]}}, {"review": {"des": "Absolutely love Umai. Recently moved to this side of town and have been blown away. The service is TOP NOTCH. Natasha (hostess) is extremely sweet and Gam is an awesome server. I highly recommend the Spicy Tuna Ararre roll. The miso soup is also fantastic. <br><br>I have been back at least 4 times since i first discovered it about two weeks ago.", "pics": null}}, {"review": {"des": "Amazing dinner at this downtown gem. We sat at the bar and got to watch the chefs work their magic. <br><br>The spicy tuna is sooo flavorful! One of the best I've had. Wasn't a huge fan of the Goosebumps roll but it was still okay. The calamari presentation was beautiful but I didn't like the texture. <br><br>The salmon quality was on point. Mouth watering delicious. Definitely ordering more salmon next time!<br><br>Our waitress was a doll. Very friendly, attentive and knowledgeable. Recommended a great cold sake which complimented the food perfectly. We'll be back next time we're in town!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6PLMHbktJcyjX75mpLDKcg/168s.jpg", "caption": "Spicy tuna, Sloopee, Goosebumps, and Mexicana."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ff3TqR24koviozeVmSS4tw/168s.jpg", "caption": "Spicy edamame is delicious!"}]}}, {"review": {"des": "Was avoiding this spot for a while since I moved in the neighborhood, and I'm not sure why.  It was great!<br><br>They have some of the best Gyoza I've had in the city, very crisp and well packed.  Very flavorful.<br><br>We got the omakase, which was a ton of sushi.  All very high quality cuts, presented beautifully.<br><br>Sushi roll was also very nice, and a reasonably priced bottle of sake also helped.<br><br>Will be back!", "pics": null}}, {"review": {"des": "We were able to secure a table without reservations on a Saturday evening around 7:00pm, and I believe it was the last table for two.<br><br>The restaurant isn't too big or small and has various 2- to 4-seat tables. There is one long group table made for about 10 people. When you first walk into the restaurant, the host stand is situated on the left, sushi bar is in front of you, and dining area is to the right. It would be great to sit at the sushi bar where you get to interact with the sushi chefs. However, we got seated by the window. It's a trendy, moderately-dark atmosphere and is a great group spot or date spot in the evening.<br><br>We ordered the Hamachi Kama for our appetizer, which honestly looks like a bread/pastry upon first glance. After a good long look at it, I dug in and enjoyed it. It had a crispy skin and moist interior. It complemented the dipping sauce very well. For the entree, I ordered the Ton Katsu Ramen. It comes with wakame seaweed, corn, fish cake, half boiled egg, japanese leeks, mushroom, menma (bamboo), chashu (braised pork belly). I tried it with the black oil, which did enhance the flavor a bit. It's a good bowl of ramen, but I wouldn't say it's the best in Chicago. For dessert, we ordered the black sesame ice cream. I've come to love this type of ice cream, and it was decent here. The best one I've had is at Ramen-San. This one does have a similar taste to vanilla ice cream with a hint of sesame.<br><br>The service was good, and our server wasn't overbearing. We had our water cups refilled promptly.<br><br>This is one of those restaurants where you should try it at least once.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dN17DKODDoG51QXi22XqsA/168s.jpg", "caption": "Black sesame ice cream"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TRYQa_3MDQNEzDnXrcZuaA/168s.jpg", "caption": "Hamachi Kama"}]}}, {"review": {"des": "I was there few times and all the experience was great!<br>Good food and nice people..<br>If someone is looking for good ramen, i would suggest the winter ramen.", "pics": null}}, {"review": {"des": "Excellent trip to Umai. We always go to the Lincoln park location but wanted to try the downtown location. We had the Chicago and rainbow rolls as well as the chicken teriyaki. Both were fantastic. The chicken was marinated perfectly and not dry at all. We ordered extra rice which I highly suggest because you get a lot of chicken for only one bowl of rice. Both. Rolls were great too. We highly suggest this place if you are looking for some good sushi in Chicago. The atmosphere is really great as well. Can be a little noisy but not unbearable. A lot of windows so it makes the location feel very open. Check them out, you won't regret it.", "pics": null}}, {"review": {"des": "The bf and I was craving sushi so we decided at the last minute to stop in for din. It's been a while since we've gotten food here and I actually just noticed looking back on my previous review that we ended up ordering the same exact items, which I think is hilarious because they have such an extensive menu. But I guess we like what we like, right? Will have to make a mental note to myself to try something new the next time we're in.<br><br>Anyways, all the rolls hit the spot. We got the fresh philly, spicy tuna, unagi avo crunchy, and a half portion of the Chicago. And of course, we got the spicy roasted garlic pork ramen that everyone raves about. The broth was delicious, it had a nice strong garlic flavor and the noodles were perfectly cook. However, I didn't find it very spicy but it was still delicious. The waitress was kind enough to offer splitting the order into to separate bowls, which was greatly appreciated so we didn't have to awkwardly share a bowl of noodle between the two of us.<br><br>So if you're ever in the South Loop area, Umai gets the job done. Lots of options at a fair price. They deliver as well!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5fFyglOcA7mHwA7Mq8SPjg/168s.jpg", "caption": "Salmon nigiri"}]}}, {"review": {"des": "So visited Chicago last month and picked this place out on a whim, and great Yelp reviews , and as it turns out it was a place my friend had been wanting to go to but couldn't get in cuz it was too crowded. Ordered the beef teriyaki and it ended up being a little dry according to my friend...   a few rolls which were pretty good, but what really made the night was their Hamachi Kama. Been eating Hamachi Kama for a long time now and so I know what I like, and this one was REALLY  GOOD.  Very meaty, good portion, seasoned just right with a great ponzu dipping sauce. Price wasn't way over the top, and didn't wait too long cuz we made reservations (advisable)...  Although wish the tables were a bit bigger, barely had room for the food we ate but waitstaff was awesome.  All in all great place to check out.", "pics": null}}, {"review": {"des": "A bit pricey, but every dish was extraordinary and excellent. The sushi was precise and gentle, the curry dish was excellent and the green tea brûlée was one of the best I had.", "pics": null}}, {"review": {"des": "Had the ramen crave.  Umai = Ramen cure<br><br>I've only ever been here for the ramen, but they have a decent sized menu.  This time when I looked thru the menu, I was really attracted to the udon and the curry rice.  But...I had the kiddies in tow and they are voracious noodle eaters, and can't handle their spice yet, so I'd rather more options for them than satisfying my quest for curry.  <br><br>I made a reservation for 8 with two high chairs for 5pm.  The table was set already when we arrived - just be aware that they only have one high chair and one booster seat.  We didn't want to tie up their premier table in the middle of the restaurant, asked if we could have the end of the booth seating instead - which they accommodated easily.   They had sidewalk Al fresco dining area as well, but we opted for the a/c on a summer evening.  The staff was very friendly, helpful, and proactively addressed our queries.  <br><br>Once we sat, they pour out waters for us as it was a warm day. <br><br>I kind of wished I had a photo menu just to see some of the works of art that the kitchen kicks out, it is a Japanese restaurant...but to Yelp I go!  <br><br>We had the dipping ramen and the tonkatsu.  The noodles are different for each ramen that we ordered.  The dipping ramen was thicker, more typical and what I enjoy when eating ramen.  But the tonkatsu used a thinner noodle which was good in its own right, just a matter of my own preference of texture.  <br><br>The dipping ramen was served dry with all the toppings with a side of spicy soup (it was almost as spicy as kimchee ji-gae).  After tasting the broth compared to the tonkatsu, the spicy soup was saltier.  <br><br>I enjoyed the tonkatsu ramen.  The soft egg was luxurious.  Nicely soft cooked egg, I think it was marinated - as the outer white was a soft caramel colour.  I could just appreciate that.  Bamboo and woodear added some really good texture and crunch.  Make sure your tonkatsu has green onions, because that added a good amount of flavor.  The char-siu had good balance and nicely seasoned.  (It also garnered a second portion request or my picky eater).  <br><br>All together, a good experience.  I'll definitely need to try the Kare next time.  The staff is pleasant, the food has been consistent from when I last hopped in for ramen.  The space is lovely and spacious enough where you don't need to listen in on the next tables conversation.  It's the neighborhood Japanese restaurant.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yRrNDyaNEvoSwR60T7AodQ/348s.jpg", "caption": "Spicy Garlic Pork Ramen"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qfyvSuSL67iqLXkXgwKkvQ/168s.jpg", "caption": "Tonkatsu ramen"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Sq6WoXnh7y7bn1kano_IfA/168s.jpg", "caption": "Tonkatsu ramen"}]}}, {"review": {"des": "Umai has a pretty extensive menu with a variety of options from sushi, to ramen, or rice dishes. Don't overlook their hot/cold appetizers either - a couple people in our party were Umai regulars and ordered a great selection to start the meal off!<br><br>Agedashi Tofu - Tofu was crispy on the outside but super soft inside. The sauce was sweet and vinegar-y, but not overpowering. Mushrooms were a nice compliment to the tofu. <br><br>Hamachi Kama (not pictured, but highly recommended) - This is a yellowtail collar that is grilled to leave a very cripsy exterior/skin, but the interior is juicy with almost a gelatinous texture to it. Very yummy.<br><br>Kaki Fried (not pictured) -  The fried oysters here have a thicker breading in comparison to other restaurants I've ordered this dish from. Served with a plum sauce that was OK. I prefer this dish with spicy mayo.<br><br>Spicy Roasted Garlic Pork Ramen - Very generous portion! The broth had the strong garlic flavor we wanted but could've been spicier. The pork had a nice marbel of fat and meat and the noodles were perfectly cooked. <br><br>Mexicana Roll - Great roll! Umai has a perfect ratio of rice to fish (less rice, more fish), which I appreciated. Tune and salmon were very fresh! Can't go wrong with this roll!<br><br>Spicy Tuna - I really liked the spicy (sriracha and chili oil) blend that have with the tuna! Yum!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sYPM1mskAmn60awSxb_2LQ/348s.jpg", "caption": "Agedashi Tofu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/p1yZJv-ajx1fzjJKtEVx6Q/168s.jpg", "caption": "Spicy Roasted Garlic Pork Ramen"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7bNFd_0mpUt09DQM6ffKKA/168s.jpg", "caption": "Mexicana signature Maki"}]}}, {"review": {"des": "I love normal chicken wings, but I really love lollipop chicken wings because they are so much easier to eat! I was so happy to see them added to the menu of one of my favorite Japanese restaurants in Chicago! Can't wait to try their new location on Fullerton!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sSxdL9ZMdp9mC9laEI7-MQ/348s.jpg", "caption": "Lollipop Chicken Wings // Japanese fried chicken served with yuzu mayo"}]}}, {"review": {"des": "My plan was late night sushi on a cold night and ended up ordering their spicy roasted garlic pork ramen, which was the best! The savory flavors with the thin noodles with a little kick hit the spot! I also shared a small sushi roll which was  flavorful, I look forward to coming back to try more of their menu. <br>I have to mention their decor, including their ceramic dishes, are beautiful! I enjoyed looking around and picking up the details of the place, my favorite was the wall mural. I felt right at home in a comfy trendy atmosphere. The waitress and all of the staff was very attentive and welcoming. I have found a new little spot for ramen!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gXXuhBvHPF4nZWZZUFswxw/348s.jpg", "caption": "Spicy garlic Spicy Roasted Garlic Pork Ramen"}]}}, {"review": {"des": "Udon & Ramen are always a hit or miss in my opinion. Also, it never tastes good as takeout: we found this out the hard way! I have had my fare share of terrible ramen to say the least.  We decided to check out Umai since it is down the street from our new building, and we needed a quick lunch on moving day! We were in and out in 20 minutes, and the ramen was actually very good. It was seasoned well, and came out piping hot and there were so may different options to choose from. They even let you add ingredients to the bowl, for example, the one I wanted didn't have an egg so I added it. The left overs also traveled well, they separate out the noodles from the soup and pack them in different containers: this prevent the noodles  from absorbing all the liquid and becoming soggy. Defiantly going to be our favorite spot this winter, when you need warm ramen!", "pics": null}}, {"review": {"des": "This is my local sushi place. I'm glad it's here. It's really more like 3 1/2 stars, but I'm feeling generous. The food is consistently good. It's not the best I've had or anything, but it's reliable. I never leave feeling disappointed. That's something I appreciate. Their lunch special is a great value. Their portions are very good too. They are doing good business, therefore their sushi is fresh. Service is friendly and professional. I hope they will stay around for a long long time.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CPrO-lN4SfSe3rafaAys8A/348s.jpg", "caption": "Unagi Don"}]}}, {"review": {"des": "It's taken some time and I'm not sure what changed but I now really really like Umai. I order take out once a week to get my sushi fix and I am a complete fan. <br><br>My go to's are miso soup, spicy edamame, spicy tuna and a spicy scallop handroll. nom nom NOMS!!!<br><br>I usually walk over to pick it up and they are almost always packed. If you want to dine in on a weekend make sure you make a reservation.", "pics": null}}, {"review": {"des": "We used to come here regularly, and I sometimes held group dinners here, but the menu has become more unfriendly to vegetarians over the years. A real disappointment. The service was consistently good, however, and the ambiance is pretty nice (it's usually not too loud).", "pics": null}}, {"review": {"des": "Had a quick lunch with a friend to catch up. Very good sushi. It tasted fresh and clean. It looked very clean and the staff was helpful in giving us recommendation.", "pics": null}}, {"review": {"des": "Yummaaaaaayyyyyy<br><br>Noms:<br>- super tasty Ton Kotsu ramen. Noodles were cooked really well. The grilled pork was very flavorful. <br>- really large portions- my hubs and I shared one bowl and some sushi and were stuffed.<br>- generous sushi portions. <br>- nice atmosphere with lots of seating (but we came for a late lunch) <br>- soft boiled egg was magical <br><br>Boos:<br>- nothing really besides the sushi didn't taste super fresh (was a little tough in texture and rice was overcooked)<br><br>Would definitely come back!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/spP72pXXiNzFaEQuT0tjDg/348s.jpg", "caption": "Unagi sushi"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ajGXKx7eyR3EBz5iMtdEzA/168s.jpg", "caption": "Saba sushi"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IE-Yhdex3ZbRTXCHz3ofrQ/168s.jpg", "caption": "Ton Katsu Ramen split in two with a side of spicy pork ($2 for the extra pork)"}]}}, {"review": {"des": "Very good sushi and ramen.  Always a popular place, regardless of time of day.  Would highly recommend Umai to anyone visiting the South Loop!", "pics": null}}, {"review": {"des": "I have one word for this restaurant: wow!<br><br>Umai isn't a big place so I would recommend making reservations. Even with reservations we still had to wait 10-20 minutes. The interior was nice - I really liked the ambiance.<br><br>The menu has a good selection. My friend's ended up ordering ramen and I got the soba with sashimi. One of my friends who visits regularly also got some of the Uni Nigiri and says it's delicious! She gets it every time.<br><br>I was really impressed with my food - for $19 I got a generous portion of soba and they didn't skimp on the sashimi. The best part? The quality of the fish! I love sushi and sashimi and I have to say that the quality here is amazing. The fish is fresh and it melts in your mouth! No tough, chewy pieces here. The soba came with a little fresh seaweed and some tempura pieces; it was unique and gave the noodles a nice flavor and the tempura gave it texture which I really enjoyed. <br><br>The service here was great as well. I love restaurants where the server is around when you need them, but they don't interrupt your meal or the conversation too much. They were attentive in filling up our waters, and were good about splitting the bill by order.<br><br>Overall I was really impressed with Umai. I will be bringing friends back with me! Definitely give Umai a try fellow sushi lovers :)", "pics": null}}, {"review": {"des": "Umai is a traditional Japanese restaurant in the city that promises authentic Japanese flavors through a more American experience. Taste, service, and price all seemed pretty standard for me: delicious food but not something you can't find elsewhere, friendly servers, and prices on the more expensive side. We waited awhile for the food though, so be cautious if you're coming here on an empty stomach (might want to get an appetizer). I got the katsudon which was well cooked and well seasoned. Some other friends got ramen, udon, etc and everything tasted as it should. I wouldn't say umai offers unique Japanese food if that's what you're looking for, but it's definitely a nice place to dine in if you're okay with paying higher price ranges.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/apYtrBEvgdvYD5tckODsPg/348s.jpg", "caption": "Katsudon"}]}}, {"review": {"des": "Have ordered delivery from here 2-3 times for our team at work. <br><br>Food is good not fantastic. <br><br>Both times I have called the order in due to their online ordering system not opening until later. <br><br>After clearly stating my order, they asked me to repeat all of my selections multiple times each time I ordered over the phone. Once the food arrived there were errors in the order and different orders were grouped together in the same containers causing lots of confusion.", "pics": null}}, {"review": {"des": "I didn't really know what to expect from this sushi place beforehand. The menu was a little overwhelming to look at. Regardless, the sushi exceeded my expectations. I wouldn't say this was the best sushi I've ever had, but it wasn't terrible at all. Working at a sushi restaurant back home and eating a lot of sushi, you can really tell the grade and quality of the fish that is used. And let me say, the quality here does not go unnoticed. I was impressed! AND the prices are very reasonable! Okay onto the food...  we didn't try any maki (sushi rolls). We just tried a couple of carpaccio-like appetizers and the omakase sushi (nigiri), which BTW is so cheap! 10 pieces for $25!!! Plus the pieces are pretty big! They also gave us Japanese fish, not just the basic fish you would expect to get. Overall, I would probably come here again, and maybe try the ramen next time, which I've heard lots of good things about. Service was also exceptional, and our server was extremely nice and helpful.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/f90KvPT7pkp039qhAUXqvA/348s.jpg", "caption": "Omakase sushi: $25"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1Zcu_C8gvrhaWEVW5RJg2g/168s.jpg", "caption": "Seared salmon cappachio: $15"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/krCKW41tKYKzLPq2L9YFsw/168s.jpg", "caption": "Tako su (octopus): $9"}]}}, {"review": {"des": "Very good quality sushi. Although prices are a little higher than I'd like, the fact that it is across the street from where I live is very convenient if I ever have any sushi cravings. My friends ordered their entrees and seemed to like it a lot (katsu kare and ramen, I believe). I like that there are modern twists to the sushi here--very Asian-American fusion. Heads up--if you do not have a reservation and it is busy, you will have to wait for your whole party to arrive before you are seated.", "pics": null}}, {"review": {"des": "Fantastic local South Loop Ramen and Sushi spot. Came here on a Saturday night and got seated relatively quickly despite the restaurant being full. Sushi rolls are smaller than expected however the Ramen bowls are huge as expected. I got the spicy ground pork ramen and it was . Definitely would recommend", "pics": null}}, {"review": {"des": "Food tasted great, decent prices and friendly staff , recommend. Really enjoyed it. Hung out with my friend here loved it.", "pics": null}}, {"review": {"des": "Came to this restaurant because we passed by. It had nice outdoor sitting  and the food is delicious, along with good service.", "pics": null}}, {"review": {"des": "We live two blocks from Umai, so I've been a couple of times. The first time I visited, it was way too crowded and gave us little food for what we paid for.<br><br>I took my parents here a couple days ago, and the portions were a lot more generous than before. We came early, at around 5:15 PM, for dinner, so it wasn't too full and loud. The ambiance was perfect!<br><br>Since it was my dad's birthday and my own, we decided to order more than we usually would. The apps came out pretty quickly, but still felt a little lacking in terms of the cost-to-taste ratio. But the entrees were good. The tempura tastes a little on the oilier side, so just be aware of that. Service was great.", "pics": null}}, {"review": {"des": "First time in Chicago and searched up Japanese restaurants and found this gem . We arrived and were seated immediately. The staff is friendly and the food is so good and flavorful. I would definitely recommend anyone that likes raw sushi and ramen. Their green tea creme brûlée is awesome!", "pics": null}}, {"review": {"des": "Best sushi I've ever had. Friendly service. In addition to the sushi the tempura was fantastic as well as the mushroom chowder. Highly recommend!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SfvGBU3wg-3gvFc1gl40zA/168s.jpg", "caption": "Goosebumps Maki"}]}}, {"review": {"des": "Love that this restaurant is in my neighborhood. Food and service is fantastic, go here weekly. My \"go-to's\" are the chicago roll and mexicana...and love the spicy edamame! It can get pretty busy Thurs/Fri nights but they do take reservations and you can also order to-go.", "pics": null}}, {"review": {"des": "We go here at least twice a month, the food is excellent.  The ramen is in the top three best in the city, and my sushi eating husband declares the fish to be the freshest he's had.  It's not a frilly Japanese joint, but it's solid.  I recommend the tempura mushroom appetizer, the sloopin roll, the Katsu curry, and the beef asparagus rolls.  Great deal on the lunch special too.", "pics": null}}, {"review": {"des": "Came for the sukiyaki and we left with bellies full of winter ramen, Chicago rolls, and hot sake. Definitely worth the visit.<br><br>The sukiyaki ($18) looks HUGE but I do wish the hotpot was a little deeper, with a bit more broth and more tofu, but over all it was exactly what I was looking for. The perfect sweetness. The winter ramen has a fish based broth and was light yet savory. Not overall fishy at all. The Chicago roll was delicious, but we ate it so fast I can't actually give you a solid description... <br><br>The only downside to our visit was that we had a reservation and unfortunately had to wait and then sit at the bar. The hostess was apologetic and the view of the chefs making the delicious rolls was actually a treat.<br><br>Would definitely go back and maybe try more sushi options!", "pics": null}}, {"review": {"des": "Great sushi! I've never eaten at the restaurant but we've ordered delivery twice now. (They take about 45 min, pretty standard.)<br><br>Things we've tried:<br>Sushi platter - good assortment, all the fish was fresh, nothing too exciting<br>Spicy tuna roll - tasty but overwhelmingly spicy IMO because they use chili oil I believe... although I'm kind of a pansy.<br>Yellowtail roll - this one tasted ever-so-slightly off to me, or just not very flavorful.<br>Scallop nigiri - standard, good!<br><br>The miso soup is nice and light with plenty of seaweed, scallions, and tofu.<br>The salad is not traditional, i.e., there were tomatoes and green beans if I recall correctly, and the dressing was thicker than other places--but delicious! I liked the uniqueness.", "pics": null}}, {"review": {"des": "Ordered different things from different sections to try it out.  Yakitori (skewers), Ramen, Pork Katsu, Agedashi Tofu, Naked Roll, Drinks.  The most impressive was the relative freshness of the fish in the roll.  Next was the beef tongue skewers.  The tofu was fine as was the beer.  I've had better ramen in other cities (see other posts)-- I do not prefer the type of noodles used (similar to Shin-sen-gumi) and the spicy garlic miso broth lacked depth, although the chasu was pretty good.  Pork katsu (katsu kare on the menu) was nice and crispy but was sitting half in the curry which killed it, making breading soggy.  If you order it, ask for the curry on the side.", "pics": null}}, {"review": {"des": "I'm in Chicago for work and decided to wander in search of some sushi. Not only did I find delicious sushi I also had the best miso soup! It had such great flavor and the seaweed was actually visible and plentiful. After I was finished with my sushi I decided to order a seaweed salad because it looked so delicious... And it was. <br><br>The staff are super friendly and cover for each other if one of them is detained by providing good service to another customer. I sat at the sushi bar and it was comfortable and enjoyable even with all the hustle and bustle all around. <br><br>It appears there are good beverages for those who want to indulge. The decor is quite nice. And the bill was reasonable given the entire experience. I highly recommend trying it out.", "pics": null}}, {"review": {"des": "This was my second time here and it was very pleasant! First time we went during dinner and it was very packed we got udon noodles, edamame, Chicago sushi roll, and green tea creme brûlée. Everything was delicious and on point. Today we went for lunch and I got the lunch special sukiyaki. The portion was huge and the flavors were great! My friend thought her scallop roll was a little small for $8 but overall everything was delicious! Would definitely be back again!", "pics": null}}, {"review": {"des": "Came for an early dinner/late lunch. We ordered two omakase (chef's choice): one sushi and one sashimi. Each came with 10pieces + miso soup + salad. The salad was simple: one slice of tomato and mostly iceberg lettuce. Miso soup was nice and hot. The sushi was generous and well prepared - ten different types of fish with a small amount of rice and wasabi already added between fish and rice. The waitress asked if we had questions - I completely forgot what fish she told me we were having though haha. The sushi also included two pieces of tamago. The sashimi was 2 slices each of five different fishes, also thick, generous pieces.<br><br>As for the taste, the wasabi was not very spicy (not sure what this means but just has to use more wasabi than usual). Some of the fish types were a bit too fishy for me - had to drown in soy sauce to mask the fishiness. The tamago was extremely sweet and was cold. Besides those, the rest of the fish was very nice.<br><br>Overall it came to ~$60 (not including tax). In terms of portion I would give a 5 star but I'm giving a 4 star because of the taste.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/o9tj1s0UzUoKGYcG3Dmnpw/168s.jpg", "caption": "Two omakases: sushi and sashimi"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NO86wXM7kZcjsQuahaMb1Q/168s.jpg", "caption": "Miso and salad as part of the omakase"}]}}, {"review": {"des": "A must-go Japanese restaurant in Chicago, either for sushi/sashimi or casual dining like ramen or chicken don.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7ai58tO-eMEOdw7-Urqrkw/348s.jpg", "caption": "Amazing sushi!"}]}}, {"review": {"des": "Was visiting Chicago with my sister and we decided to eat some sushi, found this place on yelp and I ordered the 10 piece sushi omakase chefs selection, the fish was okay. The sushi quality was like a 3.5 star but the service was 5 star that's why I put the 4 star review. The server was super sweet, bubbly and accommodating!", "pics": null}}, {"review": {"des": "Umai offers a wide range of Japanese dishes and sushi. I got their tonkotsu ramen on a cold winter evening, and the soup warmed my soul. The broth was rich and flavorful, the chashu was tender and juicy, the noodles were cooked al dente, and the egg was boiled to perfection, not too runny and not fully cooked. This is a solid place for ramen, and I will definitely be back to try out their other dishes.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/o6Zf6YfQ640jqia9u7_TZg/348s.jpg", "caption": "Tonkotsu ramen"}]}}, {"review": {"des": "Okay, LET ME TELL YOU. When I walked in, immediately, the sugary chic interior design got my appetite going.<br><br>We tried Umai on a Wednesday night around 7, and thank goodness we made a reservation because the place was bustling! The service was top notch even though the restaurant was spilling with business. Relative to the sheer number of people resent, the piping hot meals arrived at rapid speed (and on charming plates too!)<br><br>Our table ordered the katsu kare, spicy roasted garlic pork ramen, and tuna roll. The katsu kare curry had a smoother/lighter texture and didn't feel too dense, which I personally enjoyed. The fried pork cutlet bursted in flavor at the perfect level of crispiness. <br><br>The ramen and sushi were also supposedly delicious! <br><br>Just a sidenote: the napkin quality was A+, and that's how you know a restaurant is on its game.<br><br>Tips: make a reservation! Try the katsu kare! Enjoy the interior design!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/AO6W1EpdgV9uzc8Vmdm7dQ/168s.jpg", "caption": "Spicy roasted garlic pork ramen"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dTAFN4ortrhtndtBKPPcLQ/168s.jpg", "caption": "Tuna roll"}]}}, {"review": {"des": "I came to Umai with a friend of mine and ordered the Winter Ramen. The ramen was a unique one. The noodles were thin and everything paired so well with the broth. My egg was slightly undercooked than I would have liked, but I'd rather have that than it being overcooked in my ramen. The service there is something to mention. We were seated immediately and my friend ordered a beer. The waiter brought out the wrong one and my friend was fine with it, but the waiter felt bad so he ended up giving my friend the one he actually ordered before we left! Great guy.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qUqWrTe0aImEYYCRFMrv7Q/348s.jpg", "caption": "Winter Ramen with Sliced Ribeye"}]}}, {"review": {"des": "Cute, modern, small restaurant. We got seated right away so we ordered some ramen soups because it was a wet cold day. The ton kotsu was really salty while the spicy garlic pork ramen was good. They were pricey.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kcT6Zv_7POS2GoSYov41Zw/168s.jpg", "caption": "Ton Kotsu Ramen, very salty"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rU2vganvuAdqTzZFocjkkg/168s.jpg", "caption": "Spicy Garlic Pork Ramen, good broth"}]}}, {"review": {"des": "Another Yelp Find.<br><br>tried the 7-piece  chef special combined with Spicy tuna roll, and ended the meal with their green tea creme brulee<br><br>Of all the 7 pieces  sushi I ate, the salmon roll melted in the mouth.soft like butter...<br>I must say though the highlight was the Spicy tuna roll. Whatever they put in the roll was just the right amount of Spice, and the taste together with tuna was Yumm.", "pics": null}}, {"review": {"des": "Wow. The sashimi and maki was all SO fresh. It would just melt in your mouth. Ambiance was perfect, and wait-staff was incredibly nice. It was the perfect start to a Friday evening which ended with a beautiful ballet! Can't wait to go back!<br><br>We had the Chicago and Mexicana maki rolls (so glad they offered half rolls!) and 4 types of sashimi", "pics": null}}, {"review": {"des": "This may be the best ramen I've ever had! Very kind service. Lots of natural light so we sat by the window and that was very nice", "pics": null}}, {"review": {"des": "Holy mother of all ramen.<br><br>After being on Yelp almost every day for the past 4 years, you learn a lot about people's foodie opinions. And one thing I've learned is people are extra picky when it comes to which ramen is \"authentic,\" \"real,\" or \"tastes how ramen should.\" Now, I've had ramen a few times, not counting instant packets at home, and have never been super impressed. Yeah, it's yummy and all the extra stuff they put in it is fun but nothing that makes me want to get it again...until now. What I'm trying to tell you is I get it. <br><br>Umai's ramen is amazing. I now know what \"great\" ramen tastes like. Full disclosure, I ordered the gyu don and ate a ton of my wife's winter ramen and friend's Spicy Roasted Garlic Pork ramen. The Gyu Don was fantastic but not as unique and flavorful as the ramens. My favorite was probably the Spicy Roasted Garlic Pork but they both were great. I was shocked you could get that much flavor in there. <br><br>Apart from the amazing food, the service and atmosphere was great. It's cozy but not crowded and that staff were helpful when ordering and friendly. I highly recommend checking out Umai if you're trying to find some awesome ramen.", "pics": null}}, {"review": {"des": "We ordered Half Goosebumps and half White Truffle Tails, Salmon teriyaki and Zaru Soba. They were all quite tasty especially my Soba noodle.  The one negative side for this place is you can only ask questions from your own waiter, I suppose.  My husband tried to waive another waitress to ask for a check and she immediately responded as \" I am not your waitress\". I thought that was a bit rude!  I also asked another waitress standing next to me if the egg goes into the sauce of the Soba noodle; she had this long face and pointed the to the sauce, \" in there\".<br>Other than that, everything was good.  We got our seats after 10 minutes as promised and waitress was very pleasant and polite. Her name is Saina.", "pics": null}}, {"review": {"des": "Not offensive, but not impressive either. Ambience is nice and service was on point, but the food was just average.<br><br>Ordered the spicy chicken wings, 1/2 Chicago roll, sweet potato tempura roll,<br>katsu with curry and rice. Wish the katsu had more fresh vegetables or something to counteract how heavy the curry and pork are. Pork was a little chewy and the whole dish was a bit under salted for me. <br><br>I would come back, but only if someone else suggested it.", "pics": null}}, {"review": {"des": "Such a good restaurant! Went here with my fiancée and her brother and they got sushi and I got the spicy pork ramen. It was incredible, and very close if not identical to what you'd have in Japan. Really enjoyed the ramen and dumplings!", "pics": null}}, {"review": {"des": "I went to dinner there last week on a Monday at the suggestion of my date.  We didn't have a reservation, but didn't have any problem being seated.  We started with their mushroom soup.  OK, if you love mushrooms, you have to have this soup.  It's almost like mushroom mousse.  Served hot in a small bowl, the soup has large slices of mushrooms in it, and it is not to be missed.  <br><br>Also had a salad, which was twice the size as what we expected, considering that we wanted a \"small salad\" which was well garnished with a variety of veggies.  <br><br>The appetizer we had was the Agedashi Tofu.  Tender, soft tofu in a veggie broth with an interesting coating on it.  Hard to pick up with chopsticks, but worth the difficulty.<br><br>We had a few very simple rolls.  Salmon, spicy tuna, etc.  They were ultra fresh and tasty.  Among the best tasting sushi that I've had in the city.  Going back again tonight.  Don't miss it.", "pics": null}}, {"review": {"des": "This place is one of the best authentic Japanese food restaurant in the states. I went there alone which was a terrible mistake since they had so many menus I that wanted to try out. Kat su don, sa ke don, advocado&salmon rolls, ramen...all my favorites...<br>I chose sa ke don which is a bowl of rice with fresh salmon on top along with a tb of wasabi, ginger and radish. It was actually as good as the one I tried in Japan! It would've been tastier if the rice was seasoned as they used plain white rice whereas the other sa ke dons I tried had seasoned rice. However the salmon was amazingly fresh and thick! And it was also aesthetically pleasing which I haven't expected at all. A little over priced but still worth it.", "pics": null}}, {"review": {"des": "This is very straightforward. Come here, get the winter ramen, and be happy. We enjoyed all the food we ordered (good quality sushi), but really just get the winter ramen.", "pics": null}}, {"review": {"des": "Unfortunately we didn't get to try the food at this 4-Star restaurant. We walked-in and were told it would be a 30 mins wait for two. After almost 50 mins, we still didn't get a table. A lot of people who walked in after us were seated. When I checked with the host, I was told that they have to attend the customers with reservations first, which I understand. However, I would appreciate it if she told us ahead of time that the wait time is longer than 30 minutes. She didn't even apologize for making us wait that long. So, beware of the wait time!", "pics": null}}, {"review": {"des": "Got th Gyu-Don and shared the Surf & Turf and the Chicago Roll.<br><br>The Gyu-Don had so much meat on it! I was so impressed. I'm glad that they seasoned the rice so it was just plain ol' rice. The Gyu-Don came with a side salad and udon. The udon was nice comforting side to the Gyu-don. The Chicago roll was meh and kinda underwhelming. But the Surf & Turf was amazing. The beef on top really put the entire roll together. Also, I loved that they put apple in the Surf & Turf. I would say apple is an underrated fruit that goes great in savory dishes.<br><br>I've gotten the ramen here and it's also amazing. My friends got the Witner Ramen and they could not stop raving about it. <br><br>I would recommend doing a reservation as it can get crowded during meal times.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8OSzaOqTlMFqYtZXhEi8VA/168s.jpg", "caption": "Guy-Don with a side of udon"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BilotIfJP-ABTmQahqanCA/168s.jpg", "caption": "Left: Surf & Turf. Right: The Chicago"}]}}, {"review": {"des": "The service is poor. Server took wrong orders who didn't even say sorry to us. Who also gave us attitude. Didn't refill water. I understand sometimes the customers is not always right. But in our case, the customers is right. Sorry, won't be back.", "pics": null}}, {"review": {"des": "We had the Raman and it was very flavorful.  Prices are pretty reasonable and service was great.", "pics": null}}, {"review": {"des": "Beautiful restaurant with tasty and generous portion of ramen on Clark Street. There's better Ramen outside downtown, but this one is satisfied our Ramen cravings for now", "pics": null}}, {"review": {"des": "Out of all the Japanese and Asian places in the Loop, this is my favorite. All the sashimis are extremely fresh (only sad they give you 2-3 pieces for $7-8) and this place was the first time I ever had sea urchin (you really must try it!!). <br>Been here a couple times now with the BF and tried several things: the spicy pork ramen, the dipping noodles, the katsukare, the unagi roll with spicy mayo, and the salmon skin roll. They are all....amazing. <br>The spicy pork ramen came in a HUGE bowl, enough to feed two people and was so saturated with umami it was almost too much for my senses to drink the soup straight. It was not spicy at all, however, but definitely was filled with flavor and ingredients - they definitely don't skimp here!<br>Dipping noodles were very meh, but that's probably because the soup you dipped it into was so strongly mushroomy. The katsukare ($12)... was amazing, and HUGE. Me and the BF had to share it since the plate literally covered up half the table. <br><br>Basically, I'm going to keep coming back here over and over until I've tried their whole menu. This place is definitely worth a try, and definitely bring a friend to eat with you! If you want to have a super filling meal, I'd suggest ordering maybe 2 rolls (the spicy mayo unagi roll was heavenly, and only $7) and the katsukare ($13.5 with an extra poached egg).<br><br>No qualms about the price - all the noodles and entrees average $12-18 and they can easily feed two people and then some.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Ay0takAoW_rXqK4QEBJw8w/348s.jpg", "caption": "Less than $20 for both of these.... Wat"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iEk9A3zV-q-g263dRDw-JA/168s.jpg", "caption": "So good!!"}]}}, {"review": {"des": "You know you came to the right place for your Asian food fixation when more than half of the patrons are of Asian heritage.<br><br>This place did not disappoint! I had the sushi which was fresh and excellent and my girlfriend had one of their entree dishes that she wouldn't stop raving about.<br><br>It's a little on the pricier side for some but well worth the money.<br><br>We made reservations an hour in advance on a Saturday evening (~7:30pm) and didn't have much trouble but the place was pretty full with a small wait for those that hadn't called ahead.<br><br>If you're in the loop or just south of it and hankering for some Japanese cuisine, definitely give this place a try. You won't regret it!", "pics": null}}, {"review": {"des": "If you can get in, this restaurant will impress. The authenticity, quality  and variety of Asian dishes will astound any discerning diner. Service is excellent with a staff willing to educate and guide you through the menu. <br>Try the sukiyaki, it's the best I've found in Chicago. Nabemono style and delicious. Order a side of sushi rice to help the flavors last. <br>Will satisfy two diners if on a budget.", "pics": null}}, {"review": {"des": "Wandered to the south loop location during a recent trip to Chicago. We chose Umai based on the pictures on Yelp. The photos made the atmosphere and food look fantastic. <br><br>We were able to call ahead and reserve a table which was a good thing since it appeared to be pretty busy for a Monday night. It is located right next to a crossfit gym and we noticed several people in workout clothes. Cool, laid-back, casual vibe. But way more fancy than a hole in the wall sushi bar.<br><br>I had a spicy tuna roll and the Chicago roll. Both were fantastic. I started with clear soup and it was average, tasty, and not tooooo hot. Nothing worse than burning your tongue before eating sushi.<br><br>Overall I loved the atmosphere. It was very cool. Cute date night spot with dimmed lighting and prices weren't bad at all!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xmORecdgEP0EzKcQ4tdrXw/348s.jpg", "caption": "Miao soup"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hhsJGYee9Z8MiPySALTCVw/168s.jpg", "caption": "Spicy tuna"}]}}]}