{"name": "umami-burger-wicker-park-chicago", "reviews": [{"review": {"des": "We love going to Umami for a drink or burgers on date night. Julie, the sweet bartender, is funny and attentive. We love the atmosphere and the quality of service here. <br><br>And the impossible burger with truffle oil? Get out. Too tasty!", "pics": null}}, {"review": {"des": "This one stings a little bit, having just moved to wicker park, I heard nothing but amazing things about how great Umami Burger is. Sadly, I must disagree.  While the fries were hot fresh and salty, I assumed the same to be true for the burger that I had heard nothing but great things about. <br><br>To be honest, I could make a better burger at home.  It was not hot, nor was the bun toasted.  The only saving grace was the great service as well as the fries.  I can think of 30+ ways that I'd rather spend $40.", "pics": null}}, {"review": {"des": "I had high hopes for Umami. When I walked in, the song playing was James Brown's \"I Feel Good\". I got into the funk right away. How cool would it be, I said to my wife, if they were playing a whole James Brown playlist? I didn't expect them to, since \"I Feel Good\" is his #1 hit and they might have just been playing #1 hits from various artists, but hey! They did play all James Brown! It was a stone groove throughout the hour we spent there.<br><br>And this being a burger joint in a hipster area, I worried about being relegated to two types of beer: super-hoppy local craft brews, or light beers from major breweries, with nothing in between. But they have Stella, which is OK, but also Dos Equis Amber, a big favorite of mine back in the 80s, so that was a pleasant surprise. I thoroughly enjoyed two of those.<br><br>Our waitperson was very nice and attentive, too. Some waitstaff will put on blinders as they walk the floor with a purpose toward the back without acknowledging anyone along the way. This lady acknowledged every wave I made. She was great.<br><br>Alas, things went kind of downhill from there. The problem was twofold.<br><br>(1) The food was far less than I hoped for the price. I had the $7 cheesy tots side, which I imagined would be tots with a cheese cover, but instead was a lukewarm sort of potato slurry in a fried potato casing topped with flakes of, I don't know, parm? (The aioli sauce that came with it was pretty solid.) And the $13 signature Umami burger was definitely suboptimal. People have complained here about slow service, which doesn't bother me if the food is great. To me, the longer the wait, the more the food had better be great. But the food came out also lukewarm, and dropped to room temperature before I was halfway through. How long was the plate sitting under an insufficiently warm warmer before making its way out to us? For both items, the first bites were decent, but halfway through each, every bite became a slog. I bailed on the tots, but I did finish the burger, which I felt I had to because, hey, it cost thirteen bucks! I did feel a bit of a very slightly nauseating greasy tummy thing for maybe an hour before it settled down, so at least it didn't come back up for seconds.<br><br>(2) It's noisier than I'd hoped. There's been a trend toward noisy restaurants the past few decades (<a href=\"/redir?url=https%3A%2F%2Fgoo.gl%2FW9aHm7&s=f511693c93ed4d28c4962bcedbddeafda93dd967e863280a1aa3d5c5753cab6a\" target=\"_blank\" rel=\"nofollow\">goo.gl/W9aHm7</a>), so I get that it's me and not them. It's still unpleasant to have to ask my quiet wife to repeat herself or speak up over the noise, and the place was only half-filled. Can't imagine how loud it is when it's jammed. But like every modern restaurant, there's no carpeting, no acoustic ceilings, and nothing on the walls to absorb the sound. I get that loud restaurants are more profitable because they lead people to order more food and, especially, drinks. So again, it's not you, it's me. I get that. That doesn't mean I have to like that. And I don't. <br><br>I can't see going back without some changes made. Since Umami is a chain, it might be a while.<br><br>Just to stress once more, the people working there are very pleasant and attentive.", "pics": null}}, {"review": {"des": "I ordered the manly burger with extra onion strings for delivery with fries. Based on the price I thought I would a quality burger with a nice amount of fries. Unfortunately thats not what I got. As you can clearly see the onion strings are beyond burnt! How was that acceptable to deliver based on the \"so called\" pictures you have under the manly burger. I barely received any fries, what burger places are cheap on the fries?!?. Needless to say...I won't be ordering from here ever again.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/L9FmJSU222yWvOK8cw3uow/168s.jpg", "caption": "Burnt Burnt and burnt!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lg3rXNWsGtaskQgA9v-7vw/168s.jpg", "caption": "This was all the fries I got!"}]}}, {"review": {"des": "My husband I stopped in here for a late lunch this past Saturday. We were seated immediately; there were only 4 other customers in the restaurant. Yet, after being seated, it took our server about 20 minutes to greet us. I actually had to go up to the hostess to ask where our sever was before she showed up. Very surprising since they weren't busy. <br><br>We proceeded to order the Umami, the Throwback, and a side of the cheesy potato tots and every bite was delicious! Food took another 20 minutes to come out but so worth it. And it's awesome they have vegan options. <br><br>Overall, food was great but the service will deter me from returning. If we were to go back, I would insist on carry out.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QjVrZpN-CIFvpxWxGJp9sQ/348s.jpg", "caption": "Umami Burger"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/s2qBvmKk05XLCbR1PyywbA/168s.jpg", "caption": "Cheesy tots with garlic aioli"}]}}, {"review": {"des": "This was my best friend and I's \"spot\". We've been going here for years and unfortunately, today we've concluded the quality has definitely gone down. It's still good. Very cool they added an \"impossible burger\" section. <br><br>It's just the little things. They put less effort in the presentation of the burgers. Before a meal assorted pickled vegetables would come complimentary. Our once favorite thing on the menu, the truffle fries with all the sauces, came as a disappointment today.  Prices have increased while quality has diminished.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CR5OuNO0YWXipmP5SsAQkg/168s.jpg", "caption": "12/2018"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VUrjfGuvj2fdz39xeYrAXg/168s.jpg", "caption": "2016"}]}}, {"review": {"des": "I feel like this place lost its' touch... this used to be my go-to burger joint, but the last few times I've been here, I can't even finish my food.<br><br>The patty lacks flavor and has been weirdly 'mushy' the last couple times I've visited. The service has not been on par either. The last time I visited, our server messed up my order (not that big of a deal..). We were also seated where we can see the kitchen, I watched our fries sit in the heat lamp for awhile until our server brought them to us, when I easily could have just served myself.<br><br>I hate to give negative feedback, but I used to love this place so much, so it is disappointing that the last 3 times or so, just hasn't been a good experience.", "pics": null}}, {"review": {"des": "I came here yesterday on a double date, and the food was okay. The cheesy tots were a great side for my Hatch Burger. The Hatch has peppers and garlic aioli on it, and it was pretty good, though next time I would get a spicier burger. I also really want to try the Ahi tuna.<br><br>My boyfriend got the Manly burger, which he loved and devoured. The four dipping sauces they gave us for the fries and tots were all delicious, especially the jalapeno sauce and the Diablo hot sauce.<br><br>Our service was very good, but we also came in on a Wednesday night around 8pm, so the place was dead. Because my boyfriend and I never came here before, we were informed that Umami means savory in Japanese... I am not a fan that their burgers are only normally cooked medium rare, so I got mine cooked medium. Mine still tasted a little raw, but it was okay.<br><br>As for beer, they have a few beers on tap, and my 312 tasted great. However, my friend ordered a Stella and it tasted awful. I dont know if it was bottom of the barrel or what, but our waiter was nice enough to let him have something else instead. The substitute was delicious. It was also annoying because it took us like twenty minutes to originally receive our beer.<br><br>The prices for the burgers are pretty high for being pretty small, they are just thick, and they don't come with anything on the side. It's like $14 for the burgers. Then, the cheesy tots were $6.5 for like 7 tots...<br><br>Overall, I would come here again, but I wouldn't fly back here soon. If I'm in the area again, I'll make my way back over there one day.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2H3UnhFAsaedYXnobDIaUA/168s.jpg", "caption": "Cheesy tots! Highly recommended"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GXtFuxgOZknbyiDnhm4ljA/168s.jpg", "caption": "Hatch burger!"}]}}, {"review": {"des": "This place is one of my favorites for burgers, cocktails, and all around service. Their fries are TO DIE for. <br><br>Let me just say that Dan, the bartender, is the man. After a bad experience at another bar that we left he was a breath of fresh air. He even made me my favorite cocktail with a little less sugar. <br><br>If you're looking for a fun place to have a delicious burger - this is a good bet. <br><br>Thanks Dan!", "pics": null}}, {"review": {"des": "This place is only OK for burgers. This review is only for the food and not in regards to the staff.<br><br>I came here for a nice little lunch on a Saturday and sat at the bar. I decided to get the Umami burger since I assumed that they would be great at making a burger they named their restaurant after, right? Wrong. They cook the burgers medium rare which I can tolerate, however, when I take a bite of only a fat raw piece of meat, it's not my favorite. I still ate it though because I'm disgusting. The burger was also topped with shiitake mushrooms that were as thick as the patty. Meh. I found myself dousing the burger in garlic aioli and spicy sauce to give it a little more pizazz.<br><br>I also paired my burger with the cheesy tots. These were DELCIOUS! I do wish they were fried a little longer because I had one that was almost raw. Tots should be crunchy but not like this...<br>Thankfully only one was that way.<br><br>I'll give them another try and update if it's any better.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FfrScCVl3maAwv4fRdRrbg/348s.jpg", "caption": "Umami burger cut in half"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Nj9bJLVoh7xt1738lqm7dw/168s.jpg", "caption": "Cheesy tots"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/z4zulOGQnAP24cGC9OVxgA/168s.jpg", "caption": "Umami burger"}]}}, {"review": {"des": "Upbeat place with craft burgers.<br><br>Burgers: If you ignore the price, these are some pretty good burgers. Mix the price into the picture, and I'm on the fence. I ordered the Turkey Burger. It was good. My favorite part was the butter lettuce on it. I am interested in trying the vegan Impossible Burger next time. My husband ordered the regular Impossible Burger. He said it was good, too. <br><br>Appetizers: Skip the cheesy tots. Our server talked them up, and they were... just cheesy tots. Good, but nothing special. The sauces were the highlight. Sides are a la carte. <br><br>Service: Honestly, the service made our experience here. If not for the impeccable personality that our server brought to the table, I'd rate this place a three star. As new customers, our server went above and beyond- explained the whole menu, gave personal and crowd favorites, and slipped in some samples of the dipping sauces to try. <br><br>If a restaurant displays out of this world customer service and average food, I believe in trying the restaurant out again. Would love to come back here during happy hour!", "pics": null}}, {"review": {"des": "Burgers are to die for <br>Little on the pricy side but I seriously thought they unlocked every taste buds in my tongue", "pics": null}}, {"review": {"des": "Throwing 5 stars at this place, but keep in mind, it's one visit.<br><br>I went on a Wednesday afternoon for lunch and sat at the bar to eat. Eric was a very helpful, attentive bartender. <br><br>I got a slider trio and a half fry. The sliders were all tasty. And so were the fries. Lots of cool burgers, so the trio will let you explore options.<br><br>Place seems to be a bit crazy about truffle oil. I don't care much for it, but if you dig truffles, you're in luck!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UWAa50gRXsJxLnOuRprzTA/348s.jpg", "caption": "First time here!"}]}}, {"review": {"des": "Been awhile since I've returned to Umami Burger and yikes, when did a single burger mean $15+tax?<br><br>No fries (extra $4)<br>No more fun dipping sauces.<br>No more turkey burgers.<br>(BTW - this was a huge disappointment for our table)<br><br>Their menu expanded to includes wings and poke bowls which seems strangely odd for a restaurant with the name \"Burger\" in it. <br><br>So, despite all that, it seems to me that with all the new \"fancy\" burger places to visit, it's no longer on my burger list for those reasons.  I enjoyed my meal and the cheese curd + tot combo was actually really satisfying. Food is good, but it's getting to be pricey and will have to reconsider other sit downs.", "pics": null}}, {"review": {"des": "Ugh. Disappointed in this place. Not only is it VERY expensive for what you get, it's really not good food either. I stopped in here with my boyfriend on a Saturday afternoon for lunch. They had a singer there performing, so that was nice, except pretty loud for the relatively empty restaurant. <br><br>Our waiter was extremely uninterested in us and answering our questions. I had heard of the impossible burger before and wanted to try it, so I asked if I could swap the impossible burger onto one of the other burger options and he looked at me like I was crazy. So I didn't do that, which was disappointing. I got the turkey burger and it was fine. Nothing exciting. <br><br>The burgers don't come with anything and they're super pricey right off the bat-- like $12-15 on its own. So we ordered truffle fries and BLEH. ALSO NOT GREAT! It's hard to screw up fries and truffle sauce...", "pics": null}}, {"review": {"des": "To start with, we had cheesy tots which was nice and crispy on the outside and soft and cheesy on the inside. It came with ketchup and aioli sauce that was just a little too clashing of a taste with the tots. Which I think says a lot about it if it's good on its own. <br><br>I then had the ahi tuna burger which was really good. I wish ir was somehow indicated that it was raw but otherwise still pretty good. My husband is vegetarian and really loved the impossible burger. Something I will have to try next time. <br><br>It is definitely on the higher range when it comes to price going into the double digits for main items. And the burger itself is not big nor does it come with sides and sides are around $7, more or less. But I think is worth it for trying something new and eating something good and healthy. <br><br>unfortunately, it took an hour for our food to be brought to us, the waiter was pretty upfront and apologetic with us as to the reason for the long delay. The manager also came to personally apologize and gave us some good discounts to help compensate for the wait. Which we didn't expect, the apology was sufficient but was greatly appreciated. Definitely a managerial action that I commend.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lw30dFIZ1CHG8UnRjNcjHQ/348s.jpg", "caption": "Cheesy Potato Tots"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6qsk1sGucCbnQtDuKB4Dsg/168s.jpg", "caption": "Ahi tuna burger"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/62vi4MSnTZP9KYeXyB9sZQ/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "Hello there, I ordered a burger(to go) well done and this is a consistent problem...my burger is very pink once again. Far from well done. I live far away so I couldn't just take it back. I tried to eat it because I thought is was just one part of the burgeI really would like a refund...UPDATE: they immediately gave me a refund and were really gracious and kind. I want to try them again because the food is good and high quality but they need to learn how to cook burgers well-done. For the past 3 years I've had this problem with them. I given them many chances to improve. I'm going to try again in a few weeks just to see if it improves.", "pics": null}}, {"review": {"des": "So i've wandered past here a few times and finally had an occasion to stop in.  Nice space, very modern, very open so you can enjoy the summer weather.  <br><br>Service-My service was pretty good, my waitress was generally great, albeit a wee bit inattentive.  <br><br>Food-yea...I was a tiny bit disappointed.  I got the sliders deal and ordered the chicken sandwich, the truffle burger and the manly.  Let's start with the best.  The manly burger was pretty good.  The bacon on it was divine.  The truffle burger was a bit overpowering.  The smell of the truffle oil in which everything was bathed in was just too much.  I like truffle oil and so I was a bit shocked by my reaction to the smell of it that evening, but i couldn't eat that one.  The Sam's Crispy Chicken was just okay.  It was fried a little too hard and there was more crust than chicken.  <br><br>I want to like this place so I might give it another go, but I'm not chomping at the bit.  We'll see. If anything I'll have a drink or two next time.", "pics": null}}, {"review": {"des": "So we had hoped our craving for a great burger would be met here & unfortunately this missed the mark. <br><br>The service was given with a nice smile but soooo painfully slow. <br><br>Our food was served lukewarm but why?? It wasn't crowded. There were plenty of wait staff. It wasn't crowded!<br><br>The burgers were ok. Maybe if they had been served hot we would have thought differently. Instead we strained for good things to say. Bottomline - Not worth the price.<br><br>For this price point it needs to be better. (And how about designing the room so real conversations can be had?!)", "pics": null}}, {"review": {"des": "Found out while dining here that Umami means savory. If you like savory food this is your place. If I could I would rank this place 4.5/5. Great service and bar tending.  Food was solid and savory. Highly recommend the cheesy tots with a side of one of their many sauces. I did the Truffle burger with egg on it. Very solid not over powering to the palate. Was looking for one extra ounce of taste to give this a 5 out 5. Food for sure lived up to its savory name. Great vibe and staff. Worth going back to for sure. <br><br>I would recommend this anyway over Small Cheval. Superior burger and experience.", "pics": null}}, {"review": {"des": "Upon sitting down at this restaurant for the first time, the waiter asked if I had been here before. Since I told him I had not, he gave a quick introduction of what Umami Burger is about and what makes them different. Things did get interesting though when I asked him for recommendations. I was curious about trying the Impossible Burgers, yet didn't expect the waiter to recommend them as primary choices and the regular beef-patty burgers as secondary choices. We'll see next time if the Impossible burgers are actually superior, but hopefully they weren't recommended first simply for being more expensive.<br><br>The Umami burger I ordered contained a good variety of umami-rich components, as opposed to being a regular burger with MSG added to it or something. However, I wish the roasted tomato slice wasn't so small that only a few bites contained it, and wish that the mushroom could be sliced thinner so that its texture and flavor wouldn't be so concentrated, perhaps even overpowering. But my main gripe is that the patty which was ordered medium ended up being too well done but also somewhat uneven.<br><br>After my visit, I actually ended up going to another burger joint afterwards to fill up my stomach. I'm still looking to give Umami Burger another visit, but for the quality and price I'd probably rather go to Kuma's.", "pics": null}}, {"review": {"des": "If it's your first time I would do the burger trio where you get 3 different burger sliders. I came here during the Wicker Park Fest and they had a live singer Makena Hartlin. She had a beautiful voice and she sung popular songs and originals. It definitely gave the place a mellow easy going vibe for a Sunday brunch. My favorite umami burger is the Manlu burger. Melted yummy gooey cheddar cheese with thick cut bacon pieces. My mouth is watering just thinking of it. I also tried the fried chicken salad that had a special tangy sauce, cabbage slaw and pickles and it was pretty good. I also had the truffle burger which is always yummy and a course with a side of the truffle", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Q9R4rVOyNFNCABLIdJKFbA/168s.jpg", "caption": "Manly burger"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NqB5JAzNerMyHUwpwIE07w/168s.jpg", "caption": "Rande's spicy margarita"}]}}, {"review": {"des": "I usually don't come to a restaurant without looking up reviews and the menu first. This was the exception as we were starving and needed to eat, stat. <br><br>Service was fine. The food, on the other hand, was a bit underwhelming. Price-wise, we were disappointed to find that the burgers ranged between $11-16, and did not include any side of some sort. So if you're like me and you enjoy a side of fries w/ your burger, you'd have to shell out an additional $2-7. For the price, the burgers weren't whopper-sized either, which would've justified the price. I had the Manly and my bf had the Umami. He thoroughly enjoyed his. Mine, although delicious, was nothing too memorable. I've had better burgers at fast-food joints if we're being honest. <br><br>Make sure to ask for all their dipping sauces. I think I enjoyed them more than the main attraction.", "pics": null}}, {"review": {"des": "Hard to rate Umami Burger higher then 3 stars.  While the burgers are very tasty, they run between $12 and $15.5 per burger, and come with a side of nothing.  And the burger isn't some massive burger.  Its very average sized, so if you don't get a salad or fries, you are going to need a second burger.  <br><br>Today I ordered their Caesar salad and it was tasteless.  Yes, Caesar salads aren't flavor bombs typically, but they have some taste.  This was just lettuce with a tiny bit of parm cheese mixed in, and a slice of bread toast on the side.  No thank you.<br><br>Way too expensive is what i'm getting at.  I would avoid eating here just for that reason.", "pics": null}}, {"review": {"des": "My trip to Umami on Wednesday night was definitely review worthy. The food was good, although a bit pricey for the quality. The kitchen seemed to be a bit backed up as many surrounding tables were also waiting for their food. But the highlight of our evening was our server TJ! He was warm and cheery, bringing a great vibe to the whole restaurant. He was attentive to our needs and made the wait time for our food enjoyable. You could tell he took pride in his work and treated all of his customers with the same level of enthusiasm. All in all, Umami leaves a bit to be desired in the culinary world, but their service makes up for it. Thanks TJ!!!!", "pics": null}}, {"review": {"des": "This was my first trip to Umami Burger. I came with a group of friends specifically for the \"Impossible Burger\"-- a heem-based burger \"that bleeds\" (sounds gross, but basically, it's supposed to replace meat). I am not a vegetarian or vegan. However, I am respect non-meat options and do hope that one day society does replace most if not all meat with plant-based options for both ethical environmental reasons. I was curious.<br><br>Umami Burger looks like I wish Hopewell Brewing did-- stark with clean lines but still warm and inviting. Maybe in homage to its name...Umami has several Japanese contemporary art murals scattered on the plywood covered (yes...literal plywood) walls. My husband was not into this look, but I thought it was very cool. It was a carefully considered \"undone\" look. The bar lighting was very stunning in contrast (or maybe in flow) with the wood. The whole \"look\" was casual but still artful. At the very least, it gives you some things to think about.<br><br>The bar service was excellent. I appreciated their lower priced Cazadores margaritas. The bartender (bearded guy) was fast and friendly with our group of 5. We then moved to a table!<br><br>I had the \"Impossible Burger\"- two Impossible patties, with sauce, cheese, and some other fixins. One of my friends is vegan. I was really really shocked that they didn't have any decent vegan options or solutions for the Impossible Burger. They have 1) no vegan bread, 2) no homemade vegan ketchup options (she was offered Heinz ketchup while the rest of us had the homemade sauces), 3) a host of other hidden animal products (butter on the bread, etc.) that ended up with her getting an impossible burger on some lettuce pieces. So...that was very weird to me. I hear Kuma's does actually make a \"vegan burger\" for those that are truly Vegan. That's the lone reason I am not giving Umami burger 5 stars. I hope this is something they will remedy in the future as right now it appears to be a bit of a bait and switch. :(<br><br>HOWEVER, the Impossible Burger was DELICIOUS. It truly tasted like meat. In fact, it is one of the better \"burgers\" I have had in Chicago. The \"meat\" was tender and tasted flavorful. I honestly wouldn't care if this was the only \"burger\" I ever had again. It was that fulfilling and satiating. Their sweet potato fries were also delightful. There was just a hint of brown sugar or cinnamon on them that made them really tasty.<br><br>Umami Burger was delightful, and I would go back. I hope they expand their menu options to accommodate vegans. Yes, yes I know they are a \"burger\" restaurant, but for a seemingly artful, hip restaurant, I would think they'd want to appear a little more post-modern and, on the capitalistic end of things, expand their customer base to include the diverse set of dietary restrictions within their radius. And also from a PR standpoint, it's probably a good thing to do.<br><br>I am a fan of your work, Umami Burger!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Nylc_iqnrexYvr4YR5vJnQ/348s.jpg", "caption": "Inside of the Impossible Burger."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5NWKEGHkPDP51NN-Z4w1YQ/168s.jpg", "caption": "Impossible (veg) burger: Amazing"}]}}, {"review": {"des": "Service was really slow and the new menu sucks... I've been a loyal umami fan for the better part of a decade and have introduced countless people to the chain and was devastated to find out the hatch burger and diablo sauce are no longer served", "pics": null}}, {"review": {"des": "On a night when not many restaurants were open on Christmas Eve and I was starving, Umami Burger saved the day by being open. Of course, it was almost empty inside with two other small groups. It's a decently-sized open space with a high ceiling, bar on the left, and dining area wrapping around the bar. They have one TV, which was playing the NFL game that night.<br><br>We ordered Umami Wings and Caramelized Brussel Sprouts for appetizers and Umami Burger for our entrée. The Umami Wings dish contains about 5-6 pieces that have a soy glaze and shichimi pepper mix. It tasted more sweet than salty and had a crispy texture. The Caramelized Brussel Sprouts dish contained bacon lardons, glazed carrots, roasted garlic and shallots, and truffle glaze. Both appetizers were good but a bit too greasy/oily for me. The Umami Burger entrée was succulent, especially ordered medium or medium rare. All three dishes made one pretty heavy meal. I enjoyed all of them, but they didn't blow me away.<br><br>The service was good, but I wonder if it would be the same level on a normal night.<br><br>I can't tell if it's because of the slushy snow outside, that they mopped the floor, or something spilled, but it was pretty slippery going to the restroom and being in the restroom. I almost slipped at one point. So much for my winter boots saving me!<br><br>I don't think I'd order the same dishes again, but I would come back to check out the other dishes.", "pics": null}}, {"review": {"des": "Such a disappointment!<br><br>Came here on a Thursday night for dinner and I've never experienced such a disaster of an operation in a restaurant! The restaurant was about half full so they really were not that busy.<br><br>It was our first time here so the waiter gave us a run-down of the menu and also pointed out several items that they were out of such as the calamari, brown sugar for the sweet potato fries (we planned on ordering the sweet potato fries but were advised not to as they \"suck\" without the brown sugar), and greens for the salad bowls (despite what the menu said all salad bowls would only be served with buttered lettuce). Not a big deal since we were here for burgers anyways...<br><br>The waiter highly recommended the tempura asparagus as a starter so we took his advice and placed an ordered along with two impossible burgers. And here is where things really start to go south...<br><br>It took an unusually long period of time to get our food. Each time our waiter stopped by our table he seemed confused that we had not received our food yet - one time he even told us that he \"yelled\" at the cooks. We watched many people that arrived after us receive their food. Finally, after about an hour we were told that \"our burgers had been cooked but the chef was not happy with them so they had to remake them.\" Ok, sure thing...<br><br>Finally after over an hour we receive our burgers and the waiter was also kind enough to offer a complimentary order of cheesy tots for the long wait. However, still no sign of the tempura asparagus that we ordered as an appetizer...we kindly asked the waiter if that was still coming and he said \"it should be.\" A few minutes later he arrived with the tempura asparagus. On the menu the dish is described as being served with a \"sweet chili sauce\" however we received some strange thick, lemony, white sauce that was most definitely not a sweet chili sauce and did not pair well with the dish at all. We questioned this and the waiter agreed that what we received was not right...and he also comped the tempura asparagus for us which was also very gracious.<br><br>A few other things worth mentioning - we watched multiple tables walk out before receiving their food (one table because after asking multiple times and 20+ minutes later they were still unable to receive any water). I myself was unable to get a single water refill during the course of almost 2 hours at the restaurant. Additionally, we were told that 3 cooks walked out on the job recently which is why there was such a delay...<br><br>All in all, the burger was decent but with SO many options Umami Burger is a hard pass. Slow and inattentive service, many missing menu items, and expensive burgers that do not come with fries.", "pics": null}}, {"review": {"des": "Been anticipating to try this joint for years now since they don't have this restaurant where I'm at and whenever I'm out of town where there is an umami burger, I just never get the chance to try it. I finally was able to try this place since I have a friend that used to work here, and she suggested me the impossible burger considering I'm a vegetarian. Let me tell you, that burger could have fooled me because it was IMPOSSIBLE to tell that is was actually meatless! It tasted exactly like the real thing! It was so worth the wait, and I'll definitely make the time to stop by another time when I'm in town again!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kApR-yIZkbUfgF_HHiWrCg/348s.jpg", "caption": "Impossible burger with a fried egg"}]}}, {"review": {"des": "Three of us walked in for a quick bite on a Saturday night, inquired about a booth and were told it woud be ready in a few minutes. We took a seat at the bar, in clear view of a clean empty booth. We were content, just inside the door that opened frequently, making for a breezy expereince. We left our coats and hats on. <br><br>Ten minutes in, no movement to a booth so we ordered food from the bartender. Within minutes, the booth we had been watching was suddenly available. We were told to settle up with the bartender for everything first, so we did. <br><br>Our three sandwiches (one burger, a grilled chicken, and a fried chicken) arrived 10 minutes later. Fries weren't there but our server said he'd bring them right out. As we attempted to keep our slick sandwiches on the buns, we ate. No fries, so we mentioned it to the hostess standing nearby. She walked to a server and told her something - we were hopeful it had to do with our fries. We soon finished eating. No fries. Finally, we told the bartender who had willingly taken our payment earlier, and got a refund for the fries. It really wasn't about the money - it was about their inability to deliver. We hastily bid them adieu, never to return.<br><br>In short, the food was average (and sweet!) and pricy, the wait staff was non-reactive, and the place was ICE COLD with a constant breeze when the door opened. On the upside, our table runner couldn't have been more attentive - perhaps he should be managing the place.", "pics": null}}, {"review": {"des": "There was a hair in my burger. Baked into the cheese. The manager was kind enough to apologize and take care of the bill, however the few bites I did have of the burger was grossly overcooked. It also took 30min to get said burger to which the manager explained that they were understaffed. I've been to this location 3 times and each time it seems they are understaffed and my experience has gone from fair to beyond frustrated. I will not be returning to this location as the sight of a wrinkly, black, thick hair baked into the cheese in burger has disgusted me to the point of no return.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PWFoRq4DA2bfadO9MRggOg/348s.jpg", "caption": "Yes, that is a hair baked into the cheese. I also asked for medium-rare on the rarer side."}]}}, {"review": {"des": "Super great food!! I highly recommend the sweet potato maple bacon fries! They are beyond amazing! Servers are super sweet and take out is quick and delicious!", "pics": null}}, {"review": {"des": "Get the truffle fries!!! They are so good! I also got the wider trio which is a great way to try out their burgers if you haven't had them. I got the hatch, truffle and chicken. My favorite was probably the truffle. My friends also loved the impossible burger which is a vegetarian option. It's very casual inside and a great spot to stop for a bite before you hit the bars.", "pics": null}}, {"review": {"des": "Don't get me wrong by the 3 stars, this place is good enough. The food was tasty, the waiter (Zayne) was fantastic and informative, I left with good memories, but I still didn't feel the pull of this place. The burgers and fries were not outrageously memorable. <br><br>But I really don't know what they're going for with their brand. The physical space and menu seemed like it wanted to be upscale, but it also has graffiti-ish art everywhere, and gives off some hipster vibes. <br><br>The food was very tasty, and the cocktails were impressive, but at $50 per person for 2 drinks, a burger, and some fries, I cannot say that I will be back. There are so many delicious burger places in Chicago (i.e.: Kumas), so this place did not provide enough of a  competitive edge, particularly for the price range. If I wanted to spend $50 on a meal and some drinks, I might look else where or spend a few more bucks and go somewhere truly upscale. <br><br>I'm a vegetarian(pesca), there was a falafel burger available, but I wasn't feeling chick-peas, so I had the Ahi Tuna. I liked it enough, but I can't remember why- which is a problem. I also had a side of the truffle fries, which were actually truffled cheese fries. Again, good enough, but lacking in that truffle flavor that truly pops. I could've done without the cheese too- just a nice truffle aioli/oil and some parsley on top would've been fine. Other people had the beef burgers and they liked it, but I heard nobody (in our group of 15) raving about how much they loved their food. The menu boasts a few vegan options- fries, onion rings, and pickles... <br><br>The drinks are what I really enjoyed most, and maybe I'd go back to Umami for a cocktail.<br>Definitely get the Greens cocktail- it is like a green juice with vodka, and very potent. Additionally, the Garden Party was very refreshing with rosemary, grapefruit, and gin.", "pics": null}}, {"review": {"des": "This is a good restaurant, though not my favorite restaurant, personally. I am still giving five stars for a number of reasons.<br>The waitress, Crystal, provided amazing service, and noticed right away with my order choice that I may have certain food allergens or preferences. I have quite a long list of them, and when I began to explain, she made sure to check with the manager and chef that anything I ordered (including dipping sauces) would be alright for my dietary preferences and restrictions. HUGE plus in my book. (Grain-free and dairy-free, btw.)<br>I wasn't ready for a meal when I went, so I got the house-made pickle plate, and a side of sweet potato fries. My boyfriend got the cali burger, medium-rare, and a side of their regular fries.<br>I was very pleased with the taste of everything I tried, and so was my boyfriend. They also provided 4 dipping sauces.<br>As far as the building itself goes, it is MUCH larger on the inside than I would have expected from looking at the entrance. There are some cool art pieces on the walls. It is pretty spacious (and felt spacious when we were there since we went at an in-between-meals hour and it was rather empty). The silverware was thick, and a bit heavier than most silverware -- I liked it. <br>The bathroom is very small, but clean.<br>All in all, the service impressed me the most. The food was certainly good, but that wouldn't be the main reason I would return. (After all, there are plenty of good and unique burger and fries options in Chicago.)<br>Big thanks to the staff for being so accommodating (without checking in TOO much).", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/f0Lp2-u2RWdzLp_avUBW7g/348s.jpg", "caption": "View of restaurant from the back looking towards the front/street side"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KJ9uzhhPpFHpHpd3P6G9Qw/168s.jpg", "caption": "Poor picture of menu (my bad)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mz0sGPAu7MgRF4_UN57zOA/168s.jpg", "caption": "Seating"}]}}, {"review": {"des": "If you are in need of a great delicious and filling burger, this is the best place to go. The burgers are a little fancier than just your classic American cheeseburger, but they each have a unique combination of flavors and ingredients. My personal favorites are the sunny side, the cali, or the manly. The burgers are best cooked medium rare, which leaves them juicy and full of flavor. The burgers don't come with fries so you have to order them on the side. I personally like the sweet potato fries the best. I have ordered the truffle fries, but if you don't eat them when they are still hot, the sauce they put on top gets a little gross.<br><br>The restaurant itself is super hip and relaxed. The service is great and they constantly check in and make sure you are enjoying your meal.<br><br>They also have some great happy hour specials, so look out for those!", "pics": null}}, {"review": {"des": "Umami Burger is obviously a staple in Wicker Park for meat eaters.  But now with their new \"Impossible Burger\"(their new vegetarian burger that tastes pretty much like a regular hamburger), it will be definitely frequented more by vegetarians.  Prior to the debut of their \"Impossible Burger\", I had never been to Umami Burger since I don't eat meat.  But I thought now is the time to try this place and I had only heard good things about it.  <br><br>The service was great between the hostess and server.  Water was plentiful and the server was very helpful with ordering and catering to our food needs: pescatarian, vegetarian, vegan, regular meat eater, etc..  We came there in a big group (about 10 of us) all excited to try this new vegetarian burger and they were so nice about splitting up the check, which made things a lot easier for us of course.<br><br>The decor is modern, sleek, and creative with colorful paintings on the wall.  It's always busy but it's not hectic and there's still space to walk around.  They also gave their kid coloring menus to us so we had a nice time coloring.<br><br>Now for the food...I love pickles and they serve you pickles on the table just to pick at.  I've never been to a restaurant that has done this before and I absolutely loved being able to pick at the pickles before getting the food.  They tasted fresh with a sweet aftertaste. <br><br> So now for the \"Impossible Burger\" - you can get it vegan, vegetarian, or the regular one has fish sauce in it.  It is made of wheat and potato protein, fat from coconut oil, and hemme (the ingredient that makes meat taste like meat).  It is also much more sustainable than cow burgers because methane isn't released into the air like it is when cows go through industrial factory farming.  So you can eat this guilt-free or close to guilt-free as possible!<br><br>The \"Impossible Burger\" consisted of: two burger patties, caramelized onions, American cheese, miso mustard, their house spread, dill pickles, lettuce, and tomato on two tasty buns.  It was absolutely scrumptious.  Having not had a hamburger in about 13 years, I kind of forgot what a hamburger tasted like and got used to veggie burgers made from black beans, oats, mushrooms, lentils, etc., but this tasted like how I remember a regular hamburger tasting.  The bread was toasted nicely, onions and cheese went really well with the regular hamburger flavor and I love the savory dill pickles.  I can't wait to try more variations of the \"Impossible Burger\".  I also appreciate that they have portobello mushroom burgers and ahi tuna burgers as options here too.<br><br>We also tried the thin fries, which were good with the truffle fondue, sea salt, and chives.  I would have liked if they had more truffle fondue sauce on there because there was just a bit on the top layer and there really wasn't a lot of it.  But since we paid extra for it, I would have liked to see more truffle fondue on there especially because truffle is a precious ingredient.  They also give you a bunch of dipping sauces which includes a truffle aioli option and a special ketchup (but be careful because it has fish sauce in it), that all paired seamlessly with the fries.<br><br>All in all, this was a great experience and I am so happy that there is a burger place that doesn't think of vegetarians as an afterthought.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/q2C3sGzgo5k1bx3W3ZIpgw/348s.jpg", "caption": "The new \"Impossible Burger\" description"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YSyBoIIdLWlbmIPHZXWCng/168s.jpg", "caption": "The \"Impossible Burger\" - meat and cruelty free!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zPvC1AGbfDakttKF7Nlbkw/168s.jpg", "caption": "The fries with the truffle fondue and chives"}]}}, {"review": {"des": "I've been here multiple times before but e and my friends came in just to grab a late bite to eat. I ordered the truffle burger and fries. My friends only ordered fries since they weren't that hungry. However, we watched our server talk to someone at the bar for 20 mins after asking him multiple times to refill our water. His reply for taking so long was he \"forgot\". We waited for more than 30 mins for ONE burger and fries. He just kept talking and talking to someone at the bar and finally came over by the kitchen (where we were sitting) to grab us our food and serve it. The burger was phenomenal as usual but the service was terrible.", "pics": null}}, {"review": {"des": "Warning****** you will rip your mouth.<br><br>Great burgers and even better fries. <br>I love how the restaurant looks so hip and fancy. <br>Burgers at Umami are high, not \"high\" but HIGH, tall. They are not big. They are stacked up high. I ripped my mouth trying to eat this at once. Their sauce is really delicious btw. I wanted to take their sauces home. Do they sell their sauce in bottles yet?? <br><br>Menu Recommendation:<br>1. MANLY burger<br>2. Umami burger <br>3. Truffle fries", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GA7Fh14LOW1GAdx4Muqf0w/348s.jpg", "caption": "Yum yum yum yum yum"}]}}, {"review": {"des": "Probably one of the best 3 burgers I've ever had in my life. I was worried that the hype of a place called \"umami\" would outweigh the actual food but my sliders were delicious (I couldn't decide on which burger to get so the slider flight was a good compromise for me). The sliders were juicy, well topped, and the buns were sweet and tasty. The truffle fries were tasty as well, worth ordering, and the array of sauces they bring for you are awesome as well! <br><br>Also as a former Brooklynite I loved Wicker Park-- reminded me a lot of Williamsburg. Super hip and busy area of town, even on the Thursday night we were here.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gBrTEgY41GGVMl0kH5rWUA/168s.jpg", "caption": "Slider trio"}]}}, {"review": {"des": "Checked out Umami Burger during Wicker Park Fest last month. They had a live singer near the entrance singing a range of pop songs from 90's till now. Everyone was friendly and the place was kid friendly too, not only providing crayons and coloring mats but they had a diaper changing station in the last bathroom which every staff member I encountered on the way there was nice to point out. <br><br>We took our server's recommendations to start with the Truffle Fries (yum) and the Crispy Brussel Sprouts (also yum). Their fries are skinny and crispy despite the generous slathering of cheesy truffle sauce. They definitely take umami flavor to the nth level and everything was really rich in flavor and maybe just a tad on the salty side. Hubby and I split the Manly burger. It was definitely hefty. The patty was thick but managed to remains fairly juicy. I loved the crispy onion straws on top. The umami was making me go o-mami ;)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pLV7xYndtmiZlKc-SmWHMQ/348s.jpg", "caption": "Truffle Fries, Crispy Brussel Sprouts, and the Manly Burger"}]}}, {"review": {"des": "God this was a disappointment. After raving about the location in Los Angeles, which I loved, this was a complete waste of money. The burger was overcooked the fries were overcooked the sides were overcooked, and it was probably the first order of the day. It should've been the best order of their day. It was horrible. It actually made me question my faith in everything that was good and proper and hopeful in the world, and I know it's crazy that a burger can do that but Umami Burger In Los Angeles was the kind of good that makes you believe in magic and this burger was so bad, it was comic book villain bad. Anyhow I need to call Lou Malnati's for pizza because this taste has to get washed out of my mouth immediately. God help us all.", "pics": null}}, {"review": {"des": "Umami Burger is great. Nice service and decent food. Should go 9pm-10pm they have a nice happy hour", "pics": null}}, {"review": {"des": "Great burgers ! Four of us stopped in for lunch yesterday was good food and good service. Very tasty!", "pics": null}}, {"review": {"des": "This review is for their vegan burger.  I had to stop eating it to call the restaurant to make sure they didn't send me a meat burger instead.  Admittedly I've never eaten meat, but I've never had a better veggie burger, much less vegan burger.  Wow!", "pics": null}}, {"review": {"des": "Extensive burger list and great sides! There's some pretty solid competition for the best burger in Chicago, and although I don't necessarily think this is at the top, it's certainly a contender for a solid burger option when you're not trying to wait in long lines to eat well!<br><br>We had the caramelized Brussels sprouts, great tots, and truffle fries and loved them all!  At our table we tried the sunny side up, the manly, the royale, and the impossible and we're pretty impressed by all! I personally had the royale and loved it, but it did get to be a bit rich by the end of the burger. <br><br>Their cocktails were also really delicious as well. I would highly recommend the blackberry swizzle and the velvet mule.", "pics": null}}, {"review": {"des": "Reminiscing Fukuburger over here!<br><br>Starving our butts off straight from Spring Awakening Music Festival, thankfully these guys were open until midnight.<br><br>Some places usually have horrible leftovers to sell to last minute customers. Fortunately, Umami Burger didn't disappoint! Both Umami and KBBQ burgers were cooked to a perfect medium rare, were full of rich flavor and came within 10 minutes. Our side of Sweet Potato Fries perfected the meal. Careful with the dipping sauce you get though. One of them is made with habanero peppers and thats usually as hot as I go.<br>Topped off our meals with some IPA's from their fully stocked bar and headed home. <br><br>More burger tasting to come. Until next time!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jHvyQ7ZTgxcg2UHb3s_07g/168s.jpg", "caption": "Dipping sauces"}]}}, {"review": {"des": "Stopped in for lunch here with a friend who lives in the area and has been to Umami before.<br><br>The inside is nice for a burger spot. Clean, simple and fairly spacious. They have a bar as well as booths and tables. The inside walls appear to be, upon closer inspection, pieces of plain plywood that somehow looks pretty good.<br><br>We kept it super simple and just ordered two burgers. Friend had the Truffle burger and I had the Cali burger. We both liked our burgers, they were good! Very juicy, a little greasy but the ingredients blended well together and the meat seemed to be of a higher quality than most burger places. Taste was good but comparatively speaking I can say there are a few other burgers I've had that were better than the Cali at Umami.  The other factors in my rating were the size and the price. The burgers are probably a little smaller than you'd expect, I could not guess the weight but typically when you pay $10+ for a burger it's big, these were a decent size but smaller than average for sure.. Also I was disappointed to see that fries were not included and were instead an extra $4+ side depending on which ones you get. <br><br>Our server was good, she was energetic and gave us an interesting explanation of the Umami sense, which the restaurant is named after.<br><br>Not a bad choice for burgers in Wicker Park!", "pics": null}}, {"review": {"des": "I went all in with the truffle burger and truffle fries, and was not disappointed. Rich and well-prepared. Excellent cocktails and service.<br><br>Casual atmosphere.", "pics": null}}, {"review": {"des": "Never given a single start but we showed up for our reservation, got seated at a booth with a very loud fan noise and then after the water came they told us that they didn't have buns - this is supposed to be a burger place, right? <br><br>The GM tried to make up for it by offering to comp us in the future. Hopefully, they will have buns then.", "pics": null}}, {"review": {"des": "Cute atmosphere with delicious burger combinations. I opted for the trio in order to try 3 different burgers becayse I couldn't decide on one specific burger. The trio was the perfect amount! Loved the manly slider which had thick chunks of deliciously smoked bacon lardons. I was nervous the peppers on the hatch slider would be too spicy but they were actually a but sweet and complimented the perfectly melted cheese!<br>Nice little spot for a quick bite and good, ground-daily beef!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/n3NZOcffAqRdm7EsCilcLw/348s.jpg", "caption": "Trio with half order of thin fries... Perfect for trying a variety of burgers!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bmKbIg3JjLW1M_Jbi5io4A/168s.jpg", "caption": "Bar area"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7JcKC8iN-b7fo_Fhl--R3g/168s.jpg", "caption": "Decor"}]}}, {"review": {"des": "I love this burger joint because I would eat there all the time in California. I order the umami burger with a turkey patty and got truffle fries (it was happy hour) and I have to say both were delicious. Parking was super easy to find as well.", "pics": null}}, {"review": {"des": "I was a little disappointed with my visit to Umami. I was really craving a good burger, and when I saw the Yelp reviews, decided to visit this restaurant. <br><br>Located in the heart of Milwaukee Ave, you can't beat the location. It was a beautiful evening when I visited, and the front of the restaurant was completely open to the fresh air and street views. It was nice for a pint at the bar, but the food left something to be desired.<br><br>I couldn't decide which burger to order, so I settled on the slider trio which came with miniature versions of the Manly, Truffle, and Hatch burgers. (no substitutions per the menu, unfortunately) I also ordered a half order of the skinny fries. The food came out in 15-20 minutes, but it was warm at best. The buns were soft, but the bun on the truffle slider was straight-up soggy. Glad I didn't order the big version, like I initially considered. The burger meat was tasty, but kind of crumbly and hard to eat without making a mess - again, this was particularly evident in the truffle slider. All of the burgers tasted fine, but I wished they were served a little hotter. The fries were in between warm and room temp. They were super delicious, just wish they were warmer. The star of the whole meal is the house made Umami ketchup. I wish I could buy a bottle.<br><br>Kudos to bartender Dan, who was super attentive and kind. Also, huge fan of the Purple Rain vinyl playing in the background.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OzafovHiDZ9CVlJuUTtF4w/348s.jpg", "caption": "slider trio : hatch , truffle, manly"}]}}, {"review": {"des": "What a great spot! Amazing gourmet burgers! We came here during the week and were lucky enough to come in during happy hour. Their happy hour offers different drink specials and appetizers at lower prices. We had wings, maple bacon fries, onion rings, and truffle fries as appetizers. The dipping sauces are incredible! I ordered a margarita and it was small but packed with punch! I had the sliders because I just couldn't decide what kind of burger I wanted so tried a few different ones. We got a slice of cheesecake for dessert and loved every bite of the dinner and dessert!", "pics": null}}, {"review": {"des": "We went to Umami for lunch and split a flight of burgers (hatch, manly, impossible and truffle), ahi tuna salad and fries. The impossible burger was phenomenal and after trying all 4, the impossible was probably our favorite one. The manly definitely took second place. It was a classic bacon burger with cheese and onion shoestrings. The hatch was not as spicy as expected but still great. The truffle burger was the least exciting in terms of flavor. The waiters were extremely knowledgeable on the menu and gave a cool backstory of Umami burger. <br><br>Overall, fantastic place for lunch or dinner!", "pics": null}}, {"review": {"des": "\"May I have some water?\" I asked. Her reply dryly, \"I always give water to customers\". <br>I asked for lemons, for my water three times. Each time I got an excuse starting with,  \"oh I'm gonna have to cut those, it's gonna take some time\". She eventually brought them at the end of the meal.", "pics": null}}, {"review": {"des": "Their impossible burger is INSANELY GOOD!!! So excited that they had 3 different variations of it! We got one of the jalapeño ones & one with the vegan fondue cheese & they were both to die for! We sat at the bar & the bartender was super nice & helpful - he went over the whole menu with us & was very friendly throughout our meal! The banana daiquiri & fries were also delicious!! Can't wait to come back!", "pics": null}}, {"review": {"des": "One of my favorite burger places in Chicago!<br><br>I've been here 3 times.  If I lived in Wicker Park, I would probably go every weekend...  <br><br>Their truffle burger is my favorite.  Definitely get it medium rare (house recommended).  Their ahi tuna burger (minus the wasabi) is my next favorite.  We have also tried their truffle fries, which is just as good.  <br><br>I'll be back to try the other things like the royale burger on the menu and their happy hour M-F 4-6pm and 9-10pm!", "pics": null}}, {"review": {"des": "Where do i begin...<br>As my SO and i were strolling the neighborhood of Wicker Park, casually finding a nice place to eat for dinner. We came across this burger place, looked up reviews and said were great. <br>Turns out our visit wasn't so great...<br>It took 15 min for our waiter to acknowledge us after being seated. Once we finally ordered our food we waited a whole hour till we finally received it. The waiter informed 45 min in that wait time, that the chefs had pushed back our order to prioritize the online orders.<br>The food was okay, the burgers were cooled off already and fries weren't fresh. Portions are too small for the prices. <br>Most likely wont be going back until they fix themselves.", "pics": null}}, {"review": {"des": "Was looking for a burger, they had unique offerings. The service was good and took care of us, especially when we asked for our burgers medium and they weren't cooked. They took it off so that was nice. The thin fries were very crunchy and yummy though.", "pics": null}}, {"review": {"des": "Swung by with a few friends & got the umami burger with a side of sweet potato fries. Absolutely delicious. They're really generous with the sauce so your bun gets soggy quick. I'd probably ask for the sauce on the side next time. Overall, fast service & delicious food.", "pics": null}}, {"review": {"des": "I first discovered Umami Burger on the West Coast and have been an ardent fan ever since. Fancy burgers with decadent sides that give the main act a run for their money, all housed in a super sleek setting - what's not to love?<br><br>The Wicker Park location is especially pretty, with a beautiful bar that beckons to order a cocktail with your eats. So I did.<br><br>I always order the same burger, which has yet to disappoint: the Hatch burger is topped with roasted hatch chilies, house Cali cheese, and roasted garlic aioli. The aioli is so good, you'll find yourself dipping the last of your burger's lettuce in it. <br><br>My only feedback? Get some gluten-free buns. The burgers are so saucy (in a good way) and there's no possible way to devour one wrapped in a makeshift lettuce \"bun\". I recommend Canyon Bakehouse's hamburger buns, they're fantastic.", "pics": null}}, {"review": {"des": "Nice looking place. Bought two \"Impossible Burgers\", nothing else.   Burgers were fantastic. Hard to believe they are vegetarian.   Well prepared, and one was a full meal. (Actually two patties come on one roll).  The roll used is a poor choice.    Falls apart.   The cost is outrageous!!!  $35.00 before tip.<br>If the price was reasonable,  five stars.  But for 35<br>bucks, I can only give three.", "pics": null}}, {"review": {"des": "So disappointed in Umami Burger! I've been going for years, starting back when they only had a few locations in LA. I stopped in tonight for the first time in a couple months to have a burger and take advantage of their excellent happy hour specials - $3 truffle fries, $4 drafts, and $5 glasses of wine. <br><br>I was excited to see they had a special Frenchie burger that had pork belly, raclette, tomato, and arugula I think. Pricier than their other offerings at $18 with no sides, but I love all of those things, so let's do it. <br><br>The burger arrived and looked fantastic but with just one bite I was so disappointed. The pork belly was awful (words I never thought I'd say!) and totally overpowering, I couldn't taste anything else. I took a closer look at my burger- the pork was pinker than the beef patty (too pink?), which I had ordered medium rare. The awesome bartender Dan quickly got me a second one that was supposed to be medium rare and looked a little better but again after one bite, I couldn't taste anything but bad pork. Another weird thing was that the second burger (but not the first) had a layer of lettuce and tomato both above and below the meat, like someone was assembling it and couldn't remember if they had already put the lettuce and tomato on it. I don't know what was going on in the kitchen- the truffle fries were also way overcooked but I like crispy fries so I kept them, although these were borderline burnt. There was also a huge glob of truffle cheese on the side of the bowl, like someone used the rim to wipe the excess off a knife or a spoon. It was all just really odd. <br><br>I finally opted for a regular jalapeño/hatch burger which I've had multiple times before and thought would be reliable... I received yet another well done burger that tasted really off. I attempted a few bites just to not be \"that\" diner, but the burger wasn't even tolerable and definitely not worth the calories. I asked if there was a new chef or change in the suppliers- I guess they've switched to vegan buns for all their burgers (influence of the impossible burger?) and there's been a change in back of the house staff. What a huge bummer, I'll be mourning the loss of Umami's awesome, flavorful burgers.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OutuAIgP3kJm2QibURuWQw/348s.jpg", "caption": "Looks delicious... but looks can be deceiving!"}]}}, {"review": {"des": "I have conflicted opinions about the food here, although I'd say the experience overall was decent. I tried the Umami Burger, K-BBQ Burger, and thin fries. <br><br>What I love:<br>- Patties are juicy and very fresh. Get your burger medium rare for the perfect ratio of tender to cooked. I love that the edges are so slightly burned and crunchy. <br>- The cheese is fried to crispy. Unlike the classic, melted cheese on a burger, the ones here are almost like a cheese brittle. <br>- BEST KETCHUP EVER. Get the fries just so you can try the ketchup. Their ketchup is made fresh in the house, and I swear there is some garlic in the condiment that gives it a special ~umami~ flavor. I even got a sauce cup with their ketchup to-go because its just so freaking delicious. <br><br>What I didn't love:<br>- The buns. They have an oddly sweet taste to them, and the texture is almost like store-bought buns, soft in a not-so-fresh way. <br>- The KBBQ Burger's kimchi and condiments are too sour, overpowering the taste of the patty. <br>- The food was honestly not worth the price. If I'm paying $13-$14 for a burger, it better be a quality, all-rounded burger. While burgers here definitely have their strengths, they are not enough to offset the weaknesses. The size of a burger isn't that big either. My total bill was around $20 (with tip) which was a little pricey for one burger and splitting a side of fries. This is the main reason why I changed my mind from giving a 4 star to a 3 star review.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4jVAsxu6-rrKciiShg0bJg/168s.jpg", "caption": "K-BBQ burger"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dtva0h2IV9ZlKPvM9Oa1RA/168s.jpg", "caption": "Thin fries + best ketchup ever"}]}}, {"review": {"des": "We have a Umami Burger in California, but we were shopping near here and just wanted to go someone close by so we chose this place. <br><br>We were seated right away when we came here since it wasn't that busy and we had an ample amount of time to look at the menu. Since I've eaten about 2 burgers already that week, I opted for their seared tuna salad while my boyfriend got one of their burgers. And I added a side of fries, too, because... fries.<br><br>I don't remember our server's name, but I did have an issue with service just because they were quick to give my boyfriend his alcoholic drink, yet not quick enough to just give me a glass of water. And when our food came, they ended up giving me a tuna burger because the server thought that was what I had ordered. Okay, no problem. Easy fix. At least they got the fries right. So we did enjoy the food and eventually I got my tuna salad and I ended up finishing it all. Who knew a salad could be so enjoyable with tuna slices? Damn. I know what I'll get from now on. <br><br>So then came the bill and here is where I have to smack my boyfriend on the head because he was about to pay without even looking at the bill. I get paranoid so I ended up looking at the bill and realized that the server actually charged us for the tuna burger even though we sent it back so we ended up having to flag her down and getting a new receipt. It wasn't a hassle to get that fixed nor did she seem annoyed about it, but just make sure to double check your receipt if you had issues throughout your meal. My boyfriend also learned to look at receipts more clearly that day so yay for that.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/oYvzyHCDUp3fwNYgyabGKw/348s.jpg", "caption": "Seared Ahi salad"}]}}, {"review": {"des": "Food is amazing! I finished my burger before realizing I didn't take a picture. Service is great also. It's a bit cold in here but other than that, definitely stop by! Never ever heard of this place before walking by. I'm sad I didn't come here sooner!", "pics": null}}, {"review": {"des": "MMMMMM! One of my favorite places to get a burger in the city. I like bringing friends visiting from out of town here because it's easy to get to from the train, and we can explore Wicker Park a bit. Love the sweet potato fries. The ketchup is definitely unique without being too much. If you're going, expect to pay about $25 for a burger w/ fries. Yes, a little steep, but SO filling...and so yummy.", "pics": null}}, {"review": {"des": "Great food and ambience, but portions were small and it's hard to find parking. Decent selection, they have more than just beef burgers.<br><br>Service:<br>We came on a Sunday night and the place was pretty empty, got seated right away. Our server was awesome to us and very helpful.<br><br>Food:<br>-thin fries with housemade ketchup. Normal fries but AMAZING ketchup. I was raving about it for days. Garlicky, sweet, flavorful... I'll never look at Heinz the same way again. The server was so sweet, she gave me a to-go container to take home. Ha! It really was amazing.<br>-Umami burger: the one that started it all. I thought it was simple enough to let the flavors sing. Easy to eat and oh so juicy. You have to get it medium rare. The bun was just meh to me, but the whole package was so delicious. I definitely could have eaten two of them, plus the fries, though.<br>-K-BBQ Burger: it had similar flavors to K-BBQ but it was so so salty. Maybe it was all the toppings, or the sauce, but even though it was delicious, I couldn't eat it without wishing I were eating another half of an Umami burger.<br><br>Overall, I'd come back again and order two Umami Burgers, fries, and extra ketchup", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_qQOVU6yPVcxJj0qzx6gVw/168s.jpg", "caption": "K-BBQ burger in front, Umami burger and thin fries behind"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tr240LlwXw8UfUCFk4XCOQ/168s.jpg", "caption": "Cool paint decs on plywood walls"}]}}, {"review": {"des": "I had the Manly burger - it was cooked to perfection and the various flavors combined with the soft bun to make it a delicious burger you won't want to miss. We decided to be a bit adventurous and tried the Maple Bacon French Fries. Great decision! The fries were crispy despite the coating of maple and we could not stop eating them. I would say the burger was a bit smaller than expected but that will not stop me from visiting again. Can't wait to go back and try the other burgers.", "pics": null}}, {"review": {"des": "Had a great time trying the impossible burger here! Sat at the bar and the bartender Dan was kind and knowledgeable. I got the vegan truffle impossible burger and it was amazing! I haven't eaten meat for about 15 years, and it's definitely freaky how much it resembles meat. My only complaint is that, even tho it was a truffle burger, it still came with mustard and pickles and what not, which I feel like threw the flavors off a bit. I wish they would say on their menu exactly what comes on each burger. But I would definitely be back to try it again!", "pics": null}}, {"review": {"des": "Umami's got chill vibes and cool art on the walls. I love their ahí tuna sandwich (I'm a pescatarian). It is so flavorful! Keep in mind that Umami burgers do not come with sides, so you gotta be sure to order your fries.", "pics": null}}, {"review": {"des": "As I sit here in this restaurant am very brought back the staff doesn't seem to be very happy to be here or maybe there understaffed not sure what there situation is I haven't gotten my meal yet so I don't know what to expect... I have gotten one appetizer the spicy edamame it is not so pleasant it is so oily like they cooked it in the same oil as the fries or right next to the burgers. I will update you on my burger and fries...  So 10-15 min and I finally get my burger but no fries it seems that there was a hiccup in the kitchen and said it would take some more time but it wait. So I got the Cali burger with Pulled Pork or ribs something like that it's a very savory burger the fries finally showed up and there great as well... that is all for this review am gonna enjoy my meal <br><br>Ps: I still haven't gotten a refill (Mountain Dew)", "pics": null}}, {"review": {"des": "My first time here. I tried their take on the impossible burger, made from 100% plant protein. It was soft, juicy but also a little soggy. Two patties was too much but it was good nonetheless. <br><br>I wish it came with fries.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7Dxu9c7jM56irwnR1zW5HA/168s.jpg", "caption": "The impossible burger made from  plant protein to imitate beef"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/l6jQT8pRZTSwTpq7sxyQTQ/168s.jpg", "caption": "Martini"}]}}, {"review": {"des": "Had the impossible ooh mami burger. I liked it! Great vegetarian burger. Our server Alex was very nice and helpful. She walked us through the menu and explained different items and options. I think these were the best tater tots I've ever had. Ended it with a key lime pie (menu states they're from Bang Bang Pie), one of the best pies I've ever had. I'm definitely coming back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/t7yEvmGUxvXhsdRPsn69_Q/168s.jpg", "caption": "Impossible burger (ooh mami)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ci59wPI8ExLtWzAt3Se5VQ/168s.jpg", "caption": "Tater tots"}]}}, {"review": {"des": "My husband and I came here for the first time last night after reading rave reviews. This place definitely lived up to the hype. The burgers were delicious, the service was amazing (we had the best waiter, so nice and fun!), and the atmosphere was great. I'm not even the biggest burger fan but this place might change that. It's a little pricey but well worth the money. We will definitely be back!", "pics": null}}, {"review": {"des": "I don't care for burgers, but I go out of my way for Umami. If you're new, I recommend the Truffle Burger-- I'm honestly salivating right now thinking about a BURGER, it's juicy, super flavorful, the bun is nice and fluffy (think Hawaiian Roll) with that iconic \"U\" stamp to seal the deal. <br><br>I did notice that this location is more consistent on burger and fry quality then the West Loop location.", "pics": null}}, {"review": {"des": "Big dog burgers. Little dog fries. Brussel sprouts were on point. They definitely hooked it up. But no Gatorade, don't get your hopes up", "pics": null}}, {"review": {"des": "Went in with my partner and we got two impossible burgers, which are a go to for vegans in a place like this. They were both cooked,sure, but still cold in the center and so undercooked that they both virtually disintegrated as we ate them... pure mush. I also ordered a beer, a beer I've had in the past, and this time around it tasted metallic in a way it definitely shouldn't have and I'm pretty sure was expired. They were out of a few things we had asked for, which is fine, but frustratingly no one seemed to know what was going on and on top of it all the service was very slow. For two mushy, undercooked burgers, one side of sweet potato fries to split, and a single expired beer we were out $50 dollars and pretty bummed about it.", "pics": null}}, {"review": {"des": "Good burgers and sides but the portions are small relative to price.  I recommend splitting a few different burgers amongst friends.  Have ordered delivery several times and it's always been well prepared. Try this place a few times but don't make it your go to.", "pics": null}}, {"review": {"des": "Good burgers and fries. I got the vegan version of the impossible burger and it was really good! Maybe not good for vegans who like the bun (it's a lettuce wrap) or vegans who don't really like meat consistency, but it was delicious for me.<br>I like the added touch of giving complementary avocado for vegans too", "pics": null}}, {"review": {"des": "The burgers here are kind of pricey but they're SO worth it. Perfectly tender patties with amazing toppings and tasty cocktails to pair. Burgers don't come with fries which is a bit of a bummer because they're $14 each. However, sweet potato fries with their garlic aioli are definitely worth the extra 5 bucks.<br><br>I mostly came here to rave about the greens6. It's a cocktail with titos, green tea, pineapple, cilantro, lime & cucumber. They're dangerously good-- think green juice with booze hidden underneath the health. Happy hour is M-F 4?-6 and 9-10 so pop in during then and get one for only $7 instead of $11!", "pics": null}}, {"review": {"des": "It was my first time having a bad version of the Impossible burger. I wanted it to be good because this restaurant is so close to my home. But it was undercooked, it tasted mushy and rubbery. I ordered it without a bun, opting instead or have it with lettuce. Usually when a place offers lettuce instead of a bun, they give you two big stalks of Romaine so that you can eat the sandwich like a wrap. Instead I got two tiny pieces of lettuce that looked like the amount I would have gotten if I'd just ordered it with a bun. As if paying $13 for a burger that doesn't come with fries isn't bad enough, the side of sweet potato fries that I got was soooo small. I spent $18 just to end up hungry and dissatisfied.", "pics": null}}, {"review": {"des": "I cannot believe it took me so long to get here. I will definitely be back!<br><br>A friend and I tour burger places around Chicago, and Umami was next on our list. I didn't know what to expect but received deliciousness. <br><br>Umami, aka savory, is one of the five tastes, and all of Umami Burger's food play to that taste. I'm more a sweet than savory person, so without knowing what to expect, I just dove in.<br><br>My friend and I shared the Truffle Fries (which were VERY good). Better than DMK's fries for sure. Didn't look like a lot, but was full of flavor throughout the fries, didn't lose the taste at all as you dig to the bottom.<br><br>For our mains, I got the Manly burger (which I feared would be a monstrosity of meat and cheese), while my friend got the Cali. <br><br>Hers was messy AF to eat, but she stuck with it and said it was good. The Manly was actually smaller in size, which I was fine with, and the bacon lardons and onion rings worked really well and were well balanced with the burger where one flavor didn't taste too overpowering.<br><br>We got the cheesy tots too (IDK why but seemed like a good idea) and those were like GIANT tots with cheese inside. Different play on it, and I liked it.<br><br>You start w/a little dish of pickles and pickled beets on the table, and I could have eaten only that. Very tasty. <br><br>Overall, I had a great meal and would absolutely hit up the other location in Wicker Park. Portions aren't huge for cost, but honestly, it was a good burger and that works for me.", "pics": null}}, {"review": {"des": "Umami Burger is WOW.<br><br>Umami is a casual restaurant that does not take reservations.  I came with a group of friends on a weeknight; it wasn't crowded and we were seated almost immediately.<br><br>It is almost impossible to decide what to order.  Everything was just so tempting!  We all pigged out here with giant burgers, piles of fries, and cocktails.  I had the slider trio which included 1 of each of the Truffle burger, Hatch burger, and Manly burger.  The Truffle was my favorite, the Hatch was a close second, but I wasn't a fan of the Manly (with onion strings and bacon).  The burgers are cooked medium-rare, which initially didn't thrill me, but it was perfect.  Trust Umami.<br><br>I paired my trio with an order of the Truffle Fries, doused in truffle cheese fondue.  I loved these.  The burger and fry combinations here are endless.<br><br>The cocktail list gets an A+.  Lots of fresh ingredients, classic drinks, and twists on the classics.  One cocktail had a lavender rosemary syrup, but being unable to drink at the moment, I asked if the bartender could make me a mocktail and they granted my wish!<br><br>When all was said and done, I spent about $20 on my burger trio and fries not including tip.  Others spent upwards of $50-60 if they were getting additional sides and cocktails.  I was so stuffed I shamelessly unbuttoned my jeans for the long ride home back to the 'burbs.<br><br>This restaurant is good for small to medium-sized groups (I think we had 6-7), but it is a little bit louder than some places.  The service was great, and the bartenders rock!", "pics": null}}, {"review": {"des": "Umami always has great food. You really can't go wrong with it. I always recommend the Manly burger. The thin fries and house ketchup are the best. (Wish you could get the latter in a jar and take home with you! Haha)<br><br>At this particular location, it's right at the heart of Wicker, and the open patio entrance makes the restaurant feel like it's part of the action outside. It's really nice<br><br>Great service here, too!", "pics": null}}, {"review": {"des": "I love the food here, parking can be difficult to find at times but it's so worth it! From cocktails to burgers, it's all good :)", "pics": null}}, {"review": {"des": "Bartender was server and Food Runner, not his fault. Royale Burger was smaller than I expected. And For 15.50, it was really small - Which is ok, but Medium-Rare it was not. It was Overcooked. It took 30-minutes to get my food, which sucked given I was in between breaks. The flavor: Yes, 9.5 out of 10. But now, I can only imagine what it would taste at its perfect temperature. I WILL be back to give this a Round 2. Hopefully this time, it will be cooked right. (Minus Points for wait, price to size ratio, and over cooked burger).", "pics": null}}, {"review": {"des": "Great burgers with wonderful service. Anything with their bacon is DELICIOUS! Not great parking but it's Chicago", "pics": null}}, {"review": {"des": "I came today for a discontinued item, the Asian flavored wings.  I got the lollipop which is a wing with some meat flipped off.  I ordered the lollipop wings and a regular fries for $14 and I'm still hungry.  The buffalo wings were okay.  The fries were hot and some were undercooked.  Not the wings and skinny fries must be on a diet because it was very little food.  This was definitely below a wow experience.", "pics": null}}, {"review": {"des": "I really wanted to like this place, but unfortunately it was terrible. The thin fries were just ok, but the impossible burger was burnt and dry. The manager and staff were gracious when I complained, and removed it from our check. I have given the one star because of the front of house staff, if it was just for the burger, that's a zero stars.", "pics": null}}, {"review": {"des": "Probably the best burger I've had, and I've had a lot of burgers (mainly on the west coast though). I got their new baconater burger and my GF got the truffle burger. They were both amazing. I wish there was an Umami Burger in Oregon.<br><br>The waiter was also great and gave us both a shot of Malort on the house after inquiring about it since it's a local thing. Five stars.", "pics": null}}, {"review": {"des": "This isnt a burger review... However its a review for this bomb-ass Maple Bacon Old Fashioned. I literally had to bow my head and thank God for this amazing cocktail! I followed it up with the maple bacon sweet potato fries which were just ok. My next visit I do plan on trying a burger to see what the rave is all about!", "pics": null}}, {"review": {"des": "I went to Umami Burger last night really excited because I had not been there for awhile. Turns out I should not have gone back. We arrived around 8:00 and were told that there was a 25 minute wait...ok no big deal, would be happy to wait. However, during our 30 minute wait we saw numerous tables that just sat inexplicably empty. After we get seated it takes ten minutes for our server to take our drink orders. She comes back with our drinks and when I open my mouth to order she runs away! I mean cmon I've now known my burger order for over 50 minutes! She comes back ten minutes later after I have to flag her down and before I can say my full order she turns to my husband and asks what he wants as if she's in a hurry. Mind you this place is not that busy with many empty tables on a Saturday night. Whatever we get our order in and We patiently wait even though we are starving! After an eternity we are served our fries no burgers. Unfortunately, after she set the fries down I saw red...my husband sweet potato fries were cold and my truffle cheese fries had a drizzle of truffle cheese, literally a drizzle!!! I was so hungry I started eating them any way . Another almost ten minutes later we get our burgers AND THOSE are under seasoned, luke warm, dry!!!, cooked medium instead of medium rare and have a teaspoon of sauce on them! The umami burger I know and love serves a perfect juicy medium rare burger !We then told our server hey our fries are cold and we need more cheese and to her credit she got us hot sweet potato fries and more cheese right away (hence the two stars) but then I would like to know why is took almost 40 minutes to get us fries in the first place?! It took almost 50 minutes since ordering just to get burgers which is unacceptable especially since it was not even busy! Also $4.50 for my blood orange basil Fresca is way too much given that it was luke warm and not even remotely good. Ughhhhhhhh I was so disappointed.", "pics": null}}, {"review": {"des": "I used to like the turkey burger here a lot and that was the main reason I came here. But it is gone, no more turkey burger. Then I figured I can get the impossible burger and have it with my favorite unami sauce: the Diablo sauce. Guess what, that is gone too!! So they removed the sauce that made their good burgers taste amazing. No turkey, no umami, no me. Not sure why they changed a good thing that was working but I guess they def lost 1 customer.", "pics": null}}, {"review": {"des": "I heard good things about this place so decided to check it out! It was around 7pm on a Tuesday and it wasnt too busy so we got a table right away. I liked the decor and the atmosphere was really cute.<br>We ordered our burgers and hmmmm they both looked delicious, I like to experiment with my food and try new thing so I loved when I saw how it looked like and lots of greens on it. Unfortunately burger was just ok! It looked really good though.Not bad but not something that would make me plan my next visit any time soon. <br>Fries were meh...<br>I", "pics": null}}, {"review": {"des": "Came here to see what umami burgers were all about. The vibe was really chill and laidback, but I also when during lunch so it wasn't too busy. I took the trio slider option which is $13 to try three mini sliders and had the Manly, Truffle, and Impossible burgers. I think my favorite out of the bunch was the Truffle, which had a nice and smooth blend of all the umami, cheese, and beef flavors. However, the slider option was a great way to go since having one huge burger seemed a little too much for me at the time. <br><br>I also got the maple bacon fries which were BOMB. It was an awesome combo of maple syrup, bacon, and sweet potato fries. Overall, a great experience, but a little on the pricey end. But I guess That's what you get for jumping on the hype train to find out what an umami burger is. ‍", "pics": null}}, {"review": {"des": "This place never disappoints! Their burgers are to die, a contemporary twist on a classic burger. I ordered the truffle fries with their sauces ( from left to right: beer cheese, jalapeño ranch, diavolo, truffle garlic aioli, and their house ketchup). This time I chose the sunny side burger. Highly recommended!", "pics": null}}, {"review": {"des": "Umami Burger is my absolute favorite burger & fries spot. It's my Go-to after a night of drinking or even just for somewhere to go for a bite to eat when nothing else sounds good I can always count on this place for consistency. I almost always get the throwback burger OR the Cali burger. Excellent quality meat. I always get the thin fries with the truffle salt - AMAZING. Perfectly crispy thin fries. The drinks are actually good. I do not recommend the wings l, other than that everything I've tried has been amazing. Parking is a hit or miss but that's for anywhere in wicker park.", "pics": null}}]}