{"name": "union-sushi-barbeque-bar-chicago-2", "reviews": [{"review": {"des": "I like this place a lot. It's so easy to make reservation on a Saturday night through Open Table. I was stuck in traffic and had to reschedule my dinner time twice, and also called the restaurant the third time to let them know that I'm 15 minutes late, and they were really accommodating and say they will keep the table for me. So that alone already made me feel less stressed compared to many other restaurants. The place is quite spacious, and looks very hip/cool with the decor. I like the modern design very much. <br><br>We came around 6 PM, which is still considered their happy hour. It's 5-6:30 PM every day I believe, including weekends! How rare is that? We got oysters, sushi, skewers, sake, truffle tuna, and rose. For the happy hour items, I would only recommend the oysters and the drinks. I don't think the other items are that great. <br><br>To be honest, the sushi here is just mediocre. I didn't feel impressed with any of the sushi I ordered. However, the other dishes were really amazing. I got the buffalo duck wing, alligator rib, quail with black rice, and king crab legs, and was so happy with all of those 5. I will definitely come back to eat those!!! Highly recommend those to you all to try. <br><br>The combination of everything in those dishes is just perfect. I wouldn't change much on any of them. The alligator rib dish is very rich and heavy, so maybe just get a veggie plate to balance it out. Otherwise, the rest is so yummy!", "pics": null}}, {"review": {"des": "The decor is spunky and funky, which makes this spot a casual and fun place to get a good meal with friends. The menu is huge, so you will be very indecisive about what to get. It features sushi, apps, ramen, barbecue and other Asian favorites. The drink menu is standard with beers, wines, etc. It also has some Asian drinks options, which are fun to try.<br><br>Once seated, the table gets complimentary edamame, which is a huge plus because everyone is always a fan of that. For apps, we decided on the tartare, the mushroom dumplings, and the peppered shrimp. They were all delicious and the tartare had a kick to it with the wasabi mixed in. The peppered shrimp definitely had the best taste out of the three, being slightly spicy. <br><br>For entrees, most of us decided on the sushi. One cool thing about their sushi is that they offer black rice, which is supposed to have less carbs and sodium. It was a great option to have and interesting to try. Their sushi also comes in great size options, so you can do 4 or 8, and get to try more types then. The menu is pretty customizable. I tried the Hokkaido (scallop, avocado, jalapeño, masago-mayo) and the Clifton (fried calamari, garlic mayo, grilled asparagus), which were both delicious. I tried the Clifton with the black rice, which definitely had an interesting touch to it and did not thing the taste. <br><br>Overall, a fun experience and I would come again.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6mB6NptWZtcT0nUL8qQZTQ/348s.jpg", "caption": "Mushroom Dumpling"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/g7D1ITdHdHqUthKPwfMMHQ/168s.jpg", "caption": "Tartare, edamame, shrimp"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WGjtta84gpPdHi5wJ754Gw/168s.jpg", "caption": "Hokkaido and Clifton"}]}}, {"review": {"des": "My boyfriend surprised me for my Birthday with a dinner to Union Sushi.  I love Sushi but my boyfriend doesn't eat it, so we can't ever got to a sushi joint together.  The menu at Union Sushi allowed us both to be happy.  The sushi was really good and the BBQ was amazing, so much so that we ordered more!<br><br>After we finished our meal, they brought me a free dessert with a candle to wish me a Happy Birthday.  The manager then came over and called me by name (my boyfriend was the one who made the reservation, not me) and handed me a card.  I thought it was such a nice personal touch to the evening.  I would highly recommend this place especially for a special event.", "pics": null}}, {"review": {"des": "I like the upscale casual ambiance of Union. I never tried their drinks, but they have pretty good food. They offer a good variety of sushi, but the lunch special sushi was only a marginally better value than a single roll because the salad that comes with it is tiny. Items like the bento box and ramen on the other hand seem like a good deal because you get a lot of food. They serve well proportioned nigiri, but I was actually not impressed with the quality of their otoro. I'm also not fond of the truffled tuna because I don't think the avocado or truffle oil fit well with this particular fish (I've never seen this combo anywhere else). These are just my preferences, but I do appreciate the vegetarian options and amazing service, and I look forward to try all the other options on the menu.", "pics": null}}, {"review": {"des": "Really good, unique, friendly spot in river north. There is nothing \"traditional\" about this menu.  You have to get the black rice on each sushi roll.  It truly brings out the flavor. The spicy tuna is classic and always my favorite.  The old city market and the pacific coast are my favorite speciality rolls. My most recent visit we splurged a little and also got the beef sampler, a kangaroo skewers (so wild, but yummy), and the mochi cake for dessert!! I would definitely recommend all of the above. <br><br>The reason I gave Union a 4/5 instead of a 5/5 stars is because it isn't the best sushi in the area, and the food items on the happy hour could be better. However the atmosphere and friendly service definitely makes up for it!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CUu-63ptBuCxUIYwqIgqig/348s.jpg", "caption": "happy hour sushi roll"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/abxd3i8wFVYQMqnlvsXsZA/168s.jpg", "caption": "mochi cake! Yum"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/s5cNccR7-IiSgek3WJq3WA/168s.jpg", "caption": "assortment of rolls, kangaroo skewer, BBQ sampler"}]}}, {"review": {"des": "We've been here at least 4 times over the last year. Every time we're here everything we try is great. <br><br>Happy hour - We always catch the last 30 minutes of this. We get the $5 mules which are exactly what you'd expect them to be, sweet and tart. For food we get the happy hour beef skewers and oysters. The beef is cooked to order and super tender. Most of the time it had a nice char to it. The $1 oysters are my favorite. They're fresh and never sandy. <br><br>We've tried many of the rolls and other items here which are all good but my all time favorite is the king crab legs. They are pricey but are absolutely AMAZING. The garlicy mayo they top it with after its grilled starts to melt and infuse into the crab. Definitely get this, you won't regret it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3APbSrqXoYPK9wC0anmyNg/168s.jpg", "caption": "King Crab Legs Barbeque"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FLuEGKxlsdIjOQjQiMDy_Q/168s.jpg", "caption": "Oyster"}]}}, {"review": {"des": "I came here for their Happy Hour and tried all the food and some of the alcohol on that menu. It was good, but after talking to the chef, I ended up trying things on the regular menu. He recommended Hakkaido & Old City Market. It was delicious! It wasn't crowded so staff was really attentive. I like the vibe of the location- it'll be a cute date spot.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/52cMY0KS695TIfJZxWiiww/348s.jpg", "caption": "Hakkaido & Old City Market."}]}}, {"review": {"des": "I don't usually order carry out sushi because I like it fresh from the sushi chef! This was some of the best sushi I've had in a long time and it was delivered right to my door! I can't wait to eat union sushi again! Excellent!", "pics": null}}, {"review": {"des": "Host apparently didn't like the way we looked because he decided to change seating policy when he saw us . I guess he has the super power of knowing that we would not be good customers.<br><br>Manager read review and handled it Like the ultimate gentleman !!<br><br>Food is excellent and wait staff phenomenal...", "pics": null}}, {"review": {"des": "Cannot get enough of this place! Great quality sushi  and very creative approach. You must try the black rice sushi, tuna tartare and the oysters. It's my go to place for happy hour! Great deals from 4:00-6:30 including weekends! Love the sparkling rosé option for happy hour. Highly recommended!!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EVyKIGNZ2S-gg_LDGMjDKQ/168s.jpg", "caption": "Happy hour oysters"}]}}, {"review": {"des": "I had a great time at Union! All staff there were friendly and accommodating. At first they were about to squeeze us into a TINY table BETWEEN two other parties. There would've been no privacy. I didn't want to feel crowded plus I was in a hurry so we sat on the counter which I ended up liking better. We were able to talk to the chefs and ask questions and fish for recommendations. Mussels were incredible, the miso broth in it was delicious. Tuna sashimi was thick and fresh, and I loved how the fresh oysters were already garnished & ready to eat...(This is my preference  because I don't like doctoring up my own oysters and prefer it ready to slurp!) can't wait to come back!", "pics": null}}, {"review": {"des": "(English)<br>Two words: Black rice! And its AMAZING! <br><br>Not just in taste, but also it has a high nutritional value and boast fewer carbs and calories than both white and brown rice. So, yeah, this place is for you! <br><br>This place is really nice very savory and you can substitute black rice with any sushi roll. It has a really nice ambiance and cool wallpapers art design. <br><br>(Español)<br>Dos palabras: Arroz negro! Y es INCREIBLE!<br><br>No solo en sabor, sino que también contiene un alto valor nutricional y con menos carbohidratos y calorías que el arroz blanco y arroz integral.<br>Sin duda, este lugar es para ti!<br><br>Tiene un ambiente muy agradable, las paredes están muy artísticamente decoradas, es muy sabroso y puedes sustituir cualquier roll de sushi por arroz negro.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2uskBW6R_KhIZ5sB5AWp6Q/168s.jpg", "caption": "Spicy Tuna black rice rolls- It's a unique natural flavor with a subtle sweetness pairs extremely well with sushi"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zgc8bJcpcmpR0_CLZgApwg/168s.jpg", "caption": "Spicy Tuna Union Hand Rolls- Sesame chili oil, masago, tempura flake and mayo"}]}}, {"review": {"des": "We came here on a Friday for dinner and the restaurant was packed. Good thing we made a reservation. We still had to wait about 10 minutes to be seated, but we didn't mind. Our waitress did a great job despite how busy she was. <br><br>We ordered the sliders as an appetizer. The chips that came with the sliders were very soggy. The sliders were unique and tasted pretty good, but none of them stood out to me. For dinner, we had the Spicy Pigtail Ramen and Short Rib Ramen. I did not enjoy either one of them. The broth lacked a meaty flavor and the combinations just didn't make sense to me. I prefer a more traditional ramen.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QMxcZGtTMrQiCNTHTX34Xw/348s.jpg", "caption": "Spicy Pigtail Ramen"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/apYKHKsc_95qyWgHyHWQbA/168s.jpg", "caption": "Short Rib Ramen"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0RtZPsM7eGaTNDrwrlE9bw/168s.jpg", "caption": "Sliders"}]}}, {"review": {"des": "Stopped here for dessert and a drink after an event. I got to sit at the cocktail bar, which was nice. They had the Cubs game on. <br><br>I ordered the the pumpkin mochi cake, which tasted like heaven!! Think of a warm, rich butter cake (that was still gooey in places) topped with whipped cream, light home made vanilla gelato, roasted nut pieces, and caramel drizzle.<br><br>To drink: I had the \"it takes two to mango.\" It was a nice, tropical drink that had habinero salt/spice on the side if the glass. The salt/spice brought an extra layer of complexity to the drink and made my lips/tongue tingle. <br><br>Overall, I loved it!! The bartender and host were super nice. A perfect way to end the night! I will definitely be back to try the test of the food (it smelled so good!)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xmRmyLx2twqeFtsrAPUEaQ/348s.jpg", "caption": "Sweet potato, spicy shrimp, and spicy tuna sushi"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ndIKT2N1BJZSa2KTgyfBEw/168s.jpg", "caption": "Mushroom dumplings"}]}}, {"review": {"des": "At first I was a bit skeptical of the sushi and bbq combination, but I was won over right away. Started off with kangaroo and pork skewers, cooked over an open fire grill. Meat was tangy and delicious. We followed up with a couple more bbq options - the portions are quite small per order so you likely need a couple orders. Finally tried the sushi at the end and highly recommend getting the black rice sushi set.", "pics": null}}, {"review": {"des": "Recommended: Happy Hour menu, Old City Market maki, seafood ramen, unique robata skewers and crab legs, ice cream flight with brittle. <br><br>With its flashy red neon sign, Union is difficult to miss heading down Franklin road. Metered parking even along the borders of downtown is not recommended. Taking the brown line in is probably the better option. Union with its quirky colorful modern designs. Highly recommend stopping by <br><br>Unique, adventurous ramen choices. After hearing everyone ordering a different bowl of ramen, the server spoke out and recommended that we try the spicy pigtail or seafood ramen instead of the beef cheek as they are the most popular bowls in house. Thanks for looking out for us! The uni alfredo soba is much smaller than the rest of the ramen bowls. The uni and suck sobas are dry while the other ramen counterparts are soup based. <br><br>Union surely has you covered with the full Japanese cuisine experience. Ranging from ramen, sushi, salads, full appetizers, robata grill, there's surely something for everyone! I'll surely go back to try the rest of their menu. <br><br>To be continued.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tHwqAQr0rz7UMKfPQpEkKA/348s.jpg", "caption": "Complimentary edamame."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LBP-7XpugLRV314b_e5KSQ/168s.jpg", "caption": "The yuzu pie. Coconut crust with yuzu creme cheese on top."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EM9H9pKCOUyVXKvLf9CO6Q/168s.jpg", "caption": "Hokkaido maki."}]}}, {"review": {"des": "Made a reservation on the weekend and was told to wait a bit for our table to be ready. No big deal the bar was fun! Our table was for around 7 people so we expected we might have to wait. Although the sushi was good it was a bit overpriced and the drinks as well that's why I docked a star. What was great was the ambience and the decor; trendy and hip! Our server was wonderful, he was very polite and attentive to our table.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0ueMqj_U_KbB1VxOS7rfMw/348s.jpg", "caption": "Groovey decor"}]}}, {"review": {"des": "I'm originally from the coast so I'm a really tough critic when it comes to sushi. I've had a hard time finding a place that is actually enjoyable in Chicago. This place was great and so was the service. Our server was super sweet and she gave us some great recommendations. We will definitely be back!", "pics": null}}, {"review": {"des": "I walk past this spot everyday on my way to work and had been meaning to check it out. I ended up going around 8:00 on a Saturday night. We didn't have reservations but they were able to seat us at the bar upstairs. <br><br>Such a cute date spot or I can see getting together with friends too. My date had already been, but I hadn't and we ordered various items from the menu. One of my favs was the truffled tuna. I love anything with truffle! We also ordered the seared Wagyu beef and the Wagyu beef sliders. Both were good, but I thought the chips that came with the sliders was a bit much and I didn't enjoy the pineapple on the slider either. I'm not a fan of mixing sweet with savory. One of my favorite dishes would have to be the king crab legs. So much flavor!!!<br><br>Last, but definitely not least we had the sushi! I thought it was decent. Probably not better than other sushi spots I've been, but right up there with them.<br><br>As for the cocktails I had the daiquiri which was good and then switched it up with a mule. Service was great and I loved the seclusion of the bar upstairs so we could really talk. Music was awesome as well with old school joints from Nelly, Biggie, and Kelis. I'd def come back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yP5gvYaHF_4KaMPHXHPRwg/348s.jpg", "caption": "Truffled Tuna"}]}}, {"review": {"des": "Upbeat and trendy decor. Great place to meet up friends and have some drinks after a stressful day at the office. <br><br>The food was plated well and the flavors were good.  However, if you are a big eater \"cough\", the portions are small for the price you are paying. <br><br>Yeah yeah fat boy problems I guess.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/d-_D39imoXoR4brveOK3eQ/348s.jpg", "caption": "Bacon wrapped scallop lolli."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/F61ZwE5BoZu9IHO7qgH7Bg/168s.jpg", "caption": "Savages dug into the tuna before I could get a pic."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/y-t3SfiCdJaWk7QxncXEfw/168s.jpg", "caption": "Buffalo duck wing."}]}}, {"review": {"des": "We came here on a Saturday night with some friends and luckily made a reservation because this place was packed! We were seated and greeted by our server. She was fairly friendly, but soft spoken. In a place this packed and loud it was hard to hear her. To start off we ordered the tempura plate. This was just meh, lacked flavor and the tempura vegetables were very hard to eat. Would not order this again. For our entree we ordered the barbecue box sampler. It was cool to be able to try different items, (she did let us switch out some items of the same price point) from the barbecue bar. We ordered the shrimp, waygu short rib, kangaroo, and chicken thigh. The shrimp was my favorite, the kangaroo was a little tough, but this was my first time having kangaroo so that was a new experience! Would I come back, maybe? I would probably get something different though!", "pics": null}}, {"review": {"des": "I was very interested in the black rice sushi so I had to stop by this place! The oyster caught my attention so I definitely stop by during happy hour where the oysters is only $1. It's small but the flavor is pack in it. The portions is little for the price value. <br><br>I definitely love the black rice sushi combo. It had a little bit of each to try. Perfect to share for two!<br><br>The best time to do show up is for their happy hours. The list is pack with so many fun appetizers and drinks. And if you were to order a drink, The classic mule is still my favorite! <br><br>Service was fast and friendly. They definitely take good care of u. The only thing I did not like was sitting so close to the next table. I felt like there was no privacy.", "pics": null}}, {"review": {"des": "Having heard so much hype about Union, I was very excited to finally check it out. Unfortunately, the experience was an utter disappointment.<br><br>We booked an early dinner after a long flight. I received a confirmation phone call in the afternoon and was much looking forward to it. However, when we showed up and checked in with the host, we were informed that our reservation was not in the system. Spent quite a while verifying the above said confirmation phone call and confirmation email, and we finally got seated.<br><br>That was alright; we just wanted to get to the food. We got the sampler which includes all the \"signature\" skewers. When it came out, everything was smothered in sauce. And when I took a bite of the scallop, I literally spat it out because it was extremely stinky. I wasn't sure if the excessive sauce was to hide the stickiness (I definitely hope not), but that mouthful was definitely a turn-off.<br><br>The reason I'm giving it one more star is because our server was a delight, and the pumpkin mochi cake dessert was pleasant. But for a Chicago restaurant staple, messing up reservation and serving unfresh food was just shocking.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wcg5gGESeGJXpGHNliez6g/348s.jpg", "caption": "Pumpkin Mochi Cake"}]}}, {"review": {"des": "Amazing place to have lunch dinner and or a date.<br>The atmosphere is very captivating, and it's nothing like watching a chef cook your food or roll your sushi. Such an amazing combination. Here you can have the best of both worlds. The seafood ramen was very filling and flavorful. I highly suggest it. The sushi is extremely fresh. A lot of unique combinations.", "pics": null}}, {"review": {"des": "I really liked this place, however I thought it was a little expensive, even with their happy hour deals. **Happy hour is daily from 5-630. <br>The restaurant itself is gorgeous, and spacious, and we were seated right away. We ordered 2 rounds of moscow mules each and the $1 oysters, which were so flavorful (one of the best oysters I've ever had). Next, we had the bay street california, spicy shrimp, devon and shrimp tempura rolls. All of them were great, however my favorite was the shrimp tempura roll. It came out hot, and it just melted in your mouth. Finally, for dessert we had the pumpkin mochi cake, which was like a cake stuffed with mochi. We had a great dinner, but I would prefer some place like an AYCE, which is much cheaper.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/W4DlOioFDuVeTgl4l7mePQ/348s.jpg", "caption": "pumpkin mochi cake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HvX2qK4XX-cF8basC4fg9w/168s.jpg", "caption": "bay street california, devon, and spicy shrimp"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hVDQrb6RDCbkYGwO0lG45w/168s.jpg", "caption": "shrimp tempura"}]}}, {"review": {"des": "Wow absolutely delicious, fresh sushi. Very different and unique offerings. On their bbq side they have items like kangaroo, beef tongue (in addition to the beef and chicken an pork offerings). Their specialties list items like quail egg and alligator rib.<br><br>We were here for lunch so decided to stick with sushi. We went with the old city market roll which is stuffed with spicy tuna and seared salmon, and the Bristol bay which is like a California roll on speed - made with king crab, grilled asparagus, avocado and uni butter - Wow. <br><br>Service is great. Atmosphere is modern and chic.", "pics": null}}, {"review": {"des": "\"Duuude...the tuna at Union took me to a new spiritual level or like...something...you gotta go....!\"  UGH. Don't you hate it when someone overhypes a restaurant?  Union is perfectly fine and the black rice sushi was tasty.  The service was quick and friendly.  The ambiance was cute and great for a first date night.  Why can't this place just be that? Well, my friend....because it is in River North.  That weird mythical area where you can put a McDonald's up, add a nice plant or two and BAM! it's \"inspired\" and \"disrupting the foodie scene\".  Come on, guys.  It's not this place's fault, at all.  Union could be in the dark recesses of Lower Wacker and people would still go. Let's just let it stand on the food and not force it to be something it isn't and doesn't seem to want to be.", "pics": null}}, {"review": {"des": "Delicious lunch, as usual. I had the lunch combo, which I chose spicy tuna roll and cauliflower salad. <br>The tuna was gorgeous! <br>We also tried the seafood ramen. Excellent!! <br>Fresh ingredients and great flavor!<br>The calamari with side arugula salad was perfectly seasoned. Delicious!<br>And bonus...$5 select wines on Wednesday!", "pics": null}}, {"review": {"des": "Since I am no longer able to eat seafood that much, I really appreciate their vegetarian selection (cucumber sushi are yummy!), and barbecue (kangaroo meat?). Don is a little bit too dry, but everything else seems great.", "pics": null}}, {"review": {"des": "Let me start by saying this place is 3 blocks from my apartment so it's definitely convenient and is my \"go-to\" place when I am craving Asian and am too lazy to think of anywhere else to go.<br><br>HOWEVER, with that said, I AM SO GLAD this is close to me, because the happy hour specials may be the best in the city. By that I mean $5 sparkling rose, $1.50 oysters, $5 moscow mules (with 5 different kinds) and $3 party-in-your-mouth beef filet skewers. <br><br>My favorite item on the lunch menu is the duck yakisoba bento box which comes with a spicy shrimp roll and house salad. For just $13 you can head back to your office very content and full (and slightly buzzed if you go on Fridays and take advantage of their $5 rose special). <br><br>To top it all off, the staff is VERY friendly. We are regulars so they always chat with us and sometimes we even pop in to say hi when we are walking by. To sum it up - go to Union ASAP!", "pics": null}}, {"review": {"des": "I'd ordered in from here once a few years ago and enjoyed it, but I wanted to check it out again. I went with a friend for happy hour, which was until 6:30pm, merciful in both timing and selection. (Too often, you only save money if you can get there before 5:30 or something ridiculous...and there are like 4 options on the menu.)<br><br>My friend and I got here before 6:30, about 6:15, and thankfully, we got our orders in on time! My friend enjoyed her sushi; she thought the ingredients worked well together and seemed fresh. I got the inventive truffle tuna tartare. The truffle taste was unique but not overpowering. If I had to nitpick, it was perhaps too cold, evident in terms of the texture. I still enjoyed it though, and I'd get it again. The flavors were excellent!<br><br>The drink specials were limited but well selected. It was cool that they featured $5 glasses of wine, including one of sparkling rose...it was good, bright and fizzy. No bottom-of-the-bottle stuff here, even for happy hour. <br><br>Our waitress was nice enough but a bit spacey and physically absent most of the time. <br><br>It's nice to see that this restaurant has stuck around for a decent amount of time. It hasn't rested on its laurels, and it continued to deliver high-quality, unique dishes!", "pics": null}}, {"review": {"des": "Came here for Happy Hour! Such a great find. Tried everything on their happy hour menu and I highly recommend. They also have 4 flavors of Moscow Mules for you to choose from. I chose the apple cider version. It wasn't too sweet and you could definitely taste the apples. <br><br>I was impressed with the spicy shrimp roll. You could actually taste the chopped up shrimp pieces in the roll. The truffled tuna was just a basic tuna tartare; I don't see why it was called \"truffled.\" The skewers were delicious! You could taste the smokiness and the meat was incredibly tender. The oysters are on the smaller side, but I feel for $1 it's worth it! They come with toppings and a lemon wedge. <br><br>I also ordered the black rice sushi sampler. I didn't regret this at all. I got to try a variety of rolls and all of them were really good. I didn't feel stuffed after this meal either. I felt a \"clean full,\" if you know what I mean :)", "pics": null}}, {"review": {"des": "I've been meaning to get this review posted! This has to be one of the best Sushi places I've found yet. The creativity behind every item was outstanding and the detail to food was like never seen before. Luckily, I was able to catch them during happy hour and enjoyed a drink and some oysters. I love oysters, I'm an oyster-fanatic. The oysters here...Don't even taste like Oysters, The toppings on mine were so elegant and flavorful that I would challenge anyone who hates Oysters, TO TRY THESE OYSTERS.  I definitely suggest picking up a bento box during lunch hours. It was more than enough food and the price was extremely fair! <br><br>Thank you CHEF CHAO for your hospitality!", "pics": null}}, {"review": {"des": "My friend and I came here right when they opened for dinner, and were able to be seated promptly. The venue has a dim, upscale urban vibe to it, and plays a lot of contemporary hip hop and pop hits. <br><br>Our server, I didn't catch her name, was very accomodating and helpful in explaining the happy hour deals and what the particular choices were. The happy hour deals were actual quite good: $3 beef tip skewers and $5 Moscow mules and rosés? Amazing! And the complimentary bowl of edamame covered in cheddar was yummy as well.<br><br>We got the $25 black rice sushi sampler, which came with 4 pieces of four of their signature rolls in black rice. They were simply delicious. Having never been here, we weren't sure what to get, and this sampler hit the spot. <br><br>We came here to celebrate my departure from retail, and this place delivered quite nicely. An excellent place to come for a date or a get together with friends.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_Z8KqPFZ6rQv1FVQheAX5w/348s.jpg", "caption": "Black Rice Sushi Sampler"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/h8tjKKSFP7uR-qsUbVxkww/168s.jpg", "caption": "Beef Skewers, absolutely delicious and very tender!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7xoa3aS6NCk6OPOLadmtxg/168s.jpg", "caption": "Moscow Mule"}]}}, {"review": {"des": "Bento  box was on point! Some of the best!!!!!Eat sushi drink sake, be merry. Anything on the menu will satisfy I highly recommend having them suggest the meal as you will not be dissatisfied. Staff is very kind and all take pride in the preparation. I will definitely be coming here again!<br><br>Love this place!!!!!", "pics": null}}, {"review": {"des": "Even though this is our first time to be here, we have enjoyed a over-perfect dinner here. The size of plate is way over more than we expected, and the each dishes taste so great. We still thought that we had a little bit too much.<br><br>The service here is really good, and waiters and waitresses are so nice and friendly.<br><br>Sashimi are really fresh.<br><br>It's so pity that I don't drink. I think people could have better experience here if they would like to try any alcohol drinks with their food. It's really a nice place to have a good dinner with friends.", "pics": null}}, {"review": {"des": "Hip and trendy sushi spot in River North. Went here with a few girlfriends during happy hour and we all ordered sushi. I tried the spicy shrimp roll and the scallop roll and both were delicious. We went on a busy Saturday evening so there were no tables available but they were able to seat us near the grill- we didn't mind this. Service was slow which is why I'm taking off a star. Can't speak for the BBQ items on the menu but the sushi was yum. Worth a visit!", "pics": null}}, {"review": {"des": "Such an awesome happy hour!!!!  You get to choose from 4 varieties of mules.  If you're up for it, I'd get all four (although the tequila one is strooong).  Their $1 oysters are hands down the BEST $1 oysters I've ever had.  It's no naked oysters, they dress them up in scallion, fried garlic, and sauce.  We tried to happy hour hop but regretted it the second we went to the second place.  Union should be the top happy hour for everyone in the neighborhood.  These oysters don't lie!<br><br>Maybe next time I visit Chicago, I'll do more damage than just happy hour.  The service here is great too!", "pics": null}}, {"review": {"des": "I really like the Happy Hour deal they have here, especially because it's one of the only places in Chicago that still has Happy Hour on the weekends. Their Happy Hour is every day from 5:00 - 6:30 PM.<br><br>Their spicy shrimp rolls are really good and so are their moscow mules (there are three different kinds!!). I wasn't really into the sushi on their regular menu though. It was way too ~ hip ~ for me. I would definitely come here for their Happy Hour, but probably not for anything else.", "pics": null}}, {"review": {"des": "We visited Union Sushi on a Saturday night. We made reservations through Open Table. Hip, cool vibe. We waited at the bar a few minutes. We ordered the tuna tartar- DELICIOUS! The tuna was fresh, just enough truffle, ah it was very good! The smoked sashimi appetizer wasn't out favorite. It was room temperature and I'm weird about sushi being warmer than room temp. The king crab handroll was tasty. The seafood ramen was amazing! It had plenty of seafood sand it had a slight kick. I don't like spicy food, and I'd give it a ten. We ordered 3 half rolls; pacific and I can recall the name of the other two. My favorite was the pacific with black rice. The fish was great quality. It is not very kid friendly, which is fine. Our server tried to accommodate my daughter the best way possible. Pricing was good too.", "pics": null}}, {"review": {"des": "Good sushi - love the happy hour! <br><br>They have $1 oysters and $10 tuna truffle for Happy Hour, as well as a deal on beef skewers and the shrimp roll. We started with the oysters and the tuna truffle, which was came out looking like tuna tartare on top of avocado (also came with a little side cup of chips). <br><br>We then shared four rolls and tried the black rice. I really liked how you could decide to order a half-roll so that you could try more kinds. Sushi was pretty good - there was one with collard greens that was a nice low-carb option. We also tried the black rice, although to be honest I couldn't REALLY taste the difference between that and normal rice...<br><br>The vibe in here was fun! Cool decor inside. Would be back again for a happy hour!", "pics": null}}, {"review": {"des": "Really like this place.  Their sushi is top notch with a wide range of selections .  They also  have a diverse menu of ramen, BBQ bar, soups , salads and deserts.<br><br>It's a very lively atmosphere. Most sushi places are pretty quiet but this place is cranking tunes and very lively .<br><br>If you like deserts - try this pumpkin cake , it's beyond words good", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DVmHYBHfsqCOEevElTjwLw/348s.jpg", "caption": "Pumpkin Mochi Cake is beyond words good !"}]}}, {"review": {"des": "My girlfriends and I had reservations here on Friday at 6:00 while we were in town over the weekend.  I choice Union because it was close to our hotel and the ambiance seemed right up our alley.<br><br>We were running extra late for our reservation, but I called and they accommodated us when we arrived in the door which was extremely appreciated.  Our waitress (didn't catch her name) was super sweet and took great care of us.<br><br>We started with a couple bottles of Rose and she brought out the complimentary edamame.  All four of us ordered one full roll and one half roll. I also had their salad to start, which was good, but not included with the sushi.  The fish was fresh and the flavor was good, but for the price, it left some to be desired.  We each could've easily eaten another full serving of what we got and then, might have been satisfied.  I would say that price falls in line with the area, but the serving size didn't. <br><br>It was a good experience in a trendy, upbeat establishment, and we had good service, but we left a little hungry and I would probably try another spot in the area because of this.  I just don't think you get what you pay for here.", "pics": null}}, {"review": {"des": "Super cute and trendy spot. Had the most amazing sushi at this place over the weekend. Their specialty rolls are awesome, favorite being the Old City Market... however; I really enjoyed their Dragon Roll as well. Service did not lack, whatsoever and the Saki Bombs were a definitely a hit - shoutout to our server for the suggestion. Really enjoyed our time. Overall, I found our dining experience to be notable. Cool vibes.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NGihg1AltNWqTlUiom5fAA/348s.jpg", "caption": "Sushi Saturday's :)"}]}}, {"review": {"des": "My daughter and I came here for dinner for the first time.  We shared a few dishes: beef fillet skewers, lamb chops, hamachi Kama, and soft shell crab roll.  I liked all the dishes except the beef skewer, which tasted like the meat was not very fresh.  The soft shell crab was rolled in cucumber without rice and was delicious. Hamachi Kama was excellent.  Great service.", "pics": null}}, {"review": {"des": "I visited Union Sushi for a bento box lunch special on a weekday. I tried the vegetarian sushi and my guy got the tempura.  All bento boxes cost $13 - $15 each, which seems to be a great deal, especially as they come with miso soup (or mushroom soup, for the veggie options) and salad.<br><br>Our soups were great. The salads were not, as the overwhelming flavor was thinly shaved raw onion in such big quantities that it can't easily be fished out (why do people think salads are made better by huge piles of raw onion on top?) My veggie sushi was delicious, but each roll came with just four pieces. While I don't eat like a bird, it's not like I'm a totally voracious eater -- and the bento box simply didn't fill me up (especially because I couldn't finish the onion-y salad.) The tempura (which also came with four pieces of spicy shrimp roll) was a better value.<br><br>Luckily, we were there on a Thursday, when hand rolls are half-price; we each ordered a delicious spicy tuna handroll for $3.50 to supplement our lunch and fill us up. In short, the sushi was good, but simply doesn't seem worth the price for what you get - *even* during the lunch special, let alone off the regular menu. If you're high-roller and money is no option for you, order up a storm and enjoy!<br><br>When we got the bill, my husband noted that we could have ordered a pile of hand-rolls for a lot less money. If you visit on a Thursday, this is what I recommend you do!", "pics": null}}, {"review": {"des": "Spent a couple of hours trying different cooked and raw foods off the menu, and everything was delicious. <br>I ate: duck leg, mushroom dumplings, tuna tartare, seared scallops, tempura, and 4 specialty rolls. For dessert I had the pumpkin mochi which was awesome. <br>I drank: all of the signature mules<br><br>I will definitely be going back here when I'm in Chicago again. I would make a reservation if you can because it is a very popular restaurant. <br>Our server was Andrew (pictured) who took great care of my Dad & myself.", "pics": null}}, {"review": {"des": "I came here for a weekday lunch in a group of about 10 people. The place wasn't packed, but service was really slow. It took a while to find a waiter to order some additional drinks for the table, to get our food, and again when we were trying to get our bill. The food was solid. Flavors seemed well thought out. There were fun meats -- we tried the alligator and wagyu.  Small portions, but could have also been because we were there for lunch. Overall a fun place to check out, but not a restaurant I will add to my regular rotation.", "pics": null}}, {"review": {"des": "Right now this is the only sushi bar in Chicago I know that uses black rice (Black rice has a firm texture and has fewer carbs and calories than white). I'm so happy that is walking distance from my place! If you've never had a black rice dish before (what are you waiting for?!) give Union Sushi a try!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/k2N5F4Cl1t-iA5P-OjwQbw/348s.jpg", "caption": "Black Rice Sushi Roll Sampler // Hokkaido, Dragon, Spicy Tuna and Devon Roll."}]}}, {"review": {"des": "My boyfriend and I are from out of town and came for happy hour where we sat at the bar. The bartender was super friendly and service was fast. The food from the bbq was very good and sushi wasn't bad. Definitely wish the portions were a bit larger for the price. Would come again for happy hour and drinks.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0u1hkY3sy0W1HoUDrSyBBA/348s.jpg", "caption": "2 Piece Lamb Chops Barbeque"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/b69Stzx1j0A-gLGijB9M_Q/168s.jpg", "caption": "Oysters could have been more fresh"}]}}, {"review": {"des": "Union Sushi + BBQ is one of my favorite spots for sushi! I'm a veggie sushi eater, and they have so many options for me. It's great! Most places only have one or two basic veggie sushi rolls. Another bonus, this is the only place in Chicago I've found that serves kangaroo.<br><br>The place has a great vibe, and service is always good. If you sit upstairs it can be a little tight, but it's so fun to look down at the grill.<br><br>I'll be back!", "pics": null}}, {"review": {"des": "For the price, this was a fantastic experience!<br><br>The sushi rolls were unique and very flavorful.  Loved the fried calamari roll.<br><br>The barbecue platter was also very tasty.  Most things came in splittable portions on skewers.  All seasoned differently and nothing overly salty or tough.<br><br>The drink I had was good, but at the moment I cannot remember what it was.<br><br>Definitely come back here next time I'm in the neighborhood.", "pics": null}}, {"review": {"des": "I am so glad I found this place on Yelp! I've passed this place a few times and never once thought to check it out. The reviews were mostly spot on and I can say everything I tried was amazing. A good Moscow mule is the way to my heart and Union Sushi won my affection with the Hibiscus infused mule. I ordered the beef filet skewers, oysters and California rolls. The beef filet skewers were very tender and juicy and seasoned perfectly. If you go here, TRUST ME! Get the skewers. You won't be disappointed. The California rolls were ok, nothing to hooray about. I can say that the oysters were perfection. The perfect toppings and the right amount of crunch to top it off; served on a bed of ice and lemon wedge. YUMMY! The Moscow was so good I wound up ordering 3. Overall I like the concept of this place. My server was attentive throughout the entire time. I was greatly promptly and seated at the bar area with no wait time. From what I could tell the place was clean and well kept. Overall it's a very well thought out concept. I would like to come back and try more items from the menu with friends to really gather the full experience and update my review. All in all my experience here was one of the most pleasant ones I've had at a restaurant in a while. The food; atmosphere, along with great customer service and just a unique spin on sushi and bbq is surely a place worth giving a try. Last but not least this place is Erving up the competition by offering a Happy Hour special everyday of the week (weekends included) with pretty decent specials. Hence, the 3 Moscow mules. 3 Moscow's cost me only $15. Typically 1 is $13. I've shelled out as much as $20+ for a Moscow at Soho House and a few other establishments. To sum it up, Union Sushi is a must try. You'll want to bring your friends and your friends, friends here.<br><br>*****UPDATE*********** 8-4-18<br><br>Ok, so I came back here with my sister and we both loved it. We ordered the calamari, shrimp tempura rolls, tempura appetizer sampler and the beef skewers. All tasted excellent. The tempura appetizer came with tempura sweet potato fries which were perfect. The sweet potato fries were tender on the inside and crunchy on outside, sweet but the right amount of umph. My only bout was for $11 you only get 2 shrimp and 3 of the sweet potato fries and tempura decoration which I honestly could've gone without. Our server was great and very accommodating by walking us through the menu as we were both indecisive as to what we wanted. This place is a must try if you haven't already. Not even a week has past and I went right back!!!! Good job Union Sushi!!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RdQ_irIS9K4J34clJXG1NQ/348s.jpg", "caption": "Union Mules"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2Uw6xZPNudzik1cX2t03eg/168s.jpg", "caption": "Amazing!!! MUST TRY!!!"}]}}, {"review": {"des": "Seems very trendy. Lively and fun ambiance with delicious cocktails. However, the food lacked so much flavor. The presentation is there, lots of flare, but flavors fell short. Unique menu items. I just didn't think the flavor combinations really meshed that well. I even ventured to try beef tongue for the first time. Service was excellent though. Prompt and quick. Great venue to visit for a hip and lively spot, but I don't think I'd revisit just based on the food.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/N_iWrve5TT9XX_w5EILE3A/348s.jpg", "caption": "12/2017 lively, fun cocktails, but lackluster flavors, quite a flare and presentation on the plates"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QVzyIAmuvv-ptI_ZIITavg/168s.jpg", "caption": "12/2017 lively, fun cocktails, but lackluster flavors"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/A6K9gNvV9MXTF4_jNSf1Xg/168s.jpg", "caption": "12/2017 lively, fun cocktails, but lackluster flavors"}]}}, {"review": {"des": "I was able to try out this place due to a delivery promotion through an app. I have to say I was less than satisfied with the sushi here.<br><br>The portions were incredibly tiny. The spicy tuna hand roll was about like four inches and nothing special. I didn't care for the old city market roll either. It was just odd. I would definitely pass this place up. There are many other restaurants for the city with better sushi.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rgtX_Z_36h83CkHGFfSInA/348s.jpg", "caption": "Spicy Tuna Hand Roll and Old City Market Roll"}]}}, {"review": {"des": "I have a sneaking suspicion this place isn't known for their fish quality and meat quality. With sushi, and at these prices, I'm expecting perfect fresh pieces of fish, marinated tender meats (filet was dry, unsalted), but we didn't get that.<br><br>Had to wait for our reservation for a bit too. But I did love the saketini the bartender made for me. Also had a nice server who was very apologetic when it took our food forever to come out.<br><br>Good sushi is all about quality and being meticulous. I didn't get that here for $160 for two. Lots of better sushi in Chicago than here.", "pics": null}}, {"review": {"des": "Amazing service and creative food. Definitely one of the best happy hours in Chicago. Big ups to the attentive staff - the food and atmosphere is incredible yet they manage to steal the show every time.", "pics": null}}, {"review": {"des": "Great place! I like their both Sushi and Barbeque. Very clean and comfortable environment", "pics": null}}, {"review": {"des": "Union Sushi is one of my favorite places to eat sushi in Chicago. It has very authentic food in a modern environment. Great cocktails and amazing sushi. Try the black rice rolls. They are hard to find, and delicious!", "pics": null}}, {"review": {"des": "Was told to come here by a friend and don't know why we didn't come here earlier.  The vibe when you walk in is very friendly outgoing everyone smiling and enjoying the time there. <br><br>I do recommend getting a reservation since this place gets packed. We didn't have one but we're able to sit in the upstairs bar right away which was very nice. When we got up there we were greeted by a bartender who was very on point with how he wanted things done was very friendly and helped us without hesitation. <br><br>We ordered a few of their signature rolls and tried some Tuna poke both were full of flavors and very delicious. Also tried a good made oyster shooter and for the first time had some chicken ramen for my girlfriend. The broth really made that dish as it should. They had a real good bourbon and whiskey selection which we were impressed with   <br><br>Overall great experience and will be back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SyvbC4oMtii_s56CUQGKzQ/348s.jpg", "caption": "View from above"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fV6ntuFVRfPFvA9fNseRmw/168s.jpg", "caption": "Upstairs bar"}]}}, {"review": {"des": "Wayyyyyyyyyy overpriced for what it is. Granted we didn't go during happy hour, but the rolls were at least a couple more dollars than the average price in Chicago. <br><br>The mussels were good, the broth was very ramen like. Everything else, including the sushi was pretty average. <br><br>Interior decor was unique I felt like I was in that garbage collection world in the last Thor movie. Not saying the place is trash, it's clean and nice, the decor is just very eclectic.  I enjoyed it!<br><br>My beer came out a little late and the server was very apologetic and even gave us a free desert (thank you for that again!).  I'd maybe go back if I were in the neighborhood and it was happy hour, otherwise I'd recommend finding a different place.", "pics": null}}, {"review": {"des": "My boyfriend and I arrived late to Chicago, and this place was a short walk from our hotel...<br><br>EXCELLENT SERVICE.<br><br>The specialty rolls were yummy, and we were surprised that the fish was fresh and firm-ish. <br><br>The soup noodles were not great, so I'd stick with specialty rolls recommended by the server.", "pics": null}}, {"review": {"des": "Had an incredible evening at Union Sushi, was looking to get some studying done for an upcoming exam so I was placed at the cocktail bar, was recommended by the handsome bartender the best Moscow Mule, I ended up trying all four of them as well as the sushi happy hour and was deeply satisfied. You will find me here again, and possibly with friends, great first experience at Union Sushi.", "pics": null}}, {"review": {"des": "We like many of the Japanese inspirations here...interesting maki roles, creative combinations from chef, robata grill delicacies. Our go to when we don't want to browse the menu is the 16 piece black rice sushi roll sampler, 4 different roles all made with delicious black rice.", "pics": null}}, {"review": {"des": "If you can't decide whether you want fresh sushi or hot sizzling BBQ, this would be the place to come. They serve a very wide variety of sushi/roll options and hot BBQ options as well. I like how their rolls aren't stuffed with overwhelming amount of rice. They put more fish and other ingredients than rice  This place has a large bar area that overlooks the kitchen so feel friend to grab a friend or even swing by on your own to enjoy sushi.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/S8zlqF6CFMccP2ChyU0XPA/168s.jpg", "caption": "Picture from the bar"}]}}, {"review": {"des": "Thai + Sushi = Sauce.  Early years was good effort.  Now, it's pure Thai food disguising as Sushi.  Excellent portion that you don't want.<br><br>Plain MISO SOUP was too salty.<br><br>LUNCH BENTO BOX ribs had too much sauce on ribs and spicy tuna that it became inedible.  Excellent ribs fell off the bone, and moist.  Ordinary salad.<br><br>KATSU DON was an excellent portion and price.  Perfectly cooked pork that is moist and flavorful.  Salty egg.<br><br>SERVICE is finally great, now the food is kaput.  Culinary School Chefs know how much salt is needed that is not based on personal taste.  UNION has cooks including optional gloves in food preparation. (See Video)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WKDMcPzQE-UeKzIP619gfA/168s.jpg", "caption": "Spare Rib Bento"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9sGfuAunpJiI97F8tdfQDg/168s.jpg", "caption": "Katsu Don"}]}}, {"review": {"des": "Union impressed me in so many ways. <br>Service - insane. We were a bit grumpy to have waited 30-40 min for our table, with a reservation on a late Sat night. Union made up for any of the wait with not one, not two, but three free appetizers that were very very good. <br>Food- SUSHI. IS. SO. GOOD. The king crab hand roll with the uni butter cured my athesma, made me grow 3 inches, and got me a raise at my job.<br>Drinks- What. Get all of them, seriously. They're innovative and perfect.<br><br>I will be back soon + often!", "pics": null}}, {"review": {"des": "I really want to give this place a better review. Stopped in last Friday for dinner with a friend and ordered 2 8-piece rolls. So I should've gotten 16 pieces, right? Well they come and I only get 2 4-piece rolls. I mention it to the waitress and she apologizes and admits she didn't input it correctly so she asks if I'd like the remaining 8 pieces to go. I take the to-go bag and when I get home........ only 4 out of the 8 pieces are there. ‍ OMG. How hard is it to count??!!! And yes, we still got charged for the 16 pieces.", "pics": null}}, {"review": {"des": "Went here on a Thursday night, got seated right away at the bar. I highly recommend getting the truffled tuna appetizer and the uni and amaebi nigiris. Surprisingly, the lamb chops were also perfectly done, tender and flavorful. Cool ambiance and hip decor. Servers are attentive and friendly.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/J-j7QXP5SJ9Ls42JhWFRQQ/348s.jpg", "caption": "amaebi nigiris, eat that head, yum"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/imCMprPU3SVf6YjnhcEd7w/168s.jpg", "caption": "uni nigiris, delicious!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jydKq6fsJeekI7Nz7LBEAA/168s.jpg", "caption": "perfect lamb chops"}]}}, {"review": {"des": "This hip spot has an incredible happy hour menu! <br>-$1 oysters, garnished with spring onions and fried shallots. The oysters themselves are smaller than average, but the toppings add to the flavors, totally makes up for the size. And it's a $1! So whatevs, still a pretty great deal. <br>-$3 grilled beef skewers: these are sooo tasty! A little greasy though, but it's the perfect appetizer. <br>-$6 spicy shrimp rolls: fresh and so delicious! They dress it roll with eel sauce and garnish with spring onions & sesame seeds, so simple but so good. It's called spicy but really mild. <br>-$10 truffle tuna: raw squared cut tuna pieces on a bed of avocado, comes with chips. I can't help but think I'm eating almost like a dip, but healthy! It's awesome. <br>-$5 Moscow mules and rose glasses: amazing price! I love their extended Moscow mule menu, there's 5 different options to choose from. My husband went with the Jalapeño and I believe classic one, he loved both! <br><br>We took advantage and got all the HH items. In addition, I had to get my salmon skin fix, so we ordered one 8 piece roll to share. It was so bomb! I've had enough salmon skin rolls to tell if one is good quality or not, and I'd go back to this place and order this roll again!! <br><br>Service is amazing, our waitor was a bit slow to check up on us at the end of our meal but about half the restaurant got filled up within that last 10 mins..so can't blame the guy! Overall, I love this place, def a new date night spot for those sushi enthusiasts.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QOLs4hVDCCqbRlcaRVR6sw/348s.jpg", "caption": "$1 oysters"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GgU10ioQ5tQ7mwRag8MKQA/168s.jpg", "caption": "Truffle tuna"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7H9akm3mKOgXwq0RN31kCg/168s.jpg", "caption": "Top: happy hour spicy shrimp roll Bottom: salmon skin roll"}]}}, {"review": {"des": "Every aspect of this concept holds up to its hype. I am so excited to have discovered this amazing place. Michael, the GM, went out of his way to stop by and check on our table. Was friendly, engaging, and so helpful for providing my friend and I some suggestions for our evening out. I'm new to Chi, and it was incredibly refreshing to chat with someone who knew their way around the city. Per his recommendation, we actually swung by the Franklin Room next door for an after-dinner drink and a live Jazz band. It was perfect! <br><br>I highly recommend this place to anyone and everyone!! They have the best sushi I've eaten in a long time, and the barbecue skewers were immaculate. Will be returning many, MANY more times!", "pics": null}}, {"review": {"des": "We were in the area and in the mood for some Asian, so we decided to give it another shot. <br><br>Let me explain this place to you in one picture: shitty and overpriced <br><br>The seared wagyu appetizer consisted of six shriveled, paper thin slices of \"wagyu\" for a whopping $14+. Ugh", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Tym59A5leLWGo40mjwoVRQ/348s.jpg", "caption": "Pitiful seared wagyu. Seen here after my friend and I each ate a slice. It only came with 6 tiny pieces of \"wagyu\""}]}}, {"review": {"des": "A friend and I went in for a late dinner after an extended happy hour and enjoyed the food! My friend has been to the restaurant before, but it was my first time. We ordered and split an order of the seafood ramen, barbecue bar shrimp, and spicy tuna roll. Definitely more food than we needed! <br><br>The ramen was a perfect comfort for the cold weather! The shrimp was good, but my friend said he had the black pepper shrimp on a previous visit and preferred that. If you're trying to decide between the two, you're welcome! The tuna roll was good too, not any different than your usual spicy tuna roll.<br><br>Service was great even though we walked in at almost closing. It was very appreciated!", "pics": null}}, {"review": {"des": "Great service!   Andrew took awesome care of us!  Enjoyed the craft cocktails. Great poke appetizer. Great decor. Sushi excellent. Great dinner start to finish!", "pics": null}}, {"review": {"des": "Ok, I'm rating this a 3.5.  Not quite a 3... not quite a 4.  I've heard so many good things about this place, I was slightly disappointed that it was not up to par.   I started off with the a cocktail, their skinny geisha which started off the experience just right. The restaurant has a swanky urban feel and they were playing some good old school r&b.  Once my friends and I started ordering I only had high hopes.  We started off with an overpriced dish of calamari which featured a sweet and sour sauce and side salad.. it was ok, combination of sweet and sour was new and different.  We ordered the black rice sampler which features their dragon, Hokkaido, spicy tuna, and Devon roll.  These were all quite delicious!! I think it was the black rice.  We thought the Hokkaido was so good we ordered it again but in white rice, which was just mediocre.  We also ordered the shrimp tempura and Clifton rolls which were pretty good.  <br><br>Lastly, we ordered the pumpkin mochi cake which is why I bumped this review to a 4.  It actually doesn't taste like pumpkin but tastes more cinnamon-y with a layer of mochi cake around the ice cream.  Also ordered the ice cream bar which was just frozen coconut ice cream on a stick.  <br><br>Wouldn't necessarily recommend this place for a go to dinner spot.  Possibly happy hour though.", "pics": null}}, {"review": {"des": "The food was underwhelming. We love sushi and have a few local spots we like but this place won't make the list. They tried so hard to make the rolls good and added exotic foods to the rolls, but it didn't work. Suggest you go to a traditional BBQ or sushi place. Only saving grace, we had great service.", "pics": null}}, {"review": {"des": "First off.....the truffled tuna.....MUST HAVE! My boyfriend and I ate here for late lunch recently and we were very pleased. The drinks were delicious, I had a classic union mule and my boyfriend had the saki. Along with the tuna, we had the sliders (in all 3 flavors), beef skewers; and some sushi rolls. I have to say I didn't care for the pork belly slider (but I don't like the texture of pork belly so that's my opinion); but everything else was absolutely delicious. The flavor combos were well thought out and sophisticated and the atmosphere was professional and enjoyable. Well deserved 5 stars! I would say my favorite dish of all was the truffled tuna, I could just eat that all day. Great place to go for happy hour!", "pics": null}}, {"review": {"des": "We were craving for a good sushi restaurant with an atmosphere. This modern, unique and busy restaurant offered that. We lucked out getting seats. The food, drink and service were great. We had sashimi and random rolls. They were fresh and delicious. On our second visit, we had oysters and various BBQ. Our favorite were the oysters and beef filet. Next time, we'll try the black rice and ramen.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7O-iLvkZNI448bGqWj2PdQ/168s.jpg", "caption": "Barbeque Bar Sampler"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KcC4RScrOMy-1p_THU7UQQ/168s.jpg", "caption": "Happy Hour Oysters, tasty"}]}}, {"review": {"des": "Went there for dinner and drinks.<br><br>The sushi was outstanding and I like that fact that you can order half rolls. We ordered pretty much one of everything. <br><br>The pumpkin mocha cake was great too.<br><br>Great service, fantastic sushi,  great dessert and reasonable. <br><br>Super trendy decor", "pics": null}}, {"review": {"des": "Delicious food, I'm a vegetarian and there were several options in the sushi rolls that were unique. I tried my friends rolls and thought the spicy tuna roll was delicious also. Both our drinks were unique and tasty. I had Buried in Thyme and companion had something with strawberry flavor forget the name. We sat at bar and got to watch them preparing food", "pics": null}}, {"review": {"des": "This place is pretty dope. Great atmosphere, and decent sushi (but not amazing). The yellowtail was good, the king crab handroll excellent, the roll in mustard greens good, and the uni not too good. Overall, I enjoyed it and will return especially for happy hour!", "pics": null}}, {"review": {"des": "Best mussels on earth! Must try this place. It will be a long lasting delicious memory in your dinning journey. Loved everything!!!", "pics": null}}, {"review": {"des": "Good mix of sushi and BBQ. They also offer various appetizers, noodles and rice. I think their rolls and hand rolls are the best! Their happy hour is of great value. Shrimp roll and beef skewers are must-haves! We love the decor of the restaurant. It feels hip hop and energetic.", "pics": null}}, {"review": {"des": "This is one of my favorite sushi spots and the best thing they do is black rice sushi. Good place for a date. Loud rap playing! Expensive but worth it and good service", "pics": null}}, {"review": {"des": "I have been at this place twice so far and I am not planning on going back. The first time we dined in and had a pretty good experience. The food was fresh, carefully prepared and the menu had some nice choices. The second time we got takeout. They said that the order would be ready in 45 minutes so we came to pick it up an hour later just to be on the safe side. When we got there the order wasn't ready and we had to wait FOR AN ADDITIONAL HOUR AND 20 MINUTES! I thought that I would pass out in the middle of the dining room from starvation! If we knew that this is going to take this long we would have ordered from a million other sushi places that are within walking distance. This is completely unacceptable and they forever lost me as a customer.", "pics": null}}, {"review": {"des": "Just an update- I have become a loyal patron and am obsessed with the Truffle Tuna! Although, I have never had anything bad!", "pics": null}}, {"review": {"des": "Eh...their happy hour has changed since the last time we were here. we were hoping to get some rolls but these were not on the HH menu. We only got the beef skewer and dozen small dressed oyster which were only okay. Their HH sake and mules were good. Staff was very nice and checked on us well.", "pics": null}}, {"review": {"des": "I came here with a coworker around 5:30pm on a Friday.  <br><br>The interior was very nice and had a casual, yet trendy feel.  The inside is dimly lit, but it added to the cool vibe and atmosphere.  There's several tables throughout the interior, but there's also seating at the bar and the robata grill.<br><br>We mainly ordered only happy hour specials: palomino mule, horsefeather mule, shrimp tempura roll, beef filet skewers, prosciutto-wrapped scallops (regular menu), oysters.<br><br>Our food came with complimentary edamame which was seasoned with something similar to what tastes like cool ranch doritos.  It was a nice starter to our meal.<br><br>Both mules were very delicious and although not seemingly very strong, you could tell the drinks were not watered down.  These mules are typically $13, but are $5 (limit 2) during happy hour... and they are well worth $5 each.<br><br>The shrimp tempura rolls also tasted good.  There could have been less sauces on top, but it wasn't enough to take away from the tastiness of the rolls.  I liked too how the shrimp tempura was not overly skinny inside the roll too.  This is a solid value at $4.<br><br>Oysters were $1 each so I loaded up on a dozen.  The additives on top of the oysters were a nice taste and decorative touch, but overall the oysters were a little small.  They still tasted pretty fresh and $1 is a great price for what you get.  <br><br>The beef filet skewers were pretty soft and moist and although not \"melt in your mouth\", they aren't too far off!  Once again, this was a solid value since each skewer is only $2.50 each.  The other skewer we ordered was not off the happy hour menu, the prosciutto-wrapped scallops.  These were very good... the scallops were cooked well and they were soft.  The prosciutto added that extra layer of richness that really concluded in great mouth-feel, taste, and texture.<br><br>Service was prompt, fast, and attentive and food came out pretty quickly.  Our water was also filled whenever we were low.<br><br>I really think is a good place to come for happy hour and the value/price of the happy hour special foods is great for what you're getting.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_S-yi7C3DP3jiq9hqTPiMg/348s.jpg", "caption": "A dozen oysters"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7xBFT1Ez6L3AZ3FzaBbNiw/168s.jpg", "caption": "Top left to bottom right: 4x beef filet skewers, 2x prosciutto-wrapped scallops"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hkjMgs3BUbhAliK6sTzjnA/168s.jpg", "caption": "Horsefeather mule"}]}}, {"review": {"des": "Yummmyyyyyyy. My favorite sushi place in Chicago because of their black sushi rice!!! Always make a stop here when I'm in town.", "pics": null}}, {"review": {"des": "I have dined here for both lunch and dinner. They are willing to make all of the rolls without rice (wrapped in seaweed or stuff with cucumber) for a more carb friendly options. There are also lots of vegetarian options for rolls! Great happy hour specials daily (5-6:30PM) and daily specials (half off handrails on Thursday!). Will continue to visit again!", "pics": null}}, {"review": {"des": "Nicely decorated with Chinese and Japanese elements. Food was served really fast on a Friday night. It's a decent trendy Asian Fusion place, and it's well lit so that I can actually see my food and people (unlike Sunda where it's as dark as a nightclub). I liked everything we ordered: duck drums, skewer sampler and sashimi plate. <br><br>*If you order the tuna tartare, expect it to be a single-bite size.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iLq69V9GqwnztcFMo6dvbQ/348s.jpg", "caption": "Ice cream"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NQMtOHJaxvLu-LQYkAwqeg/168s.jpg", "caption": "Tuna tartare"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/70vyxNCA-b3G16g10-lTaQ/168s.jpg", "caption": "Sashimi"}]}}, {"review": {"des": "Come here for happy hour! Oysters are amazing and different most of the time. Super delicious. The Old City roll is good but not great, the leaf they use was too bitter for me. Maybe if it was wrapped twice and not four times. Hand roll was good. Nothing special about the black rice. I wanna try more things though! Service was also great. I wanna come back whenever I visit Chicago again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8t0SEVrlaJ03XfLulDIHQw/168s.jpg", "caption": "Half of the old city and the marinaded salmon handroll"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SUIUgQ5p_8pcOSrqTlPXjQ/168s.jpg", "caption": "Happy hour oysters  delicious!"}]}}, {"review": {"des": "Pretty good unique sushi place! <br><br>My friend and I got seated at the bar right away on a Thursday night. <br>-Black Rice Sushi Sampler: Great option to try a few different rolls! We liked all of them, but the Dragon one was our least favorite. The other three were great to try.<br>-Oysters: AMAZING! I don't like oysters normally, but really liked whatever they put on theirs here! It is definitely pricey though for oysters. I'd come back during their happy hour for the $1 oysters.<br>-Toro: It was a special for the night and tasted alright! Not as good as I expected and I'd probably try something different next time, but I don't regret ordering it.<br>-Truffled Tuna: Unique and pretty good. It's a good appetizer and has that truffle flavor in the tuna and also in the chips that are served with it.<br><br>I would give this place a solid 3.5. It would be a 4 if it weren't so expensive and also there were 2 small fruit flies flying around that we saw around the sushi bar......Nothing bad in the food, but they should watch out if there are any more.", "pics": null}}, {"review": {"des": "GET THE SHRIMP TEMPURA! (That's it!) <br><br>Quick service! Great atmosphere! If I lived here, I'd come back every day:)", "pics": null}}, {"review": {"des": "Not as impressed the second time around, but still great! I still love the ambiance and the vibe, which feels trendy and lively! The cocktails are DELISH with a wide variety of gin, whiskey and other liquors! <br><br>However, the food just didn't wow me as much during this visit. It's still great food, but there are others places that I would head to first for sushi. The black rice sushi is still something unique that I've never seen before so it's nice to give a try, but I still am drawn to standard white rice sushi more. The food off the grill is tasty and served in smaller portions, which gives you an opportunity to taste a lot! The noodle bowls/ramen are tasty, but once again their are other places around that specialize in ramen that I prefer to go to for this. <br><br>Also, their shrimp tempura rolls were taken off of the Happy Hour menu... wah wah <br><br>Altogether, I definitely still enjoy this place, but I'm just not raving like before!", "pics": null}}, {"review": {"des": "Yes yes yes. Food is outstanding and service is attentive. Diverse menu and the best selection of drinks you'll find at a Japanese restaurant. King Crab Leg dish is absolutely nuts", "pics": null}}, {"review": {"des": "3.5 stars. I had catering from this place once before and loved it. When we went in for dinner, I found their quality uneven. For example, the beef tongue skewer was delicious and melt-in-your-mouth fatty. But one of our two scallops was badly oversmoked. I was disappointed to see the mushrooms is the mushroom rolls are now deep-fried (although, admittedly, that was also tasty) and the Devon rolls were a delight. The cucumber roll, on the other hand, was sadly watery and mushy. The spicy California rolls were well-beloved, but the old city market disappointed my friend. <br><br>On the dessert side, the pumpkin mochi cake was AMAZING. Definitely the best thing we ate. Warm pumpkin bread surrounds a soft cream cheese mochi center. Genuinely so delicious!<br><br>The happy hour $5 miles were fairly substantial and a good deal. They have a nice variety, not (as I feared) just the class version. The whiskey sour was one of the best I've had in my life - it was smooth as silk. <br><br>We had some minor service issues as they were very slammed for a weeknight, but they quickly fixed their mistakes. I would gladly take a group here for happy hour (especially since they can accommodate almost any dietary restriction). Otherwise, I'd probably do drinks, a light dinner, and more if that amazing dessert!", "pics": null}}, {"review": {"des": "This place is amazing.  We ordered black rice rolls and the bbq sampler.  The drinks were fantastic and the service was above and beyond.  Go.  Now.  Hurry.", "pics": null}}, {"review": {"des": "Normally come here once a year because I'm not always in the mood for this style of sushi rolls. You know what I'm talking about - the ones with cheap fish, imitation crab, tons of sauce on top, and crunchy fried stuff. <br><br>But OK, one Friday I was feeling like having some cheap sushi with a date. We called ahead, and got seated promptly at the bar upstairs. We waited patiently for our menus. Two minutes go by and the bartender tells us we can't sit here. We try to explain to him that we were seated here. He denies us service. Oh well, guess bartender don't like us. <br><br>Let's go downstairs and try to get another seat then. We tell the host our situation, and he scratches his head and says he'll find us another table. Twenty minutes go by and there's plenty of open space. Parties that came later than us are getting seated and we're just standing there waiting and waiting like what is going on with the management of this place. <br><br>Until... well nothing happened, we never got seated again. We just decided to get sushi down the street somewhere else. Sushi-ran, Friends sushi, many other options, just Yelp them instead.<br><br>Long story short: waited, sat down, got up, waited, left restaurant without food in belly.<br><br>So this place goes from going from \"once a year\" to \"never\" on my list", "pics": null}}, {"review": {"des": "Food was super yummy! Came during happy hour, had several good deals, I definitely recommend!", "pics": null}}]}