{"name": "velvet-taco-chicago", "reviews": [{"review": {"des": "We've heard great things about Velvet Taco, and decided to give it a try since we were in the area! There was a huge line when we came here and the place looked small so seating was a bit a challenge. You'll have to pounce on the next open area as you see one once you order (or have someone save a spot in your group while another person orders for the group!). However, I think there is upstairs seating so no need to panic completely. <br><br>The tacos were initially a bit on the pricier end, but when you actually receive your order it's worth it. Very unique and equally delicious! I normally order 3 tacos when I do go get tacos, but the portions here were a bit larger than your typical taco joint and 2 tacos were definitely more than enough. A great side to order along with your tacos is the queso! It was so delicious and unique (it had curry in it which doesn't over empower the queso at all)! I just wish they gave us more chips with the queso since we ate all the chips with it and had to throw away all the delicious queso. :(", "pics": null}}, {"review": {"des": "This place never disappoints me whenever I feel like having tacos. And plz keep in mind this place is not authentic Mexican tacos, but they have lots of different styles of tacos. One may say they serve \"Fusion Tacos\". After visiting this place few times, I thought I write a review about it. <br><br>Located in the heart of DT Chicago. Surrounded by many other famous restaurants. They have many different kinds of tacos but being vegetarian, I tried there \"Paneer Tacos\" \"Falafel tacos\" \"Tofu Tacos\" and they were all delicious. <br><br>My personal favorite was the falafel taco as it comes in a lettuce wrap instead of tortilla , which makes it a great option for people who are on diets like Keto diet where every carb counts. This place is always busy, but they do a great job staying in flow. They also have beer and margaritas, but they are ok. What's great about this place is their take on tacos. <br><br>This place has ample seating for small or large groups. So yes go give this place a shot. It will not disappoint.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8snhsxUXx6oKkUItaT-jVg/348s.jpg", "caption": "From left to right  Tofu taco, falafel taco, paneer taco"}]}}, {"review": {"des": "I popped in around 3 pm on a Sunday (what I would consider off hours) and it was kinda busy! I didn't venture upstairs, but downstairs had some communal seating and counter stools. It's a very casual atmosphere where you order up at the register and they call you when it's ready. <br><br>I ordered the chicken tikka, picnic chicken, and pork annatto. The pork annatto taco was awesome and definitely my favorite of the three. The other two came with a flour tortilla, which I wasn't a fan of but the chicken tikka was still a good (and unique) taco. I'd only skip the picnic chicken next time. <br><br>3.5 stars overall", "pics": null}}, {"review": {"des": "So I've been here a couple times.  The first time I came, I was blown away with the chicken Tikka taco and told myself I would definitely be coming back to get that again.  Fast forward 1.5 years and I finally make it back.  That's the problem.with Chicago, so much good food that it can seem like a waste to go to the same place twice.<br><br>Anyways, time can be a cruel mistress.  If I had written this review after my last visit it would have gotten 4 stars.  Especially considering this is one of the few taco joints in Chicago that serves flour tortillas (blasphemy I  know, but I'm from Texas and everything is flour down there).  Maybe my palate has changed or the quality has gone down, I can't really tell.  But this ended up being a trip of disappointment.  We came with high expectations, and ordered two chicken Tikka tacos, a Nashville hot tofu taco, and a chicken and waffle taco.  <br><br>The chicken and waffle just wasn't good.  The waffle is the \"tortilla\" which was fun, but the chicken had no flavor.  When you add hot sauce then the slight sweetness from the syrup gets overpowered. Overall, just not very good.  The Nashville tofu was just below average as were the  Chicken Tikka tacos.  The Chicken Tikka I enjoyed the texture of the food, but the flavor just didn't impress me.  Such a disappointment considering the expectations we had coming back. <br><br>That will be my last visit to velvet taco.  I'll try to remember it the way it was before we broke up <br><br>Ambiance: 3 stars<br>Service: 3 stars<br>Food: 2.5 stars", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zN8Wo_rBoeCbqkI_nzOy9w/348s.jpg", "caption": "2 chicken Tikka tacos, a chicken and waffle, and nashville hot tofu.  Honestly, disappointed with all of them :("}]}}, {"review": {"des": "Still, hands down, my favorite taco place. <br><br>My friends and I came here after a night out (move over Chinatown and McDo's). I don't know why we didn't do this sooner. <br><br>The place was busy but nothing crazy. I ordered the Kobe or wagyu burger taco and the shrimp 'n grits taco. The burger taco was really good but the shrimp 'n grits one was AMAZING. <br><br>This place is worth going to at any time of the day.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FvhEf2YBlggxwqJxArT-_w/168s.jpg", "caption": "Left to right: burger taco and shrimp 'n grits taco"}]}}, {"review": {"des": "Three words: Spicy Tikka Chicken. <br>I've had my fair share of tacos because it's one of my favorite foods.. but I never once thought I would ever have tikka chicken on a taco. But man, it was SO BOMB. I know some reviews said that the tikka chicken taco was really spicy, but coming from a girl who can't handle much spice - I thought it wasn't too bad!<br><br>I heard this place is a great drunk spot and I could totally see why. They are open til 3AM and if I lived in Chicago, I'd be here after every night out!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5EQ-fXk4-xpOgmpoBg3ykA/348s.jpg", "caption": "2 Spicy Chicken Tikkas on the left! MUST HAVE!"}]}}, {"review": {"des": "Open late, this was my first stop on the food journey I had in Chicago. <br><br>Quick service and a delightful variety of tacos and other dishes to choose from. I love how they take the taco base and blend it with all sorts of international al flavors. <br><br>My two favorites were the burger taco and the tiki masala taco. Ohhh the masala taco was so gooooddddd. Oh also the elote is a good starter. <br><br>With two tacos and the elote, which I shared, I was more than stuffed. <br><br>The place has a cool vibe to it and the staff is really friendly even late into the night.", "pics": null}}, {"review": {"des": "Looking for pizza or a hot dog, we came upon this place. Glad we did.<br><br>The taco selection is unique and the menu on the wall is simple to understand.<br><br>They have vegan options which was a plus. I chose the falafel taco and was not disappointed. Delicious and hot the spot.<br><br>My friend chose te annatto shredded pork with a unique tortilla. She liked it and presentation was on point.<br><br>If I am ever in Chicago again, I will definitely visit this place.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dC67LgxfqQixbWVzFHQP-g/348s.jpg", "caption": "Falafel taco and Annatto Shredded Pork taco"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UQ6XzPeEYuhMTOgaY-mIfw/168s.jpg", "caption": "Excel Red Cream Soda"}]}}, {"review": {"des": "Visiting Chicago for a conference there were plenty of places within walking distance of the hotel. I of course looked up the taco options and much to my pleasure I was only a few feet away from a this highly rated gem! There were a variety of options and distinct flavors on the menu. I opted for the tikka chicken taco... and it was great!<br><br>I also had a margarita and we enjoyed eating in at the communal first floor tables. We didn't head upstairs to see what the seating offered up there, but there was plenty of space for us that day for our happy hour drink and taco!", "pics": null}}, {"review": {"des": "I'm giving this place 5 stars simply for the quality of the food. We came here on a busy weekend afternoon and there was a decent size line to order. There are a ton of options, many being unique, to choose from. Mostly tacos, but also some other things. I ended up ordering a chicken& waffle taco and a steak taco, and we got chips and queso. <br><br>The price of the tacos compared to the size of them is a bit steep, but the taste makes up for it. Both of my tacos were awesome! Perfect combination of flavors and the steak was really tender! The queso was delicious as well! I only wish they provided more chips, because we still had half of our queso left when we ran out.<br><br>Overall, I am satisfied with my experience here. Everyone was friendly and they have just enough seating to accommodate a fairly large crowd. The tacos are delicious! I will definitely return, but maybe not when I'm starving, as I don't want to spend $25 to fill me up.", "pics": null}}, {"review": {"des": "These fck'n tacos are so fck'n on point. These velvet tacos go so fck'n hard!!! Banged out a 4 & 6 off the menu and literally can't contain my enjoyment. May come back twice in the same night. Fck'n good!<br><br>Update: More taco goodness tonight... Holy fck'n shyt!!! Upstairs is fck'n on fck'n point!!! Tacos on fck'n on point, view on fck'n point. Velvet taco does no wrong. 5 4's, 1 5 and 1 6. Bring on the velvet fck'n tacos!!!<br><br>Update 2: Over a year later from my last Velvet Taco binge I am back! Holy fck'n molly they are still as good as ever! Back for my regular pack: 1 ea of the 4, 5, & 6 tacos! Velvet taco you are truly fck'n amazing!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/g2T3rckTcN4lxs2eprHVaA/168s.jpg", "caption": "Fck'n view with fck'n tacos"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/D7YgA7UKjIl3vU2__MJ6og/168s.jpg", "caption": "Back for round fck'n three... Tacos on tacos on tacos!"}]}}, {"review": {"des": "Looking for a tacos but with a twist? Well, this place will fulfill your desires of yummy tacos that are a bit different from the traditional tacos.<br><br>Variety variety variety is what I have to say, this place has a HUGE variety in street tacos. Chicken, beef,pork, vegetarian, fish. Their not just your regular tacos they have spicy chicken tikka, buffalo chicken, fried paneer, falafel, Cuban pig, flank steak, Ahi poke and many more!<br><br>We ended up ordering the spicy chicken tikka, fried paneer and the falafel tacos! And they were DELICIOUS. I didn't think I'd necessarily like the flavor because it might be too over powering, but it actually was not and instead it went beyond my expectations. We also, got a slice of their red velvet cake with caramel drizzle and oh my god. It was super moist and not overly sweet. <br><br>This place is a very casual, order and pick up kind of place. If you're looking to grab a quick bite with friends, family coworkers, then you need to check it out. It is also price fairly decent. I would go again and again!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FSb4NZiffElOU8nVA9yj1w/348s.jpg", "caption": "#3. Spicy Tikka Chicken Taco, #5. Fried Paneer Taco, #6. Falafel Taco and red Red Velvet Cake"}]}}, {"review": {"des": "Velvet Taco takes drunk food to the next level with their amazing homemade tortillas. <br><br>I must have walked past here a million times before finally venturing in around 3 AM one Saturday night. Open until 5 AM, Velvet Taco was PACKED! Like, the hard to breathe and move and see the menu kind of packed. But the line moved quickly, and the tacos -- while definitely funky -- were worth the wait.<br><br>I ordered the #2 rotisserie chicken and #11 grilled flank steak. The steak taco's ingredients sounded legit, but neither taco was very true to the Latin root of the food. It was kind of like having a sandwich but wrapped up in a tortilla. And overall, I was a fan, but mostly because of their warm, fluffy handmade tortillas that rivaled the ones my future mother-in-law makes with her recipe straight from Mexico. And while initially I was scared by the $5 price tag, these tacos are HUGE.<br><br>If you're in the area, love a good tortilla, or want some quality late-night food, Velvet Taco is not a bad choice.", "pics": null}}, {"review": {"des": "Great concept but not so good location. I was referred to Velvet Taco by my husband. This restaurant offers options for all foodies (i.e. veggie, gluten free). The can be ridiculous so have your order ready once you get to the register. The chicken tikka masala and paneer taco were my favorites. I also hand a kick a** margarita which was delicious. You can order it salted or unsalted.", "pics": null}}, {"review": {"des": "Coming from nyc I can't say this place was good. I barely finished my food and my friend couldn't finish hers either. What i did like was the margarita!", "pics": null}}, {"review": {"des": "I've been coming here for years and the food has been consistently delicious and unique . The tacos are not basic and definitely worth the cost. My faves are the paneer and fish n chips.<br>Tonight the cashier did not take my order correctly and I was one taco short. I notified her and everyone behind the counter immediately sprung in to action and were absolutely amazing. Thank you so much for the wonderful service and great attitudes.<br>P.S if the oyster taco is still a special try it. My husband raved about it.. heads up it's a bit spicy.", "pics": null}}, {"review": {"des": "I will say this is my favorite \"non-authentic\" taco place in Chicago so far. The food is so delicious! I am on a mission to try every single one of their menu items. My favorite so far has got to be the chicken tikka taco. The sauce is such a nice complement to the texture of the chicken and the Indian fusion gives this taco a nice spicy kick. Their Crisp tots + egg side is also a must get (if you love tater tots, but who doesn't?)They have vegetarian options too- I'd recommend the fried paneer taco!<br><br>They have a \"main\" seating area by the counters where you order, but if it gets crowded, there is also an upstairs. I've always been able to snag some seats on the main floor though!<br><br>I'm lucky that I live close enough to come here whenever I have the craving, but this would also make a nice quick place to grab a bite to eat after a day of shopping, or at the beach, and even a night out. It's also great that they're open late (until 3AM)!", "pics": null}}, {"review": {"des": "Fun fact, come here for the margs, surprisingly very good. They are frozen though, so maybe don't overdo it if you're not into that. <br><br>Food wise, the menu is huge with tacos that are veggie, meat, seafood and more. You could literally find anything to make you happy. They also do a special taco of the week, which usually are very interesting and tasty. <br><br>In the appetizer section, the tots are really good and come with a delicious sauce. <br><br>For tacos, I've had the buffalo, the Cuban, the chicken tikka masala, and a couple more over the different times going. They are all delicious and cooked very well. The tacos are on the smaller side, which is good so you can try more. The tastes of each taco are actually very authentic over the different styles, so it makes it even more fun to eat.<br><br>Pretty good spot for a quick bite to eat when it's not busy. Come dinner time or at night, it will be packed.", "pics": null}}, {"review": {"des": "Tried this spot late after a concert. Our Airbnb was down the street, so it was very convenient to walk here. It was very packed inside with a bar crowd, so be prepared for that, but they do have a second floor with more seating. As first timers, we tried a variety of tacos and the red curry queso. All tacos are fusion inspired, not your typical authentic tacos. I went with the shrimp and grits taco and my boyfriend got the Kobe burger and angus brisket. We enjoyed our tacos and queso, although the prices are a bit high. It came out to around $30 with fountain drinks included. <br><br>If you're looking to try tacos that's aren't your typical tacos, give them a try", "pics": null}}, {"review": {"des": "Alright tacos, but rather on the expensive side for what you get. Went in here the other night at like 2:00am. Ordered 3 chicken tacos. 1 was the normal way with all the fixings. It was $4. The other 2 tacos were only chicken and cheese. Those were somehow $4.50....Obviously I didn't say anything, but how does that even happen? <br>Probably won't go back anyway, but not because of the $1", "pics": null}}, {"review": {"des": "I am still torn over weather to get 2 or 3 tacos. I always end up hating myself halfway through the third one because each taco is like a American food journey. Pretty filling to say the least. If you are coming here to get Mexican tacos you are in the wrong place. These are American tacos. <br><br>My highlights were Cuban pork taco, which contains every form of pork paired with delicious mustard and cheese, and the Kobe beef bacon burger taco. <br><br>Price point is a bit high, but the location, vibes, and late night availability makes this one of my favorite spots in Chicago.<br><br>Pro tip. Eat upstairs!! They even have a microphone thing to holler at you if you don't want to wait in the congested downstairs area.", "pics": null}}, {"review": {"des": "Chicken Tikka Taco was life-changing. <br>That's about it.  <br>Maybe they should have someone to run out & wipe tables in between customers, but that's my only issue. <br>Sooo good!! (I'm reliving it)", "pics": null}}, {"review": {"des": "I know it's not authentic, but best tacos I've ever had! If I could eat here everyday, I would. My favorites are the Kobe Bacon Burger and Buffalo Chicken tacos. The margarita is also very good! Didn't really like the red velvet cake though; it had weird texture. I like the vibe and it's always my go-to place for tacos and margs!", "pics": null}}, {"review": {"des": "Great place to come for a late night snack! The queso here was AMAZING. I love that the added the coconut milk in it. Made it so unique! <br><br>The only down side is that they get pretty busy so sometimes there is no where to sit or it will take a long time to get your order... or someone else will take your order (late night people..) <br><br>Definitely will be back here to try more of the tacos. I had the spicy chicken tikka! I love how they put their own spin on an ordinary dish. <br><br>There is a reason they are so busy.", "pics": null}}, {"review": {"des": "One of my all time favorite taco places in Chicago delicious creative options.  My favorite is the picnic chicken, the slow roasted angus brisket and the fried paneer tacos. The staff is friendly and quick. Extra seating upstairs great vegetarian options. Fair prices and lots of cool beverages. The rotisserie chicken and the elotes are awesome!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8xB9IiTBZfqpbK3EgCwFGQ/348s.jpg", "caption": "Delicious vegetarian options"}]}}, {"review": {"des": "We just got their queso to try. It was good, but nothing necessarily special about the queso itself. Will need to come back and try more parts of their menu!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mu8LYlaYL8-xjD6m6Fl7vA/348s.jpg", "caption": "Red curry coconut queso"}]}}, {"review": {"des": "We came to Velvet Taco at 3:30am and this place was packed! They serve unconventional tacos which are essentially favorite/classic foods from non-Mexican cuisines on a tortilla. It's a nice twist to Americanized Mexican. Food came out quick, and food was delicious! Staff was super kind and offering suggestions based on what my friends and I liked/didn't like. Will definitely be back if we're back in the area!", "pics": null}}, {"review": {"des": "YUM! Pleasantly surprised at how much I enjoyed their tacos. Diversified, ethnic inspired menu. Don't go looking for \"authentic\" here because this it is not.<br><br>The spicy chicken tikka is a must, creamy buffalo chicken, decent flank steak (a bit tough) and good Cuban taco. Prices are higher but it definitely includes the experience. <br><br>Besides the food, love that they're open late but didn't enjoy being shoulder to shoulder just to put in our order. Nevertheless, diners were friendly when it came to seating. So I guess it's that organized chaos kind of deal. <br><br>Only problem were the cashiers. Can you say smile?  Then do just that. Okay, maybe the long hours has got you down but you don't gotta bring us down with you. At least be polite! Our cashier didn't even look at us, even when he spoke. <br><br>Bottom line, would goback for the food without the expectation of a decent customer service.¯\\_(ツ)_/¯", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/m6lc7mGZiBvNZZBmqIpLIA/348s.jpg", "caption": "Spicy Tikka Chicken Taco, Buffalo Chicken Taco, Cuban Pig Taco and Grilled Flank Steak Taco!"}]}}, {"review": {"des": "I came here for some late night tacos and receive terrible service. I placed my order at the cash register and as I was trying to pay for my order with mobile pay, the cashier immediately said it's not going to work. So I asked if I can try and he said sure and rolled his eyes. My mobile pay did in fact go through and the cashier handed me my printed receipt. I walked to the side to wait for my order and I hear the cashier saying \"Annie, your shit doesn't work.\" I was so offended and confused so I proceeded back to the cashier and asked \"What do you mean it doesn't work? You gave me a printed receipt and I also have a virual receipt on my phone from the transaction.\" I showed both to him and he then replied with an \"Oh.\" I was so upset because of the way he said it and how disrespectful he was towards me. Then, another person that worked there which could have been a manager apologized to me and said \"sorry, it's been a long night.\" He handed me a card that says complimentary slice of cake during next visit which meant nothing to me because I still didn't receive an apology from the cashier that gave me really bad attitude. Then, my friend who was with me asked for a water cup and proceeded to grab the cups that was right in front of her and the same cashier told her \"maybe you shouldn't touch things you're not supposed to\" in a very rude tone. The service we received here was awful and unpleasant. I don't think it's a justifiable reason for him to act like that towards us just because he's had a long night. <br><br>The line for tacos here on a Saturday night was very long. We wait at least 25-30mins just to place our order. I ordered the spicy chicken Tikka, Cuban pig and elote. The spicy chicken tikka taco was really good and the cuban pig taco was mediocre. I really enjoyed the elote as well. <br><br>If it wasn't for the horrible service, I would consider coming back here.", "pics": null}}, {"review": {"des": "I walked by this place a few times and finally looked it up on yelp and figured, why not?  What an amazing place! Very straightforward: Get in line, order your tacos, pick up at the counter, and good to go.  I ordered the Tikka, Buffalo Chicken, Spicy Tofu, and some other taco.  They were phenomenal.  The place was absolutely packed and the staff was cranking, but some guy (I'm guessing the owner or manager) was just conducting the chaos like a maestro.  Nobody behind the counter was panicking despite dozens of tickets piling up and a line to the door.  Basically: Great service, AMAZING tacos, and nice little beer selection as well. As crowded as it was i was still able to find seating.  If i could have i would have tried 10 more tacos, they were that good.", "pics": null}}, {"review": {"des": "Velvet Taco, right at the start or finish of rush 1110 N Rush depending on your perspective. Three vegetarian options of tacos. 1) the Nashville, comes with crispy tofu, slaw, pickles on a tortilla. Very tasty.  Fried panned, is probably top of the line if you're into cheese.  Just the right cacophony of spices and flavors to make a very tasty taco.  Then there's the falafel taco served on a lettuce wrap, again, very nice. They have a great margarita and a decent selection of beer.  Best value on Rush.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SBFqFgtgttLj_zsSjn9AFw/348s.jpg", "caption": "Kick Ass Margarita"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JjwPGTAlPXHnaMP2RacT8Q/168s.jpg", "caption": "Brunch Menu"}]}}, {"review": {"des": "Maybe it's because it's late and we've had a few drinks but looking at the other reviews maybe it's not; this place is yummy!! We tried a variety of tacos; beef, pork, chicken, shrimp as well as tater tots and frozen margaritas. It was all great! Judging by the crowds, we aren't alone in our opinions. I mean, hell, It's open until 5 am and it's called the Velvet Taco. What's not to like?", "pics": null}}, {"review": {"des": "A great place for (late) breakfast, lunch, dinner and late night munchies.<br><br>I came here on a Friday afternoon for some tacos, but I got so much more than expected. I wasn't ecstatic about paying more than $3 for a taco, but after biting into my tacos, it was worth it. I got the Crispy Tikka Chicken taco. This was my favorite taco. It has rice and tikka chicken, which was a lot more spicy than I expected. I also got the rotisserie chicken taco. It had a lot of chicken topped with corn and salsa. This one was less impressive than the tikka chicken.<br><br>One taco with satisfy your hunger, but leave you wanting more. Two tacos is a lot!", "pics": null}}, {"review": {"des": "Good tasting tacos, expensive, but good. I've ordered their buffalo chicken taco with shaved carrots which is very crispy and the buffalo sauce has a kick. I've also tried their cuban pork which has  pulled pork, ham, gruyere cheese and peppered bacon on a corn tortilla. The elote tasted better in the summertime for some reason.  Went back recently and it seemed to have an odd taste that I can't describe. My coworker thought it tasted good. This restaurant is nothing like your average Mexican taco joints so please don't expect it to taste or look the same.  The location is small but there is space upstairs where you can do some people watching.", "pics": null}}, {"review": {"des": "I like Velvet Taco. It's fast but a lot more interesting than fast food. They offer a lot of choices of mains and side. I felt the food was tasty but maybe a little heavy on sauces. <br><br>The room is clean, bright and cheery. The front windows offer tons of light. There is an upstairs area to eat if it gets a bit too crowded. <br><br>The location is great to stop in for a quick bite. There is limited street parking but is great for foot traffic. Don't forget to check out the WTF - Weekly Taco Feature!", "pics": null}}, {"review": {"des": "I love this place!!! They open late, which is a huge plus given the downtown location. And the tacos are all so delicious! I've tried almost everything on the menu. The fish and shrimp taco (14&16) remains my all time favorite. The Nashville tofu taco is a must for any vegetarians. And their crispy tots is a fun take on the standard tots, brings back memories. <br>The one thing I wish they can improve on is their margarita. It's just not very tasty. But they have so many bars around the area, this is more like a food stop.", "pics": null}}, {"review": {"des": "Such a unique menu !! Affordable prices and yummy tacos that I wish they had this place in other cities . Loved the chicken tikka and paneer taco", "pics": null}}, {"review": {"des": "Based on my experience, I would say it's more like 3.5 stars. I didn't think I'd be able to find a place more expensive than Antique Taco when it comes to single tacos, but that day has come...<br><br>It's a very fun and vibrant atmosphere with two levels. I only got to see the first level, and it's mainly communal tables. You might even converse with your neighbors like we did. The giant menu is located straight ahead on the wall when you enter. There are a lot of choices, but I ordered two tacos that were a decent portion.<br><br>ENTRÉES<br>- #10 Kobe Burger with Bacon ($4.95/taco): The burger part threw me off, but it's a taco with half a burger patty, peppered bacon, smoked cheddar (which I omitted), lettuce, onion, tomato, pickle, velvet sauce, and flour tortilla. This was nothing mind-blowing, and I'd rather try the other menu items. <br>- #11 Grilled Flank Steak ($4.95/taco): It comes with portobello, white queso (which I omitted), grilled red onion, mex-oregano, and corn tortilla. This was my favorite of the two because it was flavorful, and I'd definitely order again. The ingredients worked well together, and the steak was cooked just right.<br><br>Service was pretty quick in terms of ordering. There will likely be a wait when getting the food, which you retrieve at the counter.", "pics": null}}, {"review": {"des": "Full disclosure: I've only been here after 1am after nights of bar hopping. Nothing beats Velvet Taco after a night out. I've gotten a party bus to chant \"Tacos Tacos\" after I proposed we go to Velvet Taco to end the night. If you want a true Velvet Taco experience, go at 2am.", "pics": null}}, {"review": {"des": "Of the whole weekend, this may have been my favorite foodie stop in Chicago!! It was at the top of my list upon arriving in the city and it didn't let me down! <br><br>You walk into the restaurant and the menu is posted on the wall and then you ordered. It was impossible to choose but I wanted to try two very different tacos so I went with #3.5 picnic chicken & #17 ahi poke. They were both fabulous but the picnic chicken rocked my world. Amazing!! However - the highlight of the meal wasn't even the tacos. It was the red coconut curry queso that you can't die until you've had. the most unique combination of flavors and I have never loved queso more. <br><br>This is such an awesome place downtown Chicago to grab a bite to eat & you don't want to miss it!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5b1m_ixSX8nB-qhzsVpQsQ/348s.jpg", "caption": "Full menu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aZ4RZRA7cZhl-OokHLm54w/168s.jpg", "caption": "Red curry coconut queso"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wumeZHWRMkcj7LZ7tVgefw/168s.jpg", "caption": "Picnic chicken and ahi poke tacos"}]}}, {"review": {"des": "While Velvet Taco has unique taco builds, one must questions how some tacos are even on the menu, such as the dessert geared tacos. One in particular, looked like some strawberries with a piece of ham slapped into a tortilla, and sold at a premium. <br><br>Despite the foregoing, Velvet Taco has a few unique tacos that you can't get anywhere else, such as one that features a breakfasty feel, or a bettered chicken taco.<br><br>My largest complaint is that somehow, making three tacos took them over 20 minutes in wait time. The shop wasn't particularly overloaded with customers, all the people that ordered around my time received their dishes 10 minutes before mine came out. <br><br>Overall, if you come here, make sure to look at the pictures and correspond the pictures to what you order. Some tacos are extremely bare boned while others are extravagant, at a similar price. Personally, I prefer more authentic taco joints and would likely not come back here.", "pics": null}}, {"review": {"des": "These tacos never disappoint. Coming here after a night going out is the best. The line is long but the employees happen to manage and keep it efficient. The buffalo chicken tacos are sooo yummy. I did get the red velvet cake once but was not a fan. I would only recommend coming here for the tacos.", "pics": null}}, {"review": {"des": "This nice taco shop near Rush and State has lots of nice types of tacos.  I got the rotisserie chicken and the pork annatto taco.<br><br>The chicken one was moist but a bit bland.  Nothing to write home about.<br><br>The pork one came in a purple hibiscus corn tortilla, which was interesting and pretty.   The pork was flavorful and very nice.<br><br>All taco shells are nice and thin, not too thick.   They have a nice upstairs section where you can sit by the open window in the nice weather.<br><br>They take credit cards.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UZIgzaygXhP3ceR84DXRzQ/348s.jpg", "caption": "Rotisserie chicken on both sides and pork annato taco in the middle"}]}}, {"review": {"des": "Fried Paneer Taco: 5 stars hands down the best paneer tocos, ever at 12AM! <br><br>My buddies and I were starving and we didn't want to go out since it rained.<br><br>We ordered online and had a good experience going through their process.<br><br>The food arrived on time and still hot! <br><br>We will for sure order from here again.", "pics": null}}, {"review": {"des": "Brisket taco, pulled pork taco and the tots. All were so good. Thought about going back the next day. Took a little longer than I thought but worth it. Cool place.", "pics": null}}, {"review": {"des": "Velvet Taco is A-OK (7/10). Comparing their tacos to ones I've had in California and NYC, this place is about average but gets kudos for having a creative, diverse menu.<br><br>Location, atmosphere, and service were all great. Everything is clean and well organized and the cashiers were super knowledgable and helpful when it came to ordering.<br><br>Here is what I ordered:<br><br>#1 buffalo chicken<br>#3 tikka chicken<br>#8 annatto<br>#10 kobe burger w bacon <br>#12 angus<br><br>Overall, I found myself enjoying the beef tacos the most (especially #10). If/when I make another visit, I'd probably only order beef. The buffalo chicken was a bit lack luster and the tikka chicken (although very creative) was too creamy and the rice made the experience \"weird\" to say the least. The annatto and angus were both good but not to the point where I want to rave about it to my friend or have cravings for more.<br><br>If you're visiting Chicago, this is an ok/good place to add to your food itinerary (bc I haven't seen this creativity or hybrid in other businesses); however, the execution and overall experience was decent.", "pics": null}}, {"review": {"des": "Ive tried about 6 tacos on the menu and I pretty much have liked them all. Minus one star for over priced tacos. Red Velvet Cake was delish also. Not exotic tacos but not average", "pics": null}}, {"review": {"des": "I love the creativity and thought behind all of the tacos. This restaurant is really trendy so I had to come here. The tacos were delicious, and bigger than the average size taco. The only downside is they came out a little cold. We did love the sides we ordered too. I wish we would've tried the tots!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FovDIS-pNK-PAgwsU88pAg/348s.jpg", "caption": "Top to bottom tacos: Shrimp & Grits, Cuban Pig (2), Spicy Tikka Masala (2); Corn, and Red Curry Coconut Queso with Blue Chips"}]}}, {"review": {"des": "I don't even know where to begin with this place. Whoa! The variety of tacos is amazing. I love mixing and matching whatever strikes your fancy. Everything was prepared fresh and I liked the upstairs seating area. Definitely left here will a full belly and a full heart. Be sure to check out the WTF (Weekly Taco Feature) and you'll be surprised with everything they come up with.", "pics": null}}, {"review": {"des": "Outstanding interesting fun delicious! Not authentic Mexican just incredibly inventive and tasty tacos! Well run fast service, we went twice during our 3 day Chicago visit!", "pics": null}}, {"review": {"des": "Only reason why I'm giving this place 4 stars is because the tacos are insanely expensive, but you're in Chicago- what isn't expensive?! Otherwise, these tacos are amazing. I love the spicy tikka and pulled pork taco (comes with a purple tortilla!) Perfect place to go if you want just 1 taco, or ten! As they are all sold individually. The place is a bit crowded, but don't worry there is a whole upstairs for additional seating.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vvO-NSb5z0Qf-7h3Np_eyQ/168s.jpg", "caption": "Top- Rotisserie Chicken Taco, middle- spicy tikka, bottom- annato shredded pork"}]}}, {"review": {"des": "Hands down one of the best late night eats you can crave in the city!<br><br>Visited Chicago for 4 days with a group of friends and ended up eating here twice.<br><br>You won't be disappointed by the grub but it can get crazy during the late nights!<br><br>Best part are the vegetarian options!<br><br>Highly recommend 5/5!", "pics": null}}, {"review": {"des": "The location is great, right in 'viagra triangle' where all the fancy steakhouses are, this is a good fast-casual option. You enter through the door by the Viceroy. The menu is on the wall immediately straight ahead in large print and then you turn right to approach the counter to order and pay. The cheapest taco I recall is $3.50 (maybe $3.95). I would say the average is $5-6 per taco. To me that is quite pricey, although I understand they are larger than street tacos and are unique combinations of toppings. Service is quick and friendly. Don't look for napkins by the soda machine...there are paper towel rolls on each table.<br><br>I have never been upstairs or here late at night but someday....", "pics": null}}, {"review": {"des": "Oh. My. God. I've been wanting to try this place for a while. And now I know what all the raves were about. All the tacos are individually sold. I got the crispy buffalo chicken...which was buttery, spicy goodness. Got a side of their corn. Scrumptious. Cream, some melted cheese and their Valentina hot sauce lightly added on top. Given with a wedge of lime. Squeeze that sucker all over. Such a lovely, tasty combination of flavors. Now onto the taco that I ate with my eyes closed. Taking my time to savor each bite before going one to take another. The Cuban pig. So. Good. Kinda like a taco version of a Cuban sandwich. Big, hefty shreds of what tasted like roasted pork with ham and bacon and delightful long shreds of cheese on top. Sorry I don't know all the individual cheeses and ingredients. Just know the pork was so succulent that there were tons of juicy goodness left at the bottom of the paper wrappers. And it's all washed down with bottled, Mexican coke, sprite, orange Fanta and others or a nice selection of canned specialty lagers and beers. <br><br>The deco is pretty neon. A couple of nice long wooden tables with metal stools around all sides to share. Cute, colorful padded swivel seats (with backs) at the front counter window where you can people watch till late at night. They are open till 3 am on this lovely, balmy Thursday night. There are stairs leading upstairs so there is probably more seating up there.<br><br>The counter guy was patient with me asking questions about the menu since it was my first time there. <br><br>I can't say enough about the food. Good atmosphere with nice toons. Neat place with interesting and good flavor combos. I can't wait to come back and try some other velvety tacos. The warmth of velvet in their name is a perfect way to describe their flavors. Mmmmm.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/33hVR9K9aiTb7hVR-EMBvg/348s.jpg", "caption": "The menu. Shirt but sweet."}]}}, {"review": {"des": "I have tried many different \"specialty taco\" places and Velvet Taco is by far my favorite. The menu seems a bit overwhelming at first, but you really cannot go wrong with anything you pick. There is such a huge variety of choices for each kind of protein source. I have found that at some place there are only about 1 choices per type of protein, but that is certainly not a problem for Velvet Taco. My friends and I were not disappoint with any of the tacos that we picked. Service was fast and employees were nice and helpful. I would go back!", "pics": null}}, {"review": {"des": "I loved the customer service, very friendly and attentive. I enjoyed the selection of seating and atmosphere. What I didn't like was that there was a long hair in one of my tacos that I paid 5 bucks for... what a joke. I understand accidents happen but when you're selling tacos for the price of a burrito in the Gold coast area, it better be flawless! Bad first experience and never going back. Spend your money elsewhere or double check your food throughly.", "pics": null}}, {"review": {"des": "This review is for their online ordering only -<br>Asked for delivery, put in hotel address and said complete order. I then got a confirmation that my order would be ready for PICKUP in the store in 10 minutes. I tried calling the store 10 times and nobody answered. Since I paid already I had to now go pickup. Once at store it was chaos as usual for this establishment which is one reason I wanted it delivered. My frustration is that the the company has poor customer service in this matter. I believe they never intend to deliver the food and they don't answer the phone bc they know they never intend to deliver the food. It's all a ploy to make you think you can have the convenient delivery service but then charge you and chalk it up to a system glitch. <br>Answer your phone! This is terrible customer service! Never again will I step foot in a  chaotic stressful Velvet Taco!", "pics": null}}, {"review": {"des": "Seriously amazing tacos! Fresh and authentic ingredients put together right in front of you. <br><br>I got the rotisserie chicken as a lettuce wrap and the Cuban pig as a lettuce wrap. Chips were ok, but the queso was on point! <br><br>Will definitely be back again to try more, and share with my husband...we LOVE tacos!!!", "pics": null}}, {"review": {"des": "This is the best veggie tacos I have ever had.<br><br>All three flavors of veggie one are awesome !!<br><br>Thanks for making such flavorful tacos<br>Please open a branch in Atlanta, GA!<br><br>Its really yummmmmmm", "pics": null}}, {"review": {"des": "Today, the office ordered delivery from Caviar.  I had eaten at the restaurant once a few years ago.<br><br>Taco: 3/5 I was too hungry and devoured the #8 shredded pork taco on hibiscus (reddish/purplish) corn tortilla before I remembered to take pictures.  I liked it less than #3.5 picnic chicken taco with crispy chicken skin on top.  I enjoyed the flavor and sauce of the chicken taco but could do without the pieces of potato which made it a lot heavier.  <br><br>Side: 4/5 The elote corn was cold but still great.  <br><br>Dessert: 3/5 not sure what the dessert was but it had a peanut filling and crispy outside", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Hn9Bf3xqbaWA2dblIdsrDw/348s.jpg", "caption": "Hibiscus corn tortillas for #8 shredded pork"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZY4XADWYrmZiEjxsvmsp-w/168s.jpg", "caption": "Elote corn"}]}}, {"review": {"des": "Not your typical tacos, but so so so delicious. This was one of our favorite meals we had in Chicago. There's a variety of tacos to choose from from each food category: chicken, pork, beef, fish, and vegetarian!! I asked the worker which vegetarian taco was the most popular, and she said #5 fried paneer was the best. So I got one of those & 2 of the #4 Nashville hot tofu tacos. The fried paneer tasted bland & wasn't that good. The Nashville hot tofu tacos were amazing!! SO good but super spicy. My mouth was on fire. But it was sooo good. Even if you can tolerate some heat, I recommend getting it. For the meat eaters- #16 fish n' chips, #14 shrimp and grits, and #11 grilled flank steak were really good! I came back and got the #6 falafel and it was good! But I think I would have liked it more if it was in a tortilla instead of a lettuce wrap. The 2nd time I got the Nashville hot tofu tacos, they weren't THAT spicy so maybe it depends who cooks them? Way better with less heat. Either way- you must try them! Seating is very limited... they open the upstairs for extra seating at times but I'm not sure when they do that. We came at night & it was packed and the upstairs was closed. Make sure you keep track of how many tacos and what you ordered. They forgot to give me one. The 2nd time we went, the owner or manager was there and he wasn't very nice. He was training the new lady & was pretty rude. Overall, I highly recommend going here! The food was delicious and there's such a nice variety of tacos!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mJq5RGN9YXsgRi4Vz7FuQQ/348s.jpg", "caption": "Left to right: #14. Shrimp and Grits, #4 Nashville hot tofu(2), #5. Fried Paneer, & #16. Fish n Chips. All very good except fried paneer"}]}}, {"review": {"des": "It's been about 2 weeks since I first stepped foot into this place, and I still get emotional when I think about the Nashville Hot Tofu taco. Seriously, people, vegetarians/pescetarians are in luck here. GET THAT TOFU TACO. <br><br>The service was relatively quick considering the line was out the door when we arrived. Took a little longer to get the food once it was ordered, but again, they were slammed, and we had our drinks to hold us over, so no complaints here.<br><br>The prices are decent; we paid around $50 for 5 tacos, two sides, and two drinks. Also, that's way too much food for 2. So be warned. Next time we're planning 4 tacos and one side and to still be stuffed. <br><br>A friend recommended the tots to us, which come complete with a fried egg and I think goat cheese? on top. They were delightful, but couldn't hold a candle to the elotes. The elotes, man- if I could only have one food for the rest of my life, I'd pick that. I'd suffer the consequences, but I'd still pick it. <br><br>All in all, I cannot recommend this place more. It's got a funky casual vibe, an upstairs seating area to get away from some of the noise, and just all in all, it's a great experience. I can't wait to get back there.", "pics": null}}, {"review": {"des": "We were visiting Dallas for the first and wanted to try some TexMex and discovered this spot on Yelp. Great service, great food! I'm still daydreaming about the shrimp and grits taco. The best part was when I discovered there's a location back home in Chicago.", "pics": null}}, {"review": {"des": "I am a big fan of tacos (as I'm sure many of us are) but I far from being fan of many taco places. Well, this one made it to the top of my list. Went there bunch of time on different occasions. <br>This spot is not a regular restaurant with a server, you will order food yourself and they will call your name when it's ready. <br>You can sit downstairs as well as upstairs. In summer they open windows on a second floor plus you can quite nice view. <br>Their choice is amazing! You can order: chicken, beef, pork, fish or veg tacos! Each one had at least two different choices. You can also order a sides (three choices). If you're not in a mood for tacos and you don't want to dine in you can order whole rotisserie chicken with a fancy name Back Door Chicken (BDC) to go! It comes with two sides elite style corn, six corn tortillas, pico de Gallo & heat sauce, and it cost $20. <br>While you wait for your order you can enjoy few refreshing beverages, including alcoholic ones. My choice is Margarita. <br>If you got a sweet tooth and room left after dinner you might enjoy Red Velvet cake (yum!).<br>Had no clue but they also serve Brunch all day!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7Z0r9RA5iP2JF6cTxKJ-bw/348s.jpg", "caption": "Also offer Whole Backdoor Chicken to Go"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8WURr8U_8LSnA4s-I3juMA/168s.jpg", "caption": "You can also order sides"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RnJSMWr3ddCBrj5kVJg7Cw/168s.jpg", "caption": "Had no clue they were serving brunch"}]}}, {"review": {"des": "You've heard of breakfast burritos before, but get ready for breakfast tacos!! They serve their brunch tacos all day and they are WORTH IT. The steak and eggs taco is a great balance of both with an egg coating the bottom of the taco shell and a nice amount of steak, tomatoes, hollandaise and micro greens on top. The crisp tots and local egg side was also very tasty and well balanced with goat cheese, smoked cheddar and an avocado crema. But the real winner here was the chicken and waffle taco. The tortilla was an actual waffle which was sweet and cinnamony but went perfectly with the chicken tenders, peppercorn gravy and green apple slaw syrup. My mouth is watering as I type this just thinking it!! And this place is extremely affordable too. Each taco was between $4-$6 and was jam packed with ingredients. The service was speedy and friendly! (Also pictured; Annatto shredded pork taco. Pretty good!)", "pics": null}}, {"review": {"des": "You guys, tacos are my favorite food (just like any basic girl) but let me tell you, this place is a gem. The picnic chicken woah yup yum, it's a must. The fish taco was very good as well. I am not a huge mustard person so I'll ask for none next time. <br><br>The pulled pork taco on a PURPLE corn tortilla, amazing! <br><br>I didn't get a marg because I was trying to keep it chill today, but I'll update my review when I get one, probs within the next week", "pics": null}}, {"review": {"des": "My taco was amazing. In the service was impeccable. I asked for a lot of extra things and they were so sweet and kind to accommodate me and what I needed for dietary restrictions. Thank you so much for being so helpful your food is wonderful", "pics": null}}, {"review": {"des": "My very first experience with Velvet Taco was couple years back when I visited Dallas. I loved this placed and was like why doesn't Chicago of all places not have this. <br><br>Guess what they heard me and once was opened and until recently I did not realize that it was the same one from Dallas. My wife and I went here for a Sat night dinner and it wasn't as crowded and you place your order and then pick it up in about 10 minutes. The only worst part is i spent more on parking than on my food...Perk$$$ of living in Chicago.<br><br>The Tacos were awesome, I order 3 from the Chicken (Chicken tikka, Rotisserie, Buffalo chicken)  and my wife ordered 3 from Veggies (Panner, Tofu and Falafel). All Tacos were awesome but my favorite were the Chicken Tikka, Buffalo chicken and Panner tacco. Will definitely do it the next time i am around Chicago.<br><br>Almost forgot.. the best was the tatter tots, with an egg on top....", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/C38VHibfSKUQn3ub722WNA/168s.jpg", "caption": "Tater :)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2Q9O7fxM_OuWlmAJPwiEDw/168s.jpg", "caption": "Awesome tacos"}]}}, {"review": {"des": "Loved it!  These are the best tacos we've had in the city for quite some time.  And b/c they're so good, the place does get crowded.  My husband and I both got the Spicy Chicken Tikka Taco and the Shrimp and Grits Taco - with a side of the Crispy Tots w/ Egg.  The tacos are larger than I thought, and we were full by the end.<br><br>We loved both tacos, but for me the Tikka was better and for my husband, the Shrimp and Grits was better.  The Tikka had a spicy pepper sauce and came on a flour tortilla - which was great b/c it didn't fall apart with all the ingredients inside.  The Shrimp taco came on a corn tortilla which kept ripping on me.  No big deal b/c I just scooped up all the goodness with my spork.<br><br>The tots were good w/ the goat cheese and especially the avocado cream sauce, but I liked the tacos better.  Especially when you add their \"hot sauce\" they have at the counter.<br><br>Ordering is quick, but it takes a good 5-10 minutes to get your food - even if they're not busy.  My food was hot, so I'm not complaining.  They don't have regular pop at the soda fountain so that was my only complaint.  Other than that minor drawback, Velvet Tacos was fabulous and we will be back soon!", "pics": null}}, {"review": {"des": "Fun ambiance, delicious tacos with flavors that go well together, but a bit on the pricey side (hence the 4 stars instead of 5). <br><br>I was expecting them to be busier when my partner and I arrived around 5:30 or 6:00 on a Friday night, but thankfully they weren't. We were waiting for his suit to be altered at Suit Supply a couple of blocks away and needed food to hold us over until dinner (we had 10:15 PM reservations). <br><br>I ordered the shrimp and grits as well as the Cuban pig. Both were great! The shrimp and grits had grits that were fried up into little squares of goodness! My only complaint was that the corn tortilla had a hard time containing all of the deliciousness and did start to rip in several places. I would order it again next time with a flour tortilla instead. As for the Cuban pig, I would have preferred the gruyere melted (it was shredded/shaved on top), but otherwise a stellar taco! The house brined pickle complemented the pulled pork, shaved ham, and bacon. Yum!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DAOSuiJxNBd1nP61bSWF7g/348s.jpg", "caption": "Cuban pig on the very left, shrimp and grits next to it, and my spouse's tacos on the right (don't remember what he ordered)"}]}}, {"review": {"des": "Love the up beat vibe here as well as the creative twists of favorite dishes made into tacos. Even the way they serve everything is fun but if you get the paneer taco, be ready for the dripping! <br><br>Great staff. Delicious food. Many different options from steak to chicken to vegetarian options. Located in a kick ass part of the city. It seems very clean but I didn't use the ladies room. They are mostly communal tables and there is additional seating upstairs. The tables have paper towel rolls ready for you to use. <br><br>If you come here on a Friday or Saturday night after 11 or midnight, be ready for lots of tipsy folks. But it's always fun to people watch! <br><br>My favorite is the paneer taco and the chicken tikka! <br><br>Definitely like this place and plan to come back soon.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8wdQU8YZhe_YbpkzaMghGA/348s.jpg", "caption": "Paneer taco on top. Chicken tikka spicy on bottom. Shrimp and grits and then angus beef. Side of corn. All 4-5 stars."}]}}, {"review": {"des": "This is my first visit and I must say that I will definitely return. We ordered 5 tacos to share so that we could taste the ones we liked. There is no way that you could eat 5 all by yourself.... they are a nice size.<br><br>The fish was delicious! It was light, airy and moist. My cousin and I both loved it.<br><br>The steak was very tasty! The mushroom and onions added a great depth of flavor.<br><br>The brisket was amazing! The corn salsa really complimented the tender meat.<br><br>The Cuban was not that good. It was dry and lacked flavor. Needs some kind of special sauce or something.<br><br>The Chicken Tikia was just ok. I liked the spice of the chicken, which made it flavorful but nothing exciting.<br><br>I would recommend this place.... it's a must try", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eS1M_D5J3dZg3lJXCSSBdA/168s.jpg", "caption": "A variety of tacos"}]}}, {"review": {"des": "My new favorite spot! It's literally right up the street from my place and is delicious, relatively cheap, and low-key. My favorite taco (so far - I haven't tried them all which is my goal) is the shrimp and grits. Delicious!! Also liked the rotisserie chicken taco which has more veggies and tastes a bit healthier. The frozen margarita for $6.50 is a stellar deal and I was buzzing after one. Thank you check out boy for talking me into it. New love.. I will try not to come back more than once a week but it's going to be a challenge.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cwp3QjBmZGd6j1MZswsmDA/348s.jpg", "caption": "Margaritas are solid and only 6.50"}]}}, {"review": {"des": "Velvet taco - the ultimate late night joint, right? Wrong. This place is packed ALL of the time. I've never seen this place empty. All the tables downstairs are usually always occupied. <br><br>The food is definitely not authentic, but definitely a great late night spot after a night out.  They have some interesting variations of tacos like buffalo, shrimp and grits, chicken tikka, etc.<br><br>They also have a taco of the week. I never try it because it is always something strange. They have great red velvet cake and elotes as well. The best part is though they have a great frozen margarita! <br><br>But the reason I keep coming back here is because I have had the most interesting encounters here and have met the most unique individuals ever. I met an Instagram dog celebrity - tunameltsmyheart and a few other incredible people with the most fascinating life stories that have been quite inspiring. <br><br>Come to velvet taco for whole experience, not the taco!", "pics": null}}, {"review": {"des": "Yes! Just go! <br><br>I like the creative tacos. Chicago has a pretty amazing selection of places to visit for tacos, from hole in the walls/ authentic to chains that have your plain jane taco bell tacos, that sometimes I just have to say NO I WILL NOT HAVE ANOTHER TACO!<br><br>But this place..... knocks all of them out of the park, AND will make you want to go back.<br><br>Shrimp and Grits tacos? Yes!<br>Chicken Tikka? Yes!<br>Beef Brisket?! Of Course!<br><br>I would recommend getting a few and sharing a bite here and there with your BF, GF, or friends! You will thank me for it!", "pics": null}}, {"review": {"des": "I don't know how it's taken me so long to get here! It's in a great spot, very reasonably priced, and so unassuming! These tacos are amazing & very filling. The weekly taco feature (WTF - yes, that's what they call it) was catfish with a remoulade sauce and it was off the charts delicious! They totally need to make it a permanent menu item. I also had the #8 shredded pork which hit my tastebuds just right! Surprisingly although there's been many rave reviews on the #3 spicy tikka chicken, it was my least favorite of the three I ordered. I'm definitely coming back. Might even be my new lunch spot. <br><br>Update: Back again & ordered the fish & chips with cod. Definitely give it a try - so satisfyingly good!", "pics": null}}, {"review": {"des": "What's the point of listing your phone number if no one ever answers?<br>I've called literally 8 different times between yesterday and today...", "pics": null}}, {"review": {"des": "Velvet Taco was at an ultra convenient location to our hotel, so we stopped by for a quick, late lunch before heading off to explore Chicago.<br><br>I like that there are a couple of veggie taco options (I tried all three):<br>-Nashville hot tofu<br>-Fried paneer<br>-Falafel<br>I also split a side of Elote corn.<br><br>Personally my favorite was the Elote corn. The corn was creamy and had a mild spicy kick to it (perfect for spice weenies like me).<br><br>I wasn't a huge fan of their tacos. I'm partial to the traditional nopales tacos we have here on the West coast. If it ain't broke, don't fix it.<br><br>Anyhow, I do like the vibes of this place. There's an upstairs with more seating and an all around urban industrial vibe. Not a bad place for a quick bite.<br><br>3.75", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CEhCL10vN8NqjnXzcoK6HQ/168s.jpg", "caption": "All veg tacos"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ElYZoQRJh-kN3pISxIPS4g/168s.jpg", "caption": "Inside"}]}}, {"review": {"des": "I usually don't like tacos, but this place is AMAZING. It completely changed my view on tacos and made me obsessed. I had dreams of coming back here after my first time.<br><br>Their tacos don't usually fall apart on me because the tortilla is thick enough and also they have really nice taco racks that they serve you in. The toppings are so delicious and creative! They have a couple of Indian fusion ones (chicken tikka, paneer). The flavors go together amazingly and also the taco filling is warm. I would suggest to eat quickly for the ones with crispy stuff (e.g. the fried chicken ones, paneer one). <br><br>My favorites are the brisket, Cuban pork, and paneer (sooo savory). The tots are good but I would say save room for the tacos instead. <br><br>Lots of seating (there's an upstairs). Also open late!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JOLZPdzxXEpaygRwcQ_V2Q/348s.jpg", "caption": "Variety of tacos and tots"}]}}, {"review": {"des": "Had the Shrimps and Grits, grilled flank steak, buffalo chicken, and ahi poke. Shrimp and Grits was by far my favorite.  Buffalo Chicken was also very,  very good. Flank Steak and Ahi Tuna was pretty plain and not all the Tasty. Wouldn't be driven to get the Ahi Tuna again.  Definitely a great fast, casual spot if you're looking for a good lunch spot in downtown Chicago. We ended up coming twice in the same weekend, that how unique it was. Kobe burger taco is also on point, along with the Barbacoa. Margarita was also on point. If rate it 4.5 if yelp allowed that", "pics": null}}, {"review": {"des": "Simply fantastic and a highlight of my NRA trip to Chicago.  LOVE the fact you can get your tacos lettuce wrapped since I'm Paleo/Primal.  My hands down favorite was the flank steak tacos but all were good.  Picnic chicken was probably my 2nd favorite.  Literally had about 12 tacos between two visits.<br><br>LOVED the margaritas for $6.50.  Can't wait to go again and I wish they'd open one in S. California where I live.", "pics": null}}, {"review": {"des": "Velvet taco is constantly really busy. Their menu is a very wide a selection of different taco fillings, including quite a few ethnic inspired tacos - they have friend paneer, falafel, and tofu. Pretty decent vegetarian options as well. They also have elote, and margaritas. Interior is pretty small but there is a second floor as well - they open the windows in the summer so it feels like an upstairs patio. <br><br>I don't really understand how this place is constantly packed. The tacos are pretty mediocre - I would rather go to the tequila bar around the corner. They are also insanely expensive $3-6 each, although they are pretty big. The fried paneer one I was pretty excited to try given my obsession with paneer - but it was weird and rubbery. Their flour tortillas are pretty bland and tasteless, and a couple of times my flour tortillas came cold which was a weird sensation with the hot toppings.<br><br>Atmosphere gets really packed and lively.<br><br>Pretty much the only thing I really like are the margaritas here.<br><br>There are so many better taco places for less $$.", "pics": null}}, {"review": {"des": "This is def not your typical taco place!! It's so freaking good. The first time I had velvet taco was in Texas. I immediately fell in love with it. So so glad that they have one in Chicago! <br><br>As for the tacos, they have variety of 'em. I usually get the spicy tikka chicken (#3) and the steak (#10).  They're filled with a lot of meat and so much flavor to it!! LOVE IT! The tacos are larger than the typical tacos you get at the Mexican places. Prices aren't so bad, it ranges from $3.95-$5. Can't wait to come back!<br><br>(Also there are two floors of seating!)", "pics": null}}, {"review": {"des": "Best tacos in town!  Paneer and falafel tacos hit the right spot in my tummy!  <br><br>I've been here many time but never knew they have upstairs seating!  What! - it was a perfect ending to our long night out celebrating my cousins birthday!", "pics": null}}, {"review": {"des": "Came here for lunch with a good friend of mine while visiting Chicago. It had been over a year since I visited this location, so I was eager to return. <br><br>I got three tacos: the Cuban pig, Annatto shredded pork, and the macadamia chicken salad. The Cuban pig is a classic. Very savory, and the bacon added a very interesting touch. The Annatto shredded pork was pretty good too, but probably my least favorite of the three. Now the macadamia nut! I'm a macadamia nut fiend, so I never miss the chance to try macadamia nut anything. But a taco?? Bruh! It was absolutely amazing! It took chicken salad to the next level. And the tortilla was a huge slice of lettuce! Talk about innovative! Probably my favorite taco of the bunch. It was only available for a limited time, so I'm glad I got to taste it before they took it away. <br><br>The food was great as always. The restaurant is located in the middle of downtown Chicago, so everything was just filled with life. Can't wait till I come back!", "pics": null}}, {"review": {"des": "What lured me in was the shrimp n grits taco! It was amazing. I had a shrimp and grits taco, a fish n chips taco, a flank steak taco and Tikka chicken. The sizes were good as they should have been bc the tacos are like $5 $6 each. The elote was pretty good (y'all know I love elote). Super cute venue with additional seating upstairs. I will definitely be back! My favorite one of them all was the steak taco. And. And. They have black cherry pop the fountain. That sent the club up.", "pics": null}}, {"review": {"des": "First off, let me preface my review by saying this: if you are a pescatarian (and even more so if you are a vegetarian) this place is 2 stars. If you are omnivorous, this place is 4 stars (per my husband). <br><br>I got the shrimp and grits taco and the paneer taco. There is a very limited selection on non-beef/pork/chicken options. The paneer taco was very good. But the shrimp and grits taco was terrible, in my opinion. I love salty things, in fact, up until this meal, I would've argued that there's no such thing as too salty. But this shrimp and grits taco was almost inedible (of course I ate it out of principle, but that doesn't say anything). I wish I would've gotten another paneer taco. <br><br>My husband got the brisket taco and flank steak taco which he really enjoyed because they gave so much meat. My mom got a rotisserie chicken taco that she enjoyed. <br><br>The chips and queso are very good, but the tots were just okay.<br><br>Service wasn't very good. The man who took our order was not nice and seem very annoyed. It took forever for our tacos to come out too. <br><br>I personally won't be coming back. Very disappointed! I so badly wanted to like this place.", "pics": null}}, {"review": {"des": "The chicken tikka taco and shrimp and grits taco are my two favorites here! The queso was exceptional, and I love that there was a hint of coconut curry in it. My only complaint is that I think they were a bit wasteful with the large portion size of the queso when compared to the number of chips that came with it. My group of three had half the queso left when we were done, and we were full. Overall great restaurant, but need to be more mindful with some of the portion sizes.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/leejtG1AMBkTxTCZFg86_A/348s.jpg", "caption": "From left to right. Chicken tikka taco, shrimp and grits taco, and flank steak taco."}]}}, {"review": {"des": "I had visited the Austin outpost of Velvet Taco on a work trip earlier this summer so it makes sense that I found the Chicago outpost of this Texas mini-chain on this work trip. After having another great experience I wanted to leave my rave.<br><br>A. So many options! While it is a little overwhelming to have 20+ super unique tacos to choose from the menu divides them into clear categories (type of meat, fish, veg) and there's always a fun taco-of-the day feature. Pig and fig on this visit <br>B. Friendly service. They know the menu is a lot so staff asks if this is your first visit and is happy to make recommendations. <br>C. Customizable. I liked the elote but thought it was way too sauce heavy (it's served off the cob in a cup at Velvet Taco). I told my server and she was able to get me a portion with half the usual mayo which was much more to my taste. <br>D. Fills you up. These are big tacos. As others are commenting the price tag is bigger as well, but $3.5 - $6.5 is a fair deal for how fully stuffed these guys are. So stuffed that most of my tortillas soaked through (my one rant).<br>E. Topo Chico!<br><br>Yum.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Zlc-IOc6OA4xnUgncYvVkw/348s.jpg", "caption": "3 tacos + elote = too much (good) food"}]}}, {"review": {"des": "BaaaaaAAb-BeeeeEEEE!!!! Shawty don't play about her food, especially if it's tacos! Mama LOOOOOOVVVES tacos!   <br><br>I came across Velvet Taco on Instagram, and I instantly thought \"DAAAAAAAAAANG, THESE TACOS LOOK GOOD DENNA MUG!\" So I said to myself, \"Self, you gotta go there to taste the holy grail of tacos.\" So I hopped in the passenger side of my best friend's ride, and we rode into all of the velvety goodness this taco joint had to offer. The first thing I noticed was how cute it was inside, & the atmosphere was super chill in the beginning.<br><br>Idk who had the AUX, but whoever had their Spotify playlist in rotation had all the jams going! By this point, I was ready to eat & do a lil twerk ‍. There were so many yummy tacos to choose from. The fat girl in me wanted it all, so I ordered everything!<br><br>My favorite tacos were: the Buffalo Chicken, Grilled Flank Steak, & the Crisp Tikki Chicken Taco. Everything from the flavor, to the presentation had my taste buds going.<br><br>OOooO and I ate the Cake Anna Mae!!! They have this red velvet cake that is BOMB, and I don't even like cake! (NO LIE) YOooooOO and the margaritas had ya girl feeling good, feeling great!  <br><br>I wanna go back! I wanna go back NOW!!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FYlHBw6JsLGtMAP6z5n_3A/348s.jpg", "caption": "Velvet Taco"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zha47jVsZYtsMAyUxjIb1g/168s.jpg", "caption": "dope vibes!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/faECSoQEnLSbAC3B7akTeA/168s.jpg", "caption": "The best tacos EVER!!"}]}}, {"review": {"des": "Really cool casual taco joint! You order at the counter and they will call your name when your order is ready.  We went at 3pm on a Saturday and it was packed! Luckily there are two floors of seating so we managed to find a table on the upper level with a nice view.  <br>We ordered a plethora of tacos and all featured fresh ingredients.  Keep in mind few of these tacos were traditional.  Highlights included the chicken tikka tacos, the bacon frittata tacos, and the poke tacos.  The queso was also ridiculously good.  Their frozen margaritas were a hit as well. <br>Overall great fast casual taco joint in a fun neighborhood.  Perfect for a relaxing lunch and gathering with friends.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/G3GVmLOiTk0QxG8w3Vf_LQ/348s.jpg", "caption": "Tacos!"}]}}, {"review": {"des": "Tip: try spicy chicken tikka first, it's spicy (duh) but it's the best. Love the basil in it.<br>It's a good place to get that late night food craving taken care of.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/n2zffQ616wPRY-4AuOBbqA/348s.jpg", "caption": "Menu"}]}}, {"review": {"des": "So good I ate here twice while in Chicago for 5 days. I 4gt the names of the tacos I ate but I  say try all of them! Two was more than enough (nice portion) but again TRY ALL OF THEM.", "pics": null}}, {"review": {"des": "Every time my girlfriend asks me where to eat I say \"Velvet Taco\" every single time. I'm so lucky to have this restaurant conveniently located near me. <br>Their tacos are works of art. Beautifully decorated and delicious. I was annoyed at first that they were priced individually but each one is so different that I don't even care anymore. I've been trying to eat less meat and their \"Veg\" options are actually one of my favorites. However I have a place in my heart for 'tacos al pastor' so I had to try and it's also one of my favorites.<br>They also have really cool alternative sodas with cane sugar instead of HFCS and they are delicious. <br>The 'velvet' part comes in with their (Red Velvet) cake. GET THE CARAMEL DRIZZLE (or whatever they call it...) you'll want to bathe in it.", "pics": null}}, {"review": {"des": "My favorite place in Chicago by far. Whenever I have friends visiting, I make sure to take them to Velvet Taco. This is not a typical Mexican taco place- there is a ton of different meats and toppings that go into each taco. It's fusion style! My friend who doesn't really like tacos loved it. <br>My personal favorite is chicken tikka, which is creamy (and a little spicy) curry sauce with chicken stripes and rice (also comes with pieces of basil on top). Every single time, I have to have it. <br>When I am hungry, two tacos are good amount for me. When I am super hungry, I can do three. I like their spicy sauces that you can bring to your table for your meal. The frozen margarita is also pretty good and refreshing! <br>I recommend dining in, because it becomes not as good when you get it to go. I live only a block away from this place and the tacos were not as fresh/warm by the time I came home.", "pics": null}}, {"review": {"des": "I absolutely love Velvet Taco. I've tried nearly all of their \"gourmet\" taco options and have loved every one of them. The cuban is a particular favorite along with the chicken tikka. My wife and I stop by here every once in a while when we're in the neighborhood. I wish they'd open more locations around the city.", "pics": null}}, {"review": {"des": "Atmosphere / decor - 3.5<br>Service - 3.5<br>Food - 3<br>Location - 4<br>Value - 3.5<br><br>Overall 3.5<br><br>I really like that this place has late hours. It was still busy around 1am. Having not eaten dinner we went all out and got 7 tacos. Mine were the rotisserie chicken, flank steak, the ahí tuna, and the breakfast one with the corn tortilla (all no cheese). The breakfast one was okay, cool concept. The ahi tuna taco tasted like sushi if that's your thing. My favorite were the chicken and steak. Both had pretty good flavor and had a lot of meat. I also had the frozen margarita which I think is a good deal at $6.50. It was really tasty as it wasn't made with a mix. The tacos were a bit pricey but I'm not used to Chicago prices so it could be normal for the area. It was a neat place to try.", "pics": null}}, {"review": {"des": "A high-end taco spot, but not short from delicious! (After all it is \"velvet\" taco). Anyways...<br><br>Everything we order was top notched. The only sucky thing was the price. About $4-5 per taco. The elote and the tots were amazing little appetizers! Their house hot sauce brought the delicious heat.<br><br>Food - 5/5<br>The Kobe Burger & Flank Steak tacos (via Boyfriend's opinion) : Both were quite phenomenal, life-changing tacos. The Kobe Burger taco was surprisingly very juicy and super savory. The Flank Steak taco was nothing to joke around about. Overall, both tacos came with a generous amount of meat and all the flavor.<br><br>The Buffalo Chicken taco: If you're a fan of buffalo sauce, this is your taco. The consistency of the chicken and the texture of the crisp made this taco amazing! A very simple taco (chicken + shredded carrots) but filled with loads of flavor!<br><br>Place - 5/5<br>Plenty of seating and even additional seating upstairs. I enjoyed the wall art and the aesthetics of this restaurant. A very hip place to eat and catch up with some friends.   <br><br>If I'm ever in the area and craving some specialty tacos I will most definitely return to this place!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lJGB9M4336lcYb489TTJSg/168s.jpg", "caption": "Tots and elote"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rNB7QjHjd_YB-kaStdTlzA/168s.jpg", "caption": "Kobe, flank, buffalo"}]}}, {"review": {"des": "I visited during the hours in between lunch and dinner on a Saturday afternoon. The restaurant has really cool decor and upstairs and downstairs seating. The upstairs seating had windows that completely opened (almost like a garage door) with a great view of the neighborhood/skyline.<br><br>The menu seemed to have something for everyone. I tried 3 different tacos with chicken, skirt steak, and brisket. The brisket was my far my favorite! Every taco was tasty, but seemed overpriced ($35 for 5 tacos and a soda).<br><br>Overall, this is a fun place for a quick bite! I recommend if you're ever in the neighborhood.", "pics": null}}, {"review": {"des": "I just had to give this place a try! So many locals recommended it to me! I took my vegetarian boyfriend here for lunch and we really enjoyed ourselves. Vegetarian friendly, tacos are yummy. I love me some Indian fusion everything and I quite liked their take on the tacos. The seating situation is limited even with two floors, but turnover is fast so you can wait it out. There's a nice view of the street and surrounding area from the window seating in the upstairs level. Not the best tacos I've ever had, but creative and yummy. It's also open super late and a popular destination post-bar or club to satisfy those drunk cravings. If I had it at 2 am I probably would have given it 5 stars.", "pics": null}}]}