{"name": "viaggio-ristorante-and-lounge-chicago", "reviews": [{"review": {"des": "Awesome food<br>Great wait staff<br>I highly recommend this on the West end<br>Great eats<br>I recommended the daily risotto...molto bene<br>My lovely wife had brick roasted chicken, slam dunk <br>Child 1 had chicken Milanese yummy<br>Child 2 had pasta Alfredo excellent<br>Dessert to die for...key lime pie, crepe brûlée and most importantly cannoli <br>I hate cannoli, this place has cannoli to kill for<br>Licked the plate, my fingers other peoples fingers, it was that good<br>Eat here before ALL others", "pics": null}}, {"review": {"des": "How did this place get 4.5 stars on Yelp??<br><br>We got the bruschetta, the cavatelli and the veal \"west loop.\"  The bruschetta was fine; the bread was a little bit burnt.  The cavatelli was awful.  The pasta was kind of doughy and the tomato basil sauce tasted watered down.  Also, the pasta was not actually cavatelli (pasta shells) - they were flat rectangular pieces?  <br><br>The veal \"west loop\" was okay, but the description did not give it justice.  In the menu it is described as \"lightly breaded, spinach, ricotta, tomato, mushrooms; served with tortellini alfredo.\"  I expected a tortellini alfredo pasta dish with veal and pieces of spinach, tomato and mushrooms, topped with ricotta cheese.   What \"west loop\" really meant was a fried piece of veal coated with ricotta and arranged sort of like an open faced sandwich with one large tomato wedge, mushrooms and spinach, then smothered with marinara sauce, with a side of tortellini alfredo on the same plate.  The marinara sauce clashed with the alfredo and made the whole dish taste awkward.  And where in the menu did it say marinara sauce??  What if I was allergic to marinara sauce??<br><br>I usually don't like to give one star, but unfortunately this restaurant has truly disappointed me.", "pics": null}}, {"review": {"des": "Have lived in this neighborhood for years - even looked at an apartment back in the day in the building next door - but my recent visit was my first time here. <br><br>Solid Italian food, for sure. This is definitely a bit old school, but it already effortlessly is the thing that Formento's was trying hard to be when it first opened. <br><br>Enjoyed the rigatoni with Sunday gravy and the risotto of the day. Service was really good. <br><br>Will definitely return.", "pics": null}}, {"review": {"des": "In Chicago for a work trip with my husband. We came a day early to see the city in nice weather. Seems we always come when it's cold. Italian is always a favorite choice and it's easy to go the the place you know but tonight we were in this part of town and decided to give it a go. We were not disappointed and would come again. We had a mixed green salad--which was served with balsamic and olive oil--portion was large and everything was fresh. The tomato was so tasty!  My husband ordered the spaghetti carbonara and I had the rigatoni in vodka sauce. The pasta was cooked perfectly in both dishes and the portions were more than enough. <br><br>Service was pleasant and the host was very accommodating. The price is on par for a nice Italian Restaurant. I can't say enough for how much we enjoyed this little place. It reminded of Billy Joel's \"Scenes from an Italian Restaurant\".", "pics": null}}, {"review": {"des": "LOVE IT HERE!! Food is absolutely amazing, staff is extremely kind, and the atmosphere is so quaint. We've gone here for my boyfriend past 2 birthdays and we have yet to leave with the feeling other than happiness and content!! I got lobster ravioli with shrimp in a spicy tomato sauce 10/10 great place to have an authentic Italian meal!", "pics": null}}, {"review": {"des": "Pretty pricey, but nothing you wouldn't expect from an authentic Italian restaurant in Chicago. The waiter was extremely knowledgeable, service was great, and even the owner stopped by to see how things were doing. Solid date night spot.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qGhwiDecsJAJ2nOi4zcc6g/348s.jpg", "caption": "Tiramisu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Nqq97dRiqFwOeN-2dEp17g/168s.jpg", "caption": "Steak special"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LAFk3XfEUsvE2lTtcltdkg/168s.jpg", "caption": "Rigatoni with Pork Gravy"}]}}, {"review": {"des": "Dang this place is amazing. By far, the best Italian food I've ever had! We had a reservation for 6:30 and we came 15 mins early and were seated immediately. The place is a bit loud, which I typically hate, but once we sat down, it wasn't a problem. The place was packed though and now I understand why!<br><br>Everything we ate was Praise The Lord amazing. The shrimp scampi was the best I've ever had. Came with 6 massive flavor-packed shrimp. The sauce was lemony and garlicky. My husband got the Rigatoni with pork gravy which he said was one of the best dishes he's ever had. The person next to him ordered it and once he saw the result, he had to get it. He also got a side of meatballs ($9 what a deal!) which lives up to their reputation. The snickers cheesecake was oh so gooooodddd. <br><br>COME HERE! MAKE A RESERVATION!!!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QsZHhvxP2yyBnPQrfIivUA/168s.jpg", "caption": "Shrimp scampi"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IuAeI8BSTpWFtagyJES-ZA/168s.jpg", "caption": "Snickers cheesecake"}]}}, {"review": {"des": "Went here after seeing Hamilton..very nice Italian restaurant...the ambiance was so relaxing and comfortable. The food was so delicious, full of flavor, just wonderful.<br>Highly recommended~", "pics": null}}, {"review": {"des": "Great food!! And really good service! Came here before the game and it was a great place to eat! Waiter was awesome, quick, and efficient-got is served quickly so we could go to the game.", "pics": null}}, {"review": {"des": "We were from out of town and looking for an authentic Italian restaurant to go to. We chose this place based on reviews and it did not disappoint! The atmosphere was lovely and the food was delicious! I had the meatball sandwich and my other half had the rigatoni with vodka sauce and sausage - he said it was one of the best pasta he's ever had! We would definitely come back here the next time we are in town.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CTAr6dIIPe6aXo3LwmPSdg/168s.jpg", "caption": "Meatball sandwich"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/79nX09ODS8OGzt1n02g5Lg/168s.jpg", "caption": "Cannoli"}]}}, {"review": {"des": "Awesome little Italian place in the West Loop near the United Center. I've been here 3 times, all for business lunch meetings. The food is some of the best Italian you can get in Chicago at a great price. Staff is extremely friendly and welcoming. I'd recommend Viaggio for a nice lunch or date night dinner.", "pics": null}}, {"review": {"des": "Came here for my birthday because I wanted something that everyone could eat ( who doesn't love Italian) and a non-chain restaurant atmosphere. Wow, what a great experience we had from start to finish! We had everything from cocktails to apps to main courses and desserts and I can honestly say you cannot go wrong at this place! They take what they do very seriously and we really enjoyed the overall experience (all 8 of us) we will return!", "pics": null}}, {"review": {"des": "Round Two:<br>Due to our Uber driver's familiarity with the restaurant location we were actually 30 mins early.  No problem, our table was ready for us. Warm greetings and a big hug from Dave welcoming us back with my husband's jacket in hand. The food didn't disappoint. Being the start of the Memorial Day weekend, they were packed. Nevertheless all the customers received the same genuine attention. Our server, Nicholas was very attentive making sure we were satisfied with our meal. He even treated us to some homemade limoncello. Yum!  My husband had the Salmon which was not only flavorful but very moist. I had the Bolognese. The sauce was so savory. As we left the restaurant, we again received a big hug from Dave with warm wishes for a safe return back to Hawaii. If were ever in Chicago again, our first stop will definitely be Viaggio. A hui hou kakou (Until we meet again).", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VnqcchcvZaMI5_n7S8YLTA/348s.jpg", "caption": "Key Lime Pie"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_yv7Ja_Y6ySrd7lWHwe9yg/168s.jpg", "caption": "Salmon Oreganato over Angel Hair"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/F-xaqKERH9s-t3R2ToiLvw/168s.jpg", "caption": "Penne Bolognese"}]}}, {"review": {"des": "Place was a great. The carbonara pasta was super creamy and delicious, pancetta was cooked perfectly. Bruschetta was very fresh and flavorful, perfect crunch to the crostini. Bread served at beginning was nice and warm. Oil/cheese/pepper with bread is the best! Staff was very friendly, cute peaceful outdoor seating is available.", "pics": null}}, {"review": {"des": "Pros:<br>- Atmosphere<br><br>Cons:<br>- Very busy, will have to wait for 10-15 mins, even with reservation<br>- Food is acceptable but not great. I prefer Coco Pazzo, Coco Pazzo Cafe, and Carmine's", "pics": null}}, {"review": {"des": "Great West Loop gem for lunch. The place is old school Italian and packs a lot of flavor into their chicken Parmesan. At $12 (maybe $13) it is a steal and comes with a generous portion of pasta for a very filling meal. The warm bread to start with olive oil is also great. I've taken several people here for lunch and never left disappointed.", "pics": null}}, {"review": {"des": "We came here to celebrate my friends' birthday on a Saturday evening. There were 6 adults and 3 kids (2 toddlers, 1 infant). They were very nice and accommodating. My friends who arrived before us told us the host greet them nicely and they were super friendly. I'm glad that was the treatment we received because going to place with kids when it's more of an adult setting can be a bit challenging. Food was good. I had the lasagna and it was tasty. My husband had their skirt steak ravioli and he really enjoyed it. We all shared the mussels in white sauce (which was good) and meatball salad (also good) as appetizers. One of my friends ordered their pork chop parmesan. It's HUGE! He couldn't finish it and had to pack it home. Food portions are big - so expect to be full. One of my friend  ordered one of their linguine dishes - she said it was more bland and not as tasty so she didn't enjoy it as much but she enjoyed her husband's dish which was another pasta dish with chicken? We ended the night with tiramisu and that was really good. Overall we had a good time and the service was great! Will be back for sure. Parking is not hard - you can find free parking on the side streets. They also do valet out front for $12.", "pics": null}}, {"review": {"des": "DELICIOUS! Everything was great here. Get the shrimp scampi, our table agreed that was the best dish out of everything we all ordered. It is the best shrimp scampi I've ever had. The lasagna was HUGE! We go bruschetta as a starter which was good too. We devoured it before I could take photo evidence. We also devoured the Oreo cream pie for dessert was the perfect sweet touch to close out the meal. Next time we're in Chicago we will absolutely be back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sakk77eC8k3V31e94o8mHQ/348s.jpg", "caption": "Huge yummy meatballs"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KfbC4lE6r0iayEoTGueteQ/168s.jpg", "caption": "The best shrimp scampi you'll ever have"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XEpkJSeiOvs24EUhgk_-TA/168s.jpg", "caption": "Enormous lasagna portion"}]}}, {"review": {"des": "The atmosphere of this restaurant is amazing. I had the special, ravioli stuffed with short ribs with a cream sauce. Delicious! We had espresso for dessert! The wait staff were attentive! Would definitely recommend and return!", "pics": null}}, {"review": {"des": "I came here with a group of friends. I can start by staying we had a great experience here, from when we enter and leave the place.  <br><br>Our server was excellent, I give him a 10/10. He was very patient and attentive.  Every questions we had about the menu , he had an answer for.<br><br>The food was just amazing. I had the Rigatoni with shrimp and vodka sauce.  Every single bit was Amazing. Best Italian food I've had so far.  <br><br>Overall everything is good about this place.  The service is excellent, but the food really did it for me. I will definitely come back here again.", "pics": null}}, {"review": {"des": "Absolutely fantastic taste combined with phenomenal service.  The risotto was incredibly delicious!!! We will definitely be back for more.", "pics": null}}, {"review": {"des": "My boyfriend and I came here after he went with friends and raved about it. When I saw it had five stars I said count me in! The service here was wonderful and I liked the family owned vibe. We sat outside and I thought we were in Europe for a bit. We ordered the honey mustard salad to start and I can't believe I'm saying this but it was 100% my favorite part of the meal. It tasted like the dressing was made with with the fanciest bottle of fresh mustard you've ever seen. We then ordered some pasta. I figured I had to order the cavatelli because this is clearly Viaggio's specialty but wow, it was intense. It was so rich I could not eat more than 1/4 of the plate. I think there is a time and a place for this kind of meal but I may just go for spaghetti marinara next time, to be honest (with that salad of course!) Oh and they also passed my \"slightly\" dirty martini test!", "pics": null}}, {"review": {"des": "Viaggio is a West Loop institution I have been coming here for years and have always had good experiences. It is a great place to grab a bite or a drink at the bar. <br><br>Ambiance it is the perfect date night spot and place to grab dinner before a Bulls or Hawks game. The white table cloths are perfect and there is enough space between the tables to have an intimate dinner. The Bobby Hull jerseys on the wall are a classic touch. <br><br>Staff is always very helpful and they ask questions to help figure out the best item on the menu to order. They gave 2 great reccomendations.<br><br>Food is always good and the Calamari I ordered was one of the best that I have had in the city. Very traditional Italian food and the food has incredible flavor. The Calamari was so good it disappeared before I could take a picture of it. I enjoyed the Lasanga too and it elicited a food gasm.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dQ3YyiFMnO7RIhQUpgd_QA/168s.jpg", "caption": "Lasagna was pure perfection simple and loaded with flavor."}]}}, {"review": {"des": "If you want authentic Italian food, come here. If you want amazing service, that feels like family, come here. If you're looking for a place to eat at before the Hawks game, there is no other option, you seriously must come here. <br><br>Viaggio will forever be my favorite Chicago restaurant when I'm in serious need of Italian comfort food. <br><br>First - you're greeted from the host with a genuine smile and welcome. It very much feels like you're coming over to a relatives home. I've never really noticed how robotic hostess can be until I came here. Even the servers were incredibly outgoing, not to mention are very seasoned in this industry, and you can absolutely tell. <br><br>Second - WEAR STRETCHY PANTS, 'cause good lord, you'll need as much extra room as possible.... The food is incredible, from their famous meatball salad (didn't realize that was a thing until this place came into my foodie world), to all their pasta dishes and sauces (I can drink the vodka sauce alone, and be perfectly content), you will leave here happily full. <br><br>Lastly - Viaggio is not a huge place (not tiny!), and I kind of love that. The atmosphere feels like a small hole in the wall restaurant found in Italy. From the candlelight mixed with the dim lights (might need to use your flashlight on your phone for ordering!), and dark, rich colors on the wall, this place is absolutely perfect for date night, or when you're trying to impress the in-laws/out-of-towners.<br><br>SIDE NOTE: Apparently Viaggio is opening up a 2nd location in Highland Park near Ravinia. I will definitely be planning a very Italian picnic when I see a show this summer!", "pics": null}}, {"review": {"des": "What a fantastic experience!!! The amazing food, the comfortable atmosphere and the beautiful bar aside, Jen the bartender... absolutely the highlight of the evening! Just a funny, warm and energetic person. I can't say enough about her. Absolutely recommend this place to anyone looking for authentic, delicious Italian food. And I hope you're lucky enough to get Jen as your bartender", "pics": null}}, {"review": {"des": "No doubt, this place holds its own as a solid Italian joint whipping up classic dishes (i.e., spaghetti with meatballs, fettuccine alfredo, rigatoni ala vodka, etc.). But poor service and a lack of culinary ingenuity mean this place can't quite compete with other Italian behemoths in Chicago (think Piccolo Sogno, or even Sapori Trattoria). For what you pay, you're better off going to La Scarola for an even more authentic Chicago Italian dining experience. <br><br>Service is probably the reason for a three-star rather than four-star rating. Our server was inattentive and seemed to be assigned to too many tables. <br><br>Probably won't return, especially with many other Italian choices in this grand city.", "pics": null}}, {"review": {"des": "So glad we came here! The food was outstanding, I had the eggplant parmesan and it was fantastic! Our server was awesome (even though he was an Ohio State fan BOOO) but he treated our group with such class. Overall we had a delicious, fun, and relaxing dinner. Thanks for the great dinner experience!", "pics": null}}, {"review": {"des": "Viaggio continues to hit it out of the park for me.  Whether it's the friendliest people around who greet you when you first cross the threshold, or the bartenders and servers who go out of their way to take care of you, you feel like a friend the second you enter.  And it doesn't matter if your last visit was yesterday or a year ago, somehow this talented team remembers you.<br><br>The food is always spot on and whether you are there pre or post a United Center event, with a big group or small, you always will have a great time at Viaggio.  <br><br>On my most recent visit- they had a lobster ravioli which was terrific served with peas and shrimp as a special!  It rivaled my fav rigatoni and pork which is what I usually have there.  And the slice of key lime pie that ended my meal couldn't have been tastier.  Serve that all up with some great wine, limoncello and complimentary bread and cheese and it was a wonderful evening of food and drink.<br><br>Thanks to Dave and the team for making my friends and me feel special on each and every visit.  It is much appreciated!", "pics": null}}, {"review": {"des": "Really authentic feeling place! The bruschetta was absolutely incredible. We haven't had bruschetta like that since Italy! He got the Sunday ragu, and I had the vodka cream pasta and added shrimp and mushrooms. It may sound simple but it was sooo good. We finished off an already huge meal with the tiramisu. It was decadent and had a delicious whipped cream on it. The vibe is not upscale Italian- it's more like your Italian family's house with some really tasty food and friends. The price was great and the portions were big. We will be back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fkgU6Jeo18LAvrvFR_Inxw/348s.jpg", "caption": "Tiramisu"}]}}, {"review": {"des": "We ordered delivery and it was really excellent.<br><br>Always reheat your delivered food- on the stove.<br>(Heat a skillet with little water in the bottom to maintain moisture once you cook the dish for about 3 minutes in high)<br><br>Bread is always a litmus test- simple and tasty<br><br>Bolognese (with a fettuccine or linguine noodle) was excellent<br><br>The vodka sauce rigatoni dish...I also ordered a sausage on side, sliced and added to dish with a little ground red pepper...awesome.<br><br>Large portions!<br><br>Very good food- enjoy", "pics": null}}, {"review": {"des": "We were excited to try Viaggio's after reading such great reviews. We were not disappointed. We tried the meatball salad and this has spoiled me on any other meatball. It was juicy and flavorful and the sauce was perfect, not too acidic. We also tried the burrata with truffles and it was creamy and dreamy. We shared the five finger pasta and meat sauce. It was also scrumptious and filling. The service was top notch and we are definitely returning!", "pics": null}}, {"review": {"des": "two words Spaghetti Carbonara!  I actually order it with penne pasta though.  Live changing.  SO flipping good.  I have only ordered takeout from here twice, but both were exceptional experiences.", "pics": null}}, {"review": {"des": "Dined for lunch, waiter was on point. I was disappointed due to lunch options. Will I revisit probably not, definitely not on my list for a go to restaurant for authentic Italian cuisine.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fmGzHdSryhFZ3PKvfdFKBw/348s.jpg", "caption": "Lemon Chicken, Asparagus, and Garlic/Olive Oil Linguine"}]}}, {"review": {"des": "This was not a good meal at all. We had the lasagna and house made cavatelli with tomato sauce. The lasagna had no flavor at all: the tomato sauce wasn't cooked long enough so it still tasted like it came straight from the can, the ricotta cheese was unflavorful, and a huge layer of processed mozzarella cheese on top did not add any flavor either. So bland. The house made cavatelli noodles were sooooo thick and chewy and over cooked and clumpy. I looked up cavatelli online earlier and the shape is not the same. It was long thick pieces of pasta that were like glue once you started chewing. The sauce on this dish was actually good but it couldn't save the dish. We had a meatball on the side and it was decent but too salty and the tomato sauce was not good (tasted like can). There are so many better restaurants in the city than this one.", "pics": null}}, {"review": {"des": "We came here for my birthday and I was impressed. It's an old school Italian place in west loop, small but cozy and an older crowd which I really enjoyed! We had a reservation for 7 pm and our table was ready when we arrived. The staff for super friendly and talkative which with my family is a plus! We love to chat. My niece who is 3 was also with us and they treated her like royalty. The food was phenomenal. I got the special which was a braised pork ravioli and it was melt in your mouth yummy! My husband got the pork chop parm, it was huge! So good! <br>We really enjoyed everything from the good conversation to the great food and yummy creme brûlée that they brought out for my birthday dessert. The place was really starting to fill up later with such an older crowd and it was really fun to see that Age group out enjoying the night life.", "pics": null}}, {"review": {"des": "We had an outstanding meal sitting outside on the sidewalk cafe. The risotto was spectacularly combined with mushrooms, sausage and sun-dried tomatoes. My sea bass was sautéed in a buttery lemon sauce topped with artichoke. The eggplant parmigiana and \"West-loop chicken parmigiana\" were both also spectacular. Great service and family style dining. <br><br>I highly recommend you try this place.", "pics": null}}, {"review": {"des": "Solid 4 stars.<br><br>Complimentary bread that came with olive oil, crushed red pepper, Parmesan, salt and pepper, and some oven roasted peppers. The bread was hot, nothing too special but overall pretty classic.<br><br>Ordered the rigatoni vodka with a side of meatball per other Yelp reviews. The pasta is solid. It is definitely good pasta with vodka sauce. I'm actually picky about penne vodka but thought they did a really decent job with classic favoring (I am eating those leftovers as I write this). The meatball though is what everyone raves about. So the quality of the meatball is good for sure but for my tastebuds, it was a bit on the acidic/tangy side. It definitely didn't make the meatball taste badly necessarily, it was just a different way of making it that I was more surprised at. Thought it would be more of a super savory smoky taste. <br><br>I liked the atmosphere, it was on the smaller side but quaint and bustling. It reminded me really of what I would think Italian family life would be. Definitely worth checking out, really enjoyed the service and the friendliness of everyone there.", "pics": null}}, {"review": {"des": "Great classic italian menu with a cozy atmosphere. The service was superb and the food was delicious. I started with the meatball salad and it came out quickly and was very good. The dressing had a good flavor. The meatballs were very tender but I felt like the flavor of the tomato sauce could have been a tad sweeter for my taste. I got the linguine and clams for my entree and it was delicious. Lots of clams throughout the pasta and the flavor of the sauce was good with lots of garlic. The sauce was the perfect thickness and coated the clams and the linguine very well. I ended with the cheesecake and it was decent. The cheesecake was a little too dense for my liking, but overall the food here is great, lots of good options and I'll be back to try some more.", "pics": null}}, {"review": {"des": "The energy, the vibe, the smells - all wonderful as you walk into this place. You hear a lot of laughter and talking, sports playing the tvs, sports memorabilia in your visual field; all in all, a fun introduction to what turns out to be a great restaurant. <br><br>When you enter you are greeted by a happy talkative gentleman who is delighted to have you there and he seems happy to be there. You are seated and the first thing you receive are roasted green peppers in garlic to eat with the hot crusty bread that has just been put down in front of you. Delicious and they happily replenish both! The wine list is nice, the wait staff knowledgeable, and the menu inviting. All in all, a great evening, go with friends, enjoy, and have fun. The food was delicious and presented very nicely. As an aside, they have no issues with you sharing dishes, in fact they separately plate the shared dishes. <br><br>But what makes this restaurant stand out is the way they handle mistakes; and mistakes happen all the time, everywhere, and by everyone. I have serious food allergies and was accidently served a dish that could have resulted in my being hospitalized. We caught it at the table, I was not the nicest person in the way I initially responded to the mistake, and yet the staff was great. The owner/manager took responsibility, did not blame the waitress, explained things happen, he would ensure it did not happen again, and asked us to please enjoy the rest of our evening. The waitress apologized and we even hugged at the end of the evening. Normally I would have left as I would not have trusted the place, but the response of the owner/manager and the waitress gave me great confidence that we should stay and enjoy our meal and we did, and I am very happy to say we will be going back and soon! <br><br>This is a place not to be missed and should be on everyone's list of places to return to as often as possible!", "pics": null}}, {"review": {"des": "Very good restaurant with great food and service, I'll come back here for sure!<br>Recommend the Salomon for main course", "pics": null}}, {"review": {"des": "UBEREATS REVIEW -- I ordered the pasta with Sunday pork gravy? I forgot the actual name, but it was amazing. It was a lot better than I thought it would be... it had spice to it (Aka flavor). <br><br>I will definitely order this again!", "pics": null}}, {"review": {"des": "We dined her today for lunch.  Service was excellent and the food is delicious.  It gets crowded for dinner, so make reservations.  I think our server's name was Christie or Christine.", "pics": null}}, {"review": {"des": "Amazing food and service! Had the house risotto which was probably the best I've ever had.<br><br>Service is always amazing. Waitress was awesome and brought us multiple rounds of free lemonchello shots since we were celebrating a wedding, bday and engagement with the group of people we had.<br><br>Cocktails were solid, kinda strong which isn't a bad thing. If there was one slight area for improvement, that would be it.<br><br>Overall this is a stellar place, one of our ultimate favs in Chicago for Italian.", "pics": null}}, {"review": {"des": "I have been to Viaggio a number of times. The food has always been enjoyable and the staff friendly. Tonight I ordered Lasagna with a side of Spinach. Again very delicious. My concern lies with the following. Because I had a pretty heavy lunch, I couldn't eat even half of the food I ordered. Only ate about 1/4 of both. With that said I notified the Bartender that I wanted the Lasagna and Spinach to go. When the Bartender brought the food over, I took a peak under the lid and noticed the nice square block of Lasagna was dumped into a to go container and noticed the Lasagna and the Spinach were mixed up. Not sure how that happened as they were separated initially. But I decided to grab a knife and my fingers and started separating the Spinach from the Lasagna. I also noticed I got none of the Meat Sauce, so I asked the bartender if I could get some meat sauce on top of the dumped Lasagna. No lie people, the bartender grabbed the container went behind the bar and knelt down. I was like wtf is he doing. Either they have Meat sauce hidden behind the bar or he was scooping meat sauce off some of the used plates awaiting to be picked up for washing. Still a little shocked and not wanting to make a scene I just said thanks all around and left. On the way home, I called my lady to get her take and she immediately said \"are you nuts, throw that food away\". Which I did. Sadly I also tipped. Shame on me!! <br><br>To the owner if you have concerns here, look back at the tape from the Cameras you have behind the bar and see what this guy was doing. Laziness like that is not acceptable as this could cause serious health related issues. That restaurant is your pride and joy. I sat at one of the 2 seat tables across from the bar. By myself. Date is Tuesday 4/17. The time frame you need to be concerned about is 8:25 thru 8:45 pmish. I give people the benefit of the doubt, but that has me concerned.<br><br>Update!!!!!!!!! 5/3/18.   Zero response from management or owners. Highly disappointing and extremely concerning!", "pics": null}}, {"review": {"des": "The food and service is amazing.  Met the owner, Dave and he's super nice.  Talked about Blackhawks hockey and the surrounding community.  I can't say enough good things about this restaurant!  Had the lasagna and my husband had the parmesan pork chop.  OMG!  Amazing", "pics": null}}, {"review": {"des": "We enjoyed very delicious dishes (rigatoni vodka and mkp risotto) and atmosphere was great as well!", "pics": null}}, {"review": {"des": "Great service!<br><br>First great thing about this place, they take reservations from you like normal people, not through a whole event planner??<br>[First time hearing from a friend, that lives in Chicago, that you have to go through an event planner to make reservations. What the heck? Event planner is making some easy money for sure though.]<br><br>Our server, Julie, was patient, friendly, and attentive.    We were that annoying table of 10 that comes in one by one and orders at all different times. Good thing for the servers, but bad for customers is that they don't allow separate checks and only allow 1 bill per table. <br><br>Complimentary bread, parmesan, olive oil, peppers! Yummmm... I was good with just eating that. <br>Lasagna, was good and the texture part was cooked perfectly, but unfortunately, the taste was a little sour for me. My other friend who ordered it, loved it though! Tried my friends Chilean Bass with pasta, now that was amazing though. <br><br>So sweet of them to sing to my friend and bring out a complimentary Tiramisu for her birthday. <br><br>Overall good experience.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/olu_H4HHZ-jp0Ukr0Q1GLw/168s.jpg", "caption": "Lasagna"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/e5QWtGj9fY-wU5-HSZRIRQ/168s.jpg", "caption": "Chilean Bass with pasta!"}]}}, {"review": {"des": "I seriously LOVE the food here and have been coming here with my family for a while. We came here this past Sunday after a long day of shopping downtown. I live in the West Loop neighborhood and frequent this restaurant. As a family, that is Italian, we like to try and share a variety of foods. We ordered a salad to start had a glass of wine and then ordered 4 entrees. When we received the bill at the end the server charged us 3$ to split two of the dishes (a total of 6$). ARE YOU KIDDING ME? We are by no means cheap and dine out A LOT at many Chicago restaurants and this was sneaky and snake like of the server to do something like this. I 100% understand it we only ordered 3 dishes but the fact is we all ordered an entrée. When my dad called this out to the server he knew he was in the wrong and didn't try and correct it. He just stood there in disbelief and couldn't believe my dad called him out. It was absolutely uncalled for and he was not apologetic even to say, \"oh my gosh I am so sorry let me adjust that for you.\" I am in the service industry myself and this is not something that I would ever try to cheat a customer on. He cost himself the tip and frankly we unfortunately will be steering clear of this restaurant. <br><br>I tell multiple people to go here and I will not be doing that going forward. It's a shame because the food is so good.", "pics": null}}, {"review": {"des": "These peeps are professionals. They hit on all cylinders - food, ambience, professionalism, customer service,  just a damn great time.  Staff recommendations were spot-on. EXCEEDED Our expectations.  Highlight of our night, and surprisingly more fun than the concert that followed.", "pics": null}}, {"review": {"des": "Really  awesome food. Owners and staff very friendly.  Great atmosphere in a co neighborhood.  Well worth the drive from south suburbs.  Beautiful bar area. Warm and inviting and very attentive  staff. The tiramisu is to die for.  We will definitely be back and it could become a  regular monthly trip for us. The pasta is perfectly al dente. The outdoor cafe is a fun looking spot. Valet parking is reasonable and efficient with very friendly fellas.  You will not be disappointed.", "pics": null}}, {"review": {"des": "The food here is only surpassed by the service you will receive. Everyone from the hostess to the bartenders and waiters were excellent all night. If you like Italian food and haven't been yet, just reserve your table now. It can get busy before a bulls or Blackhawks game so check the sports schedule, but don't let that stop you from trying this place.", "pics": null}}, {"review": {"des": "We had great service and excellent food. The waiter allowed us to sample 6 wines before purchase, and he would've had us sample more if we hadn't made our decision. Went on a Wednesday night and essentially had the place to ourselves. Highly recommend for a date night!", "pics": null}}, {"review": {"des": "Thanks to fellow Yelpers for helping me find Viaggio.  This is a classic neighborhood, authentic Italian restaurant.  The service was exceptional.  Sausage & peppers appetizer were great.  Excellent Caesar salad with anchovies.  The homemade lobster ravioli was on point.  If you are in the area stop by.  You will not be disappointed.", "pics": null}}, {"review": {"des": "Second time here. The server was great and the food was decent, but the owner was rude and short when talking with us. Definitely should take after his employees but definitely won't be back since I refuse to give him more of my money.", "pics": null}}, {"review": {"des": "Honestly, I like my food better the first time when  I ate here a few years ago. When my hubby said we were coming back again I leaped with joy.  That's why I'm a whew bit disappointed, overall the food was edible- brick chicken, clam pasta, Alfredo fettuccine and calamari.  Oh, the Snickers Cheesecake was absolutely delightful.  I gave 4 stars for CS, you have to love Christine, that girl's a riot. I'm talking free non-stop entertainment during your entire stay from the moment you step foot into the door.  She is quite awesome. Thanks!", "pics": null}}, {"review": {"des": "This is one of my favorite restaurants in Chicago. The service is exceptional and very personal. You are made to feel as though you are the only customer in a restaurant that is full. Several of us had the Chilean Sea Bass it was delicious. Someone else had the short rib ravioli that was so flavorful it was out of this world! We shared desert, key lime pie, it was recommended by our server and it was the best I ever had.     The owner Dave greets everyone like  an old friend. I travel to Chicago a couple times a year and will always make time to come back here.", "pics": null}}, {"review": {"des": "This is the best Italian food I have had since I went to Italy!  Great flavor and services was fantastic.  If you are in the are stop in and have a bite!", "pics": null}}, {"review": {"des": "Great food, great atmosphere, but the best was our waitress, Jennifer. Fun, knowledgeable, honest, and engaging.", "pics": null}}, {"review": {"des": "I decided that I wanted to eat chicken Parmesan as the \"last meal\" before I was to be induced. We found this place on Yelp & chose this place due to the reviews. The food was amazing! We didn't have any drinks. He ordered the special, which I believe was rigatoni with sausage in a wine sauce. I had the chicken parmesan with a tortellini Alfredo & it was perfect! My partner said the breading wasn't as crisp as he liked but I thought it was great. The red sauce & Alfredo sauce was so flavorful. We had the bruschetta for the app. We both thought it could use more basil. Tiramisu was ordered for dinner & finished a great meal. <br>We will definitely be back.", "pics": null}}, {"review": {"des": "Absolutely 100% yes. This is hands down the best Italian restaurant I have ever had the privilege to dine at. The service, top notch. The ambience, top notch. The menu, top notch. The food, TOP. NOTCH. <br><br>Visited Viaggio's before a night at the lyric opera. It certainly set the pace for the remainder of the night. Very bourgeois.<br><br>There was a bread bowl with olive oil and herbs for us to munch before ordering the appetizer: the meatball salad. Okay. Seriously? That meatball was the best ball I've ever had in my mouth. Like, extremely moist, melted in my mouth, seasoned to perfection, actually somewhat of a kick. Perfection. I would never have imagined pairing meatballs with tomato gravy with greens. But it worked. Seriously, it is worth the price. <br><br>I ordered the pork chop Parmesan. This dish was pricy but for good reason. I had no idea it was going to be as massive as it was. I mean it was actually bigger than the plate. The pork was juicy, tender, seasoned perfectly, smothered with fresh mozz and tomato gravy. It was served with creamy tortellini. The tort wasnt hot, but it was still delicious. Made from scratch pasta is the way to go!", "pics": null}}, {"review": {"des": "Consistently the best Italian Restaurant in Chicago.  I've never had anything bad on the menu and the service is top. I'd highly recommend this place for groups, dates, girls night out...always a hit, never a miss. Make a reservation way in advance on game or concert nights. Go, now (and order the Immigrant Red Wine that you can't get anywhere in the city).", "pics": null}}, {"review": {"des": "We were a group of four that came on a Thursday night. The food was very good. Our server was friendly, and very enthusiastic. He made everything sound amazing. Our water was constantly refilled. So why only 3 stars? <br><br>Well, this wonderful meal was finished in record time. We arrived around 6:10 pm, and we left by 7:04 pm. We ordered drinks, one appetizer, four entrees, and dessert. That's three courses all served within one hour. Before we even settled in, our server asked what we wanted to drink. We quickly ordered, and our food came just as quick. The second we slowed down on our entrees, our server instantly showed up to ask us if we wanted the leftovers packed away. We figured we can just get some dessert and just chat over that. But dessert was just as rushed.<br><br>We haven't gotten together for many years, and we were really looking forward to catching up. So, it was a complete let down. Honestly, the food was good, and our server was nice, but the whole experience was a disappointment. We ended up going to another place to have more desserts.", "pics": null}}, {"review": {"des": "I came here for dinner for NYE with a couple of my friends. We figured that it might be a good way to bring in the New Year with some amazing italian food. We arrived around 6pm and it didn't seem very crowded. The place is pretty small so making a reservation is key. I think the crowd really started to come in around 7:00ish. They give you fresh bread served with sauteed peppers which was delicious (you just have to like  green peppers). My friends ordered the vodka sauce pasta, a side of meatballs, and I ordered the pork gravy pasta. I am not usually a fan of vodka sauce pasta but my it was very good. The sauce was incredibly rich and it had such a great flavor. I think it would be very tasty with shrimp! My dish was very good as well! Bold flavors, tender pork pieces, and the sauce was very rich.  I wish they served it with my ricotta to cut the salt from the sauce and to cut the richness as well. The only reason why I can't give this dish a solid 5 is because I felt it was super salty. I do love salt in a dish, but I think it was a tad bit overboard.We also ordered burrata and baked clams which I would skip (it was underwhelming to me). I would encourage you to order a side of meatballs and just split them. They were absolutely amazing and just melt in your mouth! That was the best appetizer for the night.  Do order the creme brulee for dessert and split it with friends. It's a nice way to end the evening. I loved that the owner came by each table to check on service and if everyone enjoyed their food.", "pics": null}}, {"review": {"des": "Met up with some coworkers for dinner and had a delicious meal. Drinks were good but the food was outstanding. We shared some appetizers and then everyone ordered a meal. I had the lobster ravioli in vodka sauce. So yummy. Staff was super friendly. Parking was easy to find. Looking forward to my next trip there.", "pics": null}}, {"review": {"des": "Best Italian food I've ever had and incredible atmosphere! Worth the trip out of downtown", "pics": null}}, {"review": {"des": "Let me start by saying - This place is special<br><br>From the moment I checked out the menu on Saturday afternoon until the time we left Saturday night, this was one of our most enjoyable meals in the city.<br>Yes I was with old friends that always have a great time together, but Viaggio made the night memorable with great food, phenomenal service and a terrific atmosphere.<br>Even the music was perfect.<br>The seven of us all loved our dishes and even though portions are plentiful, you just wanted to keep eating.<br><br>Could not recommend or give more stars if I tried.<br><br>Highlight of a reunion weekend.", "pics": null}}, {"review": {"des": "One of the BEST Italian restaurants I've ever been to!  Excellent service, wonderful atmosphere and delicious food from start to finish.  100% will be coming back to Viaggio's next time I'm in Chicago!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JADOTFAYNZpts3thAd8w_A/168s.jpg", "caption": "House lasagna"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gN8w-iQkjlF9Vp8BAas3Bw/168s.jpg", "caption": "Pappardelle pasta with shrimp and vodka sauce"}]}}, {"review": {"des": "I read the reviews for this place and I thought it seemed very nice to order from. But my friends and I went to this place last Friday and got food poisoning! We both woke up in the middle the night puking everywhere! And I was for sure is from this place because I have not ate anything the whole entire day and this is the only thing I have ate. So try not to eat here if you or if you do don't get the spaghetti!!!", "pics": null}}, {"review": {"des": "Rigatoni with Sunday pork gravy - unbelievable! The vodka sauce is amazing too. Meatballs are tender, delicious and you can taste the veal! <br>Ask for Julie - best server ever! She is the par excellence of serving: expressive, ebullient, and an expert in our needs!! I've never enjoyed a server more who can juggle multiple tables and make us all happy.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/I7qSNr52QES5q1d2UR6l7A/348s.jpg", "caption": "Tiramisu- OMG I can die happy now!!!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_j7ja3NLwp1e_a0Am9afHg/168s.jpg", "caption": "I forgot to photograph the bread but it was amazing too!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1Oi2-rrTHgfr35qbhtONMg/168s.jpg", "caption": "Lemon drop with homemade limoncello"}]}}, {"review": {"des": "This is my favorite place! Full disclosure I am a regular. It's a fantastic family style Italian restaurant. The food is great and the staff treats you like family. It's a West Loop gem. It might not be on Randolph Street, so sometimes I think people from other parts of the city might overlook it. But I simply feel that most West Loopers that dine out regularly and love good food, have this place in there restaurant rotation. Meatball salad, Shrimp Dakota appetizers are recommended. Along with the Rigatoni Sunday pork gravy as an entrée.", "pics": null}}, {"review": {"des": "Came here with my boyfriend 3 times so far so I figured a review was much needed.<br>This place has some of the best Italian food if you are in the West Loop/West Side area.<br>The staff and owner are so down to earth and extremely friendly.<br><br>We always get the West Loop, It is lightly breaded veal with Spinach, Ricotta, Tomato, Mushrooms; served with Tortellini Alfredo. LOVE! <br>The portions are amazing as well. Perfect amount to either split or take home for a second meal.<br><br>If you are off Madison, definitely consider Viaggio!", "pics": null}}, {"review": {"des": "I thought Viaggio was quite delicious.  We visited with friends on a Friday evening and were seated inside quickly.  <br><br>The servers were really friendly and helpful with recommendations and servers were efficient, but also didn't rush us at all (we were talking and couldn't decide on orders).  <br><br>I tried the meatball and also had penne with vodka sauce.  It was very very delicious.  The meatballs were huge and perfect - nicely juicy and perfectly cooked with a great flavor.  The pasta was wonderful - cooked well and portioned nicely (not too huge as at some restaurants).    I wanted to order 10 more meatballs - I can't wait to eat them again.  Leftover on a bun...yum!  <br><br>Also, excellent house made limoncello!<br><br>Definitely worth a visit.  Inside is what I would call an atmosphere of traditional Italian (a little bright) and they also have a little patio outside for when the weather is nice.  <br><br>Food - 5<br>Service - 5<br>Atmosphere - 4<br>Value - 5<br>Bathrooms - 5", "pics": null}}, {"review": {"des": "Perfectly laid back, friendly, neighborhood favorite it seems from the look of the crowd, some dining al fresco with their furkids.  Food was spectacular and I took the server up on the suggestion of house made ravioli.  Lemoncello afterwards is also made in house -yum!  So glad Yelp found this place for me!<br><br>Owner is a great guy and knows how to make his guests feel right at home.  Even hailed a cab for me.  I'll def be there next visit to the area!", "pics": null}}, {"review": {"des": "First time here and very impressed. Warm welcome and great service. Solid manhattan and offered a taste of wine before choosing a glass. All four dishes were good although the risotto was on the salty side. No major complaints and would not hesitate to return.", "pics": null}}, {"review": {"des": "I thought the food was fantastic. I had the meatball salad and the sea bass. Espresso was fantastic as well.", "pics": null}}, {"review": {"des": "First off, I'd like to shout out to the manager for being super flexible with our group. I made reservations for 6 way in advance and added a 7th person a few days before our reservation. Even though they were full for the night, they reassured me that they'd figure it out. The day of the event, my graduation ran long and we kept pushing the reservation back but they were super nice about it. When we arrived an hour later, our table was ready for us! <br><br>The food itself was pretty good. We got 6 dishes for 7 ppl and had almost an entire dish left over. So def recommended to share! The chicken parm was my favorite. The cavatalli was undercooked for our liking. Everything else was pretty average. It all taster good, but not all that mind blowing. <br><br>For dessert we got the kaluha cake, tiramisu and creme brule. The tiramisu and creme brule were great but the kaluha cake was too sweet and kind of dry. Skip. <br><br>Overall, cute place, reasonably priced and worth checking out!", "pics": null}}, {"review": {"des": "My must-go restaurant when I visit Chicago. Awesome food, great service. I had west loop veal with meatballs and a glass of carbenet. Had a high expectation before I come and it didn't disappoint me. Good portion of food and tasty wine.", "pics": null}}, {"review": {"des": "Nice atmosphere, waitress did great service. Ordered two pasta and they were okay. I expected something to be different or outstanding but I would say they were just decent.", "pics": null}}, {"review": {"des": "Oh, the parpadelle! Everyone has had that moment where they wish their stomach was a bottomless pit to enjoy every morsel of a meal. This was one of those moments for me. I ordered the vodka parpadelle and I never wanted it to end. I wanted to keep eating, but my body told me I had to stop. It was creamy, rich, and the pasta was cooked perfectly, evidently homemade. It had just the right about of bite and the sauce coated each noodle. I'm salivating... If you do one thing when you come to Viaggio, it's order the parpadelle with vodka sauce. I finally found my favorite and it's in a city I don't live in. *single tear slides down my cheek* <br><br>Other things you must try include the meatball salad, it seems unusual, but it makes sense when you eat it. Lettuce and savory marinara mix together with a bite of tender meatballs. The burrata is wonderful. One must always enjoy burrata at an Italian restaurant, it is a requirement. Coupled with many glasses of prosecco, it turned out to be a wonderful night and the service was top notch from beginning to end.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/31Y3_isAtLoizeF-c2gfhA/168s.jpg", "caption": "Parpadelle with vodka sauce"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9VkF3ZOQUjv0-2oHeAD5cw/168s.jpg", "caption": "Meatball salad"}]}}, {"review": {"des": "Egg plant parmigiana was super.  The ravioli with braised beef....was fabulous with pasta executed to perfection.", "pics": null}}, {"review": {"des": "We had a family dinner here and the food and service were on point. My wife had the eggplant parmigiana and tortellini, our son had the ravioli and I had the Chicken Limon.  Everything was impeccable including our waiter.  He had a great demeanor and Witt.  My wife said she would come back to Chicago just to eat here again.", "pics": null}}, {"review": {"des": "This was one of my worst restaurant experiences I've had in a very long time. The only thing that kept me from leaving just one star was their phenomenal meatballs.  I came here to celebrate my birthday with some family after making a reservation on OpenTable. We sat down and enjoyed their complementary bread which was accompanied by a nice roasted pepper mix. Placed an order for a bruschetta appetizer right away and then began to wait. About 20 minutes later or waiter finally came back to ask if we were ready to place our entree orders, but somehow didn't have the appetizer yet to tide us over. When they did bring it out I was baffled. The bread they used for the bruschetta was unbelievably stale and rock hard. When the entrees came the pork chops which had been ordered medium were well done, and my pasta was completely undercooked. We doesn't send anything back at this point because we were just fed up with the dining experience and didn't have faith that they could get things right on a second try. They asked us if we wanted any dessert after that and my brother had to tell them we were celebrating my birthday, despite my detailing that on OpenTable. Our waiter was very nice just not very competent, and I am sure I never need to dinner here again.", "pics": null}}, {"review": {"des": "This place was pretty good. The Pesto Burrata was delicious, we had the Calamari in a pepper sauce which should have been fried a little more! I had the meat ball salad which was also good!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GNNI0pZmKqsIZq0WmdJA_A/348s.jpg", "caption": "Pesto Burrata"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zdVqalWkTXxNxhfVDNl4Xw/168s.jpg", "caption": "Pesto Burrata"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tB7Ln7dqI7_uP6wIgcIxqA/168s.jpg", "caption": "Sea bass"}]}}, {"review": {"des": "If you're looking for top-notch service and amazing Italian food, definitely head to Viaggio. <br><br>We've been regulars there for a few years and are treated like family every time we go. Dave and his staff have created such a welcoming and friendly atmosphere, whether it is your first time visiting or you are a returning customer. <br><br>I can't say enough about the food - the meatball salad, the fresh seafood and steaks, the pasta...everything on their menu is worth ordering again and again. Make sure to stay for the house-made limoncello. The desserts are also house-made and are outstanding. It's location near the United Center makes it an ideal spot before Hawks/Bulls games and concerts. An added bonus - you can leave your car with the Viaggio valet and hop on the free shuttle at West End bar next door that takes you back and forth from the U.C. <br><br>There are so many Italian restaurants throughout the city and Viaggio should absolutely be included at the top of that list!", "pics": null}}, {"review": {"des": "The best place in Chicago!!! The food was amazing. The service was above and beyond. You feel like one of the family here. Thanks to Dave, Tommy and Julie for a fabulous experience.", "pics": null}}, {"review": {"des": "Never in my life did I think that a meatball salad would change my life, let alone be something that even sounded remotely good. But holy.crap. I was wrong. <br><br>My first night in Chicago and my savvy colleague set up a late dinner for a small group of us at Viaggio. When we walked in I noticed this place looked like it had been there for a while, or at least had a history in the area. I really have no idea if that's true or not, but when it comes to Italian eats, the older the decor, the more homey and authentic it feels. <br><br>My colleague insisted we try the meatball salad, so I elected him to pick the apps for the whole table. He did damn well. But the big stand out was definitely this unique dish. Sure, warm meatballs on cold, crisp lettuce sounds like it could be disastrous, but Viaggio makes it work so hard. It was like a lightly dressed, Italian side salad with homemade meatballs on top. They cut them up at the table and then serve the guests. Please, just try it. <br><br>I saw they had homemade gnocchi on the menu, so I opted for a heaping dish of that with their vodka sauce. Good. God. I've never had such a filling pasta before! I could barely make it through 1/4 of this rich dish of epic deliciousness. <br><br>Another stellar part of this meal was the service. Our waiter was on it. He knew the specials by heart and described them perfectly. He made our entire party feel super special and even brought over complimentary, house-made, REAL limoncello. I'm normally not a fan, but this was so tasty. Lastly, while we were waiting for our cab, the owner chatted with us like we've been friends for years. So nice. <br><br>Thanks for the great experience, guys!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4yteB-ekN0lhlfXxdmJldw/348s.jpg", "caption": "Apple cinnamon torte"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5NqbaZZQidux33ViTyz_BA/168s.jpg", "caption": "Cavatelli with vodka sauce"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aaRtfw6Aa8yb2v9ekW-jIA/168s.jpg", "caption": "Meatball salad"}]}}, {"review": {"des": "I wrote my initial review of this place about 4 years ago...and having returned perhaps two dozen times over the past four years, I can only say \"6 stars\" due to the consistency with the staff, the service and the food.  Just as good tonight as when I first stopped in here.  It is excellent!", "pics": null}}, {"review": {"des": "My boss and I went to Chicago for trade show and stumble upon this gem with the help of local friend.<br><br>May I say I've had really good mom and pop Italian restaurants in Glendale, CA but this place is by far hands down the best pasta I've ever had.  Calamari is a must have.  Nice selection of drinks and our server could not have done better job.", "pics": null}}, {"review": {"des": "Great food and service. Everything was fresh and authentic. Our server knew the menu inside and out and had many great recommendations. The stuffed pepper were an awesome appetizer and the Lobster Ravioli topped with shrimp was a large and extremely tasty.", "pics": null}}, {"review": {"des": "Wow! This was a fantastic little find. After dropping off the kids at the Hawks game, we started driving around for a new restaurant to try and I'm so glad we tried Viaggio!<br>Although the dishes seemed simple one taste would tell you that the sauce was complex and had been simmering for hours. The staff was passionate about service and everything they served. Everything from the owners greeting you when you entered, to the bar staff, the waiters and finally the excellent job by the chef was well worth searching for and finding this little neighborhood restaurant. Try it!", "pics": null}}, {"review": {"des": "I love this place!!! I enjoyed my birthday dinner at this wonderful restaurant. The food was delicious. I will return to try more of the items on the menu..reasonably priced, nice portion sizes and awesome flavor.  Service is amazing..their staff is a good example that other places should follow. Special thanks to Nico, Hector, Dave, n Julie made my bday extra special and unforgetable.!!", "pics": null}}, {"review": {"des": "Some of the best meatballs I've ever eaten.  Great food. Decent atmosphere.   Good service. The food the food the food!!!!! Yummy.", "pics": null}}, {"review": {"des": "Meatballs make the world a better place. Viaggio's meatballs make the world a Playboy Mansion party. They're easily on my \"Top Things To Eat\" list anytime someone asks me what to indulge on in Chicago. Seriously...if you're from out of town skip Lou Malnati's and just order this place's Meatball Salad. <br><br>Along with old school Italian hospitality and made from scratch pasta and sauces this place puts me in a food coma from a delicious overdose every time. Keep up the great work you guys.", "pics": null}}, {"review": {"des": "Loved everything! This is our go to place before the bulls games and we're not the only ones. There's always tons of people with bulls gear on. The service is great and fast which is what everyone wants when you have a place to be and the food is always fantastic. If you're not in a rush, slow down on your ordering and let them know you're in no hurry because the food comes out quick. I got the rigatoni with vodka sauce after hearing some other reviews and part of me wished I saved some to bring home just so I got to lick the bowl. That was by far the best I've had. I think I'll be ordering that every time. It was a definite cheat day that I haven't stopped thinking about.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CJhMl8B5Q4OPn7QsyI3_5w/168s.jpg", "caption": "Omg this is by far the best vodka sauce or even just sauce I've had anywhere. I haven't stopped thinking about it"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/V0PceEuGtLZRBLcN0DvMeA/168s.jpg", "caption": "Side of meatballs....I make a mean meatball so i didn't like it more than mine but definitely more than I've had elsewhere."}]}}, {"review": {"des": "Continues to be superb at all levels. .!<br><br>This our choice of restaurant before we journey to the United Center for a Bulls game.<br><br>They had a risotto special with lobster meat and lobster sauce that was overwhelmingly delicious..!  If it's available, don't hesitate..!<br><br>It's noisy but that's because a lot of people eat here..!", "pics": null}}, {"review": {"des": "Viaggio restaurant has amazing food! My fiancé and I went on a Saturday night. This restaurant allows you to make reservations which is highly recommended. The restaurant is very small. This also lends to very loud noise level, so be prepared. The small space and noise level is easy to forget because the food is so good! We tried the fried mozzarella and calamari first. The calamari could've been a bit crispier, but the fried mozzarella was absolutely delicious. We then had the rigatoni vodka, the special risotto which was sausage and spinach, and the veal parm. The only complaint was that the veal was a bit over cooked, but the rigatoni vodka and a meatball on the side were the best Italian food I've ever had!! The risotto was absolutely delicious. For dessert we had the tiramisu, which was great. Overall the food was amazing.", "pics": null}}, {"review": {"des": "The experience I had here for my birthday was amazing! This was my first time here and from the time I made the reservation to the moment I left I had nothing but great service. A group of 10 ladies and EVERYONE loved their food. The fried calamari was fresh and no where near chewy, the meatballs were fresh and tender with lots of flavor and the rigitoni vodka was the best vodka sauce I've ever had. This place is def my new favorite Italian restaurant in Chicago.", "pics": null}}, {"review": {"des": "The restaurant was crowded and noisy, our server was loud and obnoxious, when we could find him. He often went outside the restaurant to speak with the vallet guys or was in the bar area talking to customers and employees. Dinner was 3 hours long because we were neglected by our server. <br>The appetizers were good, although I thought the Calamari serving was rather small. For dinner I ordered the Sunday gravy with pork, which was terrible. The gravy was overcooked and more of a paste and the pork was tough and chewy. I ate a few bites of my wife's steak which was cold.<br><br>When we received the check it was padded with extra drinks which were brought to the servers attention and the problem was corrected but still if we didn't pay close attention we would have paid an extra 40 dollars.<br><br>Some of my group knew of the owners so we didn't complain but we were all disappointed especially with the server who would be better as a comedian.", "pics": null}}, {"review": {"des": "This place is awesome! The service, the food. Large portions and great tasting. My girls had the spaghetti marinara, wife the chicken limone,  I had the risotto special. We finished with some cheesecake and gelato. Nice bottle of red wine and our server brought us a comp limoncello.<br>Highly recommended!", "pics": null}}, {"review": {"des": "Out of bounds italian food! The lemon cake was ridiculously good, but the pasta dishes were authentic and flavorful. One thing I regret is I didn't get the pork chop parmesan. It looked amazing (and it's something I've never had before). Can't wait to go back! They make you feel at home!", "pics": null}}]}