{"name": "volare-ristorante-italiano-chicago", "reviews": [{"review": {"des": "Great meal; found it on Yelp! and I am grateful it was 2 blocks from our hotel,...was raining/sleet so location was critical.<br><br>Had moderate expectations b/c we have great Italian in SF/Bay Area and we go to NYC.<br><br>As good as it gets!!! Outstanding food.<br><br>First, our waitress (Blanche) was a total hoot. We trusted her and it paid off.  Got the eggplant Parmesan as appetizer (don't think it's on menu). We all gave it an A+!!<br><br>Clam appetizer, very nice. Only dish that was not outstanding.<br><br>Got seafood/pasta special and it delivered; tasty, cooked to perfection.<br><br>Son got combo chicken Parmesan and side pasta. Both were superb.<br><br>My son got dessert, I only had one bite but it was awesome. Was some form/combination of chocolate, berries and whipped cream.<br><br>Really wanted the Caesar too but it never showed up, and we weren't charged. Didn't need it, ended up with extra food, but I'll be sure to start with Caesar next time. <br><br>One other cool thing - they offer wine in Q's (basically a glass and a half, as well as half-liters and liters), so you can get just the right amount.", "pics": null}}, {"review": {"des": "The place was very crowded and the seating arrangement needs to be reworked. The tables were all over the place and it seemed like they were trying to just fit as many people as possible into the restaurant. I almost would have rather just waited (if I didn't get a reservation) than to have been squeezed better two larger parties. Even though we had a reservation, our seat was so bad that it was in a place where the waiters could barely get to us.<br><br>I could understand there popularity though. Delicious authentic Italian place in the Loop that serves traditional dishes. I was happy that they served half plates since I wanted to try everything. The freshness of the handmade pasta and the sauce really stood out.  I ordered the charcuterie - meats only, two half pizzas and two half pastas. Food was great.<br><br>Lastly I loved the tiramisu. So much that I bought a second to go!", "pics": null}}, {"review": {"des": "Great food, great atmosphere, great service.<br><br>Why the -1 star? Well, we were first seated in the outdoor area where I detected a sewer-like smell and where the overhead heaters basically and uncomfortably bake you. We also had dirty glasses at our first (outdoor) table, which the initial busboy/waiter didn't check before attempting to pour our water.<br><br>Whatever the case, my friend requested an inside table and we were accommodated pretty quickly (and seated at a comfortable corner table in the main/front dining room). <br><br>Once inside, it was all uphill. The bread/olive oil, bruschetta, salads, pasta, salmon, and steamed/seared spinach were all excellent--and the service was helpful, personable, and attentive. <br><br>I'll be back!", "pics": null}}, {"review": {"des": "Definitely make reservations when you come to this place. For a Wednesday night this place was super packed. Hostess were welcoming, we had reservations so we were seated with five minutes. Our server Jose was the best. We had him pick the wine for us and it was delicious, friend calamari was just fabulous, constantly refilled our water and wine. We got the specials and it was one of the best meals we have ever had. Our compliments goes to the chef. <br>Staff was super attentive and we will be back whenever we are in town for business again.", "pics": null}}, {"review": {"des": "I love Volare for it's ambiance, cuisine, service and it's owner. You gotta love a hugely successful restaurant where Benny, the owner is still hands on. <br><br>When I arrived for dinner with friends on a Saturday night, it was crazy busy but the host staff was warm, friendly and efficient. We waited at the bar about 15 minutes for our table. <br><br>The bartender made the best martini EVER! I had specific requests to tweak my cocktail and it was created to perfection!<br><br>Although the room was crowded and bustling, our table next to the front wall was quiet enough that we could chat easily. I swear there must be some sound proofing in the ceiling and walls. <br><br>Our appetizers, salads, entrees and desserts were all fantastic. They arrived piping hot and prepared exactly the way we asked. <br><br>Service was efficient and attentive our entire meal. A meal can be enhanced or destroyed by the type of table service given. We were well cared for from beginning to end.", "pics": null}}, {"review": {"des": "Hands down the best squid ink pasta in Chicago!!! This place also has an awesome ambiance. This is all I go for when I come to Volare. If you are ever in the area, make sure you come check this place out. I highly recommend you make reservation because the place is usually pretty packed.<br><br>You will be able to find other squid ink pasta in other places, however, guarenteed you won't be able to find one like this.<br><br>Also, the portion is pretty big, I recommend the 1/2 order because the rose sauce which makes it really yummy, but because of its richness, eating too much of it won't make you feel good. That may just be me though.<br><br>And of course with any pasta and in any italian restaurant, you must have a good wine to go with ut. And if you get served by Benny - the owner is an awesome guy and knowledgeable.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iVUuwyAF8H43a0a2gdkyQw/348s.jpg", "caption": "Spaghetti Neri al Pesce"}]}}, {"review": {"des": "Absolutely amazing food, drinks and service! Volare Ristorante can't be missed!<br><br>First off, we learned out lesson --- make reservations! This place is so popular the wait can be over an hour if you just show up (like we did). Luckily we spied two bar seats and got to sit down within 20 minutes. <br><br>The menu had lots to choose from --- we decided grab an appetizer first (calamari) then ordered our entrees. You can't go wrong regardless of what you order. I kept it classic with the chicken parm. And while I can't remember the wine I ordered, it was a great recommendation from the bartender. Sadly the portions were so large that we didn't have room for dessert (but I will be ready for next time). <br><br>I can't wait to go back.", "pics": null}}, {"review": {"des": "Volare has THE BEST gnocchi ala vodka I have ever had! It is my go to place for pasta and Italian food in the city! And they have the NICEST service from the moment you enter to the moment you leave! Highly recommend going here!", "pics": null}}, {"review": {"des": "Buona Sera and enter into a home of Italian humor and deliciousness. Our Italian accented waitress from Milan was so great and funny. The restaurant was packed to the brim on this drizzly weekday evening and the people didn't stop entering one after the other. As we sat there, it really felt like being in someone's home who is having a big party. The breadbasket was good, the bruschetta was delish, and the mango martini made with real mango pulp was out of this world. <br><br>The risotto was amazing and the ravioli was made with some delicious ricotta. The calamari seemed average but the sauces that came with it were really good. The location is also great and you'll find parking on grand. <br><br>All in all, a great experience and I see why this place is so popular. Even just watching the kitchen team working was a blast! Many thanks to our waitress Italiana de Milan for laughing with us and making us feel at home!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KLde6aHx68HBcHf4uwG1-g/168s.jpg", "caption": "Busy kitchen!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wEONKj7gZRIifvwMpOGcbw/168s.jpg", "caption": "Mango martini made with real mango pulp"}]}}, {"review": {"des": "Wow this place is delicious! Their chicken parmigiana is so good and tasty, they also have a great variety of wines. Very friendly staff and great service!", "pics": null}}, {"review": {"des": "I can't believe I ate the whole thing! <br><br>I have been coming to Chicago on business for over 10 years and have walked past Volare Ristorante Italiano every year. From the outside it looks very unassuming but, wow, is the food great! We sat on the patio and it was just what my coworker and I needed after a long day at the conference. I had the Lasagna which was as delicious as it was huge. I made it my mission to finish the whole thing (which I did). My coworker had just returned from Italy and declared the clams and linguini to be better that what she ate there. <br><br>The service was spot on, quick, attentive and friendly. Honestly it is great to see restaurant staff take pride in their work from the manager on down. As the restaurant filled up the staff efficiently set up additional tables to accommodate the hungry diners. <br><br>I think I may have just found a new favorite Italian restaurant in Chicago!", "pics": null}}, {"review": {"des": "I will say \"OMG\" \"OMG\" and \"OMG\" for this restaurant.<br><br>I guess when your Italian food repertoire consist of  Olive Garden food, Volare will blow your hat of and some more.<br><br>Ordered the squid ink spagethy, linguine with clam in garlic and limon sauce, grilled seafood and veal in limon sauce. There were 3 of us and we only ordered the pasta half plate. But we were so full.", "pics": null}}, {"review": {"des": "Delicious appetizers and pasta. I ate everything. I shared half orders with my sister but admired all the whole orders being delivered to other tables. If I wasn't staying in a hotel with no refrigerator, I would have absolutely ordered one whole order of everything for leftovers.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rrbDya5FGxHLpMkp6TtjhA/348s.jpg", "caption": "BOMB Ensalada Di Mare"}]}}, {"review": {"des": "This was my second time at this place...the first time we just walked in around around 9pm and they had many open tables...this time my buddy made reservations thru yelp for 7:30pm and we showed up at 7:25pm and we got seated by 7:33pm...the service both times was great...the olive oil bottle is always at the table...the bread is nice, and some pieces are served warm....we ordered a warm kale salad...tasted great, but personally to me, it was too garlicky...I ordered a ricotta ravioli and my buddy ordered eggplant parmigiana...we said easy cheese, but it was too much for him...but this visit was absolutely worth a 5-star and we had a small dessert...they have valet parking, which I suggest you take it...& always always always make reservations...you won't regret it...give this place a shot...it's absolutely worth it!!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9xq1GHYZSBYxYoGL75fYUQ/348s.jpg", "caption": "Walnut and fig tart"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sv_dM41tcx-cndKv41g-Pw/168s.jpg", "caption": "Salad"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GQnb3wKJDlqLpol9d-nQyg/168s.jpg", "caption": "Eggplant parmigiana"}]}}, {"review": {"des": "We had a party of 20 from out of town that came to eat at Volare. From the moment we walked in we were immediately seated. We had a reservation and we had no wait. The maître d' and waiter were exceptional. Drinks were brought immediately and appetizers were on the table in 20 minutes. The main courses were extraordinary and truly Italian dishes from the lasagna to the lamb chops.  The wine list was very Italy focused. We had a wonderful time and if I am ever back in Chicago I would come here again.", "pics": null}}, {"review": {"des": "Beautiful atmosphere and very lively inside. This restaurant certainly gives a nice authentic Italian vibe. Our server was lovely and of course had a beautiful thick Italian accent to add to the authenticity of the place. <br><br>We started with some house pinot noir and enjoyed the scrumptious bread. I also ordered a seafood appetizer dish as my entree, but this was very saucy so I had to get a little side salad to soak up the flavors. This was a very filling grilled seafood dish otherwise.<br><br>Overall, we had a nice time here and enjoyed the ambiance. Would recommend for Italian. The pasta is delicious and al dente.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Wa6SLrInpSm9jHX7WsaNNg/348s.jpg", "caption": "Seafood appetizer"}]}}, {"review": {"des": "Work lunches tend to be boring and eaten at the desk... if you don't want to be there late... and miss the express that gets you home before 5:30pm...<br><br> But, when it's rumored to be near 80F on a weekday... you make plans to go eat alfresco.<br><br>The walk over isn't bad, and while it's not on a picturesque corner, construction in downtown Chicago is like basically like birds... a sign of summer.<br><br>Made a reservation for outdoor seats via Yelp and I think it helped give out group some street cred... they were nice and accommodating... it was a nice meal overall...<br><br>The appetizer I had as an entrees was a mixed seafood plate of calamari, squid, scallops and shrimp... grilled in light olive oil and maybe some garlic, served on a bed of greens.<br><br>=== BEST GRILLED SEAFOOD EVER!!! === <br><br>I was at Shaws on Sunday... this was the next day.<br>Holy poop they beat that place like a dirty rug.<br><br>If you love seafood... GO HERE.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3SnTk72h8-LKEIVyZ8Llbw/348s.jpg", "caption": "Grigileri Misto"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RX9IkkJ_jPJzQHJ0AR6LGA/168s.jpg", "caption": "Cheese Ravioli"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/NzPt0UmQXOqmNfZ2jPN5pA/168s.jpg", "caption": "#FreeCarbs"}]}}, {"review": {"des": "This place is delicious! Some of the best Italian food I've ever had! Everything was good. The meat was cooked perfectly, the pasta tasted fresh, and the veggies were fresh and delicious. I plan to come here every time I'm in Chicago.", "pics": null}}, {"review": {"des": "Had 1.5h to eat a 5 course dinner before watching the Book of Mormon and Volare delivered. From start to finish, our server Mauro did a phenomenal job in getting us our plates in time. Finished off the evening with a fantastic Vin Santo with a wonderful Tiramisu. Thanks again, Mauro.", "pics": null}}, {"review": {"des": "Such a great dining experience.  Everything made in house and nice enough for the adults to feel special but comfortable enough for the kids to love it.  My son gave the house spaghetti and meatballs a 10/10.  Kids were not confined by the menu.  They let each of my children create the pasta (sauce and extras) that they wanted.  Professional staff and authentic cuisine. Reservations are a must as this place has created a following.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EG6YlFZrxFhnu4OOOFFIrw/348s.jpg", "caption": "Gnocchi alla Vodka"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OU18bOy9fyyL7FgORcSKVA/168s.jpg", "caption": "Fusilloni al Ragu di Vitello"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/a3LV8R5P5pWk9ilmBfuB1w/168s.jpg", "caption": "Kids can order any pasta combination they want."}]}}, {"review": {"des": "Extremely romantic, authentic Italian experience. Would recommend making reservations at least 2 hrs in advance.<br><br>Don't know if it's because it's a Saturday night, but place was packed and tables are set up almost on top each other so be wary of rushed waiters. Had an incident early during the night when a waiter slipped and dropped his tray of our hot tea and it splashed on a girl in our party. :( <br><br>Ordered the Grigliata and Bruschetta to start, then the Chilean Sea Bass for me, Fusilloni with veal ragu, Linguine Arselle e Bottarga (clams essentially), Gnocchi (with tomato basil and vodka sauce), side order of meatballs and their special seafood pasta with tomato sauce. You can do half orders of the pasta, which basically looked like regular full orders that I probably wouldn't finish! <br><br>Chilean Sea Bass was divine!! So soft and flaky,  and sauce was soo good. I liked the Grigliata too. Octopus & calamari cooked perfectly and balsamic sauce was nicely muted but yummy. Gnocchi was great but I'm not partial to it in general. Their pasta dishes are very generous on the seafood. Didn't try the meat dishes, sadly.<br><br>No wonder it's a favorite of a couple in our party. Had a wonderful night even though I was already full for the day! (Pictures are terrible bc we were in a hurry to dig in! Lol)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YpZlHhSteWKXU_U_F8kqFA/348s.jpg", "caption": "Chilean Sea Bass"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9gWgcO1hzZkaNLB-2HurLQ/168s.jpg", "caption": "Fussiloni"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/r2cPPT3wwjNtf3gvzktj_g/168s.jpg", "caption": "Clam Linguine"}]}}, {"review": {"des": "I was a little turned off by my last visit. I made a reservation for 2 on a Friday evening, knowing that it's usually very busy. It was supposed to be a party of 2 but my dinner partner got stuck in horrible traffic and was not able to join me. So I checked in, was told they had my reservation, but as soon as I said that I would now be dining alone, they no longer had a regular table available. The two options I was given was to eat at the bar or to sit outside in the heated tents. I understand that a Friday night is busy and you probably don't like seating parties of 1 at their own table but I did initially have a reservation. Even though there was a seat at the bar available, people were hovering and reaching over me trying to get drinks while I was trying to enjoy my meal. The food was good, as always, and the service was decent but I feel like a lot of the times people who dine alone are treated differently (not being given a table, rushed, etc) and I'm disappointed that this restaurant isn't different.", "pics": null}}, {"review": {"des": "I do enjoy this restaurant. It'd been awhile since I was here for dinner, usually we come for lunch, so it was fun to change it up a bit. I will say it is much louder and busier at dinner but still a great place. Their dinner time vibe is high energy bustling loud NYC style restaurant which is fun no doubt. But if you're looking for a quiet dinner or a more romantic first date type place you might want to come here for lunch instead, save this place for more of a party or fun night out at dinner time. That being said the wait staff tries very hard, is friendly and helpful, and our quick to correct mistakes if there are any. I started with their signature seafood salad which was delicious. It has fresh octopus, calamari, conch, shrimp, garlic, lemon, and parsley. The seafood was fresh and generous in size and amount. It was juicy and flavorful as well. I was also excited to see conch on the menu. I discovered it last summer on vacation and just fell in love with the taste but you can't easily find it here in the mid west so that was a nice treat. For my dinner I had black squid ink spaghetti with with sage, shrimp, lump crab, scallops, in a creamy rose sauce. So delicious, flavorful, fresh, generous and distinctive. This is hands down my favorite dish they make and a dish I don't see much which makes it extra special. For dessert we split the tiramisu and the cheesecake. Both creamy, sweet, deliciousness. So in short, the food is delicious and the service is good. The only real question is what vibe and atmosphere are you looking for? Loud hustle and bustle go for dinner, quiet laid back go for lunch. But certainly go.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vqSQ3VqHQZfIzBoVX7k7rw/348s.jpg", "caption": "Apple martini"}]}}, {"review": {"des": "Awesome.<br>Great food great service and and no kidding. Short but sweet, lasagna was The best I've ever had or at least close to it, and I'm an obnoxious NYer as youz guys like to say. Anyhow, the table loved everything we had. <br>Excellent Italian place to hit when you're in town  I'd give you a complaint but I can't. Enjoy.", "pics": null}}, {"review": {"des": "I had been so excited about this place, but after eating there last week, I want to warn others! <br>Actually the service was great, so I was really just the food that failed. The Fettuccine all's Bolognese looked gross and apparently tasted the same. It was literally a bowl of pasta with ground beef scattered on top. Not in with the sauce as you would expect, but scattered on top in a pile. The red sauce was lackluster, and the pasta were the same. I did enjoy the chicken parmigiana, though. So they can fry a mean chicken. But if you don't have good red sauce, you got nothin.", "pics": null}}, {"review": {"des": "Breakdown<br>-----------------------------<br>Star #1 - Atmosphere/Decor:<br>A very nice atmosphere. Dimmed lighting and the open spacing makes this place feel modern. It is well kept and very clean inside. No complaints! Star earned!<br><br>Star #2 - Service:<br>The service is great. They are constantly refilling our waters, checking in with our table and making sure everything is going well. Very friendly staff and if you get here a little early, you don't have to wait to be seated. However, come here a little later, and there may be a wait. Star earned.<br><br>Star #3/4 - Food:<br>The food was fantastic! We got the Calamari, which honestly could be a little more crispy, but it tasted very fresh. Along with that, I got a half order of the Spaghetti Neri al Pesce, which was really good. My pasta wasn't cooked Al Dente, which I would've preferred, however, the squid ink pasta along with the sauce tasted amazing. I would definitely come back and order the same thing, or maybe try something new, but regardless I am sure it will be good. Two stars earned.<br><br>Star #5 - Cost/Value:<br>An okay price for the quality of food you get. I would definitely recommend you come and try this Italian restaurant if you live nearby or if you are a tourist. Must try! Star earned.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LDORKk5UJWDRWDd54XAJ5A/348s.jpg", "caption": "Spaghetti Neri al Pesce"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/snVs57QF3kkpy5fT_us41Q/168s.jpg", "caption": "Fritto di Calamari"}]}}, {"review": {"des": "I would give it 3.5 starts. I enjoyed my visit to Volare. We arrived at 7pm on a Saturday night and we were seated quickly. Our waitress was very friendly and attentive. We ordered the carpaccio, spaghetti neri al pesce (black spaghetti with seafood) and linguine arselle e bottarga (linguine with clams). Black spaghetti was my favorite. It had the right amount of sauce and the seafood was cooked perfectly. I though the linguine with clam was ok. For me it was too creamy/buttery. <br><br>Tip: You can order half portions of pasta and risotto if you want to try many dishes.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BIVWRY65QVZHKA0RvIYlLw/168s.jpg", "caption": "Linguine with clams"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8LBSIIZ7tIyssdRSuxB6-w/168s.jpg", "caption": "Carpaccio"}]}}, {"review": {"des": "Worst service ever ! <br>Our server brought us check where she personally wrote tip amount that she wanted, appled it to final amount and simply asked us to sign . I guess she thought that we are idiots and won't even notice that !<br> P.S. food was ok though", "pics": null}}, {"review": {"des": "Amazing restaurant top pick!!! Great entrees pasta, steaks just Great... and coffeee wow!", "pics": null}}, {"review": {"des": "2nd time to dine in here. Came here for lunch this time and it was amazing! Had a black squid ink pasta with rose sauce which tasted very rich and had lots of crab meat, shrimp and scallops. Could not believe that it was only $15! I have had lots of italian food in downtown but this pasta was the best in town for sure for the price and quality. But I could not give 5 stars because the pasta could have been a little less salty for my taste. Also, our server was nice but he did not offer me parmesan cheese or fresh black pepper on my pasta... Will come back for lunch again for sure.", "pics": null}}, {"review": {"des": "The simple interior design belies the outstanding cuisine within this restaurant and I'm embarrassed to tell you that it was so engrossing I didn't take a pic of the menu, so I will try to describe it as best I can. The first course was the most perfect dumpling in red sauce I've had since a dim sum blowout in Bangkok a few years ago but of course this is Italian. The second dish was some meat lasagna. Beautiful. Main course was a white fish elegantly placed on rice with olives, capers, and a sprig of rosemary, so lovely. Really quite exceptional and done to perfection. The desert was a classic tiramisu. OUTSTANDING VALUE for $45! The waitstaff was attentive. Low point was the bread basket, thank God; it saved my appetite. Thank you for a lovely time.", "pics": null}}, {"review": {"des": "Okay - so this place has some very, very good high points. <br><br>1.  The place is HOPPING and BUSY.  You know you are going to be in for a treat.  The energy in the place really gets you excited while you are waiting for a table.  <br>2.  The waitstaff is very attentive and full of good suggestions.  I have never had anything but a great experience with the staff.  Jesus is someone I have had several times - and he is super nice and great to see each time <br><br>3.  Things to eat:  The seafood salad is so good.  I never had grilled octopus before.  It is tender and delicious.  OMG I want it more!!!!!  The fish is so good and the fresh squid ink linguine is incredible.  Yes.  I want more!!!!  <br><br>Cons:  Friends ordered the gnocchi.  I have to say it surprisingly seemed like it came out of a box.  It wasn't really gnocchi  More like egg noodles folded into itself.  <br><br>Regardless - I generally love the place and atmosphere. You need a reservation!!!", "pics": null}}, {"review": {"des": "My office came here for a work lunch meeting. We were quickly seated and given a corner of the restaurant so we had at much privacy as possible. We started with bruschetta. It was basic and simple but very fresh and overall good. For a meal I got the Risotto al Caprino. The rice was cooked perfectly, it wasn't overally mushy or hard, it had a lot of crab meat and the goat cheese went really well with the crab but overall I think it lacked flavor. It didn't really taste like much of anything.", "pics": null}}, {"review": {"des": "First time eating here, and it was a very good experience.   Seated on time for our Thursday night reservation, wait staff seemed attentive and personable.   We were joking with the waiter who was a good sport and and played along.   It was fun, and the food was outstanding.  I had the special, spinach noodle lasagna, with was the smoothest tastiest lasagna I ever had.   Warm atmosphere, great food, good service.  I'm adding this place to the rotation when in the area.     I'm a fan!", "pics": null}}, {"review": {"des": "We were walking the neighborhood, trying to decide just what we were wanting for dinner, when we spied Volare.  After checking out the menu, we stepped inside, and straight into the 1950's.  White tablecloths, waitstaff buzzing, pausing and dipping, attending to laughing patrons.  The manager whipped our scooter to the back, and we settled in to be carefully cared for.<br><br>The menu is not huge, but manages to cover all the courses.  The special caught our attention, me for the fresh lentil soup, and him for the beef wrapped around sausage.  He started with the house salad, which included an artichoke heart.  <br><br>I also had the largest \"small\" plate of grilled octopus, calamari, shrimp, and scallops that I could imagine, roasted in a balsamic drizzle.  I never really imagined that there could be such a thing as too much calamari, but I was finally defeated.  Oh, I wish I could have shared it with you!  <br><br>The house Chianti makes me wish every restaurant had a Chianti on their menu.", "pics": null}}, {"review": {"des": "Great romantic dinner with my hubby.  They started us off with some bread but don't get too stuffed on these because the entrees are a good size.  <br><br>We shared a Volare Salad which was yummy was I thought it had too much dressing.  I wished I asked for it on the side.  <br><br>The squid ink pasta had tons of seafood and the flavor was great.  I just thought it had too much sauce to the pasta ratio and the flavor was a tad too strong.  I might have liked it with less sauce and more pasta.  <br><br>My husband had the clam linguini and that was spot on.  Tons of clans with great flavor that came through on the pasta.  <br><br>Our server was super sweet and attentive.", "pics": null}}, {"review": {"des": "Super legit.  This is the sort of spot that's just missing in LA.<br><br>Old school Italian joint.  We were seated fairly fast with a reservation (it looked like the guy was just winging it on a paper pad with a list of the reservations from that night).  Once seated, we were greeted by our server, Emilio.  You know when the server is also Italian, this is gonna be great.<br><br>I went with the lobster carbonara, and wow, it was good.  Very rich, and very heavy, but so damn good.  I had 1/4 left by the end and I was stuffed.  My colleagues tried the squid ink and that red sauce is perfect.  Another tried the special that night which was a stuffed prime rib steak.  The steak was cooked perfectly.  When Italians do steak right, they do it so damn well.<br><br>Overall ambiance of the place is very hectic, but loved it.  Service was fast and on point.  Definitely make reservation though cause on weekday night when we went, the place was packed!", "pics": null}}, {"review": {"des": "This review requires recognition to the wonderful concierge staff at the Chicago Four Seasons Hotel. They recommend this spectacular place to me for dinner. A few friends and I had just come from an amazing architecture river cruise on the Chicago River (Chicago Architecture Foundation- Amazing tours on Chicago First Lady Boat) and had made a reservation with the concierge in advance. The restaurant was within walking distance of the water, right off Michigan Avenue. Upon arrival, we were seated at a nice table in the front room. The restaurant is quite expansive and it was already extremely crowded. That is always a good sign.<br><br>This restaurant met and exceeded my expectations for an Italian restaurant. (Those expectations are quite high, by the way.) The waiters, waitresses, hosts, and hostesses were all very friendly attentive. The menu was large and appealing, and the decor charming. The Maître d' who was walking around also made sure we were content.<br><br>For the appetizers, we ordered an order of fried calamari, two kinds of cheeses with olives, and house salads. Everything was delicious. The calamari was delicious and not overly greasy, the cheeses and olives were very tasty, and the house salad was exceptional because of the artichoke hearts in it. That always completes the salad. For the entree, I had the lasagna. It was some of the best ever served to me, with plenty of sauce and cheese, which is how I like it. One of my friends had the lasagna as well and loved it. Another friend had the spaghetti, and raved about the sauce. It looked delicious because the sauce had fresh tomatoes bursting in it. After this extravaganza, we were too full for dessert. <br><br>Everything overall was perfect. I would recommend Volare to everybody. It is definitely some of the best Italian food in Chicago. The prices are also extremely reasonable. (The salad was only four dollars.) Everyone agreed this was one of or favorite meals that we had in Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zaa-6H5TN5pb226HqkXr_Q/348s.jpg", "caption": "Delicious house salad."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yROtTPj9Y_zHs-jrQImevA/168s.jpg", "caption": "Amazing Lasagna al Forno"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QJWGC_QAiXFmI3YSdeXXbw/168s.jpg", "caption": "Fried Calamari"}]}}, {"review": {"des": "I was totally fooled by the good reviews from other Yelpers. Glad for those of you who had good experience, and wish other people who decide to go to this place have good experience as well, but this was one of the worst dining experiences I've ever had during my 8 years in Chicago.<br><br>I made a reservation at 7 pm for this place on Yelp to celebrate my fiance's birthday and I was pretty sure I put a note telling Volare about the occasion. Long story short, it took us 2 hours and 15 mins dining here with two drinks, one appetizer, two entrees, and one dessert. Actual eating time was about 40 min. No one said happy birthday and not to mention the complimentary dessert that all other restaurants I've been to will provide in similar situations. Main reasons I will never go back to this place are: 1. terrible service 2. bad outdoor seating condition 3. most dishes were meh. The review would be one star had I not ordered the shockingly good sea bass.<br><br>If you want to read the long story, here it is:<br><br>We arrived at 7:04 pm and didn't get seated until 7:30 pm. What's the point of taking reservations then??? It was a Thursday night, so I didn't expect such a long wait, but maybe a full house (the only 6-8 bar seats were all taken) is a sign for good food? However, that thought was proved to be wrong later... Because of the full house, we only got outdoor seating. The worst part was their heater - it must be right above us, so the plates on the table were hot and I felt like I was at a tanning salon instead of a restaurant. The color of the lighting was also terrible - the yellow lights changed the color of the food in a way that makes you lose appetite...<br><br>We might have waited another 5-10 mins before our waiter finally showed up and we ordered drinks & food. We didn't see our food until 8:15 pm. During the 45-min wait, my fiance had their complimentary bread. There was olive oil on the table, but no one came to ask if he wanted any cheese. As a matter of fact, we didn't even realize this place has cheese until we saw they offer it to our neighbors. I didn't had any bread, but fiance said it was meh... <br><br>For the appetizer, we ordered the grilled seafood. When the food was presented, it looked terrible. There was way too much grease on the seafood, and the outdoor lighting didn't help - the reflection probably made it even worse. We later found out there was a thick layer of grease sitting on the bottom of the plate!!! Please don't tell me the grease was the dressing because I don't even expect that much grease for fried food. Did the chef forget some steps??? <br><br>For entrees, we both ordered the specials for the day. Fiance ordered their lobster (maybe also mussels and other seafood) ravioli. We can't taste any lobster, but only the creamy stuffing. Maybe the chef forgot to put lobster in it??? What's worse? 5 pieces of such ravioli costs $25. I ordered their sea bass dish, which was shockingly delicious. Filet had crispy outside layer with the middle soft & tender. The flavor was also perfect. If you put those two dishes together, it's hard to believe those are from the same restaurant...<br><br>At the time we ordered dessert, it was around 8:45 pm. We specifically asked the waiter to bring the check when they serve the dessert because we don't want to spend another 20-30 min waiting for the check, but of course, the waiter forgot. I can't remember the name for the dessert, but it was some deep fried dough with honey gelato. Again, dough was full of grease. Can't even swallow it without a lot of gelato. Apparently, chef last night don't know how to control grease. <br><br>The funny thing I observed while waiting to be seated and while waiting for my food was there seemed to have enough waiters, all looked really busy - some were even running here and there, but can't tell what they were busying for...", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rSfNusfRCUhRzLQW7xAhoQ/348s.jpg", "caption": "overly greasy deep fried dough with some gelato"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BNqKJjb76SR65nSwlUeLEQ/168s.jpg", "caption": "lobster ravioli that can't taste lobster"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GKfIxGg7f4p7Ru5nVpHwZA/168s.jpg", "caption": "shockingly good sea bass"}]}}, {"review": {"des": "Exceptional experience. Service was impeccable and the food was fantastic. The starter was the arugula, burrata and prosciutto, it was luscious. Dinner was the Sardinian red rice dish, but done in the fruta di mare style with red sauce. The flavor was fantastic and there was literally a bucket of seafood on it, all of it was good, but you can taste the skill as the calamari was so tender. Perfect evening complete with a delicious Italian white. Will definitely be back.", "pics": null}}, {"review": {"des": "Had a very nice lunch here on a saturday afternoon, service is great and the atmosphere quiet to to slightly loud.<br><br>I ordered the Spaghetti Neri Al Pesce pasta (Black spaghetti tossed with sage, shrimp, lump crab, and scallops, simmered in a creamy rosé sauce) and seriously it was the best pasta I've had in a long time while also being the best deal for the money ever.  Pasta was al dente with a very nice sauce.  It had 4 large plump sea scallops, lots of jumbo shrimp and lump crab.  I'm not sure that they made any profits on this dish (it was only $15) because of all the seafood and the large portion (it was 2.5 meals for me).", "pics": null}}, {"review": {"des": "Excellent service, great ambience and delicious food! <br><br>I went to Chicago with my fiancee and my sister-in-law last week. we decided to make a reservation at this restaurant. Alexander, our waiter recommended us to try the warm kale salad and a Branzino with lemon sauce. It was a great experience for us. I also have to mention that he took good care of us and kept everything impeccable during each course. I will definitely go back every time I come to visit my family. <br>The chocolate sin cake is outstanding!!!", "pics": null}}, {"review": {"des": "Went here when we visited Chicago! What a great place!!!<br><br>SERVICE: The Service here was great! Our waiter was very friendly and took care of us.<br><br>AMBIANCE: Very classy and elegant ambiance. A great place to go for a nice dinner. <br><br>FOOD: The food here was delicious!! I had the Bavette alla Carbonara Di Mare and it was sooo good!! We also ordered some oysters which were great as well. <br><br>I would definitely recommend this place and would definitely go back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AQs12n97ksPTGN5q8_2qVA/348s.jpg", "caption": "Bavette alla Carbonara di Mare Dinner"}]}}, {"review": {"des": "Some of the best Italian I have ever had! Service was fantastic and fast for being a busy Saturday night. We went for my friends 21st birthday dinner and our waiter picked out a bottle of wine that was absolutely incredible! I would highly recommend this restaurant.", "pics": null}}, {"review": {"des": "Great Italian restaurant, food is super fresh and extremely delicious, soup, calamari is very good (be careful with plates they are really HOT) chicken Parmesan, one of the best I've had, service is awesome, staff is very attentive, I highly recommend this great restaurant", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VMvrw_YhQvU7iQrzkrp8-A/348s.jpg", "caption": "Menu"}]}}, {"review": {"des": "This restaurant is kind of hidden and challenging to drive to because it's on a lower street and on a one way road. It's a perfectly nice looking restaurant - a bit old-school looking. We sat on their lovely terrace and people watched. I got a pizza which was good. My friend got the fettuccine alfredo (which I don't think was on the menu but they made it for her anyways). <br><br>I don't live or work around this part of the city and, while this place is very nice, I don't think I would leave my neighborhood to come back. Granted I live in Little Italy so I do have an unusually large number of really great Italian restaurants in my backyard.", "pics": null}}, {"review": {"des": "I am not Italian, and may not be an expert on Italian food or restaurants but, this is hands down the most authentic and best of them all!<br><br>Here for a business dinner, and selected by a local for us, we came in at 7pm.  We had a reservation and table was ready.  Place was busy and stayed that way all night.  Good sign!  Especially since by the conversations of the waiters there were several returning customers.<br><br>Our server immediately greeted us, offered us still or sparkling water.  Brought us the drinks, wine, and food menu.<br>While we looked over the menus she went over the specials, describing each of them with so much detail you could almost taste them, but what impressed me the most was that she said to tell her if there was any pasta we didn't see in the menu and she would talk to the kitchen to make it happen for us.  Now, looking at the yelp pictures I realized this was not an empty promise... I saw several pictures of dishes that weren't on the menu, and saying how delicious each was.<br><br>After some time, our server came back and since we were not sure on what to have as an appetizer she recommended the appetizer special which was:  Grilled asparagus, wrapped in prosciutto, topped with fresh mozzarella and arugula.  This was enough to serve all 6 in our party, and we all were delighted by how good this was.<br><br>For dinner, we all ordered our entrees, and one on the table decided to test the \"order what you like\" offer.  Well, she got exactly what she wanted:  penned with a la vodka sauce, with chicken breast and spinach.  She could not stop saying how amazing her dish was, and how happy she was she got exactly was she was craving, without any problems.<br><br>I decided to go with the gnocchi.  If you can make good gnocchi, you pass the Italian restaurant test.  Well, they passed with flying colors!  This is by far the BEST gnocchi I've had in my life (no lie!).  If was fresh, perfectly cooked to that fluffy light pillow texture.  The a la vodka sauce was delicious and just enough to coat the gnocchi but not drown them.  I honestly was in heaven while eating it.  It was so good, I had to offer the table to taste it and all who did agreed it was outstanding. <br><br>As if great service and amazing food wasn't enough, all of the sudden, one of the servers asked for everyone's attention.  They had a surprise for us...  a Tenor.  He sang two songs (of course in Italian) for us, while we were there, leaving everyone with goosebumps and a smile. <br><br>For dessert, they had Amaretto Crème Brule ( you can never go wrong with that), Tiramisu, sorbet, gelato, and more.  <br>As soon as I heard gelato, and banana flavor I knew what I was having.  The she also mentioned olive oil flavor.  Seeing my face she said, well, I know what she wants and I'll tell the kitchen to give you both.  It came out with and assortment of other desserts she picked for us to try, and share.<br><br>This was definitely the best dinner I had during this visit to Chicago, and I recommend Volare to everyone.  You are surely not going to be disappointed!", "pics": null}}, {"review": {"des": "Traditional, home style cooking at its finest in and old-world ambiance. Sounds of broken dishes. Clanging silverware. Romantic, loud, angry sounding but romantic Italian language. Amidst, the honking from city traffic lies Volare, the most amazing Italian restaurant I've had by far in the River North area. <br><br>Do start with the signature insalata di mare if you're free of any shellfish allergies. Tender octopus, calamari, conch meat, and shrimp are tossed in this vibrant e.v.o.o lemon parsley sauce. Delicious complimentary olive bread straight from the oven is crisp and flavorful when drowned in olive oil or pasta sauces. Do save room for the main entree since they're quite large and filling. My husband ordered this divine seafood squid ink pasta and I had \"the special\" which is a frutti di mare in red sauce. The special came to a whopping $32, by it was loaded with a generous amount of seafood. <br><br>It wasn't a cheap meal, but the quality and service makes up for the price. If I could lick the tasty sauce from my plate, I would. It surely did not disappoint after a 3 block stroll from the nearby hotels. You're left with plenty of leftovers for the next day.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3cr979e8RQ_hDb78gLhKNw/348s.jpg", "caption": "Partial menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YOW2UYM-Zc4rbKN7JY52cA/168s.jpg", "caption": "Seafood squid ink pasta"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NTviTKdB3dbCa7mc9szpWQ/168s.jpg", "caption": "Insalata di mare"}]}}, {"review": {"des": "This place is spectacular. Strong drinks. Delicious food. Amazing service. The prices aren't cheap, but you definitely get your money's worth. The first time we went, we got the sea bass, and two half orders of pasta (black spaghetti and bolognese). The second time, we got the sea bass again (it was that good) along with the linguine and fussilloni. Allllllll amazing. One of my favorite places in Chicago.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jvYvfllVajFSHoFH7ioLGQ/168s.jpg", "caption": "We started eating because it was so delicious. Don't judge. You'd do the same!"}]}}, {"review": {"des": "Volare popped up as the #1 search result in the Loop for \"frutti di mare\". Not really sure why, as they don't actually have a dish thus named on the menu, but let's chalk that up to Yelp's poor search algorithm. All the same, there was a dish on the menu that resembled what we were looking for, so in we went. <br><br>Started off well enough - the staff were courteous, didn't have an issue with a couple of requests and the olive oil they serve with bread was delicious. Unfortunately, things went a bit pear-shaped when it came to our meal. My gnocchi were decent, but my wife's spaghetti had flecks of pepper despite us expressly asking for it not to be put in and the meatballs looked unappetizing enough to a point of my leaving them on the dish practically untouched. <br><br>No big deal, right? If wouldn't have been, had our server deemed us worthy of an inquiry. Usually when guests refuse a box while not coming close to finishing two out of three dishes, it behooves the server to ask what went wrong. This was not the first bad meal we've ever had and I wasn't even looking to get anything comped, but is a modicum of actual customer service too much to ask for? Needless to say, with the plentitude of Italian food choices in Chicago, I don't see a reason to return. <br><br>Further word of warning if you decide to check Volare out anyways (and I'm not saying you should or should not - any establishment that has over 1500 reviews will miss the mark every once in a while) - the portions are HUGE and their sauces are rich. If like me you prefer not to walk out of a restaurant completely stuffed, bring a friend and split a dish. The prices are fairly reasonable (a lunch-sized pasta dish will set you back about $15).", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hvsMlVReQo4ktYH6fW0tMQ/348s.jpg", "caption": "The amount of food we left, for illustration purposes."}]}}, {"review": {"des": "Absolutely phenomenal meal, genuine service and intimate, very reasonable prices and a wonderful setting. I have been coming here for over 15 years and tell everyone I know that it is an absolute 'must' when visiting downtown Chicago. The food is delectable, fresh and I honestly have never had a bad meal. The GM/manager or owner (not sure but I know he's in charge), is present, seating people, greeting people, bussing tables, running food, etc., and that is a wonderful testament to the passion he has for this restaurant and guest experience! Easy walk from the magnificent mile and river front, you must come to Volare!!", "pics": null}}, {"review": {"des": "Pasta Neri 4 stars<br>Pasta alle vongole 1 star, very bitter, no taste of seafood freshness and completely different from the one I ate in Italy. A disappointment. <br>Mussel is good, but a little salty 3.5 star<br>Chilean sea bass is amazing. Very buttery and fresh. 5 stars!", "pics": null}}, {"review": {"des": "Very good--that is why I call it A-OK..  Sister-in-law was attending an event at the Marriott on Michigan Ave.  Have been here a number of times--always good. NOTE--this is probably the least expensive place to have a real meal in the Tourista Zone.  Excellent service, very gracious--good food.", "pics": null}}, {"review": {"des": "Wow. Talk about fancy! This was my first time in Chicago after a really long time ... since I was a child basically. And my friends had made reservations at this restaurant... mind blown. The food smelled amazing as soon as I stepped inside! It's best to make reservations before coming because they are always always busy! Even with our reservations we had to wait an additional 30 mins. They were nice enough to let us add 2 more people to our party at the last minute. Food was bomb! They didn't have fettuccine alfredo on the menu but I still asked and they delivered. <br><br>Will be back to this spot next time I'm in town!", "pics": null}}, {"review": {"des": "Tried this place last year when I visited Chicago. So, I decided to try it again as I am back in Chicago for a conference. Did not disappoint! Appetizers were excellent. Ordered a bottle of Bennedetti Valpolicella for dinner. The black squid ink pasta is to die for. My wife had the gnocchi. She said it was the best she had ever had. Service is impeccable. One of the best Italian restaurants I have ever tried. Next time you're in Chicago, you must try Volare!!! I strongly recommend you call ahead for reservations.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PLDIBj4hc9X76ut780BdKw/348s.jpg", "caption": "Black. Squid ink spaghetti with seafood at Volare in Chicago"}]}}, {"review": {"des": "I really wanted to love this place, but it has so far failed me twice. After my underwhelming restaurant week experience last year, I thought maybe I should give it another try during normal season due to all the hype about it. But I wish I didn't. We ordered the warm kale salad, squid ink pasta and veal with lemon and wine sauce. First of all, they didn't serve us bread until we later asked for it. And the bread was just so average anyway. The kale salad was alright, and the true nightmare was the two entrees we ordered. Squid ink pasta was nothing but extra salty, like the cook knocked over a cup of salty in it. We didn't even finish half of it. And the veal dish - omg I promise I almost cracked up when I first saw it because the whole thing just looked so sad (see picture) like it's been touched by some other guests already before sending to me. And a few pieces of pale veal garnished with boiled broccoli and microwaved polenta? I wish I didn't pay $25 for that. In the end we were just so disappointed that we had to order a tiramisu not because we want a dessert but because we need to stuff ourselves. When the waitress came to ask about how our meal was, we told her about our disappointment in the food but got nothing but a \"sorry\". Why do you ask if you don't really care? Volare has dropped the ball twice so I'm not coming back or recommending it to anyone. Do yourself a favor to grab a Uber to Sapori Trattoria if you want some real authentic and flavorful Italian food.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-leU1j7Wp0Ymfuw5-2b5Lw/348s.jpg", "caption": "Saddest dish I've seen in a long time"}]}}, {"review": {"des": "One of the best Italian restaurant in Chicago from<br>The welcoming to the food , and Benny the owner is just a amazing person and business man .", "pics": null}}, {"review": {"des": "Delicious Italian food! Rotolini di Melanzane was yummy with the combination of eggplant and ricotta cheese for an appetizer. The Ravioli di Ricotta was pretty good too and it was cooked to perfection with great texture! The potatoes were excellent and the Italian sausage was not too bad and too salty. I came here for Easter lunch with a very large group of people and the service here is excellent! The owner or manager of the restaurant was all hands on deck to make sure everything was served efficiently and correctly. The employees really care about their customers and I would come back here because of their great service!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3UxVZ9vcGt71FQ-Vk-eE-g/348s.jpg", "caption": "Potatoes, chicken, and ravioli"}]}}, {"review": {"des": "Service was fine, inside was clean and pleasant.<br><br>The food itself was either oily or bland, and the portion sizes were way too large.<br><br>My wife and I started with the Vongole Al Forno - littleneck clams baked with bread crumbs.  Somehow these were very oily.  Like not dressed with olive oil, like sitting in oil.  They tasted fine, but it just takes something that is naturally lighter in flavor and makes it much richer and heavier.  <br><br>For a main I got Malloreddus all Sarda - pasta w/ sausage, mushrooms and peas.  The sauce was very sweet and the sausage super bland.  I picked this because I thought it might be one of the more flavorful options on the menu.  Pasta was slightly overcooked and the portion was easily appropriate for two people.  Massive quantity isn't my thing so maybe I should skip Italian.<br><br>My wife got the linguini with clams and it was ok.  It was a little light on flavor, and the portion was ridiculous but it fit its description better.<br><br>In short I think this place does well for service and ambiance.  After that I think they've taken what people think of as Italian and gone extreme on a few characteristics - excess portions, too sweet.  It was lacking in freshness, flavor, herbs, balance.  Maybe I just shouldn't eat Italian in Chicago, but don't trust the Yelp review rating here if your palate doesn't sound like the above.", "pics": null}}, {"review": {"des": "I could give this restaurant a 4 star rating for the food which was excellent.<br>Our waiter was good, but not 4 stars. I guess I'm just not used to Chicago prices as this place lost a star due to my 5oz. $14.00 Margarita.<br>As always, would you return and yes we would. However, we will skip the drinks.", "pics": null}}, {"review": {"des": "I came here for restaurant week, and it was a great 4 course meal! We came early for our reservations, but they still seated us right away. I ordered the lentil soup, lobster ravioli, pork tenderloin and risotto, and tiramisu for my meal. The lentil soup was nothing special, and was something that you could pick up from a grocery store it seemed. The ravioli was great, and the pork tenderloin was very flavorful and juice. The tiramisu was so moist! We had a great experience and left so full and happy!", "pics": null}}, {"review": {"des": "Whether it's for business or pleasure, Volare is one of  my go-to restaurants in downtown Chicago.  Volare combines a great win list, homemade pasta, impeccable service and a great atmosphere -- all in a location in the middle of it all.  These are some of the reasons that the dining room is always buzzing.  Next time you are in Chicago, take a pass on the chain restaurants and tourist traps and give Volare a try!", "pics": null}}, {"review": {"des": "Volare is a nice little restaurant in Chicago.  We went there based on the Yelp reviews and the recommendation of the front  desk clerk at the nearby hotel that we stayed in.  After making reservations, we started our \"short\" walk from our hotel.  20 minutes of walking, and we were there.  The lobby was packed and more people were arriving.  <br><br>We were seated promptly.  Unfortunately, the table that they gave us was right next to the entrance and very dark.  My wife objected as we could not see the menu.  They immediately moved us as soon as a table opened up minutes later.<br><br>We ordered their Fettucine alla Bolognese, Rigatoni all' Arrabbiata, and a Linguine Arselle e Bottarga.  The food was good!  The Rigatoni came in a spicy tomato sauce with Pancetta in it.  I liked the spiciness of the dish.  My daughter and I liked the Fettucine alla Bolognese.  It had lots of meat in it.  The sauce was perfect.  The Linguine was basically a linguine with clams.  My wife liked it.  Unfortunately, it was too dark in there for my camera to take good pictures without using my flash and blinding all the other customers.  <br><br>The food was good.  The service was good. One of the managers there even hailed a cab for us after we finished dinner so that we wouldn't have to take the 20 minute walk back to the hotel.", "pics": null}}, {"review": {"des": "There was a long wait. We were a group of 15 so had an amazing time. Food was good. Overall, it was fun", "pics": null}}, {"review": {"des": "Doesn't do any good to make a reservation, they don't honor them.  Do go there hungry as you wait will not make you happy..<br><br>By the third time they say they are ready you might get seated.  Got the impression they didn't really care if we stayed or not.  <br><br>I sure hope it is good after waiting 35 minutes past our reservation time.", "pics": null}}, {"review": {"des": "I love Volare.  It's one of my favorite Italian restaurants in Chicago.<br><br>It feels like a hidden gem, as it's tucked away down on the lower streets...by lower Wacker.  Most people are up on the main roads by Michigan Ave.<br><br>We've been going here for the last 10 years or so, but I never had a chance to write a Yelp review.  I really can't say enough about Volare, so I will just tell you that you have to come in and try it out.<br><br>One of our favorites here is the Squid Ink pasta.  Try it!", "pics": null}}, {"review": {"des": "I have been here twice, both times the service was very lacking. The most recent time, we ordered bruschetta as an appetizer and the squid ink pasta (Spaghetti Neri al Pesce) and the clam linguini (Linguine Arselle e Bottarga). <br><br>It took 10 minutes to get our order taken and then we waited about 30 minutes for the appetizer. We had to specifically ask our waiter for our appetizer. The pastas came out right after the appetizer so maybe he forgot about the bruschetta. Also, we asked for Parmesan cheese and our waiter was sorta aggressive and dumped a good amount on the pasta without asking how much we wanted. <br><br>The clam linguini was okay, it was lemony and had a good amount of clams but it wasn't amazing. The squid ink pasta was much better. The sauce is kind of creamy but not too heavy. The scallops were huge but there wasn't much of the shrimp or the crab meat. <br><br>The portions are pretty large so I ended up taking about 1/3 of the pasta home! It then took another 5-10minutes to get the check. We had to actually ask another waiter to box our pasta (who came back before the check did). Of course, the waiter was quick to take the card but slow for everything else and even had the audacity to suggest 18-20% tip on our check. <br><br>While the food was great, the service definitely put me off of this place for a while. It sucks that I can't remember the waiter's name.. I may come back in the future and hopefully have a more hospitable experience.", "pics": null}}, {"review": {"des": "My husband I eat at Volare's every time we're in Chicago. We both enjoy the energy, the service and the food. Volare's is a classic example of food is love. I am also in love with their entire wait staff and the beautiful energy they bring to the experience. <br>The grilled Calamari (Grigliata Mista) is flavorful appetizer: calamari, scallops, shrimp and octopus. So good. If you dine in September don't pass up the Chilean Sea Bass in a piccata sauce--ask for extra sauce. I ask for mine with angel hair pasta--I know, carbs, but if you're going to sneak some carbs in, this is the place. Last night I had the seafood carbonara. Dios mio! Totally worth it. I will dine a third time there this week, before I leave for home in California. And I will miss this wonderful place. I love you, Silvana. Benny, you know how to run a a fabulous restaurant. Thanks for treating me like an esteemed member of your family. One more thing: I can judge the care of a business by their bathrooms. Volare's gets five stars for their bathrooms, too.", "pics": null}}, {"review": {"des": "Wow! Now this is what I call Italian! If you are craving some delicious pasta, wine or cocktails, this is the place to go. We started off with a Caesar salad which was delicious. You can tell the dressing is freshly made and the croutons are so so good. I also had a mango martini that was out of this world! Highly recommend! <br><br>For my entree, I got the gnocchi in vodka sauce and my grandmother got the ravioli. BY FAR THE BEST GNOCCHI AND VODKA SAUCE I'VE EVER HAD. The gnocchi is fluffy and cheesy tasting. The vodka sauce is creamy but not artificial. The ravioli were also delicious. <br><br>The prices were definitely reasonable! My only qualm was that I wanted to add shrimp to my gnocchi and each small shrimp was $2. Seems a bit pricey for each shrimp. But still tasty. I'd probably not add the shrimp next time though. <br><br>I will definitely be coming back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/I4_zRDiIdAxmll0fHn5IaQ/348s.jpg", "caption": "Seafood risotto"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/s0dPiPBsnxQsFPfXFLre7Q/168s.jpg", "caption": "Squid ink pasta (I forgot the official name)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Okf6nY3ry1lHZuvpPMNo_w/168s.jpg", "caption": "Mango martini (drank some of it before taking a picture)"}]}}, {"review": {"des": "Came here on NYE and surprisingly service was still good and we didn't wait too long either. The bread was very good. I got the chicken Parmesan and it tasted great", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kKp9MvQBdeKitQeuK5MyzQ/348s.jpg", "caption": "Chicken Parmesan"}]}}, {"review": {"des": "I got the Linguine Arselle e Bottarga. They have gluten free pasta here. The pasta was so flavorful and delicious. I did, however, get food poisoning in the middle of the night after eating this (so I am not sure if they are very good with preventing cross contamination with food). The food tasted good and service was great.", "pics": null}}, {"review": {"des": "Have eaten there several times. Always great food, service is wonderful and management always comes by out table to check up on us and makes sure we are happy. Highly recommend...", "pics": null}}, {"review": {"des": "Ended up here when everywhere else was hours wait... Great service, great food and great tiramisu.  The wine list was extensive and the waiters were helpful picking one out. <br><br>I would definitely  go back for a special occasion and enjoy the good service again!", "pics": null}}, {"review": {"des": "Great food & service! We were able to get a last minute dinner reservation on a Saturday night. We ordered their special appetizer risotto ball and it had great fresh herbs and was cheesy. The homemade sausage was my favorite because it had a hot Italian fennel forward flavor, but the gravy it came in was amazing. I had fresh al dente  ravioli with ricotta and homemade meatballs. My husband was very happy with his veal rotini dish. Great fresh  Italian flavors!", "pics": null}}, {"review": {"des": "We have always made it a point to visit Volare when visiting Chicago from LA. This trip to Volare will be our last. The place was so frenetically paced with waiters and busboys rushing around  to accommodate big parties we didn't get seated until 8:15 even with 7:30 reservations. The local patrons were waited on first while we waited for someone to acknowledge us. The restaurant was loud, frantic, and did not have a welcoming atmosphere particularly if you're not a local. I'm disappointed but enlightened beware if you want a nice meal in a evenly paced Italian restaurant this is NOT for you. I'm giving it two stars for the food-", "pics": null}}, {"review": {"des": "Wow. What an experience. First Benny gave us the perfect table. I've been to many places around the globe and Benny is one of the best at making sure his customer is happy. Then our waitress Sara was superb. She gave excellent recommendations and in the end we had a tremendous experience because of the professionalism of Benny and his staff, and the superb quality of the meal. Oh yeah - the meal - I might have just had the best Chicken Parm ever and my wife loved the Risotto which was then followed up by an excellent chocolate cake desert with Limoncello. The desert and limoncello were on the house because Benny had learned it was my birthday. Tremendous experience and I'll definitely be back the next time I'm in town.", "pics": null}}, {"review": {"des": "I visited Volare a few days before going to Italy, thinking I probably wouldn't be very impressed. This spot offered excellent customer service. The environment was simple, no frills, and felt very \"home like.\"<br><br>I stuck to a simple order of spaghetti and basil and it was great. The portion was super generous and the pasta was hearty. I would recommend this place- my friend also loved her lasagna and it was also very generously portioned.", "pics": null}}, {"review": {"des": "This was the first time I've tried this place. The caprese salad was wonderful!  I also ordered their pork chop with spinach, cheese and Marsala sauce. The service was awesome too!  Looking forward to coming back here next time I'm in Chicago.", "pics": null}}, {"review": {"des": "Ordered the ravioli and it was delicious!! Probably the best ravioli I've ever had. I highly recommend eating here if you're looking for authentic Italian. I will definitely be back!", "pics": null}}, {"review": {"des": "Volare is an excellent Italian restaurant in the heart of Chicago! The seafood salad was amazing.. I added a little fresh lemon juice and the flavor popped!! We also had the black pasta seafood dish; another win! Highly recommend!", "pics": null}}, {"review": {"des": "My husband picked Volare for his birthday dinner.  I would recommend making a reservation, because the restaurant was quite busy on a Saturday even in the early evening hours.  Getting a reservation at our preferred time and day was easy too.<br><br>We shared a caprese salad, and for dinner I had the squid ink pasta which was tossed with an abundance of scallops and crab meat.  The sauce was delicious too.  The portions are large enough to share.<br><br>The location is great.  Before or after dinner there were a lot of options for cocktails and shopping, but we stopped at Stan's for dessert.  The decor was understated and not over the top like some Italian restaurants can be, and the atmosphere was relaxed but still slightly upscale.  The attentive service and solid wine menu also make Volare a nice restaurant to just sit for awhile.<br><br>I liked that the restaurant has an \"old school\" atmosphere.  This isn't a trendy, fly by night, place.  The crowd was noticeably older but also family oriented.  If you like Italian food with hearty portions, quality ingredients, and a laid back atmosphere, and you're tired of the small plates trendy craze, you'll like Volare.", "pics": null}}, {"review": {"des": "Simply phenomenal! Amazing food. Great drinks. Amazing staff.<br><br>For an appetizer, I had the margarita pizza which was cooked to perfection. Then I had the gnocchi in the vodka sauce which was definitely one of the best pasta dishes I have ever had. <br><br>This is a MUST try if your in Chicago.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Xf7ds15IhjtN-jlHZqyV7w/168s.jpg", "caption": "Gnocchi in vodka sauce. Amazing!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/T-_mPw8Iot7ltdstIylGBA/168s.jpg", "caption": "Margarita pizza"}]}}, {"review": {"des": "As an avid lover of Italian food, this place was hard to pass up due to the popularity and raving reviews. The proximity to the red line didn't hurt either! The atmosphere can be interpreted as a little more on the fancy side from the dim lighting (I actually saw someone use their phone's flashlight to look at the menu) and numerous utensils for each place setting on the table.<br><br>There was a great variety of different dishes (pasta, pizza, risotto, etc) that range from about $15-$30. Might seem a little pricy, but I can vouch that the quality is definitely up to par. And the portions are very filling as well. Both my friend and I got pasta dishes and they were both delicious! Not to mention, the bread that comes to the table is also very good as well! As for dessert, I tried the tiramisu and it had a slight coffee flavor, not as strong as it usually is, which I really liked. <br><br>The service was really great as well. Our waiter was very attentive to our table even when it got busy during the dinner rush, and my water was filled every time I was low (and I drink tons of water, so they were consistently coming to our table every time which I very much appreciated!). <br><br>Overall, I would definitely recommend this restaurant for a fancy meal with a friend or even a group of people.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nDLJiNEcL5DDHPwGD6GaHA/348s.jpg", "caption": "Tiramisu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4PJHNFV0zkt8uxHE5qI6OQ/168s.jpg", "caption": "Malloreddus alla Sarda"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/oNJYkQe_dcp9jhEmM6a0mg/168s.jpg", "caption": "Fusilloni al Ragu di Vitello (with optional parmesan on top)"}]}}, {"review": {"des": "This was our \"end of the vacation - live it up meal\" and that we did! Volare lived up to my Italian great grandmother's cooking! (It literally brought my mom to tears!!!) The service was fantastic and so helpful, the wine list was extensive, and the food was AMAZING. Try the squid ink pasta, tiramisu, and the cannolis for sure! If you want real Italian in Chicago this is the place to go!! <br><br>A word of advice - make a reservation! It gets incredibly busy.", "pics": null}}, {"review": {"des": "Cozy original Italian ambience. Best olive oil I've had in a long time but only pepper to add, no herbs. <br>Our server, Javier was fabulous and made great food suggestions. <br>Carpaccio was great. I had gnocchi with sausage in Vodka Sauce which was delicious. We also shared side of sautéed spinach which was great with nutty garlic pieces. Husband had Chicken Parmesan which he loved but I liked mine better and he his so all good!<br>I asked if they had Tiramisu and they said yes. However, they were setting up for very large party next to us in back left room and asked if we would mi e moving next to bar. That was actually more cozy because we were feeling closed in with tables. In turn, we got our dessert and drinks free!!<br>I felt like I was in Italy again!!", "pics": null}}, {"review": {"des": "Everything was spot on, the food was amazing, the service was attentive without being intrusive.its pretty easy to see why this place was packed on a Monday night.", "pics": null}}, {"review": {"des": "Great food and great experience! Our server, Joey J, was very knowledgeable and attentive without being intrusive (which is rare). The owner Benny is amazing. And the food...the gnocchi was the best I've ever had, and I love gnocchi! My father's lasagna was superb. And the prosciutto and burrata special was the freshest I've ever tasted. Highly recommend.", "pics": null}}, {"review": {"des": "First of all we came here for pizza that was advertised on yelp.... Well this Italian restaurant does not serve pizza.... So I tried the chicken risotto ..... it was okay but not worth the price.... my sister had chicken Alfredo (not on the menu) ...... it was also not worth the price .... the only reason I'm giving it 2 stars is because our server was amazing she made us feel like family! But overall the food was not what I expected ‍", "pics": null}}, {"review": {"des": "Highly recommend! As out of town guests, we were told about this restaurant from a local. We took a chance and went without reservations on a Saturday night. We anticipated we would wait and sit and eat at the bar, considering the wait for a table was 90 minutes. However, we were pleasantly surprised when the owner snuck us to an outside table after only a short wait. The food was delicious. Portions are shareable, to say the least. The house Chianti was perfect for the price and the service was spot on. You won't be disappointed!", "pics": null}}, {"review": {"des": "I rave about this place to anyone I hear is visiting Chicago. Their gnocchi is simply amazing and may even change your life (for the better). Trust in the gnocchi.", "pics": null}}, {"review": {"des": "Devine!  My faith has been restored in veal ! It was so thin and wonderful- I could cut it with a fork! I got the lemon and caper dinner and asked for a potato substitute with pasta with the light butter cream sauce it was divine. We also got a bottle wine and bruschetta as an appetizer which was excellent! <br>I was very worried about looking at the pictures on yelp that all it was was a bunch a red sauce dinners... But there were some nice non-red sauce dinners (could offer more) ... <br>The restaurant was crazy busy but I made a last-minute reservation at 6:30 PM and we were seated by 6:50 PM. I was happy to be in the energetic environment... Not so sure my husband was! I love the team approach to taking care of the table... It was very nice. The waiters and support staff are wonderful and very attentive. <br>We would definitely go back next Time in Chicago (which is often) <br> Great restaurant... Highly recommend", "pics": null}}, {"review": {"des": "So this review is purely for food delivery and pick up services. I waited over 20 mins for an order of three items that was promised shortly after my arrival. That did not happen. Instead to two women who manned the front counter continued to take reservations and assist with other delivery orders. Once I inquired of how much time remaining, the one girl said about 5 mins. I left the establishment to check on my car (there is NO parking made available for such services and all spaces are taken by valet).  I returned 10 more mins and my order was still not ready. Not once did these two acknowledge me or the fact I was there for a pick up. After another delivery service provider was told to wait, a 3rd member of the staff appeared at the counter. She inquired my name on the pick up and immediately found the order right there at the counter.<br>GO FIGURE! <br>The other two offered no apology.<br><br>I debated whether to leave a review but truthfully, it is necessary. I'm not sure if these two individuals or the managers of various establihmennts are aware of this but when you sign up to offer food delivery services it not just for you. As a driver and intricate part of what makes the service actually work, drivers are only able to work on one order at a time. That means from acceptance to pick up to delivery. While I'm waiting for this restaurant to get it together, I am losing out on other orders and in the end $$$. <br>Offering such a service may seem keeping up with tech or latest trends but it is really for places that have 1) the capacity and 2) will put the same amount of care and attention as they do to their traditional service. If one can not, do everyone a favor and discontinue..", "pics": null}}, {"review": {"des": "This was our back up choice if our first choice was too long of a wait. We really should've made it our first choice. Mixed atmosphere good for families, groups, couples and singles. The staff are very attentive and welcoming. The menu is a good mix of authentic Italian entrees and antipasti. The wine list is extensive and reasonably priced. Very little was missing from this restaurant and I wish I could go back- good food, good value, friendly staff.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VmL5b8kNYXSJR_F-t0rzGA/348s.jpg", "caption": "Squid ink pasta with shrimp and scallop"}]}}, {"review": {"des": "This place is amazing!!!!!!  The homemade gnocchi with vodka sauce melts in your mouth!  They bent over backwards for my son who is vegan!  The service from Jesus was impeccable!!!!!  Thank you for a fantastic first night in Chicago!!!!!", "pics": null}}, {"review": {"des": "Really nice business dinner at Volare.  Some classics things on the menu but also somethings new and different, crawfish carbonara?  Who knew?!?  Nice service and wine selection.  Had the carpaccio appetizer, excellent !", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zPMYQaurObF5gZN1YrYPsA/348s.jpg", "caption": "Carpaccio"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FvEw3UXJpqkR2gkR6dQxZw/168s.jpg", "caption": "Crawfish carbonara"}]}}, {"review": {"des": "One of my all time favorites when visiting Chicago. The decor is upscale, but the prices are very reasonable. I ordered the veal parmesan. The meat was tender, and the breading was light and delicious, and the fresh pasta that came with it was equally good. One person in my group ordered the fettuccine alfredo (off menu) and she loved it. Great wine selection, A+ service, and a beautiful interior. Can't wait to go back.", "pics": null}}, {"review": {"des": "Went lunch time and the restaurant had only a few diners. Got the fried calamari to start and the batter was quite soggy. It was either fried at the wrong temperature or left out long after being fried as it wasn't hot when it reached our table. <br>The spaghetti Neri al pesce though huge in serving had little seafood and squid flavor. I could taste more of the cream despite having so many lumps of crab meat. The pasta serving is indeed huge and I suggest you share this with someone.", "pics": null}}, {"review": {"des": "Old school Italian. I love the feel and vibe. The food is gorgeous. Huge portions but you wont want to share loved the warm kale salad to start (def share) and lovely gnocchi. The staff is efficient and charming. Def make reservations tho.", "pics": null}}, {"review": {"des": "My friends medium well lamb chop is done perfectly, however, my medium rare will requires a bit more technique. Filet mignon is lightly seasoned and nicely done. Filet mignon is easy to get it right as long as it is not over seasoned. However, at at a good restaurant, I would expect a bit more work to garnish the sides that comes with the dish. Risotto is super rich and creamy, I love it.<br><br>Our server is extremely knowledgeable and entertaining. She definitely knows the menu well. Listening to her introduction of daily special is like watching a professional performance in theatre.<br><br>Overall, I think the food is great, some dishes may require a bit more technique, service is excellence, but I think tables are way too close to each other to provide a truly exceptional experience. Servers literally cannot walk around the restaurant without bumping into each other or interfer other dining customers.   The restaurant needs a bit more \"breathing room\".", "pics": null}}, {"review": {"des": "5 stars easy! Impressive service and food is HEAVENLY. I'm talking every bite of likely anything you order. The place is a little pricey but you get what you pay for. Shoutout to Chris, our server, he checked in with us at all the right times. Would highly recommend!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TI9KYqktvcJpKEFkE4VRVw/348s.jpg", "caption": "Front of the restaurant"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XN5Kobi7vQjnAnNwBnzP9Q/168s.jpg", "caption": "Tiramisu and cannoli"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/w7bjQL9rboocWiVzIMvQbQ/168s.jpg", "caption": "Pollo al parmigiano"}]}}]}