{"name": "whisk-chicago-2", "reviews": [{"review": {"des": "This.  Place. Was. Amazing. From the decor to the menu to my server to the food! Wow. Loved every minute. Even the music was great. <br>I went right for when they opened on a week day so it wasn't busy. They were only accepting cash but luckily I came prepared. <br>The coffee there (drip) was wonderful. I never have three cups of coffee anywhere. Royal cup I think was who made the beans. <br>I got the shrimp, bacon and cheesy grits in a white wine light cream sauce with garlic. It was a TON of food. Breakfast for two days. <br>I was really pleasantly surprised that it was too rich. Of course it's rich but in the most perfect way. Unlike a cheap Alfredo sauce that's just heavy and thick, this was more wine forward making it the perfect topper to the rest of the meal.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zZvUPNnmGjF9gcGtxO80VA/168s.jpg", "caption": "The menu cracked me up. \"Food my good eats\" lololol"}]}}, {"review": {"des": "Whisk is such a great brunch spot! First off, the BYOB concept is fantastic!!!  Living in Miami, this needs to be incorporated over here! <br><br>Whisk is an excellent choice for brunch. They have a really good variety of options to choose from, including some delicious looking burgers. <br><br>For us, we started with the snickers French toast, which by all that is holy in this world, what a heavenly experience! I'm not one for sweets for breakfast, but the snickers French toast is a must. It's not too sweet and it has just the right amount of snickers flavor. It's big, so you can definitely share. For my main selection, I ordered the David's special. I recommend anyone who loves grits, to try this dish! It's creamy, savory and just flat out delicious!! Shrimp are perfectly cooked and the extra crunch the bacon brings, just makes it perfection. Also, it is a big bowl of grits! Sharing is highly recommended. I had orders a side of potatoes thinking I would need them, and they were great, but man the grits are more than enough. <br><br>The service is also to be noted. Are server was great! He helped us open bottles and was kind enough to suggest a craft of orange juice for our bubbly. <br><br>Now one thing to note is that the place is currently cash only. They do have an ATM, but there is a fee. Aside from that, this place is great! Good vibes, great food and wonderful service. I'll be back!", "pics": null}}, {"review": {"des": "Wasn't a bad burger but wasn't impressed.<br>The burger was a bit overpriced when you can get better elsewhere for near the same amount.<br><br>Burger toppings just don't cut it anymore as an excuse to make a regular burger into a high priced burger -when it's an excellent burger it doesn't need much added to it. <br><br>Many more options in the city.<br><br>Maybe it was an off day and they didn't execute it right?<br><br>It missed the mark and unfortunately didn't make it on the \"must return\" list.<br><br>The service wasn't bad but they didn't know how to tell a couple to chill a little when they were obnoxiously smothering each other. Maybe, a joke would have worked like, \"Get a hotel room people\" or something that would  have been a practical but fair approach to them. It was a bad look. The people are to be blamed more than the restaurant but it unfortunately caused a bad experience to others at the restaurant.<br><br>Try it out, maybe it'll change?<br>Maybe, it's better for brunch menus items?<br><br>Hey, it's BYOB.<br><br>They do sometimes have Yelp price deals so that's a plus+", "pics": null}}, {"review": {"des": "Okay, yum! Stopped in for a week day brunch with my husband and I'm so glad I did! There was no wait since it was a random week day and the service was super quick. The ron Swanson memorabilia is amazing, as well as everything we ate. I had the David's special which was AMAZING. Omg, so rich and yummy. My husband had biscuits and gravy and he said they were the best biscuits and gravy he's had in Chicago so far. I want to come back and try more of the menu!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KdXoA0IKIa3lopBgIsFr4Q/348s.jpg", "caption": "David's special"}]}}, {"review": {"des": "Came here after church for brunch and it was delicious! BYOB! All the food was delicious it was a part of four, we all ordered something different and shared. <br>Parking is a bit difficult (all metered parking).", "pics": null}}, {"review": {"des": "I recently dined here on a rainy Labor Day Monday. I'd tried the food at WHISK before, but this was my first time actually dining in. <br><br>Upon arrival, the hostess told us we'd have a 45 minute wait, but we were seated in about 25-30 minutes which was nice. <br><br>I had the brisket hash for my entree, and my friends and I split an order of Oreo pancakes. Everything was delicious! The brisket was juicy and tender, and the Oreo pancakes weren't overwhelmingly sweet. <br><br>My only complaints were that they were low on ice and didn't have pulp free orange juice. It's a BYOB establishment. When we arrived with our wine and champagne, they brought out an ice bucket with little to no ice. When I requested more, they told me they were very low on ice and couldn't give me any more. They also serve fresh squeezed orange juice, but they don't have a strainer on hand for a pulp free option. <br><br>Overall, I had a great time! I love BYOB restaurants, so I'll be back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gGK1GcEfg35_Y3ANQbD4Xw/348s.jpg", "caption": "Brisket hash and an order of Oreo pancakes"}]}}, {"review": {"des": "Went here for breakfast on a weekday because I had read good things about this place from my fellow yelpers.<br><br>The Ron Swanson decorations are really cool and will bring a smile on your face. the quote \"There has never been a sadness that can't be cured by breakfast food\" is soooo true!<br><br>I was apprehensive at first because there was only one waitress and she was really slow with bringing us coffee, but as more people arrived, she not only was faster, but the service we received was excellent.<br><br>We ordered the Steak and Eggs (the steak was huge!):  Ribeye steak, eggs any style served with choice of home fries, black beans or grits, and choice of toast, and the Crab cake Benedict:  Spicy blue claw crab meat patties, two eggs any style, roasted red pepper sauce, served with house potatoes and choice of toast.<br><br>The Steak and Eggs was delicious and I really enjoyed it, but the crab cakes were a little too creamy, not that they tasted bad, but they did not hold together well.<br><br>We want to come back here again to try a few other breakfast dishes and some of the yummy sounding lunches.<br><br>ps: Get here early as the space is small and seating is limited.", "pics": null}}, {"review": {"des": "As soon as you walk in you see all the Ron Swanson stuff. It's plastered all over the walls. It gives you something to look at while you wait for you food. We ordered the reeses pancakes and the snickers french toast. Both were delicious.<br><br>The pancakes were a the usual size. They were light and fluffy. The chocolate mascarpone was my favorite part. It went really well with the buttery pancake.<br><br>The snickers french toast was very good as well. The french toast was the right consistency with a caramelized outside. I was afraid the snickers would be hard and a weird combination with the soft french toast but that wasn't the care. They were melted enough to keep their snickers shape but soft enough to chew. The white chocolate sauce was sweet but that's exactly what you should expect when you order this. This dish was a lot smaller than the pancakes. It was 2 slices of bread with snickers in the middle and then cut into triangles. It was the perfect portion for me but would not have been enough for my husband.", "pics": null}}, {"review": {"des": "Overall: Ron Swanson would be proud of the greatness that is WHISK.<br><br>The good: Obviously this place centers its menu on meat, and that's a very very good thing. We came for dinner but breakfast is proudly served all day. The burgers were amazing, and even though they sound over-the-top and gigantic, they are well portioned and pair great with the fries (get the ranch seasoning). BYOB (plus an ice bucket if you ask), and the server was very friendly and let us down our entire 6 pack long after our meal had come and gone. <br><br>The not-so-good: I honestly can't think of anything bad to say. Nothing to complain about whatsoever!<br><br>Atmosphere: 10/10<br>Service: 10/10<br>Food: 10/10", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/i27rN7S5qaIFY6mZAI4lBg/168s.jpg", "caption": "BBQ burger with brisket, onion rings, and pepper jack"}]}}, {"review": {"des": "I really like this place. It's so close to where I live and the food is so good. I love both crab cake Benedict and lobster Benedict so much!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nktnJeNL8ISmcf18qSn7Sw/168s.jpg", "caption": "Love the names on the kids menu. \"I don't care\" \"I don't know\" \"whatever\" lol"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aay6eTjtkLOFIxq-f7kDjA/168s.jpg", "caption": "Crab cake Benedict and croissant sandwich"}]}}, {"review": {"des": "Worth a visit for the Ron Swanson decor, BYOB and a creative meaty menu, but the food itself isn't as great as a lot of other Chicago wonders. There was a long wait and it's cash only, so you really have to be dedicated to going there. <br><br>I got the brisket hash (brisket, egg and potatoes) and had to add salt and hot sauce to make it as tasty as my server suggested it would be. <br><br>My boyfriend got the Ron Swanson burger, just to check it off his bucket list. The meat was cooked well and was tasty! It was too much meat to finish.", "pics": null}}, {"review": {"des": "Food was good (minus the hard toast) and service was disappointing. We finished our food before we were checked in on and it was a decent wait for the food too... definitely BYOB because sitting and waiting sober here is painful.<br><br>Hi Joe!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/B-esEwqVOPRvIrcQfY4Ylg/168s.jpg", "caption": "Chilaquiles"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7bjUYhUma8UYp3061Ow4zA/168s.jpg", "caption": "Brisket Hash"}]}}, {"review": {"des": "Weekend morning, busy hours, 40 min wait- I understand. But when that wait magically becomes 2 hrs on a cold winter morning, it is a bit of a stretch- literally. It was a shame to stare at their entrance sipping our McCafe from across the street that my table might get ready any moment. Anyway, moving on...<br><br>Once seated, service was good... I ordered the Strawberry banana pancake that came with a white chocolate ganache. Honestly, it was amazing..I was licking the ganache off my knife after. I also tried my friends sandwich and a wrap.. both were alright but my pancakes were the best on the table. <br><br>Not sure about their lunch and dinner service but considering how long I had to wait I guess my pancakes were lunch after all. <br><br>Chicago is a busy street so parking on the main road might be a challenge but try looking on the inside streets- Wolcott on the right is usually available. <br><br>I've also heard a lot about their burgers so willing to come back and try those.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XR3sHjiq-xSMEKg_dOi5zw/348s.jpg", "caption": "Menu #2"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Y4GWuplijwDn_z721wPi-A/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9UvZnS0Wx7XlAMdbNT6VBg/168s.jpg", "caption": "What's with this guy?"}]}}, {"review": {"des": "We came with a Groupon since I've seen good reviews and wanted to try it out. Waitstaff are all very friendly.<br><br>Iced Coffee - Wasn't the best.<br><br>House Buffalo Wings - These were okay. Had a bit of kick to them, but a bit overcooked.<br><br>Garlic Mushroom Burger - My guy got this and it looked good. He liked it and said you can really taste the garlic flavor. He opted for Cajun Fries and those were good. <br><br>Chicken & Waffles - I opted for this and it was good. I made it Churro style which they dusted the waffles with cinnamon. I just wished the waffles were a bit more crispy. The chicken was moist and good. Also, wished it came with a side, maybe some potatoes or fruit.<br><br>Overall, it was good and would like to come back and try brunch.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9IxXcGmR5a-b7x7FTbJagA/348s.jpg", "caption": "Garlic Mushroom Burger"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RYUcYg_FT0FcCwIx_6gg6w/168s.jpg", "caption": "Chicken & Waffles"}]}}, {"review": {"des": "Many visits later and it's come to this. Well I tried. <br><br>I didn't want to leave b/c the brunch entrees are still good, but the staff have just gotten too rude to stay. It's like they've become so confident in their high reviews and regular following that concerns, even those that actually are justified, are met by a passive aggressive and dismissive response online and/or in person.<br><br>I really did keep giving it chances but I think I'll just go to another restaurant w/ brunch & BYOB where my friends and I can be greeted w/ smiling faces and feel welcomed, where they don't run out of ingredients and expect you to still ingest and pay for a half made item, where waiters can set aside their own personal issues and provide kindness and professionalism, where they treat delivery drivers like ppl, and where staff don't stare at my friends and I like we're underaged teens while we sip our beers at lunch. You know, a place where they actually want to improve customer satisfaction not explain away ppls critics.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1hDjcDVGGJmpW19cOnqtxw/168s.jpg", "caption": "Biscuits and gravy with two sunnyside eggs on top and banana berry pancakes."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VYhRv-AQ8dKKZY_EntvgHw/168s.jpg", "caption": "Peach mint ice tea"}]}}, {"review": {"des": "Came here around 1230 with 8 friends. Wait was about an hour. Cash only sucked ..but Mariano's was across the street and allowed ya time to go get our wine and champagne. (Yay to BYOB) We got a long table by the Front door. Food came fast. Wish the setup was larger but it turned out pretty cozy.<br>Everyone loved their food..I got the Lobster Benedict which was good. Def plan to go back. Docked a star for the wait & table spacing.", "pics": null}}, {"review": {"des": "Given the hype surrounding WHISK, the long wait time, and the overly decorative murals devoted to Ron Swanson, I wanted to check out Whisk for a Sunday brunch but left a bit underwhelmed. <br><br>For one, the wait time (1 hour+) and process is fairly archaic (not a No Wait or text and message type of CRM). But moving past that point of friction, the service was lackluster offering limited feedback and guidance on the recommended options. <br><br>I ordered the brisket hash with eggs over easy. The brisket skewed dry while the potatoes used in the hash were pretty bland. My wife ordered the buffalo chicken hash without bacon but it came with bacon so we needed to send it back to substitution (to their credit, they were quick in getting her the corrected version). I tried the chicken the second time and it was OK, again, perhaps the day was an off day, but the dryness and lack of rich flavor were surprising. <br><br>Unfortunately, I think the hype and rave reviews may have exacerbated the experience's underwhelming nature but I would be willing to venture out on a day that wouldn't require an hour long wait.", "pics": null}}, {"review": {"des": "Based on food alone, we ordered delivery. <br><br>Everything looked great on the menu and the delivery was easy. <br><br>The food unfortunately was bland and I don't use that term lightly. It's been a long time since I've had something without the flavor, I'm kind of disappointed actually.", "pics": null}}, {"review": {"des": "We have been here a couple of times, and it's always good.  The chilaquiles are amazing!  This time we got there 15 minutes before they opened, and they let us come in and sit while they opened up and made fresh coffee.  Decor is interesting - all things Ron Swanson.  They have co-op hot sauce which my husband enjoyed.  Staff is friendly, and they have some giant 6 person booths in back.  We make a point of coming here whenever we're in town.", "pics": null}}, {"review": {"des": "Any place that makes a shrine to the legendary Ron Swanson character from Parks and Rec automatically gets three stars. Add in some decent breakfast and dinner foods, and you're tracking well.<br><br>This spot is a little small, but it has that local neighborhood feel to it - friendly, cozy, and just maybe they know your name. I came for the House burger, and this was no joke. I felt like it was a challenge to finish, but at the same time, I was trying to appreciate the 1/2 lb of grass fed angus beef topped with guacamole, chihuahua cheese, chipotle mayo, and tortilla strips.<br><br>Don't worry Ron Swanson fans, there's a burger wrapped in bacon in his namesake.<br><br>I love the personality of this restaurant, and I'll be sure to be back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0IlzGx3T7RKR-hj6RXBkDA/348s.jpg", "caption": "House burger"}]}}, {"review": {"des": "BYOB Brunch: Ron Swanson Themed. It's a cool concept that lends itself to great aesthetic. <br><br>Bit of a cramped space, which means long wait times on Saturday and Sunday mornings. Debatable if the wait is worth it.<br><br>While WHISK is on the pricier end of brunch spots, it has pretty unique menu options like the Buffalo Chicken Hash and the Ron Swanson burger. I guess this somewhat justifies the higher price.<br><br>Waited about an hour to get seated for a party of 2, which was a bummer since we were told the wait should only be about 30 minutes, but it happens. Once we were seated, everything was great. Server was quick and checked up on us often. The food came out surprisingly quickly and was very tasty (I had the Buffalo Chicken Hash).<br><br>It's good overall, but not something I'd go crazy for.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pidGnNuyYkoPPGUyZcedCg/348s.jpg", "caption": "Buffalo Chicken Hash"}]}}, {"review": {"des": "Oh Whisk I think I mean I mean I know I am in love with you!  Today I went in for brunch before catching a flight home and loved every minute of this place!  When you walk in you see a familiar face in the wall looking back at you and that's because it's Mr. Ron Swanson from the great Parks and Rex tv show that is still on Netflix and was on NBC for years.  They have everything Ron Swanson from quotes down to a Meat meal on the menu!  <br><br>The menu is not huge but it's a perfect place that has some great options.  They have omelets, hashes, traditional items, pancakes, French Toast, burgers, salads and more!  <br><br>I decided to go with my favorite biscuits and gravy!  You get two full biscuits in a white breakfast gravy sauce a side of potatoes and two eggs.  This was so big and so flavorful it was delicious.  The eggs were cooked perfectly and made it a hot bite amazing.  I would say the gravy could use a little more pepper!  <br><br>My friend got a breakfast burrito which looked pretty darn good and she said it was awesome.  She got a side Cesar salad but she said it could have used more dressing.  <br><br>This place is BYOB so you can bring your own booze if you want!  <br><br>Overall this place gets my big stamp of approval!  I loved it and will for sure be back!", "pics": null}}, {"review": {"des": "Fun interior and I particularly enjoy the spacious booths. The servers are also great. <br><br>I've tried several things on the menu, so here we go: <br><br>Smoked wings (spicy honey BBQ) - LOVE. These are easily some of the best wings I've tried anywhere and I always get them. <br><br>Truffle fries - Quite good. <br><br>Cajun fries - hit or miss. Sometimes they're exceptional, sometimes they're on the saltier side. <br><br>Apple Smoked turkey Sandwich - pass on this one. <br><br>Tacos (shrimp, steak,chicken) - All are extremely delicious and I know my tacos! My favorite are the steak, followed by the shrimp tacos. <br><br>Southern style chicken - Absolute delicious and juicy. The piece of chicken is always very generous. The coleslaw is spicy, but very good as well. <br><br>Burgers - Sincerely not a fan of their burgers, but many people are! <br><br>Coffee and hot chocolate - Both are great. <br><br>Overall, a nice restaurant to enjoy a relaxed and hearty meal!", "pics": null}}, {"review": {"des": "I love themed restaurants especially anything pop culture themed! So this Ron Swanson themed diner was awesome in my eyes! Parks and Rec fans can rejoice because you can get your fill of Ron Swanson here along with awesome food!<br><br>We came in on a Saturday and only waited 20 minutes for a table. It's BYOB so I brought in some ice wine my friend from Canada gifted me. I went the sweet route for brunch. I got Oero raspberry pancakes and they were good! very filling. If you aren't a sweets person then this might not be the best for you, but if you are then this is a good excuse to have dessert for breakfast.<br><br>The only downside was the waitress took a while to come back and serve us especially when we asked for a something to open our bottle.<br><br>Overall, if I am feeling a more tex-mex brunch then I'd come here.", "pics": null}}, {"review": {"des": "So brunch in the mornings, burgers at dinner. Sounds like my kind of place. <br><br>Went here on a Monday evening. No wait, maybe 3 other couples in the place. Is a little on the small side but the artwork on the walls more than makes up for it. This place is entirely Ron Swanson themed!!! Now I love parks and rec so it's no surprise that Chicago does too. The atmosphere and food quality makes me wish I had discovered it sooner. As a life long vegetarian and current vegan I did order the veggie burger (which I can't stop raving about enough. The flavors were amazing!!!) with Cajun fries. Friend got the chicken  sandwich which he said was the best he had ever had and I'm inclined to believe him. <br><br>Service was prompt, friendly and informative. Place was clean and cool looking. They give you water in Mason jars for the hipster appeal. I wish the lighting had been slightly better for photos but that's my only caveat. <br>5/5 stars and I hope to return again for the brunch part.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WRioHHcyjW3zrzv1VSahGQ/168s.jpg", "caption": "Veggie burger"}]}}, {"review": {"des": "BYOB brunch spot! Came with a girlfriend Friday morning and was seated right away! <br><br>Food | Drink: BYOB and giant brunch portions<br><br>Mimos: Brought a bottle of champagne and complimented with WHISK's freshly squeezed OJ. Pulpy! No outside chasers allowed.<br>Croissant Sandwich: 4.5/5. GIGANTIC sausage, egg & cheese sandwich (choice of sausage, bacon or chicken sausage). Comes with side of potatoes. <br>BBQ Piggy Benedict: 4.5/5. Pulled pork so tender!<br><br>Service: Quick, but nothing above and beyond<br>Ambiance: Ron Swanson pictures everywhere!!! Great decor. Minimal seating.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SVlQ7MfDD-eaIG-GUmfw-w/348s.jpg", "caption": "BFF with her BBQ Piggy Benedict with Ron photobombing"}]}}, {"review": {"des": "Since I'm on workout restrictions and have way more spare time on my hands I've been stuffing my face. Today's stop was whisk for brunch.  The hostess told us it would be a 3 hour wait.....it was really 45 mins. <br><br>BYOB for some mimosas . The OJ was homemade and incredibly pulpy. <br><br>Food was really good. But not three hour wait good. The table next to us order deep fried Oreos and I think one of the ladies was crying over how good they were. She really had tears. They offered us one, but we declined. (You are sitting incredibly close to the table next to you). So, if you don't want anyone to over hear your conversation prob not the best spot. <br><br>We felt like they rushed us out...but you know...three hour wait.", "pics": null}}, {"review": {"des": "Now that my teens are devouring every episode of Parks and Rec on Netflix, I knew I had to take them to Whisk during our Chicago weekend. We showed up at about 6:30 on a Friday night and were shocked when we walked right in and got a table immediately after getting rock star parking too. Of course, it was pouring down rain, but still...<br><br>We started with the poutine fries appetizer, complete with an egg on top to delight the children. Our whole crew ordered various burgers and were reduced to grunting primates when they were served. Being the only vegetarian, I ordered the veggie burger, which wasn't half bad. (I know if Ron Swanson was in the house I would have been asked to leave.)<br><br>Learned this restaurant was BYOB too late to bring anything, but will pack accordingly next time.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qQd38cMGnh9yS2xjrCvlvQ/168s.jpg", "caption": "Poutine fries, FTW!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CPPdbSpOFluy_L9OfVGIyg/168s.jpg", "caption": "You had me at meat tornado."}]}}, {"review": {"des": "With the stern, mustachioed face of Ron Swanson looking down at you from all directions, you'll be sure to enjoy the delicious brunch at Whisk.<br><br>Located in West Town, Whisk is a cozy brunch/burger restaurant that serves your classic brunch food with its own little twist. Coming here at the height of brunch service on Sunday afternoon,  my friends and I were able to get a table for 3, surprisingly, with only a 15 - 20 min wait. It is nice that you can put your name down on the list, and they will text you when your table is ready. With Mariano's across the street, it is not very hard to pass that time either.<br><br>The food at Whisk is solid for brunch food. My order of chorizo benedict had just the right amount of egg, chorizo, and avocado on an English muffin. The dish also came with a side of potatoes that actually tasted great, probably better than the benedict itself, as they were a bit crispy and seasoned well. My friends' ordered the buffalo chicken hash, which they very much enjoyed. The consensus was that while the side potatoes were amazing, the main entrees themselves were decent but did not stand out above the many other brunch places in the city.<br><br>The one thing that really was amazing, elevating Whisk from 3 to 4 stars, was the truffle fries. The thin-cut fries are sprinkled with cheese, salt and  pepper, and a egg yolk drizzle. While it wasn't on their menu, we still were able to order it. Getting the fries after eating our brunch food might have been overkill, but it was well worth it.<br><br>Whisk is definitely a fun place to come for brunch not only for its interesting Ron Swanson tribute decor but their amazing truffle fries.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/K3-7oAAPRtIqMpKvOmF14A/168s.jpg", "caption": "Chorizo Benedict w/side of potatoes."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Gffq5Icw87iqDVc08WhnLA/168s.jpg", "caption": "Truffle fries!!"}]}}, {"review": {"des": "This was our fourth and final visit to WHISK. The first three visits were before all of the changes (times, menu, payment) when it was still pretty great. <br><br>On our visit today, we were greeted by a sign on the door: CASH ONLY. ATM INSIDE. When did this place become cash only? Even this very Yelp page says that they accept credit cards. Neither of us carry cash, but we had an ATM card and went in. <br><br>The service was okay. Slow, but not bad. I saw our waitress only once during our entire hour-long stay there. The most interaction I've had was with people who offered to refill my coffee. They were great. <br><br>The worst part of the experience came when it was time to pay the bill. My fiancée went to the ATM to take out the cash only to find the ATM out of order. There wasn't any sign on the ATM saying that it wasn't working. We turned to the hostess at the door to inform her that the ATM was not operational. She said \"Oh yeah, I know. There's an ATM around the corner.\" Seems like this is information you should share with the customers before they come in and expect the use the machine inside. <br><br>Our branch's ATM machine wasn't around the corner. It was a mile away in the middle of Wicker Park. So, I drove a mile each way (having fun finding parking each time I had to get out of the car), got the cash, and paid for our food. Overall, a pretty awful experience with some terrible communication between restaurant management and the customer. <br><br>The food was great, so you get one star for the food.<br><br>EDIT: I've spoken to the owner and decided to amend my rating. Three stars for three good experiences prior to the awful one.", "pics": null}}, {"review": {"des": "Living in Indianapolis, BYOB places are non-existent so this common concept in Chicago is a BLESSING let me tell you. My friend and I came in and were seated right away in the cute patio in the back. We bought our own champagne and ordered a small carafe of their freshly squeezed (super pulpy, if you're into that) orange juice, and brunch. We split the crab cake benedict which was served with their house potatoes (fried and bland), and also ordered a side of fruit (raspberries, strawberries, grapes). <br><br>But let's be honest, we came for the mimosas. I love this spot, I love the concept, and I would definitely recommend it.", "pics": null}}, {"review": {"des": "Came in with a party of 3 on a Thursday evening around 6 pm. Plenty of seating and we were able to get a booth. Service was decent but it took a while for them to come back to check on us initially to get our orders in. We ordered the aoli fries as an appetizer for the group and everybody really enjoyed it. Would definitely recommend that to start off. <br><br>I tried the Steak and Eggs since it was a breakfast for dinner type of night for me. The steak was cooked exactly how I asked for it but not as flavorful as I was hoping. Nothing too exciting, definitely your run of the mill diner food (I was hoping for something that I'd really enjoy and be worth the price that I'm paying). Maybe it's just the dish that I ordered or maybe I should come back for the actual brunch/breakfast menu. My friends both got burgers and while one said his was good, the other said her's was so so (not flavorful enough). The blueberry hibiscus sweet tea was nice if you're in the mood. <br><br>Overall, props to this place for its commitment to the Ron Swanson decor, definitely a cool place to dine solely based on the theme. I would probably come back with friends but just order something else since the meal I enjoyed was pretty lackluster.", "pics": null}}, {"review": {"des": "I was so pumped to finally try out the Ron Swanson themed restaurant!! <br><br>It was about a 45 minute wait for a table of 10 for lunch on a Sunday, so I wasn't surprised by that at all. The hostess was super friendly and was very accommodating. Once we were sat down, it didn't take long for our food to arrive even though it was extremely busy. I was very impressed overall by the service and by our waiter who was nice enough to take our tables picture. <br><br>I ordered the Shrimp and Chorizo Hash and I instantly fell in love! I'm definitely going back specifically for that dish. I was also excited to see Nick Offerman's signature on a picture frame that was sitting right behind me!! <br><br>Superb experience.", "pics": null}}, {"review": {"des": "There are some menu items that are exceptional and some that are TERRIBLE.<br><br>Here are the exceptional dishes:<br><br>1. Anything with shrimp (that shrimp/grits dish), once they had a special with chorizo and shrimp and I curled my toes as I was eating it. So. Yummy. <br>2. Nutty Croissant French Toast. Decadent, the right kind of sweet. YUM all around, this is one of my favorite desserts ever. I could eat this once/week.<br><br>3. The portions on the salads are excellent! I got the once with bacon, chicken, homemade  ranch was also excellent<br><br>Here's what I thought was awful<br><br>1. The circulation is not great. I'm not sure what business this was before but it smells like cigarettes even though it's clearly no smoking. Oddly, the outdoor area (which is covered by a thick blanket) had the same odor. If you're sensitive to smells, I recommend ordering delivery.<br><br>2. They use pre-shredded cheese in their salads it has a chalky film that all pre-shredded cheese has and this was not palatable.<br><br>3. The reeses pancakes are complete trash. First off, they have approximately two peanut butter cups crumbled atop a \"white chocolate\" sauce soaked doughy (not crispy) pancakes with banana. \"what the eff and I eating?\" I wondered as I took my first bite...It tasted like a bizarre artificial cream sauce (made with oil). They should rename this because it's more of a \"white chocolate\" pancake than a reeses  peanut butter cup one. If you label something that way, you really should deliver.<br><br>I'll come back for the shrimp and croissants because they are sooo good so I'm being generous with the rating, but the issues here are serious and inexcusable.", "pics": null}}, {"review": {"des": "I came here because I love Ron Swonson and breakfast food. The place looked very hip upon first impression. Got our table immediately, service was very quick and pleasant. We got the crab Benedict and the pulled pork hash. The Benedict was good, but the sauce over powered the crab. The pull pork hash was amazing. The price was very reasonable, portion size is not big. Great place overall!", "pics": null}}, {"review": {"des": "I love yelp. I usually decide to try out the less well known restaurants lately but this past weekend wanted to try something a bit more well known to the yelpers. Sorted out my reviews by \"most reviewed\" and went down to the list offering options until we finally decided on checking out Whisk. The menu looks delicious if you're looking for good comfort food, or a heart attack if you decide to go with the Swanson burger. <br><br>Anyways, we arrived at the restaurant and luckily there was some seating at the counter top so we didn't have to wait. Just a FYI they don't take reservations. Like I said before, the menu looked delicious. I decided to go with the The Old Timer as I was debating between the Ron Swanson burger but I decided to give my heart a break. The interior is really nice. There are pictures everywhere of Ron Swanson. If you don't know who that is, he is a fictional character on Parks and Recreation. There were pictures of him everywhere. No idea what the connection was but cool concept. <br><br>Anyways as we were waiting for the food, the staff seemed extremely under staffed. It took us 45 minutes to get our food. No joke, 45 minutes!!! For a burger and steak tacos. While we were waiting I was observing what was going on. FYI I love people watching so I could be watching you. LOL ok that was creepy. Anyways, while we were waiting, I witnessed a table who literally put her food back in the kitchen at least 5 times. WTF did she get and why didn't she like her food??? That was really odd and I felt bad for the workers. Also, one of the hosts/waiters was literally hanging up on people that were calling. It was pretty funny actually because we called before to see if there was a wait but you could tell when we called he wanted no business to talk on the phone. So I guess the reason for the long wait was because there was a catering order. Listen that doesn't give you any reason to delay my food for what seemed like an eternity. One of those instances where again service makes the experience bad. I still enjoyed the ambiance here and the burger was good. The cajun fries were delicious that came with the burger. I would come back to try this place again if I'm ever in the area but really people, please train your staff. Service makes all the difference in the world. This would easily be a 4 star review but the service makes me give this place a 3 star review. Oh and a huge plus for this restaurant, its BYOB.", "pics": null}}, {"review": {"des": "We ordered the old timer and the turkey club. Both amazing and quick service. Got the old timer on French toast with bacon and an egg on it. The turkey club was missing like a hug of a mustard but that was just me.  Everything was fresh and warm! Decor was awesome!", "pics": null}}, {"review": {"des": "Besides visiting Whisk on one of the hottest days of the summer and slowly melting away in our chairs... this brunch was worth the pitcher of water as we shed our water weight! I suppose it only made more room the calories right? Hahahahaha.<br><br>I love that it's BYOB and with Mariano's right across the way, even if you forgot to bring something, you can run across the street. We ordered our food and just let out waitress know we'd be back in 10 minutes. By the time we got back with our champagne, our food was already rolling out. We all know how much we love retuning to our seats to see our food is already there! <br><br>I ordered the St.Louis Benedict, my girlfriend the shrimp and grits. We were both super stoked to have visited and again despite the heat (at no fault of whisk of course) it was sooo worth sweating through our food! Everything was BOMB.COM. Yes, judge me, I said it! <br><br>I'm a brisket lover and they definitely delivered! Every bit had a blend of sweet and savory, and The jalapeño slaw just tied it together. I've waited so long to visit and I'm happy I did! <br><br>The shrimp and grits were off the chain too! kudos to the chef for making a slammin' S&G, they were as firrrreee as the temperature outside. <br><br>Thanks Whisk for the delightful brunch! We most certainly will be returning! And big ups to the staff hustlin' on this hot day. We were serviced so well and had an enjoyable experience.", "pics": null}}, {"review": {"des": "I'd give it 3.5 stars. The establishment is nice with a quiet patio. Came for breakfast. <br><br>When i came in, I chose to sit outside, since it was a really nice sunny day. Instantly regretted my decision. <br><br>Not because it was hot outside, but because the mosquitos, flies and ants that kept falling in my food. To top it all off, my waiter just forgot about me (i was the only one in the patio when i got here). <br><br>So, i paid $3.5 for a tiny cup of coffee, i kept waiting for him to refill it. <br><br>The food came out pretty quickly. The omelette was decent, but I believe they forgot to add the extra bell peppers that i asked for.<br><br>And the pancakes were great, how wrong can you go with delicious white chocolate sauce lol. <br><br>Overall an ok experience. I will recommend the oreo pancakes and maybe sit inside if you can.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DqzLd-iWdDoGjsLveQpd9A/348s.jpg", "caption": "Oreo Raspberry Pancakes"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/k5iDC3jHRKHbkBnnR7k-Gg/168s.jpg", "caption": "$3.50 coffee"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hD-Hrq0P07N-rm1emwUp4A/168s.jpg", "caption": "Chorizo Omelette"}]}}, {"review": {"des": "Whisk is a brunch by day and burger place by night. I purchased a dinner for two on Groupon value of $30 and anything outside of that is what we are responsible for to pay. Whisk got my attention because of the of the really good four to five-star rating on Yelp. So I wanted to go with my husband for a date night.<br><br>When you first walk in you are see obvious theme Ron Swanson from the show Park's and Rec which is hilarious and fun. The servers and operators of the place are friendly and informative. We both ordered their burgers. I like that it comes with fries, if you want truffle fries it is $4 extra. Which we got for one burger plate. I ordered the garlic mushroom burger. My husband had the house burger. I felt the burgers were meaty and huge it is a 1/2 lb burger patty. Their truffle fries were just okay in my opinion for $4 extra I can understand you it's a nicer salt or oil they use for the fries. But I didn't taste much truffle salt on those fries.<br><br>If there one thing I learn to do is to eat a gourmet burger with no sauce. I want to taste the burger meat as it is as to how the chef cooked it. The burger flavor was lacking in flavor. I guess grass-fed beef may need more seasoning? I never reached over for the ketchup that was there because I know once I do that it's eating ketchup and covering up those ingredients. I liked our Groupon deal it gave us a chance to come out and check out Whisk's burgers. I give three stars because the food is good for the value. They have a fun and cute theme for their restaurant. This place is bustling with tons of business. They have their crowd locked in and they are a fun place to go have a burger and I'm sure their brunch is good too. Would I recommend this place sure, check out this place perhaps my burger wasn't the best one to select?", "pics": null}}, {"review": {"des": "I'd heard so many great things so I was ready to try this place. Perusing the menu was difficult;everything sounded GREAT. I choose the crab cake breakfast. The eggs were fine (I mean they're eggs), but my crab cake was coldish and had the taste of freezer burn. Nope, nopity, nah.<br><br>My friend whom I was dining with has been there several times and LOVES this place... So perhaps I just had a singular poor food experience.<br><br>Service was just fine! Nice people.", "pics": null}}, {"review": {"des": "I LOVE this place! I dropped by recently while visiting Chicago and staying with a friend who lives nearby. Luckily for the both of us, it was a short walk over and we didn't have to wait very long to get our table, maybe 15 minutes or so. Everything was great! I ordered the Pumpkin Cinnamon Roll Pancakes while my buddy got the Brisket Hash.<br><br>If you want to know what the perfect pancake tastes like, then you need to have them at WHISK. Fluffy, moist, filling, flavorful are immediate terms that come to mind. It was all I needed and it hit the spot!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tglRU_GBlv25fAZZB1wACQ/348s.jpg", "caption": "Pumpkin Cinnamon Roll Pancakes So good! I loved the pumpkin & cinnamon flavors"}]}}, {"review": {"des": "okay did whisk change to new management or what's going on!?! <br><br>I stopped by yesterday to use a groupon (that you could only use after 5pm) only to find it closed and a \"cash only\" sign at the front door.?? <br><br>This place used to be super packed and had some great reviews, but I see it's going down hill...", "pics": null}}, {"review": {"des": "Not sure if I can call this a hidden gem, but they are just as good as some of the other bigger breakfast places in town. The wait was much less here versus other spots we called ahead to. They do offer indoor and outdoor seating as well. I felt this was a excellent restaurant for our group and everyone loved it, we all tried different dishes and we ate everything with a smile on our faces. We all agreed that we would come back here again. Definitely a quality place in a competitive market.", "pics": null}}, {"review": {"des": "YES. BEST BRUNCH SPOT. Went with friends, we all shared dishes and left v v happy. Also coffee is great!<br><br>Grits- as buttery and creamy and as good as it can get. But ya need to share this one, it's a bit heavy to have alone. <br><br>Brisket hash- BEST. Tender beef brisket soaking up all the egg yolk and potato flavor. V satisfied. Next time will eat 2 alone.", "pics": null}}, {"review": {"des": "Really like this place.  Walking distance to my house food is delicious and bacon is sweet and savory.  Get there early as it gets packed quite fast and you may get stuck in the community table.  Reasonably priced and great portions.", "pics": null}}, {"review": {"des": "I always visit here for a breakfast when I go to Chicago. Check the specials board to make sure your not missing out. Have each person get something different so you can share! <br>Expect a wait, it will be worth it though. <br>I would describe my food but I won't even bother as this is a must visit, it's just that good.", "pics": null}}, {"review": {"des": "Knocking this down to 3 stars. We stopped visiting after being frustrated with the chronically inaccurate wait times. A year later, we decided to try again. The hostess quoted 45 min and we waited almost 2 hours in the rain before we were called. We also didn't get the coffee we ordered. Food is good but it's not worth the frustration. Their host staff just doesn't get it.", "pics": null}}, {"review": {"des": "This review is for a grub hub delivery order of the house burger (~$13.5) and substituted truffle fries (+$2.50). and for a separate brunch visit where i tried the brisket hash ($14).<br><br>The house burger was ok. It's an 8oz grass-fed burger topped with chihuahua cheese, chipotle mayo, guacamole, tortilla strips. the truffle fries were kind of soggy by the time they got to me (because of the delivery) so i hope they're better when they're fresh in house. the brisket hash was decent: house-braised beef brisket, bell peppers, fresh jalapenos, onion, and chard served on top of house potatoes, topped with two eggs any style (i had it over medium) and pepper jack cheese sauce, and choice of toast. they don't really give you that much brisket unfortunately. all in all, the food is fine, but it would have been better. the flavor is a bit lacking. <br><br>I love the quote they have on the wall though. \"There has never been a sadness that can't be cured by breakfast food.\" Ain't that the truth", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ngZrsdBAXl81k-ZSc2n_fQ/168s.jpg", "caption": "truth"}]}}, {"review": {"des": "This place was probably by favorite place we went to in Chicago. Me and a friend were staying in Ukraine village when whisk came across my yelp page in a search for brunch. I am so glad I stumbled upon this and will hopefully return in the future. This place is a Ron Swanson restaurant. They are BYOB which is amazing and the food was outstanding. I had a chorizo omelet that was to die for. Highly recommended. Service was amazing.", "pics": null}}, {"review": {"des": "Good food, great ambiance. The Beef Brisket Benedict was very good, but I thought that the potatoes were lacking a bit. Will be going back to try more off of the Swanson menu, but overall first impression was only good", "pics": null}}, {"review": {"des": "Next morning after a wild night in Chicago, I was of course so excited to go see Bridget, an old pal from college, who lives there. She was like \"oooh know this great place in between us right now, look this on google maps, girlfriend!\" So I said ok and traipse in the snow until I ran into her on the sidewalk.<br><br>Bridget told me she just left the grocery store and I was thinking \"wtf, why is she at the grocery store before we go to brunch?\" She pulls out a bottle of champagne out from this bag. Oh wow, I thought, this is another one of those BYOB restaurants that exist nowhere else in the world I believe (Indiana is the whole world btw).<br><br>We asked the waitress for glasses and pulled out the champagne and orange juice. The waitress had a near meltdown over the orange juice and told us to immediately put that up. That's when she pulled out some pitchers and asked us a size, then continued to pour some orange juice in it. After she poured us the pitcher, it was like Bridget's outside orange juice scandal was outta sight, outta mind and all forgiven. <br><br>I remember having a Mexican Scramble and it was ok. I was mostly in it for the sour cream. The portion was a little smaller than expected, but that's ok, because it ended up filling me up.<br><br>It was an ok place.  It was busy. I liked it enough for four stars, but I wasn't jumping-out-the-window in love with the place.", "pics": null}}, {"review": {"des": "Service was a bit slow. Waited about 20 minutes for outdoor seating. Extremely hot day and I was sweating up a storm. Maybe a couple of fans would be nice. Took waiter a long time to take our order. Food came out slowly but it was good.", "pics": null}}, {"review": {"des": "\"The whole point of this country is if you want to eat garbage, balloon up to 600 pounds and die of a heart attack at 43, you can! You are free to do so. To me, that's beautiful.\"<br><br>In this review of Whisk, I will be using Ron Swanson quotes liberally because he is amazing and Whisk memorializing him is also amazing. If you know someone who is a Parks and Rec fan or Ron Swanson or Nick Offerman fan, take them here. Ron Swanson portraits are everywhere and his influence decorates Whisk.<br><br>\"Put some alcohol in your mouth, to block the words from coming out.\" <br>Whisk is BYOB! We were the only table on the patio sans boos so don't be a dummy like us and pick some up. Pro-Tip: Mariano's is across the street.<br><br>\"Any dog under 50 lbs is a cat and cats are useless.\"<br>Whisk's patio is dog friendly! They were very kind and even brought out a water bowl for the pup.<br><br>When asked if he wants salad, Ron replies, \"Since I am not a rabbit, no, I do not.\"<br>Me and Ron Swanson...we're on the same page. My eats at Whisk:<br>Chicken & Waffles $13.50 - Good crisp on that chicken, juicy on the inside. Waffles were alright but nothing overly amazing about them. Of course, pour some maple syrup over everything and it's downright delicious.<br>Truffle Fries $8 - Huge portion and a lot of truffle flavor! We enjoyed them though a bit oily. Even Kogi the Dog approved!<br><br>\"When I eat, it is the food that is scared.\"<br>In closing, I'm a monster.<br><br>\"Why is everyone else so bad at eating?\"", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1mn7I5J0yXpPRLyXt2GWjw/168s.jpg", "caption": "Dog friendly patio, woof!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/T1c3SUzIKr_i6zOgVi67EA/168s.jpg", "caption": "Yessss."}]}}, {"review": {"des": "I thought I'd written this review already, but I guess not, hunh?<br><br>I've been here a number of times, and plan to go back several more because Whisk is Bae!<br>Seriously, though, I've never had a bad meal here. I love that they serve brunch until 5 pm. I love breakfast food and most breakfast/brunch spots are closed by 3 pm, so I'm really glad that Whisk is an option!<br><br>The ribeye (Steak & Eggs) is awesomeness: well-seasoned, cooked to medium, as requested, and tender! The house potatoes are the perfect blend of fried crispiness on the outside, and baked-potato-like pillowy-ness inside. The Brisket Hash is delicious, as well. I haven't tried the sweeter side of the menu, but that's on my list!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UuOrkdH_do9vPW-mxMaHyQ/348s.jpg", "caption": "Banana Berry Pancake"}]}}, {"review": {"des": "all around amazing experience! BYOB if you plan on having a drink! they supply the fixing, you supply the booze! the wait can get pretty long, so if your just meeting a friend you might want to grab a spot at the community tables! either way, the wait is totally worth the incredible menu options, friendly staff, and fun atmosphere. ( you'll especially enjoy the atmosphere if your a fan of parks n rec). unfortunately I don't live in Chicago but if i did you can guarantee this would be my Saturday morning go to spot!", "pics": null}}, {"review": {"des": "I'm taking it down a notch. Just like always...they get popular, food quality goes down, costs go up.  <br>Dave's special got smaller shrimp and more soupy. The BLT benedit is gone and now they have others that don't have the flavor and the hollandaise went to shite.  The crab cakes were small and flavorless. And then they charge me $6 for one egg and a side of black beans. <br>I'm over you Whisk", "pics": null}}, {"review": {"des": "So something I loved about this place is that it is BYOB! Not many cool places that allow you to bring your own alcohol! P.S You can not bring your own mixers here. We brought some juice to make our own mimosas but we were told that we had to buy the juice from them! No biggie!  I came here with two other people and we were seated outside! Pretty cool patio and it has shade!  <br><br>I ordered a Chicken Caesar Salad. The only reason I did not like this salad was because the chicken was burnt. Very burnt that I could taste it in the chicken. If the chicken would not have been burnt I would have given this place another star!<br><br>Our waiter was \"D\" like the letter! He was awesome and kept constantly checking up on us making sure we had enough water and juice for our mimosas!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VKBOmZpIdFvxqwBrxWRnHA/348s.jpg", "caption": "Chicken Caesar Salad"}]}}, {"review": {"des": "I struggled deciding between 2 and 3 stars for this place. I decided on 2 stars because I was not pleased with the service and the food was just meh.<br><br>I went for brunch on a Friday afternoon when there were not many people eating there. My boyfriend and I asked the waiter to give us a few minutes to decide our food because we're indecisive people. The second or third time he comes back he SITS DOWN AT OUR TABLE and makes fun of us for taking so long. I know it was done in all good fun (kind of?) but honestly I was taken aback and found it to be rude. After we ordered, we waited almost 45 minutes for our food. It was not a busy day so I don't understand why it took so long, I think some mix up happened or they forgot about our order. This was AFTER our waiter pushed us to order soon and we didn't get any explanation as to why our food was taking so long. We ordered the Brisket Hash because it is considered one of their specialties. There was barely an brisket on there and the taste was just meh. Definitely not worth what we paid for it. <br><br>Overall the service was poor and the food didn't make up for it, it was just meh. I would not recommend going here.", "pics": null}}, {"review": {"des": "I had my first brunch experience at Whisk today and I must say that despite the rather interesting decor of the establishment, the owner apparently is a big fan of the 'Ron Swanson' character from the defunct NBC tv series 'Parks & Rec,' the service in this place was HORRIBLY BAD!<br><br>My friend ordered an Omelet, and I went for the traditional pancakes & bacon breakfast. I asked for a glass of iced tea and was told by the waiter that he wasn't sure they had iced tea. When he returned to the table, after apparently checking with a Magic 8 Ball about the tea, he told me that \"Yes, we have iced tea.\" When I asked if it was black tea or a flavored variety, he looks slightly perplexed and responded \"They're all pretty dark teas.\" I just stared. I thought to myself that I would give it a chance and ordered the tea, just hoping to myself that it wasn't Mango flavored.<br><br>After twenty minutes of waiting for our food, with my friend periodically asking \" How long does it take these folks to make an omelet?\" Our food arrived. Despite bing told that the pancakes (which were $4.00 per pancake) would be plate-sized, the single pancake that I ordered was no bigger than your average pancake. I brought this to our waiter's attention and all he said was \"Yeah, it does look a lot smaller than usual.\" So, I ordered a second one, which too was just the size of your average pancake. Clear no truth in advertising here. My friend sat across from me in abject disappointment that her omelet was not throughly cooked and had runny egg inside of it, the horror...the horror.<br><br>After we finished our rather mediocre meal. My friend said she would pick up the tab, since she recommend the spot. After paying the bill she realized that she was given the work credit card back. Upon looking at her bill once more she realized that she had paid for someone else's meal. She IMMEDIATELY informed our server whom, much to my friend's dismay was no where nearly as concerned about the fact that someone else in the restaurant had her credit card, and she theirs. The other patron and victim of the credit card mix up also realized what had happened and sought to redress the situation quickly.<br><br>After the billing was cleared up, and the credit cards returned to their rightfully respective owners, we left Whisk vowing to each other to NEVER return.", "pics": null}}, {"review": {"des": "My group and I stopped here before heading down to the Pride Parade on Sunday. Reviews looked good, so I thought we'd give it a try! <br><br>We were seated immediately and their outdoor patio is really cute! Their menu looked awesome, too! We did have to take a picture of the kids' menu because it was only written on a chalkboard inside the restaurant which is kind of weird...but whatever. <br><br>We finally decide what to order and our server puts our order in. The three adults food comes out and the child's food does not. We were told it will be right up...but it wasn't. I asked our server again where his food was and she told me that they had to wait for the waffle iron to heat up because they don't have it on all the time. <br><br>WHAT?! You are a brunch spot, it's a Sunday morning, and you don't have your waffle iron on and ready to go?! <br><br>The waffles finally come out (mind you all of the adults had finished their meals by this point) and they are BARELY cooked. Soft and mushy to say the least. <br><br>Our server did take the waffles off of our bill without us having to ask which was very nice. <br><br>I just don't understand how, as a breakfast/brunch location, you aren't just prepared for any order that could come in. Especially if it's ON YOUR MENU.", "pics": null}}, {"review": {"des": "Sweet savory brunch goodness with Nick Offerman's face plastered everywhere!... In a good way. This place is awesome for large groups since it has large booths and tables. My friend and I came on a weekday when it wasn't too busy and we occupied a booth that could've been for 8 people. <br><br>I got the brisket hash which was absolutely scrumptious... Brisket was perfectly cooked with savory juices and other fillings... The butter and jam toast on the side was addictive. Topped it off with cheesy grids.. Not too shabby; could be more\" cheddary\"<br>Also had a very refreshing mint peach ice tea. Highly recommend! I was only able to finish 3/4 of the whole plate.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ol3lNPjNmkCqrNGBvybIuA/348s.jpg", "caption": "Bottom: brisket hash"}]}}, {"review": {"des": "A Ron Swanson themed brunch/breakfast spot sounds amazing. And the decor is amazing because it is just that. There is a Ron Swanson in the title logo on the front window to welcome you, a Ron Swanson made out of wood in that same window, framed pictures of Ron Swanson including bacon all throughout the interior, and the list goes on and on. All of that combined with being integrated here on Yelp with getting on a waitlist before you actually get there, are all high points for this spot. <br><br>But, the food itself was just so so for me. There was a mac and cheese with bbq pork on top of it that was a special we started with (only after to learn that by 11am the other special of mozzarella sticks was already sold out somehow!), was pretty darn tasty. But my chilaquiles were just pretty bland. The chips just kind of laid there, the salsa and such didn't have enough flavor, so ya...I was all pumped by the Ron Swanson decor, but my main dish let me down. They also have some trouble with time management here too it was clear, and for such a small interior space, I really couldn't figure out who to get coffee from, why other tables that were seated after us got food first, etc. But what is clear, is they love Ron Swanson and they are REALLY popular for things like GrubHub since there were more bicycle pick ups than people being seated here!", "pics": null}}, {"review": {"des": "YES!!!! Couldn't resist stopping by because I had heard it was a Ron Swanson inspired restaurant! The windows in the waiting area outside are filled with Ron Swanson art. The decor made the ambiance so much more friendly. All of the workers there were also super friendly which made this place easy to like.<br><br>I ordered the Steak Hash, and my friends got the Southern Style Chicken Sandwich and the House Salad. It was agreed that mine was the best! The Steak Hash was steak and potatoes with cheese, avocado, and salsa, all topped with two eggs! While each of these things were amazing on their own, when you put them all together, the combination was unreal and was such a great mesh of flavor. The steak was tender to blend perfectly with the potatoes and the toast gave it a nice change of texture. I would definitely want to come back to try other things on the menu, but I don't know that I would be able to because of how impressed I was with the Steak Hash! From both of my friends, they enjoyed their dishes but would want to try something next time.  All dishes were a nice and hearty size, even the salad!<br><br>One last note that I would make is that it IS a little loud inside, or maybe it was just the people that were there that day. My friends and I definitely had to talk louder than usual, and louder than we had expected.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mcZXeNY5C95NK7rCkp0E6Q/348s.jpg", "caption": "House Salad (Chicken)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_v-YfshdnLMsWSU__Y08HA/168s.jpg", "caption": "Steak Hash"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/t1I4gkWm199TOdMMMRQGJg/168s.jpg", "caption": "Southern Style Chicken Sandwich"}]}}, {"review": {"des": "I walked up today and two people who looked to be 10 and 13 years old (young male and young female respectively) were taking down reservations (playing hostess) and another short lady.  After having a long and umcomfortable conversation with the youngest looking (male) one we were told the wait would be 15 minutes and to put our name and phone number down. We did and went across the street to Marianos. When we got back, we were asked to put our names down again by the young male and young female. At that point I asked them to get an adult. They got the woman who they referred to as their mother and another young man that looked to be about 20 years old with large physique came out as well (now there were three young looking hostesses 2 male and 1 female) and a woman. I asked the woman what happened to our table she said that our table was given away and that the person who replaced her (for her break) didn't know and sat someone else. I said what was the purpose of the list and taking our number if you were going to give our table away. Why wouldn't her replacement know how to operate the hostess table?<br><br>The male then said if he could he would have the people get up so that I could be seated. I said what you could have done was not seat someone in the first place when you took down my name and number instead of \"wishing\" you could improve the situation. The situation should have never happened. <br><br>I asked for the manager. The woman who was hostessing (and overseeing the other 3) said she was the manager. If she was indeed the manager, I would suggest training your replacement to operate the hostess position correctly. <br><br>Is this how a restaurant is being run and is this acceptable customer service?<br><br>Last, another couple walked up to put their names down and the hostess asked if we were together. I guess we may have looked alike or something. Just disappointing. I've been here multiple times and had never had an experience like this before. I wonder if they are under new ownership because my service was down right horrible from start to finish. <br><br>We sat down still trying to make the most of our time only to be given dirty drinking glasses. At that point we decided to cut out losses (our precious time) and go somewhere else.<br><br>I guess I won't be going back anytime soon.<br><br>*please note that I've edited my review after being threatened with a lawsuit for defamation by the owner. He demanded that I change my review or that he would get his attorneys. <br><br>I am not going to change the fact that there was a young boy who looked to be 10 years of age outside (there is another reviewer that said the same thing) that said he wasn't receiving payment for his work by the restaurant but that his mom (the manager) gave him money to help out. That is the truth and defamation is actually defaming when you have stated something that you know to be lies in an effort to cause harm to another person.", "pics": null}}, {"review": {"des": "As a huge Parks & Rec fan, the Ron Swanson regalia was way too much. The man would have never stood for so much fan fare. <br>Other than that, the food was out of this world. The Michigan hot sauce at the table was an interesting delight. We had the vegetarian burger and the turkey burger and ranch fries because we were trying to eat \"lightly.\" I can't wait to come back and eat cow meat.", "pics": null}}, {"review": {"des": "I really wanted to love this restaurant but I can't after my experience here.<br><br>We got there on a Saturday morning around 10:30 and got seated right away in the back patio.<br><br>Beware of their $3.50coffee... it tasted burnt and they hardly come by to refill it!<br><br>We ordered a breakfast burrito (the Ron Swanson all meat one), pancakes and chicken sausages.<br><br>We waited more than 20minutes for the pancakes and chicken sausages. We had to request for utensils.<br>Then we waited another 15minutes for the burrito! We asked for more salsa and the server brought out two servings (which we got charged for without knowing until the bill came out).<br><br>I don't know if everyone working was just too tired after their early morning rush but their service was disappointing.", "pics": null}}, {"review": {"des": "Ron Swanson homage! I mean could it get better? Yes, it can the food was amazing! Chicken and Corn Cakes were definitely some of the best I've had!", "pics": null}}, {"review": {"des": "The food was good, the vibe was good. I was attracted to this place because of the Ron Swanson menu items and the Ron Swanson themed wall. It did not disappoint. And hey, I didn't get attacked by any bears either so that's a plus.", "pics": null}}, {"review": {"des": "I think I might have died and gone to heaven. Brunch doesn't get much better than Whisk! <br><br>We were quoted a 70 minute wait, but the good thing is they use an app that shows you your spot in line. 20 minutes later we were ready to be seated; funky time management, but I'll take it! <br><br>First and foremost, Ron Swanson is staring at you from all angles... swoon. I love that man. <br><br>Pumpkin cinnamon roll pancakes- SUPERB. Don't leave here without them. Two gigantic pancakes smothered in white chocolate sauce, chopped pecans and cinnamon. <br><br>Biscuits and gravy- DELICIOUS. Thick biscuits that soaked in all of that creamy sausage gravy topped with two eggs and served with a side of potatoes. <br><br>It's BYOB so bring some bubbly and make a mimosa, obviously! <br><br>We personally sat at a communal table that seats 10, but I didn't think it was weird. Everyone seemed super comfortable focusing on their own party, and actually some people even chatted and commented on each other's food, too! It was fun!<br><br>Whisk is now on my list of favorite brunch places for sure.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vCyWmGcK44ixFTgahAOf8g/168s.jpg", "caption": "Pumpkin Cinnamon Roll Pancakes."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ocz6Fxu5Uk5bBOqn23Zzbg/168s.jpg", "caption": "The main Ron Swanson wall."}]}}, {"review": {"des": "I've been wanting to try Whisk for a while but on weekends the wait is absurdly long. After going for breakfast this morning, I now know why - the seating area inside is pretty small. That being said, I really like the ambiance.<br><br>The menu had tons of options I wanted to try. I ended up going with the Ukrainian Scramble and my boyfriend got the Croissant Sandwich. Both were delicious, my only complaint was that the bacon was a bit overcooked. <br><br>Prices were a bit on the high side, but I would still go back since the food and service were both good. I'd be that much more likely to go if they were on the nowait app or took reservations on weekends.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Q2dM-e2jNXhoyreYa-TIiQ/168s.jpg", "caption": "Croissant Sandwich Brunch"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1w0Qbdq_BruUEZS8Xh3-dg/168s.jpg", "caption": "Ukrainian Scramble Brunch"}]}}, {"review": {"des": "This is my new favorite place for breakfast/brunch. A friend suggested we check it out on a Sunday a few weeks ago and it was a great suggestion! The wait on that Sunday morning for us was about 45 minutes, which is not bad at all for a place like this. We sat at the bar and everyone working was very friendly and kept engaging in conversation with us which was nice. The food was great! My wife and I both got Benedict's and my friend got shrimp and grits. We were all very happy with our choices. We also split the BBQ chicken Mac and cheese as a dessert of sorts. We basically just wanted to try as much food as we could, and it was a delicious decision. My wife and I have gone back since and tried different meals and they have all been very good and different from your average breakfast diner. The wait was a lot shorter, if at all, on a weekday which was great. I highly recommend checking Whisk out at least once, you won't be sorry. <br><br>Oh, and they love Ron Swanson. But who doesn't?!", "pics": null}}, {"review": {"des": "I came here yesterday for a birthday brunch. There was a bit of a wait but once we got seated it was fast service. I tried the biscuits and gravy. It was so good I ate every bite! This place is BYOB. I will be back to try some other menu items.", "pics": null}}, {"review": {"des": "Going with the David's Special is always a great choice! Service was sketchy today but the food is always good!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/P6oV_sOu5x4L0CNfwMxCJg/348s.jpg", "caption": "David s Special Brunch Oreo Raspberry Pancakes Brunch and Veggie Croissant Brunch"}]}}, {"review": {"des": "After the first place didn't work out, I'm glad that I finally got around to coming here. <br><br>First off, the entrance has artwork of Ron Swanson and all the waiters' shirts say #RonSwanson in the back. For all the Parks and Rec fans, you'll love it! <br><br>The hostess said it would take about 30 mins for indoor/outdoor seating but it took 5 mins to be seated outdoors. They have a cute patio with murals and tables. <br><br>My cousin has been here before and had the David's Special (shrimp and grits). She really hyped it up so I knew I had to try it. We shared that and the Oreo raspberry pancakes to have sweet and savory. One word... WOW. Another word... AMAZING. The cheesy grits and the garlic shrimp were really good. The grits were better than some of the ones I tried in South Carolina. The pancakes were also good. They weren't too dough-y and the chocolate syrup + raspberry mascarpone + Oreo crumbles combo was yummy. I will be back!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BSUcR3csAwgowLtS3MxTnA/168s.jpg", "caption": "David's Special and Oreo Raspberry Pancakes"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_l_2Y6CWxEvJYPO-aEqcKQ/168s.jpg", "caption": "Country feel"}]}}, {"review": {"des": "Excellent. \"I'd wish the owners the best of luck but I believe luck is a concept created by the weak to explain their failures.\"", "pics": null}}, {"review": {"des": "All the food here is so great no doubt, I'm a huge fan of this place. The wings are also top notch! The booths are really comfortable. The interior is really well decorated and is a super cozy atmosphere. If I can only say anything negative about this place would be that they close at 4pm now! Wish they would be open later lol", "pics": null}}, {"review": {"des": "The only thing I'd change about this place is I wish it were bigger! Whether you want savory Mexican breakfast options or super sweet goodies like Reese's pancakes, this place delivers. Best part (besides the Ron Swanson decor, which is hilarious) is that it's BYOB!!<br><br>Forewarning: they don't allow mixers! We were asked not to open out blood mary mix :(", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Iewo17JcYcRATVnO0Gic-A/348s.jpg", "caption": "Reese's pancake--worth every calorie!"}]}}, {"review": {"des": "I'm not sure why it took so long for me to come to Whisk.  Brian V. checks in here every day so it's on my radar :-)<br><br>A friend and I had lunch here last Saturday and if I'm honest, this 4 star review maybe a little generous.  We got here at 1:15pm hoping that the line would have calmed down.  Not so much.  A 90 minute wait.  We grabbed some pastries at West Town Bakery so it was fine.<br><br>My friend had the chilaquiles which the waiter recommended and they were good, different from how I've seen them done before.  I had a very gingery soft drink with a memorable name, and I had chef Rick's Benedict (Two biscuit halves topped with fried chicken breast, gravy, and sunny side up eggs, served with house potatoes).  Both were good, and I'll be back to try the burger.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mcwQYB_OF_eAXR78pWxh5g/348s.jpg", "caption": "Chilaquiles"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/l8gzNeGY2HPCKNnEdhJlMw/168s.jpg", "caption": "Chef Rick's Benedict"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9xB4PWNIZol2B0RYzSYkow/168s.jpg", "caption": "Cock n bull ginger soft drink"}]}}, {"review": {"des": "The guy at the host stand ignored me to go on Snapchat and once he rudely Acknowledged me, he told me to go walk around to the back to find my party, who wasn't there.  I'm not against an hour wait if the food and staff are awesome. I did not stay.  (They also had a little kid, maybe 9? doing the seating. Kind of odd??)<br><br>Edit: had the guy rudely (and incorrectly) write to me after this post about carrying a $10 bottle of champagne in and thinking I'm entitled- don't know what he's talking about.... I didn't have anything to drink and was carrying a scrabble board that was a gift for a friend. So maybe you shouldn't insult everyone and jump to conclusions?", "pics": null}}, {"review": {"des": "AKA \"The House of Ron Swanson\"<br><br>We walked to Whisk on a cool morning.  It was about a mile from our AirBnB, but the walk was nice through a residential neighborhood of old and new brownstones.  Arriving at Whisk, there was nary a crowd.  It helped that this was late Friday morning, I suppose.  My party of five was   quickly seated at a long and tall table.  Water and coffee came shortly as we perused the menu.  On the weekends, starting on Friday, they serve a selection of Eggs Benedict.  The wife loves Benedict and ordered one.  Older daughter had one too.  Younger daughter opted for a Croissant with Fried Egg kinda sandwich.  Daughters BF and I both went with the Brisket Hash.  I had mine with Eggs over-medium.<br><br>Waiting for our breakfast, we quickly noticed that Whisk is itself an homage to Ron Swanson, with folk-art oils, watercolors, Acrylics, pottery, knitted heads, photographs and quotes from the character that plays on Parks and Rec.  I could swear that they played different versions of the theme song on the audio.  I hope not though, as hearing that repeatedly would drive me to drink.  <br><br>Speaking of drink, the kids had mimosa's and the wife and I went with coffee.  Our entrees were delivered shortly.  My eggs were cooked perfectly and the hash was a fresh combination of tender brisket, yellow red and green peppers and the typical cubed potatoes.  I cleaned that plate quickly with the Marble Rye bread that was on the side.<br><br>Prices were reasonable, the place is quirky-cool and yes, I would go back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PuYZHJkVGrBuCl1Spd-3cA/348s.jpg", "caption": "Me = Ron"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-BbbfuJ-Fn3_dZAri1qK8w/168s.jpg", "caption": "Brisket hash II"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bJVRsznoURaCWH7sQ8RvZw/168s.jpg", "caption": "Brisket hash"}]}}, {"review": {"des": "Went to WHISK for a birthday brunch that a friend had suggested and in three words, IT WAS AMAZING. Coffee was on point. I ordered the buffalo chicken scramble, which was like nothing I have ever tried. So gooood. I also shared their banana and strawberry pancakes with some friends and man oh man...delicious. I need to go back already! <br><br>The best part was all the art work of Ron Swanson from Parks & Recreation. Good food, good service and fun art. I will be back soon. :)", "pics": null}}, {"review": {"des": "I was hoping we'd found an awesome little restaurant to remember the area by, but it was just fine as restaurants go. <br><br>We reviewed the menu and it looked intriguing. We particularly thought the Benedict choices looked worth exploring. After we were seated and looked more closely at the menu, we discovered that they were not serving Benedicts as it was Thursday and not the weekend. (They only serve them on the weekends).<br><br>May I make a suggestion? Don't put the Benedict selections on the main menu. Just make a special little card for the weekend crowd that advertises them. Maybe it's a marketing ploy to get us in the door, but it ends up making one feel trapped or bamboozled. Just sayin'.<br><br>I had the something like poutine, but without any gravy. It had blue cheese, bacon, and tots. The curds were completely melted. That was disappointing as part of the fun of eating curds is finding that little pillow of soft, warm cheese amidst the tots and bacon. It was an appetizer to be shared with others, which I did share, but I couldn't eat it all. It was fine, but I realized I didn't make a great lunch choice. I think I should have had a salad.<br><br>The drinks were served in plastic cups. We aren't outside where we might break the glassware. We're inside. And it feels cheap to drink from them, like the restaurant is a start up. And then, it's just bad for the environment. Invest in glasses and serve my soda in a glass, please.<br><br>My daughter had waffles and she loved them and ate every bite off her plate.<br><br>My husband had the Dirty Dog and LOVED it. He didn't \"get the chips on there,\" but he loved the chili and the rest.<br><br>In conclusion, I think I ordered poorly. Maybe I would need to give this another go if I were in Chicago again. But then there are so many restaurants to try in Chicago, it'd have to work out just right. Hence, three stars because my family enjoyed their meals, the place is clean, the bathrooms are clean, the service is friendly, and the decor is fun.", "pics": null}}, {"review": {"des": "I can't comment on how tasty the food is, because it was unclean and unsafe to eat.  The Mexican Scramble (which took them an hour and a half to make) came with a hair and brown, rotten avocado.  Restaurant was combative about refunding the order.  Disgusting and unpleasant experience overall.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PTGtL_yIaHQRkHowpBRqzg/348s.jpg", "caption": "Mexican Scramble.  Comes with a side of brown, rotten avocado and a piece of hair.  Yum."}]}}, {"review": {"des": "A nice Uki village spot to get a BYOB brunch. They have a back patio and one of the owners comes around to talk to every table. I had a crab cake benedict  which was good.", "pics": null}}, {"review": {"des": "Everything we had was really tasty and parking on Chicago was surprisingly easy - note that it's now CASH ONLY!", "pics": null}}, {"review": {"des": "I was really looking forward to this place and left a little disappointed. The flavor of the food was just...lacking, in my opinion. They have a lot of cool things on their menu so I may be back to try something else.<br><br>I got a to go order for the pumpkin cinnamon roll pancakes and David's special (basically shrimp and grits). The wait was 45 minutes so make sure you account for that if you get carryout as well. The pancakes weren't bad, just maybe not what I was expecting from the pictures. I was thinking they would be sweet and gooey dessert pancakes like Bongo Room or Wildberry but they aren't at all. I got very little icing on top of mine and what I did get wasn't very sweet. I wasn't wanting syrup by the end (which wasn't in the bag, I wish I remembered to ask for some).<br><br>The shrimp and grits were actually just bland and very fishy tasting. I'm from the South so I've had a lot of good shrimp and grits (if you're ever in Savannah, check out the Old Pink House!) and this wasn't it. It really needed some more salt, seasoning, flavor.<br><br>I was waffling between two and three stars and what pushed this to three stars was the current Groupon deal going on. You can get 30% cash back by simply claiming the deal on Groupon - you don't have to pay for anything. That made the prices for the entrees around $10 each which is very good. <br><br>Overall - I would say, check it out and decide for yourself. I saw a lot of people recommending the dishes I got on the Yelp page and was very disappointed but you may like them! I would definitely suggest claiming the Groupon deal to save some money as well.", "pics": null}}, {"review": {"des": "WHISK has pretty good food. They have an interesting and extensive menu. One thing that definitely separates this restaurant from any other is that there are many illustrations of Ron Swanson all over the inside part of it. I'm not kidding. You have to see it to believe it.", "pics": null}}, {"review": {"des": "This place was good but didn't blow my socks off. Maybe I set my expectations too high or the theme and hype set my expectations too high. I guess what I'm saying is it wasn't anything special but had a great patio. <br><br>BYOB so pick of champagne across the street at the Ukrainian Market to mix into the fresh OJ you can order. <br><br>Our party of 4 was seated immediately on the patio which is saying something at 9:30 on a Sunday. We didn't have a reservation and I'm not sure they take them anyways. We were at a community table which was fine, I was happy not to be at the 2 sweaters as they looked on the really little side. <br><br>We had the crabs Benedict, the hipster (eggs & veggies dish) and the Nutella croissant French toast. I would order the crab Benedict again (light sauce) for its spicy sauce that was good but again just not great. The French toast was meh. Just meh. The Hipster was plain.<br><br>PROS: seated fast, nice patio <br>CONS: over hyped", "pics": null}}, {"review": {"des": "Whisk is a very cute brunch place in the up and coming neighborhood of West Town/Ukrainian Village. We came here on a Monday morning for breakfast, so the service was, of course, excellent (we were the only ones in the restaurant). I wish I would have known about their outdoor patio before eating here, because I would have preferred that over sitting inside. The decor is hipster and funky (Rob Swanson is EVERYWHERE), but it has charm amongst the silliness. <br><br>The food was super good. I ordered the Veggie Croissant Sandwich while my friend ordered the regular Breakfast Croissant Sandwich. These were HUGE breakfast sandwiches and very tasty. The prices are good for how much food you get. I'm looking forward to returning!", "pics": null}}, {"review": {"des": "FLAVOR BLAST. Had the lobster Benedict and it truly was amazing- a dash of spice without over powering the lobster and holly hell the biscuits. The service was slower but the food was FRESH. We brought champagne (bc BYOB) and the juice they supply is v FRESH x 9. My roommate frequently gets delivery brunch from here every Sunday and is a repeating customer, but after eating in person, I am throughly impressed.", "pics": null}}, {"review": {"des": "Went to Whisk with my brunch group and I wish I had two stomachs so I didn't have to limit how much I could order. We went as the lunch menu was available too so, double the difficult choices.<br><br>First, there are no reservations, and brunch starts at 7am. We went around 10:30am on a Sunday and it was....packed. I was surprised people went that early. We had about a 30-50 minute wait, but we also were a group of five (plus baby) so, we needed more space.<br><br>I got the brisket hash (one of the house favorites) and it was very good. I was having a \"screw portion control day\" though and wanted more. The potatoes were nicely cooked and crispy and with the two poached eggs, it made for a nice dish. The sourdough was overtoasted and not really noteworthy, so I'll try something else next time. The jam that came with it though was good.<br><br>Friends got the piggy benedict (which looked good), garden omelette and a few other items. Everyone liked what they had too. They also had a difficult time selecting what they wanted because the burgers looked great too. <br><br>Next time, I'll be going back for one of those. <br><br>The decor on this place too is incredible. It is truly an ode to Nick Offerman and his character Ron Swanson. Which, if you watched Parks and Rec, is your own private heaven. <br><br>Until next time Whisk.", "pics": null}}, {"review": {"des": "First time back at Whisk in over a year and this place is still every bit as good! My two friends and I arrived at 9:30 am on Sunday to avoid the long wait we had last time. We were able to snag counter seats right away (clutch). FYI, if you show up much past 10 you will wait for quite some time.<br><br>One of my friends and I split the Snickers French toast and the Brisket Hash while my other friend got the Oreo raspberry pancakes. SO, SO, SO GOOD! French toast was deliciously sweet without being overbearing. The brisket was incredibly tender and just falls apart in your mouth.<br><br>Absolutely love this place. Whisk is firmly in my Top 5 brunch spots in all of Chicago. Now I just need to come back for their burgers!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BKbQBbftbn0PPNoKNtwXqA/168s.jpg", "caption": "Snickers French toast...still drooling about it"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9TdXm53wiWCxrkxKhClsPw/168s.jpg", "caption": "Oreo raspberry pancakes"}]}}, {"review": {"des": "Maybe my favorite brunch spot in Chicago.<br><br>I discovered Co-op sauce here, which has become a personal love story. I also discovered that a Buffalo Chicken Hash is acceptable breakfast food. <br><br>My life has been significantly enriched. Thanks, Whisk, and Swanson!", "pics": null}}, {"review": {"des": "It's no wonder their Pumpkin Cinnamon Roll Pancakes are a house favorite. They are delicious. If I get pancakes I normally can't finish them all but I licked this plate completely clean. They get pretty packed for brunch, so get ready for a wait if it's after 10:30am.<br><br>The strange obsession with Ron Swanson cracks me up. I loved Parks & Rec and also Nick Offerman, so I can appreciate all the random decor and trinkets.<br><br>Definitely adding this place to the brunch rotation!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xF-Mspby_t0de6P3-hm4rw/168s.jpg", "caption": "Meeeee too."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ptmN841xnMRjDdaRZal4lA/168s.jpg", "caption": "Pumpkin Cinnamon Roll Pancakes"}]}}, {"review": {"des": "Take a country loving​, bacon and egg eating, mustach having, wood master and add a  very eclectic menu and what do you have; WHISK. I like homage to Nick Offerman's character Ron Swanson. The place is rustic in appearance and the crew there is cool as hell. Our server Daniel took real good care of us and made the kids feel like this was a fun place. So on to the food...<br><br>The menu is pretty decent in size and the food had a combination of Mexican/American dining. I had the pulled pork hash, which was delicious. It comes with 2 eggs and a real nice and balancing hollandaise sauce. My wife had the Chorizo omelette that was so stuffed with goodness that I wanted to trade with her just out of principle. We also had the Snicker's French toast that; as the name implies had melted Snickers in it... The wait time is a bit long due to the location a size, but it's well worth the wait.", "pics": null}}, {"review": {"des": "Great brunch spot in west town! I love parks and rec so finding a restaurant that has a bunch of Ron Swanson art and quotes was a win! The food was amazing! There's a wide variety of menu options which leaves you wanting to try everything. We got the poblano omelette, veggie burger, and the caramel apple French toast. The omelette featured a pepper jack cheese sauce which was <a href=\"/redir?url=http%3A%2F%2Fbomb.com&s=bb4f996415a9c2f21137e27cfb68f439a48cec2652b53e9b50dd7e766dbe177e\" target=\"_blank\" rel=\"nofollow\">bomb.com</a>! The veggie burger was house made and really good. We also asked for the garlic aioli on the burger which added a nice kick. Finally, the caramel apple French toast was heavenly. Perfect way to end our brunch with the sweet, melt in your mouth goodness! <br><br>The service was great here too! I also liked how we could add ourselves to the waitlist via the yelp app so we didn't have to wait there and venture off until our table was ready. Will definitely come back here.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/trgwbwaORYMr2AoLiWqpIw/348s.jpg", "caption": "Caramel Apple French Toast Brunch"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/npEfHxC4I5weXZuj_ceoOw/168s.jpg", "caption": "Poblano Omelette Brunch"}]}}, {"review": {"des": "Yummy yummy yummy, get in my tummy. So much flavor, food was served hot and ready, just how I like it. It's  BYOB and Mariano's is right across the street, you can literally skip there lol. I mean what more can you ask for? And yes they even split the checks for you. I will definitely be back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6SXike5CiuNgQUl4acObEg/348s.jpg", "caption": "\"Chilaquiles\" soooo damn good. Flavor Flavor Flavor! With no avocado."}]}}, {"review": {"des": "Holy Ron Swanson! This restaurant is a must for all parks and recs fans out there. Really funny decor and quotes. The sweets menu is decadent! All kinds of delicious, chocolatey, gluttonous goodness, which I doubt Ron would approve of since he's more about the bacon and eggs, but whatevs. It was amazing. The pumpkin cinnamon roll pancakes were drenched in caramel, nuts, and white chocolate sauce. The BBQ pork Benedict was just ok in my opinion. The egg was overcooked and the pulled pork was nothing too special.   That's why it was docked a star, otherwise, the sweets and ambiance really set this place apart.  Seating is fairly limited, so best to avoid the rush times (was full around noon on Friday).", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/I3OywnEt_NhWKRkkDEn-iA/348s.jpg", "caption": "Signed by the man. Tis the Lord's work you do."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2A9wwsy0OAqTTJjd_q5XzA/168s.jpg", "caption": "Pumpkin cinnamon roll pancakes"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fIA6UlexmMDFdGVfQad9uQ/168s.jpg", "caption": "Bbq pulled pork benny"}]}}, {"review": {"des": "Yasss, a byob spot for brunch? I'm there. Met a friend for brunch at this cool spot filled with Ron Swanson art at the entrance. I'm sure this place gets packed on the weekends, but on a Wednesday morning, it was perfect! <br>Back to the byob, there's a grocery store right in front of this place with $6 champagne bottles. Have you put two and two together yet? <br>Food - Delicious! I had the steak hash and my friend had the veggie croissant. Out of this world! <br>Service - egg-cellent! ;)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/w4e8JaMuKjyeV-V__EOksA/168s.jpg", "caption": "Steak hash"}]}}]}