{"name": "wildberry-pancakes-and-cafe-chicago-4", "reviews": [{"review": {"des": "Today was our first time trying a Wildberry. It won't be our last. <br><br>The short of it: The food and service are excellent!<br><br>What we really liked:<br>- The wait list feature via Yelp is excellent<br>- We were seated in a booth - it was nice and roomy<br>- Our waiter (Guillermo) was pleasant and helpful<br>- Our Corned Beef Hash Skillet was excellent<br>- Our Cinnamon Roll Pancakes were amazing<br>- Coffee refills were swift<br><br>What could be improved:<br>- Small coffee pots / carafes at each table<br>- A more flavorful coffee<br>- Either first floor restrooms or a customer elevator to the 2nd floor<br><br>We'll come back to a Wildberry.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mSY30UrKiEqn308cEmmjfQ/348s.jpg", "caption": "Our check. Decent for a great breakfast for two."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/B73bJISMa_pWuE4RGygvlQ/168s.jpg", "caption": "One half of my Corned Beef Hash. Very good."}]}}, {"review": {"des": "When on vacation, one dines to their heart's content. Usually I prefer to eat savory less caloric meals, and, to be honest, usually I don't eat breakfast at all. But, when on vacation, one has to maximize food opportunities, so breakfast made its way back into my life.<br><br>I ordered the Cinnamon Roll Pancakes and my dining partner ordered the Berry Bliss Waffles. I also got a latte and they got a different sweeter beverage, I just don't remember which.<br><br>Anyways, omg. My cup raneth over. Those cinnamon roll pancakes were SO GOOD. Ugh. I wish pancakes weren't so dang delicious. Seriously mess with my health goals. But, I dug in and ate almost all of them (obviously have to leave some to imply I have restraint, obviously). The Berry Bliss Waffles were just as good. I wanted to eat all of the foods. I didn't. But I wanted to.<br><br>My latte was delicious as well. I was satisfied.<br><br>All in all, I'm glad this place is in Chicago and far away from me because I am not sure I could restrain myself if I was that close. <br><br>Mmm.", "pics": null}}, {"review": {"des": "Come here for breakfast if you want to wake up your taste buds the right way.<br><br>There's a reason this place is busy in the mornings, so make sure to get there early! There are lots of large breakfast items, and you really can't go wrong with anything. My omelette was huge, and was made an even more massive meal with a side of plain pancakes (which were delicious). The next day I tried the special Key Lime pancakes.... definitely get those! They are up on my top 5 pancakes I've ever eaten, they are so good!!! <br><br>Service was awesome and my delicious coffee was always filled way before I could even reach the bottom.<br><br>I highly recommend planning your Mornings in Chicago around this place!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XZU7FVOouhVmIOGdJYSO3g/348s.jpg", "caption": "Giant chilaquiles breakfast, with a side of seasonal pumpkin spice pancakes"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wxVYUaNyamyxiOtam6pLkQ/168s.jpg", "caption": "Veggie omelette is awesome and filling!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jfx0bkPXw1r3JVioDButOA/168s.jpg", "caption": "Quite possibly my most favorite pancakes: blackberry and key lime pie pancakes!"}]}}, {"review": {"des": "OH MAH GAWD how come no one in the review recommended their red velvet French toast???? Okay just look at it!! It is a cake roll sliced up and turned into French toast, it has cream cheese fillings inside and it is amazing. I was in tears when I took the first bite. The hash brown is also really good, the portion is impressive. My favorite part about them is they let u wait in the line virtually, but we still had to wait after we checked in at their reception for a while.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/NeW_RPnG90ZKsGaFDWA44w/348s.jpg", "caption": "Red velvet French toast and hash brown"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4VGanndo5Q_CETFvTptqAg/168s.jpg", "caption": "Coconut pancake"}]}}, {"review": {"des": "On numerous occasions I have visited highly reviewed restaurants with at least 4 stars, only to be disappointed that the place does not live up to the hype. However, Wildberry deserves the praise in my opinion. I used the waitlist feature on Yelp on a Saturday morning. About 38 parties were ahead of me, and it would take about 45 minutes. I found that to be quite accurate. I also checked the other (original) Wildberry location out of curiosity, and it notified me that over 100 parties were ahead of me. Yikes, no thanks, I'll stick to this newer location!<br><br>When I arrived, they were still setting up the table and I waited only about 7 minutes. The restaurant was packed but kudos to them because the service was still somehow attentive and sufficient.<br><br>I tried the following: <br>1. Garden Skillet - Bland and needed more salt, but decent otherwise.<br>2. Banana Coconut Cream pancake - Recommended by the server. They were fluffy and delicious, having just enough cream to balance the flavor.<br>3. Fresca Omelet - Nice golden color and very tasty. All of the items mixed into the omelet complimented it. I especially enjoyed the bites of avocado in the omelet.<br>4. Blueberry Danish Crepe - My favorite sweet breakfast item! Nice presentation, not too sweet, good texture from the crumbly bits, and surrounded with fresh blueberries.<br>5. Vegan Breakfast Hash (with corned beef instead of vegan patty): Possibly my favorite savory breakfast item. Loved the crispy bits of hash browns, good vegetable assortment, and this was seasoned well.<br>6. Cinnamon Roll pancake - Too sweet for my taste, but the pancakes were fluffy.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TJcRrbY6hr2SNCCvU8Oa3Q/348s.jpg", "caption": "Left: Banana Coconut Cream Pancake; Right: Garden Skillet with the eggs poached"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7RjZU0aYK3hnMrqycWVBHg/168s.jpg", "caption": "Left: Cinnamon Roll Pancake; Right: Vegan Breakfast Hash with Corned Beef instead of Vegan Patty"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9IDFvvuw1WMVadBc0AGB6Q/168s.jpg", "caption": "Left: Blueberry Danish Crepe; Right: Fresca Omelette (Olive Oil Infused Sun-Dried Tomatoes, Provolone, Fresh Basil & Avocado)"}]}}, {"review": {"des": "Went here on with my cousin and a friend for lunch, left very satisfied. The place is super big and was packed to the brim when we arrived, but we put our names in online about 30 min before and had no problem getting checked in and seated.<br><br>Between the three of us, we got the butchers block skillet (shredded hash browns, sausage, ham, bacon, eggs, topped with melted cheese), a burger, and the BLT. The butchers block was my favorite- the hash browns had a nice texture and weren't too soft or chewy, and the ratio of meats to cheese to potato was spot and every bite was just delicious. It came with a side of pancakes which were also spot on, fluffy and warm. Although I didn't try it, the burger looked good, really big but still juicy. The blt was also pretty tasty, my one complaint was the bacon could've been cooked a little less because the strips were a bit on the tougher side.<br><br>Overall, Wildberry does a great job with all sorts of classic breakfast/brunch stuff. The menu is pretty wide and covers omelette, hash brown skillets, Benedict's, French toast/pancakes/crepes/waffles, as well as lunch options like sandwiches and wraps. Definitely a crowd pleaser, and despite how packed it gets service was always fast. I would definitely take a friend or a bigger group here!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sVE4Yal-WuCdCfCmOnMWSQ/348s.jpg", "caption": "Burger and fries"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/x62Xm51UZmopwi_OItNymA/168s.jpg", "caption": "BLT with hearty serving of pretty thick bacon"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rHCBRbYu7gvXIuIp-X7i9w/168s.jpg", "caption": "Butchers block (hash browns, cheese, bacon, multiple types of sausage) - not the best looking photo but definitely the best dish we had!"}]}}, {"review": {"des": "I went here for brunch with co-workers after work! It was a nice big place, and even though it was a Sunday morning, they were able to seat us pretty quickly. Our hostess was very friendly and honest. She was direct with her recommendations and we really appreciated that. I had the sweet berry bliss waffle with a side of<br>corned beef hash. The waffle was big and fluffy, topped with sweet berries and mascarpone in the center. I thought it was delicious and had the perfect balance of sweet and savory! The corned beef hash side that I got was huge, definitely for sharing, and it was only $5. The service was quick and and our food was out in less than 15 minutes. I would definitely go back here again!", "pics": null}}, {"review": {"des": "First time today and I'll be back! The portions are large & good for the price. I went with a skillet and added the specialty pancakes for only $2. Worth it since that's what they are known for!! Luckily two of us did so I got to try the banana concut cream & wild berry. Line was long but join the Yelp wait list & you won't have to stick around :) Location is great to shop if you need to pass time.", "pics": null}}, {"review": {"des": "This is my second time at Wildberry! Never been to this location before but once again it was really good. I got the Mexicana skillet with the speciality pancakes (I tried the berry one). It was really good! You get a lot of food for your money. The wait at this location wasn't nearly as bad as the one near the bean. Regardless you can get in line at yelp so it's not bad as waiting there.  I wasn't able to finish my meal so it offered leftovers as well. Definitely would recommend going here!", "pics": null}}, {"review": {"des": "I've heard so many great things about Wildberry and never wanted to make the mission of going downtown & finding parking, but it was definitely well worth it.The entire staff was friendly, the space was big and full of light, and the food was ON POINT. I went with my friends and we all kinda tried each other's food and everything was amazing. <br><br>Huge plus was that they were serving Intelligentsia! <br><br>I love breakfast places so this is now one of the first places I recommend when people are asking for suggestions.", "pics": null}}, {"review": {"des": "AMAZING! New favorite breakfast spot in Chicago!!<br><br>Add yourself to the wait-list on Yelp - you will get a text when your table is ready and the wait on the weekend could be 30min-1hr+. The space is pretty large and it seems that tables turn pretty quickly. The servers are great and very attentive. <br><br>Wildberry has a massive menu and we were super overwhelmed with what to choose since everything looked so good!<br>We ended up getting:<br> <br> - Veggie omelette with egg whites, served with hash browns and pancakes. Upgraded to the berry pancake. <br>- Rustic farm egg panini, served with hash browns<br> - Barbacoa chilaquiles: essentially a skillet with meat, cheese, tortilla chips and 2 eggs your way<br><br>Everything was delightful and the portions were huge. The pancakes and waffles seem to be what they are known for. They also serve milkshakes and lunch items like salads, sandwiches, etc. Just note that they don't serve any alcohol. <br><br>Can't wait to come back and try something different!!", "pics": null}}, {"review": {"des": "Second time in a Wildberry, which has expanded into a chain since I was last here. The wait can be long, but the waitlist function works well and service is fast, efficient, and polite once you're seated. Food remains great: big selection of pancakes, waffles, crepes, French toast, and Benedicts, as well as some more lunch-type options. We had the berry bliss French toast and the Rocky Mountain crepe, which was basically Denver omelette filling in a crepe. All good. Totally worth the crowd, and again, remarkably good service for such a busy restaurant. Looking forward to coming back.", "pics": null}}, {"review": {"des": "I'm pleasantly surprised that Wildberry has such a large space. The brunch restaurants I'm used to are usually small and cramped. They  have a large amount of menu items also. There were four of us, and we ordered several dishes to share. We had the Barbacoa chilaquiles, eggs Benedict with a side of hash browns, chicken and waffles with a side of bacon on top, cinnamon roll pancakes, berry bliss pancakes, and a choose your own signature omelet that we stuffed with about six ingredients and a side of hash browns. Such large portions. Oh yeah! Not only was it a lot of food; it was a lot of good food. Very good food. The customer service and the food make this a go-to restaurant.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YYIUPtoH6_pCgRufNk6ZuQ/348s.jpg", "caption": "Chicken and waffles with bacon on top"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lph-u2Fg6gkKLob3MV1NTA/168s.jpg", "caption": "Wildberry"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SjMPjSRF_UvCTTvdSMkDnQ/168s.jpg", "caption": "Barbacoa chilaquiles and Berry bliss pancakes"}]}}, {"review": {"des": "Killer place near our hotel. I had a different location bookmarked for a couple of years and I was thrilled this location was a block away from us. <br><br>Eggseptional service and a great menu sure to please the pickiest eaters. Breakfast #1 was berry bliss pancakes, poached eggs, chicken sausage and fresh fruit. Breakfast #2 was banana almond oatmeal and corned beef hash. Both meals were perfectly prepared with great ingredients. My coworkers loved the place, too.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/d8R6QN49r9LSKjwQ0XwGeg/348s.jpg", "caption": "Berry bliss pancakes, chicken sausage, poached eggs and fruit."}]}}, {"review": {"des": "This place really surprised me. There's always a wait for brunch but they have this cool service if you check in on the waitlist on yelp you'll automatically be added to the que before you even arrive. We did this and our wait was only about 5 min. once we got to the restaurant. While everyone else waited a hour. Kudos to them for approaching tech and yelp.<br><br>It's in a convenient location off michigan ave. Very high ceilings and great atmosphere. The service was spot on and explained everything. Our water and coffee was always filled. The menu provides for any kinda needs whether you want eggs, pancakes, waffles, etc. The portions are huge that we had enough for another meal to take home. My go to here were the buttermilk pancakes and apple cinnamon pancakes. Their veggie omlette was also flavorful and spot on. Nice atmosphere and great food.", "pics": null}}, {"review": {"des": "Came here on a busy Saturday morning for brunch and we were pleasantly surprised with everything we got. This place was BUZZZZZING on a Saturday morning but the staff honestly has it down to a system that works really well for them. Everyone was super friendly, super accommodating and very on top of things. They are getting people in, getting them fed, and getting them out. (Read: they will give your table away in as little as 3 minutes if your whole party isn't there, trust me it almost happened to us, they will bring the check before you're done eating, they will run it while you finish your beverage and will have the table clear before you stand up) it's not awesome to feel rushed but I respect the system and wasn't there to lallygag that day anyway. <br><br>I ordered the chilaquiles skillet with the pancake upgrade as  cinnamon roll pancakes. I also got a passion fruit lemonade that cake with free refills! <br><br>The skillet was DELICIOUS my favorite was the salsa. Spicy but not too crazy and just overall super flavorful. Fresh avocado and the eggs cooked perfectly and a large portion of barbacoa. I was really impressed and would go back just for that. The cinnamon roll pancakes were perfection. Light and fluffy and tasted just like a cinnamon roll. After a morning yoga session and a bit of shopping while we waited for 47 parties ahead of us to get seated Wildberry delivered. <br><br>Overall,  tasty food that's worth the wait that you'll gobble so quickly you won't even notice they're trying to rush you out.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JkaeQFHICRfhZpC_o1PlRQ/168s.jpg", "caption": "The spread!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KzwQpvSU7BCyQ9ht4pQebg/168s.jpg", "caption": "Chilaquiles skillet and cinnamon roll pancakes"}]}}, {"review": {"des": "Had been wanting to try this place for so long but were always put off by the wait. After a recent 5k we decided to bite the bullet. The Pearson st location is linked up with the no wait app so you can put your name down in advance if you're less than 5 ppl. <br><br>We got the Mexicana skillet and signature berry bliss pancakes -- do not miss those! I don't know what cream was on it but it was SO tasty. Food was good, coffee was good, place was busy so it took a while to get our waiter's attention for refills. <br><br>Hope to get back there to try more of the menu.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eKtLQaVKnmP_eOC-Wja5Yg/168s.jpg", "caption": "Signature berry bliss pancakes"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6UQ_zkA3ks-dZLK-r3fc0Q/168s.jpg", "caption": "Mexicana skillet"}]}}, {"review": {"des": "This place was recommended to me and boyfriend to try while we were in Chicago and I am so glad we did. It was unbelievable. There's two locations and we went to the newer one where the wait was way shorter. The food was amazing. I got the oreo smore's pancakes and they were soft and fluffy with oreos, chocolate and marshmallows. If you have a sweet tooth then you'll love these. My boyfriend got some kind of breakfast burritto and said it was delicious. The portions are huge and we wound up bringing leftovers home to eat later. You definitely get a good amount of food for your money and the employees are all very nice and attentive. The inside is pretty with big windows and lots of natural sunlight. Definitely a must-try!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/j-8SP9ZtgYqXBxl6U7gpnw/348s.jpg", "caption": "Oreo s'mores pancakes"}]}}, {"review": {"des": "Absolutely loved our meal here! You can easily do breakfast or lunch here, depending on your mood.<br><br>Service was great, the space was huge, and the line was reasonable! Thanks to yelp for allowing me to check in and cut the line via the waitlist option.<br><br>They have an extremely varied menu, with typical eggs and meat options, as well as pancakes (so many kinds), waffles, and most delicious, skillet meals that come on a bed of hashbrowns and all sorts of goodies in there to your choosing. I had the Mexican skillet and highly recommend. <br><br>Very kid friendly--a wall of strollers greeted us when we came in.", "pics": null}}, {"review": {"des": "We went here two mornings in a row it was awesome. I mean how good can breakfast be?<br>It was so good that if this could be my last meal on earth I would be okay with that. <br><br>Pricing is a bargain, the place is spotless and the servers we had Guillermo the 1st morning and Jenna the 2nd day. Thank you both.", "pics": null}}, {"review": {"des": "I went to Wildberry Pancakes this past Sunday and the wait time was insane! Thankfully you can be added to the waitlist through Yelp and it gave you a pretty good idea when you should \"check in\" at the restaurant. I took a train from Indiana and had to wait until I was 10 miles away from the restaurant to be added to the waitlist, but was totally okay with that since the wait was over 1.5 hours! <br><br>The food was delicious! I ordered the signature berry bliss pancakes and my bf had the Mexicana Skillet. A regular order of pancakes comes with five pancakes and a short stack comes with two. Two was enough for me! The service was quick once we sat down but I didn't feel rushed. If you have time to wait, definitely go!! The pancakes are fluffy and delicious!", "pics": null}}, {"review": {"des": "So the place is totally conveniently located for tourists, and totally beautifully decorated for those searching for the perfect \"brunch\" vibe. It's also the perfectly priced for the location - not too cheap, not too expensive, and well portioned (around $13 for a dish)<br><br>Everything was good - the server was attentive and prompt. Brought us the hot sauce before we asked (I'm wondering whether all Asians ask for hot sauce... LOL... I noticed there were other tables without hot sauce on their tables. I never had hot sauce delivered before the food and before we asked. I really think they just knew we would ask) <br><br>It's also busy - we got seated right away when we arrived a little after 10, but by 11 there were lines out the door and the server began to rush us out. <br><br>The food was good. I mean, it was solid breakfast food. I'm just not sure that it was any better than other breakfast foods I've had. <br><br>Butcher skillet - Just exactly what you'd expect from a butcher skillet. <br><br>Berry bliss pancakes - thank Yelp for this recommendation! Even the side was awesome. Some places will give you small version/portion of the pancake when ordered as a side, but theirs seems to be legit. <br><br>garden skillet - a bit bland...<br><br>south benedict - I asked for the sausage gravy on the side cuz I don't like my food soaked, and it was very good. I just wish there was some, even a sprinkle of, veggies or greens. The hash browns that came as the side was also just a big portion of potatoes and I was really craving some kind of vegetable half way through. <br><br>vegan hash - I have no comment on this dish. I'm not vegan. I like my meats. If I was vegan, I think I'd have something to compare it to. My friend who is trying to be vegan said it was good. So I'll leave it at that. After a bite, I'm just glad I'm not vegan. <br><br>Oh, and they have a coffee/espresso table at the entrance. You have to pay there if you get coffee there, though. I saw people coming in to just get the coffee to go. I asked if I could get their coffee while waiting for our table and have it put in our tab, and they said no. I don't think their coffee is any different from what we got at the table though. The price is the same. I got a double espresso over ice, and it was delicious. <br><br>Now that I've tried this Yelp-loved place and liked it, I can move on to other delicious places in Chicago. I don't have any cravings to have to go back, though I was happy to have been there once.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ir2sRwBozk0TSGidInGkag/348s.jpg", "caption": "check for 4. interesting that \"gratuity example\" starts at 18%"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LBfcjwwDDF8Vv5J1-H7RrQ/168s.jpg", "caption": "vegan hash"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wzkOHbup8Clw3JW_1_pa6g/168s.jpg", "caption": "butcher skillet with eggs over easy"}]}}, {"review": {"des": "I've been here a few times in the past year. Line is always ridiculously long, sometimes over 1 hr - the KEY is to get in the \"virtual line\" via the NoWait or Yelp apps before you even leave for the restaurant. If you aren't doing either of those things, you are waiting too long, my friend.<br><br>Another pro tip: Order a skillet/the chilaquiles/an omelette and pay the extra $2 for the specialty pancakes on the side. You'll get the best of both worlds. Sure, you could do the plain pancakes (they are just okay) or their fruit or toast.... but believe me, people line up for an hour for the pancakes. The food will last you two meals for a good price - heat up the leftover skillet in the oven and enjoy! Or show up extra hungry. Comes with 2 pancakes versus the 3 you would get if you paid the $12 for the specialty pancake dish. Ha!<br><br>Every time I come, the servers are wonderful. They are sweet and very thoughtful. Today Daisy took care of our table and was absolutely super to us.<br><br>I've had a number of things on their menu, as I've been here a handful or two times. The BEST savory dish IMO are the chilaquiles. I don't know what they marinate the meat in, but it blows all their other skillets and omelettes out of the water. Not that the other things aren't delicious (they are pretty good), but the CHILAQUILES. The only iffy things I've had are the butcher block skillet and the breakfast burrito, which are better elsewhere. Also, you can't go wrong with any of their sweet options. Berry bliss is always a good flavor choice, but I am also partial to the lemon blackberry and cinnamon roll. Today I got the french toast lemon blackberry and it was a delicious cakey delicacy. Not french toast per se, it was literally a spiral cake sliced into pieces and covered in sweet cream sauce. No complaints here.<br><br>This is a terrific place to bring your family, your friends, or a special someone! The wait goes faster if you have a smaller group, so maybe keep that in mind.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/X6pASLIjmE3TO_TbNB2Djg/168s.jpg", "caption": "Top skillet clockwise: butcher block skillet, berry bliss French toast, barbacoa chilaquiles, blackberry key lime pancakes"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/u0DUiScjeX-eRbhgxpl6tg/168s.jpg", "caption": "Blackberry key lime pie pancake side"}]}}, {"review": {"des": "Better than the basic brunch, the food is next level. The pancakes are innovative flavors, more than the usual. Listen to the yelp tips: order an entrees and upgrade your toast to their specialty pancakes for a few bucks more. That way, you don't miss their stellar entrees either.<br><br>The waits are as lengthy as this place is delicious. When you get close, like 10 miles away, the yelp app allows you to join the waitlist. Do this!", "pics": null}}, {"review": {"des": "Omg where to start. We waited around 45 min for brunch table of 4 so we definitely came in very hungry. The menu has so many options! I went with the chocolate chip pancakes, my friends went with the Oreo pancakes, sausage with eggs and French toast. These pancakes with a cup of coffee were exactly what I needed. Everything was delicious. We all had food comas afterwards but definitely left satisfied.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VTY9nC4QSOk8qZfev6EP_Q/348s.jpg", "caption": "Chocolate chip pancakes"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/a90797e6x58uaGbknfRbDA/168s.jpg", "caption": "Sausage with eggs"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5P-hEmcU3stEFzefXCIizQ/168s.jpg", "caption": "Oreo pancakes"}]}}, {"review": {"des": "A double thumbs-up for Wildberry, a great breakfast and lunch place that never disappoints.<br><br>Wildberry's skillets are truly amazing - they're packed full of fresh ingredients and all-around goodness. This particular morning, I had the Denver Skillet, containing (get this) two eggs, ham, bell peppers, onions, hash browns, and both cheddar and jack cheeses, all in the same skillet, all coming together to make one of the best egg dishes around. Served with a side of toast or pancakes and along with a strong, hot cup of Intelligentsia coffee and the morning paper (provided by the restaurant when you sit down), this is one great way to start the day.<br><br>The service at both this location and the Randolph Street location has always been friendly and welcoming. I had the pleasure of meeting Michelle C. during this most recent visit, a wonderfully cheery person who kept checking to see if everything was okay, constantly warming up my coffee and making me feel like I was a guest in her own kitchen. Having conquered my Denver Skillet, I asked for the check, and Michelle asked me if I'd be interested in a coffee to go - now how nice is that? Be sure to ask to be seated in her section when you visit!<br><br>Finally, a word to the wise - Wildberry can get quite busy, but Yelp comes to the rescue, allowing you to add yourself to the waiting list prior to leaving the comfort of your home or hotel room. On this visit, I arrived just around 7 am on a weekday morning, and it was the perfect time to have breakfast, a time when you can just walk right in and snag a table right by the windows. I also like the décor of this location a bit more than the one on Randolph, with its high ceilings and lots of natural light coming through the windows. That said, the food's great no matter which Wildberry you visit, and for those of you visiting Chicago, you need to put Wildberry on your 'must-visit' list while in town - it's that good!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/K40STLNMhAM8SKQ94XuunA/348s.jpg", "caption": "Water Tower Place/Streeterville location"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TUetNzXCnoaogibQqQ8ieA/168s.jpg", "caption": "Water Tower Place/Streeterville location"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/__sFV_NUPtgWVF6PYEpQ3Q/168s.jpg", "caption": "Water Tower Place/Streeterville location"}]}}, {"review": {"des": "Chicago has yet to fail me on their quality of food! So this breakfast post has got to be one of the best damn breakfasts I've ever had. I went hard! I got cinnamon roll pancakes, corned beef hash, two eggs and 3 sausage links. Listen I don't know what kind of batter they use for the pancakes but they were perfectly made! Not fat and floury perfectly thin but packed with enough flavor, you'd automatically think that it might be super sweet but it was just right! The corned beef hash was excellent!  Let me also add the Mango Pineapple was excellent! Listen this place is just perfect!", "pics": null}}, {"review": {"des": "Two words: Barbacoa Chaquiles. Get this! If you're a fan of Mexican food, you're in for a treat. I didn't order this myself and regretted it as soon as I took a bite of my friend's dish. The best part is you can add on specialty pancakes for 2 dollars! <br><br>I ordered the corned beef hash skillet for myself. It was quite delicious too but the flavor pales in comparison to that of the barbacoa chaquiles. It was a nice spin of the regular corned beef hash. <br><br>The only downside is that it was quite a wait. Normally, you can add your name on Yelp to avoid that line (unfortunately Yelp was down the day we went so we had to wait around 45 - 60 minutes to get a table). <br><br>For those of you who wonder why you don't see alcohol on the menu, it's because they don't serve alcohol! They do have a wide variety of non-alcholic drinks and I think that definitely makes up for the lack of a boozy brunch. <br><br>I definitely want to come back again and get a whole barbacoa chaquiles to myself! And also to try the banana coconut creme pie pancakes, which sound so yummy!", "pics": null}}, {"review": {"des": "We tried this place for the first time and were pleased with the overall service, menu options and dishes we ordered.  <br>The coffee is Intelligensia which is great! We decided to go with an Iced latte: one was vanilla and one was toffee nut. Flavorful and smooth. Similar in taste, but we liked them. Impressed that the coffee drinks were good since some breakfast cafes ... coffee drinks are not a strong point.<br>We had the Blueberry danish crepe and Rocky Mountain crepe. Both of generous portions and were very good. The Rocky Mountain is the only crepe that does not contain a sweet filling, it has scrambled eggs, ham and some veggies.  Both highly recommended. Also a side of bacon was ordered.. tasted like it was sitting under the heat lamp for a while :(   <br>Our server was pleasant and quick!<br><br>Tip:  always a wait here for a table. High recommendation to use the Waitlist feature on Yelp.  <br><br>FYI: The entrance area with the host stand is poor space planning. Barely any room to wait for your table and you feel as soon as you come out of the revolving door you are IN the host stand. No matter where you stand in this area, you feel like you're in the way of patrons and staff.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TO9WW8h6AF1vt808xXsNYQ/348s.jpg", "caption": "Side of bacon. Blueberry Danish Crepe. Rocky Mountain Crepe."}]}}, {"review": {"des": "We checked in on Yelp on the way there, were met by a lobby full of hungry people but only had to wait a few minutes to be seated. Based on other reviews we were expecting greatness and it absolutely met those high expectations. Service was incredibly fast and the food was amazing. We had the southern eggs Benedict and Oreo pancakes. Pancakes were stacked HIGH, fluffy and delivered. Eggs Benedict were savory, I asked for the gravy on the side and glad I did because otherwise it might have been overwhelming. Definitely used the yelp \"join the line\" feature if you want to save yourself some time if you try this breakfast spot, which you should", "pics": null}}, {"review": {"des": "I've been to Wildberry quite a few times now and every single time I leave satisfied and full! The portions are huge so if you don't want to feel too full and heavy (especially if you don't want to hit a food coma/are visiting the city and have a lot of walking around to do) maybe consider splitting an entree with someone! I absolutely love any of their egg benedict dishes, which is what I usually end up ordering. Although I'm not the type to care for dessert-y breakfast entrees, I love the pancakes here. I usually order a side to split with some friends to eat after our savory entrees. Their fresh squeezed OJ is also so delicious! Wildberry is definitely one of my go-to brunch places, and I always make sure to bring friends who visit from out-of-town, especially since it's so conveniently located near Magnificent Mile! :) however, because of that very reason, it gets pretty busy on the weekends so be sure to call ahead to ask about the wait time or use the Yelp app! :)", "pics": null}}, {"review": {"des": "A great breakfast!  Our family went later on a weekday morning.  We were seated immediately, as we missed the morning rush.  Our server was helpful and accommodating to the special requests of our kids.  We had a relaxing late morning at Wildberry, full bellies and were ready to enjoy the city after our brunch.", "pics": null}}, {"review": {"des": "Be prepared for a long wait- my friend and I decided to go shop at some near by stores to kill the time. However, the wait will be well worth it. The name reminded me of the Wild Thornberrys (throwback), and on a fantastic adventure full of creative twists to everyday brunch and breakfast items we went.<br><br>We tried a ton of the sweet stuff- blueberry Danish crepes, Belgian waffle, and the red velvet cake French toast. Wow, it was all fantastic. Not all pancakes are just pancakes, and Wildberry has shown me not all crepes are just crepes. <br><br>If you're a fan of blueberries, you have to try the blueberry Danish crepes. The crepes are sprinkled with blueberries, blueberry sauce, icing, and a bit of slivered nuts. I couldn't have enough of them, except when I felt the urge to try out the red velvet cake French toast. Now things were just getting decadent. The frosting on the red velvet was great. The strawberries that accompanied it complemented the dessert perfectly (in other words, the cake wasn't too sweet). That being said, if there's only two of you, you might want to split two desserty things. With three, we could barely handle the carb overload.<br><br>Next time I go, I'll have to try out an omelet or skillet. But, for now, if you're looking for a sweet brunch, I can definitely recommend it and say it's worth the wait time.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BzSBoi25Pw5Ds_msrCuoWA/348s.jpg", "caption": "That's a brunch alright"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VO_lCs8HuWn4WUwfJN6Nhw/168s.jpg", "caption": "Red Velvet Cakes (under French toast creations)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3BpNkC5-lsg6zGQy8Os0Lw/168s.jpg", "caption": "Blueberry Danish Crepes"}]}}, {"review": {"des": "Great option for Saturday breakfast/brunch near Northwestern.<br>The wait list was about 30 minutes when we got here, but the wait went by quickly.<br>I ordered Numi Orange Spice tea and two scrambled eggs, hash browns turkey sausage patties with Strawberry bliss pancakes.<br>Everything was super delicious and really affordable.<br>Nothing remained on my plate!", "pics": null}}, {"review": {"des": "This place was absolutely amazing.  We had the butchers block skillet which was sensational,  especially for a place famous for their pancakes.  <br><br>We also had the berry bliss pancakes which were beautiful on the plate and out of this world on the palate. <br><br>Definitely check in on Yelp!  because the wait can be painful... This place is super prolular. <br><br>HIGHLY RECOMMENDED!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hkpOwjsucknOx-lsWRBU7Q/348s.jpg", "caption": "Butcher's block skillet,  berry bliss pancakes and a chocolate chip strawberry banana waffle."}]}}, {"review": {"des": "Food is good with generous portions. We liked that some of the dishes offered pancakes as a side so we could have both sweet and savory options.<br><br>Giving 5 stars to our server Val who was pleasant, helpful, and kept our water glasses full without our needing to ask. She was awesome!<br><br>Slow Roasted Brisket Hash - Favorite dish of our order, although this isn't the dish for you if you don't like onions. It might be more manageable if they cut them smaller.<br><br>Barbacoa Chilaquiles - SPICY. We think it was the sauce topper that tasted like burning. In the future we would ask for this on the side to control the heat better but keep the flavor.<br><br>Signature Berry Pancakes - Okay. A few fresh blueberries in the pancakes with fresh berries on the side. <br><br>Cinnamon Roll Pancakes - Our least favorite, but still tasty. We expected cinnamon in the pancake. It was a swirl of cinnamon sauce and glaze on the top pancake that didn't reach the bottom pancake. But with the sheer volume of orders, not sure they are going to revamp this anytime soon.", "pics": null}}, {"review": {"des": "Sunday at noon planned brunch/lunch with friends. Arrived about 20 min early and put in our name. Was told 45-60 wait. Our table was ready in 45 min. Was hopeful this was one of those places that tells you longer so you are happy when they call you earlier but nope. Lol. However they text you so you can leave and walk around the city if you want.<br><br>Ambience-bright. Casual. Pleasant.<br><br>Food-our food was excellent. I had a cinnamon latte and an omelette with hash browns. Huge portions--I didn't finish mine and was happy I told them not to bring me toast or pancakes. <br><br>Great location for a nice breakfast!", "pics": null}}, {"review": {"des": "This first note is for my friends: no liquor license so no bloody Mary's.<br><br>So Wildberry has been a thing for a few years now and weekend waits are obscenely long. Even on 11:00 on a Friday for just me was 20 minutes when I was promised five. I was afraid that it had become the Cheesecake Factory, living solely on reputation and renown. But I also noticed a lack of polo shirts and dad khakis amongst the waiting patrons. I mean, its location is ridiculously beneficial.<br><br>I got started with a organic iced coffee with impressive roasted notes. I had an omelette with fig, scallions, prosciutto and havarti. The hash browns were done crispy which is how civilized people eat them, as a separate side and not mushed together with eggs. Towards the end of the omelette the sugar grainy texture of the figs started to wear thin but overall I liked it.<br><br>But, oh! I had blueberry danish pancakes on the side. We're talking blueberry strusel topping with a perfect amount of cream cheese throughout.<br><br>It was the best two pancakes I have ever had. They didn't need syrup- the syrup actually diluted the taste somewhat. <br><br>Worth every minute you have to wait! Winner and still Champion of the Chicago brunch!!<br><br>Btw: I'm writing this in front of the Cheesecake. Nearly empty at lunch on Friday. There IS justice on this Earth.", "pics": null}}, {"review": {"des": "Wildberry is a local Chicago chain and I still love it (despite chains not really being received well in here). I love their breakfast skillets. The Mexican one is my favorite and is enough to feed two or two meals. <br><br>Upscale diner feel with friendly down to earth servers. Average pricing for a breakfast joint in a big city. There is usually a long wait on weekends, put your name on the waitlist via Yelp before you head over!", "pics": null}}, {"review": {"des": "Best breakfast in downtown Chicago. Consistently good and unique! I say unique 'cause the omelette had such an incredible flavor. It had olive oil, basil and mushrooms along with a cheese that somehow blended well. Very good pancakes and all around delicious food. The staff was very good and I was impressed with the atmosphere. Yummy Yum Yum!", "pics": null}}, {"review": {"des": "The wait here is insane on weekends. It's best to join the waitlist on yelp ahead of time before you go so you don't have to spend an additional 45 mins to an hour waiting for a table!<br><br>The food here is delicious. Pancakes and Belgium waffles will never disappoint.<br><br>The service is great!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oY5cU5zMjLjlErVSNz1gkA/168s.jpg", "caption": "Strawberry chocolate Belgium waffles"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IyJdO6ooYINFjQVr2-K9Aw/168s.jpg", "caption": "2 eggs, hash brown, and sausage patties"}]}}, {"review": {"des": "We had the pleasure of getting brunch at this place as was a walk away from our hotel! We had the Eggs Benedict, tuna sandwich with Fries, omelette with French toast and chocolate chip pancakes  I would really recommend this place as the atmosphere and service was really good I really enjoyed the French toast not so much the pancakes though!", "pics": null}}, {"review": {"des": "Loved this place! We got the mexicana and bbq chilaquiles skillets which we're both so delicious. Got sides of specialty pancakes for Oreo marshmallow and their signature berry which were both super delicious! Would recommend paying extra to get specialty pancakes as a side instead of whole orders so you can try more. It's 2 pancakes for the sides vs 5 for a full order.", "pics": null}}, {"review": {"des": "Such a hot day in Chicago for walking, but nonetheless we wanted some pancakes, and this seemed to be THE spot for some good ones.  Glad we used the Yelp app to get on the waitlist, which saved a ton of time standing around.  Walking in, I was just surprised at how hot it was in there. I can't imagine how the poor servers and chefs were surviving in the back.  Just standing there felt hot.  I finally commented that I wondered if their air was not working, which one of the employees later confirmed.  It made for uncomfortable eating, that's for sure.  People were fanning themselves with their menus.  It was bad.<br><br>My bf got an iced latte, honey nut, I think it was called.  I drank some just to cool down.  It was pretty good, not great.  It was somewhat sweet, not overly creamy. I stuck with ice water, and deliberated pouring some on my head.  It was just not a comfortable meal with the lack of air circulation inside there and it was pretty packed with people.  I was glad we were sat in the upstairs section, because it was less crowded at least.  The other beverage options included fountain drinks, juices, milk, smoothies in all varieties, and flavored lemonades.  I've never seen such an expansive lemonade list in a breakfast spot.  They had strawberry, blackberry, raspberry, cherry, kiwi, pineapple, mango, and passionfruit.  Wow!  I was somewhat surprised they didn't offer drinks like mimosas and bloody marys, but alas, had to stick with lattes. <br><br>After seeing the prior Yelp reviews, I knew I had to try some pancakes. They just looked so nice and fluffy in the pictures.  So I ordered some protein (scrambled eggs), chicken sausage, and fruit.  Then I went bad, and got my side of pancakes, which by the way, are a very healthy side portion, not the silver dollar kind.  My bf got the banana coconut cream pie pancakes.  They were delicious. They look just like the picture, fluffy and fresh and bursting with flavor.  They even had little coconut flakes sprinkled in them.  Decadent for sure.  My meal was less exotic, but the pancakes, though just the originals, tasted great.  Definitely one of the better pancakes I've had in a restaurant.  I can see why this place is such a success they opened two within walkable distance from each other.<br><br>Breakfast is one of those meals I love to have, but seemingly never have time often enough for a sit-down.  If I make it back to Chicago, I'd definitely keep this one on the radar.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XLrNCXx5OBiYwa9C3A_KbA/168s.jpg", "caption": "Banana coconut cream pie pancakes"}]}}, {"review": {"des": "JOIN WAITLIST THROUGH YELP BEFORE GOING THERE.<br>We were there for the Chicago marathon and waitlist was 3 hours so I woke up joined the waitlist did my morning routine and then arrived to the restaurant and just waited 5 min to be seated <br>They had great staff despite the angry and impatient customers <br>I mean, they're biiiiiig breakfast we couldn't even finish. You should try the smoothies they're delicious. Hash browns are amazing pancakes I was honestly expecting something out of this world but they were too sweet and eeh but I would go back !!!<br> I just hope they stop using straws for every drink!!! It's about time people", "pics": null}}, {"review": {"des": "I've always had fond memories of when I first dined at Wildberry in 2012 or 2013 when I visited Chicago as a tourist. Now that I live in Chicago, I rarely think to go to Wildberry for brunch, because I figure it gets packed with tourists on the weekends (no offense, tourists). After a weekday shopping spree, I found myself wandering around the Water Tower and saw a sign for Wildberry right outside the building. It was lunch time, I was hungry, so I walked in and was happy to be escorted to a table right away. The menu was quite overwhelming with a million different omelet and hash options, but I ended up getting the Napa Valley Fig Omelet w/ a side of fruit. The omelet was stuffed with chopped figs, bacon, and Havarti cheese. The flavors of the cheese and bacon melted together nicely but had very little seasoning otherwise. Would definitely come back for the pancakes because I still remember how delicious their Berry Bliss pancakes are. The eggs, I can probably do without.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/teanJZMdGJQQy6Q3hD2iSg/348s.jpg", "caption": "Fig and bacon omelet!"}]}}, {"review": {"des": "The food was terrible. I have never seen this kind of disgusting crêpe and egg benedict in my life. I'd recommend it if you are looking for \"American crêpe\". But if you are looking for something finer than that, don't.<br><br>The portion size of the egg benedict is seriously huge. And the presentation, I would say it come straight out of prison, with the crumble hashbrown mix with burned corn beef, top with 2 eggs. The Hollandaise sauce is a dishonor to the Dutch sauce at it best, mixed with some kind of BBQ powder. <br><br>The Crêpe is another dishonor to the french Crêpe, mixed with melted ices cream inside, the Crêpe itself was too sweet, mix with the ice-cream, really make you want to have a heart attack at every bite.<br><br>I finally have to put some dish to the side and order a small portion of pancakes, and extra maple syrup to finish the meal. <br><br>As I said, if you are looking for an American touch on what was European tradition, you are looking for the right place.<br><br>But if you are looking for something more fine, do not go to this restaurant :)", "pics": null}}, {"review": {"des": "A must when in Chicago. Best breakfast place around and obvious why they have such great reviews. Quick and friendly service. Affordable. Food was delicious, hot, and huge portions. Hard time picking what to get. Here are the banana coconut cream pancakes, signature berry bliss pancakes, wild mushroom omelette, and Napa fig omelette. Highly recommend these", "pics": null}}, {"review": {"des": "I had such high hopes for this place because of all the Yelp reviews I felt like I had too high standards so it was quite a mediocre experience for me. <br><br>My friend and I had used the yelp online waitlist and this place definitely keeps to it's promise. Not all places do. After eating at this place, I'm glad we did it because I definitely don't think this place is worth waiting 40+ minutes for. I'm not a hater of this place but I just love pancakes so much that my standards may be higher than average. <br><br>For two people, we had one Mexican skillet and did the speciality pancake upgrade (2 pancakes)- we ordered the signature berry bliss aka the famous pancake. This was enough for two girls to share I'd say if you're not starving. <br><br>Pancakes- these tasted fluffy, but it was the same type of fluffy that IHOP or bisquik pancake mix offers. They simply squirt the berry sauces, throw in a few fruits, and call it the signature berry bliss. Everyone seemed to be really excited about this pancakes so I'm genuinely confused about whether I just had a bad order??? <br><br>Mexican skillet- very hearty. It was to standard but perhaps due to the Saturday brunch rush, the food didn't come out as cold as I liked. It was also on the oily side. <br><br>I am surprised with myself for writing a review that is so opposite from all the other reviewers who raves about this place. Trust me, I very much also wants to be wowed by the food here but was sadly not. Maybe I'll come again but as I was only visiting, my time is short here and I probably won't be coming again as I have other places on my list to try. Perhaps my not-so-good review may lower your standards so when you take your first bite, you'll enjoy them more than me!", "pics": null}}, {"review": {"des": "Good brunch restaurant, but not at all worth the hour wait if you don't plan ahead. <br><br>Their food IS good, and the prices are affordable, but the restaurant is a bit overhyped and the wait is always long. I would recommend eating here for brunch, but CALL AHEAD.", "pics": null}}, {"review": {"des": "Located next to the Ritz and across from MCA, this place is almost always packed! Located Even on a random Tuesday at 9:30AM! We didn't have to wait for long though and managed to nab a spot outside on a gorgeous 72 degree morning.<br><br>The omelettes are humongous and you have a choice of sides including fruit or hash browns and toast or pancakes (or upgraded pancakes for an additional cost). They are more than enough to feed one person and are absolutely delicious. We shared the veggie omelette and also ordered the Wildberry Crunch Greek Yogurt (which is their fancy version of greek yogurt parfait). The yogurt tasted way too good to be Greek yogurt... I'm pretty sure there was a good amount of sweetener in there, be it sugar or honey. And it was topped with granola, blueberries and strawberries. Also humongous! The two of them combined made for a perfect sweet and savory breakfast.<br><br>They serve Intelligentsia coffee too! Yay!", "pics": null}}, {"review": {"des": "Fathers Day Brunch, and we were lost in Chicago.  My honey had got us on the waitlist for another Wildberry location that was more popular, but we got lost and realized it was a far walk from where we were.  Thankfully there are two of these locations, so we ventured to this spot.<br><br>It was, of course, fairly busy for Fathers Day.  This one sits across a local park and right on the corner.  It has many windows and a small outdoor seating area.  The line was long and there was nowhere to sit while waiting.  To top it off, it was already close to 90 degrees and their A/C wasn't working.  Thankfully, my honey already got us a reservation and we got seated on the upper level away from the revolving door and bustle of people.  It was still uncomfortably warm.  We noticed one of the guys that was seating people had to change shirts bc of the sweating.  I felt so horrible for the staff.<br><br>Our waiter came and did a great job.  She got us water, which didn't seem to cool me down fast enough.  I ordered the honey nut latte, iced, based off a previous review.  It was good and my honey enjoyed it too.  It literally tasted like liquid Honey Nut Cheerios.  <br><br>I had the banana coconut cream pie pancakes, and they were delicious!  My only problem is the heat really unsettled my stomach so I couldn't finish them, which was to my honey's delight.  They had banana slices, coconut shavings, cream pie filling and lightly drizzled syrup.  Some of the best I've had.  It was stacked high and very moist.<br><br>The only thing missing from my meal was an ice bath and Bloody Mary.  Otherwise, this is a great stop for a good breakfast but not ideal for a brunch where you'd like to get alcohol added.", "pics": null}}, {"review": {"des": "As far as breakfast goes, Wildberry is aggressively average. The service, atmosphere, and coffee were all good. The pancakes could've been made from a pancake mix - they weren't very fluffy or flavorful. The roast hash I got was bland, even though the combination of ingredients should've made it much more tasty. This was my first time in Chicago, and I went to Roister for brunch the following day after eating Wildberry and the breakfast was much, much better for a similar price (although, it's different than diner food). Anyway, seems like there are much better options in Chicago than Wildberry, which doesn't live up to the hype.", "pics": null}}, {"review": {"des": "Our hotel was down the street from here so we decided to give it a try based on reviews from other locations. SOOOO glad that we did! There was never a long wait to be seated and the servers were very friendly. There was also a patio but the weather was so hot and humid when we went in July that we asked to be seated inside. <br><br>4/5 Corned beef hash with fruit and 2 eggs and a side of their berry bliss pancake (extra $2)<br><br>2/5 slow roast brisket hash... 12 hour brisket but needed a lot of salt IMO. I wouldn't order it again because it was super bland. <br><br>bf got the butcher block skillet the first day and breakfast burrito the second day... he said he liked both of them. <br><br>I liked their berry bliss pancakes so much I ordered it both times we ate there. I don't think you can go wrong with anything on the menu (besides the slow roast brisket hash). Can't wait to go back to try their waffles!", "pics": null}}, {"review": {"des": "First, I just want to say this place is probably one of the best breakfast eateries I've ever had. This was the first place we tried on our trip and were quickly turned into Wildberry addicts. I say addicts because during our stay we ate there a total of 3 times, sad - I know. This place is always packed -- esp on the weekends. <br><br>I would recommend that if you can, please put your name on the waiting list through the Yelp app. It saved us so much wait time on the first visit and virtually helped us to skip the line the second and third time we visited. But even if you do have to wait, trust me IT IS WORTH IT. The menu is so diverse and boast so many different choices of breakfast food that isn't so 'traditional'. <br><br>I encourage any breakfasts lovers out there - if your ever in Chicago visit one of Wildberry's locations and check out pretty much everything on the menu, you won't be disappointed!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_qxOuO31l3fxAqLBnr07Qw/348s.jpg", "caption": "Denver skillet + Red Velvet French Toast"}]}}, {"review": {"des": "I wanted brunch and decided to drag my husband here. Yes, it's a chain and I was not impressed with the suburban locations. However, their berry bliss pancakes are just delicious. Luckily, the Yelp app allows you to put your name on the wait list. Hallelujah! <br><br>The wait at Wildberry can be brutal on weekends. The Yelp app made it easy peasy. We arrived a bit early with 2 tables ahead of us. The waiting area is small, so be warned if you're a person who likes personal space. <br><br>The restaurant is very modern compared to the suburban location we visited before. The menu is enormous that took a good 10 minutes to figure out what to get. The hubs had some eggs Benedict and I had their chilaquiles with a side of their berry bliss pancakes. Both dishes were prefect! Their berry bliss pancakes are just to die for. I normally hate eating pancakes, but for this I will always make an exception. As busy as the restaurant was, they were fast in bringing out the food. I mean like lighting bolt quick. Our waitress was wonderful and very quick. Drinks were never empty and dishes were cleared quickly. <br><br>I enjoyed our visit here and would definitely come back again. Gotta make sure to use that Yelp app!", "pics": null}}, {"review": {"des": "This place lives up to the hype!<br><br>First off, I really like that you can put your name down on the waiting list online. There is always an ungodly wait so by putting your name down online you don't have to wait at the restaurant. It will tell you when your table is almost ready and voila!<br><br>The food really is good too. You have to get the pancakes! Especially the specialty ones. Their omelettes and skillets are good too. My only complaint is last time I got an egg white omelette and it was really greasy. Maybe it was my bad for not asking them to make it dry, but I always thought that was assumed. Who eats an egg white omelette other than to cut calories/cholesterol?!?<br><br>Bottom line: food is delicious. Get a side of pancakes. Make sure to put your name down ahead of time online so you can chill at home/run errands before your table is ready.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Oa4JRgHhKU5XOuajmqjkig/348s.jpg", "caption": "Yummmmm"}]}}, {"review": {"des": "I really enjoyed my breakfast at Wildberry. The pancakes are light and fluffy. I just tried a regular pancake. I love ham so it was awesome having that as a meat option. The wait was super long but it was nice to be able to join the waiting list with the yelp app.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IVY4W0dKRj1tQGL5wdjq7g/168s.jpg", "caption": "Special chai is worth a try"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/n_aDwBhdES4pRdHNcuhb2g/168s.jpg", "caption": "Special chai tea is delicious"}]}}, {"review": {"des": "Probably the best breakfast I have ever had. Definitely top 5. I ordered the barbacoa chilequiles. It's was cooked to perfection and tasted made to order. Tortilla chips on the bottom were hot and crispy. Cheese was perfectly melted. and all the ingredients were perfectly portioned and layered. I ate it all despite being full to the brim because I couldn't bear to see it go wasted! I also ordered a side of pancakes and upgraded mine to the banana coconut. It was heaven on a plate. There are no other words. I am sorry I didn't take pictures. It was certainly worthy.", "pics": null}}, {"review": {"des": "Really nice location! Have visited a few times now and staff have always been very friendly. Gets crowded but is so much more manageable than the downtown location! Food is always delicious and comes out quick, what else can you ask for? So happy to have this opened up right in the heart of streeterville.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_NTNCnA0ifhraxwDSXuv-g/168s.jpg", "caption": "Veggie omelet with Venetian skillet and Berry Bliss pancakes. Delicious!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1IEMJNwytbZw7MI17Z_RYw/168s.jpg", "caption": "High ceilings, helps disperse the sound so it never gets too loud"}]}}, {"review": {"des": "Use the yelp waitlist option!!! It saves so much time.<br><br>It's usually an 1-2 hour wait. I signed us up while we were getting ready at our hotel, and got there just as the text message said to check in.<br><br>We didn't have to wait long before seated. The food is sooo good, my favorite is the southern Benedict. Poached egg on a sausage patty, on top of a biscuit, loaded with gravy.<br><br>Portions are large so come hungry!", "pics": null}}, {"review": {"des": "This place is soooo good!!!! The couple sitting next to us recommended the barbocoa skillet so I ordered that. Was not disappointed!! It was very flavorful and tasty. I ordered with a side of pancakes and those were delicious as well. Our server (I believe his name was G) was really nice and accommodating. Would recommend and plan on visiting when I return to Chicago (I'm visiting from NYC).", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zzIcRJeRLjN4EY0HvQTQxQ/168s.jpg", "caption": "Mint tea"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/APT-xoa2o7RzuZfjgBohrA/168s.jpg", "caption": "Barbacoa breakfast skillet"}]}}, {"review": {"des": "Wildberry is legitimately one of the best brunch places I've ever been to. I visited this location recently and I'm happy to say it's just as good as the one near Millennium Park. <br><br>I got the Los Altos Benedict, a delicious Tex Mex take on the breakfast classic. It was soooo gooooood for lack of a better description. Savory, spicy, creamy, just amazing. The hash browns are not seasoned (my only criticism of the meal), but I mixed them with the extra hollandaise and chorizo from the benedict and then they were dynamite too.<br><br>My date got the Signature Berry Bliss Belgian waffle and holy shiz, it was delicious as well. The waffle texture was on point -- crisp on the outside, light and fluffy on the inside. But of course, the real star is the \"berry bliss,\" the decadent topping of fresh berries and sweet sauces. They could berry bliss a piece of cardboard and I'd probably eat it.<br><br>And to top it all off, you can wait in line VIRTUALLY through the Yelp app! I woke up, put my name on the waitlist on my phone, and left my apartment only when it got close to my time. All restaurants need to do this ASAP.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ruwbyaSuJ_eaGH8mYdQgWQ/168s.jpg", "caption": "Signature Berry Bliss Belgian Waffle"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qPKd6hJnVrRgqMSoZah-WQ/168s.jpg", "caption": "Los Altos Benedict"}]}}, {"review": {"des": "Firstwatch on steroids. This place is worth the wait. Perfectly cooked poached eggs, hash browns, and waffles. And they have an expansive menu, from the savory to the sweet and every sandwich in between. The jams and cream cheese are clearly made in house, possessing a great, unique flavor. Likewise, the coffee was amazing and extremely fresh. On top of all that, great, friendly service! <br><br>If I am ever in Chicago again, I will definitely be back!!", "pics": null}}, {"review": {"des": "It's probably not a secret that we loved this place, especially after all the raving reviews. But yes the hype is all accurate. This is an amazing brunch. We had the Butcher Block which was a giant bucket of meat, potatoes, cheese, more cheese, and more meat. It's the perfect cure for a hangover! The pancakes are clearly the star of the show here though!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LSYwaxibS36RJMwN8A82jQ/348s.jpg", "caption": "Butcher Block"}]}}, {"review": {"des": "Top of the line restaurant with excellent service and beyond delicious food choices! My waitress was so nice and took the iced coffee off my check after I told her I didn't enjoy the taste. What classy vibes! Definitely recommend going here if you're in ChiTown! <br><br>We ordered a Mexican omelette off the sizzler and a chocolate chip pancake! Well worth it. Only $18!", "pics": null}}, {"review": {"des": "Overrated breakfast spot. Nice vibes tho<br><br>The thing that bothered us the most was that the waiter had told us that one order of pancakes was definitely not too much for 1 person. <br><br>We specifically asked the waiter because we were wondering how 1 person could eat five pancakes. he told us that the pancakes were small. We ended up ordering the berry pancakes and the Apple pecan pancakes for 2 people. When the pancakes came out they were each larger than the size of our hands. My friend and I ended up eating half of our plates we could have easily shared one order. <br><br>The berry pancakes were very delicious and came with a lot of fresh fruits. I recommend the berry pancakes.", "pics": null}}, {"review": {"des": "Had breakfast here with my husband and his parents when we were in town.<br><br>They have a ton of yummy sounding options.<br><br>I got the Wildberry pancakes and they were delightful.  A good amount of berries and a light berry sauce.  Definitely recommend them.  <br><br>They also had a great cappuccino.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mOssYAnm2nYSB3b5nwVU7g/168s.jpg", "caption": "Wildberry pancakes!  Yum"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CdZXnrIFkQ8YMNsa9ouSuQ/168s.jpg", "caption": "Wildberry pancakes!  Yum"}]}}, {"review": {"des": "This place was actually awesome. Normally when you get large portions the quality suffers however here that is not the case humongous portions with fresh ingredients made for a superior omelette. Hash browns were cooked to perfection. All serve with fresh fruit. My daughter got a Nutella crepe which she said was the best she ever had. This place was crowded for the time they opened till the time they closed. The weight is way worth it I can guarantee you will not leave hungry", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7ZaORujFy9cU9svyP4sVPA/348s.jpg", "caption": "This place is packed every single day"}]}}, {"review": {"des": "I am LOVING this new location. I'm not a huge fan of the other Wildberry, but I've hopped on the fan club bandwagon thanks to my experience here!<br><br>This location is waaaaay less crowded, and had zero wait time at 11:00am. We were thrilled! I ordered a basic two eggs over easy (cooked perfectly!), turkey bacon (super crispy!), fresh fruit and banana chocolate pancakes. I will be dreaming about these decadent, chocolatey pancakes for days. Flavored coffee comes with no up charge, so I highly recommend the french vanilla!<br><br>Service was a little weird. It appeared as though our waitress and a neighboring waitress were both friends with the people dining at the table next to us, so both waitresses focused all of their attention on them and it impacted how frequently they checked in with us. Definitely a one time thing I'm sure, but it still left us feeling odd. <br><br>Either way, NOW I will be sure to make it back to Wildberry. Fingers crossed that wait time stays low :)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2QeO5qsbA3niFj6sUUgVjg/168s.jpg", "caption": "Blueberry danish pancakes"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kYf43UjybWV2K0mdnsOK3Q/168s.jpg", "caption": "Banana chocolate chip pancakes"}]}}, {"review": {"des": "This is a great place to grab brunch/breakfast. Just be prepared to wait a long, long time. I recommend making a reservation...wait time is about 1.5-2hrs. There isn't a specific wait area and the inside is small if you plan to wait in there. The wait is worth it. They're know for their pancakes, but the menu overall is impressive. We enjoyed skillets and pancakes instead of toast. Items in red are the newer items to the menu. The service is great, staff are friendly and attentive, and they turn the tables over quickly. I barely had time to get out of my seat and they were already wiping down the table, putting new silverware, and waters down.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TG3cu-pPN_qverCqy3gg1w/168s.jpg", "caption": "Mexican skillet with over easy eggs and salsa"}]}}, {"review": {"des": "Went here this morning with mom and sisters. Indulged in all the sweet breakfasts that you had to offer! I got the cinnamon french toast, sister got the cinnamon roll french toast, other got the berry crepes, and mom got two slices of toast with two eggs over easy. <br><br>The cinnamon roll french toast was gooey and very coated in a frosting/cinnamon swirl. Resembles a cinnamon roll very well! A tad rich, but what could I expect. <br><br>The cinnamon roll pancakes were rich, but good! \"Tasted cinnamon roll-y\".<br><br>My sister loved the crepes, though she could only eat 1.5/3. Although, she'd prefer her fruit not to be warm this may have to do with the crepes themselves being hot. <br><br>One thing I'd suggest: less use of plastic! We were given our orange juices (oh my goodness! the orange juice is amazing and definitely homemade!!) with plastic straws in the glasses. My mom's iced coffee came in a plastic cup with a plastic lid and straw :-( Small changes can help our Earth!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0S1fRItui1X-o26zc3vzRQ/168s.jpg", "caption": "2 pieces of multigrain toast and 2 eggs over easy"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zPYaOuqK8NC9ACUqmH7cOw/168s.jpg", "caption": "Cinnamon roll pancakes & 2 scrambled eggs"}]}}, {"review": {"des": "Today we stopped in for breakfast before hitting up the park and it was delicious!  I had an omelet and pancakes came as the side.  I enjoyed the omelet but the pancakes were outstanding!  Both of my Girls enjoyed their pancakes as well--One got plain like myself and one tried the chocolate chip pancakes.", "pics": null}}, {"review": {"des": "Wild berry, the food is so flavorful and decadent - this is  a \"come in once every 3-6 months place\" - the richness of the food will carry on with me till winter<br><br>Wait time - We came in around one of the busier periods, 10:30 AM. The wait time was about an hour, but we were able to go shopping  around the area - they texted us when our table was ready - it wasn't too bad at all<br><br>When we came inside, I couldn't stop but look at all the white plates filled with various delicious galore -<br><br>Service - The service was faster than I expected. We sat on the top area, on the balcony, and glared down at all of the colorful pancakes and skillets<br><br>Mexican Skillet - It was delicious - well portioned, super oily but had avocado to cut down the oiliness - this is definitely something to try<br><br>Danish Pancake - the pancake tasted like a piece of thinly sliced cake, filled with cream in the middle, and crumbled with delicious goodness with berries - this was absolutely delicious<br><br>I would definitely come again!", "pics": null}}, {"review": {"des": "Great pancakes. Sweet and fluffy buttermilk cakes. Excellent coffee. Napa fig omelette was delicious, sweet and savory in a perfect way. Hash browns were ok. <br>Biscuits and gravy was excellent. Good amount of sausage, peppery gravy with a great consistency. Biscuits were excellent as well. Service was excellent. Use the yelp check-in. It worked perfectly.  Great execution on all sides.", "pics": null}}, {"review": {"des": "When you travel a lot, your horizons certainly get broader, happier and wiser but unfortunately you might become a nasty foodie drinkie snob. I mean I tried this location of Wildberry and the one on Randolph multiple times. My friends like it but to me Wildberry means 1-2 hours wait, huge unhealthy portions and bland food. I love a good classic warm American brunch like two eggs, fresh perky avocado wheat toast, hot sauce and freshly squeezed seasonal grapefruit or orange juice. So simple, but not many places can make it right. I tried the pancakes, skillets and omelets here and nothing got stuck in my memory. All were just very big portions and more like sustenance. Pancakes can be fluffier and more golden brown vibrant. Skillets arrived late so they were coldish and lacking the kicky perkiness. The staff are very nice in both locations. Both branches are so crowded. I don't understand why the vibe, but whatever makes people happy. One of my favorite brunches in Streeterville/Gold Coast is the avocado wrap at Cupitol or  a croissant sandwich at Pierrot-The Peninsula.  No wait and the quality is persistenly excellent. I'm neutral about Wildberry, 3.4989898989 stars overall.", "pics": null}}, {"review": {"des": "The Napa Valley Fig omelet totally changed how I see things folded in eggs! A little sweetness is fabulous! I attempted to eat every last fork bite of this omelet, but alas, it was simple too much food!! It was also a ok price - $14 (for Chicago). My meal was accompanied by two pieces of yummy wheat toast, butter and jam, and fruit. I could have chosen pancakes and hashbrowns instead.<br><br>My fiance enjoyed his meal too. He ordered the berry waffles - yum! <br><br>I ordered a seasonal drink - a chai latte. I substituted almond milk for 2%. It was a tall mug, not a little tea cup. Couldn't finish it all either! Nice and spicy and with lots of foam. So good!<br><br>This location at the Water Tower building was a short walk from our hotel, and we were pleasantly surprised by how delicious is was for a tourist trap location. <br><br>Service was great! We sat outside at 7am and enjoyed the cool morning and people watching. Never were our waters or coffee empty. Totally a five star meal. Would return.", "pics": null}}, {"review": {"des": "Wildberry never disappoints!!! They have an extensive menu with some great food. Our wait was long in a Saturday since we were a group of 6. We were starving by the time we were seated. The atmosphere is casual and the decor was modern and new.<br><br>Staff: <br>They were very accommodating especially since we had a large group. They kept us in the loop about what was going on as they were trying to get us seated. Very pleasant and patient with us. Our waitress was knowledgeable and attentive to our needs.<br><br>Food:<br>Spanish Omelette with chorizo- it was an omelette with a Mexican flare. It came with salsa and I asked for sour cream on the side. It was spicy and full and very flavorsome.<br><br>Signature berry pancakes- soooo tasty!! I mean just scrumptious. They were fluffy and melt in your mouth good. Great flavor!!<br><br>Cinnamon roll French toast- this dish was just average. Not what I expected. It was regular French toast with a cinnamon roll glaze<br><br>I can't wait to return to try more items on the menu. I would  recommend giving this restaurant a try.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vGaOEOs6ebyYSWT5SHIO4g/348s.jpg", "caption": "Cinnamon French toast"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PPvr3fOsIX11jB0E7HAmrQ/168s.jpg", "caption": "Mexican omelette"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2KJ_brGx3soh5K-RQtK3lg/168s.jpg", "caption": "Beery bliss pancakes"}]}}, {"review": {"des": "Best pancakes ever!  I even made sure I ate them before eating the scramble so that I could have them while they were hot. Took leftover Mexican scramble back to the hotel for later. It was amazing as well. Can't wait to go there again next time in Chicago!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/I_IdXYVwM58Aq2jiksNy5A/348s.jpg", "caption": "Make reservations, the wait can be over an hour"}]}}, {"review": {"des": "On a Monday, the wait wasn't as long as I expected it to be considering this place is popular. I used yelp to add my name to the wait list which was about a 20 minute wait. <br><br>We were seated and had water already on the table, also condiments. <br><br>I ordered the Mexicana skillet and it was full of flavor and depth! Gesh! The waiter was helpful in deciding what to get as i can be a bit indecisive and I'm a Pisces so I had a hard time but she made it easier. I ordered the pancake with it. It's a LOT of food and I left very satisfied.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iWWTZtOCoe_6Wf63BJY9CQ/348s.jpg", "caption": "Mexicana skillet"}]}}, {"review": {"des": "AMAZING place for breakfast/ brunch!! Based on reviews from here and other locations we knew it would be crowded. We arrived at 930ish and surprisingly had a less than 10 min wait. <br>Everything was great. The staff was friendly, the environment was upbeat, the service was quick and the food was DELICIOUS.<br>I ordered the Los Altos Benedict which is an eggs Benedict with chorizo. Hands down the best Benedict I've ever had. The menu had plenty of variety from paninis, pancakes, waffles etc. There's a little bit of everything in regards to breakfast choices. If you're visiting Chicago, Wildberry is a MUST.", "pics": null}}, {"review": {"des": "You know the restaurant is good when every table is full the whole time you are there! The best part is being able to make reservations through Yelp and see your place in line! We ended up making a reservation in the morning right after we woke up and then leisurely walked over to the restaurant.<br><br>The servings are huge and prices are affordable. Not a \"healthy\" breakfast spot but there are tons of menu options. Plus, who goes to brunch to eat healthy, anyways...<br><br>Definitely one of my favorite brunch spots in Chicago!", "pics": null}}, {"review": {"des": "Amazing place!!  Food was perfect and service to match. Try anything \"bliss\". Pancakes rock and the apple cider is yum. If long wait just walk a minute to mall and wander while you wait to get texted.", "pics": null}}, {"review": {"des": "Great food but very unfriendly to family who has kids because they make you wait longer than your expected time. They let in parties of 2's first than the kids.", "pics": null}}, {"review": {"des": "This place was recommended by many people in Chicago. Very nice and comfy atmosphere. We were told this place usually have a very long waiting time so we tried to get there as early as possible. When we arrived we waited a few minutes before being seated. By the time we reached the restaurant they have been opened for awhile. Decoration is modern and clean.<br><br>Their portion size of the skillet and the omelets are pretty big. We each ordered our own plate and we were not able to finish it. Each omelette and skillet comes with either toast, regular pancakes or fresh fruits. Upgrade is available for any specialty pancake for additional two dollars. This is a lot of food for one person to finish. <br><br>We tried their infamous berry special pancake and it was very sweet. Two pancakes were given and in between the two pancakes were berries. We also tried the key lime pancake which was my favorite. It was not as sweet as the berry special pancake. The key lime gave it a tangy taste to it. It did not feel like just eating sugar. Both pancakes were very soft and fluffy. There were whipped cream on top of it, as it melted part of the pancakes did get soggy. Will definitely come back next time for their key lime pancakes.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qD-KUvLvWkOzv9XhX9rRyg/348s.jpg", "caption": "Key Lime Pancakes"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UkeeOusm5-55GFIazsabHA/168s.jpg", "caption": "Berry Special Pancakes"}]}}, {"review": {"des": "Breakfast is very important to me when I know I will have a big day and this restaurant surely hit the spot! I'm normally not a big pancake person but coming to an establishment who's name has pancake in it, I had to order some. <br><br>My wife had the Mexican skillet which was absolutely amazing. The combinations of cheese, chorizo, and vegetables were surprisingly light for what it was. The accompanying salsa was also surprisingly delicious and is a must add to your bite. <br><br>I had the corned beef skillet which was to die for! I love corned beef and always order it when I can. The flavors were very savory as it should be and the protein to carb ratio was exactly how I like it.<br><br>For pancakes we had the cinnamon roll pancakes which was good but the signature berry bliss was to die for! <br><br>All in all a fantastic breakfast spot. Just make sure you utilize yelp by using their wait list!", "pics": null}}, {"review": {"des": "5 stars for the menu options and service, 4 stars for the food, and 3 stars for the price of the food. Clearly I feel a bit mixed about Wildberry. Perhaps if we had gotten breakfast food it would have been a more impressive meal.<br><br>My friend and I stopped in for a late lunch around 1pm on a Thursday, and were seated right away; it was still busy, though, which is always a sign of a good restaurant! <br><br>We both ordered their lemonades (they have tons of flavors). I had the plain lemonade and my friend had a mango lemonade. She said hers was very good. The plain lemonade was good as well, although my refill one was very watered down so that was disappointing.<br><br>For food, we both got salads. I had the Thai chicken salad which was good, albeit slightly heavily-dressed. My friend had the chipotle chicken salad, which she also said was very good. <br><br>My only real complaint is the price of the salads- $13 each! While they're big salads, it's hard to justify paying that much. They were good salads, but honestly not $13 salads. <br><br>Our server was training that day, and he was very friendly and attentive. <br><br>I think getting breakfast food at Wildberry would have been a better option; looking around, that's definitely the most popular.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kIlaGZ95S0_KWnUt5qad8g/168s.jpg", "caption": "Chipotle chicken salad"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6ZcLvFoJ2z9J26zOfmAh-g/168s.jpg", "caption": "Thai chicken salad"}]}}, {"review": {"des": "Becca: Visitors to Chitown- BEST PANCAKES I've ever had anywhere!! Soft & Fluffy & full of berries.  We had the  signature Berry Bliss Pancakes- they were unbelievably good.  Affordable prices $28.00 for 2 people.  Definitely a MUST try when in Chicago.<br>Shelby: Mexican skillet was on point!!! Huge serving--large enough for two people to share.  The hashbrowns were buried under the eggs, chorizo, avocado and jalapenos...it was fun to eat. Hands down best pancakes I have ever had!", "pics": null}}, {"review": {"des": "I got the eggs Benedict but wasnt all that impressed.  The thick cut ham was nice but the hollandaise was very sour.  English muffin wasnt toasted enough for me and didn't taste buttered.  <br><br>My wife's poached eggs came out in a basin of water.  Biscuits and gravy were dry and not enough gravy.  Gravy had good flavor though.", "pics": null}}, {"review": {"des": "Not bad, but I was not wowed by the food. The food is a little above average. I had the slow cooked brisket with the specialty pancakes. My husband had a \"Mexican\" style skillet. He said the meat was a bit dry.", "pics": null}}, {"review": {"des": "I already love Wildberry Pancakes, so my boyfriend and I were excited that they opened a location even closer to us. Takes us about 10 minutes to get here from home. Wooo!<br><br>The customer service and friendliness was better than the original location imo. Maybe it's because they're still new, but I hope they remain so upbeat and nice.<br><br>I always get the same thing bc I know what I like:<br>Mexicana - 5/5 - I love this so much. Hash browns, chorizo, jalapenos, avocado, onion, over medium eggs.. ugh. So good. But kind of greasy from the chorizo. That's to be expected, though.<br><br>Now, toast or pancakes are included but you can upgrade for an extra $1-$1.50. I always get the berry bliss pancakes.<br><br>Berry bliss pancakes - 5/5 - Omg. A treat for sure. It comes with fresh fruit, berry coulis, and berry marscapone. Recently I've started to get extra marscapone on the side. It's THAT good. It's sweet but not overly where you wouldn't want to use the syrup. And I enjoy the whole experience so I add butter, too. It's diabetes and a heart attack waiting to happen. But when you do it, you gotta do it right...", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2z5ab2xK_Ld_qe7x0SHJnA/168s.jpg", "caption": "Mexicana with over medium eggs"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ihPllwfl8Y9DPLs55iynmg/168s.jpg", "caption": "Berry bliss pancakes"}]}}, {"review": {"des": "Great breakfast spot! The portion size that they give here is huge. It was so much food that I couldn't finish it all. The food was delicious and the staff was great! We will definitely go back when we visit again.", "pics": null}}, {"review": {"des": "I'm from bayarea area visting Chicago for a weekend. I saw a lot of reviews on Yelp and decided to come. We cam Monday morning 9:30 ish. There was no line fortunately.<br>I ordered oreo smore which is chocolate chip inside pancake with Oreo on top, with liquid mashumallows.i don't usually order anything sweet for breakfast but I craved for some reasons. It was a great decision. It was huge. Yes huge. I couldn't finish even half but I was really satisfied.", "pics": null}}, {"review": {"des": "So glad this place finally opened!! Have been waiting for the whole year. <br><br>Space is very nice and convenient, right off michigan Ave and steps from the water tower mall. The food is identical to the one in the loop from what I can tell. Their specialty pancakes are really the reason to come here but their entrees aren't too shabby either. I got a skillet with specialty pancakes on the side and had leftovers to take home. Definitely try at least once!", "pics": null}}, {"review": {"des": "Loved the hashbrowns, it was so crispy! and got the southern benedict! The pancakes were fluffly and delicious too!", "pics": null}}, {"review": {"des": "What can I say? After always visiting the Schaumburg location, our travels had us in the downtown area but I refuse to go to Chicago without a trip to Wildberry!! This location did not disappoint. <br><br>Use the no wait app or the Yelp waitlist feature, this location is also crazy busy especially on the weekend. <br><br>Food is amazing, my entire family has yet to have a menu item at any Wildberry that was not fantastic. I highly recommend the Corned Beef Benny, the Rocky Mountain Crepes and per my son, the Fruity Pebble Pancakes - which can be made in an adult size order - don't judge - they're awesome!!", "pics": null}}, {"review": {"des": "I'm wild about Wildberry! Great service, great food, and great pancakes! I came here with a friend, and we were seated as soon as we arrived. Granted, the restaurant was almost completely empty and it seemed a little overstaffed, but I guess that's not something I should be complaining about.<br><br>Service was incredibly fast and attentive (again-- I'm not sure how it compares with when the restaurant is more packed). Our waitress seemed very knowledgeable about the menu when asked, so I assume that some of the staff have worked at previous Wildberry locations. Our waitress came back to check on us multiple multiple times to ask us about our food, for coffee refills -- to the point where it was almost a little excessive, but I really appreciated what felt like a genuine effort to make sure we were enjoying our experience/food. <br><br>Our food came in less than 10 minutes after placing our orders and was fresh. I got the mexicana hash which was everything our waitress advertised it to be: savory and zesty-- the perfect wake-me-up breakfast. It had a little kick to it which I liked. In fact, it was a little more than I expected (which was good) but it paired well with the specialty pancakes we got as the sides. I got the berry bliss-- which was bliss. The pancakes were fluffy-- just the right texture, and coated in various creamy berry sauces. In the middle between the pancakes, there is some sort of berry flavored cream (cream cheese based?) which makes everything taste even more delicious. The skillet comes with a fair amount of food, especially when paired with the upgraded pancakes. Come hungry! (or if you're not, you might even possibly be able to split a skillet+pancakes with someone)<br><br>I never got a chance to try out the Millenium Park Wildberry location before this, but I'm glad there's a Wildberry close to me now.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ooDvqhgsRSdRgXqJqaVzxg/348s.jpg", "caption": "Mexicana hash! Delicious!"}]}}, {"review": {"des": "The pancakes here were really nice. Fluffy and good flavor. Not too dense and even with the toppings they were not too sweet. I also tried one of the skillets with lots of veggies and the portion was big and it had good flavor. Definitely would go back and it's conveniently<br>Located next to water tower place.", "pics": null}}, {"review": {"des": "Pancakes were light and fluffy and delicious. Eggs were good and so were hash browns. Wished hash browns had a little more seasoning to them. This is a good restaurant but does get very busy. Join the wait list ahead of time so you aren't waiting for an hour. My only issue with this restaurant is that they don't serve alcohol. I think it's not okay to call yourself a brunch place and not serve mimosas.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Fkfi6D8gn5wl89ZAL97V0A/348s.jpg", "caption": "Spinach and avocado omelet with hash browns and buttermilk pancakes"}]}}, {"review": {"des": "Solid brunch spot in Chicago for sure! The wait is totally worth it once you walk inside and smell the food. The portions are great and there are menu options for everyone. The workers here really do try their best to accommodate the large amount of crowds and are very efficient, cleanly, and friendly.<br><br>We ordered the Slow Cooked Brisket with a side upgrade to the Signature Berry Bliss Pancakes and the Butcher Skillet with a side upgrade to Cinnamon Roll Pancakes. <br><br>Both of the entrees were phenomenal! Incredible flavorful all around, perfectly cooked, and the presentation made our mouths water instantly once they were placed before us. The Pancakes were both very delicious! Their Signature Berry Bliss Pancakes are famous for a reason! The Cinnamon still Pancakes were deliciously cinnamony, but not overly sweet either. Using the maple syrup is totally optional, because the flavors are already so yummy!", "pics": null}}]}