{"name": "wilde-bar-and-restaurant-chicago", "reviews": [{"review": {"des": "Good restaurant in the area if you're looking for more of sit, relax, and take your time kind of spot. Ambiance is cool and I'm a big fan of their cocktails (different martinis). <br><br>However, I find the food to be overpriced for what you get. I suggesting not getting the burgers- they seem pretty bland. You'll also pay $16 for a salad you can make at home.. but I still order them. It's more-so a shared appetizer and few drinks kind of place in my opinion. <br>They do have great brunch on Saturday and Sunday! And the French onion soup is great.", "pics": null}}, {"review": {"des": "This place is alright. Really spacious interior. Most of the food I've had there is decent. Have had the fried Brussels sprouts and then the Irish American breakfast. I really liked the breakfast it was hearty and a decent portion. The fire place is on when it's cold out and you can sit by it. In the summer there's a sidewalk patio and they open the giant windows so you can also sit half inside half outside. <br><br>Have tried their Bloody Mary and Bellini. They're fine. Bloody Mary comes with a pony beer thing.", "pics": null}}, {"review": {"des": "I walked into Wilde and was immediately happy I made my first trip there during the Halloween season. The orange lights and leaves were a cute and subtle nod to the spooky season, which I love. Does it really matter in the big picture? Nope. But I really liked the dark, cozy atmosphere with the touch of fall. <br><br>A friend and I walked in around 7:30 on Wednesday night and were seated immediately. Our waiter brought us our water and took drink orders pretty quickly after we sat down. (Water by request only, because #SaveThePlanet, which I thought was nice.) The wine list is pretty limited; it's more of a beer and whiskey place, after all. You can find the wine in the very back of the drink menu.<br><br>I ordered the Wilde burger, while my friend ordered the GF Mac and cheese- she raves that it's the best thing there, so she ate the side as her entree. Clearly I'm missing out, so I'll make an effort to try it next time. My Wilde Burger was good, but could've used more whiskey glaze and caramelized onions. The sandwich was a little dry, so I think more sauce would pull things together. The side of French fries was big, but SO good. I happily ate them all- perfectly salted with just the right amount of crunch.<br><br>I can see myself coming back a few times this fall/winter with my whiskey-loving boyfriend for a casual meal when we're looking to get out of the apartment. It's a great option to duck out of the cold into a cozy pub for the evening.", "pics": null}}, {"review": {"des": "Finally checked this place out Friday night for dinner around 7pm. The place was packed and we were told about a 25 minute wait and they put me on their texting system, which I always appreciate. Right around then, we were seated. As others mentioned, their ambiance and vibe is lovely and warm and cool with the literary theme. Our server was friendly and helpful. All their staff was on point from the hostess to the busboys.<br><br>I went with the chicken pot pie as boo had the full rack of ribs special. We never had to wait for anything too long and we were regularly checked upon. That chicken pot pie was solid and quite perfect. I loved the thin flaky crust and wasn't as heavy as you may find at other places. Gravy was perfect along with the chunky pieces of potatoes and chicken. It was just a very good chicken pot pie and nothing more. The ribs were enjoyable and decent, along with the accompanied fries and slaw. We also had the pumpkin cheesecake and this was quite good as well.<br><br>Overall, while Wilde may not have the best food especially for the higher price tag, they are definitely a go-to as it is still very good, reliable, and consistent with great service, all in a wonderful ambiance. Simple food done very well. They also have a great menu with veggie and GF options. Will gladly come back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EB-KykXDumUW2Afyr5pm8g/348s.jpg", "caption": "Chicken pot pie"}]}}, {"review": {"des": "A second 5 star review from me. Again, love the beer flight options - Pursuit of hoppiness and the Importance of being Irish. This time, we had the curry fries (holy yum!) and Asian salad (also super good). Great flavors. <br>Also a heads up, it can be loud for conversation on weekends so if it's a nice night, try to sit outside!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yplDAANaq5mrZ_wdWgphew/168s.jpg", "caption": "The Importance of being Irish beer flight"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XaqU7D-Tb1IehVbgdjLxkw/168s.jpg", "caption": "Flat bread, curry fries, and Asian salad"}]}}, {"review": {"des": "This place is very cute! So many different seating options and ambience to choose from. I had dinner with one other person. We split Buffalo Hot Wings with ranch for an appetizer and I had the Drive Thru Burger. Everything was delicious! Service is friendly, but a little slow. Food came out fairly quickly; however, we had to wait rather long on refills and the bill. That is my only complaint about this place.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GLb84XaxKRKDUpXSvueTGw/168s.jpg", "caption": "Chicken Buffalo Hot Wings"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/btrWregFZRfVoD1-dUvGng/168s.jpg", "caption": "Drive Thru Burger"}]}}, {"review": {"des": "I came here with my parents for bunch after moving into my new apartment. The place was very crowded, but still had some empty tables. We were seated at a booth. The decor has a library feel with a stain glass piece on the ceiling and old movie/show posters on the wall. <br><br>As soon as we sat down, a gentleman put down a plate of fresh banana bread, which tasted amazing! Shortly after, our waitress came by to take our drink order. There's so many options on the menu. <br><br>Drink: raspberry ice tea. The first few sips the drink tasted like normal ice tea. After mixing the drink with a straw, there was a light raspberry flavor. <br><br>Entree: breakfast burger. The burger was piled high with thin fried onions and an egg. The curry sauce and ketchup were in small containers on the side. The burger was cooked more than I am used to (I like medium rare. I say the burger was more medium) and the burger itself needed a bit more salt. Otherwise the burger tasted good with the sauces. The fries were amazing and very addicting! <br><br>Overall, it was a nice experience and I would love to try the other menu items.", "pics": null}}, {"review": {"des": "Very impressed by Wilde. The beer selection was massive, and if you like sours, the Upland Peach Sour they currently have on tap was amazing. <br><br>Additionally, the artichoke dip was solid and the curry mussel appetizer was phenomenal: about two dozen steamed mussels served in a light brown curry sauce. Can't recommend that dish enough for people that enjoy shellfish.", "pics": null}}, {"review": {"des": "We love it here. I recommend Wilde to my friends who are vegetarians because there is an entire vegetarian menu. I think it puts a lot of people's minds at ease when they know they have veggie options. <br><br>I have been to Wilde many times and have lots of menu favorites. The turkey burger is delicious. It has a lot of flavor and is very tasty. I love the sweet potato fries! Those are a must order for the table if you don't get them as a side order yourself. They come with a maple syrup dipping sauce that really makes them a sweet treat. <br>The macaroni and cheese is very good. It's not too heavy and can definitely be shared between two people or for the table. <br><br>I LOVE the French onion soup. It is exquisite. The portion is very generous and has lots of flavor. <br>Service is generally pretty good here. Definitely a place to enjoy some drinks and good times with friends. It feels homey and you won't want to leave.", "pics": null}}, {"review": {"des": "My favorite restaurant in Chicago. Yes, that's a bold statement, and yes, it's true. Great food, drinks, and ambiance. Just my style. So happy I live close, but my girlfriend gets annoyed that I only want to go here for dinner and not try out new places. Whoops", "pics": null}}, {"review": {"des": "I always go here with the hopes that the food is going to be good... unfortunately, it's always just mehhh.  It sucks because the atmosphere and vibe of this place is great!  It's a very swanky place and would be a perfect fist date night spot if the food was good.  Only thing worth getting are the burgers<br><br>I def recommend the drinks though.  They always make really good cocktails.", "pics": null}}, {"review": {"des": "Wilde is a great neighborhood spot for any meal - I've had brunch a few times as well as dinner and never been disappointed. The breakfast burrito was delicious and the service was great. I've also tried many of their sandwiches which are great. Definitely recommend Wilde if you're in the neighborhood.", "pics": null}}, {"review": {"des": "I've had the chopped salad several more times and it does always seem to have rubbery chicken. The veggies are pretty plain (but I like them a lot!), but the dressing is what keeps me coming back. I love whatever they put in it! <br><br>There is nice seating outside.", "pics": null}}, {"review": {"des": "Wilde earns my top spot for coziest restaurant in Chicago. If you get really lucky or choose to wait longer, you can get a seat in the \"library,\" which is a small semi-gated area with tall bookshelves and a fireplace. Can't get much cozier that that. There are only a few tables in the library, but I'd request a table there if the wait isn't significantly longer. Even if you're not in the library, pretty much any seat is still cozy, especially the booths (which give you a decent amount of privacy). What's more, around the holidays, they put up Christmas lights everywhere which really make the place feel special. The restaurant is named after Irish poet Oscar Wilde, so it also has a subtle literary theme.<br><br>Alright onto the food: if you go with other people, highly recommend getting the curry fries to start off. It's a yellow curry that is liquidy, slightly sweet, savory, and with a very slight spice kick. For the main course, my favorite is probably the chicken pot pie (but hey, I'm a sucker for chicken pot pie). It's a solid portion size, complete with lots of chicken, veggies, and--the best part--a huge flaky crust.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HiHWSM38vFcFoD5flsTjKA/348s.jpg", "caption": "country chicken pot pie"}]}}, {"review": {"des": "Mostly just been here for apps and drinks, but each time has been a great experience!  They make this one cocktail with black tea infused vodka, st. Germain, and champagne, and it is sooooo delish! i have tried in vein to perfect it at home, but i still got some work to do ;-[}<br>nevertheless, the bartenders are very personable and the rest of the staff as well.  the ambiance is super homey.  you can go watch a game, or sit and chat with all your mates. <br>I'm excited to try the food, as it looks tasty.", "pics": null}}, {"review": {"des": "Wilde is my go to neighborhood restaurant. I've been to a few Irish pubs in Dublin and the ambience reminds me of those pubs. Service is attentive and knowledgeable. Food is great, extensive menu and the list of beers is pages and pages long. Great easy go to.", "pics": null}}, {"review": {"des": "Wilde is so underrated in my opinion. I cannot get over how delicious the food is here and I just love the atmosphere. It is definitely one of my favorite bar/restaurants in the neighborhood and I am ashamed I have not frequented it more often but that will change. <br><br>I've been in a few times for drinks but prior to last night I had only been in once before for the food and do remember enjoying it. I was happy to have the chance to taste more of their delicious menu last night. <br><br>I wish I had some photos to share but I was on a date and my rule is always to have my phone away and give my undivided attention. Anyways, we shared the crispy Brussels sprouts, the mac and cheese with bacon and tomatoes, and the bleu on bleu burger. Everything was insanely delicious, especially the mac and that burger! And I do dare say, I liked this burger much better than the hyped up Loyalist burger (I still love the Loyalist but I have to keep things real).<br><br>We also had a few drinks.... I enjoyed whiskey on the rocks and my date had a vodka tonic and then a beer. All was good. We both enjoyed everything from the drinks to the food to the space/atmosphere, and company. <br><br>I highly recommend Wilde and I will definitely be back soon. I need to check out their brunch next. Until then I will be thinking about their mac and cheese and that delicious bleu cheese burger!", "pics": null}}, {"review": {"des": "The ambiance here is just cool. There are oscar Wilde quotes everywhere, a couple  of cool bars, a library area with books and jus a great vibe. It's a large room but it's gets very full on Friday night. That is good sign. <br>As to the food they have a very eclectic mix of old standbys, burgers, fish and chips, sandwiches, meatloaf and a shepherds pie. <br>I had burger which was a very hice high quality meat with little grease, served with excellent fries. The salmon with a beure blanco sauce served with mashed potatoes and asparagus was excellent. The fish and chips (ALso served as a haddock sandwich) was a nice white fish nicely breaded and served with more of the excellent fries. <br>the best thing that must not be missed was they Brussel sprouts. They are crispy, served with bacon bits and more than enough for 4 people to share as an appetizer. This dish takes veggies over  the top: the service was so so but the food and ambiance makes it's worth it.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_d8NutGrdXDqsDzxjOHD8A/348s.jpg", "caption": "Sprouts"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yErw6QUExl1P2FThM2HwUg/168s.jpg", "caption": "Allahash white ale"}]}}, {"review": {"des": "Love love Love!<br><br>Service was amazing (from host, bussed, and server), food selection and presentation was fantastic; but my absolute favorite thing is the decor.<br><br>Very classic, warm, inviting and fun.<br><br>We will be back.", "pics": null}}, {"review": {"des": "I love this place! The ambiance alone is worth coming for. They did a wonderful job taking Oscar Wilde's persona and manifesting it into a beautiful and timeless decor.<br><br>This is a great place for fair prices and decent food in the city! Their sweet potato fries, buffalo chicken sandwich, and artichoke dip are great. <br><br>If you want a place that is fairly priced, unpretentious, but delivers on good flavors and a beautiful ambiance, this is your place", "pics": null}}, {"review": {"des": "So I've been meaning to get around to this place since I'm moving out of town and I've heard good things about their veggie options. I went last night with a friend and sat in the 'library' which is a grouping of tables in the back surrounded by walls of antique books. It had a very rustic and weathered feel to it that i very much enjoyed. & if you want to sit outside they have a small patio with a few tables. The service was good and the food was good. The only comment that I'll add is that the Buddha Bowl on the menu is not a Buddha Bowl but rather a stir fry. It wasn't bad, but it wasn't what I was expecting when I ordered a Buddha Bowl. Only recommendation would be to make that menu item a little more clear. Other than that, I would come here again and maybe give the black bean burger a try!", "pics": null}}, {"review": {"des": "A great Sunday brunch spot, bring the dog to the outdoor, sidewalk patio. Great service, great food!", "pics": null}}, {"review": {"des": "Epitome of overpriced bar food.  Hurrying to go to a movie and there are like literally three waitresses who I made eye contact with just standing around talking.  They could have easily come over because our waitress was busy.  Probably for like 15 mins they were just idling talking.<br>Turkey burger was so small.  And super dark in there, I don't want to sit in a dungeon in the middle of the day.   We were hungry so we just ate our meal and bailed.", "pics": null}}, {"review": {"des": "Ordered the Rosemary Chicken it was loaded with oil and butter!  The entire meal that I waited 1.25 hrs is so gross and nasty.  Then the manager say I will have to ask the Chief?! Really???", "pics": null}}, {"review": {"des": "Love the atmosphere at this bar.  It's dark and cozy, love the fireplace inside in the winter.  Plenty of seating at the bar.  In the summer, the sidewalk patio is gorgeous.  Only complaint is that they do not accept reservations so I hesitate to go on weekends for dinner.  Their menu is not very extensive and not very exciting although what I have eaten was pretty good.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/To76Z64f8HpqtWpzGlIkvw/168s.jpg", "caption": "drinks at the bar"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/r1_m8TqFOOyCmjaN_FF-nA/168s.jpg", "caption": "fireplace is very cozy"}]}}, {"review": {"des": "Food decent and Service Horrid Folks!  <br><br>There is a lot to be said for the food quality and atmosphere of this place.  I like it.  Cozy, warm and solid food with a good gluten free menu.  <br><br>Let me tell you about the service and drinks- indignant and flaccid. Yes. <br><br>Our waitress was very inattentive.  Came around occasionally. Seemed generally bothered if we had a question or needed something.  We were pleasant and hadn't seen each other in a long time. So, we were more concerned with reconnecting than the salty attitude.  <br><br>I had been drinking some martinis.  They were weak and overly sweet. I had asked that they be less sweet and on the stronger side if possible. After two of those, I asked for a vodka floater and that was the trick!  I mentioned it to my waitress - I should have known better.  She made a snarky comment that I could talk to the bar manager if I wanted to.  I wasn't complaining.  I was just saying that they might want to revisit their recipe because the place is great and would do even better if the drinks hit the mark.  <br><br>So, the bar manager came over to talk. I was nice.  I wasn't obnoxious or frankly buzzed from the weak martinis.  I explained how we ordered a floater and that it felt like I was now having a proper martini.  She was obstinate in the feedback and pretty much didn't care to hear it.  We weren't really offended UNTIL we wanted to order another round (willing to pay for the floater) and we were told that we weren't going to be served anymore.  <br><br>Really?  Wilde.  We can always get better.", "pics": null}}, {"review": {"des": "Oh my god this place is adorable.  It's aptly named because its namesake would probably have been sitting at the bar drunk or writing in one of the many leather chairs.<br><br>From an ambiance perspective it's got everything you need for a classy and cozy date night or tete-a-tete with friends.  There is sidewalk seating for an open-air feel, when I was there they had the patio open so you could get a semi-covered seat overlooking the sidewalk, but the real coziness can be experienced inside, where the book-filled mahogany shelves that loom over deep plush and leather armchairs make you feel like whipping out a cigar in a Churchillian homage because that dude would have set up shop here too.<br><br>The bar is well-stocked.  I actually had a glass of their Carmenere - one of the few places I've seen that sells this illustrious grape with a fascinating backstory (check it out on Wikipedia!).  They have really neat flights of wine, beer, and whiskey, which is a great way to experience multiple things for those of us decision-challenged folks.<br><br>Service is responsive and fast without being overbearing.  They kept an eye on us but didn't interrupt the flow of conversation for unnecessary check-ins, which I loved.<br><br>I didn't try the food - YET - but I'll be back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/p52UCWksRbv3SNfXyU-Ymg/168s.jpg", "caption": "Large fruit bowl"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gK1wp5PirVzMi8XVvQoRfw/168s.jpg", "caption": "Two eggs, cooked in either a heart or a butt shape - you decide"}]}}, {"review": {"des": "Probably one of my favorite restaurants in Lake View, and definitely will become a top future option for any dinner occasions. The inside is super well decorated and really cozy. The food matches the awesome decor. The lobster mac and cheese is incredible, very generous on meat too; you can tell it's not made with that powdery stuff. The chicken pot pie is also amazing; the inside was good but it was the fluffy biscuit on top that was the real deal - it's so flaky and buttery, just never had anything like it before. Shepard's pie is also recommended; pairs great with that garlic bread.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZOKqO7KE1FyBQhDy8jBd0Q/348s.jpg", "caption": "Mac and cheese"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DdWIxBOs0mH4ijZJlkkbig/168s.jpg", "caption": "Shepherds Pie"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YHXt3vyLKrjCetRqO2DnsQ/168s.jpg", "caption": "Chicken pot pie"}]}}, {"review": {"des": "This place was awesome! I came here a few weeks ago with friends while visiting and we were promptly seated at a booth. Our waitress was super friendly and got us served fairly quick. I got some sort of strawberry mixed drink that was on the menu and it was tasty and strong! <br>My friends and I split the goat cheese flatbread which was a perfect sharing portion for 3. My best friend and I shared the country chicken pot pie and it was MASSIVE! Seriously only order this for one if you're legitimately starving. We got some stir fry veggies on the side to split.<br>Overall great little place to have dinner and drinks with friends!", "pics": null}}, {"review": {"des": "Came here for a Meetup and place was about half full. Ordered a beer flight ($15) and others at the table ordered various cocktails. Prices seemed a bit high and service was to-do. May have just been an off night. <br><br>Good atmosphere though and might give it another chance to see how the food is.", "pics": null}}, {"review": {"des": "Visited this restaurant while I was in town with my daughter. She took me there because she says it's where everyone takes their (visiting) parents. I guess it's because the room is spacious, cool, and quiet (so you can chat over your meal). I'm of an age where blaring music and tacky décor is not my thing. <br><br>The food was delicious. Daughter and I split an appetizer of wings, Caesar salad, and the curry chicken entrée. The wings where the winner. I love baked wings! Not the greasy, breaded, orange coated garbage you get at some other places. <br><br>The wait staff was adequate. If I were the owner/manager, I would look into maybe having a staff with a little more life to it. Kinda seemed like everyone was either hung over or super tired. Taking one star off for sluggish waiter. :-)", "pics": null}}, {"review": {"des": "Wilde Bar & Restaurant is a lovely restaurant in a popular neighborhood. It's the kind of place that looks nice, but that doesn't usually impress me because restaurants of its sort tend to have the same menus over and over and over and over. Standards include a Cobb salad and a burger. Yippee. However, Wilde Bar & Restaurant slips in a few surprises. First, we truly enjoyed pan roasted beats with \"goat cheese fondue, toasted pink peppercorns, [and] candied lemon\" along with crispy Brussels sprouts served with \"maple vinaigrette, bacon, [and] bacon aioli.\" How refreshing to find non-fried vegetable appetizers on a menu! Also, there was an option for a half of an elevated grilled cheese along with a generous cup of delicious tomato basil soup. It was so nice to be able to indulge in cheese while also getting lots of vegetables in the same meal! In addition, the service was excellent. I don't often go out for American food since I can make it at home, but when I meet others for American food in the future, Wilde will be on my list of suggestions.", "pics": null}}, {"review": {"des": "I've enjoyed Wilde's food and ambience before, but my experience here yesterday left me with an awful taste in my mouth.<br><br>I walked in with a party of four at 3 pm on a Saturday afternoon -- hardly a peak time, but the host seemed unhappy to see us, and dumped us into a four-top by the (non-working) fireplace by the door, which put us directly in the path of the chilly gusts of wind that blew in every time the front door opened. (This despite the fact that there were numerous booths and tables available in far warmer and more comfortable areas back inside the restaurant.)<br><br>We might as well have been in Siberia, as far as our server was concerned. He showed a similar disinterest in serving us -- we had to wait about 15 minutes before he even came by to take our drink order -- and then completely disappeared when it was time to ask for our check. Two of our party actually went looking for him, to no avail; we finally had to ask the hostess (who had replaced our earlier host) to track him down -- and when SHE couldn't find him, we had to ask another server to seek him out (or at least find our check). <br><br>Our guy finally reappeared, and tossed our check at us without any apology for the wait; he didn't bother to say \"Thank you\" when he returned with our credit card slips, either. I guess we'd interrupted his beard-grooming time, and he was pretty annoyed about it. Not to worry, friend -- we won't coming be back!", "pics": null}}, {"review": {"des": "I've never had a bad experience here! The have a wide variety of food and drink options (including a vegetarian menu). The service is usually on point and the patio/window area is beautiful in the summer. The bathrooms are extremely dark though, thank goodness for phone flashlights these days!", "pics": null}}, {"review": {"des": "Came for the mac and cheese but couldn't resist getting the ultimate grilled cheese with tomato soup. The tomato soup had a great flavor and was served hot! <br>The grilled cheese is good and the bacon and crispness of the bread gives a nice texture. I feel that the Parmesan crust on the sourdough doesn't really add much though. It just makes the bread greasy on the outside. Would recommend if you like grilled cheese, but it was nothing out of this world. <br><br>Will have to return for the mac and cheese!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NIWWadgoF6n1md144emLMQ/168s.jpg", "caption": "1/2 ultimate grilled cheese with tomato basil soup - decent"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bht4eGJzHlG4oIPTVlUdlQ/168s.jpg", "caption": "1/2 ultimate grilled cheese. Pretty good"}]}}, {"review": {"des": "This place was great!<br>I was really, really, craving a chicken pot pie.<br>I yelped chicken pot pie and viola Wilde Bar came up.<br>It was a Sunday around brunch time, it was my husband, myself and our adorable 2 y/o.<br>Walked in, first of all the hostess was very sweet didn't catch her name though.<br>The bar has a very laid back feel to it, it was a very family feel there were families with children, couples and larger parties there.<br><br>While I was very upset that they don't serve chicken pot pie during brunch I was pleasantly surprised by the deliciousness of the food.<br><br>I ordered the blackened chicken, so good.<br>My husband ordered the custard French toast which was decadent, light and delicious.<br><br>I will definitely be going back after brunch hours for the chicken pot pie.", "pics": null}}, {"review": {"des": "Will definitely return as the fantastic food matched the classy but homey atmosphere. The only thing preventing the fifth star is that it felt pricey for the portions and overall dinner.<br><br>The drink menu is pretty good, more or less in line with what you'd expect for an Irish bar but nothing wrong with that. <br>I opted for the salmon sandwich while my gf got the fish sandwich. Both were excellent. The fish sandwich was basically a smaller portion of fish and chips on a bun with some good sandwich additions. <br>For me though, the salmon sandwich was even better and certainly a more unique option. The portion of salmon was good and the rosemary peppercorn oil and mustard aioli were superb. Full of flavor.<br><br>Will definitely be going back...tho maybe not super often as it was a little on the pricey side.", "pics": null}}, {"review": {"des": "To me Wilde gets a 4 star for atmo and food quality/taste and a two for value. <br><br>I've been here several times but it had been a few years so on a balmy fall evening, decided to check it out again.<br><br>We ordered:<br><br>1. Sazerac<br>2. Glass of Sangria<br>3. Mushroom and Chicken Flatbread<br>4. Soup (Mulligatawny) and Side Cesar<br>5. Pint of Rev Brew's Oktoberfest  <br><br>Bill - $55<br><br>That in and of itself isn't bad but considering the \"shot size\" Sazerac at $12, the Soup in a miniture size \"bowl\", Flatbread the size of a Small pizza anywhere else, this place failed to deliver.  Food was tasty but for nearly $70 (with $10 tip) you're gonna need to bring me more. Sorry.", "pics": null}}, {"review": {"des": "This is my favorite go to restaurant in the lakeview/Lincoln Park area! I am a regular and dine here at least once a week. Wilde has the best comfort food and a vast menu including a vegetarian and gluten free menu. The staff is always great and the atmosphere is awesome. Highly recommend!", "pics": null}}, {"review": {"des": "Wilde would never make it to my long or short list for brunch spots. In fact, it wouldn't make it to those lists for Irish pubs. If someone in bumblef*ck decided to open an Irish pub this would be the place to go. If I were in bublef*ck, you can bet your bottom dollar that I'd go to Wilde and I'd probably thank my lucky stars for it too!<br><br>But Chicago isn't bublef*ck and I can throw a stone and find a decent Irish pub. While that stone is still in the air, it would pass by a decent brunch spot. <br><br>Wilde isn't terrible. It looks lovely inside and the service is great. They were prepared for our large party for brunch and then gave each of us a separate bill. Top marks for that!<br><br>It's just that it's really not an Irish pub. They didn't offer a traditional Irish breakfast and there was no black pudding anywhere to be seen. And the food that it did have wasn't exceptional. I had the beet salad with a side of bangers. I didn't care for the beet salad but the bangers were good. M enjoyed the macaroni and cheese but didn't like her mimosa.<br><br>According to Yelp's measurements, two stars equals \"Meh. I've experienced better.\" That I have. If it weren't for my large party for brunch, I would never go to Wilde.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pjU1di7hsjVt1jntCPesDg/348s.jpg", "caption": "Bangers  (back) and Beet Salad (front)."}]}}, {"review": {"des": "Pretty good option for brunch especially when you can nab an outdoor table...<br><br>Had the crab Benedict which was fine- poached eggs had a properly run yolk and the hollandaise was well seasoned.  However the crab cake was just ok, the asparagus underneath seemed out of place and the english muffin was a little too chewy (read my knife wasn't sharp enough to cut through without some serious elbow grease)... Came with a side of potatoes that were good as well... <br><br>Service was solid and didn't hear any complaints around the table...", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Uq0RpYcAQxOcS64tMhqT1w/348s.jpg", "caption": "Crab benedict"}]}}, {"review": {"des": "-Cozy Irish pub--great atmosphere with dark wood paneling, fire places, and even an old library area.  There's lots of Oscar Wilde and other Irish-related paraphernalia.<br>-The place is always decked out for the holidays--tons of lights, wreaths, and other Christmas decorations.  And of course they have all the fire places going.<br>-All the staff are always extremely warm and friendly.<br>-They poor a great classic pint of Guinness.<br>-Extensive menu with lots of pub standbys.  They also have great specials for the holidays--we especially enjoyed the bison pot roast and beef Wellington.  You can definitely get some hearty stick-to-your-bones fare for a cold winter's night.<br>-We tried a peppermint ice cream pie for dessert--and it was the perfect way to end our holiday meal.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wFpP5ejQO8aCibEm3P4fdg/348s.jpg", "caption": "Beef Wellington special"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6DxkGVl5lHuxhXB4Ek-75w/168s.jpg", "caption": "Halibut special"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/S6JzIU6LhsaQTnBUUfiRgg/168s.jpg", "caption": "Fireplace"}]}}, {"review": {"des": "I've long been a fan of Lady Gregory's and finally decided it was time to check out their sister restaurant Wilde! The verdict? It's just as good if not better! <br><br>The library themed interior was really cozy and cool. I couldn't stop looking around the entire meal! And the flower-lined patio was a nice touch too. BUT THE FOOD. Omg. Maybe absence makes the heart grow fonder, but I swear the gluten free artichoke dip tasted even better here than it ever has at Lady Gregory's! The gluten free mac 'n cheese was amazing too, and my boyfriend loved the bison burger. The gluten free menu here is so expansive, but I never can seem to branch out. And the little flags in gluten free food make me feel so safe dining out! <br><br>Without a doubt, I know that Wilde will become a go-to restaurant for date night, when I'm craving artichoke dip, or just when I'm sad and want to be happy.", "pics": null}}, {"review": {"des": "I was here for a drink and dinner with my friends and this place is so cool! Just when I thought Broadway couldn't get any better, they give us Wilde!<br><br>I shared the Lobster Mac & Cheese with my friend and I don't think I can ever order anything else on the menu because it was SO. DAMN. GOOD. I wish I remembered which drink I ordered because it was florally and delicious! Oh well. All the more reason to return!<br><br>The lighting is very dark and it seemed like there was lots of seating as well. Great patio for summer, too.", "pics": null}}, {"review": {"des": "Tried the mussels. Very thick sauce. Go to Dry Hop if you want awesome mussels. <br>Tried the red wine flight. Very pleasant.<br>Loved the France St Cosme Cotes du Rhône. Very good wine. Our waitress was great.", "pics": null}}, {"review": {"des": "I go to Wilde pretty often these days- once every few weeks.  High quality bar food, efficient and friendly service.  I'm gluten free and vegetarian and the restaurant is great about dietary restrictions and preferences.  I also really enjoy their drink list.", "pics": null}}, {"review": {"des": "Had a very enjoyable brunch.   The French toast was very good (I always add a little side of bacon  to make to make it feel like brunch). Other table mates had the Skillet and were very satisfied.  Decor is delightful and service was great.  <br><br>We will be back!", "pics": null}}, {"review": {"des": "I have chosen to give a 3.5 star review for the following reasons:<br>I'll start out with the pros:<br>The food was delicious per usual. We had the Brussels sprouts, mac and cheese, and spinach artichoke dip. All were a great hit at our table, especially the dip. <br>I had the spicy chipotle turkey burger. The burger was good very juicy you can't go wrong with a side order of sweet potato fries. <br><br>The cons: <br>I could hardly taste  the chipotle mayo on my burger. <br>Also, out  server was friendly and very informative but overwhelming. She was too persistent in rushing us to order. She would ask us how everything tasted prior to us taking a bite. It took us some time to grab her attention to order another drink once our meal was out. <br><br>However, the food is worth going back for.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bRHZkgV8sw79eFnspgYHEA/348s.jpg", "caption": "Chipotle turkey burger & sweet potato fries"}]}}, {"review": {"des": "Got the buffalo wings. You could taste how gross the wings are and how old they were. Bit into one piece and I could smell the gross smell of old unwashed unclean chicken. Don't get them. Like the ambience of the place, the waiter was nice and sweet. So was the manager who came to the table to ask about the chicken. So good management, but something shitty is going on in that kitchen. So they should probably check that out. ASAP. Bad chicken is bad chicken. And a baby can tell that.", "pics": null}}, {"review": {"des": "Absolutely terrible service. My boyfriend and I came here on a Wednesday for dinner when the place was maybe half full. We were sat for 15 minutes before anyone brought us water, then waited an additional 20 minutes and no server ever showed up. Almost 40 minutes to get 2 glasses of water. I was so excited to try this place but we ended up leaving & going to the bar across the street instead. Don't waste your time here.", "pics": null}}, {"review": {"des": "Enjoyed sitting outside and sharing drinks and appetizers before seeing Blue Man Group around the corner.  Crab cakes and the beets were the standouts but everything we ordered tasted great.", "pics": null}}, {"review": {"des": "I enjoyed this place. The chicken pot pie was fantastic.. I liked sitting by the area by the fireplace too. Its a lot more private and easier to have a conversation over there", "pics": null}}, {"review": {"des": "I have never ever ever had a bad meal here. <br><br>1) the setting is gorgeous. I love sitting near the outside<br><br>2) plates like the grilled cheese, chicken pot pie, burger, chicken avocado wrap are PHENOMENAL<br><br>3) it's always fun to try a new drink! Their cocktails are excellent<br><br>Not sure if the owner checks reviews but I'd be very curious as to why they got rid of the bison burger. <br><br>Regardless, this is a neighborhood hotspot. Whenever I have family or friends in town I always take them here!", "pics": null}}, {"review": {"des": "Such nice space and an interesting menu but ultimately a disappointment.  Service was slow, beer when it came was flat and no longer cold. This was he first \"chopped\" salad I've ever had that wasn't even chopped. \"Garlic herb\" dressing had no flavor. My husband's eggs Benedict were dull -- the crab was deep friend in batter and tasteless. Potatoes were chewy and cold. <br><br>This was my second and last visit. Only good thing was seeing Uruguay beat Portugal", "pics": null}}, {"review": {"des": "I love this place. I've been here probably a dozen times now and have had a great experience every time. HIGHLY recommend the Brussel sprouts! I make everyone I bring here try them. Other favorites are the salmon sandwich and the Rueben. Other reviewers said it best: unpretentious, underrated, good vibes, and delicious.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/w7rpXmKXpdagskcgyDwAHA/348s.jpg", "caption": "Brussel sprouts with the aioli on the side."}]}}, {"review": {"des": "We stopped for lunch while visiting family over Christmas.  Another great experience and meal at this place.<br><br>The menu is chalk full of comfort food selections.  I had the grilled cheese and tomato bisque....both excellent.  The burger is huge and prepared very well.  All sides were plentiful in portion size and prepared as well.<br><br>Decor is comfortable and a throwback to an era gone by.  I enjoy sitting and relaxing during a meal.<br><br>Service is prompt and very friendly.  You never feel rushed at this restaurant.<br><br>All in all, two thumbs up!  Will visit again when in Chicago.", "pics": null}}, {"review": {"des": "My wife and I went in for a 1:30 PM lunch, right at the end of brunch. Overall, I was impressed with the architecture and environment of this restaurant. The food was great, I got the grilled chicken club with mixed greens and fries. My wife got the buffalo chicken sandwich. We didn't order alcohol, just my wife got an iced tea and I stuck with water. In the beginning I wanted to order mixed greens along with fries and wanted to pay extra to make they happen. I think I didn't communicate this clearly to my server, because she thought I only wanted the salad. No big deal. I asked for fries too.<br><br>One thing that irked me was that she was checking our neighbors more than us, even when my water out. I would have appreciated a few refills. In the end I was happy with the food, but not the service. I will give them another chance.", "pics": null}}, {"review": {"des": "I don't get the hype over this place. The library is cool, and the food is all right (though over the past two years I've noticed a decline in quality), but the service is abysmal. Be prepared to wait for a long time for food.", "pics": null}}, {"review": {"des": "This place is an absolute gem. I thought the booths would be the best seat in the house but they are actually not! We were seated in a corner near the books and the fireplace that faced the TV's if we wanted to watch. <br><br>The chairs were comfortable enough and the table was large enough to allow two entrees, an appetizer and the typical table decorations.<br><br>The food was amazing, the ambiance was awesome, and the customer service was good enough to create a magical experience. I enjoyed myself and everyone enjoyed their food. I was glad we walked by even though they were super busy they handled the crowd well and it made me and each guest at our table feel important. <br><br>I will definitely try this place again.", "pics": null}}, {"review": {"des": "Very good food! Onion was was amazing and the atmosphere was just unmatched.  Perfect central Lake View location.  Would go there again sometime!", "pics": null}}, {"review": {"des": "The vibe here is very cool. It's big, yet intimate, and the library theme is done very well. The staff was friendly enough. Bloody Mary's were yummy.<br><br>Food on the other hand was very mediocre. We tried a bleu cheese burger and buffalo chicken sandwich. The burger didn't really taste at all like bleu cheese and the buffalo chicken sandwich was a little dry. The fries were good, but not super plentiful. Overall, good. Not great.", "pics": null}}, {"review": {"des": "Wilde is a dim lit & laidback atmosphere. Whether you're eating dinner or brunch, it's a very comfortable vibe. On this visit, I sat at the bar & ordered a Bloody Mary. It had a nice kick too it and the garnishings on it were delicious- my favorite being the cherry pepper which I had never tried before. I would definitely recommend Wilde if you're looking for a casual place to have a few drinks with friends.", "pics": null}}, {"review": {"des": "Nice place to hangout! Nice staff!!!<br><br>It can get buzy on weekends, but you can still have fun though.", "pics": null}}, {"review": {"des": "First time at Wilde. Upon entry, no one at host stand but did not matter since I was able to find my party. <br><br>Service: was friendly/cordial. Sat towards the back where there were a handful of clients... and constantly heard a worker talking loud on her cell phone and that continued after the phone call ended. It was a bit annoying to hear her throughout the entire meal. <br><br>Assistant to the server: served the food to the correct person and was more present than the server. <br><br>Food: chicken was dry... wild rice was salty and tasteless. <br><br>Decor: appealing though a bit dark since it was not evening and the bathroom needs more lighting.", "pics": null}}, {"review": {"des": "I made a reservation requesting a booth via Open Table on a Wednesday. We showed up ten minutes early on Sunday, gave our name to the hostess saying we had a 6:00 pm reservation. The hostess looked around and informed us that no booths were available. She said she was aware that I had requested a booth. I asked to see other available seating. We walked to the back and I spotted an empty booth. I asked about it and was informed that they were holding it for a larger party. WTF? The flatbread was bland. I ordered their \"special\" grilled cheese. It was more like grilled bread with a smattering of cheese. Sorry, we won't be back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dOHvar0rRm0oWUb4dlbdXw/348s.jpg", "caption": "WTF  Ultimate Grilled Cheese with Bacon $14 Gruyere, white cheddar, mozzarella, brie, roasted tomato concassé, fried shallots, candied bacon"}]}}, {"review": {"des": "Great for groups of all sizes, this large restaurant never disappoints. The staff is always friendly and the food is always good. The menu ranges from burgers to more traditional dining entrees like salmon and fish & chips. The mussels are a tasty appetizer and are  served nestled in a delicious sauce that I can't quite place. For something light they offer a loaded half grilled cheese with tomato soup pairing. Most importantly they offer bottles of good quality wine at price points that are affordable. Overall, I recommend going there with good friends for a night out, good time.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uWidYoNvDcqF1c9e-3q8Yg/348s.jpg", "caption": "Half grilled cheese and tomato soup"}]}}, {"review": {"des": "Really great, authentic Irish pub in an otherwise over saturated bar district. Staff is polite and there is ample seating. Food is good as is the beer selection. The decor is on point and seating is ample. My group had fish n chips, pot pie, and shepherd's pie - all really delicious. Will definitely be back!", "pics": null}}, {"review": {"des": "Garbage management! My friend ordered the chopped salad with chicken. They completely forgot the chicken. Waiter didn't come back until 20 minutes after we received our order. My friend picked at the salad at best. We asked the waiter if there was supposed to be chicken. She said yes, then offered to bring a chicken breast out to add since they forgot it. My friend said ok, another 15 minutes later they come out with the chicken breast. At this time, we've finished our bottle of wine and my friend was over the salad. She didn't even eat 10% of it. The bill comes and we request for the salad to get taken off. This is where the sh*t show began.<br><br>A hefty female comes to our table in an aggressive manner. Introduces herself, then says she can only take off a percentage of the salad because my friend ate some of the salad. Really? A $15 salad she's trying to fight over despite us ordering apps, wine, and main course meals? I was insulted she really thought we were trying to get over on her by not paying for a garbage salad. She got on the defense and said 'well if everyone had a complaint like you, we'd never make any money'. Apparently, lots of people must complain about waiters bringing out the wrong order if that's her concern. I will never walk foot in that restaurant again. <br><br>The manager needs to realize that her repeat customers LIVE in the neighborhood. I LIVE 4 blocks away, I will NEVER dine there ever again after how i was treated. I did not leave a tip because the server and manager stared my friend and me down after asking the item to get removed. I can't believe the manager thought was she was doing was normal and ok. She claims she had to get 'each side of the story', over a $15 dollar salad that they effed up?!? Seriously?! Her attitude made her server miss out on a tip and repeat customers. Smart managing..", "pics": null}}, {"review": {"des": "St Patrick's was poorly executed from a food point of view. I'm English so a special menu of all of the cliche things from the UK and Ireland was never going to go down well.<br><br>I did however opt to embrace it and go for some favourites from home.<br><br>Chips (fries) and curry sauce for an appetiser because well, it's like a staple diet back home. They went far too light on the amount of curry sauce.<br><br>I ordered bangers and mash on the promise of some decent sausages. The mash was sloppy, the sausages pretty tasteless and the gravy dull. The portion was pretty small too.<br><br>My other half went for shepherds pie. Well, if you served this in the Uk and Ireland it would be sent back to the kitchen. She is American so she opted to add cheese to the top at the servers suggestion and it came out as basically a dipping sauce. No texture or consistency to the potato, the meat was dull and the cheese was far too over the top.<br><br>A taste of home poorly executed. Shame<br><br>WOW and we just realised the bangers and mash was 18 bucks! It looked like something you would get for 4 quid in wetherspoons in the UK.<br><br>Wilde this is St Paddys day, your night to shine!! What's going on?!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PRADf34_Vo5V4-BiPOvyCw/348s.jpg", "caption": "So much cheese. I know Americans like cheese but really?!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/o8KH448UMvgFKDQ-v-dbsA/168s.jpg", "caption": "Bangers and mash. Sloppy and half a plate."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/umb8UxU2CMxdAeBk0uInKg/168s.jpg", "caption": "This is supposed to be a Shepherds Pie!"}]}}, {"review": {"des": "My review is based solely off of the bar, we didn't get to try the food here yet. The setting of the whole place is great classy feel but also can be casual night for a date out. The drinks were good and the bartenders were friendly, we will go back to try the food next.", "pics": null}}, {"review": {"des": "This is one of my favorite places. I eat here on date night with my boyfriend probably once every other week because I'm obsessed with the grilled cheese. Since we've found this gem in Lakeview, we've probably eaten there almost a dozen times. I'm a creature of habit, so I always order the same thing. However, I order two dishes each time because they're that good. I'm a celiac, so I always order off the gluten free menu. I love the fact they have their own gluten free menu-- always so much to choose from, which is rare! I always order the salmon and the grilled cheese. No, I never finish, but I always go on an empty stomach so I can pack it away. It's usually packed around 8pm when it's later in the week, so while I wait, I get hungrier, and hungrier, so when the food arrives, I devour it! For the sides, I usually do fries and potatoes. Delish. While we wait, we order the galbi wings. My boyfriend is Korean, so whenever we see something Korean inspired at a non-Korean restaurant, we always order it, just to give them a try and see if they're worth it. They ARE.  Galbi wings = amazing. Gluten free grilled cheese = a dream. Salmon = 8/10. Today, our tenth or so time at Wilde, my boyfriend and i ordered out because we felt like staying home. I was so excited for my grilled cheese. Unfortunately, I was super upset when I found several hairs throughout our take out order. Normally, this would result in negative review, but the man who took my phone order took care of everything. He offered to refund my order or remake my order. We live about 30 minutes away from Wilde (but we make the drive because they make my absolute favorite grilled cheese), so rather than remaking it, we asked if it was possible for a gift card. Whoever I spoke to was able to make it happen, and that is what makes them a five star restaurant. He apologized and truly meant it, and his response made the experience super pleasant. I get to get another grilled cheese another day, and this still remains my favorite place as a celiac for a good diverse menu. Give this place a try, especially if you're gluten free and you want some flavorful items. Not only is the food delicious, but the service, as I've learned today, is just as great!", "pics": null}}, {"review": {"des": "After at least 11 check-ins at this restaurant, the service and food are consistent.  My last visit, I was going to order the Salmon which is excellent, however, I noticed the ribs were on special (which I've had before) so I had opted to have the ribs.  Again the ribs were excellent.  I really didn't care for the potatoe wedges.  I would have preferred just to have the regular fries.  It didn't ruin my experience.  <br><br>I would continue to recommend this restaurant.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KYyFdo0fiRgyDTvFiUyC3Q/348s.jpg", "caption": "Table next to the fireplace"}]}}, {"review": {"des": "We appreciate all the staff lunches and meetings we have had at this cool and sultry joint. The food is consistently awesome.", "pics": null}}, {"review": {"des": "Hands down I love this place!  The Quality of food and the amazing service from the moment I am greeted at the the door till when I leave are always great !!<br><br>Wilde restaurant is my GO TO for a good night out for dinner with friends of family.", "pics": null}}, {"review": {"des": "Stumbled upon this place over the weekend with a group of 8 friends. We were seated almost immediately around a time when it looked a little bit busy else where. Cozy and a library like decor. They actually have a small space called library where you can sit and enjoy cocktails , coffee or food  <br><br>A decent cocktail selection to choose from but cocktails were nothing especial. A very good beer selection on draft , I was impressed. We ordered Asian chicken salad , bison burger , Wilde burger , crab cakes and chicken sandwich. It all tasted fine but nothing that I'll be craving to go back for. <br><br>Bottom line if you're with a big group and looking for a nice place to hang out , grab drinks and have some decent food - this is your place. I would give a 3.5 starts.", "pics": null}}, {"review": {"des": "I have been here for dinner and brunch. The food is always tasty and I love how large the space is. I have never had to wait, except for outdoor seating. The food is good quality and the veggie burger is excellent. It is not the most adventurous restaurant in the area, but it is a good staple. It is great as a tried-and-true back up if other restaurants have long waits.", "pics": null}}, {"review": {"des": "This is my boyfriend and I's favorite sit down restaurant in our neighborhood. We've had almost everything: the steak salad, the Mac and cheese, the burgers, the chicken wrap, the grilled cheese, the chicken pot pie, and more. Everything is always delicious!! The drinks are also spectacular. I love that their beer menu changes from time to time. The ambiance is my favorite part of this restaurant. Candles, beautiful little patio and seats by the window. Can't go wrong here!! I wish they'd bring the bison burger back though!!", "pics": null}}, {"review": {"des": "I'm a fan! The atmosphere is just wonderful, whether you're sitting inside or outside. The restaurant is quite large with various moods, so you'll want to make sure you walk through the entire place, as there's a cozy fireplace, book shelves, and lovely bar in the back that are worth visiting, even if only for a minute or two. I've been here for brunch, lunch, and dinner, and have never left disappointed!", "pics": null}}, {"review": {"des": "Lovely ambience, superb service, excellent food.  Great place for brunch, large groups.  Quiet enough for conversation, but spirited enough for fun!", "pics": null}}, {"review": {"des": "Great vibe in this restaurant with good drinks. Food is ok but we haven't found it to be great.", "pics": null}}, {"review": {"des": "Loved the food here.  Great burgers, sweet potato<br> fries and the cheese curds were amazing too. Every thing we had was great.", "pics": null}}, {"review": {"des": "The huge beer menu and a really cool bar area make Wilde Bar a great option on broadway. The French onion soup was exceptional and the fish and chips make for a great meal during Lent. I Definitely need to come back and try more of their menu", "pics": null}}, {"review": {"des": "I think of Wilde as a family restaurant but the ambiance in the evening is perfect for a date night with the low lighting. Extensive food menu for a pub. I enjoy the decor - there's a library and fireplace in the middle of the restaurant. There is plenty of seating inside and patio seating during the summer.", "pics": null}}, {"review": {"des": "My friend found this place to accommodate a friend of ours who eats gluten free. The restaurant decor and interior is mediocre at best. I was disappointed with the place. The small plates they had on the table one had ketchup stains on it. The crab cake Benedict I had wasn't good. The crab cake was flavorful and the breading wasn't good. My friend didn't like her gluten free pancake and said it wasn't fluffy enough like other places she had. The gluten free mac and cheese didn't taste right like the regular mac and cheese. The only good dish that was the spinach omelette. I don't think I would give this place a second try. The waitress was to attentive because my friends and I waited awhile for her to come.", "pics": null}}, {"review": {"des": "I really like the Al fresca dining experience. Also the service was great the waitress repeatedly checked on us, asking if the food tasted good. I really love how this restaurant had a separate vegetarian menu. It accommodated my friends. I ended up getting the Buddha bowl. The food was really good. O ate the whole thing in one sitting, when usually, I would take home half.", "pics": null}}, {"review": {"des": "A former colleague (and good friend) brought me here, and I loved it so much I brought my wife back a year later for her birthday. This place is a winner. Great food, wonderful ambiance indoors, and if you can be seated outdoors when the weather is agreeable, then I would highly recommend doing so as it lends itself to the additional \"flavor\" of city dining.<br><br>The interior of the restaurant is a treat, what with a HUGE collection of books, decorations, and the fireplace area. If you can get a seat there, it's worth it just to have a nice meal in a nice area.<br><br>The pub burger (because I love burgers) was thick, juicy, and didn't have anything that would have made it a pretentious burger (like a pineapple or a slice of 1000-year old aged swiss cheese). Great portion size, cooked perfectly, absolutely no complaints. My wife enjoyed their rosemary roasted garlic chicken, and it was done the way it SHOULD be done. If you ever go to a place that has dry chicken, leave. This place does NOT have dry chicken, so stay.<br><br>Admittedly, parking is a pain because it IS the city, but there's a lot about a block away that you spothero to.<br><br>All in all, a treat and a great surprise. Significant others will love it.", "pics": null}}, {"review": {"des": "Such an inviting, comfortable space, with equally comfortable food. If you are sick of the overdone Irish bars all over Chicago, you will find even more comfort in this classy oasis.", "pics": null}}, {"review": {"des": "We have lived only a couple blocks from Wilde for almost three years, and somehow this is the first time we have been. That is too long: if you're in the neighborhood, this place deserves a visit more often than once every three years.<br><br>The trouble is tight competition from places like Ceres' Table and Dryhop, which together almost always occupy the field of places I want to get dinner or a drink right near my house. But Wilde has a couple of comparative advantages: a lot of seating, a more diverse and accessible menu, a longer beer list, some very nice large dinner salads, and TVs on which you can watch the World Series.<br><br>That said, the service was slow and distracted (though understandably so), my greens and veggies were rather limp, and the front third of the restaurant, where we sat, was a little bit vacant and unwelcoming (next time we'll sit in the back, which looked much more cheerful). So I can definitely see coming back, but I can also see why it takes the right circumstances for this to be the best place to go in the neighborhood.", "pics": null}}, {"review": {"des": "I like some things about Wilde, but their food isn't the best. The restaurant is good for brunch bc its so spacious and has a cool atmosphere. I went there yesterday for brunch, and wasn't impressed by the food. My egg sandwich was good, but my uncle's toast was pretty burned, it shouldn't be that hard not to burn toast. I'll try it again for dinner to see if its better,", "pics": null}}, {"review": {"des": "The wide array of their liquor selection is what drew me. Wilde usually has what you want. This bar is what got me confident in ordering whiskey and learning what I preferred.<br><br>The atmosphere of the cozy library feel is great for a date or a party of 4+. The appetizers are decent size and can be ordered as an entree. The curried mussels and grilled kalbi hot wings are the best of best.", "pics": null}}, {"review": {"des": "We've sat at both bars and by the cozy fireplace in front and are MAJOR fans of Wilde. This place is all you could ask for in a neighborhood bar/restaurant - unique elevated food and it really feels like you're in Oscar's library. The Chicken Pot Pie, Shepard's Pie, Wilde Burger, Fries are all great.", "pics": null}}, {"review": {"des": "If you want to feel cuddled and coddled, on a raw and windy afternoon, Wilde's is the place to go. We love the food and drink and the service is exceptional. Best of all--the book alcove--with a few tables, a couple of bookcases--and an excellent fireplace. This place makes you understand why folks love Chicago, even on raw and windy afternoons.", "pics": null}}, {"review": {"des": "Lobster Mac and Cheese with truffles - How can you go wrong? The Meatloaf was the best (Granted I haven't consumed lots of meatloaf in my life) I like it because it was a little sweet. I had the Salmon Sandwich and I barely touched. It came with an above way above average side salad and really good onion rings . Between that and tasting everybody's dish my Cousin Renzy Shepherds pie and Tim's (who recommended Wilde) Meatloaf I was full. The shepherds pie was fine. The salmon was cooked which means it was over cooked. This place gets 5 stars for 3 reasons besides the food. One is the decor - the stain glass, old wood, a library, 2 bars and open till 2am. Two, it's 3 blocks from my place (biased I know) and Three, it just happened to be on the Chicago Naked Bike route. There was A Lot and I mean A Lot of riders", "pics": null}}, {"review": {"des": "Even though my fav waiter Ray wasn't working tonight,  Sarah was excellent.  My friend from Manhattan was in town, so instead of cooking I opted for Wilde.  We are both gluten free and I'm vegan. The menu was exacting enough to suit both of us. Wine and cocktails were great.. Sarah was attentive but didn't hover to rush our visit. Another fun evening at Wilde.", "pics": null}}, {"review": {"des": "Great spot for coziness and delicious steaks and beer. I think in the winter this will be our new home", "pics": null}}, {"review": {"des": "Holy freaking smokes. I owe my friend BIG time.<br>After wondering what I wanted for dinner on a Friday night, a girlfriend invited me out to meet her here.<br>As I walked in, I was greeted ever so kindly by the bartender and a fine plate of mac and cheese that Anna ordered. This mac and cheese is by far one of the best. Warm and gooey with delicious onions soaked in what seemed like french onion soup and then topped with a fantastic garlic crumb crust.<br>We then ordered a chicken pot pie that was out of this world. This dish has quickly made my top ten favorites...ever. It was a piping hot filling under a pastry puff that all tasted homemade. All of your homestyle veggies were included with nice chunks of chicken. My mouth is watering and my tummy is rumbling all over again. Keep in mind that I'm writing this review after I just had lunch. We also ordered the goat cheese flatbread. As simple as this was, it was so tasty. The chevre was, again, one of the best I have had. Everything seems to be so well thought out and it seems as if the chef won't just put anything in their dishes. Almost as if everything is handpicked before it will belong in a dish here at Wilde. I will definitely be back and this will be a spot where I bring all friends who visit.<br>Not to mention, their old fashioned is a must and the hospitality from the bartender and the staff was one of the best.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JhozHxw1D2XdopRERXZaRA/348s.jpg", "caption": "This mac n cheese had crack in it"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aK1-EK4mOIjPHMmPQ6E7uQ/168s.jpg", "caption": "Bills old fashioned. One of the best I've ever had."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/V_OTq9bomx05KdtDaPdXqg/168s.jpg", "caption": "Goat cheese flatbread. So simple yet so tasty."}]}}, {"review": {"des": "I was visiting friends in the city and eventually we got hungry and decided to walk to a neighborhood place for dinner. They recommended Wilde so off we went. Despite being St. Patrick's day we were able to get a table. We selected some beers from their extensive list and my friend and I ordered burgers. The first positive quality indicator was the option to order my burger medium rare. I like a little pink in the middle of my burger. Soon the waitress delivered two massive burgers to our table with fresh condiments and a side of crispy onion rings. The flavor and quality of the burgers was excellent. This is a great neighborhood spot with friendly folks and great food.", "pics": null}}, {"review": {"des": "Perfect spot for date night! <br><br>Lots of great seats. We chose to stay outside, but the inside is spacious with really cute different seating sections. My favorite is what looks like a mini library with a wall of bookshelf and tables right in front. Overall, the restaurant is open and has a cozy vibe. <br><br>You MUST get the curried mussel (appetizer). It comes with 2 pieces of bread, and a generous portion. What we love so much is the sauce! Amazing Irish curry, which was a first for me. Then, I got the chef's burger for entree, my husband went with a haddock sandwich. They were good, average rather, but the side (we both got mashed potatoes) was so so so yummy!!! <br><br>The only thing: I think it's a little pricey! So it was definitely a treat for both me and the hubs.", "pics": null}}, {"review": {"des": "Great drink selection for both beer and cocktails; the Chicken Curry, Steakhouse Salad, and Chicken Pot Pie have all been really good. Really nice ambiance for a first or second date spot. There's a fireplace/library area of the restaurant to make your date think you're distinguished and well-read even though your favorite show is Jersey Shore and you still don't know how to tie a tie.", "pics": null}}, {"review": {"des": "I have passed this place 20 times in the summer when they had the outside seating. I pass on outside but being Veterans day I treated myself today. I took my book and was seated. It looked okay and I like the gingham style shirts. The waiter came over. I was totally unacquainted with the menu and asked questions and opinions from him. I took his suggestions and had a fine meal. The potato leek soup was really good. The burger was very good. Now that sounds good but is it the same for everything? I chatted with the lady at the next table, a regular. She assures me that it is all as good as that. I decided on a desert. I avoid deserts but will do one that I have never had. This one was  cake like with nuts and a wonderful sauce. It is not a cheap place but it is not an expensive place either. It is a worth for the money place. I will return to try the egg skillets on a weekend as the lady bragged on it enough to snag my interest.", "pics": null}}]}