{"name": "wildfire-chicago", "reviews": [{"review": {"des": "This was my first time at Wildfire and I will definitely be back. The atmosphere is really cool and classy. I sort of felt like I was walking into a movie. Our server was nice and knowledgable! We ordered the tuscan kale salad as our starter, along with some wine. This was hands down one of the best salads that I have ever had! For real, I wish I could eat this salad every day. <br>We also each got the french onion soup... which wasn't so great. I think they use swiss cheese or something for the cheese part of the soup and there was something that didn't sit so well with us. <br>But once our petite filets came, everything was better. I got the peppercorn crust on the filet and it was perfect. I ordered it medium and that is how it was served to me. I am already planning my next visit to Wildfire!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/B5_T8foO_OhrG0mDhzxHLQ/348s.jpg", "caption": "Tuscan kale salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/koCXdsR97knkb--UyL4gjQ/168s.jpg", "caption": "French onion soup"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qufsLVWMY_nAIhENtoPh2Q/168s.jpg", "caption": "petite filet"}]}}, {"review": {"des": "I used to love this place but the last 2 times were really average. There's nothing on the menu that wows you. The food isn't bad but it's not enough to make you want to come back. <br>Maybe it's the fact that there are so many options that are either at the same price point or a tad higher that have that wow factor. <br>I've noticed several new restaurants joining the Lettuce Entertain You Group and can't help to wonder if too much focus is on acquiring and not enough on keeping their older establishments competitive with amazing staples and new interesting menu options that keep people coming back. <br>The service was top notch but sadly this was our only real standout tonight.", "pics": null}}, {"review": {"des": "Wildfire is a upscale steakhouse with white table cloth dining. We made reservations a day in advance for my husband's birthday. This is the go to place to celebrate birthdays, take your clients to dinner, or have a romantic dinner date.<br><br>The things I noticed right away: the white table clothes, the elegant environment, loud noise level, and they serve complimentary warm, fresh bread (rye, cornbread, and sourdough). Plenty of seating and staff. Appetizers, pizza, salads, burgers, sides, filet mignon, steaks, chops, prime rib, fish, seafood, and chicken could be found on the menu. <br><br>We ordered the Bison Meatballs ($9.95 served with a red sauce- good, but they just tasted like regular meatballs to me), Coconut Shrimp ($27.95 crispy baked shrimp with coconut ginger sauce-- larger baked shrimp with mild taste, the sauce was not too sweet), and the Roasted Prime Rib 16oz ($36.95 my husband said he would have been fine with the 10oz. Good!). Dinners come with a choice of side. We chose the broccoli with lemon vinaigrette and the redskin mashed potatoes. Good choices. The seafood is also flown in daily.<br><br>Our service was off, but nothing alarming. Must have been an off day because our server seem frazzled and kept arguing with his co-workers that he didn't want another table. Just not the smoothest transitions for a fine dining steakhouse. Regardless, we had a fun birthday celebration, and are glad we went to Wildfire.", "pics": null}}, {"review": {"des": "I have always loved this place so I was so excited when my friend decided to celebrate her 35th birthday here. The food is always amazing and my mouth was watering for the martini flight! Our waiter was Phil and he did not disappoint he was very attentive and even got the bartender to secretly create a \"mocktail\" for my one friend who is with child, only thing that made me sad was he kept the family recipe for the cornbread a secret, lol! I'll have be sure not to let another 10 years ago by, before coming back!", "pics": null}}, {"review": {"des": "Dinner here was great. I got the queen cut prime rib as I don't get the luxury of a prime rib hardly ever with a side of mushrooms. Everything was superb in my opinion. I was also fortunate enough to try a bunch of different entrees and appetizers from my table. The horseradish filet was also great as well. <br><br>In terms of the appetizers, cornbread - phenomenal, scallops - pretty good too, goat cheese - not bad. <br><br>The service and the ambiance was pretty cool the actual establishment was pretty neat. Our server was very good and took care of everything including pouring my beer, which I find odd, but I get the sentiment of rich people not liking to do anything themselves. I would like to instruct how to pour a good beer though.", "pics": null}}, {"review": {"des": "This is my third time visiting and I must say I love this restaurant.<br><br>Pros: Every time I've visited the host, waiters, servers, and busboys have all been friendly and helpful. The food is to die for and all cooked to perfection. I've tried the chicken, steak, chicken club, shrimp and love their calamari appetizer. Although I love their fries I always substitute it for their mash potatoes because I love those even more! Their drinks are rightfully strong and tasty, my favorite being the tequila tini Most of their menu is decent priced and the ambiance is semi dimly light. This makes this place perfect for birthday, anniversaries, or even just a bite out to eat with friends. It's conveniently located in river north so it's near different bars, clubs, and hotels. <br><br>Cons: try not to be seated near the open kitchen or else you'll be able to hear all the commotion from behind the scenes", "pics": null}}, {"review": {"des": "I've been here on several occasions before for dinner and have yet to write a review about it as the dining experiences were forgettable... BUUUT happy hour at the bar (or what they call the Martini Lounge) is great!<br><br>What you need to know...<br>-Happy Hour is M-F 3pm - 6pm<br>-Half price appetizers ranging from $4-$8<br>-Drink specials depend on the day; Mon are 1/2 priced bottles of wine, Tues are $8 Martinis, Wed are Wine & Martini flights for $10, Thurs are select Cocktails for $10, and Fri are draft beers $5 and select wines $5-$6<br><br>Service at the bar was actually pretty good. The bar is pretty extensive with a long bar top and plenty of high top tables. Only 1 or 2 bartenders working at a time, but they did a great job of making their rounds to make sure everyone gets served (you got serveddd).<br><br>Anyways for food appetizers I'll say I was really impressed with the quality. We definitely enjoyed the bacon wrapped scallops, moroccan chicken skewers, and the wild mushroom & goat cheese pizza. All were excellent for half price :)<br><br>This spot is Lettuce Entertain You affiliated so have those cards ready to rack up or redeem. <br><br>'Til next time, cheers!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qbqwCt1aU23g4OL1SVY-Jg/348s.jpg", "caption": "Mushroom and goat cheese pizza :)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/g8jIQzY1d3pdHV9hGdw6bA/168s.jpg", "caption": "Crab cakes"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eYgNEF5yzoCOHu0qJ35gew/168s.jpg", "caption": "Moroccan chicken skewers ~ that dipping sauce was excellent"}]}}, {"review": {"des": "As much as the classic steakhouse market is saturated downtown, Wildfire is a real staple for me. I've now been a handful of times and it is consistently great food, service, and atmosphere. In comparison, I've tried a number of other similar ranged steakhouse/classic-Chicago restaurants and they just are \"meh\" in my book. On paper Wildfire is just another, but in reality its super freakin good. <br><br>I'll start with the steaks. Steaks are generally great at the top steakhouses no matter what. Wildfire has a ribeye that you can get Parmesan encrusted. Every. time. It owns. Its legitimately a step above other steaks and while at first I thought it was luck, it has become reliable enough to always be that good. So remember, get the parm encrusted ribeye (or other cut of meat), and you will be amazed. <br><br>Aside from the steak, they have some of the best salmon I've ever eaten. Its just salmon you say? Nope, its again another step above what I'd expect. The tuna steak is a close second, I got that one parm encrsuted like I do the steak and its a winner.  <br><br>Their bread basket comes with warm, out of this world cornbread. And the other breads are truly great. Another 10/10. The house giant salad is pretty good too. <br><br>Other apps and sides are comparable to other restaurants of this standard. All pretty decent, with lots of butter, and can't go wrong. <br><br>The service is always at a standard of welcoming, and giving you time. I have really hated newer trendy restaurants these days that blast the music and just want to be table turners. Wildfire is patient with you, and while the amount of people generates noise, you can still hear each other and enjoy the evening taking your time. <br><br>Its a perfect place for family in town, a date, celebration, you name it. Nothing adventurous here, but its an automatic nice, long, personal dinner option. No surprises, and great food along the way.", "pics": null}}, {"review": {"des": "So, the reason we booked this particular steakhouse was because I love a good charred steak.  They had this on the menu and I was stoked to go here.  We started with the calamari which was nice and tender just a bit greasy though. We also had the baked goat cheese which was good, but nothing mind blowing.  We ordered the charred ribeye and charred porterhouse. I was a bit disappointed. It was cooked perfectly, and appeared to have a char, but they had poured this broth over it.  It was a sweet broth which is not something I like on a steak, and the liquid made the char soggy instead of that nice crunch on the outside you expect.  I have the place 4 stars because the steak was beautiful and cooked to perfection. I'm sure if you didn't want a char steak, you would be more than satisfied, just for me, it wasn't 5 star worthy for that reason.", "pics": null}}, {"review": {"des": "Rainy night out with the family. I always love wildfire. I don't think it's anything fancy but it's comfort. I know it will be good and don't have to think much. <br><br>On the menu Pinot noir shrimp and crab bisque pecan encrusted halibut and that bread. So the bisque I could eat everyday in the fall and winter. So much flavor. The Pinot noir suggestion from the waiter was spot on. And the halibut was delish. We enjoyed the meal very much.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IuHE6cSB4t2hiXXRJMKukQ/348s.jpg", "caption": "Lemon pepper chicken"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eNXpO-l_gYd3f7vjAYTW2g/168s.jpg", "caption": "Shrimp and crab bisque. DELISH!"}]}}, {"review": {"des": "On a trip to Chicago with some friends, I was really craving a nice steak. All the big chain steak house were so expensive and I wasn't looking to spend $80 on a steak. Luckily my friend found Wildfire and they were able to take us as walk-ins. They told us a 45 minute wait but we were actually seated in about 20 minutes. I loved the 1940s vibe and the waiter was friendly and funny. I got myself a huge steak and a not huge price and it was delicious. My friend go the flight of wine which had a fun presentation. And we got a slice of delicious chocolate cake to go and enjoy later that night since we were so full. I highly recommend and can't wait to go back on my next trip.", "pics": null}}, {"review": {"des": "Took my soon here accidentally as fogo was closed. I was surprised and over joyed at the level of customer service and quality of the food. The kid and I got the steak and they were huge! The chef did his thing and they actually have a selection of crusting and toppings for your steak.  If def come back.", "pics": null}}, {"review": {"des": "I really liked the food here at this restaurant <br>But what made me take down some stars was the fact that I felt very unattended to by my waiter. <br><br>We where seated at the tiniest table they had. <br>Our server didn't bring us our soft drinks for at least 15 minutes. <br><br>Our food came out cold (but tasty) I sent my steak back so that they could reheat it or whatever they could do to make it hot. <br><br>Our mashed potatoes where not good so I ordered broccoli instead <br><br>Very good steak tho, very bad service. Simple things could have made this a lovely evening out.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Kk2zQ-uF-diUCOuqIu1bCQ/348s.jpg", "caption": "Fresh Broccoli with Lemon Vinaigrette"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cUJt8MiOld6BQRhvt1Ox_g/168s.jpg", "caption": "Gluten-Free Redskin Mashed Potatoes"}]}}, {"review": {"des": "This is another brilliant effort from Lettuce Entertain You. It's much more old school than their other restaurants, and really does capture the look and feel of a 1940s steakhouse. Not only does it offer some of the best steaks in town, it also offers some of the best steakhouse prices in River North. Both the food and the wine list is priced substantially below those of other restaurants, including some of Lettuce's other restaurants.<br><br>Highlights of our meal included the house salad (the smallest size is huge), the very traditional French Onion Soup, and the very creative tuna tartare. The bacon wrapped scallop appetizer was also quite good.<br><br>My horseradish crusted bacon-wrapped filet was just as good as it sounds. In fact, I think it was the best steak I've had in Chicago, and I've had a lot of them. Creamed spinach is a good side dish.<br><br>The wine tasting flights offer four interesting selections for $15 or less. Where else can you get that in River North?<br><br>Our server was friendly and attentive. And of course the Lettuce Entertain You Frequent Diner Club points make it an even better deal. Highly recommended.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6VQXSyTS0IBVa6_ym_2RrA/348s.jpg", "caption": "Horseradish Filet"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hUBDl-Oa6lWNXedb6QNmZg/168s.jpg", "caption": "Beef Wellington"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/k0OGDIsSmZaBzzy-NnY6fQ/168s.jpg", "caption": "House salad"}]}}, {"review": {"des": "Another great Wildfire location. I have been to the few in the suburbs, and this one is another great one of the chain. 20s music vibe and old times steakhouse flair. Top notch service. Great bread on the table (including corn bread). <br><br>The chopped salad here is a must and one of the best in the city. For dinner, I usually get the New York Strip with Parmesan crust. But tonight I got the prime rib French dip and it was really good with au jus and a horseradish cream sauce to put on it too.", "pics": null}}, {"review": {"des": "4.5 stars. Came here for a work dinner with colleagues. I was pleasantly surprised. The have a fairly extensive menu, including a variety of beers, wines by the glass and bottle, and cocktails. Although they are a steakhouse, they also have a large variety of seafood, chicken, pizza, and even other vegetarian options (not just salad but also a veggie burger.) Food was very good, and prices are also pretty reasonable. Sizable and filling portions. Service was attentive and enjoyable. <br><br>We ordered the baked goat cheese appetizer and Caesar salad to start. Both are yummy and enough for 5 people to share. The bread basket is also very tasty and served warm. For my entree, I ordered the potato-crusted scallops with a side of potatoes au gratin ($28.95). WOW SO GOOD. My entree came with 8 good sized scallops with cooked spinach. I loved the crispy potato crust. The potatoes au gratin was a hefty portion and also so so yummy! Very cheesy and creamy just like I like them! I liked that all entrees automatically came with a personal side, and while I couldn't finish all my food, others I was with found it to be a very filling and satisfying portion. They ordered steaks and enjoyed them.  <br><br>Waiters were constantly refilling waters and checking to make sure we were able to order any additional drinks we wanted. Overall vibe is more traditional with some families there. Not necessarily trendy but definitely a very satisfying experience overall!! Would recommend.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EuzSW2vrUIze5wAlmuV7tg/168s.jpg", "caption": "Potatoes au gratin"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ed-hAhiQj64SiKMP7TyECg/168s.jpg", "caption": "Potato-crusted scallops - great if you're not in the mood for a heavy steak!!"}]}}, {"review": {"des": "I will never come to this location again! I came here on my birthday to enjoy a meal with my family and I'm walking out the waitress stops me and says that we were short on the bill. My party has already left, except my brother who also leaves money, the restaurant so I say whatever and pay her what she claims was missing. Turns out that not only did my family pay the exact amount but they also left a tip! So the waitress I'm assuming kept what we originally gave her and what I ended up giving her. She probably made around $200 on a $350 tab. I didn't need this on my birthday!<br><br>No point on going to the restaurant because I didn't catch the waitresses name.", "pics": null}}, {"review": {"des": "Here is the issue: you cannot hold the stick from both ends. Are you \"fine restaurant\"? No you are not. Are you children / family restaurant? No you are not. Are cheap / everyday restaurant? No you are not. Are you high quality yet relatively expensive restaurant? No you are not. <br>So you are \"look worm\" restaurant and I don't likes it. Nothing was \"bad\" but on the same time - nothing was \"great\" or at least \"very good\"<br>Sorry", "pics": null}}, {"review": {"des": "This review is for delivery only (I've eaten at the restaurant and would give it 4 stars). <br><br>We treated ourselves and got the Greek salad, porterhouse, and the scallop wrapped in bacon app. <br><br>Greek salad was 5/5. I loved the ingredients- tasted totally fresh and the dressing was tasty and lite. <br><br>Scallops- there were two sticks of 3 TINY scallops wrapped in soggy bacon fat for $15. They were bland and I was unhappy. <br><br>The porterhouse- I expected much more for the price we paid. It was really just okay. Nothing to write home about. Underspiced. Well cooked though. <br><br>I definitely wouldn't order from here again.. maybe the food shrunk during delivery.", "pics": null}}, {"review": {"des": "I had dinner reservations here on a Thursday when my parents were in town. We were seated immediately; Wildfire's claim is that theyre a 40's style steakhouse which was noticeable in the decor and ambiance. Bread rolls and butter were brought out pretty soon after we were seated, and were hot and melted in your mouth. <br>To start, we ordered the chicken skewers, which were inconsistently cooked. Two of the skewers was fully cooked and tender, the others were not cooked completely through. My dad and I split the filet mignon trio, with the bleu cheese, horseradish, and mushroom toppings and the wild rice on the side. The bleu cheese topping was my favorite one! The trios were small, but perfect for us to share. My mom ordered the veggie sandwich, and all of her grilled vegetables were cold and unappetizing. She didn't end up finishing the other half of her sandwich. For dessert we got the half apple pie and ice cream, and it made up for the inconsistencies during dinner! Service was slow, and it took a lot for us to even get the bill. It was an overall ok dinner, but I think I would check out another steakhouse before I come back here.", "pics": null}}, {"review": {"des": "One of my favorite places in Chicago. I love the old school feel of the place. The dark mahogany gives the place a classy look. I almost expect to see the rat pack sitting in a big booth. The steaks here are pretty good. I do believed they're aged. I love the salads here, huge and full of fresh veggies. I experimented last time I was here, I had the martini flight. It was interesting, but appletinis and cosmos just aren't my thing. I'll stick to the classic next time. The service here is airways great. Thoughtful and conscientious servers never intrude, but are usually right there when you need them.", "pics": null}}, {"review": {"des": "I came here to celebrate my birthday.  The food was absolutely delicious. I ordered the filet cooked medium well and it was just the right amount of pink. My girlfriend had the scallops which were also yummy but they had a little too much breading for my taste. The creamy spinach side was very flavorful and the mashed potatoes paired perfectly with my steak. For drinks, I ordered an old fashion cocktail and it was strong. <br><br>For desert,  I ordered the trio with three deserts. The key lime pie had amazing crust and the reeses cake with ice cream tasted like you ate a bag of reeses. They put a candle in my desert because they knew it was my birthday. I'll definitely be coming back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PTdz0IAn3JnpEPN7-jz43w/348s.jpg", "caption": "Scallops"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xPZuWwY_yAL9RNb-YZ_xlA/168s.jpg", "caption": "My filet"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TzlLdjxAhBEizZN6DmsCfA/168s.jpg", "caption": "Salad"}]}}, {"review": {"des": "I had a purely fine dining experience at Wildfire. The manager, Tim really made it special and memorable. I'll be back again", "pics": null}}, {"review": {"des": "Tried Wildfire this weekend and it was ok. So, we had a reservation for 8 and all was fine, we were promptly seated. The issue was that when you \"reserve\" a large party, your menu options are very limited. There's a clubhouse menu that you must order from, which does not include a large chunk of the menu, so no scallops for me. Now I was able to roll with this except there was a party larger than the party I was with that got to order a la cart. Of course I inquired with our server and was given several different answers as to why. Ultimately, it comes down to how you reserve your seating. Ok, so on to the food. The food itself was good, but for the price ($42.50) a person the portions were not that large considering it's served family style. My favorite things were the pomegranate martini, the house salad, and the delicious croutons. Would I go back? Probably. Would I go as part of a large group? Not at all<br><br>Ps<br>The complimentary bread was delicious", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/v-b3jRirUa7dBV4d4NJ_IA/348s.jpg", "caption": "Chicken & cheese baked potatoe"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hrr-3FpoAVBMEIoQeHlomQ/168s.jpg", "caption": "House salad"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BrRA1Fwc5_XNrERCnZ9ezw/168s.jpg", "caption": "Cheesecake"}]}}, {"review": {"des": "This place is packed on a Monday night. This says a lot about the quality of food. I came here for a group dinner and the family style dishes were delicious. Some highlights included Moroccan chicken skewers, their excellent salads, cedar planked salmon, and buttery mashed potatoes. <br><br>The most memorable was the dessert. The gooey chocolate cake was amazing, but the ice cream sandwich was out of this world. It was like a snickers bar melted and combined with vanilla ice cream between two perfect wafers. Definitely a place prime for a date, special occasion, and group events!", "pics": null}}, {"review": {"des": "I come here quite often I love the ambiance and I can usually find a table pretty easily. I usually get the horseradish crusted fillet, ahhh it's so good. Paired with spinach and a sweet potato and your all set.<br><br>I did take away a star because it seems like the portions are getting smaller every time I come. I got the bacon wrapped scallops and they were super tiny compared to previous times and the steak even looked smaller. Still worth a try :)", "pics": null}}, {"review": {"des": "My husband and I love coming here for happy hour. It's from 3-6 PM on Mondays-Fridays. You can just walk in and sit down in the Martini Lounge. The lounge is never packed, which I love because you don't have to fight others for tables. Whenever we get out of work early, we race to get here because it's about a 10 min walk from the Grand/Chicago stop. As long as you can place your order before 6 PM, you'll get to enjoy the happy hour specials. <br><br>What I love about this place is their flight of wines and martinis. It's more than enough for a lightweight like myself. Plus, I get to try a bunch of different drinks that I never usually order. <br><br>Their happy hour consists of half priced appetizers. We love and always order their crab cakes, tuna tartare, calamari and wild-mushroom & goat cheese pizza. You won't regret ordering any of these - I promise! You're table will be so full that there will barely be enough room for all the food and drinks. <br><br>The service is wonderful. The staff are super attentive and welcoming. The ambience has that classic, old school restaurant feel to it. <br><br>If you're looking for a cool, affordable place to go to for happy hour, check out Wildfire!", "pics": null}}, {"review": {"des": "I went here for a happy hour on a Thursday. Great drinks and all of the appetizers are half off with the normal size serving. Food at this location is delicious as usual. We had the Wild Mushroom and Goat Cheese Pizza which was extremely delicious. The calamari and crab cakes were great selections as well. The Kale and Artichoke fondue is a must try. Definitely a surprise to me this was one of the better happy hours in the city. You will not be disappointed.", "pics": null}}, {"review": {"des": "The food was superb. I ordered prime rib... The dessert that we ordered was one of the best cookie I've tasted. My brother's friend went there just for that dessert and told my brother to make sure that we order it later.. That dessert was highly recommended and now I see why.. Our server Josh was excellent too.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Nm_bB3b8qHvgpMXbzpGD7Q/168s.jpg", "caption": "Their Malbec red wine.."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MKDAF0rhAuKxDzjrvlYA8g/168s.jpg", "caption": "One of their desserts.. Freshly baked cookie in the skillet topped with Homer vanilla ice cream.."}]}}, {"review": {"des": "Went here on 10/28/17... My first time going and I was pleased. I liked the decor and atmosphere. My boyfriend had white wine and I had the skinny pineapp!e coconut drink which was really good. We didnt see any appetizers that caught our attention. I order the fliet mignon with red roasted mash potatoes. The potatoes were very good the filet was good as well.. However I order medium and it was more medium raw. My boyfriend had the roasted chicken with a bake potatoe and broccoli. He really enjoyed his food. SInce we were full we decided not to get desert. <br><br>Since it was my treat and I got to see the receipt lol.. It was not expensive. I would definitely attend again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rnnVK_KBFOOOyTdjAqQlww/168s.jpg", "caption": "Fliet mignon.. Mash potatoes.. Broccoli.. Bake potato.. And roasted chicken.. Very good"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/x-t_5o6M_sFGdAXK9xuAEg/168s.jpg", "caption": "Skinny Pineapple Coconut .. Very good"}]}}, {"review": {"des": "Took a friend here for a bday dinner. Nice cosy spot with tons of parking options. My entree was good probably would order again.", "pics": null}}, {"review": {"des": "Delicious food. Even the hamburgers are amazing! I have no idea why I once ordered a hamburger on a visit to a place where you can get amazing steaks and seafood, but I think it was because my go-to fave fish was out of season. <br><br>I highly recommend the horseradish crusted filet mignon or the macadamia nut crusted Alaskan halibut. Neither will disappoint. <br><br>Bring an empty belly and a full wallet. It's pricey, but worth every cent.", "pics": null}}, {"review": {"des": "I love Wildfire and I feel that it is a very reasonably priced steakhouse for the quality. The ambiance is old Hollywood glam and they cook the steak exactly as you wish. It's a great place if you are one of those people that change the order (example: I wanted my steak cooked with no oil and only pepper, and the broccoli steamed with no butter!) The raspberry Cosmos is seriously the BEST drink in Chicago. It is sweet but strong and has such a great taste if you like sweet cosmos. All of their drinks are delicious though so definitely stop by during happy hour!", "pics": null}}, {"review": {"des": "Really awesome dinner here! Pass by this place every day on my walk home and decided to try it for dinner...great vibe and super nice staff. I had the Cesar salad and petite filet mignon which was a large portion despite the smaller sizing... both both incredible. My boyfriend had the salmon and he really liked it. They bring out a nice bread variety to start and it includes homemade corn bread which was tasty. Manager found out it was our first time in and gave us a free dessert...key lime pie was out of this world good! Will definitely come back here and highly recommend!!", "pics": null}}, {"review": {"des": "-Warm and welcoming lodge atmosphere.  There are lots of rich woods and exposed stone-work.<br>-Bartenders are always friendly.<br>-They poor a nice cold martini in a generous-sized glass.<br>-The bread rolls are good although I miss the warm loaf of onion bread they used to serve instead.  Seems like they started skimping a little by eliminating this.<br>-I used to always get the filet trio--but I've noticed the portions on these have gotten smaller and they don't have as many options for crusts on the meat.<br>-Their signature bacon-wrapped filet with horseradish crust is still phenomenal--served with a delicious horseradish cream sauce.<br>-Creamed spinach is some of the best I've ever had.<br>-Giant baked potato with sour cream and chives is exactly what you want with your steak.<br>-Price is still reasonable for what you get--especially compared to other local steakhouses.", "pics": null}}, {"review": {"des": "I find wildfire to be fairly consistent. This was my first stop on my 2017 Chicago restaurant week train. It was $44/pp for dinner. The options were good for each course. I ordered the spinach and kale salad ( amazing! I would definitely come back and order that as an entree and pair it with a protein). For my entree I had the petite filet with a peppercorn crust and mashed potatoes. My filet was cooked a perfect medium but unfortunately, my friend ordered the filet as well but it was way over cooked. I finished my selection with the chocolate cream pie but did not have enough room to try it so I grabbed it to go ( ate it the next day it was yummy). <br><br>To my good dinner I added on a martini flight ( YUM!). I'm not a martini drinker but I love wildfires!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RLmiwfD6woQ8U2tcyp0Q-w/348s.jpg", "caption": "Chocolate cream pie"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3RL8jJi3E7yRHjbdUrvcoQ/168s.jpg", "caption": "Petite filet with peppercorn crust and mashed potato"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ozAw3zurguEb9G8AozM4UQ/168s.jpg", "caption": "Kale and spinach salad"}]}}, {"review": {"des": "My boyfriend brought me here for Valentine's Day dinner. Everything about it was great! The drinks we had we awesome. I had a Effin Cucumber martini & if you enjoy cucumber flavor then this is your drink! The cucumber martini is so refreshing! My boyfriend ordered the skinny pineapple & it tasted similar to a mai tai. The New York strip steak was so flavorful! It was ordered medium well and it came out just right, very juicy! The cedar planked salmon & it was very good, no complaints. Our server was phenomenal, everything we ordered was recommended his name was Zerad.", "pics": null}}, {"review": {"des": "I went here on a random Sunday night, and it was pretty dead. Chicago is jam-packed with steakhouses, so I sort of wanted to check this one off my list. I ordered the skirt steak, which was okay. It was on the saltier side. Service was good, but compared to many other steakhouses I've been to in Chicago, I won't be making a second trip back to this one.", "pics": null}}, {"review": {"des": "I have been coming to this restaurant for over 14 15 years now so I guess I kind of like the butt I seen that it's a popular Chicago downtown restaurant<br>I believe in generally has something for everyone even your picky eaters the menu is extensive you're literally going to page and page of appetizers main dish and salad tubes wine list is impeccable the day weekend we were celebrating an anniversary my daughter went with the combo platter which included like a half a chicken and a half a slab of ribs I went for a seafood dish and my husband went for a steak dish no complaints everybody was excited and happy the bread was a big hit at the table where some bread people so we actually love Brad being able to see kind of through the kitchen and getting the food prepared the way it was nice and we told them it was our anniversary we got free dessert to share my drink Choice was actually a martini flight and it was for distinctive flights each one different and each one equally as delicious as the first I really recommend trying the flight so then you know how each Martini taste which one you like and which one you don't but I love them all this is a great restaurant to celebrate a special occasion birthday or anniversary all great date night cuz it's dark and dim and also very cozy also seems like a lot of people come here for post business conferences I'm very popular even on the week night will be back", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3Rb92xVwp1eG4qmR_WEUzg/348s.jpg", "caption": "Martini flight"}]}}, {"review": {"des": "This place looks cool on the outside, looks even better once you get inside but the food didn't seem to match what was offered. I felt like a burger and expected a really tasty well seasoned burger. Instead i got something that didn't even fill the entire bun and was very bland. Kale salad was very good and made up a bit. Service was nice, but not fast.. In fact, extremely slow. <br><br>Desert, looked good, but we didn't have time to try any. Overall, not a crazy good experience, but not terrible either, so A-okay in my book.", "pics": null}}, {"review": {"des": "Classic steak restaurant that won't hurt your wallet...too much. :) My boyfriend and I started off with the kale and asparagus fondue as our appetizer. You have several garlic toast points and you can either dip or use the spoon for the fondue. So delicious! <br><br>For our entrees, I ordered the regular filet while my boyfriend got the surf and turf. The steak was a little bit dry toward the outer part but other than that - nothing to complain about! Got the mashed potatoes as my side and it was buttery and smooth as expected! I had a bite of my boyfriend's lobster and it was also tasty.<br><br>The meals weren't mind blowing but if you're looking for a good steak dinner, this is the place to go!", "pics": null}}, {"review": {"des": "So Good!  They have a dedicated Gluten-Free menu, with gluten free pizza, buns for burgers, etc... I got the Al Forno Steak and it was amazing!  So flavorful!  My Dad got the Macadamia Nut encrusted Halibut (also gluten free) and it was so good!  We had flourless chocolate cake for dessert too.  The entire meal was so amazingly good! Service was excellent too.  Great place, definitely recommend and will go back.", "pics": null}}, {"review": {"des": "This is definitely the worst wildfire that I have ever been too. They are completely dead in here, before I even ordered I over heard another table complaining about the food being bad. So I decide to order the most simple thing that even the neighborhood diner does great and that's a cheeseburger, no tomato, no pickle and no coleslaw. Well they can't even get that correct here, and I had to wait about 10 minutes to let our waiter know because he was no where to be found (and it wasn't due to him being busy with other customers as there are none!). Now I understand why this place is empty!!<br><br>I will say that the manager Gabriel just saved this experience. Removing not only the burger from the bill but a salad and treating a dessert. Very nice recover. Thank you Gabriel my original 1 star made this a 3", "pics": null}}, {"review": {"des": "A Lettuce Entertain Restaurant with the feel of a 1940's steakhouse.  Dark wood almost everywhere, medium lighting, swing & jazz  music over the speakers , and large black & white photos of celebrities such as Frank Sinatra along the walls in the dining area.  <br><br>I arrived about 5 pm and very few patrons in the place.  When I left about 6, it was about 1/3 full.  Host was friendly and helpful.  My waiter was very good.  <br><br>I had the cedar plank salmon with redskin mashed potatoes and both were good, but overpriced for the portion.  The desert tray looked great and I would have liked to try all of it.  I settled on the seasonal Blackberry/Peach pie with a scoop of ice cream. It was ok (it looked a lot better than it tasted.)<br><br>I would go back and possibly invite relatives.", "pics": null}}, {"review": {"des": "We ordered food at 6:20<br>By 7:40 nothing but a call telling me it will be another 15 min. One hour later I called. NO FOOD<br>Got an apology and said it will be here shortly<br>We are three blockes from restaurant <br>The food shows at 9:00. Just great except one of the meals aren't here<br>When I called Grubhub she calls the restaurant and tells me they don't have any of the items we ordered for third meal. No one called to tell us that. They gave us an 80.00 refund but didn't tell us there was no prime rib !!!!!!<br>Shame on Wildfire. Really upset that a company that large could be soooo inept <br>I plan on telling everyone this story<br>We have lived downtown for 6 years and eat out every weekend. The first time we trust Grubhub to feed us and this happens<br>SHAME ON WILDFIRE <br>Grubhub waited and the restaurant still messed up<br>Lost us as customers <br>Poor managers!!!!", "pics": null}}, {"review": {"des": "Let me start by saying my family only came here because we had read great reviews. We could not have had a worse experience. The dinner started with a rude, less than enthusiastic hostess who had us seat ourselves, we weren't even given menus, followed by the kitchen who got an order wrong, food came cold, waiter overcharged a meal, bus boy spilled hot butter/grease all over one of our laps, which ruined our clothes, and the kitchen severely burned my dish. Needless to say we will not go back at any time in the future. The price you pay to eat at this place does not match the service. Shameful.", "pics": null}}, {"review": {"des": "Went Sunday night with husband and 2 kids.  Service was good but food was just average.  I got a burger that was decent but not $16 decent and the fries were cold.  My husband got a steak that he said was tasty but it was undercooked and not terribly hot.  With that being said he ate every last bite of it.  The corn bread in the bread basket was outstanding.  I was just underwelmed by the whole dinner overall so with all the dining options in Chicago I doubt we would pick Wildfire to revisit.", "pics": null}}, {"review": {"des": "Frustrated and disappointed!  I normally dine in while in town but this time opted for delivery due to where I was staying and the weather.  I almost always order the lemon chicken and there have been times there are issues but nothing too major, I can get over it.  However, this time my chicken is still nice and pink inside and very rubbery outside (makes sense since not cooked thoroughly).<br><br>In addition to my chicken I ordered a side salad which is an additional $6.95.  I called the restaurant and was told I needed to call Grub-hub which I did.  I was refunded for the chicken but frustrated that my order was $41.21 (that did include the tip and $2 delivery fee) and the refund was $24.47.  Clearly the cost of the chicken only.  Part of me does understand that but I am truly frustrated by the fact that I paid $16.74 for a side salad......maybe I'm more frustrated by the demeanor of the manager.  Either way, I won't be going back anymore.  <br><br>Note to manager - good customer service goes a long way.  May not have been flat out rude but obviously no big deal that a customer wasn't happy that pink chicken breast were delivered, but you also put me on hold to get me the number to call Grub Hub and you didn't come back on....someone else picked up wanting to know what they can do to help.  I had to tell them what I was waiting on and they gave me the number - even if at your request, you should have done what you stated what you were going to do.", "pics": null}}, {"review": {"des": "You been to 1 Wildfire you've been to them all right? Yeah that's my feeling. I guess w/it being downtown it's supposed to feel a little more uppity than the Oak Brook location, but it was just OK. We had to valet, which sucked (but that's downtown for ya). We had reservations for 7pm and were seated promptly. Our server was an older gentleman that seemed rushed & hurried. It was a very busy night, but he wasn't personable at all. He didn't care to build a repore at all. <br><br>We ordered the lemon chicken breasts, lamb chops, & bison meatbealls appetizer. The Bison was a new try for us & it was pretty good with a great marinara sauce. My lamb chops were requested to be med rare & they were more rare & not enjoyable. The lemon chicken was good. We had a few drinks, including the martini flight which was nice. The Bellini was tasty too.  <br><br>They're not my 1st or 2nd choice for steak, but they suffice I guess.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LuLWCAFJrxHZzVlN8Lv5JA/168s.jpg", "caption": "Lamb chops"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2CpNoRyJcaFagA99POwXRQ/168s.jpg", "caption": "Bison meatballs"}]}}, {"review": {"des": "The martini sampler and bar food is bomb. The dining service is really good. The food is alright. So a good budget place or happy hour spot. Fine dining...i may go another direction. But cant complain. Either way you will have a good time", "pics": null}}, {"review": {"des": "Wildfire was an excellent choice.  The service was exceptional and I do mean exceptional.  Right off the bat, they were extremely aware of one diner's gluten allergy (mentioned in my reservation note).  They handled GF issues better than ANY restaurant I've seen yet.  Every person starting with the hostess, including servers (Anna was absolutely great) and bartenders (we moved to the bar because we were originally seated between two large parties that arrived right after us, in the middle of the dining room, despite my quiet table preference, but we declined trying the booths on the edges).  The food was excellent, in my case the NY Steak Alforno was flavorful and tender.  Au gratin potatoes a bit cold.  GF bread as a starter, wow.  And quite the GF menu options, make it so easy to navigate the menu.  My wife enjoyed the bison burger on GF bun (not the best bun in the world but it's a gf bun and an excellent bison burger) and her baked potato was excellent and large.<br><br>Where I really have to commend Wildfire is the way they handled my wife's gluten allergy.  Every person we interacted with on the staff was aware of the gluten allergy and helpful and accommodating - particularly Anna, even AFTER we'd moved to the bar, if she walked by and heard us discussing a menu item, she'd offer how to make it gluten-free, which I really liked.  And the gf menu is posted online.  Some steakhouses claim to be gluten-free and it's really weak in my opinion, simply because they offer steak and seafood.  Anyone can do that.  What Wildfire does is much much more than that.  Not only is the staff awareness well above what I've seen from other restaurants, but the gluten-free bread offering is great.  That way you don't have one diner who gets the nice fresh hot bread while the other diner sits there.  And offering the GF bun for the bison burger (ok, it's not the best gf bun we've had but it's not bad, and heck, a bison burger is a great menu option anyway, nice choice!).<br><br>Of course, the food was excellent as well.  I found the NY Steak Al Forno really flavorful and loved the shallots and garlic and herbs, the sauce was great.  And a sizable portion (lots of other restaurants would give you less for that price) as well. <br><br>Other than the minor seating issue, this was 5+ stars!", "pics": null}}, {"review": {"des": "Went here with a group of 4 for dinner on a Saturday evening. The waiting area was drafty and the hostess stand was backed up. We had reservations and were seated fairly quick. Upon being seated we had a bit of a wait for our waitress. We ordered soup; French onion and the crab shrimp bisque and received it pretty quick. Our dinner took about 50 minutes to get and we had to flag down our waitress to inquire about it. We ordered the beef Wellington (very small portion) filet which was cooked correctly but was only slightly warm. The chopped chicken salad was good however did not have enough chicken or avocados for $26.95. Our waitress didn't check on us enough for a $276.00 bill. Service 2 stars food maybe 3. Would we return? Not sure.", "pics": null}}, {"review": {"des": "My fiancé and I came here for lunch after our flight from Miami. The ambiance was super cool very 50's style which we loved. We sat down and our waiter Rodrigo was awesome! I was undecided about what to eat and he suggested the Salmon sandwich and it was really good. My fiancé ordered the coconut shrimp which he really enjoyed and a beer flight. Since we were visiting from Miami and not sure about the local spots, Rodrigo gave us some great places to go see. Overall our experience was great!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/R1MgDdv9KaU38MMvTJH7cA/348s.jpg", "caption": "Salmon sandwich with fries"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Py_FAfsUfi1Zq7TzXZStwQ/168s.jpg", "caption": "Beer flight"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2bjymZlOd7f09ynehsexkw/168s.jpg", "caption": "Coconut shrimp"}]}}, {"review": {"des": "I came to Wildfire on a business trip with my colleagues. The atmosphere was typical of a Chicago steakhouse. Nothing too out of the ordinary. <br><br>I ordered the filet medallions. There were 3 filet medallions with a choice of 3 different toppings. I got the bleu cheese, horse radish, and can't remember the other. The filets were cooked to perfection and the toppings were very tasty. <br><br>My boss had some service issues, but I feel that I'm reviewing MY personal experience not his. All in all, the server was nice, the food was great, and company was even better.", "pics": null}}, {"review": {"des": "Where do I start?? All I can say is that Wildfire is my absolute favorite steakhouse in Chicago right now. The Parmesan crusted steak I had was amazing, the seasoning was perfect and it was sooo juicy. The drinks weren't very strong but good. The waiters and waitresses were all friendly and nice. The atmosphere was great and what you would expect from a great restaurant. This is my first place to recommend when it comes to steak!!", "pics": null}}, {"review": {"des": "While the food was good I must say I prefer their Glenview location. I was surprised to find that although they are a chain their menu is in fact different and even some of the items they share are prepared differently. For example the corn bread my son loves at the Glenview location, was way to spicy for him to enjoy here. At the Glenview location there is no spice what so ever in the corn bread. Also one of my favorite things to get at Wildfire is their bone in filet but this particular location doesn't have it even though it's a staple in Glenview they also don't have the black bean burger here. I\"m not sure why the menu is different here but I don't think it's particularly fair to customers who are used to their other locations menus and come in looking forward to something only to find this location is different. Additionally, the service was very inattentive. Yes, it's Mother's Day but an established restaurant should be able to handle a crowed and having to practically chase down servers for something as simple as a drink refill is a little unreasonable. In the future we'll stick with their Glenview location. Great menu and reliable service no matter how busy.", "pics": null}}, {"review": {"des": "Wildfire has the best salmon and mash potatoes! The interior is really nice  it's a little dark inside, which makes it romantic. I tried the martini flight and it was a bit too sweet. Tasted like jolly ranchers. My boyfriend tried the flight of white wine (awesome stuff). I would highly recommend this restaurant if you want to go on a date. It's not cheap and it's not too too expensive either. I spent about $130 on two salmons, a small salad, and two flights.", "pics": null}}, {"review": {"des": "The ambiance and the service were great, but the food was just a little overpriced and overrated. I enjoyed my seafood combo but my guest was underwhelmed with his trio of medallions. He felt that the sauces eclipsed the flavor of the meat. He was looking forward to Midwestern beef, so he regretted not ordering a simpler preparation. <br><br>Our waitress was lovely and very attentive. She brought free birthday dessert for my dinner companion. The Art Deco inspired decor was elegant with an old school masculine feel.<br><br>Bottom line- I would try again but perhaps make different selections from the menu.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EXfkNayYHBEMTjvxsw5ZgQ/348s.jpg", "caption": "Seafood combo - tasty array"}]}}, {"review": {"des": "Came here on a Friday night and it wasn't too bad. Had a reservation so it made the night easier. The bread they first bring out wasn't the best. The cornbread actually had corn in it which ruined the consistency of it. Just didn't like the bread option at all but good thing this isn't a bread restaurant. Next came the appetizer. I ordered the shrimp and crab soup. It was great but yet again the corn that was in it kind of ruined the flavor. The corn cut through the taste of the rest of the soup which wasn't great. The main course was the steak. It was cooked perfectly and with a nice crust on the outside. Great steak. Would come again to try other types of steaks. Sorry for any typos.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mqDNc9uhf9mAaLaksQZ_FA/348s.jpg", "caption": "Bread"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fgFLQe1uAOflG1Kg4HHIYg/168s.jpg", "caption": "Shrimp and crab soup"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xBZAdnYamCmBuCeoWvfAYw/168s.jpg", "caption": "Chicken satay."}]}}, {"review": {"des": "The bread basket they bring you when you sit down has warm corn bread that is some of the best I have eaten.  The onion rolls are pretty tasty too. Don't fill up on bread even if you want to because the rest of the food is fantastic.  Had the crab stuffed mushrooms to start and the tomato sauce on top adds that something extra to make it exceptional.  I had the almond crusted cod and it was cooked beautifully.  The sauce was really good with just enough lemon.  They have a nice wine and beer selection as well.  Very reasonably priced for the quality of food and it being downtown Chicago.  The wait staff was nice and attentive.  We were there on a Tuesday night and it wasn't crowded.", "pics": null}}, {"review": {"des": "The male bartender was rude to say the least. He has no business in the service industry. He ignored me and after going to the bathroom removed what was left of my drink. If it wasn't for the good service from the female bartender this would be a one star review. The bacon wrapped scallops appraiser was mediocre at best. The ribeye was a poor cut,  fatty with a lot of cartilage. I could find a better cut at Walmart...", "pics": null}}, {"review": {"des": "I really enjoyed Wildfire! Ahh the drinks were just delicious! The bread was soft and hot! <br>For appetizers we had calamari. I'm very picky when it comes to fried calamari, but they did an excellent job. Very crispy and tasty. Which is how I like it! <br>Then for our entrees my friend and I both got steak. It was cooked perfectly, exactly how we wanted it prepared. Service was good as well, our servers check in on us a lot. We kept talking and taking and taking our time which I know can be annoying but our server always checked in on us. <br>The only thing about this place that I didn't like was when I walked in the two hostess in front gave us dirty looks and I felt very uncomfortable walking in. <br>When I told them I had a reservation they kinda just gave me the cold shoulder and I was already uncomfortable but the food was delicious, I would definitely go back just maybe not on a special occasion because the hostess kinda ruined the beginning since I was so uncomfortable", "pics": null}}, {"review": {"des": "Brought a girlfriend here for her birthday, we were only 21. <br><br>Probably not the best choice. The pictures online really captured my interest when it came to picking a dinner spot, and I didn't really think about what the atmosphere would be like physically there.<br><br>Service was great, food was great. Atmosphere - really boring. Nothing special going on, no wall pictures, nothing to catch your attention, just very bland and basic.", "pics": null}}, {"review": {"des": "What happened with this place? It was once one of my favorite restaurants, yesterday it was terrible. Goat cheese appetizer was very bland, fresh mozzarella pizza was very bland, chicken skewers undercooked, <br>augraten potatoes undercooked and no flavor, French onion soup was over the top sweet, the bison meatballs were good. I'm hoping they just had a very bad night in the kitchen, so I'll give them another chance because this was very unusual.", "pics": null}}, {"review": {"des": "Wildfire lives up to its reputation. My steak was delicious. The potatoes and asparagus paired really nicely with it. I had to take half of it home, since I got full so quickly. My whole meal was still good the next day. <br>The only unimpressive part of my meal were the salads. I ordered the chopped salad, which wasn't impressive and wouldn't get again. I tried my boyfriend's Cesar salad and didn't like it either... it was overdressed or it might've been just bad dressing. The salads just weren't refreshing. I didn't mind though, I came for the steak.", "pics": null}}, {"review": {"des": "So i've ordered from here a couple times even trying delivery. After 3 experiences I never had an issue trying everything from Spit Roasted Half Chicken, Prime Rib (mmmmm) and mixed veggies and red skin mashed potatos! Their desserts are bomb too. <br><br>However, tonight I decided to go big due to a little extra money in the pocket and very hungry belly. Got the chicken AND prime and took a big risk on the Jump Shrimp Cocktail (i know, i know, dumb idea). <br><br>The shrimp i am not rating and take that as my own fault. But the prime was rubbery as hell, like they took a leftover piece from Sunday and threw it in the microwave. I could barely cut it and the rubberyness was awful ( I get these medium rare too!). The chicken was sub-par. Havent tried the sides because i lost my appetite. It must be a new chef or something but be wary when getting your food from Wildfire folks!<br>- Yours in Trust, Nate S.", "pics": null}}, {"review": {"des": "I have visited Wildfire twice over the past couple months. We were delighted with the service and the food selection was excellent. We think for the money this is a great place for a casual dinner.", "pics": null}}, {"review": {"des": "The restaurant atmosphere was very nice, good for groups and parties, not for an intimate dinner. I made reservations for 2 and we were seated at a really undesirable location at a table meant for 4 when there were plenty of booths available and better tables around. The hostess did not smile or greet us. We watched the expediter station throughout our dinner. Waiters kept bumping into our table since there was not enough room around it and they were yelling between each other. Service was really slow and the food was okay. Our soup sat on the expediter station for almost 5 minutes before someone saw it and brought it to our table, it was lukewarm. We ordered the Saturday special, which was Beef Wellington and split the dish between 2. The potatoes were inedible and the snap peas were greasy. Meat was good. For $70, I was not at all impressed with our dinner and I would not come back, nor would I recommend this to anyone looking for a steakhouse in the loop.", "pics": null}}, {"review": {"des": "They were surprisingly vegetarian-friendly and with gluten-free options, including several pizzas! The food was good, ambiance was unique, and service was a throwback! All in all, a good experience but nothing that particularly stood out as wow.", "pics": null}}, {"review": {"des": "Another landmark that quality and comfort was was was excellent!   I never ever send Food back to the kitchen.  <br>Had the Moroccan appetizer and it tasted funny and not cooked.  Looked inside and it was pink.  So yes sent it back to be cooked.  Svc provider thought I was being difficult ?!  Then @ the end of our svc provider ;she realized & commented about how odd night it was ! I reminded her about triple night.  So keep away on busy nights.   Eventually my entree was ok  !", "pics": null}}, {"review": {"des": "We came here in September to celebrate our anniversary. We heard great things from coworkers so we figured we'd try it out. We made reservations for 7:30 and we were seated right away. The seating is cozy and we got a nice big booth for just the two of us. Overall I'm glad we tried this place but I won't be returning back here. For the price you pay for steaks, neither of our steaks were very flavorful, they were actually pretty bland. Service was friendly but slow. At the end of the dinner it took over 20 minutes to get our bill paid for.<br><br> The table next to us had a middle-aged woman drunkenly celebrating her birthday. She kept hitting on the server and she just made the dinner somewhat annoying to be honest. The nearby tables were also observing her and I could see one of them recording video as well. It didn't ruin the experience or effect my opinion about the restaurant but it was somewhat obnoxious.", "pics": null}}, {"review": {"des": "Incredibly delicious corn bread for starters. I liked how the bread was not to salty nor too sweet. When it was served, I knew right away it was fresh from the oven (it had a lovely brown tint/hue). Next off, the cesear salad. My initial impression to the salad was it was loaded with way too much cesear dressing, goodness gracious. I was quite displeased to find out through my initial bite that the dressing was incredibly overpowering, which made the salad overall taste extremely sour/bitter. Onto my entree, my New York strip steak and fresh cut fries. Strip steak was decent. It would have been better if I would have ordered it less than medium well. The meat that I received turned out to be to burnt for my taste. Perhaps it was well done and I just didn't know. More importantly, the excessive grilling led the meat to have less marbling   and tenderness than what I initially thought it would have, disappointing to say the least. French fries however were great, they had a perfect amount of special seasoning indeed and they weren't too deep fried. Lastly onto my dessert, the New York style cheese cake. Cheese cake itself was adequate. However, they could have given me some more mixed berry sauce than what I was given. The cookie crust had plenty of crust compared to other cheesecakes, which was great.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VTSoMH4Cs9pynV3kDKw6Qw/348s.jpg", "caption": "Caesar Salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MuT0Jj2C5BtYFrhMDEw0Wg/168s.jpg", "caption": "Fresh-cut fries"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yjiHK_azZW0zF0WG6-mBrg/168s.jpg", "caption": "Classic New York Style Cheesecake (with mixed berry sauce)"}]}}, {"review": {"des": "Great Place Great Food and Great staff  will definitely love to go back here soon. My Martini Flight was also awesome. The lamb chops was delicious.", "pics": null}}, {"review": {"des": "Been here many times and always order the king steak, and a double bake bake potato, with a Merlot or whiskey, Sooooo good!  King steak is big enough to share with two or three people. I have never had a bad experience here always good. Nice place. And yes I've finish the king steak  with the double bake potato at times.  But my heart Regrets it after. Worth it!", "pics": null}}, {"review": {"des": "Wildfire is always a great place to come for dinner, especially with friends. The place has a nice cozy atmosphere, and the food and drinks are always excellent. We came here last Sunday for dinner with friends. There is valet service as well as street parking.<br><br>We were seven and had a nice sized table in the middle of the dining room. We started out with drinks and ordered the wildfire chopped salad to start. The portion is large enough to share with 4 to 6 guests. It is always consistently good. They have a nice selection of wines and a decent drink menu. One can order flights of martinis or wines if there is some indecision. I had the Moscow mule.<br><br>For dinner I ordered the bacon wrapped filet mignon, with horseradish crust topper, cooked rare. I got a giant baked potato as my side. My dinner was very good, but I think I would just get a filet cooked plain next time. The bacon and horseradish topper sort of detracted from the filet. See pictures. The prime rib is excellent; I usually get this cut of meat.<br><br>They have a large selection of desserts. For dessert I had the caramel apple pie a la mode. It was so good!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vkKsfv6z07bpdPvnv-1wCg/348s.jpg", "caption": "Moscow mule"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/V3cFB7rfm4L-AJIPopg6vA/168s.jpg", "caption": "Warm bread roll"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SlgQpO-eKl7CIoZ67AsTpQ/168s.jpg", "caption": "Dessert tray"}]}}, {"review": {"des": "Came here for a last minute change of plans for an anniversary. In a city with more than plenty of steakhouses this is an average steakhouse with a little more affordable prices. Pretty interesting roaring 20's theme which made it inviting to all, a little loud lots of kids too on that specific day (Friday night). Our steak was pretty tasty no real complaints. The real problem we had was the drinks. We had 3 drinks all heavily under-poured. When your dates someone whose worked in the industry as a bar tender and agrees that's there's little to no alcohol in your drinks. There's a problem. I've ordered Moscow Mules at maybe 20+ restaurants in my lifetime. I never had one that didn't taste like it didn't have any alcohol till I came to this place. Not sure how that's even possible with a drink that requires ginger beer. Won't be returning anytime soon if that's a standard.", "pics": null}}, {"review": {"des": "Excellent service and excellent food. I got the Flier Mignon with mashed potatoes and broccoli. The other meal is the lemon chicken breasts. Large portions. The steak was so tender and easy to cut! Recommended must try if you haven't.", "pics": null}}, {"review": {"des": "This place has anything anyone would want. It is perfect for business, dinner and birthdays. They have a large selection of steak, chicken and fish. They also have it where you can do surf and turf. They have a beautiful dessert cart that goes around. I don't eat dessert but it was very tempting. My favorite part of this establishment is the martini flight. It is perfect warm up to a girl's night out!", "pics": null}}, {"review": {"des": "Awesome wine dinners. The food is prepared perfectly with the wines. Staff and service are very friendly. The pepper encrusted lamb was out of this world if you like pepper.", "pics": null}}, {"review": {"des": "What an amazing dining experience! Joe J. was our server! He was excellent. I had the medallion trio. My boyfriend had the prime rib! Both were delicious! We will be back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-8ICaCrGcFtIDVExAYWTwQ/168s.jpg", "caption": "parmesan crusted medallion"}]}}, {"review": {"des": "Recently went to Wildfire with a party of 4 on a Saturday night. Here's the breakdown:<br><br>Good:<br>*atmosphere: the ambiance of the restaurant is a throwback with cool leather booths and old photos on the walls. The kitchen is open so you can see the team working hard<br><br>Negative:<br>*Service: The restaurant was very busy and, although there seemed to be staff everywhere, we had to flag down our server a few times for things like the check. Dessert took about 20 minutes, by which point we no longer wanted it and were ready to go!<br>*The details: This restaurant is quite pricey--my steak was somewhere in the $40-$50 range. For that price, I expect an \"over and above\" attention to detail. This restaurant does not offer that. The dishes and presentation are more casual \"supper club\" than refined steakhouse, my steak was overcooked, and the service was just \"getting it done.\" <br><br>Bottom line: while the atmosphere is fun (and the bar is good for a drink!), for that price point I'd go to a more refined steakhouse", "pics": null}}, {"review": {"des": "Don't be put off by the plain exterior - everything inside is on point. <br><br>I had the NY strip special and my wife had halibut, both of which were excellent.<br><br>Our server, Mindy, was great too - knowledgeable, helpful and fun.", "pics": null}}, {"review": {"des": "Old school without the weathered tired feel. <br>Went the full gamit from the special Peach lemonade, starter mixed salad with a many of chopped veggies.<br>Signature classic Crusted Halibut mashed potatoes and asparagus.<br>Portions were very fair and not skimpy at all.<br>Nothing fancy but straight forward tasty and served HOT.<br>Dessert offerings were in abundance.all large and fresh.Maybe? a option of a small pudding instead of big and well big. Minor detail though. Service friendly without being overbearing.", "pics": null}}, {"review": {"des": "one of our favorite dining experiences. Food is excellent and the service is phenomenal. The steaks  are awesome, the seafood is delicious, the sides are yummy. The service is great.  The deciris old school, very nice. I will go back here any time.", "pics": null}}, {"review": {"des": "Great food! Wonderful atmosphere! The drinks were spectacular... I'm giving wildfire three thumbs up, lol", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Q6yWUyd56zP7IHLqPF3INg/168s.jpg", "caption": "Great service! Wonderful drinks! Delicious food! Tremendous shout out to my server Nahum he was awesome."}]}}, {"review": {"des": "Great steaks at reasonable prices, especially compared to other steak houses in Chicago. Strip steak was excellent, cooked perfect. Wife said same re the prime rib. Meals came with a side dish, also a bit unusual for a steakhouse. Roasted vegetables were terrific as were the au gratin potatoes.<br>Wasn't too impressed with the Wildfire house wine, but cheap a 6.95 a glass. Plenty of good wines by the glass though, and at fair prices.<br>Very comfortable and inviting dining room. Nice bar also.<br>We've been to a couple other Wildfires before and has always been outstanding, as was this. We'll be back again.", "pics": null}}, {"review": {"des": "Came here for dinner for a friend's birthday. Overall a great experience (our waiter was wonderful). I got the lemon pepper chicken which I would highly recommend, it came with 2 chicken breasts and a side of my choice (I got the mashed potatoes). We ordered the s'mores dessert as well and it was great! My friend ordered the roasted chicken which was also a very heart portion. Another friend had the salmon and loved it. The service was great, we had 2 bottles of champagne and our waiter was very attentive. The only downside was that entering they were rude because one person was late so they wouldn't seat us. Otherwise a decent spot. Also their cocktails were very good and I'd recommend as a good spot for drinks!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bv7-KZEoOitcunFz2tjMhA/348s.jpg", "caption": "The lemon pepper chicken. Yum!"}]}}, {"review": {"des": "Very, very average.<br><br>Wildfire is primarily a steakhouse, though it doesn't bill itself as such.  The decor is traditional steakhouse, with lots of wood and black-and-white photographs of scenes from the 1950s.<br><br>The choice of appetizers were fairly uninspiring, but we landed on French onion soup (salty) and fried calamari (oily and overcooked).  Not a great start.<br><br>The mains were better.  The beef dishes were universally tasty, but the temps on the meats were off.  I ordered prime rib medium and it came out medium-well.  Another ordered his prime rib medium-rare and it came out rare.  The filet that was ordered rare came out medium-rare (almost medium).  On and on it went.  For a steak(ish) house, not cooking to temp is a sin.<br><br>The sides that came with the meats were subpar.  The double baked potato with cheddar cheese had ZERO flavor, except for a dash of paprika.  Actually, it tasted a bit like cardboard (no exaggeration) as confirmed by another guest.  It went virtually untouched.  The wild rice tasted like it came from a box (I'm quite certain it didn't) and had corn (atypical) and an odd sauce.  The au gratin potatoes needed seasoning and could have been crisper, but they were passable.  The creamed spinach was watery.  The mushrooms were good (but salty) and, while I didn't try them, the fries looked good from afar.  Not a great hit rate.<br><br>One more thing, the wine list is pretty lousy, chock full of uninteresting mass-market selections.<br><br>I'd probably consider this 2.5 stars, but I'm rounding up to account for typical Yelp grade inflation.", "pics": null}}, {"review": {"des": "Cosy place, full of Christmas decoration that made you get into some Christmas spirit. The food was delicious. We had crispy fried fresh calamari, lobster tempura & N.Y. Steak combo (daily special). A wild raspberry cosmo and a premium margarita to cool of with", "pics": null}}, {"review": {"des": "I tried Wildfire for a company lunch - fantastic!<br><br>The waitstaff was attentive, polite and friendly enough without being too over baring. We had a group of 9 and almost everyone ordered steak. <br><br>The appetizers of corn muffins were the best I've ever had.<br><br>The drinks were great! <br><br>The restaurant has a 'in your basement' kind of feel, because it lacked natural lightening and had old fashioned furniture, but no complaints it was clean. <br><br>It's the perfect place for a third or fourth date, or a business lunch or dinner.", "pics": null}}, {"review": {"des": "Nothing really special. When I first got seated with my husband the waiter asked if we'd been here before. When we said no, he goes \"well just so you know, this IS a steakhouse\". Yup, I got it bud, I know what kind of restaurant I made a reservation for! Let's see how great this \"steak house\" makes steaks. <br>First off, I thought the steak was really under seasoned and dry (I ordered my filet mignon medium). Although they give you a great portion, I think it's overpriced. The side of gratin potatoes was mushy, gray, and had no crust. The calamari was good. The drinks were okay.<br>For the prices you pay, the service (and food) should be much better. If they desire to price the steaks the way they do, perhaps there should be linen on the table? Maybe not have the kitchen showing? Idk just my complaint. It's sort of odd that the kitchen is open and has bright white lighting (looks chaotic) and then the dining room attached to it has soft yellow lighting. It sort of takes away from the \"magic\" of dining out. <br>Personally, if you choose to pay this type of money, I would suggest Ruth's Chris or Gibson's! Chicago has great steakhouses! Not sure if this is one of them!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/D2aDscma0Re2N3j-wrZOvA/348s.jpg", "caption": "Filet mignon and New York strip steak for my date."}]}}, {"review": {"des": "Restaurant is located in the far end of river north. Good for happy hour. Will try the meat selection next time", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/w-23s8NNMC1F78wjoqaBxA/168s.jpg", "caption": "Assorted snacks"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0gYdXtfa-4wihXwNojBLCA/168s.jpg", "caption": "Bread to start the meal"}]}}, {"review": {"des": "Very good! We were debating between going here or Bavette's Bar & Boeuf. We chose this place between the sides were cheaper and one came with an entree which seemed like a good deal! We got the pretzels as an appetizer which were slightly salty but the sauces helped balance it out. The honey mustard sauce was especially very good!<br>We also had a hard time deciding on which sides to get so we got broccoli, potato gratin, mashed potatoes, and mushrooms( LOL) all were very good except for the gratin which was sort of bland. <br>For entrees we got the prime rib (regular size) and the kansas cut. Both were very good and HUGE. I would like to try another cut next time though- I think I've had better prime rib at places like The Prime Rib and House of Prime Rib. <br>Overall a very good experience. Prices are very reasonable and service was excellent!", "pics": null}}, {"review": {"des": "I brought my boyfriend here for his birthday, and we had a great experience. The food was delicious, we didn't have to wait long for it, and the environment was relaxing. <br>I had the seafood pasta newburg & it was great. The scallops were tender and the amount of seafood in the pasta was very generous. My boyfriend had the filet medallion trio and we loved them (because I had to take a few bites). He ordered them medium and they were cooked to perfection. I had no complaints.<br>We also had the dessert trio that included a mini keylime pie, a chocolate peanut butter pie, and a turtle ice cream sandwich (can't remember the name). Everything tasted so good.<br>Every penny spent was well worth it. <br>& our waiter was kind and checked on us the right amount of times.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uQesrIwMx9_Elzlwgo4MJw/348s.jpg", "caption": "Our yummy dessert"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/30ZHOJNKbftkOSn-FSnkrw/168s.jpg", "caption": "Our delicious entrees"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZaoEtGLQZJIGhYmw3qitqw/168s.jpg", "caption": "Our calamari appetizer"}]}}, {"review": {"des": "Our table ordered filets, scallops, turkey, and fish for our entrees.  All were exceptional.  I ordered the macadamia encrusted halibut special with rice as the side.  It was wonderful, crispy and lightly sauced.  <br><br>The apple pie dessert was awesome.  It was so good that I didn't want to share it.<br><br>It was an easy, no hesitation 5 star rating for the food.<br><br>I hope to go back to Wildfire next time I'm in Chicago.", "pics": null}}, {"review": {"des": "I always enjoy my time and food at Wildfire. Food is always consistently good and the service is always on point. It probably also has a lot to do with the fact I pretty much stick to the same entree and that's the BBQ salmon. I love salmon and they have mastered this dish, and in my opinion no other restaurant has come close to duplicating the way they prepare it, although many restaurants have attempted. Their redskin mash potatoes, asparagus are other hits here and let's not forget the signature cornbread...just magical.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bQJom75aVMp3bERGdn0zzw/168s.jpg", "caption": "BBQ Salmon"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iKtHMjBtFSndzoNuN6E0Mg/168s.jpg", "caption": "Taking flights"}]}}, {"review": {"des": "Very nice and old school restaurant. The food and drinks were delicious will return again!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Xlkw5_wZeh1wB58UTk8Ctg/168s.jpg", "caption": "Martini Flight"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zYqN_9QG-NEHiKNImYuzAg/168s.jpg", "caption": "Seafood platter! Yum"}]}}, {"review": {"des": "Pretty damn good.  First things first, I went to Wildfire a few weeks ago and had the  surf and turf...yes please.  The roasted vegetables...yum!  Salad...now THATS what I call a chopped salad.  All of the ingredients cut small enough to enjoy all of the flavors.  <br><br>I dont recall what night we were there, but they had half priced bottles of wine, I don't hate that idea.  <br><br>The service was good.  The atmosphere was peaceful.  <br><br>Moving right along...we ordered takeout from here last night.  Another salad, crisp, huge portion, of another perfectly executed chopped salad.  <br><br>Also, the vegetables...Im a creature of habit what can I say...annnnnd drumroll please...the salmon.  SOOO good.  It was cooked perfectly.  The taste...wow.  The only thing I wasn't a fan of was the bread, apparently they give you two options, and it didnt really do much for me...then again its summer...just say no (to bread.)", "pics": null}}, {"review": {"des": "My daughter wanted to come here for her birthday and have bacon wrapped scallops. Now that I am gluten free and on a low FODMAP diet it is difficult for me to eat out. However, I cannot speak more highly of Wildfire's consideration of gluten free diets and our waiter Phillip's attention to detail. It is the only restaurant I have been to so far that gave me gluten free bread in addition to the regular bread basket. Not to mention that it was perfectly warmed and delicious! The house side salad was plenty for two. My gluten free cedar planked salmon was perfect, and the au gratin potatoes are a must. Probably the best potato dish I have ever had in a restaurant! The bacon wrapped scallops did not disappoint. My daughter also had a small pizza that looked scrumptious, and my husband really enjoyed his pork chops. The ultimate kindness was that they brought us two free desserts for the birthday girl. One was delicious gluten free flourless chocolate cake! My daughter was given vanilla ice cream over fresh berries, that were ripe and tasty, surprisingly so during the late April season. Needless to say, we tipped well. Phillip also reminded us that we had a birthday bonus on our Lettuce Entertain You account that we could use and still collect points. It was a wonderful evening and we could not give a higher recommendation for food quality and service.", "pics": null}}, {"review": {"des": "This is a great restaurant.  I had one of the best steaks I've ever eaten in my life at Wildfire.  The ambience is nice but kind of dark. Maybe they're going for a romantic vibe.  For appetizers we had the calamari and shrimp cocktail.  They were very good.  I had the porterhouse steak with bleu cheese crust and macaroni and cheese.  This steak practically melted in my mouth.  It was cooked perfectly and seasoned very well.  I also had the Martini Flight (cosmopolitan, green apple, wild raspberry Cosmo, stormy night).  Each was good, but I had to order the stormy night in a full size.  It was that good.  The service was great, and I will definitely return.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eqq8AcP11yQhEOQbmy3meg/348s.jpg", "caption": "Martini Flight (cosmopolitan, green apple, wild raspberry Cosmo, stormy night)"}]}}]}