{"name": "willis-tower-chicago-3", "reviews": [{"review": {"des": "Go early or be prepared to wait in a massive line. Now if you can manage to arrive when they first open, everything is pretty much smooth sailing.  <br><br>Security and staff could be a little friendlier, that's my only negative, but overall they have a good flow of things. <br><br>Once you're about to get ready to get in line, you take a picture in front of a green screen which will show you in the glass case on top. Special effects ya gotta love em.<br><br>The elevator ride up is cool as, as you go up floors it will tell you the height of certain things to compare how far up you are. The elevators are smooth riding that you can barely feel it go up. <br><br>Once at the top, you get in another line for pictures. You have options on which side of the building you want to be photographed.  Now depending on the group size, is how much time you get. We were 3 people so I believe we had a minute to take pictures. The guy that works there was not the most accommodating and he basically took the pictures for us like he really didn't care and I get it. You deal with a ton of people, but for us it's a first time experience, please put a little heart into making sure the picture looked nice. Either way I photoshopped it, so we could at least see our faces.  <br><br>Aside from that, the Willis aka sears tower for me, is gorgeous! The second tallest building in the US, if I am not mistake, it has an amazing view.  We went during the day, but I would love to see it at night.", "pics": null}}, {"review": {"des": "My first trip to Chicago we opted to do the John Hancock instead after reading several reviews.  This second trip it made sense to check out the Willis. <br><br>Buying tickets online in advance to skip the line was definitely a must.  We breezed through in minutes while walking past a very long, slow moving, line. <br><br>The view at the top was ok. Glad we did it but it wasn't life changing by any means. <br><br>Of course the draw to the Willis is the glass sky boxes that stick out of the building for those awesome pictures. This you have to also wait in line for and there's no fast pass option. I think we waiting about an hour, of course betting on a line that moved slower than the one next to it.  Overall though, these sky boxes are worth it for the pictures opportunity!", "pics": null}}, {"review": {"des": "We just got back from our first visit to Chicago.  We're Buffalo natives so large buildings and skylines are always a planned stop for us.  We visited the John Hancock building the night before and did the Tilt Experience.  We were hoping to get a similar touristy experience at the Willis Tower (Sears).  <br><br>It's a long walk to the entry queue and you don't know how long the wait times are.  When we arrived, we found the line to purchase tickets was 30 minutes and the line to get up the elevator was 90 minutes.  We were short on time so we purchased fast pass e-tickets on our phones and shortened our overall queue to ~ 20 minutes.  This was $100 for two people.  Worth it?  Maybe, it depends on your priorities. <br><br>The queue staff were not observing the merge point for fast pass and regular ticket entry.  It was very confusing.  We were then put in an elevator like sardines.  Fortunately, it's only a 60 second ride in the elevator.  I could see someone having some serious claustrophobic panic if it was any longer. <br><br>The observation floor is large and has a nice gift shop area.  We didn't spend too much time there because we immediately got in line for the ledges.  They are free so just about everyone makes it a point to get in line.  We spent about 45 minutes in line to spend 60 seconds on the ledges.  Again, the staff were not supervising the line and we watched many tourists cut in front of others to get ahead.  Pretty infuriating. <br><br>You ARE able to get some nice pictures of the skyline while waiting in line for the ledges.  Two birds, one stone I guess.  <br><br>We knew we would try and get some photos on our iPhones on the ledges, but we figured there would be some sort of professional photo package we could purchase.  Wrong!  We ended up with really faded and blurry iPhone photos and were rushed away from the ledges very quickly.  I don't think we got one nice picture out of the entire experience.  I would have paid good tourist money if there was an option to get a professional photo print.  It's weird to me that they don't do it. <br><br>All in all, it was a decent experience.  I'm happy to say we were able to do it.  I do, however, prefer the experience at the John Hancock building.  I don't think we'll do Willis Tower if we're in Chicago again.", "pics": null}}, {"review": {"des": "Willis Tower, the iconic building that makes Chicago skyline what it is, is everything I expected. <br><br>Right now there is a lot of construction, which takes away from its grandeur. The lobby staff is very helpful in assisting visitors to find their way though. They were friendly and all smiles which was nice. <br><br>Getting up to the observation floor is a process. There wasn't a long line when we were there but I can see how the queue could get very long. There is a lot of info and photo ops as you wind your way to the elevators. <br><br>Once you get upstairs, the observation floor is big, clean and organized. There's a gift shop and another set of queues to stand on the glass floors. It's very organized though and it was very easy to navigate. And as you leave, downstairs there is another nicer gift shop and several snack options<br><br>OK so the views can't be beat! The windows offer several vantage points. The pay binoculars machines worked really well. <br><br>I live in Chicago and visit Willis Tower when I have friends or family in town. But now that I came back after several years, I can see the draw. It was a beautiful experience.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FEGf-Ov2fv3zHctobDGAVg/348s.jpg", "caption": "Now that's a HUGE shopping bag!"}]}}, {"review": {"des": "Long wait to get to the ledge and then you're rushed off it. A minute isn't very long.<br><br>We went at night when the lines were a bit shorter but imo it's just not worth the time and the money.", "pics": null}}, {"review": {"des": "Great views.  It was packed on the day we went.  The line to get in the elevator to go up and for the sky deck was long.  We were stuck waiting in line majority of the time we were here.  The sky deck is on the west side of the building.  Chicago skyline is on the east side.  Great views of downtown on the east side.  The sky deck was a cool experience, however we were rushed.  So many people in line so the staff had to get all of us through so it wasn't that memorable.  Still pretty cool though.  <br><br>The views are nice.  But if i had to chose between John Hancock or the Willis tower observation deck, John Hancock takes it.  The Willis is cool and if you haven't been to it, for sure check it out.", "pics": null}}, {"review": {"des": "Tip: Go super early...as in when they first open. If you go around noon and later it's a 2 hour wait! We made the mistake the first day to go around noon... and the guy was like it's a 2 hour wait...we immediately turned around and planned for our next attraction. We came back the next day when it first open and had no wait. <br><br>Also if you get the Chicago Explorer Pass you do not have to wait in line to buy your tickets, you still have to go through that way and then skip the cashier line and straight to the scanning lady. I hate how they make you take a picture- and that's why it makes it a 2 hour wait. It gets bottled neck at the 2 people taking pictures. We asked if we can skip and they did not let us...really stupid. <br><br>View is amazing... 100 and something floor. Once you get up, head straight to another line to get a picture in the famous bottom glass window. Then start taking pics of everything else.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oc2iIEzhF_z12U1rFjYKag/168s.jpg", "caption": "Jumping!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/E6q3-hTel6Zl95ylce7wrg/168s.jpg", "caption": "View"}]}}, {"review": {"des": "Loved visiting Willis Tower with my girlfriend. You can see the entire city and it's simply beautiful.  They give everyone a chance to sit and take pictures on the glass balcony which extends four feet outside the 103rd floor. It's terrifying but also extremely thrilling! I'd definitely recommend it to tourists and visitors of Chicago!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6DLH8Ae-liVfdVduURbilg/348s.jpg", "caption": "IG @jessijaejoplin"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YJbT5jWgiAYqPyquVV8L2g/168s.jpg", "caption": "IG @jessijaejoplin"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mc-OJ3Ugulw--HZ9y3TTxg/168s.jpg", "caption": "IG @jessijaejoplin"}]}}, {"review": {"des": "WOAH. The lines here are really long! But I think it's all worth it in the end. I would go with a group of people (or a single person) that you really are comfortable spending long periods of time together, because this wait is no joke. A lot of the Yelp reviews recommend buying a fast pass...yeah, I didn't do that. But I survived, and you will too, if you don't buy a fast pass. But do it if you want your life to be that much more convenient. <br><br>When you finally get to the elevators, be ready! They move really quickly. I really enjoyed the elevator ride though, because they tell you how high up you are in comparison to other well known buildings or structures like the Eiffel Tower. Once you get off the elevator at the top though, be ready! There's another whole waiting session before you get to take pictures in the little glass pods. But the view was definitely worth it, and I wish I could be up there again. It was honestly a really cool experience. 10/10 would recommend doing it at least once. And the price to get up isn't too bad! Take lots of pictures when you're up there!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5J5FA8Oz4y5RNvczIfOETw/348s.jpg", "caption": "There's lots of spiders outside, which I was quite confused about so I took a picture. But wow, that view behind them though!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VZoVYZWrz3R_6i8NBZbwZQ/168s.jpg", "caption": "103 floors, wow."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gIoT9mY2CffHUEV7qKWgtg/168s.jpg", "caption": "In the waiting lobby before the elevator--they have other ones besides this one!"}]}}, {"review": {"des": "Long lines on weekend day! Come on a weekday. Always check the forecast and come picture ready!", "pics": null}}, {"review": {"des": "I've been here since it was called Sears tower and on this last visit it was silent yoga on the top floor. Many different improvements have been made and some on their way. Security has improved and people were friendly here. <br>The elevators are a bit slow but they get the job done. Once on the observation floor you'll find out what makes the Willis tower so great to visit when you're in Chicago. The views are awesome and you can visit during the day or night and you'll see a complete different look. On a nice clear day you can see very far and the pictures you'll take will look awesome. <br>If you haven't stopped by, you should.", "pics": null}}, {"review": {"des": "Came here in the afternoon after lunch and was forewarned about how bad the wait can be. Upon entering there is a line to get security screened, but the security is relatively lenient even with the x ray and metal detector. It was painful to watch fast pass holders get prioritized but it was also expected because they did pay a higher premium to skip all of the general admission line. The security personnel are apathetic to the people coming through so I did see some general admission holders just go along with the fast pass line. <br><br>After going through security there is another long slithering line to wait for the green screen photo. The AC works poorly and the stench of peoples BO is really nauseating. Be wary of people trying to cut as the lines can be chaotic. To keep track of the lines...<br><br>1. Line for security check (before showing ticket), fastpass will get priority so if large groups of people with fastpass show up you will have to wait. <br>2. Line for wristband and ticket. <br>3. Line for photo op. <br>4. Line for elevator which winds around the building and showcases random details of the building. There's a section where you learn about the history of the building via video and that would've been nice to have in all part of the wait. Fastpass also meets with general admission near the elevator so you have to anticipate another wait for that as well. <br>5. You're finally up the elevator! Now wait in a line to take a photo at the sky deck. <br>6. Line for boarding the elevator to exit. <br><br>Once you're out you just need to go through the photo section, food court, and souvenir shop to leave the building. The opportunity is very unique but the operations are too chaotic. Fastpass is basically the way to go because while I waited 2.5 hours to get to the top another person only waited half an hour with their fastpass. <br><br>Would not come back to deal with the mess and the AC didn't work in half of the waiting areas.", "pics": null}}, {"review": {"des": "Such a beautiful place with SUCH gorgeous views. I've always wanted to come here and finally did!! I love how it's spacious enough to accommodate the large crowds of people that visit daily. Chicago is beautiful and Willis Tower is an absolute MUST if you're ever around!!!!!!!!", "pics": null}}, {"review": {"des": "Wow, if you ever want to visit, plan EARLY. Like as early as it opens! My sisters and I made the mistake of not planning early, so we paid for it. Anyway, we decided to visit Willis/Sears Tower on a Saturday afternoon, our last day in the city. My sister had already purchased tickets through Trip Advisor. Second mistake we made, we did not read the reviews others had posted about the wait time. Once we realized we would need to wait at least 2 hours on the weekend, we really wished we could get a refund for our tickets. Unfortunately we weren't able to. So with positive spirits and an anticipated 2 hour wait, we braved the crowds in the lobby and decided to wait to go up the tower. <br><br>After you enter the lobby, you are directed downstairs to go through security. The line continues to weave in and out, so it gets harder to figure out where you are at and how far along you still have left. Luckily there are bathrooms and vending machines for water halfway in. There really isn't much to do while you wait in line, so be prepared to chat with your date/party for a really long time or be on your phone. Occasionally there are benches for the elderly or really exhausted patrons. <br><br>Eventually there is hope! You near the glass window that leads you to the  elevators that will whisk you up to Floor 103 in 60 seconds! WOW! The 360 views are truly magnificent! BUT wait, now you have to wait at least another 30 minutes in line for one out of the four ledges where you can take your typical \"HEY! I'm standing on a ledge!\" photo. There are four separate lines, so make sure to stand in the shortest one that actually moves. Otherwise, be ready to wait another hour for the ledge photo. I believe one line for the ledge has a professional photographer who will take your photo for you, but you'll have to pay for it downstairs, and he/she will only let you stand on the ledge for 2 minutes max. The other ledge lines you do not have a time limit, which is both good and bad.<br><br>Overall, we spent 2.5 hours in line on a Saturday afternoon. Was it worth it and would I do it again? Likely not. Once we got to the top, it seemed as if people were more interested in the ledge photo than appreciating the gorgeous skyscape view of Chicago around them. If you do go, plan to go very early so you can spend the rest of the day enjoying downtown Chicago and eating good food. Good luck!", "pics": null}}, {"review": {"des": "Once you go through security and pay it is the wind through the displays to the elevator.  Once at top, forget trying to going out on the Sky Deck unless hanging out for 1+ hour to step out on the Deck is your idea of good time management.  Fools taking ENDLESS SELFIES like they are the only ones in the world up there.  They really need to get this under control and limit people to one minute when the lines are long.  Just plane rude.  Sunsets are nice and once you get done the elevator dumps you into a maze of tourist traps.  Candy, shirts, hats, shot glasses etc, etc, blah, blah.  If you have never been there, do it once in your life.  Any more and you are setting yourself up for disappointment.  I know, I did this twice in two weeks and two exact same experiences.  One with the Mrs, the other with guests.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6V4eRMWOV6pFdt8FLtTXmQ/168s.jpg", "caption": "Great views."}]}}, {"review": {"des": "It's the most famous site in Chicago so it is obviously worth the visit. Like all skyscraper viewing sites it is overpriced, but because of the glass cases that jut out of the platform, at least it has more character.", "pics": null}}, {"review": {"des": "The idea of going to The Ledge did not really excite me but it was on my husbands list so off we went.  We visited The Ledge on a May Sunday evening and it was dead.  There was not any wait to go up the elevator so we quickly wove our way through the Disney World-style corral and ascended to the 103rd floor.   <br><br>Once upstairs we looked out the windows on all four sides of the building and then we got in line to go out on the actual ledge, which is more like a glass box that hang off the side.  We probably waited about 20 minutes to go inside the glass box which was not particularly thrilling. Plus, they usher you on and off of there quickly so it's really about getting a photo and checking the box instead of enjoying the moment.<br><br>After going out on the ledge, we looked out all four sides of the building again.  We timed it so we would be there for daylight and sunset. After seeing the city lights we were ready to get out of there.  <br><br>Like any good attraction, the tour ends in the gift shop.  There are three gift shops, actually. The first gift shop is more of a small kiosk on the 103rd floor.  The other two gift shops are located downstairs after getting off of the elevator. Once downstairs, the first gift shop you come to is large with nicely displayed items.  I found the stuffed hot dog fun but ultimately left with a Chicago hot dog ornament for my fun/tacky tree.  <br><br>Overall, I think I enjoyed the gift shop more than the actual ledge.  I'm very, very glad that we did not spend hours waiting in line because I know that can happen.<br><br>The Ledge is easily accessible from the historic Quincy station on the L.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Y5UhqfcGSThb0yqz4_5seA/348s.jpg", "caption": "Nearing sunset.  This view is to the south."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VCU5ygmz4rmNl36Zvcyp_w/168s.jpg", "caption": "A view towards Lake Michigan and the hear of Chicago."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/flc2_nMirC4XAMHt_1Mq4g/168s.jpg", "caption": "Sky Deck art work for those scared of heights and not wanting to look out the windows."}]}}, {"review": {"des": "Going to the sears tower used to be one of my families favorite things to do but it definitely has changed. Staff member seem disengaged and unhappy. Most aren't willing to help you unless you hunt them down for assistance. Granted they have some construction going on now but for the cost you pay and their should definitely be some organization of the crowd. To get to the glass boxes it may take you well over a hour as people crowd into a line and wait while staff members were present at an empty box they had blocked off. Not one person controlled the crowd or the flow of lines as some people went to the front and proceeded to have a photo shoot while a crap ton of us waited. So this monstrous line you have to get through to get to the box is the same one you have to mitigate to get out. Do yourself a favor and get a city pass to beat the wait in line to get on the elevator to go up.", "pics": null}}, {"review": {"des": "My first time in Chicago and I had to come to Willis Tower. I went last Monday  and I enjoyed just traveling in the tower the elevator ride was  so fun seeing  how tall we were compare to other building around the world. The wait for the ledge pictures was about 10 mins and  I went in there and had a great  photo shoot. It was cloudy but the sun setting was so beautiful and I was in amazement by the view even in the fog.<br><br>I went to the gift shops and  bought a few things and keep going down and  hit up more gift shops I loved  it all and I bought  more gifts to bring home to my family.<br><br>I just want to revisit when it's better to see outside. But I will be back Willis tower to see and bring more family.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_xoWVao6iPKNG1cgLJzDVQ/348s.jpg", "caption": "Michael Jordan"}]}}, {"review": {"des": "Visibility zero. However, the experience was priceless. Just the elevator ride alone was worth the trip. Yes, it would have been exciting to stand on the Ledge on a clear sunny day, but knowing I was outside the building was a thrill.<br><br>The personnel are all very friendly and helpful.", "pics": null}}, {"review": {"des": "You know what you're going to see. It was the tallest building in the world for many years, and is the tallest in the hemisphere after One World Trade Center. I am a bit curious, though, because the Trade Center observation floor is 102, while the Sears Tower SkyDeck is on the 103rd floor. So regardless of which has the highest antenna, which one allows me to be higher? Neither one seems to talk about that.  Still, cool views from either one. <br><br>I have heard that the view from the John Hancock building in Chicago is also great, but standing in the SkyDeck, you can see that Hancock is obviously lower. But that's probably also worth a look. <br><br>There is no time limit when you're standing on the glass floored windows. This is good and bad. A pair of European girls spent what felt like half-an-hour making stupid poses at their iPhone, and they had brought a tripod for just that purpose. I was, naturally, filled with rage while waiting for them to get out of the way. But on the upside, everyone else was quite quick, and we felt no pressure to rush our own photos. But standing on glass  1/2 a mile up is uncomfortable, so I don't think anyone except the Eurotrash girls took very long. <br><br>There is an official photo they will take of you, and it's very good. It's $30 bucks but yeah, it's worth it. Yes, standing there is a bit nerve-wracking, but just relax and you'll love the photo. Go ahead and jump up or make a heart or do anything memorable. You're on top of the world. <br><br>Note on the name: Willis is some insurance broker based in London. They rented enough office space in the Tower, and paid enough rent, that they could ask for naming rights to the building. The investors who own it aren't  idiots, so officially, it's \"Willis Tower.\" But Sears was the world's largest retailer in the world when they built the thing, and while Sears vastly overestimated its own future growth, not foreseeing Walmart and Amazon, they should get credit for building the place, right?", "pics": null}}, {"review": {"des": "Awesome view of Chicago. About $24 for an adult and you can take a picture of the box. They have enough room to form a line and you do not feel pressure as to how long you can stay but of course just be mindful as to who else is waiting to get one", "pics": null}}, {"review": {"des": "We come here because it was in our City Pass and wanted to see the city from this height. You know you are going up pretty high, but it really hits you when you are on the elevator to the observation area.<br><br>We came as the sun was setting, so it was dark but not too dark and it was amazing. We were able to see a lot of the city and it was worth coming.<br><br>It was a little busy in the tower and we had to wait to be let up into the observation area, but it was worth the wait. It is also very easy to get a taxi to and from this area.<br><br>This is worth coming to see at least once whether you are a tourist or from the area. Nothing beats this view. I am not sure I would come and pay to do it again though. It is one of those one and done things. But I think it would look different at different times of the day so maybe I will come back!", "pics": null}}, {"review": {"des": "SKYPIERCER<br>_______________________<br><br>Member of Willis family: \"So yeah, we're gonna rename the building after us, hope that's cool mmmkay?\"<br>Chicago city alderman: \"Whatchu talkin' bout, Willis?!?\"<br>_______________________<br><br>Ignore the official title, and instead marvel at the historical engineering feats surrounding one of America's tallest buildings.<br><br>As a born-and-raised proud Chicagoan, I will never, *ever* refer to this building as anything other than the SEARS Tower.  I don't care how much money the Willis family paid to have their name slapped on the side of this amazing skyscraper, a change in moniker means nothing to me.<br><br>(( on a related note: Guaranteed Rate Field, a.k.a. \"new Comiskey\" will forever be Sox Park to me, regardless of whatever company's name gets plastered on the venue.  Furthermore, if Wrigley Field ever gets bought out and becomes Old Style Stadium, I'll still refer to it as a fratty pissbucket ))<br><br>The Sears Tower is the 2nd-highest building in the Western Hemisphere, after One World Trade Center in NYC.  It was built way back in 1973 and debuted as the tallest building in the world, laying claim to that honorable title for almost 25 years!<br><br>Engineer Fazlur Khan designed a unique bundled tube structure that would allow the mammoth structure to be built in sections.  With antennae, it tops out at 1,729ft which fueled a height war with Malaysia's Petronas Towers as to which was \"taller\".  Eventually Taipei 101 joined the ongoing debate before the Burj Khalifa ended the argument once and for all.<br><br>United Airlines' center of operations (and corporate headquarters) occupies nearly 20 floors and are the #1 tenant within the massive building.  The glass walled Ledge is part of the Skydeck on floor 103 and makes for a popular tourist attraction.<br><br>On a clear day, you can see 4 different states from the observation deck: Wisconsin to the north, Michigan to the east, and Indiana to the south (plus Illinois, duh).  For those planning on visiting, I would urge you to check the forecast ahead of time -- a cloudy day will surely sour your visit!<br><br>The only thing to watch out for is the interminably long wait in the tower's underbelly.  I waited nearly THREE HOURS to check out the Skydeck with Nichole C and her brother, so non-peak hours are preferred (i.e. not weekends or school holidays).<br><br>As one of the Windy City's most easily recognizable symbols, the Sears Tower is a landmark that should be around for eons to come.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pKtcuStolPTNILSJshkpmw/348s.jpg", "caption": "It's still the SEARS TOWER to me. Always has been, always will be."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wsSxJ0CQcvQPlYcs1FKCmg/168s.jpg", "caption": "Looking west towards the suburbs, it's quite a view from 103 floors up!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mrYg420XAZ0ma7bEuRgATg/168s.jpg", "caption": "An amazing view of the city to the north!"}]}}, {"review": {"des": "Hello Chicago's other tourist trap, but truly a must for any first-timer like myself! I recommend looking on Groupon or websites for discounted tickets! <br>Original ticket price is $24/person, my roommate and I found some for $20 online! This saves you from waiting in line to purchase tickets as well!<br><br>To get to the entrance, you'll have to enter the Willis Tower and go down two escalator flights. I arrived here at 9:30am on a Saturday morning and was able to get through the line and security check within 10 minutes.<br><br>You'll be going up the elevator several times; it just shoots you up to the observation deck. Be prepared to have your ears popped!<br><br>Once you've reached the observation deck, quickly make your way towards the left end of the floor. This is where all of the famous photos are taken, they have several windows open and there is generally a line. You can get back into the line as many times as you want once you've passed your turn! Once you're done, feel free to roam the floor and enjoy the view below! <br><br>**They also offer FREE WIFI!**<br><br>Overall experience here was great. Just like any huge city in the US, Willis Tower offers beautiful views of Chicago from below. Definitely a tourist trap, but incredibly tough to resist. I'm glad I finally got the chance to finally be here.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EzxfiqIPAQReqUuZCeYGpA/168s.jpg", "caption": "Overcast"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/G8b9h_j6K6Gv8QjpcIRZLw/168s.jpg", "caption": "Skydeck Views"}]}}, {"review": {"des": "This is a must if you're visiting Chicago. If I come back to Chicago, I'm definitely stopping here again. Here's why:<br>--Get a beautiful view of the city <br>--Get great pictures (there's good lighting!) <br>--Adventurous elevator ride to the top floor!<br>--Visit in the day time, you can see the city clearly <br><br>There's about 4 lines where you can take pictures in the famous glass floor. When I was there it was a little busy, but the waits aren't long because there was someone monitoring the lines and kept the line moving smoothly. They also have a service where they will take a picture of you and/your group on the glass floor and you can buy it when you ride back down. Standing over the glass is quiet thrilling and scary!! They also have the large viewing scopes to look closer into the city. Lots of great exploring up there! <br><br>I bought a city pass so this was a great offer to have in the package (look it up on Groupon). There's many gift stores in the building, so if you want to buy keychains/gifts you can purchase some here.", "pics": null}}, {"review": {"des": "Of course we had to stop by the Willis Tower formally known as the Sears tower, on our weekend trip to Chi-town! <br><br>We jumped in an UBER from our hotel which was about a $10 dollar ride. There were no lines outside or upon entry inside of the building so we're thinking this is going to be a breeze.<br><br>SIKE! Once we got upstairs there was a long ass line lol which was fine because that was on our agenda for the day and the only thing we really had planned. <br><br>They have a express elevator which happened to be closed for maintenance that day, so hence the long lines. We waited for about 30-40 minutes as the line crept closer and closer to the elevator doors.<br><br>Once we finally reached the top, as everyone made their way to the binoculars to see the view from the top, we sprinted towards the sky gate to take our pictures before there were any lines there! lol figured we'd get it over with. <br><br>We made it to the front of a line and there was already a group of friends who were already on the skygate taking pictures. We patiently waited, as we observed that this group of friend had someone on every sky deck! They could careless that the line was getting longer and longer for other people who wanted to take some photos and continued to bounce back and forth from Skydeck to Skydeck taking pictures. When they finally left, we stepped on looked around, soaked in the view and it was scary as shit, but cool! <br><br>We then walked around and soaked in the 360 view from the 102nd floor. <br><br>Good times...", "pics": null}}, {"review": {"des": "Definitely go during the weekday. We were really fortunate that the skies were clear and the lines weren't that long. When it was time ro take our iconic pictire there was a worker that was very unpleasant and harsh.<br><br>Other than that view are mesmerizing. And not too bad for 24 bucks", "pics": null}}, {"review": {"des": "3 hour wait with pre-purchased tickets<br>For $50+ more you get an express pass which cut it to 1 1/2 hours... thanks but no thanks - I'm afraid of heights anyways.<br>Only do this is you absolutely have/want to and go super early or when there's bad weather", "pics": null}}, {"review": {"des": "The Skydeck at Willis tower is 103 floors up in the sky and it will give you crazy good photos for a life time. The cost was approximately 23.00 and the photo of you standing on the glass floor are priceless and scary!!! I dare you to face down!!!!! <br><br>Regardless you will have  a nice time and experience a Chicago landmark!", "pics": null}}, {"review": {"des": "Great experience! My suggestion is to get there around 7-7:30 during the summer time (which is the best time to go to Chicago) and you can catch the skydeck view with daylight and the night view. <br><br>The fear of the ledge only lasted a split second because the view was so spectacular. <br><br>They do a great job of navigating you to the top and though there was a lot of people around, it wasn't unbearable. <br><br>I could get through the line in less than 10 minutes (even with parties that took a million pictures each). I think they have a pretty efficient process going. <br><br>The staff weren't that friendly and they don't necessarily try to engage you - unless it's to get you to buy photos, but that doesn't take away from the experience. <br><br>Definitely a must stop if you're in town.", "pics": null}}, {"review": {"des": "When in Chicago, the Skydeck should be number 1 in everyone's list. My friends and I bought the Chicago Citypass which you definitely get the most bang for your buck. Fair warning: avoid going on weekends. <br><br>The wait: We went around 10:00AM and there was already a wait to get through security. Luckily for the Citypass, we were able to speed through the line since Citypass holders have a separate fastpass line. It didn't take too long to get up - maybe 10-15 minutes. However, the wait to check out the skydeck was long (approx. 30-45 min). <br><br>The view: Although our experience in the skydeck was short. You definitely get the best view of Chicago. Luckily, we had clear skies the day we went so we were able to see all of Chicago. I was kind of annoyed that the workers had to rush us because we were a bigger group (5 people). We should at least get the same amount of time to get our photos and enjoy the view, but I understand it was a busy day...<br><br>By the time we got back down, the line was wrapped to the side of the building...<br>Word of advice: Go early.", "pics": null}}, {"review": {"des": "Great views over Chicago. Elevator is lighting fast, sky deck is fun and terrifying. Lots of great pictures", "pics": null}}, {"review": {"des": "The Willis Tower gives you the best panoramic view of Chicago and it's great architecture. Since it is a landmark people should expect to wait in line for a while both to go up on the elevator and then to get the iconic picture on the glass box once you reach the deck. I think that's the coolest and most thrilling  part of the Willis Tower!", "pics": null}}, {"review": {"des": "It was fun and the view from up there on a clear, sunny day's amazing! I suggest going in early, like before or right after they open. Otherwise, expect to stand in line for at least an hour or so. Once inside, there's another line for the actual glass ledge, which is not too bad because there's a time limit for each party (approx 60 secs). When you're in Chicago, you should at least try it once.", "pics": null}}, {"review": {"des": "I came to the Willis Tower during my recent trip to Chicago and it was definitely overrated. Yes the view from the top is great, but honestly both my friend and I thought the view from the Signature Lounge on the 96th floor of the Hancock Building was better.<br><br>Some tips if you still want to go:<br>1. Consider getting a city pass if you're interested in the other attractions included on the pass. It seems like you can skip quite a few lines if you have the city pass.<br><br>2. The wait might not be that bad on a weekday, but I went during Saturday afternoon of a long weekend and it was horrendous. If you're planning on going during the weekend in general, I recommend going earlier in the day, or preferably right when they open.<br><br>3. If they tell you the wait is 2.5 hours from the main lobby once you get in, you better believe them. We were skeptical, but there really are lines everywhere. The first line you get into is just to get up the elevator to another floor where you have to wait in a long line to buy tickets. You might think, \"but I've already bought tickets online!\" Doesn't matter. You still have to wait in these lines. And then you have to wait in another line to go up the elevator. And there are probably more lines but honestly it was all kind of a blur.<br><br>4. If you don't have the city pass and the line is ridiculously long, consider getting the fast pass tickets. Yes it is $49 per person which is pricey, but you can save a LOT of time with this. We ended up getting this and it honestly saved us close to 2 hours of waiting time.<br><br>5. If you think the wait is going to be long, grab some water and snacks to munch on in line to help pass the time. We had just gone to a Garrett's Popcorn before coming so luckily we had that to snack on while waiting.<br><br>6. Once you get to the top, note that there are actually 4 skydecks for you to take pictures on. It was mayhem up there with long lines forming for each skydeck. There's at least one skydeck where the workers take official photos for you in addition to some shots on your phone/camera, so I would recommend looking for that if you want a nice official photo. For us, this was the skydeck closest to the exit on the very left.<br><br>7. Best time to go, if you can swing it, is probably during sunset or at night when the city is all lit up.", "pics": null}}, {"review": {"des": "Late review: I went to the top of the Willie Tower (Sears Tower back then) back in 2005 or 2006. Chicago has the best architecture of any city I have ever visited. The view from the observation deck gives you an even greater appreciation for it. The wait was not long to get to the top and the view is one that you will never", "pics": null}}, {"review": {"des": "First off: so glad I read reviews here first and got the fast pass. That line was no joke. They say 2 hour wait but it to be at least 3 hours. We got there at 3:45 (fast pass time was 5-6) and they didn't even check the time. They let us right in and then you go down to basement for security. Here's a hint....you do NOT have to stand in line for security if you have the fast pass :/ they pulled us out of line once we waited 20 min to tell us that. <br><br>Then you go through a maze of hallways and finally to the elevators. This was the scariest part bc the elevator moves side to side. They let 20 or so people up at a time per elevator The wait happens at the top. Everyone is now in the same line. <br><br>The wait at the top is 45min-1 hour even with a fast pass. After that guy get about 2-3 min to do all your photos. I was find Til I looked down haha.<br><br>We paid $40 for 2 sets of photos afterwards and a magnet was $7<br><br>For those of you with kids or nervous stomachs...there are bathrooms in second floor, basement (you'll have to ask) and up in sky deck.", "pics": null}}, {"review": {"des": "My first time visiting Chicago, a lot of people and even on google, the recommendation for Willis Tower was a priority. I got to Chicago early morning and I found my way to the Willis Tower. I got there a little bit after 9 so the lines were not that busy. I got my ticket and went up to the tower. I thought it was interesting. A lot of people came after me and it got busier, but honestly I don't think the entrance fee should be 24 dollars, I want to say 15-20 dollars should be enough. You get up there, you probably spend a maximum of 30 minutes.", "pics": null}}, {"review": {"des": "Willis Tower has the Sky Deck, which is a fairly popular tourist attraction. With that said, I definitely recommend putting in at least a few hours in your travel plans to account for the time spent waiting in line (you will thank me later).<br><br>Adult admission was $23, and I recommend buying it in advanced through the online mobile site. I personally used the Sky Deck's website to avoid buying it through any 3rd party websites.<br><br>They'll email you the tickets with the QR code, and you'll be able to skip the ticket line. My family and I went when it opened, which was around 9 am. The line to get in the elevator for the top was less than 10 minutes, and the ride up itself was less than 5 minutes. The top floor is pretty big, and there's food shops & bathrooms.<br><br>There are 4 sections dedicated to the Sky Deck, and the lines for all of them will be long. The first three have workers that take an official picture, which costs around $40 per picture (you can purchase it downstairs on your way out). Also, the workers will time you on these three, but you'll have the entire section for yourself. The one to the far right has three lines and there's no time limit, however, definitely be mindful of other people! In my opinion, the one of the far right had the best view.<br><br>If you want the best pics for your social media, the lighting for Sky Deck pictures will be A1 during golden hour or night time.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LlnBq-i0qDnbtGhLvBjrQg/168s.jpg", "caption": "Front of the tower"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Qw6esVA5CyGbujOE6bh_jQ/168s.jpg", "caption": "View from the top of Willis Tower"}]}}, {"review": {"des": "The view is exquisite and breathtaking on days with great weather.  It's definitely worth the social media posts.  <br><br>However, the price is a bit steep for the amount of time that you will actually spend up there.  During busy season, the line to get tickets can be long and waiting at the top to take photos in the glass box can be agonizing.<br><br>I'd recommend it to first-timers to give it a shot once.  Going more than once may not be worth the price and experience.  Chicago has plenty of other extraordinary attractions to explore!", "pics": null}}, {"review": {"des": "Came here with my sister on an overcast day so we weren't able to see anything. I mean it was completely opaque white when we were up there. It was our last day and we already bought tickets the day before when it was clear; so we might as well go.<br><br>It would've been so much better if it was clear out because the glass was pretty clear and clean to see. The tickets were not expensive and you get to see the great sky view of chicago. I'm sure if I ever go back to chicago I would come here and get a better view.", "pics": null}}, {"review": {"des": "2nd tallest building in the Western Hemisphere.<br><br>Great tourist attraction.  Definitely recommend getting the City pass.<br><br>We got in and up within 5  minutes. There are 4 different areas, A,b,c, and d for photos on the glass ledge. We got there early enough to get on lines 5 times. The 2 in the corners have workers helping take photos and move the line along more quickly. I did not find the coin binoculars worth it. There was not really a lot to see, but being high up was definitely an experience. The line for the elevator was insane. It wrapped around the entire building. And by the time we got down, the line to go up was so long. Definitely recommend going around 9 or 10am on a weekend. <br><br>103 floors up! Gogo!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5hR0x77ra5UeWkBWVepuBQ/348s.jpg", "caption": "Graphics in the elevator"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UqLZX8QQvRgfPdqKzhwtsw/168s.jpg", "caption": "Higher than the wmpoew state building"}]}}, {"review": {"des": "A must when in the city that brought us MJ and Oprah. <br><br>60 seconds to the top - 104 floors - acaamazing!<br><br>Go during the week so the lines move quickly. <br><br>A must when in Chicago.", "pics": null}}, {"review": {"des": "You get a pretty spectacular view of Chicago. The sky decks are great spots to take pictures. Kinda of scary when you step into one of the 4 decks. Cost is $24 a person. I believe you can get it cheaper with the City Pass.  We went around 9am and there wasn't much of a line. After we left, it looked like it got much busier. One of those things you do once and that's enough.", "pics": null}}, {"review": {"des": "Amazing views, but long long lines. Vip experience includes a picture that the employees take for you, but you have to pay 36$ for it.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Ud6B15SxV3mjbfSg2LR89Q/168s.jpg", "caption": "The view"}]}}, {"review": {"des": "You're ears are going to pop when you go up the elevator. I'm not afraid of heights so I loved the view. We took the pictures on the Skydeck and enjoyed the view of the city from all angles. We have the day/night pass, its better to go at night, less crowded and spectacular view and more time to take picture on the ledge.", "pics": null}}, {"review": {"des": "The operations managers at this attraction need to get their stuff together. We waited 1 hr outside the building before being told it was another hour once inside. We then waited .5 hrs inside until being told it was an additional 2-3 hrs from that point on. Absolutely unacceptable. Who are we supposed to believe for wait time? This seems like an easily avoidable problem. Provide visibility into wait times and have your staff communicating consistent and honest wait times. I am an industrial engineer, let me know if you need help. PS might want to adjust your staffing on holidays so both security scanners are operating lol", "pics": null}}, {"review": {"des": "Be prepared to wait a long time! You go threw several different lines before you can finally get to the top or even inside of the glass box, however the view from the top is incredible!!! It's worth it, just plan accordingly, even on a cloudy cold day the lines are long!", "pics": null}}, {"review": {"des": "The wait is 1 hr plus when u get inside. It's deceptive from the outside . U need to buy the fast pass or you will be angry ... <br><br>Than the question is - is this worth $100 for 2 tic", "pics": null}}, {"review": {"des": "This was definitely amazing however I didn't like being in line for 3 hours lol... the only thing I would change is that if that's even possible. If you go to Chicago I would definitely check this place out. Just be prepared to stand in line for awhile.", "pics": null}}, {"review": {"des": "This is my favourite place in Chicago. You would not want to miss their skydeck of you are in Chicago.i went there in evening so I gt to see the daytime and night time view even the sunset. The only thing is they mixed up the first pass and general admission. I have to wait long time even with citypass.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eOwgtYNe9vJRkKfKnO1YsA/168s.jpg", "caption": "Sunset evening view"}]}}, {"review": {"des": "***READ TO LEARN HOW TO SAVE $$$ & TIPS TO TAKE THOSE IG WORTHY PICTURE***<br><br>TICKETS: I did some research and found that there was a website called \"365ticketusa\" that sold tickets for only $18.25 versus paying $23 at the door. I'd recommend this method, so you don't have to wait in line to buy tickets! <br><br>LOCATION: Once you enter the Willis Tower, there is usually an attendant that directs people DOWNSTAIRS toward the Sky Deck elevator entrance. <br><br>WAIT TIME: During my stay here, I decided that it was best to come on a weekday since it's less crowded. We came in on a Monday (10/30) and only waited in line for 5-10 minutes!! We easily breezed through the security check point and into the elevator. Also, the line to take pictures were so short that we kept bouncing around to different observation decks in order to capture that perfect picture! <br><br>BEST TIME TO GO: As all photographers know, before sunset is the best time to go! Well, we came in October and it was kind of cloudy so any time didn't matter too much! But, for those summer days you definitely should go around 5-7pm! <br><br>OVERALL: It's a great tourist attraction to get a nice overview of Chicago! All the information provided about the various landmarks/comparing the <br>Willis Tower to other buildings, etc were all very fascinating! Definitely worth checking out to learn more about the Windy City!", "pics": null}}, {"review": {"des": "One of the most popular tourist spots in Chicago! There's definitely going to be some kind of wait even if you have the CityPass. However, if you do get the CityPass you get to skip some lines (Yay!). <br><br>We went on a Wednesday afternoon and it was still pretty busy. I really didn't mind the wait, I don't remember it being that long either. There were only a few elevators that could take you up to the highest floor. Once up there, you're basically on your own. You can chill anywhere and there's always some kind of view in front of you. <br><br>I was really excited to see the ledge so we went over there almost as soon as we got out of the elevator. There are 4 Skydecks to choose from and there are 3 separate lines for each ledge. The wait can take a while depending on the people in front of you. Some people can take forever taking their photos but some just take a couple and leave. There was one Skydeck (the first one) that was dedicated to a professional photographer who will take your photos for you. There was only one line and it was pretty long. But, you'll get a solo shot of you and the whole ledge. Pretty worth it to me. <br><br>On the way down there's a gift shop where you can buy whatever souvenirs you wanted. Despite my bf being terrified of heights and feeling sick that day, we still had a pretty cool experience up there. Would definitely come back if I ever come back to Chicago!", "pics": null}}, {"review": {"des": "This place was ok. The lines were a little annoying. Being jam packed in the elevator was a pain. Waiting in line to step into the Skydeck was ridiculous. Every single person had to take multiple pose pictures and selfies. Take your picture and move along. Thank you. Oh and way too many gift shops on the way out.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9SmNJlyn5MCVk63UAVGS-Q/168s.jpg", "caption": "Skydeck"}]}}, {"review": {"des": "It cost about $24 for the tour. There are no free parking.  Surrounding parking garages charge an average of $20-$34.  20 mins walk to the Buckingham fountain.  There is a museum before you enter encompassing lots of facts and pictures.  They take pictures before you begin the tour and at the viewing area where purchase at the end.  The pictures are pricey but they are worth it.", "pics": null}}, {"review": {"des": "I'm a sucker for these sort of tourist attractions, hubs and I visit the \"tallest whatever... in whichever city\" pretty much no matter what. Cool history for the building, we went in the evening and the lines weren't very long which was nice. The weather was a bit iffy when we visited but it was cool to see the storm rolling in, the other neat thing was we watched someone get engaged so that was very cute. The glass floor for photos is also fun and a touch nerve wrecking.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/J8ryEUU87dlYy-IuIO-flQ/348s.jpg", "caption": "Storm rolling in"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hZSPjfiV9M36j9dMqWpfqw/168s.jpg", "caption": "More views and the storm"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8vXBfiyPFs2RPS0krzcnVQ/168s.jpg", "caption": "Views from the top"}]}}, {"review": {"des": "Worth a trip for the Skydeck. If you have the Citypass, which enables admission to other attractions, it'll speed your way through the lines, which can get quite long.<br><br>One you're up at the Skydeck, there are four glass \"boxes\" that you can line up for once again. Some of them have staffers who can take photos for you, with the advantage that you may have a short, dedicated time slot to yourself. You're at the mercy of all your fellow Instagrammers taking their royal selfie time at other \"boxes\" where this isn't the case.<br><br>As far as the views go, I prefer the ones at the John Hancock Tower (360 Chicago), but the Skydeck offers the all-important selfie opportunity with the glass \"boxes.\" So, go ahead, snap away!", "pics": null}}, {"review": {"des": "A for sure visit every time I am in Chicago. Nothing is short of awesome . From the super fast elevators that take you to the top and back down, or the Ledge that lets you face your fears and step out onto a platform that puts nothing but a pane of glass between you and 103 story fall. Also Emily in the Sales Department was really helpful in getting a special message posted to my wife. I didn't know at first it was approved to be posted so we missed it, but I did receive the email afterwards saying it was posted. The thought that counts there!", "pics": null}}, {"review": {"des": "The view from the tower is breath taking and amazing. The route before and after not so much. You pay $24 to get in for general admission and if you want to cut in front of everyone you pay $49 for the fast tract option. They warn you the wait will be about 2 hours. I would say you maybe wait 1 and half or so. I feel like the waiting part is sort of a scam so that you'll pay the fast track so they make you wait on purpose but hey maybe that is just me being cynical. They have some videos and factoids along the way which were nice. When you finally get to the top it's a mess. You have to find space  to see the views at the railing. To view the sky deck there isn't anyone monitoring the first 3 windows so it's every man for themselves and that Edit was crazy. You also have to wait to get on the elevator to go down. All in all the view is great but it's a lot of waiting and does take away from that because of how much waiting their is. Bring snacks and water and comfortable shoes!", "pics": null}}, {"review": {"des": "The Place<br>The Willis Tower is located at 233 South Wacker Drive in Chicago, IL.  If you can't find this Chicago ICON glasses won't help  you!  Completed in 1973 this 110-story building is one of the tallest buildings in the world and the tallest building in America, it is impossible to miss when appreciating the skyline.  Originally called the Sears Tower, it was designed to house Sears Roebuck and Company's approximately 350,000 employees with  gross square footage of 4.5 million sq. ft.  <br><br>The Service/Experience/Value <br>The Ledge, a glass balcony extending four feet outside the 103rd floor of Willis Tower is a Chicago must see Experience!!!  Offering spectacular views spanning up to four states, a one-stop Chicago total experience.<br><br>Touring the Willis isn't inexpensive.  Many deals are out there but expect to pay at least $17 for an adult.  That said it is a great experience.  The   My only suggestion is to develop a better technical way to describe the buildings in the view.  It is a little more difficult to identify some on them at night.   Take the tour!!! <br><br>The Shanghai World Financial Center tour is very similar and worth a tour as well.", "pics": null}}, {"review": {"des": "My family and I are from Northern Illinois so we don't hit up Chicago's tourist attractions very often. However, I was at wedding in Chicago over the weekend and my sister and I decided to take my boyfriend, since none of us had ever been. Now a New Yorker, I've been up on The World Trade Center and The Empire State Building, and the Willis Tower pails in comparison, mostly because of how poorly it's run.<br><br>For starters, BUY THE CITY/FAST PASS. If you're going on a weekend, it's a guaranteed 2 hour wait. Lines lead into endless lines, it's horrible. General admission is $23 and the city pass is $49, but it's worth it - buy the city pass. Once we got to the end of the endless line, we realized why - there are literally two elevators taking people up AND down. Two. For one of Chicago's biggest tourist attractions.<br><br>Up top: the views are nice, but it was so crowded, that we didn't try to do one of those glass box photos, because, as expected, more lines. If it's a nice, clear day, you can see for miles, which is really cool. Definitely some photo opps up there.<br><br>To get down, there is also a line, so make sure you carve out 3-4 hours for the Willis Tower if you're going on a weekend, because you'll definitely need it. But don't worry, there's a Giordano's nearby to get some pizza and wine to unwind from the experience.<br><br>Buy the city pass.", "pics": null}}, {"review": {"des": "I purchased the City Pass which helped expedite the queue.  The line to purchase the entrance tickets was ridiculously long.  We went during nighttime to get the night views and I guess everyone else had the same idea because the line to the elevator took forever!  I thought it only took one elevator to go up, but it took about three different elevators to get to the observation deck.  Once we got up there, the line to take those Instagram worthy photos were so long! I think I waited about 30 minutes until my turn.  Not only that, when we were close to our turn, an employee made a reminder that they were closing soon so everyone needed to take their photos as quickly as possible.  I was a little annoyed because most of the time, you're just waiting in line just to take photos.  The view is nice, but the experience is not worth it.", "pics": null}}, {"review": {"des": "I thoroughly enjoyed myself, it is an  experience you don't want to skip if you are nearby or visiting Chicago. The tickets seemed a little too expensive based on the fact that you have between 60-90 seconds to take a picture. If you are looking for an instagrammable spot to take a few cool pics make sure this place is on your list. I will have to revisit the lines were a little long and 60-90 seconds isn't enough.", "pics": null}}, {"review": {"des": "Sears... I mean Willis Tower is an awesome experience. A must when coming to Chicago. Also a must, which will save time and money is CityPass. I have gotten the one for Chicago and Toronto and I am a fan! I am getting NYC one next. <br><br>We came in just in time to see the sunset and were able to skip the huge line because we had the pass. The ride up the elevator is a little nerve wracking. It is so fast, that by the time you make it to the top, your swallowing and cracking your jaws like crazy to make your ears pop. <br>Once at the top, it's crazy! Full of people, crazy long lines to go into the glass boxes. There are quite a few lines. Luckily my friend realized that the ones towards the other end of the building were a lot shorter. <br><br>For the most part people are considerate and try to take pictures in a timely manner while in the box, but there are those who don't care and take their sweet time. Not caring there are another 100 people behind them. I wish attendants were more firm with these people. The people in front of us took a while. We felt so bad that we rushed so others could get the sunset too. The view of course is amazing!, I cant wait to come back with my husband!", "pics": null}}, {"review": {"des": "This was an amazing experience! It was very packed.. so make sure to purchase your tickets online. The lines upstairs are very long, but they go by quick. I recommend this place, you get an amazing view of the city.", "pics": null}}, {"review": {"des": "Located in Sears/Willis Tower. <br><br>Disappointing, underwhelming, overmarketed. <br><br>Seeing pictures of willis tower selfies, I for some reason expected the entire floor to be glass. Lol I've never been more wrong. It's just a small section that is a ledge extension from the main building. There are 4 ledges which are manned as people wait in line to take photos. I guess that's good so people don't just stand there the whole time. The ledges don't even look out on the best side of the willis tower, which is east (as the tower is located on the west side of downtown). Also, I don't think the views are that great since a nice panoramic view is chopped up by the corner edges of the building. Overall, not impressed with either sky towers in Chicago because it's all behind dirty glass so hard to get photos.", "pics": null}}, {"review": {"des": "The Willis Tower has the SkyDeck which is something first time visitors to Chicago should go to! Usually there would be very long lines to get to the 103rd floor for the SkyDeck but I arrived when it opened, which made my visit here so swift and easy! Tickets cost $23, and it took me about 10 minutes to get to the top floor to the SkyDeck. I spent about 40 min on the top floor and it had the most breathtaking view of Chicago. There are 4 Ledge you can get pictures from the staffs professional camera or from your phone if you ask. The professional camera photos are 1 for $30 or 2 for $40. The earlier you arrive the less you have to wait in line.", "pics": null}}, {"review": {"des": "Willis.... Sears.... it's all the same. Doesn't change the fact that it's an awesome tourist destination. It's just... you just.... have to go here and visit the top. My advice: go early in the morning at the time that it opens. There's no one there at that time. Within 30 min of it opening, the large tour groups come through and then the lines are long, the elevators are full and you'll take forever to go up and down the building.<br><br>Once in there, though, you'll be treated to a short film about the construction of the building and then ushered to the top of the building where you will have an incredible 360 degree view of the city. Much like the World Trade Tower in New York, Montparnasse in Paris and the Patronas towers in KL, the view is breathtaking and I firmly believe is well worth the time and money spent to get up there. <br><br>Uber there and back... best way to get around Chicago and definitely to this building. Parking? forget it... none in sight and even if there was, I'm sure it'd be expensive!", "pics": null}}, {"review": {"des": "This place is gorgeous once up top, however the employees and the amount you have to pay is ridiculous. I mean close to 30.00 just to stay at the top for lights ? And they kick you off after 5 seconds as well which is ridiculous. It took us 2 hours to get to the top and the lady taking our picture said hurry up to us while we were trying to take our own selfies. Ummmmm what did we pay for then? <br><br>Employees seem frustrated because this is a tourist spot, but don't work there if you have no patience. It was gorgeous once we were at the top, but that's all there is to see- all of Chicago. We saw the same view at our hotel too lol <br><br>My frustration  comes from the lack of professionalism from the employees.", "pics": null}}, {"review": {"des": "This is a great tourist stop on a beautiful day in Chicago. The view on the 103 floor is amazing and the elevator ride up only takes about one minute. They have a fast pass that gets you up in about 15 minutes, while the general admission ticket usually takes 30. However, I think this tier system is mostly used in the summer and holiday weekends to control the crowd. On a sunny weekday in early May, I paid the general admission price ($24, which I consider a little high just to get a high level view of the city) and got right on the elevator. You can stay on the Sky Deck as long as you want and they have these ledgers built into one side of the building which is great for photo shoots.", "pics": null}}, {"review": {"des": "Coming from FLORIDA-It's a really cool view! You can see so much from 103 stories up. I'm scared of heights but it's more like looking out than down on the whole floor. With a little encouragement my son decided to do his handstand and man up-Not bad for an 11 year old. They have telescopes to view around the city for .50 each (very short) but up close.<br><br>We got in line on the sky deck. It's was  a very short wait time and our photographer was amazing. She let us take out time getting group and individual photos. But we were Mo's shocked as much as she helped taking photos with our cell phone too, actually she took tons! Thank you!", "pics": null}}, {"review": {"des": "Go to the DMV and then pay some one to treat you like trash it will cost you less and you will get the same experience as heading over to the Willis Tower Skydeck.", "pics": null}}, {"review": {"des": "They give you an option to buy a city pass which is super helpful when you plan on touring the city. The views are fantastic! Make sure to go on a clear day. Go during the week that way the lines aren't as long.", "pics": null}}, {"review": {"des": "It was nice to come here ONCE. There are great photo ops but at the cost of waiting in endless lines. I got to the end of one line just to wait in another and another and another. Even if you buy your tickets ahead of time, there is no way to avoid the lines if you come during a busy hour. When we first got in the building there was a line just to go up the elevator to security. And then a line for security.. then a line to watch the mandatory movie.. then a line for the elevator to get to the top of the building.. and of course a line to take pictures in the glass boxes. <br><br>Just to get to the top of the building took about 2 hours. It was definitely a cool experience to take pictures in the glass boxes, but some of the people were very obnoxious. Each glass box has 2 lines, one on each side. The box itself is not big so it's expected that you will stay on your own side so that you don't ruin other people's pictures. However, I've seen people sprawl out across the entire box which is extremely inconsiderate and holds up the line. Also, even though there is no time limit, there is no reason why someone should be taking pictures for 30 minutes when there is 15 people waiting in line. <br><br>The views on the skydeck are fantastic but not worth the hassle of coming back.", "pics": null}}, {"review": {"des": "Do not even waste your money. The absolutely biggest rip-off in Chicago.  We bought the fast pass for $49.  It just gives you access to the elevator, not the sky deck!  Never told us that!", "pics": null}}, {"review": {"des": "GET THE FAST PASS!!!!! Worth every penny. The family and I stopped by on a Tuesday, which in itself probably made a difference. No joke though, there were still hundreds in line and by having the pass we walked past them all and were at the top within about 10 minutes. The experience at the top was awesome and the family really enjoyed it, even my wife who hates heights. The newer sky deck was amazing if you can wait for tourists who seem to forget that others are waiting. As much as I do not like gift shops, theirs at the top of the tower and bottom are worth a look. Heck there is fudge! Who can say no to fudge samples? Not this guy. Anyhow,  turned out to be a great visit given I was concerned the lines would take forever. Have I mentioned getting the fast pass? Get it!!!!!!!!", "pics": null}}, {"review": {"des": "Last time I came it was winter, not many people. This time it was packed. Lines for everything and every corner.", "pics": null}}, {"review": {"des": "Currently (3/23) they are doing construction on the building and the spot where you normally walk in is closed due to renovation. Just follow the signs posted outside the building for the entrance. When you walk in there are people directing you to where you should go if you are going for the sky deck. IF there happens to be no one directing people you take the escalators behind the main desk down two floors or so. Then follow the signs for tickets or the line. On a week day during the middle of the day the wait was not bad but I have been here before after 5pm on a holiday weekend and the line was outrageous. (They do make you go through a metal detector before you buy your tickets and have you take your coats off/etc.) Luckily I didn't wait longer than 30 minutes to get to the top this time. Last time when I went on the weekend it took close to 2 hours to get to the top. Plan your time accordingly when you visit the sky-deck. You take a minute elevator ride to the top and you get all the time you want when you are up there. There are 4 ledges and of course if you want a picture in them you have to wait your turn. They have employees in each box taking group pictures to sell to you later for a ridiculous price. They give you about 5 minutes or less to take as many pictures as you'd like in the ledge. You can go back to each ledge as many times as you'd like. We waited about 20/30 minutes for 2 different ledges. They do have a gift shop on the top of the tower and bathrooms. When we went they had one of the ledges closed because a group had rented the space for the day. Did not realize you could rent a ledge to yourself/party. (I could imagine it's not $24 which was what I paid to get to the top). When you go back down you take the same elevator as you did going up and it's right next to the ledges so you cannot miss it.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CYRJk1vMZthP9xua99G-Rg/168s.jpg", "caption": "In the glass box looking West"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nJoKefJHPLbVur5TJcAD0w/168s.jpg", "caption": "Views of the Northside of Chicago"}]}}, {"review": {"des": "Willis tower is incredible and a must see site of Chicago! The line can be pretty crazy during high season but we've come in September when it calms back down and there is practically no one here. <br>We always take friends and family when they come into town, and find the experience exhilarating. Also the little museum and video before is an awesome touch! <br>I would highly recommend for everyone to try atleast once!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wk3-J3MMSpcwDR5d7Uzhkw/348s.jpg", "caption": "Also perfect for a romantic couples photo!"}]}}, {"review": {"des": "Willis tower also known as Sears Tower is a high rise, about 108 story building. Its one of the popular attractions in Chicago.  The view is from the deck on the 103 floor. The elevator ride is thrilling too.  Its 1353 ft high. Talking about high rises, there are few names that came to my mind, Burj Khalifa in Dubai, Eiffel Tower in France, Empire State Building in New York, there may be more but I have just seen these. Coming back to Willis Tower, there is a glass floor and when I looked down I felt dizzy. The view is beautiful, you can see the whole of Chicago, its a sight to see. <br><br>There are regular offices and some floors are rented out for business meetings.<br><br>Admission fee is okay, the line ups are too long, people just start pushing,they should organize it a bit more for peoples convenience and safety.", "pics": null}}, {"review": {"des": "It's an overpriced, overrated, old, dated and very exploitive experience despite the views. When you review an airline, do you review the view from the plane or the experience on the plane? (note: United Airlines, the world's worst airline, full of thugs and people who harm others, is headquartered and has their network operations center) in this building).<br><br>From getting to the deck to to poor facilities on the observation floor to forcing people to go through gift shops when leaving, the entire experience is disappointing.<br><br>To illustrate how dated the experience is, the graphics on the walls as you head to the elevators try to exploit Chicago being home to Oprah and Michael Jordan (both who left Chicago and probably didn't consent to the owners of the building using their names).<br><br>The only positive is the view itself, which no credit goes to Willis Tower for. However, even \"The Ledge\" is a overrated since it's on the most boring side of the building, the west side.<br><br>This is a money-sucking scheme to exploit tourists who naturally want to see one of the tallest buildings.<br><br>They also have limited bathroom facilities and almost nowhere to sit on the observation floor. Also, the Willis Tower security staff (including Eric Winterrose) near the entrance is rude and unprofessional.<br><br>I'm surprised the City of Chicago, given the history of this building, hasn't forced the owners and management, to do things far better.<br><br>My friends in Chicago rarely visit this except when people from out of town are visiting because it's so dated, boring and overpriced despite the view.<br><br>Many ways this could be a better experience, but just remember this is designed to make money (they generated millions per year from exploiting tourists).<br><br>If you've never visited a tall building before, you may want to try John Hancock instead or take photos from a flight.<br><br>NOTE: United, the world's worst airline, is located at Wills Tower, including their NOC (Network Operation Center). From dragging passengers off a plane to their exploitive \"basic economy scheme\" I didn't think this airline couldn't get any worse, but we saw a United Airines employee assault tourists walking out of Willis Tower, where taxpayers gave over $20M for the move. City of Chicago should kick out United Airlines and the owners of Willis Tower. Watch out for your safety if you are a tourist because it's dangerous. Willis Tower security WILL NOT HELP YOU, they will only help criminals. We saw what happened and were shocked.", "pics": null}}, {"review": {"des": "I have to admit, it was scarier than I thought to step out onto The Ledge of the Skydeck.  1,353 feet in the air is no joke!  They had a great exhibit about the history and construction of the building, and it was great to do after we learned the basics on the architecture tour.  We went on a Sunday morning around 10am, and there was almost no line to buy tickets or get to the top in the elevator.  If you go on a busier day, you can buy tickets ahead of time online.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7HoZf_ElV-8sqo1SP2yZIg/348s.jpg", "caption": "That's a long way down!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XKRGrxT-ni0ZLADxMN7MVA/168s.jpg", "caption": "On The Ledge at the Willis Tower!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/K8UvLAYE90nTvtC6QDTVaA/168s.jpg", "caption": "What a view from 1353 feet in the air at the Willis Tower!"}]}}, {"review": {"des": "I didn't go to the top because I was there for work. But it seems like it would be lots of fun. The building is under renovations now so I can't comment on how it will look. Seems promising, though. It is also in the perfect location in Chicago.", "pics": null}}, {"review": {"des": "They say avoid the Willis Tower because it is a tourist trap.  But hey, I am a tourist!<br><br>Willis Tower, aka Sears Tower, houses the must see SkyDeck.  The famous ledge that puts you on top of Chicago!  Adult admission is $23.  <br><br>We came on a Monday afternoon & waited about 1 hour, 30 minutes to get to the top.  I must warn you, people are crazy & rude!  There are several ledges & each ledge has 3 lines: left, middle, right.  We waited in a line behind a ginormous family & they literally took 30 minutes taking photos.  Really annoying!  & when it was our turn, people shoved us & got in our photos.  Like, give us some space!", "pics": null}}, {"review": {"des": "3 hour wait. Not worth it on a Saturday afternoon....if you come here, come earrrrly!!! It was pretty cool to be there, but it was way too crowded. Employees were pretty grumpy too...but I get it. Dealing with grumpy people in line all day could wear on you haha", "pics": null}}, {"review": {"des": "It's a gorgeous view. I had a Chicago City Pass so I got up in no time. FYI, this place has three names: Willis Tower, Sears Tower, and Skydeck Chicago. Choose wisely when you want to come up here and how much time you plan to spend. There may be long lines to wait and take a picture on the ledge. And then there's pressure to get your pictures in quickly. Also, depending on the lighting and where the sun is at the time, the pictures may not turn out so great. Although the ledge is great (slightly scary), the view on that side doesn't face any nice buildings. The other three walls of this skydeck have great views!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ntjGhRDLjxrn1cMpRPzHWQ/348s.jpg", "caption": "Corner view"}]}}, {"review": {"des": "An amazing experience that you will not get anywhere else. The elevator travels 103 levels in 60 seconds. The view is breathtaking! You'll have to be patient, it takes about 2 hours to get upstairs on a average weekend.... it's $23 dollars for admission for adults. One of the workers approached us. His name was Finis. He actually gave us tickets that someone didn't use. Saved us $46!!!! Extremely nice person and gesture.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QawoNWGcR-bfmnV8EA0G1g/168s.jpg", "caption": "Crazy!!"}]}}, {"review": {"des": "Definitely a place to stop by, especially for those visiting Chicago for the first time, which is why I went.<br><br>TIP: GO EARLY to beat the crowds. Hopefully, the weather is nice so you can see the beautiful views.<br><br>The elevator ride up 103 floors was exciting! Lots of great photo-ops when you get to the top.", "pics": null}}, {"review": {"des": "worst experience ever<br>Very long line and you get less than a minute to enjoy the view, not worth it. Chicago 360 is much better than willis tower's skydeck", "pics": null}}, {"review": {"des": "Move over Willis, you ain't the tallest anymore!<br><br>We ordered our tickets online and had them ready beforehand, but there is a queue in case you need to purchase your the day of.<br><br>We stopped by midday on a Sunday. Surprised to see a long line? We expected it. The line moved fairly quick and we went through security. Took the elevator with a bunch of other tourist up to the top and this is where the craziness began.<br><br>Tons and tons of people roaming the top floor, trying their best to get a memorable photo aka picture that's going to get you a million likes on some social media platform. I heard \"is this facebook worthy\" and \"what hashtags are going to get me more likes.\" True story, girlfriend.<br><br>The next glass box was the free-for-all photo op box. This line was short, but it took forever for us to reach the actual box. Some groups had just about their entire family tree standing in the box at once, it really freaked me out. People will take hours trying to snap the perfect shot. <br><br>We finally made it into the box, enjoyed the 360 views for a mere second, snapped a photo and moved on. It was cool getting to see the entire Windy City from above, but not worth it.<br><br>I recommend coming here as soon as they open to ensure clear skies, short lines and plenty of time to soak in the 360 Willis Tower has to offer.", "pics": null}}, {"review": {"des": "This use to be called the Sears Tower before it became the Willis Tower.  <br><br>Another spot for the gram! Take my money, please, all $24. I've been to many high structures including the Seattle Needle and Taipei 101 but this by far isn't worth it.  There is barely anything to see here except for the lines of people waiting to get into a plexiglass box protruding over a ledge for a picture. At least the Seattle Needle gave us a history of the building or Taipei gave a glimpse into their damper room. Even the factoids along the walls were boring.  <br><br>My trip could have gone without this but I guess I can say that i got to be up on the 103rd floor of the building. <br><br>A little trivia I remember from my visits: Willis Tower has the fastest elevator in the western hemisphere; however, Taipei 101 has the fastest elevator in the world.", "pics": null}}, {"review": {"des": "Willis tower has an incredible view, however, be prepared for crowds of people...an hour wait to go on the \"sky deck\" which is the view you have standing on the deck of the building. The elevators went quick even though it looks like hundreds of people in front of you! It was HOT HOT HOT up top, I don't think there is air conditioning in there. The gift shop at the end was really good, they had all kinds of stuff not just for Willis tower but for Chicago in general! Personally, I thought that the formally known Hancock building is a better catch for your money though :)", "pics": null}}, {"review": {"des": "Interesting sky view of Chicago even though it was a cloudy day and the visibility was poor. Getting to the elevator to the tower is a little but of a maze and the day we visited there were few attendants to direct us. And it was quiet and a little creepy. Still a fun view of Chicago and an interesting visit.", "pics": null}}, {"review": {"des": "Formerly the Sears Tower, the Willis Tower is one of the top attractions in Chicago, mainly for a great bird's eye view of the Windy City.<br><br>By reading the reviews, I notice that there a lot of people complaining about how long the lines are and about parking.. yada yada yada.. couple of advices for the peeps planning on visiting here for the first time.<br><br>1. Get a Chicago \"Go City Pass\" card. For the people comparing the lines to Disneyland... think of this as a \"Fast Pass\" as you will enter a shorter and faster line for pass holders only. I waited about 15-20 tops.<br><br>2. The Go City Pass card also let you take a \"hop on hop off\" bus which takes u to other attractions around the city. Bus stops are conveniently scattered around Downtown Chicago.<br><br>3. Haven't you heard of Uber or Lyft by now? Probably the most convenient way to get here. <br><br>Ok, so we stand in many lines, but being a pass holder, the waits weren't as long as the general line. <br>You watch a short intro video and then in to the elevators and up we go to the 103rd (or 104th) floor to step atop the infamous SkyDeck! A glass see through deck where you can see 104 floors directly below your feet.<br><br>Once we get off the elevator, it's Instagrammers and Snapchatters galore as they patiently wait for their turn to take their photo op for all of Instagram and Snapchat to see. Not to mention the people who hold up the line because they want to get that perfect shot, pose etc. But hey it was fun to see what people came up with, from handstands, to yoga poses. <br><br>As it was our turn to step atop the SkyDeck. At first legs were shaky, but then that view was breathtaking. So it was my turn to hold up that line to get that perfect photo op! Was scary to look down, but why would you tell someone to not look down. Yeah pretty scary, but stunning!<br><br>If you're visiting Chicago, this is one of those \"must go\" attractions. Take my advice or wait in the long lines!", "pics": null}}, {"review": {"des": "SkyDeck Quick Tips:<br>Buy the City Pass or whatever VIP line skip you can pre-buy!!! You will skip so much of the wait. From the moment we entered the building to the moment we got in the Skydeck line itself was less than 30 minutes. Skydeck lines can vary depending on how busy it gets. <br><br>Go on a weekday before noon to beat the crowds. <br><br>The Skydeck entrance is located on Jackson street.<br><br>Go on a sunny day for the best visibility & some crisp photos of the views.<br><br>For those saying \"Just go to 360 Chicago instead,\" this is an option, but they offer totally different views. 360 Chicago offers a great view of the coastline & Navy Pier, but they're not quite as high up & don't have a Skydeck. They do offer a Tilt experience(For an additional fee), but it's overlooking a boring part of the city in my opinion & is over in just a few seconds.<br><br>The Good:<br>The City Pass VIP Line Skip option. <br>The Views are great.<br>There are 4 Skydecks to choose from.<br><br>The Bad:<br>If you don't purchase the City Pass VIP line skip or choose to go on a weekend afternoon be prepared to wait... & wait... & wait some more. <br>The 4 Skydecks are not on the side of the building facing the City's beautiful Skyline so you'll have to take pictures of that on your own once you finish the skydeck.<br><br>The Experience:<br>Sears Tower(That's Sears, spelled W-I-L-L-I-S) because nobody calls it Willis. Once inside the building, you'll go into a lobby with an elevator that will take you up a few floors. Once off, you'll go through security, take a quick photo, then you will have the opportunity to use your VIP City Passes to jump the line if you bought them. Once we jumped the line(it wasn't a busy day so I'm not sure how much we actually jumped) we got on an elevator to the top. After about a one minute elevator ride up, we were let out on to the skydeck floor. <br><br>Once up to the 103rd floor, it can be a bit of a free-for-all. There are 4 Skydecks at the top, all side by side on the same side of the building about 15FT apart from each other. The two in the middle have faster moving lines but do not have any staff to take professional photos. The staffed Skydecks will also take photos with your phone or camera at no charge. The two in the middle offer practically the same views however due to being unstaffed, the people in line with you might take longer to take their photos & move on since there's really nobody moving them along. On the way down, you'll pass through another gift shop with more stuff than what is for sale at the skydeck level.", "pics": null}}, {"review": {"des": "Bought my tickets online early to avoid a line. Turns out there was a 2.5 hour line no matter what with no ability for refund. Then had to endure the security team screaming at us like prison inmates to TAKE OFF YOUR COATS. The view is great but not worth the discomfort to get there. Staff could use a lesson in customer service. I'll definitely go for a drink at the Signature Room next time instead.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Z7pEZgOd7aZlm7XprasTPA/348s.jpg", "caption": "The line is endless."}]}}, {"review": {"des": "Terrible staff and organization management.<br>We bought the \"fast pass\" but we had to wait in line like everyone else. Was told it would be an hour wait then 2 hours then 3 hours just to go up. The view was facing the opposite way of most of the landmarks and lake. I don't understand why so many people wanted to see it.", "pics": null}}, {"review": {"des": "Buy your tickets online so you can skip the ticket line which is an hour itself. The wait to get up was another hour. The views are from inside, you don't necessarily get to go all the way up but high enough. There's glass cages hanging out from the sides when you get up so you can get into them to get a better photo which is a plus. It's a 360 degree view and there's a gift shop up there as well. <br><br>Definitely allocate plenty of time for this trip. Plan accordingly and you'll enjoy it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nEdTQ6P6FcHVBTFZBxDsIA/348s.jpg", "caption": "View from The Willis Tower (aka Sears Tower). The John Hancock Center is the tall dark building."}]}}, {"review": {"des": "1. Willis tower also known as Sears Tower is a high rise, about 108 story building.<br>2.  Its one of the popular attractions in Chicago. <br>3. The view is from the deck on the 103 floor. The elevator ride is thrilling and you can feel in your ears.<br>4. Beautiful and a must visit if you are in Chicago", "pics": null}}]}