{"name": "xoco-chicago", "reviews": [{"review": {"des": "Gotta love Rick Bayless and his restaurants. If you've ever been to Tortas Frontera, Xoco is basically like a more upscale version of it, and with enhanced flavors. The dining area is relatively small, but we were fortunate enough to get our order in and get seated right away. <br><br>My wife ordered their Milanesa torta. For those of you who don't know what \"milanesa\" is, it's basically like a Mexican version of a breaded steak sandwich from Ricobenes but without the gravy and this one is chicken beef. Not only did this torta look beautiful, it tasted delicious. The bread had a perfect crunch to it and went well with the chicken, black beans and red onions. I ordered their Goat Barbacoa torta. I personally enjoyed this one more than their milanesa. A braised goat, with avocado, onions and cilantro topped with a Oaxacan Pasilla tomatillo salsa. The salsa was spicy but had a such a great flavor to it. Every bite was magically delicious. Definitely some of the best goat I have ever tried. <br><br>Xoco is definitely a place I will be frequenting more often and will eventually, try everything entree on the menu, including their breakfast entrees. My only regret is being in a rush when we came here, so we weren't able to try their churros. Next time for sure.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0Z6QVmxTHd16d28e_5eEdg/168s.jpg", "caption": "Goat barbacoa torta"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vNafz9G0BRjdtcMXB3ERNA/168s.jpg", "caption": "Milanesa torta"}]}}, {"review": {"des": "Hands down the best Tortas ahogada I've had. <br>Explosion of flavor in your mouth. <br>Xoco, I will be coming back.", "pics": null}}, {"review": {"des": "We went here for the first time and enjoyed it! I ordered a plain churro with no dipping sauce (I'm too cheap to spend $1.50 on chocolate dipping sauce!). Wifey ordered chips and guacamole, which were great too. She also had a margarita that got her feeling great (even though she never admits it). The best part of this place was definitely the music! I must have Shazamed eight songs while we were in there. <br><br>The only negative I have about this place is the ordering system. You have to wait in line, order at the register, then get seated, and wait for your food to come out to you. I was curious why you couldn't be seated and then order. I guess, either way it's the same.", "pics": null}}, {"review": {"des": "The food is amazing here. One of my favorite places to go to when in town. Will continue to come back here every time. the first time I had every came to Chicago I ended up eating here and fell in love with the food. I was able to see the owner and chef when I was out there. Which I thought was awesome that he was there in person. Each time I try something new and I am never disappointed by my choices.", "pics": null}}, {"review": {"des": "Finally stopped by here after being in the area and deciding to wait in the thick of it. It was about 1pm Saturday and the line was at the door. However, the hostess was lovely and gave us menus and explained the process - there are two lines, dining in and takeout. For dining in, you order and then they give you a table number and then they pretty much seat you. You can order drinks in line. They even brought out tlayudas samples for their waiting customers. While very busy, the line did move along and it really wasn't too bad. Definitely not recommended for large groups (4+), but people definitely did so anyway. <br><br>I went with the choriqueso torta and the pistachio churro while sis had the woodland mushroom torta. We had the option of having the churro out first or with our tortas. I enjoyed the self serve water station that included sparking water. Food came out fairly quickly. The tortas were delish. The chorizo and mushrooms were plentiful. While these are certainly significantly smaller in size than your standard torta, they were still very much satisfying and still fairly priced, especially for the area. The pistachio churro was decent, but not remarkable, in the churro itself and the pistachio flavor.<br><br>While it is rather cramped in there, they do make good use of the space for seating, but it is always busy, so it certainly looks smaller than it is. Service was great though and very efficiently run. I would definitely come back for their food (drinks looked awesome too), when I don't mind some hustle & bustle.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cmxk70K0oz0TnYTqC_BsmA/168s.jpg", "caption": "Choriqueso"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/c3rey-fZVj7OJWkljQthfw/168s.jpg", "caption": "Pistachio churro"}]}}, {"review": {"des": "This was a lively Mexican food restaurant. It felt upscale with a clean interior. As you walk in, you approach the register and order your food. The food is brought to you later after it is prepared. The guac was good and the chips were fresh. The special for that day was a carne asada torta. Not my fav, but the meat was not tough. The salsa verde accompanied the flavor of the carne asada all while sitting between a grilled crisp flatbread. I was not full after eating, but it was enough to satisfy my hunger. Several other items on the menu looked worth trying.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/f8Ks7_Myoe9wYTIe7zRLuA/168s.jpg", "caption": "Guac and chips"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ioa9k69LWJxpLIWwwlQfLQ/168s.jpg", "caption": "Carne asada torta"}]}}, {"review": {"des": "I didn't get to eat at the restaurant; however, based on how crowded it was I'm sure it has to be good.<br>My friend said I have to try their churros. Omg, let me tell you it was something to die for. It broke all my dietary restrictions. Thank God I just ate otherwise I could finished the entire box by myself. You have to try it! I am salivating just thinking about it.", "pics": null}}, {"review": {"des": "After a long morning of travel, I knew Rick Bayless could wipe away my weariness. I was happy to find out Xoco was so close to our hotel and made a beeline straight there. <br><br>Besides the food, I was really impressed by the ordering process. Yes, it's fast casual, but you also get assigned a table upon walking in so there's no hunting after you order. There's also staff that brings you your food and cleans up when you're done!<br><br>I ordered the fully dressed guac because how do you say no to guac covered in spicy roasted poblano, chicharrón, grilled onion, smoky bacon, local tomato, queso fresco, and pumpkin seeds. It also came with chips and salsa. I really appreciated how they served this right away while my sandwich was being prepared. I LOVED it and can only imagine how good it would taste paired with one of their alcoholic bevvies after a work day. Instead, I gorged on the complimentary sparkling water. Yum! <br><br>I went with the ahogada after reading all the reviews. It's a carnitas sandwich with black beans that's soaked in tomato-arbol chile broth. When you order, they ask how spicy you want it. I opted for medium and let me tell you, it certainly packed a punch! Go for mild if you don't like a lot of spice. It was messy to eat since the bread gets soggy and the meat falls out, but the flavors were incredible. <br><br>It wasn't the cheapest meal for a quick lunch, coming in around $20. These items could've definitely fed both me and a girlfriend though. If I lived in the area, I would probably come here way too often!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-aTn-j8sjgc-yspTJ0hjpA/348s.jpg", "caption": "Fully dressed guac: spicy roasted poblano, chicharrón, grilled onion, smoky bacon, local MightyVine tomato, queso fresco, pumpkin seeds"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-TPNkjCSIFiAYMXrIlS6ug/168s.jpg", "caption": "Fully dressed guac: spicy roasted poblano, chicharrón, grilled onion, smoky bacon, local MightyVine tomato, queso fresco, pumpkin seeds"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/n846Rj2tYi-3bd-o0grNXg/168s.jpg", "caption": "Chips and salsa"}]}}, {"review": {"des": "Having had so many good experiences at Frontera Grill and at Tortas Fronteras at O'Hare, I was surprised at how underwhelming my weeknight dinner at Xoco was.<br><br>Let's start with the seating. When you walk in, a greeter welcomes you, then escorts you to your seat - standard practice, to be sure, but when the restaurant is 90% empty, why seat your diners in the most compact (and uncomfortable) way possible, rather than give them a little space, especially at a restaurant without waiters and table service? <br><br>I'm a big fan of avocado toast, so when I saw it on the menu, I knew I had to try it. In addition to the Mexican avocado mash, it also contained crispy bacon, tomatoes, a queso añejo, and chicken. When the dish arrived, it was plated quite nicely and looked quite appealing, but actually consuming this dish was another thing altogether. I'm not sure what the kitchen did to the thin 'toast' part of this avocado toast, but it was incredibly difficult to cut through (especially with the cafeteria knife provided to me), making for one big chewy mess, avocado mash all over my fingers, presentation taking precedence over the ability to actually consume the dish. Putting all that aside, the avocado mash just wasn't all that - no spice, no kick, nothing interesting about the seasoning, just bland and a total miss in my book. <br><br>Perhaps I just hit Xoco on an off night, but given prior experience, I do expect more when dining at a Bayless establishment, especially at their price point ($14.50 for this entrée). I'd have the delicious breakfast torta at O'Hare any day over their hapless avocado toast.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ojks9SQ8GEVO7hrADvwDDg/168s.jpg", "caption": "The uninspired avocado toast"}]}}, {"review": {"des": "Great food and great service in an ultra-busy restaurant.<br><br>Even though it was super-crowded and very busy, the friendly service got our order and quickly seated us.<br><br>Here's what I had:<br><br>Chicharron: I did not like their style of chicharron. Xoco serves the white skin-only chicharron, which you can easily find in grocery stores. I prefer chicharron made in the Columbian style, with both meat and skin. But, their chicharron is homemade.<br><br>Carnitas Tortas: Fabulous. The homemade hot sauce takes it over-the-top.<br><br>Chocolate Aztec: Pleasant with a slight touch of hotness.<br><br>Hibiscus-Lemongrass Agua Fresca: Refreshing and scrumptious. <br><br>Coconut-Lime Tres Leches: Yummy.<br><br>Definitely a foodie haven.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RA63y-5UpJLNuWO2kMF7UA/348s.jpg", "caption": "Back: Hibiscus-Lemongrass Agua Fresca Front: Coconut-Chocolate Tres Leches"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UMpxqvqYIWyoS4z3TVVvew/168s.jpg", "caption": "Chicharron"}]}}, {"review": {"des": "I was really looking forward to trying the Xoco Shortrib Caldo, so I picked it up to take back to my hotel. <br>Unfortunately, it came in a tall container with a tiny metal spoon with about as much capacity as a coffee stirrer. It's absurd to try to eat caldo 1/2-teaspoon at a time, and I couldn't find much meat with the spoon. It's going in the trash. What a waste. <br>I tried calling the restaurant to complain but have been on hold for 20 minutes. <br><br>By the way, if you don't like the idea of plastic waste, why is metal waste any better?", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4tEilOqXta5SAH98tU_rbQ/348s.jpg", "caption": "Caldo to go with the stupidest spoon ever.  Could not eat it."}]}}, {"review": {"des": "I love this place.  The food quality is always consistent and it's nice for a tasty quick bite.  They have amazing vegetarian options i love the mushroom tacos and tortas.  I recently tried the vegetable Caldo- which is a meal in a bowl soup and it is the perfect winter treat with a tasty broth and fresh veggies.  The churros with a side of chocolate dipping sauce and soft serve is a must for dessert!", "pics": null}}, {"review": {"des": "We had been eyeing XOCO from our hotel room at the Hyatt and knew we'd have to stop by at some point. We had come here years ago on our last trip On our way back to the hotel on a cold day, we made a pit stop after lunch for some fresh, warm churros to go. <br><br>For 3 churros it was only $4. Not a bad deal for just a snack. The churros were warm and perfectly sweet. I really enjoyed mine!", "pics": null}}, {"review": {"des": "I've been here twice now for lunch. I sat inside and outside. It's amazing how they can make seating on a narrow sidewalk nice. The menu is not typical american based mexican food. It requires you to look at the ingredients; many of which I didn't know. I went with a baja chicken torta or sandwich. So good. Really delicious. It doesn't have to be big to be good. Perfect lunch portion. With the chips/salsa I was full. Service is fast. The lady who gives you a seat is soooo nice. If you need a positive jolt, go here and have her seat you. So much positive energy.<br><br>The only downside of this place is they are closed on Mondays. Not a big deal.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DuhFwe00Qk_ieBjfYkqQRQ/348s.jpg", "caption": "Bathroom art"}]}}, {"review": {"des": "The concept of Xoco is hard to describe.  You walk in, are placed in line, an employee will get you a drink to have while you wait in line or decide what to order (margarita, beer, or wine), then when you're ready to order you go to the next open cashier, you pay for your meal and they give you a number, the someone will walk you to a table. Its a little confusing but it works! The menu is easy to navigate and the cashier is more than happy to help you make decisions if you're on the fence.  The Mexican sandwiches (tortas) are to die for and unlike anything else served at a Mexican restaurant.  My favorites are the choriqueso and the carne aside.  Cant wait to go back soon and try all the churros.  Yum!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/v7rvqEq-LSfUaZqPTFyKfg/348s.jpg", "caption": "This is the Cubana - delicious take on a Cuban sandwich gone Mexican"}]}}, {"review": {"des": "Tried the ahogada, garlic shrimp torta, churros with chocolate dip. <br><br>Asked for mild soup with the ahogada but it was still quite spicy. People were sweating and drinking lots of water after trying it. <br><br>The churros were delicious--the best part of the meal!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CALCUvdnoetX_WnRxsSw1w/348s.jpg", "caption": "Churros with chocolate dip"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/E9BK9M-eTZNeICQlk_DdPw/168s.jpg", "caption": "Fully dressed guacamole"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lOIiz4i0HimLDx-hk7JhxA/168s.jpg", "caption": "Friday special - garlic shrimp"}]}}, {"review": {"des": "By the number of reviews with an excellent rating I am sure mine will be an unpopular opinion but here goes nothing. <br><br>First I was not familiar with the ordering and seating routine but that was pretty smooth and the cashiers were super friendly and they get credit and one star for having sparkling water free on tap but that is about where the positives end. <br><br>I was seated at an extremely dirty high top seat. <br>Napkins, dishes and crumbs all over the counter so basically I had to bus and clean other peoples dirty  dishes to sit down. The host obviously saw it as he took me to the seat. <br><br>I ordered the Baja Chicken Sandwich and chips and salsa. The chips and salsa is where they get one more star it was a huge basket for $3 and two varieties of Salsa. <br>The Baja Chicken Sandwich was a HUGE disappointment which is surprising because the sandwich itself was so SMALL!  The cojita cheese was no where to be found, there were maybe 8 little chunks of chicken on the whole sandwich which was smeared with dry crusty black beans and flavorless coleslaw that 100% came from a bag and was not fresh cut. <br>I had to deconstruct the sandwich to even eat it as the bread was seriously rock hard! <br><br>I have had excellent experiences at the other R. B. establishments next door but my visit to XOCO has left me hungry.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cbjGrE9tCLbmoDdIVo3csA/348s.jpg", "caption": "Hardly worth it!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kx1nQohw9J4iRFETv8BnfA/168s.jpg", "caption": "Missing chicken on my Baja Chicken"}]}}, {"review": {"des": "I came here on a Saturday for lunch.<br><br>The good: <br>-Staff is friendly<br>-Line moves fast<br><br>-Food: <br>I had the goat torta and it was delish<br>My fiance has the beef tacos and equally yummy<br>Their guac is good<br>Margaritas strong (like I like them)<br>Their hot chocolate also good<br><br>The bad: They have limited sitting and most counters just face a wall<br><br>Final Verdict: Would certainly return if back in Chicago.", "pics": null}}, {"review": {"des": "I can only review churros as I have not yet eaten their food. <br>Churros and ice cream are phenomenal. I'm not sure how it works, but I've gotten different flavors of soft serve each time I've ordered it, and all have been delicious! Pairs perfectly with the freshly fried sweet churros. Highly recommend! Also, great options for outdoor seating on a nice day!", "pics": null}}, {"review": {"des": "Good, fun Mexican food. The seating situation is a little unique, when you first arrive you have to wait in a line to order and while you're in line they'll assign you your table number, which you can only go to after ordering. There are waitstaff but they don't take orders.<br><br>We ordered a carnitas sandwich, carnitas soup, guacamole, and churros (since everyone else seemed to be ordering the churros). Churros came first for some reason, followed by the guacamole which was small for $7 but good. Maybe 15 minutes later we got our entrees which were good, but not great. There were way too many onions in the carnitas sandwich and the soup was pretty salty. Other then that a good place, perfect for a quick lunch to have fun with a friend but not somewhere I'd go if I was looking for authentic Mexican food. <br><br>All that being said, the hazelnut-glazed churros were very good.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yNA0RX8rDLQwtPisHqyjvA/348s.jpg", "caption": "Ahogada"}]}}, {"review": {"des": "Pazole ,moles and margaritas Are Amazing here this some this place Fresh and delicious fun atmosphere for great for a quick biteoh try the chocolate mmmmm", "pics": null}}, {"review": {"des": "This is basically an overpriced Americanized Mexican place that fails on taste.<br><br>I paid $7 for 3 oz of \"fresh\" guacamole that came from a giant tub and had some diced tomatoes sprinkled on top (instead of mixed in) and pork rinds (yes, the cheap gas station type) sprinkled on top. Total disappointment at a high cost. The chips that came with it were swimming in salt.<br><br>I also had the Cubano sandwich. I hate mayo. I asked for no mayo. I was told that it came with mustard and no mayo. This \"mustard\" was white (not a hint of yellow) and tasted like a spiced mayo (or aioli). The meat was super salty and was overwhelmed by the bacon. The bread was dry. At $12, it's a complete rip off.<br><br>Seating is similar to most chains, counters and tables with people in close proximity. The space is small. I sat outside with parked vehicles in my face (at most a foot away) and watched the traffic go by (you face the street, not the sidewalk which is odd). Lots of exhaust fumes to flavor your food.<br><br>I came on a weekday at noon so it was packed. Luckily, there wasn't a line to order when i first got there but they had a lot of phoned in orders i suspect. I waited for over 30 minutes for my food. By the time I got my food, there was a long line of people waiting to order.<br><br>I recommend avoiding this place. There are many good Mexican options in this city for half the price and much better taste and quality.", "pics": null}}, {"review": {"des": "Xoco has one of the best happy hours I have been too.  Among the options, you can get margaritas for $5.  They are delicious and very strong, not the watered down type you find at other happy hour locations.  To go with our margaritas, we got some chips and guac to snack on.  It was easily on of the best guacamole I have had.  Would have easily gone through a second order.<br><br>To round out our meal, we had some churros and soft serve.  The soft serve was very tasty, with a strong vanilla flavor.  The churros were very good, but not the best I've had.  They aren't even the best Rick Bayless churros I've eaten.  Those would be at the Red O.<br><br>Xoco was so good, we ended up going back for dinner a few nights later.  To go with the obligatory margarita, we added a paloma, which was quite tasty.  We ate their tlayuda, which was so dang delicious.  The perfect balance of flavors, and we added some chicken on top to give us some protein.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VnMrHg2uO9y1iupRjE_trA/348s.jpg", "caption": "Churro with some soft serve"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/M35zmNDxFTtXBMb_kkIWXw/168s.jpg", "caption": "Chips, guac, and some margaritas"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WM6-y-HJ3VJlHMQNRC206w/168s.jpg", "caption": "Outside of Xoco"}]}}, {"review": {"des": "I stopped in here to try the Agua Frescas (drinks) which consist of fresh fruit blended with ice-I ordered the Strawberry Lime and wound up ordering two because it was so refreshing on a hot day!<br><br>I also ordered the house made tortilla chips that were served in a cool bilingual box and the house \"dressed\" guacamole!  The Fully Dressed Guacamole was topped with spicy roasted poblano, chicharrón (crispy fried pork skin), grilled onion, smoky bacon, local MightyVine tomato, queso fresco (fresh cheese), pumpkin seeds.  Very unique flavors together!<br><br>Amazingly fresh, delicious and unique.<br><br>I loved the outside seating area that is decorated with flowers and is covered from the sunshine-very innovative and classy.  It seems like a perfect little space to dine \"alfresco\" style.<br><br>I hope to return for lunch in near future to explore more of the menu.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dvLJR42KYmoO3yguW5l6qg/348s.jpg", "caption": "Fully Dressed Guacamole"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CKsYdv_2QNYEtCoLZBTiyw/168s.jpg", "caption": "Strawberry Lime Agua Fresca"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mwL-OLqebXyEllB_HSgFtA/168s.jpg", "caption": "Chips and Fully Dressed Guacamole Take Out"}]}}, {"review": {"des": "This is a order food and go find a seat and the food will be delivered to you kind of place. We stumbled upon this place on our last day of Chicago and I must say I was not disappointed. <br>They are known for their sandwiches so I opted for the daily special sandwich which was carne asada sandwich ($13) which had flank steak, salsa verde, mushroom, and a crema. <br><br>My bf got the short rib taco ($13) which comes with 3 tacos! It is a braised short rib with spicy tomato salsa, cheese, radish, and avocado. <br>We also got the almost naked guacamole ($7) which you can choose with 2 different toppings. So I chose chicharron and grilled onion. The guac also comes with salsa and chips. For dessert, we tried the pistachio churro. <br><br>First off, the carne asada torta is the best torta I have ever had!!! They used a baguette bread and the carne asada was cooked to perfection! The crema just tied everything together. I was very pleased with my selection. The short rib taco was alright. I'm not a big fan of braised meat so the taco wasn't to my liking. My bf also thought the taco was alright. The sandwich was still hands down the best. <br><br>The guac was also very tasty! The grilled onions made it taste better and the chicharron was just a cherry on top. There were also avocado chunks in the guacamole so you know its fresh guacamole. The churro was alright...not really what I was expecting. But I think I just don't like the flavor we chose. I would have to try another flavor next time. <br><br>Overall, the prices are a bit steep for a lunch meal with that size portion. But the sandwich is totally worth it! And it doesn't hurt to splurge on Mexican food here and there.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LI1WRgsGiJafNcTl0SkTlg/348s.jpg", "caption": "carne asada sandwich was to die for!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vN9ueWvp7y4z_YQkbDFqTw/168s.jpg", "caption": "pistachio churro...it was mehhh"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-Oa325Ts1oPKVn35E3pJ3A/168s.jpg", "caption": "braised short rib tacos...was alright"}]}}, {"review": {"des": "Interior - Small, dark, and cozy. There is patio seating. <br><br>Service - Welcoming, friendly, cheery. <br><br>Pistachio-glazed churro - Delicious, soft, crunchy, and never enough. <br><br>Soft serve ice cream - Love dipping my regular churro into this. <br><br>Ahogada (golden pork carnitas, black beans, tomato-arbol chile broth,<br>pickled onion) - Spicy, hot salsa soup. Bread was crispy. Pork was soft and savory.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kzZMXZ6E7Z4LLZpaYYxicA/348s.jpg", "caption": "Ahogada - golden pork carnitas, black beans, tomato-arbol chile broth, pickled onions 1"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2cZtwEzaZUcuNyKAcxIzpQ/168s.jpg", "caption": "Pistachio Glazed Churros"}]}}, {"review": {"des": "One of the best foods i have had. A great American take on Mexican food. The best thing here is the salsa you would get with the chips. Perfect for low budget and you never compromise on the taste. Good drinks, keep it simple. Thanks Rick Bayless", "pics": null}}, {"review": {"des": "My friend and I stopped in for brunch on a Saturday and had a great experience! Xoco is running a smooth operation and has an efficient system set up. Wait in line, someone assigns you a table, order at the register, get a number, wait in your seat until your food comes out. I had the tlayuda with chorizo and it was soooooo good! I'd get it every time, not even worrying if I'm potentially missing out on another dish on the menu. It was a pretty large portion size for being listed as a \"snack\" and I brought half of it home. I also got the churros with chocolate. The chocolate was super rich and very high quality. If you like churros, would definitely try the ones here. I can't wait to come back!!", "pics": null}}, {"review": {"des": "We found out about Xoco before our trip to Chicago from a friend and were thankful for his recommendation, because this place is solid.<br><br>We stopped here on a Thursday night and it was not crowded. We sat at a high top. As soon as we walked in staff approached us about how to order, how the number system works. They bring you your food based on your number. They even time when to bring out dessert if you order it! So considering this is a fast casual concept, the service is great.<br><br>We got chips and salsa which was SUPER plentiful, veggie tacos, a special sandwich of the day, and churros. Everything was super good, albeit I didn't fall in love with my tacos (which was my fault, I didn't notice I don't particularly love the type of cheese that was on them).<br><br>But we absolutely left full and happy and got a lot for our money.", "pics": null}}, {"review": {"des": "4 stars is really for the hot chocolate more than the sandwich (because I took the bread to-go and it was cold when I ate it) BUT REGARDLESS, this place is amazing. <br><br>For the price and quality it was way worth it. I went on a Saturday afternoon and it wasn't too busy. Service was quick but like other people said, this place is not a full service spot which isn't really a big deal in my opinion, but if you want something sit down for a while to chat then maybe go elsewhere. I think this spot is best describe as a upscale fast food restaurant based on the environment and all. <br><br>Now more importantly, let's talk about the food. I don't drink hot chocolate but after reading the reviews on it, I had to. I got the Aztec (slightly spicy) drink and wish I ordered two of them!! It wasn't too sweet or rich because of the super mild spice kick and you could really tastes there bean to cup because of the little grains that are in your mouth as you drink. There's definitely a texture to it. As I'm writing this in the airport, I'm already regretting not buying one of their chocolate mixes :( <br><br>Now onto the sandwich, I got the mushroom one to go. They were very accommodating and helped me separate the bun from the filling as I was taking it to the airport and didn't want the bread to get soggy- pro tip! Even cold, this was amazing so I can only imagine how good it would've tasted had I been there to eat it hot. It's okay though- the hot chocolate will be calling my name soon and I'll come back for the sandwich again. <br><br>Till next time, hot chocolate. I'll be back for you!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SEVMvL-DNSLluOuIsEdfuA/348s.jpg", "caption": "Churro was to standard but what really got me was the Aztec hot chocolate and I don't even like hot chocolate!"}]}}, {"review": {"des": "The carnitas tacos (four to an order!?) and chocolate espresso are both to die for. If this is Mexican food, I'm now a huge fan! Top it off with some fresh churros and chocolate sauce and life is good! Can't wait to come back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fBEkGmSai-R-KbPLdnZ54g/168s.jpg", "caption": "Churros and chocolate!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hNx5xEW-GXsX2wgJn1PoSg/168s.jpg", "caption": "Four tacos!?"}]}}, {"review": {"des": "WOW! I'm still dreaming of the AHOGADA and it's been quite some time now. The toasted torta (bread), the savory pork carnitas with perfectly picked onions dipped in a bath of warm, spicy tomato broth was absolutely amazing! <br><br>Everything my family of 6 and I tried was amazing, but the ahogada stood out the most. We were least fond of the WOODLAND MUSHROOM only because we don't like goat cheese - otherwise it would be tasty. <br><br>Definitely try the ahogada! I cannot stop raving about it. I'm on the search for ahogada here in SD but haven't found one that hits the spot like XOCO :(", "pics": null}}, {"review": {"des": "I only stopped in here briefly for the churros and chocolate, and my oh my.  What a treat!  The churros were perfectly light and fluffy, the chocolate dark and flavorful.  Delicious!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yjS9QlVbC51pJnd2SvmBeg/348s.jpg", "caption": "churros * chocolate"}]}}, {"review": {"des": "I recently discovered the Sat morning breakfast avocado toast. It is big, flavorful and filling. get this. <br><br>Also a favorite is the chicken or egg breakfast enchilada. Always good - chicken Milanese torta. It has a bit of a kick with the green sauce but really very good. <br><br>Definitely a unique establishment, a little tight on the inside for seating so I usually just carry out.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Kw4ZHQYssmjM9LEUvhn9SQ/348s.jpg", "caption": "Avocado toast - get it!"}]}}, {"review": {"des": "I heard and read a lot of reviews about this place so I came in with high expectations. I was quite disappointed after I tried the popular Ahogado. The sandwich was dunked in a tomato spicy soup. I asked for mild but their mild was more like medium. It was pretty spicy. The bread was good but I would have preferred the bread not to be dipped in a bowl of tomato soup. The flavor of the carnitas was good. <br><br>My bf has the Pepito. It was pretty good. The carmelized onions were really good. It kind of reminded me of a Philly cheesesteak sandwich. I liked his sandwich more than mine. He thought mine had more flavor. <br><br>The one thing I was looking forward to were the Churros. Pistachio glazed churro wasn't as great as I thought it would be. Looked good but the glaze tasted artificial. We had chocolate peanut churro as well and this one actually tasted better than the Pistachio but it wasn't amazing either. <br><br>Overall the food was decent and reasonably priced and service was good. I would probably come back to try other stuff.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0GZk303hru1RmIOhLRI_IQ/348s.jpg", "caption": "Pistachio glazed churro"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ELi-ZDW_J778FQtuuqMzXQ/168s.jpg", "caption": "Chocolate peanuts churro"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DhoV48Xxi8N6-O5LhJruMQ/168s.jpg", "caption": "Pepito"}]}}, {"review": {"des": "SOOOO AMAZING!<br><br>I ordered the Short Rib Tacos and my boyfriend ordered Ahogada. <br><br>The food was so tasty, it took a bit for them to bring it out to us, which I started to get a bit worried, since we were sitting outside.<br><br>The Short Rib Tacos are to die for, so tender and PERFECT!<br><br>They do stop serving breakfast by 10 am (on a Friday) which we were 10 minutes late for, so kind of bummed about that. <br><br>All in all, definitely recommend!", "pics": null}}, {"review": {"des": "Of course my luck - I visited Xoco during Chicago's restaurant week. The wait was practically out the door - so what does one do when there is a long line? Wait! Because the food must be worth it and it was! As we were in line, a host came around with tlayuda for everyone in line to sample. YUM. We were also able to order drinks as we waited. I ordered a limonada, very authentic and fresh! I was pleasantly surprised.<br><br>I loved all I ordered and would highly recommend all: Carnitas tacos, torta de milanesa de pollo, Churros, Guacamole with all the toppings. <br><br>I can't wait to visit again and try out the other dishes.<br><br>Very casual restaurant with great food and customer service. Highly recommended!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sTs-dcVfBu72P94vAkjoQQ/348s.jpg", "caption": "Paloma with mescal"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xJPcMC2_wEQ-vLHCDBEf7w/168s.jpg", "caption": "Chips and salsa order"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fq66i2n-8CtcI0RCYYbnyg/168s.jpg", "caption": "Chicharrones"}]}}, {"review": {"des": "You had me at Churro.<br><br>No wait. You had me at Chocolate.<br><br>Yeah, you clearly had me at Hot Chocolate.<br><br>But, those churros tho ... ok, it's Churros.<br><br>Definitely, had me at Fresh Churros.<br><br>Oh, Fresh-ground Hot Chocolate?<br><br>Ok, I take it back. You had me at Chocolate and then Churros.<br><br>What ... the Churros can be glazed with toppings?<br><br>Dammit, alright, you had me at Pistachio Glazed Churro.<br><br>And then Hot Chocolate.<br><br>Also, a Hazelnut Glazed Churro, too.<br><br>Yep, you had me at Pistachio Glazed Churro and a Hot Chocolate and Hazelnut Glazed Churro.<br><br>Hold on ... Regular Cinnamon Sugar Churros come with a Chocolate Shot for Dipping!!! <br><br>No, that's got to be first. Ok. You had me at Churros with a Chocolate Shot, then the Pistachio Churro, the Fresh Hot Chocolate, and finally the Hazelnut Churro. <br><br>Finally, you had me at ... Just a sec ... <br><br>Mexico City Thick Hot Chocolate? Like really thick?<br><br>Umm, I better let the next guy in line go. This may take a while. <br><br>So, you had me at Mexico City Thick Hot Chocolate, yeah, and then the Churros, ok ...", "pics": null}}, {"review": {"des": "We came here for dinner when family was in town visiting. It was a later dinner, maybe around 9pm or so. We walked in and were seated fairly quickly. We ordered from the counter, had a seat and our food was brought to us. I ordered the Ahogada sandwich. I love carnitas pork. I loved how tender it was. The tomato-arbol chile broth it was served with was the perfect amount of spicy! Of course we ordered chips, salsa and guacamole as well to top it off! Can't wait to come back and visit!", "pics": null}}, {"review": {"des": "Rick Bayless. Enough said. <br><br>The chilaquiles were everything I wanted; spicy, smoky, crunchy. And the churros, while a little sweeter than I prefer, were still a nice treat.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/q4NBNC_KTCnOot_KjQbWfA/168s.jpg", "caption": "Churros"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8smKufBlWR-yjSk_Hvlt6Q/168s.jpg", "caption": "Chilaquiles"}]}}, {"review": {"des": "As mentioned in other reviews, this isn't one of the finer Bayless establishments.  It's more casual (fast food), but I can't imagine the food being that much better in the other restaurants.<br>We got the braised beef short rib caldo, the short rib tacos (order of 4), and both were fantastic.<br>But the fully loaded guacamole and chips was honestly the best guac I've ever had.  <br>I can't wait to go back to try other items.  But I'll keep getting the guac...", "pics": null}}, {"review": {"des": "Heaven!!! I'm in town for a couple of days but it's so amazing I'm going to eat there both days. Absolutely LOVED the ahogada sandwich served with a spoon. Next I think I'll try a soup and a churro.  So DELISH!", "pics": null}}, {"review": {"des": "Overall service was subpar: With my party of 6, when we approached the counter to order we were told that there was not a table to seat us at the moment so we needed to let the people behind us skip ahead of us which we had to do with 16 different people which obviously was extremely difficult to understand when there was a table we tried to take when walking in which they sat a party of 3 at a table for 6. <br><br>Food: mixed reviews from our group, my food was just okay I had the vegetable tacos and the summer Friday special which was a Shrimp and avocado sandwich. The short rib tacos were a hit amongst the group.", "pics": null}}, {"review": {"des": "My first Rick Bayless restaurant and now I get the hype! Before Xoco, I never envisioned that Mexican sandwiches, or tortas, could be so creatively put together and delicious. No - the food here is definitely not cheap. But I see this more as a treat than a value/everyday-type meal.<br><br>Here's a ranking of my favorites:<br>1) CUBANA SANDWICH - $12 with smoked pork, bacon, a healthy serving of avocado, cheese, and a delicious chili sauce on the side. I just loved this combination and the bread was perfectly crispy yet soft. I thought it was the ideal sandwich. If this was $5 cheaper, I'd be getting this everyday for lunch.<br>2) AHOGADA - $11 pork carnitas sandwich dipped in a tomato chile broth that can be customized to your desired heat-level. I love spice and thought the 'hot' was pretty spicy! This is pretty messy to eat and the soggy bread requires that you down the sandwich faster than you can chew. The tomato chile addition really elevated the sandwich to the next level. Highly recommended!<br>3) PISTACHIO & HAZELNUT CHURROS - at $2.25 per churro, these were not your usual churros. There was a generous serving of pistachios but I really didn't think the sauces on these churros were anything special. Sure, if you're looking for a dessert - you can't go wrong with these. But then again, don't expect to be mindblown.<br>4) SHORT RIB TACOS - $13 for 4 tacos, these were my least favorite. For $3.25/taco, it was pricier than most tacos and not proportionally better. Yes, they were good. But definitely not a highlight.<br><br>Come here and order their specialty tortas! You won't be disappointed.<br><br>Btw - it's pronounced 'SHO-ko'. You're welcome :)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SAR3RNrrEXmUF0HllXm_RQ/348s.jpg", "caption": "Pistachio + hazelnut churros - yummm"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/AITH8usBijOdUQiL91gKkg/168s.jpg", "caption": "Ahogada - got the spicy and i definitely felt the heat! Very good and unique sandwich"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/shQGa38-bKX-rfjooX_alA/168s.jpg", "caption": "Cubana - YUM I loved this and the sauce"}]}}, {"review": {"des": "Great place for a quick and enjoyable meal! You first arrive and wait in line to order, then after given a table number you sit in any open table and wait for the food to arrive. Much like a fast-food type setting and some great quality food as well! I got the baja chicken torta which I enjoyed very much, and also shared some guacamole with my coworkers. The guacamole was average I'd say, but next time I go I definitely want to try their hot chocolate and churros! Especially the special which was a spicy, Mexican hot chocolate if I remember correctly! Overall, great place to go and try out!", "pics": null}}, {"review": {"des": "A friend took me here while I was visiting Chicago and I have to say I was beyond impressed! The ordering system is a little confusing as you are seated by a host but have to order at the counter. Other than that confusing moment everything else was perfect!<br><br>I had the ahogada torta and I seriously have dreams about it...the sandwich was that good. I ordered the spice level at medium since I can handle a little spice but this was a bit spicier than I imagined - so forewarning if you're sensitive to heat order a mild, it will still be delicious. I also ordered the churros - couldn't resist - and they were so good I ate them all before I had a chance to snap the picture ha so yeah they're pretty delicious. If I'm ever back in Chicago I will 100% return!", "pics": null}}, {"review": {"des": "Churros. I mean that's all I need to post right? The sandwiches, and dessert make this a complete meal and the prices weren't bad either. <br><br>On a busy day, the line can get long and finding a table is slightly difficult especially with larger groups. But the cuisine is excellent and will rock your taste buds. Definitely coming back!", "pics": null}}, {"review": {"des": "This is the \"fast food\" of the Bayless empire... and it's way better than any other fast food you could get in River North.  My favorite time to come in here is lunch, but it's great that they also have beer, wine and margaritas.  Patio seating on Illinois is a nice bonus on summer days, too.<br><br>Menu here is unlike most Mexican joints.  This is upscale and authentic, and the food will blow your mind.  Unlike the upscale Topolobambo and Frontera, this place does not have table service.  You order up at the counter and pay, then grab a number and they bring the food out to you.  The system is pretty easy and I've always had luck getting what I need without a dedicated waiter/waitress.<br><br>I would highly recommend this place.  I've been a dozen times and it's never disappointed.", "pics": null}}, {"review": {"des": "The reason for checking out this place was for the churros. The churros and the chocolate dip tasted so authentic. Definitely gets a 9/10 rating from me. Once we were seated and waited for our order, we could smell and see all of the other food being delivered to the table... we wish we were that hungry for a full meal. This place looked like dinner would have been amazing. <br><br>Anyway, dessert was great. Churros and the ice cream are recommended. Add this to your dessert go-to's for Chicago.", "pics": null}}, {"review": {"des": "My friend was really wanting to eat at a Rick Bayless restaurant so we decided to go here before a night of going out. At around 6 on black Friday. It was busy but I think we had just beat the crowds since we were able to get seated within 10 minutes. <br><br>The ordering system is a bit interesting, but you basically get assigned a table number, and you order at the counter, telling them your number. Then you get seated at that table. We ordered the chicken tinga tacos and the pork tacos. We also ordered a side salad, but I think they might have mixed us up with another table because instead of the side salad, we got the pumpkin seed dip.<br><br>We hadn't ordered the dip, but they let us keep it, and it was really good! It's almost like a hummus, but has a different flavor that I can't really describe. The chips were a little salty, but the jicama and cucumbers were both really fresh and tasted great dipped in the dip. The chicken tacos were really flavorful and well cooked. The avocado added a nice creaminess, and the salsa on the side provided a nice kick. The pork tacos, on the other hand, weren't as saucy as the chicken, but the pork was so so so tender! The salsa verde that comes with it gives it just enough flavor to prevent from being bland. I really like the pork ones because they weren't drenched in sauce to make you feel unhealthy.<br><br>The salad we had ordered wasn't coming but when we asked about it, they actually brought it out. Again, I think they might have messed up and given the dip to the wrong table, but it was nice that they let us keep it and still gave us the salad. The salad was pretty bad though, in my opinion; the dressing was just off for me -- too vinegar-y I think.<br><br>Overall, Xoco has a lot of hype because of it's celebrity owner. The restaurant is a twist on Mexican, so if you're looking for authentic tacos, there are other places to go. The atmosphere is busy and lively, and the prices are acceptable for the area. I would probably be willing to come back to try one of their tortas if given the chance!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Yg_KyU1ZQ7M3BazpdUI9Rw/168s.jpg", "caption": "Pork tacos"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hQqTvgzPJ84gbxPfBrqtuA/168s.jpg", "caption": "Pumpkin seed dip with chips, jicama, and cucumbers"}]}}, {"review": {"des": "Every time I come here I am treated so well. The people here are so friendly and hardworking. Today they threw in some free guacamole and their guac is great. The tortas are my favorite. The zucchini & egg torta is delicious. All of the sauces are complex and delicious too. They're not just average boring sauces or salsas. This is a great spot for breakfast or lunch.", "pics": null}}, {"review": {"des": "LOVE Churros with chocolate- reminds me of Madrid were they have it allover. Especially since this dipping chocolate is thick. The coconut -chocolate tres leches cake according to my son, is a life changing experience. Yes that is a little hyperbole but just a little. The turmeric and the ginger whip cream in the cake gives it a different take on this classic. And the crunchy praline on top of the cake makes a difference. We also had the classic hot chocolate. It's thick and engulfs your mouth with all the chocolate your taste buds can transmit to your brain. Yes I liked it. Then my son had his dinner the Carne Asada Tuesday special. Nothing wrong with it the beef was tender and marinated well. Yes we had dessert first.", "pics": null}}, {"review": {"des": "The food here is average at most. Nothing really stands out other than the freshly made churros but even those aren't omg amazing.", "pics": null}}, {"review": {"des": "Would give 3.5/5<br><br>Seating is limited where I came on a Friday night before and the line was almost out the door. I went again on a Wednesday night at 6:30 pm and I was the second in line to order. So - if you really want to try Xoco, come during the week, not on the weekend. <br><br>Service was quick and the cashier and the host were both nice and friendly. I tried their chips and salsa (good, no complaints) and the ahogada which is a pork carnitas sandwich served in a tomato broth. A sandwich..in a tomato broth? That's right, that's what I said. I was a bit skeptical at first because I don't exactly like..soggy bread (who does?). Anyway, it actually worked. Being able to dip the sandwich into the broth made the eating experience more fun. The flavors were really good and I'd actually highly recommend this sandwich. I also had their Mexico City thick hot chocolate - $4 for 8 oz which is expensive. It was a pretty thick hot chocolate (yes I know it's in the name)..it was interesting and would not get again. <br><br>Food: 3.5/5<br>Service: 4/5<br>Atmosphere: 3/5", "pics": null}}, {"review": {"des": "Try the tlayuda!<br><br>Braved the weirdly chilly April weather to hit Xoco for the tlayuda, what must have been the Oaxacan inspiration for Taco Bell's Mexican Pizza.<br><br>Despite being as large as a hubcap, the tlayuda was surprisingly light, with the crisp tortilla topped with beans, cheese, and sauces going down the hatch easily even with the addition of chorizo.  And as with all Xoco meals, definitely appreciated the corn-forward taste of each bite; this carried forward into the satisfyingly corn-y churros - Cinnamon Toast Crunch this was not.<br><br>Make sure to try the hot chocolate - not corny.", "pics": null}}, {"review": {"des": "I would say that one of my regrets when I visited Chicago was not being able to have a full-meal at Xoco. Giving it a 4 stars so that I can come back to give it a 5 stars after dining in!<br><br>+1 really courteous service. Upon walking in, you are immediately helped.<br>+1 They have sparkling water?! For free?! Woah....fancy!<br>+1 Good pricing and fresh dishes. The menu looks incredible and the ingredients are super fresh! (I saw a whole tub of avocados!)<br><br>I came here for their fresh churros, which is made to order (same with the glaze). They have a pretty extensive dessert menu (ice cream sundaes look BOMB) and a lot of people actually come here for that too!<br><br>Wait time is decent, for all the times I came. There is also a patio seating! <br><br>Pistachio glazed churro:<br>+1 cheap for the quality and quantity<br>+1 delicious glaze that wasn't too sweet<br><br>Pro tip 1: there is no extra charge for dining in! (Some restaurants charge a \"cup\" fee....)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qsfAidpkeJrJbXFOuXzk7A/348s.jpg", "caption": "Pistachio glazed churro"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EprDTNJA4JCOA5LUn85PuA/168s.jpg", "caption": "Display 2"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CAYW_GfU4RzXOYHXrHjtZA/168s.jpg", "caption": "Display 1"}]}}, {"review": {"des": "My friend and I tried this place during a food tour. As you know, the restaurant usually pre-cooked the food for the visit and made not be fresh. Surprisingly, XOCO provided warm greeting on arrival, vegetarian-friendly, offerings well-described, and the most important- the food was delicious!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LbwMGQr5-Y3X-mZYhURK1Q/348s.jpg", "caption": "Taco: CHICKEN TINGA  grilled Gunthorp  chicken, smoky chipotle-tomato sauce, local  potatoes, caramelized onions, fresco cheese,  avocado"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uy31PZmfkcwgeYcVPgC8Bg/168s.jpg", "caption": "Taco: RED CHILE VEGGIE River Valley Ranch mushrooms, Mexican zucchini, black beans, guajillo-garlic mojo, fresco cheese, onions & cilatro"}]}}, {"review": {"des": "I've been wanting to try Xoco for a while and finally decided to walk in on a busy Friday for lunch. Though the line was long, the host was quick to assign you a table and the wait wasn't bad. Once seated, my food came out quickly. The restaurant was very clean and I enjoyed the music!<br><br>I ordered the Shortrib Red Chile Soup & Aztec chocolate. I'm from Texas and have had my share of yummy Mexican food, so had high expectations. The shortrib was tender and the soup was good! I thought something was missing from the soup (maybe more lime?) and would've liked it to have a little more spice, but this is only my preference! The hot chocolate was delicious! It's made from ground chocolate and water. There was a hint of spice to the hot chocolate as well. <br><br>All-in-all it was a great experience and would consider going back to try more things on the menu.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ms-0EUCvNx8MS2zzk2MgZQ/168s.jpg", "caption": "Aztec Chocolate"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uDjExA-TcaEZnAEPMnVeeQ/168s.jpg", "caption": "Shortrib Red Chile Soup"}]}}, {"review": {"des": "Great place for breakfast and lunch. Close to several hotels in the area. Huevos rancheros with chorizo was absolutely delicious. Staff is good and prices are reasonable. One of my favorite Rick Bayless restaurants.", "pics": null}}, {"review": {"des": "You can't come to Chicago without trying at least one Rick Bayless restaurant, so I picked this one for it's convenience.  They have a peculiar seating method.  You get in line to order your food.  While you wait, a server comes up to you and asks if your ordering for here or to go.  If you tell him you want to be seated, he leaves, then returns and verbally assigns you a number.  Then, you order, pay, and then stand around waiting for your table to be ready.  The problem is, the place is so small, when others come in to order, they get confused by the number of people just standing around waiting for their table to be ready.  Instinctively, they just stand with us, believing that is the way to get seated.  They need a better system.<br><br>As far as the food, we had the chips and salsa.  Chips were OK, nothing special.  The salsa was good, they provide 2 different types.  We had the short rib tacos.  There were 4 to the order, and while they were good, once again, I didn't think they were unique or memorable.  We also had a one of the specials, it was the \"Gobernado\" torta.  It was torta with grilled shrimp, avocado, lettuce, sauce and homemade chorizo.  It sounds exciting, however, the sandwich is completely overwhelmed by the chorizo - you can't even taste the shrimp.  Realizing  that I was just getting a mouthful of chorizo, I opened the sandwich and scraped out some of the chorizo... and surprise, I could now actually taste the delicious shrimp!  They need to re-think that dish.<br><br>The service was friendly, albeit a little slow.  I'd be willing to go back and try other things on the menu, but I definitely wouldn't recommend the Gobernado.", "pics": null}}, {"review": {"des": "Xoco is a fun lunch spot right in the heart of downtown Chicago! To my surprise, you up go to the register and order instead of having a server. The staff is very friendly and guides first timers if they are confused on the ordering process. <br><br>Xoco has a variety of happy hour specials ranging from margaritas, tacos, appetizers, and build your own guacamole. Happy hour runs Tuesday-Friday 3-6pm<br><br>We had the happy hour margaritas, happy hour build you own guac (we added tomatoes, and spicy roasted poblano), chicken tinga tacos (4) tacos total), the tacos de papas, and the baja chicken sandwich. The food was amazing and the highlight of this lunch was definitely the sandwich, since the sandwiches are made in a wood burning oven the bread is phenomenal.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FWOKiLba4SDpJ13YDPVzYA/348s.jpg", "caption": "Chicken tinga tacos (4)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2NCOTpxsPpQon78U9n8Qcw/168s.jpg", "caption": "Tacos de papas"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fGZH5m6p3Hm2t8CqaX0u3w/168s.jpg", "caption": "Baja chicken sandwich"}]}}, {"review": {"des": "I'm shocked I don't have a previous review for Xoco.  I used to go to the Wicker location before the close and it's certainly a favorite.  The loaded guac, the ahoghada, and the caldos are the winners here.  If your lucky enough you'll run into Chef Rick himself.  He frequents the location everyday at different times.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jFyv2jbjt378BgMmLqf3jQ/348s.jpg", "caption": "XOCO Salad with grilled chicken"}]}}, {"review": {"des": "I've been dying to go to this place for a long time (I don't live in Chicago) and it completely lived up to my expectations. First of all the way they handle service is genius: You're given a number which corresponds to where you sit. You then order at the counter and everything is brought out to you: the perfect midway point between table service and fast casual. But the food of course is the star. The short rib tacos were probably the best tacos I've ever had. What made them amazing wasn't the marinade or how it tastes with the salsas etc. It's just the pure taste of the short ribs themselves. They've been braised or something forever to the point that they're impossibly tender and juicy. It has the taste and the mouthfeel of the world's best pot roast or something. <br><br>Carnitas tacos were also tender and juicy but didn't quite have the depth of flavor of those incredible short ribs, which didn't even need any salsas or anything they were so flavorful on their own. The guacamole was also among the best I ever had and you can order it with all types of accoutrements on top of it including bacon and chicarones which made it even better. We also got an order of the chicharrones. They're big pieces of pig skin with some hot sauce on them. They were good of course, though not miles away from ones you can buy in a bag. <br><br>Even the drinks were superlative. The margaritas were really strong but well balanced. The Jamaica Agua Fresca was the best version of that drink I've ever head. They infused so much hibiscus flavor into that drink it was amazing.", "pics": null}}, {"review": {"des": "YOU GUYS. GO HERE. I was in Chicago for only two days and ate here twice. It was that good! First I went for lunch and had the chicken tinga tacos - really excellent flavor! For breakfast on Saturday, I got the chorizo and egg breakfast enchiladas (pictured) and they were TO DIE FOR... I wanted to lick the plate. And to top it all off, the guy at the door even recognized me from the day before and greeted me as such. The prices are so reasonable for the price and quantity of food you receive. I can't wait to go back and try some more goodies!", "pics": null}}, {"review": {"des": "Jesus. I have completely given up on this place. I guess in the past four years, I forgot what a disaster it is to pick up food and how \"just OK\" their posole is. I'm going to order some damn chiles and make it my damn self. Is that enough damns? This is the mood I meant every time I try to pick up food at this place.<br><br>Picking up an order here is a complete clusterfuck, just too much activity, no streamlined process, no set person to check in with, and your food may be sitting there getting cold while they pack orders for Caviar or other takeout services. <br><br>Happened again today, and when I commented on it and felt my relatively cold container, they tried to tell me it just came out. No it didn't, cuz I just stood there and watched you. I ordered an item you literally have to scoop into a container, and it's not like they started cooking at when I ordered. <br><br>Maybe they intend for all their food to be reheated in the microwave, but that is not what I am trying to do with a takeout container. I'm trying to walk a couple of blocks and get it to my house and just eat it all right.  They have a decent food product, but they really need to work on their online ordering and pickup process. Right now, it's more disorganized than a Chicago government institution. To top it off, the posole was very salty but not very flavorful. <br><br>Coming here is just an unpleasant experience but I don't think I will repeat. Is it crazy that their O'Hare locations are much more efficient??", "pics": null}}, {"review": {"des": "Overly hyped. Stopped by for lunch and ordered the Cubano (too salty), the Baja chicken, guac with chips, and a bit chocolate. Hot chocolate was hands down the best thing ordered out of everything. It's amazingly rich and incredibly wonderful. Sandwiches were your typical sandwiches. Didn't taste anything special. Guac was typical guac you could get anywhere. Chips actually tasted a little stale. A decent lunch but wished we went somewhere else.", "pics": null}}, {"review": {"des": "One of my favorite lunch stops. I have had the Ahogada twice and it was just amazing. The pork sandwich is excellent but the spicy tomato broth is the real deal. I got my broth spicy this time and I would compare the Ahogada to an awesome pork panini with a spicy tomato soup. <br><br>When you come in stop by the hostess to get a seat(s) and then order (they ask for your table). Water is free but they have awesome beverage choices too.", "pics": null}}, {"review": {"des": "Definitely take my review with a grain of salt because my only experience here was a quick stop on a food tour. <br><br>Knowing that, though, what I had was enough to make me want to come back for more! They had an open faced torta (I think I might even had had two because there were extras) with a black bean spread and veggies. I don't remember the specifics (other than the tomatoes tasting so so fresh and juicy) but I do remember that it was super flavorful and just a tad bit spicy. <br><br>I'd love to come back and actually eat here for real, if everything tastes as good as that torta!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/D-HWt0HtVr5VOztQounPPQ/168s.jpg", "caption": "Open faced tortas we tried during a food tour"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/r83Qq-kSPmjAwxmlfT-5jQ/168s.jpg", "caption": "Open faced sandwich on torta with black bean spread, veggies from local farms, slightly spicy, very flavorful"}]}}, {"review": {"des": "Stayed in Chicago for the Georgia/Notre Dame football game. My husband and I really wanted to go to a Rick Bayless restaurant because we watch him on TV. Well we were in for a real treat. Rick Bayless was in the house!!! They were celebrating the one year anniversary of the restaurant and he passed out cake. Seriously amazing.<br><br>On top of that, the food is seriously delicious. The guacamole was great. It had all of these fixins on it, but there was this super smoky bacon that was like no bacon I've had before. Both of our Tortas were delicious and we ended the meal with those awesome churros.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lmY5HPEHnQQ8XWIYhDJZJQ/168s.jpg", "caption": "Rick Bayless in the house!!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/F4jQuxkFz0ne0XwbjOINGg/168s.jpg", "caption": "The cake they passed out for their one year anniversary"}]}}, {"review": {"des": "Happened to be on a work trip and was in need of a local spot for some food. Due to the small space this restaurant has, you have you order first and they seat you based on your party size. It is pretty standard method of seating. I have no complaints because everything was seamless and smooth (during prime lunch time, too!). <br><br>I had the Pepito Torta! The bread was crispy, but not too tough and the filling was pretty good. The green sauce it comes with was absolutely mandatory to help cut the heavy caramelized onions. Unfortunately, I am a believer that food served should always been good without the sauce. The accompaniment sauce should only enhance a meal; not make or break the dish.<br><br>Overall, it wasn't mind-blowing. It is everything a SoCal girl expected in Mexican inspired-food in the Midwest. <br><br>I knocked 1 star off because the taste was a 4/5 and the price did not help. If it was a few dollars cheaper, then this establishment would have definitely gotten another 5 stars.", "pics": null}}, {"review": {"des": "This place is well run and very efficient. We stood in line and waited to order and someone will ask you how many are dining here and then we tell the cashier what our table number is. <br><br>Ambience is very casual and you order at the cashier and food will come to your table. <br><br>We ordered the chicharrones, short rib red Chile soup and pozole with carnitas. <br><br>Out of all the dishes my favorite was the short rib soup. The broth is so full of flavor and it's not rich but it's got real beef flavored depth. Just absolutely delicious. It comes with some fried potatoes and zucchini and some arugula. I finished the whole bowl. <br><br>The pozole was good but I don't think it can stack up to the short rib soup. My husband enjoyed it but he took 3 spoonfuls of my short rib soup. <br><br>The chicharrones was ok. I didn't they were that flavorful. It just added some crunch to my dinner <br><br>My husband also ordered a bottle of Mexican Coke. <br><br>Prices very fair and reasonable. We paid about $35 for our meal.", "pics": null}}, {"review": {"des": "Churros. Churros. Churros.<br><br>Came here after dinner for a quick dessert. My girlfriend and I ordered the pistachio and hazelnut churros. We waited for about 15 minutes. The churros were warm and delicious. They are definitely different from churros you'd get from a stand in that they are smaller, not as doughy, and covered in delicious dessert glaze. It is hard to explain but they're good. Highly recommend the churros.", "pics": null}}, {"review": {"des": "We landed here unexpectedly due to bad service from another restaurant but I'm glad we tried this place. The food and salsa is delicious! They also have a nice selection of Mexican dessert! Best of all the service is fast and very very friendly.", "pics": null}}, {"review": {"des": "I've been to a couple of Rick Bayless' restaurants now, and this was by far my favorite. This is more of a quick bite place. It's a small seater and you order at a counter. The food is flavor packed! <br><br>Get a house marg! They have happy hour from 3-5, where margs are half off.<br><br>Food wise:<br>-Tlayuda: a corn tostada that is wood fried with black bean spread, salsa and cheese. This not only looks amazing but tastes great too. It's crunchy and flavorful. <br>-Fully Dressed Guacamole: basically guac with a bunch of toppings, including chicharron. Cool take on guac as it was a little crunchy. Not bad <br>-Milanesa Sandwich: crispy chicken with cabbage, cheese, salsa, jalapeños and black beans. This was a good sandwich. Crispy chicken was not over fried.<br>-Chipotle Shrimp Sandwich: This was the Friday special. I wasn't really impressed. Wasn't as flavorful <br>-Avocado Toast with chicken: this not only looked pretty but was very flavorful. The chicken was a good addition. <br>-Pozole Soup meal-in-a-bowl: red chili broth, corn, cilantro and others. We added the chicken. This was good but bland, I added a lot of their spicy salsa for flavor.<br>-Short Rib Tacos: must try! Very flavorful and cooked well. <br>-Churros: came with a great caramel sauce. <br><br>I definitely want to come here to try more of the menu. Come at odd times, or you'll be waiting in line.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vfLRYIsFUAnLalkpW3gRQw/348s.jpg", "caption": "Pozole Soup"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_uH6BNe1mUVoRf1JlFVoPw/168s.jpg", "caption": "Avocado Toast"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bCygN_Unm2ugrAdIs-e60w/168s.jpg", "caption": "Tlayuda"}]}}, {"review": {"des": "Xoco is a fast casual Mexican restaurant in Chicago by Rick Bayless. You order like a fast food restaurant but you get an assigned table as soon as you line up. The food was great for a quick casual meal! <br><br>I didn't plan on stopping Xoco. But thanks to confusion about EST and CT, we had an hour between our reservation at Frontera Grill. My friend suggested we stop here to try a churro.<br><br>Sure, why not. We lined up, got a table number. Ordered at the cashier, got seltzer water, then sat in our assigned seating area. <br><br>We ordered the glazed pistachio churro (so crunchy, mildy sweet and perfectly done!), chicken Tlayuda (amazingly-thin crispy wood-fired tortilla-like pizza with grilled juicy chicken chunks), and a basket of chicharrones (fried pork skin topped with sriracha). <br><br>I loved the tlayuda so much that I wished we had ordered another one and had dinner here! I also wanted a churro or two for myself. <br>The only food that was great was the chicharrones. Due to the thick strips, they weren't very crispy and lacked seasoning. The hot sauce overwhelmed them. This you can skip.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vGmAFOlt9zU6ksyt8utOvA/168s.jpg", "caption": "Chicharones"}]}}, {"review": {"des": "I've had this restaurant need my bookmarks for a while now and I was finally able to go. Yes, the tortas are good, but definitely not worth the hype. <br>Unfortunately, service wasn't at its best either, since we asked the chef to accommodate us due to a dietary restriction and they were on willing to help.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9PkAzDEEdaW-5eUDIGyp0w/348s.jpg", "caption": "Shrimp Chipotle Torta"}]}}, {"review": {"des": "So, so, so good!<br><br>We came in on a Tuesday afternoon & there was no wait.  Causal restaurant.  <br><br>Carne Asada Sandwich (Tuesday Special):  This needs to be on the regular menu!  Big enough to split but why would you?  You will want to scarf it down alone.  I loved how the bread was crispy & loved the green sauce.  It was sweet & spicy.  The meat was so tender & juicy.<br>Churros:  Get in my belly!  Make sure to add soft-serve ice cream to dip it in.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0S-YOgroAEbsRmlqxozoOA/168s.jpg", "caption": "Churros"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HOHZoxIXbUeOHAa4wda_PA/168s.jpg", "caption": "Carne Asada Sandwich"}]}}, {"review": {"des": "The food was exquisite, I really enjoyed the vibe the restaurant has. It was a perfect place to hangout with friends if you're having a casual meal however my food runner \"yucly\" was extremely rude. I felt so disappointed in the service that she gave us<br> I asked her for more lines and a glass of water and she responded in a very rude matter which made me feel very uncomfortable asking for the stuff <br> ( She probably might of had a bad day or whatever the situation was but there was no necessity for her to act that way)", "pics": null}}, {"review": {"des": "3.5 stars. Not super impressed. The food was good, but it was not worth the price. My friend and I came here because we had seen so many good reviews and were super excited to try the dessert here! So the whole process is that you walk in, the hostess tells you a table number and you go order and tell them that number so they can deliver your food to your table. Something that I really didn't like was the set up. A lot of the chairs faced the wall. This might sound silly, but I'm sure you understand if you've been there or if you just take a step in. <br><br>My friend and I ordered the Thursday special which was a short rib sandwich, which totaled out to almost 14 dollars. While the sandwich was delicious, it was also a tad small. Each half was about the size of my palm, and my hands ain't big. We also wanted to order the strawberry soft-serve, but were told coldly that it wasn't available. The cashier didn't really give an explanation and didn't apologize. Obviously the situation wasn't her fault, but usually you'd expect a simple \"sorry it's not available because...\" so we ended up just getting one churro and one pistachio glazed churro. <br><br>I know everyone is raving about the churros and how great they were, but honestly I'd say they were alright. They weren't bad, but they were definitely NOT BOMB!!!! I appreciated the crispiness outside and the soft inside, but it wasn't anything special. If the food was cheaper, I'd come back, but honestly I'd probably go to Costco to get churros instead. Not only is the churro a lot bigger, but it's pretty much half the price!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3BEtWKzRMWK9dZD6c-Kt4w/348s.jpg", "caption": "Regular Churro (1.60)"}]}}, {"review": {"des": "Most unique spin on Mexican food - ever!  Fresh, yummy food with super friendly staff.", "pics": null}}, {"review": {"des": "EAT HERE - more than once. Go for breakfast and come back for dinner and margaritas.  <br>Super delicious and ridiculously affordable for the quality and quantity of food you are served!<br>We had the Smoky Bacon Mollette (open faced sandwich), Baja Chicken sandwich and the Fully Dressed guacamole- you must order it this way.<br>All of this plus coffee was only $34.00!!!<br>We had a churro for dessert which was also good.", "pics": null}}, {"review": {"des": "I expected a lot out of this place and it was really just super OK. <br><br>I got the chicken milanesa (double chicken) and barely finished it, just cause it wasn't outstanding, the bread was actually pretty dry, also, ordered it with no cheese and as soon as I got it, there was clearly cheese all over it so I had to send it back and wait yet again for it to be made the correct way. We also got the chicken pozole.. just a layer of oil and grease on the top.. almost inedible, just couldn't do it. On a different note, the mexican chocolate hazelnut cookie was dope af, I'd go back for that again... but strictly that.", "pics": null}}, {"review": {"des": "This place came highly recommended but I was not impressed. I had a carne asada torta, and many of the pieces of meat were rare. Every torta that I've ever had the meat was fully cooked. I was completely turned off by this place, had they asked how I wanted the meat cooked, I would have specified. <br>They also sat two of us next to a family of about 8 at the same table, I was so distracted by the other family I couldn't enjoy my margarita. <br>Very Americanized Mexican food.", "pics": null}}, {"review": {"des": "I don't know where to start with XOCO-- I would have never tried this place if it wasn't for a coworker's recommendation. From the outside, it seems like any other food setup in Chicago. Step inside and things change. You immediately get hit with aromas of spices and fresh vegetables, you hear the sizzling of different cheeses and fried meats-- suddenly you know you're in for a good meal. <br><br>The spot itself has decent seating, but it isn't too big or too small. It's not somewhere you'd go to socialize and interact with others; rather it's a spot to come with friends and grab a bite or two. Service here is good and pretty straightforward; you go to the cashier, order your food, and are assigned a table. <br><br>Things I Liked:<br><br>Baja Chicken Sandwich - I got this sandwich twice, a testament to how good it is. You get locally sourced chicken with a fantastic chipotle mayo, slaw, black beans, and queso fresco. It sounds pretty typical, but one bite into this savory sandwich will have you wanting for more. I highly recommend getting it with a side of chips and fries.<br><br>XOCO Margarita - It's your typical margarita, albeit with Grand Marnier and it is SO good.<br><br>Things I Disliked:<br>Nothing!<br><br>Insider Tips:<br>*Get the chips & variety of salsas<br>*Try the chocolate!", "pics": null}}, {"review": {"des": "For quick Mexican at a reasonable price, Xoco (I belive they pronounce it \"show-ko\") is a great option. They serve up Oaxacan inspired sandwiches, soups, salads, and bowls. On Saturday at 2, we had to wait in line about 15 minutes before ordering, but they have a very efficient system of assigning people table numbers while they are still in line. <br><br>We started with the pepito sandwich, which feautures a thick serving of short ribs with carmelized onions. Yummy. The second sandwich we shared might have been even better, the milanesa griddle sandwich, which comes with a thin fried chicken patty and a tasty sauce. If you're looking for a quick reasonably priced lunch, I recommend it.", "pics": null}}, {"review": {"des": "I was unfortunately and unexpectedly disappointed with Xoco. <br><br>The ordering process was so complicated. We were informed of our table number when we walked in, was then asked for our table number at check out, and was then asked a second time once we paid the bill. I was expecting for the restaurant to keep track of this.<br><br>We sit down at a \"high top\" table which we were expecting to be a high top table with seats facing one another but was instead 2 chairs that faced a wall.<br><br>The food was pretty good but the cocktails were subpar and the beer was warm. <br><br>I'm sad to say that I will probably not return to this establishment.", "pics": null}}, {"review": {"des": "Yes...come here and eat...it's so good. At first I didn't think it was going to be that good and that this place was overhyped due to their catchy IG pictures. Boy was I wrong, this place was amazing. <br><br>Service: The service was excellent. The staff was extremely nice and tentative. <br><br>Food: The food was soooooo goooooddddd. In addition, save room for the churros and ice cream. Did I mention, it is soooooo goooodddddd.", "pics": null}}, {"review": {"des": "Loved the cubana sandwich! I was afraid it would be too greasy but the sandwich stayed in tact and held the grease in. It was a perfect blend of salty and creamy. <br><br>Came back another day and tried the churro sundae with a friend and while it was tasty, I probably won't bother getting it again. The sundae is Mexican vanilla flavored ice cream (tasted like horchara to me) with churros, sprinkled with bacon caramel popcorn. The bacon caramel popcorn had the actual bacon flavor and texture, as if little bacon pieces were actually on the popcorn!<br><br>I'd love to come back to try more of the sandwiches!", "pics": null}}, {"review": {"des": "Originally just went here to get the churros, which were amazing, but I think my favorite part were the chorizo tacos! They were on the happy hour menu and SO flavor. I think I ate 5 total, I just kept ordering. They have patio seating and an awesome location.", "pics": null}}, {"review": {"des": "I had high hopes for this place. I am vegan and saw they had a lot of options. I ordered the veggie tacos and stated no cheese, but of course there was cheese on it! It was difficult to pick it out and it tasted mediocre. I also ordered the almost naked guacamole. This and the chips were very tasty. Maybe I just had one bad experience. I know they are more known for tortas so I probably should have just gotten those.", "pics": null}}, {"review": {"des": "I really enjoy the food here. I usually get the pork tacos, and they are flavorful but still simple. I also usually have to treat myself to churros with ice cream! I am not convinced the seating system is a very smooth one. We were a larger group of 6 and they gave us our table number, and here was a bunch of confusion about sitting us all together or two different table. Eventually they asked another group to move over. They were very nice about it but I'm sure that was frustrating. Also, when I received my dessert, the ice cream was strawberry tho the menu had said vanilla. They said that they had just made the switch, which I did point out that was frustrating since no one had told me this when I ordered. The combo made the ice cream taste sour, as in the gone bad way. However, they did apologize and offered to give me chocolate sauce instead. So it all worked out. Nothing drastic enough for me to discourage friends who love going here for their birthday.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7VaPdNmKla5n1kUQI_tpUw/348s.jpg", "caption": "Carnitas tacos - quite tasty!!"}]}}, {"review": {"des": "3.5 stars. Good food but wasn't worth the wait.<br><br>How can you say no to churros?! Came with a group of friends on Wednesday evening and it was quite busy. Bad thing about this place is that they don't take reservations so we ended up having to wait about 25-30 minutes in line for a table. Not a good spot for large groups. The service was a bit all over the place from the start, they seemed a bit confused and kept asking how many people were in our group even though we already told them several times. It was kind of weird that they wouldn't take our order until the table was ready, and we couldn't get drinks while waiting either. So that was kind of annoying but with that being said, we had more than enough time to check out the menu. They have daily specials for sandwiches, which I believe was pork belly that day. Sounded tempting but I decided on the pepito torta for my entree and we shared the fully dressed guacamole.<br><br>Once we were seated, the food came out fairly quick. The guac was good but the sandwich was even better. It was filled with short rib, caramelized onions, artisan jack cheese, black beans, and pickled jalapeños. Even though I was quite full, I knew that I had to get the churros. Got the regular cinnamon sugar, which were 3 for $4 or $1.60 each. I obviously had to go with the better deal. They were warm, perfectly crispy, and had the right amount of sweetness. I will have to try the churro sundae or glazed pistachio one next time! If you stop by here, do not skip the churros.<br><br>They also have a happy hour special (Tuesday through Friday from 3-6 p.m.) which includes:<br>- Xoco margaritas ($5)<br>- Guacamole with two toppings ($5)<br>- Sikil pak ($3)<br>- Featured beer ($3) or wine ($5)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QSqeDIGD3aWdzNz1ZrukJQ/348s.jpg", "caption": "Chicharrones"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qniMcmH6aIKrvQyN26Dnqg/168s.jpg", "caption": "Churros"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-NwZuFQlSUXuvfliIb7G6A/168s.jpg", "caption": "Baja chicken"}]}}, {"review": {"des": "Rick Bayless struck gold with this fast causal concept. I was immediately impressed from the minute I stepped in the door.  The staff will help you through the line, assign you a table, and deliver the food right to your table in a seamless execution.  <br><br>I ordered the naked guacamole which was amazingly fresh and creamy.  The chips were multigrain tortilla chips and reminded me of some other delicious healthy chips I've had in my past. <br>For my entree I ordered the Friday Torta special - chipotle shrimp.  This was MONEY.  The shrimp was bigger and better than most restaurants.  All the spices, dressings, and toppings were perfection.  The bread was a little thick in relation to the meat on the sandwich but can't complain much about minor details.<br>I also got the Xoco marg which was completely on point with the flavor and amount of alcohol.<br><br>If you want to try a Rick Bayless restaurant but don't want to spend the money at Frontera - come here!!!  You will not be disappointed.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NhNuzJeK9Nfgn42rwl6FzQ/168s.jpg", "caption": "Naked gauc with queso and tomatoes"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/NvFyDBm56PYUw2SktgAs0A/168s.jpg", "caption": "Chipotle Friday - Smoky Garlic Shrimp torts. Highly recommend!!!"}]}}, {"review": {"des": "This is one of my favorite restaurants in Chicago and I go relatively often. The food has amazing flavors and is well presented. I think the cochinita pibil and goat barbacoa tortas are my favorite entrees, but the chocolate is what I really go for. The iced mint chocolate drink is fresh and perfect for a warm day, and the other drinking and dipping chocolates are wonderfully intense. The staff is very friendly and helpful as well.", "pics": null}}, {"review": {"des": "Came here for a quick bite based on the reviews from yelp. <br><br>1. Short rib torta - 3 (bland)<br>2. Short rib soup - 2 too salty <br>3. Chicken tinga tacos - 4 soft tacos<br>4. Full guacamole - 3.5 <br>5. Chocolate churros - 3 very very dark chocolate <br>6. Pistachio churro - 3 too sweet<br><br>1. This was a little bland and dry. It was cooked well but needed some sort of sauce to give it extra flavor. <br>2. This was the opposite way too salty. I was suckered by the red soup hoping it was more tomato base.<br>3. This was good. The taco shell was soft and fresh. Best part of the meal. Comes with 4 tacos. <br>4. They might have been trying too hard with the full guacamole.  The chips were great tho. <br>5. We didn't like any of the churros. Very very dark and bitter and I like dark chocolate.  <br>6. This was a bit too sweet. <br><br>Overall it was an interesting eat.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Z4TIrBnpwK47RfZX399yUQ/348s.jpg", "caption": "Pastries"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sOLRgqwHXyO8lcCAl9acbQ/168s.jpg", "caption": "Full guacamole"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7Xg2CyHENHtWtOmr0yqqTA/168s.jpg", "caption": "Short rib soup"}]}}, {"review": {"des": "Came here on a Saturday around 7pm and we were able to get seated in about 10 minutes for a party of 9. Service was quick and the food was on average, good.<br><br>I had the octopus salad (~$14) and there were about 5 pieces of octopus total. The flavor was good, but I've had much better salads.<br><br>My friends who got tortas say it was good, but those who got the meal in the bowl didn't like their meals as much. The guacamole and chips were lacking a bit of salt in my opinion.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4pIEn8izCZoginCkrp3sXA/348s.jpg", "caption": "Octopus salad"}]}}, {"review": {"des": "Was drawn by the churros.  We ordered the pistachio and hazelnut.  I'm a huge fan of pistachio but the flavor was ok here.  The hazelnut was delish!!  We also ordered the avocado toast which we enjoyed.  Good portion of avocado with bacon topped with a sunny side up egg.  Ordering process confused me but other than we enjoyed this place.", "pics": null}}, {"review": {"des": "Personally for me, there is no better way to get some energy and brighten up my mood before walking around and exploring the city on a sunny afternoon. For a quick bite I always prefer to check in here over Frontera Grill if I'm on the clock.<br><br>The go-to is and will always be the ahogada and the goat barbacoa (when I make it on the right day for the special) tortas. The mix of textures in the ahogada make it one of the most unique sandwiches in town. If I am with a group of friends I'll recommend ordering the guac and hot chocolate churros. Avoid peak lunch hours because the line can get quite long sometimes.", "pics": null}}, {"review": {"des": "Recommend this spot for a semi quick bite with extremely tasty tortas. I would have to say this is one of the best tortas I had. I got the pepito and when combined with the sauce, it tasted really good. The sauce that comes with the torta really complements it to give you an explosion of flavors.<br><br>I also got the pistachio churro and the churro had the perfect amount of dough and crunchiness to it. Would definitely recommend trying those two items.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3aY7TqGBM9HnCMGwbOBmxg/348s.jpg", "caption": "Interior of restaurant"}]}}, {"review": {"des": "Xoco, I love you! I love how loud and crammed with people you are and how every inch of you GRITA street food! It all takes me back to hot days in Mexico City or Oaxaca stuffing my face with tacos and tortas as I pushed my way through crowed hot streets. <br><br>Your Cochinita Pibil es todo lo que debe ser! Juicy, soft and packed with flavor and the salsa that comes with it made me sweat it's so good and spicy! <br><br>El agua de Jicima is so refreshing please serve it in bigger glasses next time I come. <br><br>Finally the Churros with the chocolate dipping sauce had me asking why I don't live in Chicago.<br><br>Shout out to your DJ who was blasting the Reggaeton hits, I swear the only thing missing is the shady guy walking around softly yelling \"toques,toques\" (if you have to ask you haven't done Mexico right)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DIW_9acQ66DlMBp5AJhdMw/348s.jpg", "caption": "Chuuuuuurros"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ptJ8iYTPC6W3cm0rVPDkjQ/168s.jpg", "caption": "Dessert three ways"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NDR71fkkYligSgFMXLs_7A/168s.jpg", "caption": "Farm to table"}]}}]}