{"name": "yolk-south-loop-chicago", "reviews": [{"review": {"des": "I've said it a million times, but I love breakfast. LOVE it. One of my favorite parts of traveling is finding great breakfast spots. I asked Anna K for some breakfast recommendations for my group as we headed out of Chicago and she suggested this location of Yolk. I'm so glad she did, because it was a big hit with everyone. Street parking wasn't available so we ended up in one of the nearby parking garages ($13). I checked the Yelp app and it said there was no wait, and sure enough we were seated right away.<br><br>Our server was really attentive and super polite. He gave some really good recommendations as well. I ordered the Yolk All-star Combo, which includes two eggs, bacon, sausage, and a choice of either pancakes, crepes, French toast, or half a waffle. I went with pancakes to share with my boyfriend. Our friends ordered the All-star and the El Torero scrambler, which has chorizo, avocado, tomato, cheese, salsa, and sour cream. The scramblers all come with seasoned potatoes or cheesy grits, as well as toast, pancakes, or an English muffin. Finally, my boyfriend ordered the croque madame with cheesy grits.<br><br>Our food came out really quickly and everything looked great. I had a bite of the croque madame and it was tasty - savory but a little sweet at the same time, with the saltiness of the ham and sweetness from the French toast. The cheesy grits were one of my favorite parts of the meal. They were really buttery and had a good cheesy flavor, much better than most I've had. My basic breakfast was all prepared well and the bacon was cooked perfectly. One of my favorite parts about dining at Yolk was the variety in the menu. I love when you can swap out sides or upgrade to other options. They even have 100% pure Vermont maple syrup as an upgrade. Definitely a great breakfast spot to check out if you're in the area. I'm sure it gets super busy at peak times, but you can use the Yelp app to get on the list if they're on a wait.", "pics": null}}, {"review": {"des": "The food was outstanding to say the least. The portions are large and fulfilling! Nothing beats a well made pancake with some tasty homemade syrup. I got the protein and eggs and added some more sausage on the side. Overall the food amazed me.<br><br>The service was fantastic as well! Brandon, our waiter, was very attentive and helpful - especially when ordering (because there's so much to chose from). The food came out quick as well. There was a wait to get a table but, 100% worth the wait. I'm glad I found another solid place to brunch with friends.", "pics": null}}, {"review": {"des": "I had reviewed the Streeterville location (4 stars) last year when we were in Chicago, happy to say the South Loop location was just as good! We ended up having breakfast at this location 3 days in a row as it was a few block from our hotel on Michigan Avenue.  On each visit the food and service was consistently good. On the third visit after checking in on Yelp I had the pleasure of wearing the \"Duke\" crown!<br><br>Food: Large portions, freshly prepared, and perfectly prepared is how i'd sum up our three days at Yolk. We tried a variety of breakfast items from their Eggs Benedict, Waffles, Egg Scrambles, and a variety of breakfast meats. My favorites were the thickly cut ham steaks, their delicious turkey sausage, and El Toro Scramble. Let's just say that the portions are generous and the food tasty!<br><br>Service: Each day we had a different server and seated at different spots in the restaurants. One day it was a booth, one day it was a table, and the last day at the counter. Regardless of the seating, each visit was met with the same great customer service. Fast, friendly, and efficient even when the place was jam packed!<br><br>Atmosphere: Large, bright, open, airy, and a great place to start your day! Located right on Michigan Avenue across the street from Grant Park made this the best option of grabbing a breakfast for visitors not wanting to eat in the hotel. <br><br>Value: Most of the breakfasts run between $10 and $13 which is a great value considering the portions and ingredients. We chose Yolk instead of dropping the $30 for a hotel buffet breakfast that was no where near the same quality.     <br><br>Overall: A great breakfast spot for visitors if you are staying near the area. One huge Yelp tip, check yelp about an hour before you plan to go and you can see how long the wait is for a party of your size. You can even add your party to the wait list to cut down on our time standing in line. Second Yelp tip..this is a 5% Yelp cash back restaurant so save a bit and register your cc on Yelp!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7Lh6j6QM4j-1DBpVcEqKRQ/168s.jpg", "caption": "El Torro Scrambler"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EUoWkzl2BXX7kDYS4bv75w/168s.jpg", "caption": "Waffle Combo with Eggs, Bacon, and Sausage"}]}}, {"review": {"des": "Friendly service like other locations; same menu. I've been to this location a few times and it's a bit more chill than its river north counterpart on Wells. And I must admit their pancakes tasted better and were served hot. I had the kale scramble on my most recent visit and it was surprisingly good. Solid breakfast spot.", "pics": null}}, {"review": {"des": "Hands down, one of my 5 favorite breakfast spots in the city.<br>What to expect: a modern diner-esque spot that is busy, full of families and couples, large parties and singles. Yolk is on NoWait app, so definitely add your party there in route to the restaurant to shave off at least 20-30 minutes off your in-person wait time on those busy weekends. We did this - added our name to the line via the app, we were walking there and about 2miles out. The wait was 45-60 minutes and upon our arrival, we checked in and waited only 10 remaining minutes to be seated. Love the app!!<br><br>My favorites: <br><br>1) California omelette and the Hey Ricky omelette - I happen to love blended avocado in omelettes now because I first had it here.<br>2) Beet/orange juice  soooooo good!<br><br>Service is always super friendly, too. <br><br>Excellent place.", "pics": null}}, {"review": {"des": "A South Loop staple, Yolk offers your basic brunch fare with a Midwest twist. Everything they serve has a decadent little spin to it. This is where you go to grab some amazing hangover brunch. It's your greasy-I-shouldn't-be-eating this type of food. We had the West Coast crepes, which were kind of strange. It was both overwhelmingly salty and sweet so not sure what kind of direction they were going with that one. Otherwise, my friend had Chilaquiles Verde which was apparently very good. <br><br>I'd recommend if you're in the area, Yolk offers very basic brunch options, but not too extraordinary. Overall, pretty decent brunch.", "pics": null}}, {"review": {"des": "Came after a 5k on Fathers Day, so it was pretty busy. Easy to check in. They use the texting system and that seemed to work out. <br><br>Menu is a standard upscale breakfast diner menu. They were busy and it was controlled chaos looking at the expo line. All plates came out clean with full presentation, so it was pretty obvious the kitchen team was a well-oiled machine. Our server Gina was adorable. She told us she was new, and we could tell. She was a little forgetful, but she came through in the end. I ordered the Greek Yogurt plate and that was supposed to come with a muffin, but never did. I was just going to bring it home, so I didn't remind her about it. No harm, no foul.<br><br>All in all, the food was solid and service was pleasant enough. Not sure I would visit this particular location (Michegan Ave right across from the park) again, but I'm glad we stopped by. The Yolk brand is definitely on point and would recommend to anyone.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KBGvFbK5D3zgswQ11Cql6A/348s.jpg", "caption": "Greek yogurt bowl with berries, honey and housemade granola 4/5 would order again. Came with pastry on menu; never made it to me."}]}}, {"review": {"des": "Be warned if you want a mimosa with your meal or any adult beverage, you won't find that here. But you find some good eats", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/K4fT22h-rwf0QG2dxphp4A/168s.jpg", "caption": "California Omelet with cheese grits"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7nTG5wewXvcvF9Sgh4uClg/168s.jpg", "caption": "Just random"}]}}, {"review": {"des": "The environment is clear. Dishes are delicate and delicious. Calories are not that high which is fairly healthy. I like the spicy sauce here. It is not that spicy but add to flavor. It is also available for customs to purchase.<br>The only disappointment is that I found a piece of eggshell in the Benedict's egg.<br>Think I'll come back and try more dishes:)", "pics": null}}, {"review": {"des": "Yolk South knows my weakness: banana, peanut butter and chocolate. Naturally, I had to get the Nutty Monkey Cakes! Perfectly satisfied my craving and filled me up quick. The serving sizes are big and the food is worth it. Definitely recommend Yolk South for breakfast.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oH7eqkddq1UFPGEsdZkQOg/348s.jpg", "caption": "Nutty Monkey Cake"}]}}, {"review": {"des": "I know this place is a chain but boy was it delicious. I've never had homemade Greek yogurt before and it was amazing. With the fabulous fresh berries and honey, I find myself craving it! I sat at the bar which was fun to to watch the kitchen.", "pics": null}}, {"review": {"des": "Took a red eye into chicago and decided to stop by this little breakfast jewel on Michigan Ave! Take the redline train to Roosevelt, only a short walk! The food was amazing, we order the California Omelet which is one of the staffs favorite and the corn beef hash. The flavor and quality was on point! No wait, seat yourself!! I will definitely be back before we leave this lovely city!", "pics": null}}, {"review": {"des": "This was my first meal after arriving in Chicago from NYC and it was a decent meal for two starving individuals. I wouldn't say it is an amazing place, but it was pretty good. I ordered an Eggs Benedict which came with two eggs cooked however style you want - I went with poached. The eggs were put on biscuits with a gravy sauce on top. They gave me the option of a side as either potatoes or cheesy grits. I chose potatoes but I wished I chose the latter instead.<br><br>Otherwise, staff were very friendly! The place is very casual and spacious. I came with a lacto-vegetarian friend so there were barely any options for him to eat. So if you are a vegetarian that excludes eggs from your diet, this is probably a place you should skip. He was able to eat a sandwich, but that was the only option available.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EJVqEr_O1pQiWwDtwGkYEQ/348s.jpg", "caption": "Eggs Benedict"}]}}, {"review": {"des": "We came in for breakfast around 1pm and let me tell you, this was some of the best breakfast food I've had in Chicago! There wasn't a wait and the place wasn't too crowded when we arrived. Our server was nice and knowledgeable about the menu. Food came out pretty quickly.<br><br>Food: <br>Chicken and waffles: I got the chicken and waffles with white gravy and hot sauce on the side. Chicken was crispy, well-cooked, and juicy. The waffle was large and fluffy, with pieces of BACON in it! Soooo good with the sweet syrup. I'm usually not a big fan of white sausage gravy, but it was so yummy with the hot sauce. Gravy was flavorful without being too heavy; perfect compliment to the dish. <br>Banana nut bread french toast: My friend got the banana bread french toast which was three slices of banana bread dipped and pan fried in the batter topped with slices of banana with a side of syrup and peanut butter. The french toast wasn't too bad, but I thought it was kind of eggy. Really good with the peanut butter. <br>Red velvet french toast: We got a side order of red glove french toast which was a single slice of red velvet \"toast?\" filled with cream cheese frosting and topped with strawberries. Yummm! The best french toast there! <br><br>This is a great place to go for breakfast. Will leave you so full! I'd love to come back any day!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/og-cYXRC7t52SE7GU-5_Og/348s.jpg", "caption": "Side of pancakes"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JN4dN5zuNH1P3mD8yflbcQ/168s.jpg", "caption": "Countryside Skillet"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4t7zl3nG2jtcVHvUmWaYWw/168s.jpg", "caption": "Banana Nut Bread French Toast"}]}}, {"review": {"des": "Delicious food! I ordered their season pancakes: Autumn Pancakes with cranberries inside, pecans on top, and whipped cream. My partner preserved the loaded baked potato which actually looks hash browns and is very good (especially with hot sauce)! <br>I also ordered pork sausage on the side. They are huge and you get 3 slices. Very good!", "pics": null}}, {"review": {"des": "Impressed with this spot for a chain. It wouldn't be my first choice in the city for brunch (I prefer trendier and local) but it was open early and walking distance from our hotel for breakfast before leaving the city. I was impressed by the quick service, friendly staff, and menu. Our food came out fast, hot, and good quality. I would definitely go back.", "pics": null}}, {"review": {"des": "This was my first experience at Yolk. I had heard it was great breakfast, and it did not disappoint. It's somewhat of a newer version of diner, with an open kitchen concept. We came in around 8:30 and there was no wait, but when we left around 9:30 there were many people waiting (probably bc the food is so tasty .) I did hear the hostess say that the wait was still under 30 minutes so they were really keeping a good flow. The menu has a wide variety of choices. So much different then your basic breakfast. We had the cinnamon roll French toast which was great. And a breakfast skillet to add a little savory to our sweet. Everything was great. Even when the kitchen was a little behind the waitress was great at keeping us updated. Altogether it was a great experience that I would recommend if you are looking for a casual breakfast in Chicago.", "pics": null}}, {"review": {"des": "Several things impressed us about this place. First of all, you could see on yelp the live time wait and then you could save yourself a place in line even before arriving at the restaurant. Once we arrived, it took less than 10 seconds for us to be greeted. We probably waited another two minutes before being given a table. It seemed like a really smooth, well run operation. The food was just fine. I love brisket and they had a good one. I like their homemade hot sauce. My wife had a crepe that she said was good. Breakfast with tip cost us $50, which we thought was on the high side, but welcome to Chicago.", "pics": null}}, {"review": {"des": "My friends and I were staying at Best Western for our trip, which was literally right around the corner. So it was a no-brainer to come here to enjoy breakfast. We got an early start at 8am. When we arrived, there was a small wait. We were looking at the menu and we got seated soon after. After our meal, there was a whole crowd of people by the door, so definitely come earlier. <br><br>When I was looking at the menu, my eyes went towards the sweet pancakes. I really wanted the red velvet, but I also wanted to try eggs, since the store is called yolk after all. So with the server's help, I got an order of eggs, which comes with a side of potatoes. And opted to upgrade to a special small serving of the red velvet pancake. I got the best of both worlds.<br><br>After eating, I'm glad that I got what I got. Because the red velvet was quite sweet and I definitely wouldn't have wanted to eat a whole serving of only red velvet. The egg & potatoes balanced everything out. In terms of the potatoes, I was excited to eat potatoes at first, but they were a bit of the soggy side... I mean not too much, but definitely not crunchy and good as I imagined it. But I was satisfied nonetheless. I was able to start out the day with a balanced meal.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mjngT0sE4hzTAVwWaXm-eQ/168s.jpg", "caption": "Single Red Velvet French Toast"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/e7us9ftK5joLTf_3bSwk6A/168s.jpg", "caption": "2 eggs w. side of potatoes"}]}}, {"review": {"des": "Last time I was at a Yolk location was when I was still livin' it up in Streeterville and Yolk was literally a stones throw away. This location in South Loop actually caught me by surprise in terms of food quality and service. Let's do this!<br><br>PROS<br>-Plenty of breakfast, brunch, & lunch options. Really enjoyed the chilaquiles I had ordered and was quite surprised with how good the croque madame was!<br>-Great service<br>-Use the No Wait app to get on the waitlist and see how long it will take to grab a table<br>-Regular black coffee is quite nice and unlimited refills. Our server even offered us a cup togo<br><br>CONS<br>-Busy on weekends. Use No Wait to limit how much waiting you'll do for a table<br>-I called in to ask about parking and they indicated they validate up to two hours in the structure next door, but structure was full. Street parking will run you $4/hr<br><br>If you're looking for a Wildberry alternative that isn't quite as slammed, look no further! Not much else I got on this one. <br><br>'Til next time, cheers!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kllBy8dcZuFIIDSwie_hIQ/348s.jpg", "caption": "Chilaquiles!"}]}}, {"review": {"des": "I didn't realize how big of an institution Yolk is in Chicago until my most recent trip. It seems it's become one of the most popular options for brunch, and certainly with good reason. With various locations throughout the city and a standard but trendy menu, it's sure to be a hit with anyone who likes a good brunch. <br><br>Speaking of the menu, I'll say you really can't go wrong with anything here, so come hungry. There's a good amount of selection and my biggest issue was that it was almost too much food for me (don't worry, I worked through the pain and managed to survive :) ). Definitely be a little adventurous and try some of the flavors/ combinations you won't be able to make at home, it's worth it! The service was great too, no complaints there at all.<br><br>Because of how popular this place is, there's a good chance you'll be waiting for a bit to get a table. They do have a decent sized waiting area, and you can use the Yelp App to put yourself in line, so definitely do that!<br><br>Ultimately, Yolk has become the benchmark that I compare brunch places to across the country. I'm noticing that more and more restaurants are starting to emulate a similar formula, but Yolk has cracked it. (Get it? I'll show myself out)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/irqC0IhHtkwXgkI6DSlOFQ/348s.jpg", "caption": "Red Velvet French Toast!"}]}}, {"review": {"des": "Since everyone in Chicago raves about this place, we had to try it.<br>Our experience and food was good.<br>I am not inclined to call it amazing but it is very good, at least what we ordered.<br>I had the corned beef hash with an upgrade o a biscuit with gravy. The hash is really good and the gravy on.the biscuit is delicious.<br>My wife had the Crepes with bananas and strawberries and those also really good.<br>The ambience is cool and for being so busy the service is pretty good.<br>Overall, it's a cool place with really good food.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kZ5FIhDTXGIsJOdI9tYyew/348s.jpg", "caption": "Crepes"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/v4tpTW705CuzsA-nwh_5vg/168s.jpg", "caption": "Biscuits n Gravy"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/drtWxd1nGvqIqeZwY6JbCA/168s.jpg", "caption": "Corned Beef Hash and Eggs"}]}}, {"review": {"des": "This is a Yelp secret that I didn't know that was so cool: you can add your name to the waitlist via Yelp!! Amazing!! So from our hotel room, we added ourselves to the waitlist just by clicking a button, and then once we got to the restaurant a one hour wait was just ten minutes.  So cool. THANK YOU YELP!<br><br>Lots of people waiting really, really long though.  One elderly Indian woman almost passed out, and her husband had to go get a chair for her (there are no chairs, no Wifi, no water - no fun).  Definitely have no idea why people are waiting this long for this place.  But they are.<br><br>We had a great experience though, because we got the best table in the house (the little booth facing the window at the front), and our server was amazing- she comped the coffee because it came to the table so late (unprovoked! Didn't complain to her or anything).  Very cool.  <br><br>I'm going between 3 and 4 stars, only because of Yelp that I didn't have to wait in line - but I wouldn't bother waiting.", "pics": null}}, {"review": {"des": "Delicious food!! I enjoy being able to come here for breakfast after a long shift! The cinnamon roll French toast was great!", "pics": null}}, {"review": {"des": "One word to sum up this restaurant is great!!! I received a tip to go to this restaurant and decided to try it instead of the normal Cafe at our hotel. I made sure to call in advance since I know that Sunday brunch is usually a busy spot and to my luck it was not busy at the moment so we were able to get a table. I love dining in Chicago because they let you substitute many things on the menu which is not a norm in New York City. The service was impeccable and the food came out even faster everything was tasty homemade and just delicious I had no issues with any of my food and the presentation was on point. If I can give this place 10 stars I definitely would've but unfortunately yelp only allows me to give five. I hope they open one of these places in New York City I'd be a recurring patron.", "pics": null}}, {"review": {"des": "$16: coffee, 2 eggs, 2 pcs French toast, 2 pcs bacon, 2 sausage links. <br><br>5-stars for exceeding expectations (great price for location). <br><br>Monday 8:48am -- no waiting. <br>Was instantly provided a bottle of water and a very good cup of coffee. <br><br>Ordered the Yolk All Star Combo<br><br>Food arrived in 10 mins. <br><br>Great all-around American breakfast. <br>Two full slices of French toast, eggs were cooked perfectly, bacon was large portion and not too fatty, and two large sausage links (not really very great, but good enough to eat one of the two.)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4e_Dn2l78KamNOrvc3pLVA/348s.jpg", "caption": "Yolk All - Star Combo"}]}}, {"review": {"des": "Holy breakfast!! If you're in Chicago, find a Yolk! There are a few scattered around the area and trust me, you'll be ecstatic. With breakfast being my favorite meal of the day, I'm always a bit picky with what I like and don't like. I LOVE this place.<br><br>First thing's first. Get the crepes. Seriously. They are to die for - bananas and strawberries with Nutella slathered all over. Of course, with whipped cream on top. I got the Yolk All-Star Combo and upgraded my crepes to Nutella crepes ($3 upcharge). It comes with sausage links (these things were huge!), bacon, eggs, and 2 pancakes/2 crepes/2 toast/half a waffle. It doesn't sound like a lot of food, oh, but it is.<br><br>The service wasn't too bad for a Saturday morning, not to mention it was St. Patrick's Day. Food came out pretty quickly and I had leftovers. I was stuffed for hours. Every time I come to Chicago, I'll be looking forward to my next visit to Yolk!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WskGr0htclN0ihwkzG97YQ/348s.jpg", "caption": "Yolk All-Star Combo with Nutella Crepes"}]}}, {"review": {"des": "I love breakfast and brunch! I could eat it every meal of the day. I was visiting Chicago for the first time so my friends decided to take me here for my first meal. I was super hungry after my long flight. <br><br>I ordered an Iron Man omelette and a red velvet French toast. The omelette did not taste good, it didn't even look appetizing. The red velvet French toast also wasn't special. My friends weren't impressed with their food either. I don't know if it was because we didn't order the right foods, but I felt let down.<br><br>It was a cute little spot, but I was quite disappointed.", "pics": null}}, {"review": {"des": "I think it is the staff that makes this such a nice haven in the morning. Overlooking Grant Park, the morning sun flows in through the front windows. The staff are just as bright and cheery as the sun! <br><br>I got a table looking out at the park. I thought I was in for normal breakfast fare, but then I spied the Burger section of the menu. I decided to make the bold move and combines the two, opting for the breakfast burger with a side of fries. <br><br>While I waited for the food, I pleasantly sipped on a cup of black coffee. It never got to half full before it was quickly refilled. Thank you for that Victoria!<br><br>When the burger arrived, it looked great. My first bite tore into the perfectly cooked yolk of the egg. What a great day. My only disappointment was I ordered the burger medium rare and it was cooked closer to a well done, so it was a little drier than I like. All told the meal was a great experience.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VjAAmpGNa1QrwiN5PMhLqg/348s.jpg", "caption": "The breakfast burger!"}]}}, {"review": {"des": "Stayed at the Hilton in the South Loop and the hotel staff recommended that we try Yolk out for breakfast. It was in walking distance so we did. I got the Frittata and friends got Oatmeal and eggs with seasoned potatoes. We were all very satisfied...especially my buddy and I who got the Frittatas. Also, try out their habanero sauce. It's very tasty and not too hot. The cost is a little on the high side for breakfast but it's not enough of an issue to drop them down to 4 stars.", "pics": null}}, {"review": {"des": "My husband and I had breakfast here last weekend while in town for Pokémon Go Fest. The wait was long (about 30min) but did go by quickly. We sat at the bar and really enjoyed watching the hustle and bustle of the staff in the kitchen. The food was pretty good but not extraordinary.  This seems like a good, reliable joint for breakfast but nothing to write home about. I do recommend the chicken and waffles, which my husband ordered, but without the gravy. The gravy didn't have much flavor at all.", "pics": null}}, {"review": {"des": "Have been to Yolk 3 times and have yet to be completely happy. I each time something was lacking! Once was food, once service and once the amount of time it took. Over all not a bad spot but nothing to write home about!", "pics": null}}, {"review": {"des": "The best part about this Yolk is honestly the staff. They're dressed so cute, and are so friendly. They're also really helpful with everything which is a big plus. Make sure you come early if you're coming on a weekend for brunch, the lines get insanely long. The menu is really large, but well organized, and I don't think I've ever had anything that I didn't like at all at yolk. I would recommend the scramblers and the red velvet french toast, so delicious! The 5 egg omelettes are HUGE which is always exciting, I've never finished one by myself. The sandwiches are also quite good. <br><br>Their soups and salads are honestly very average, so I wouldn't get those. Overall though, this is a really cute place similar to the Bongo Room.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8j3ri_KRQlADA852DobA6g/348s.jpg", "caption": "Pancakes!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CSu1i7kdd7PQQyVxY3Bn9w/168s.jpg", "caption": "El torero scrambler"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mEA1mxkrk8MygGaWYSnRVg/168s.jpg", "caption": "The works omelette"}]}}, {"review": {"des": "We were seated quickly for table of 5, which I thought was impressive. However it was 8:30 am. Food is always amazing. Lots of variety and plenty to choose from. Service was quick and great. I had the south beach which was a very healthy option. The rest of my table feasted in the velvet and banana waffles/pancakes. My wife let me try the suasage  links and they were amazing. Will definitely be back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VAzPhdh6aiNYIuCseaDoFg/348s.jpg", "caption": "Southbeach"}]}}, {"review": {"des": "Great atmosphere. Great service.  Great food. Menu of both sweet and salty items. Everything that came out of the kitchen looked incredible. Hey Ricky was spicy yet tasty.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GL0CJrB5Yx2_1JDkURpq_Q/168s.jpg", "caption": "Hey Ricky Omelet"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SXD8G3joLpixPJ0iIJNggA/168s.jpg", "caption": "Crepes. Sweet and savory"}]}}, {"review": {"des": "The place was busy when we got in around 8:00am. The staff was very friendly and delivered quick service. The food tasted great. I would come back again when in town.", "pics": null}}, {"review": {"des": "If you are staying at the best western hotel down at grant park, you shouldn't bother yourself with hotel restaurant (a Chinese restaurant). Just go around the corner for this Yolk Restaurant. I'm impressed by the quantity AND quality of the food! <br><br>We walked in and ordered per the waitress's recommendations (thank you to yolk's employees for being extremely friendly and patience when we couldn't make up our minds) <br><br>Hey Ricky! Omelet - 4.5 stars<br>It's amazing how this omelet was so fluffy and yet it still held everything together. The jalapeño, the pepper jack and the melted cheddar cheese were the perfect combo of flavor...yum! On top of that, they allowed me to upgrade the side pancake to the pancake of the month (+$3) and it was the best decision i have made for the day. This month was the lemon blueberries (see picture) Their pancakes were more fluffy than cakey with fresh blueberries sweetness (rather than a sugary taste). My ideal pancakes need to be even more fluffy so I'm giving this a 4.5 instead of a 5 Star. Also, i don't recommend ruining them with syrup. <br><br>Yolk Berries Bliss - 5 stars <br>The best part was the complementary blueberry muffin that i got with the yogurt. The texture and the taste were perfect! I would say it fits into the ideal muffin texture and the taste, similar to their pancakes, has a natural sweetness from the blueberries. As for the yogurt, i loved the balance between the yogurt, berries and granola. It tasted extremely fresh and nothing was too overpowering.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0hm2jGZa8jYT69VnT06mKw/348s.jpg", "caption": "Hey Ricky Omelet with Pancake of the Month (lemon blueberry ... cost +$3), Yolk Berry Bliss with Muffins (blueberry crumbles) - July 2018"}]}}, {"review": {"des": "Nice breakfast spot. Super close to our hotel which doesn't serve breakfast, so this was a good option. I got the strawberry oj, coffee, and the chilaquiles verde with two eggs over-easy. Everything was tasty. I took away a star because of the service. I couldn't get a refill on my coffee to save my life. It was busy, but still... my daughter liked her pancakes but they threw them out when we got up so she could use the restroom. The one time they stop by our table... go figure. They did replace her order and gave me a cup of coffee to go. Also took the coffee off my tab, but it wasn't worth the frustration. I won't be rushing back.", "pics": null}}, {"review": {"des": "My pot roast benedict had potential, but it was unfortunately quite dry!  Both my pot roast and english muffin were a bit tough, and I wish that there was more hollandaise sauce.  The amount of hollandaise sauce that I had didn't go a long way, so I couldn't resolve my dry meat/bread by getting them sopping with sauce.  Moreover, the crux of any eggs benedict was a bust with my dish -- my poached eggs were overcooked, and I didn't get that nice runny egg yolk!<br><br>I subbed my potatoes for cheesy grits, which were plain on their own but perfection with their house hot sauce.  Otherwise, Yolk has courteous and well-organized staff!  No complaints about their service.<br><br>I personally had a subpar experience with their pot roast benedict, but between their delicious grits, their thoughtful customer service, and their busy brunch crowds, I'm hopeful that I experienced a rare miss.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fYHj8m7wDcP-lHzSaAx8Yg/348s.jpg", "caption": "Pot Roast Benedict (subbed for cheesy grits on the side!)"}]}}, {"review": {"des": "Delicious eggy goodness! The Hollandaise sauce on the eggs benedict wasn't particularly distinct, but the dish was still very yummy. <br>If you love red velvet, definitely try the red velvet French toast - there's even cream cheese frosting layered inside! Use the yelp waitlist function ahead of time to cut down on the wait!<br>The restaurant has a nice atmosphere and large seating area.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xyzUqdw72wFkH4RJwoJbVg/348s.jpg", "caption": "Cream cheese frosting layered inside the red velvet French toast"}]}}, {"review": {"des": "Stopped here for breakfast and had the country skillet.  The potato pepper mix was good, a little salty.  The eggs were tasty, cooked the way I ordered.  They give a sausage gravy with this too which was on the side, cold, and really thick.  I wouldn't recommend ordering something with sausage gravy here.  My husband has the banana bread French roast which he enjoyed.  The coffee was the most bitter thing I have had but I wouldn't suspect this is something that happens all the time. Overall it was a good quick breakfast, definitely tasty, and a good value, just not mind blowing.", "pics": null}}, {"review": {"des": "My family stopped here about a month ago for Saturday brunch.  It was quite busy so we were a bit hesitant.  Don't be... They have this breakfast thing down. Food and service were spot on.  <br> Our server Adam was amazing! Didn't miss a beat and had a great sense of humor even as busy as they were..<br> strawberry orange juice, upgrade the sides...and get the grits!", "pics": null}}, {"review": {"des": "Came here on a rainy Saturday morning and got seated immediately. I wouldn't say this was the most amazing brunch I've ever had but it was definitely pretty good!<br><br>F O O D -<br>+ Countryside Skillet | Thought this was really tasty! Wasn't overly heavy to start off the morning. Bed of seasoned potatoes mixed with a variety of meats, veggies and cheddar cheese. Topped off with two eggs, a side of country sausage gravy, and served with either toast, pancakes, or an english muffin. Also, added some of their house hot sauce and it was perfect!<br><br>+ Croque Madame | My boyfriend enjoyed this one! Imagine a savory french toast with ham, turkey, swiss, and dijon sauce. Also topped with an egg with a side of potatoes or cheesy grits. He felt the grits were a tad under-seasoned but they were fine to me ¯\\_(ツ)_/¯<br><br>D R I N K  -<br>+ STRAWBERRY. ORANGE. JUICE. | Why was this my first time hearing of such a thing? Such a nice spin on an original classic. The cup it comes in is pretty small but it's definitely worth the try :')<br><br>S E R V I C E -<br>+ The waitstaff was so upbeat and nice! All smiles from beginning to end.<br>+ Good portions and food came out pretty fast<br><br>Overall, great all-around American breakfast. Would recommend to anyone visiting Chicago for the first time!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EOBbed5-HS6m6mJopOeAlg/348s.jpg", "caption": "Countryside Skillet - YUM!"}]}}, {"review": {"des": "Love that you can put your name on the waiting list via Yelp - that way you don't need to wait at the restaurant.<br><br>I ordered the South of the Border benny because I'm a chorizo fan and it was great! Not amazing but definitely a great breakfast/brunch spot! I wish the potatoes were a big crispier but just my preference.<br><br>They unfortunately don't have my favorite hot sauce Cholula, but Yolk has their own hot sauce and it is actually pretty good! Spicy.<br><br>Will be back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/h8tzUwf30AAW97FBgfxWaQ/348s.jpg", "caption": "south of the border benny"}]}}, {"review": {"des": "I had the corn beef hash. I love a good homemade corn beef hash! My sister does not, but she tried it and thought it was pretty good. <br><br>Best thing was we used yelp to get ourselves on the waitlist, which was about 30 to 40 minutes. We put ourselves on the yelp waitlist walked in and get seated within five minutes. That was fabulous!", "pics": null}}, {"review": {"des": "Was craving breakfast/brunch food so we made our way to Yolk! Came on Father's Day so naturally, it was PACKED. They use an app called NoWait which was really handy because we didn't have to wait around to be seated. <br><br>We ordered the Santa Fe Frittata with an upgrade to the Cinnamon Roll French Toast for an additional $5, the Farm House, and a single piece of the Red Velvet French Toast. This place is pretty much a solid two dollar sign ($$) restaurant but at least they give huge portions. We got so much food, the table next to us asked how we were going to finish it all. The Cinnamon Roll French Toast upgrade was a freaking steal! It was such a large plate, we were convinced the waiter gave us the actual entree instead of the upgrade. It wasn't until the check actually came that we realized we got all that food for $5! <br><br>The Santa Fe Frittata was mediocre. It was a little bland for my liking. I also wasn't a huge fan of how the avocado was blended into the dish itself. My boyfriend really enjoyed his Farm House - the biscuits were really good! Both french toast dishes were amazing!! All in all, a pretty solid breakfast/brunch place!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8gyYcIUZunCDjpvD7GdrQg/348s.jpg", "caption": "Red Velvet French Toast"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PiKr7_LjaUGGD5ZtmL6AmQ/168s.jpg", "caption": "Cinnamon Roll French Toast"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JVvvKHjIp9SC-B2cq8pBZw/168s.jpg", "caption": "Santa Fe Frittata"}]}}, {"review": {"des": "My favorite place to eat! They say about 40 min for a wait but I never wait that long! AMAZING breakfast. The cinnamon roll French toast is amazing and the very berry French toast! Have to get the strawberry orange juice!! LOVE LOVE LOVE.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nOtdYaA7iyTFNuAFJ5JqRg/348s.jpg", "caption": "Very berry French toast"}]}}, {"review": {"des": "Oh my word, heaven on earth is here at Yolk. I could not believe how innovative the menu is. The staff is outgoing and personable with service on the stellar side. The design is so thoughtful, there is a section of the restaurant where the patron can wait and they are out of the elements, not in the way of the door and does not interfere with the serving staff.<br><br>Now let's chat about the menu. It is phenomenal and I rarely use that word. They have a pancake flavor of the month. This month is Carrot Cake. It was divine. I have picture and will admire it longingly and think back how wonderful it was. It was fluffy, tasty and enough sweet to make breakfast great.<br><br>The only disappointment is they don't have one in DC.", "pics": null}}, {"review": {"des": "The food is awesome, and they have their own hot sauce! I ordered the corned beef with eggs, and it tasted amazing. I also upgraded to the red velvet toast, which I strongly suggest you get. Their strawberry orange juice is also freshly squeezed, which goes very, very well with everything. <br><br>The only thing is the portion. It's a bit small, I must say. The juice is good, but 3 dollars for a 6 oz juice is a bit expensive for me. Overall, still a very good experience.", "pics": null}}, {"review": {"des": "Sunday brunch- music was too loud and was for the house dance club party people. It made reasonable conversation difficult even though our table of 7 was at a table 2 sizes too small.<br><br>Overall the food was good (Chiliques + potatoes). I wish they had Tabasco instead of house hot sauce.", "pics": null}}, {"review": {"des": "Great breakfast. My wife and I both had the build your own Skillets. Coffee and Latte were good too.", "pics": null}}, {"review": {"des": "I would say this is a solid 3.5 stars. It's a pretty good place for Brunch but I do prefer Bongo Room. We got the Chicken & Waffles and the Red Velvet French Toast which were $12.5 each. A little on the pricey side but not terrible for Chicago.<br><br>The Red Velvet French Toast was the standout by far. I can see why they are famous for it and why everyone gets it. It was more like a red velvet swirled cake with icing in between every layer. It was very good and sweet enough that it didn't need any syrup. It was expensive though as you only get three pieces. <br><br>The Chicken and Waffles was just ok. It really could have been so much better with some changes. The chicken was dry and thin. A juicier piece would have been great. The waffle was a bacon waffle which sounded great but was just dry and had very little flavor. A lot of food for the price though.<br><br>Overall - this wasn't a bad place but there are so many options for Breakfast/Brunch in Chicago that I probably won't be coming back for some time.", "pics": null}}, {"review": {"des": "I feel like in terms of brunch this places does pretty well, but I'd still say Bongo Room is my favorite. The wait on a Sunday morning was not too bad as long as you follow the waitlist from the Yelp app. <br><br>Food wise I got the yolk all star combo with the cinnamon roll French toast upgrade. The sausage was a little too greesy for me and the bacon was more on the dry side. The cinnamon roll was the best part of the meal. They didn't put too much frosting which tasted amazing, but the consistency in the flavor was amazing. <br><br>Ice coffee was not good. I added in the seasonal pumpkin flavor and it tasted horrible (generally I love everything pumpkin). Honestly the coffee did not even taste like ice coffee.<br><br>Overall I'd say this place was average at most, but it did get the brunch craving out of my system.", "pics": null}}, {"review": {"des": "Yolk had seriously let me down a couple of times but I was meeting a friend for brunch and needed to be close to public transportation, so I came back.  It wasn't bad.<br><br>From reading some recent reviews, I knew to use the no wait app to put myself of the wait list before getting to the restaurant.  At 10:30am, I was able to walk in and get seated within 5 minutes, which put me in a good mood.<br><br>I had a glass of strawberry OJ, a skillet with turkey sausage, spinach and mushrooms, and a side of pancakes. The pancakes were not as fluffy (or as good) as they have been in the past but everything else was solid.  My friend had a California omelet with a side a bacon and seemed to enjoy it.<br><br>I can't say I'm in a hurry to return, but I wouldn't mind.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sGmPvh5aRw6-wg_sk8jDrA/168s.jpg", "caption": "Turkey sausage with spinach and mushrooms, strawberry orange juice, pancakes"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pa53Usxofs70ymOer1d4vQ/168s.jpg", "caption": "California omelette with fruit and a side of bacon"}]}}, {"review": {"des": "This place is wonderfully consistent, at least for the two times I visited. I rally like the vibe and atmosphere of this place. Even though there's a lot of husky and bustle, this place seems calm and collected. Employees seem happy and very nice. It's in a great location on Michigan Ave, very close to Chicago Hilton where I stayed. <br><br>Decor-diner interior with hints of county throughout restaurant. Simple and tables and booths filled their dining area. <br><br>Service-very good. Waiters and waitresses seem very nice and hip. They served on our very well and made sure our coffee was always full. <br><br>Food-I don't usually eat out for breakfast because I'm very picky when it comes to eggs. This placed surprised me. I ordered \"chilaquiles con huevo\" and loved them. Just the right amount of spice and cheese. The eggs were cooked medium just the like them. Coffee is freshly brewed and pancakes large and sweet. <br><br>Tip-cute girls work there, maybe ask one out on a date. Lol", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/00XlB8sr-aCVS2z0sfWCvw/348s.jpg", "caption": "Chilaquiles Verde-pretty spectacular. I'd order again in a heart beat."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WCuybcCMa2VnoOJC4QhsmQ/168s.jpg", "caption": "Cinnamon Roll French Toast-very sweet and filling."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/a75vvVRTa_wsv1IZeYdYmQ/168s.jpg", "caption": "Multigrain Cakes-a bit too sweet, but still good."}]}}, {"review": {"des": "Amazing restaurant. Great for Kids. I should know because I am a kid typing the review. I am ten years old and I had the crepes. The crepes are amazing. I had everything on my crepe except for raisins , pecans and walnuts. My brother had the Oreo Pancakes. Even the juice was amazing that I had two helpings of the strawberry orange juice. My mom has the savory egg and cheese crepes and loved the grapefruit juice. I would rate this as best breakfast in the world. If I could I could give it a million out of five stars .", "pics": null}}, {"review": {"des": "Was looking for brunch right after a flight and was reading off a few places and once I said yolk 2 strangers said I had to go there. They did not steer me wrong with a great environment and service was perfect to have good tasty good and fast. We got the California omelet, build your own plate and a blueberry banana pancake. Loved how they have the option to get a sweet added as a full meal is always too much. But each dish was cooked perfectly and provided more then enough to leave full.", "pics": null}}, {"review": {"des": "BEST BRUNCH EVER! I literally loved my entire meal here! I love that you can order singles for the French toast! I hate wasting half my meal at other brunch places so that was definitely a plus!<br><br>The coffee could have used some work to it but the caramel macchiato cream def helped flavor it up.<br><br>I ordered the red velvet French toast and it was seriously the best French toast I've ever had! It had a kick to it and was stuffed with a creamy sweet filling! The French toast wasn't too sweet and not too bland! It was just right! <br><br>I ordered a side of French fries to even out the sweetness from the French toast and I can honestly say that i probably didn't even need to!! But the fries were crispy and delicious also! <br><br>I wish they had a place like this in Philly because I'd definitely be back for the red velvet French toast!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jlOnuneaQCvwtFtD4hEE9w/348s.jpg", "caption": "Menu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FQnrqA_8QKYhgcjNod9Q5A/168s.jpg", "caption": "Fries"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/o2Eh1MchKC5cUHPZzLUQfw/168s.jpg", "caption": "Red Red Velvet French Toast"}]}}, {"review": {"des": "Yolk is a very nice breakfast place with a great menu in Chicago! I always get the all star breakfast with the red velvet French toast. Always great, only complaint is I hate the sausage. Don't get the sausage when you go.", "pics": null}}, {"review": {"des": "I've been to yolk before the river north location. Which is 10 times better than this location. I ordered strawberry French toast which was good because who can really mess up French toast. I also ordered a side of turkey sausage which was not cooked all the way and had no real flavor. I also ordered seasoned potatoes which were anything but seasoned. They tasted burnt and has no seasoning whatsoever. Overall I was very disappointed in the preparation of the food. The service was spectacular though. I wouldn't recommend this location to anyone.", "pics": null}}, {"review": {"des": "Yolk is pretty good and a fun atmosphere for weekend brunch! The food filled me up but I wouldn't say it was amazing! If you get the cheesy breakfast sandwich, maybe order extra pesto sauce? It tasted like an average bagel with egg and a hint of pesto. So I'm thinking that smothering it in sauce would help add some good flavor.", "pics": null}}, {"review": {"des": "It would've gotten five but their coffee is \"meh\" at best. The rest of breakfast was superb though! So much food you definitely could split with someone, especially if you get a scrambler. I got the create your own with spinach and goat cheese. The potatoes are delish while my sister got the cheese grits. From the south, we were warned they went up to the Southern standard. Shockingly they were amazing. And the side of pancakes?! That's a meal itself. So very good! We left very full and happy for a long walk around the city. Loved the waitress we had who was most helpful with the menu and we had a seat in the window facing the sidewalk. Truly enjoyed our experience!", "pics": null}}, {"review": {"des": "Omg i should have posted a pic of the amazing pot roast sandwich but it was so good. Came with fries and some a slice of a pickle.  I ordered a strawberry orange juice which was good. <br>Only thing, their house salsa is a bit vinegary.", "pics": null}}, {"review": {"des": "Nice place, nice food at a nice price<br>Been there twice and enjoyed my brunch both times", "pics": null}}, {"review": {"des": "Stopped here for breakfast before heading to the Shedd Aquarium across the street.  You can't miss the bright yellow awning outside and while I had my reservations about Yolk since it is a chain I was impressed on all fronts.<br><br>The interior was spacious and disco music was playing.  We're talking Friday morning at like 7am.  It was a bit intense before I've had a cup of coffee.  Our server was friendly and attentive.  The food portions were huge and not overpriced.  I ordered the pot roast eggs benedict (I always enjoy a creative take on the classic) and my friend and I shared an order of potato pancakes.  We had a difficult time clearing our plates even though the food was delicious.<br><br>Yolk wouldn't necessarily be my first choice for breakfast but it's good to know at least this location is always an option for a hearty and affordable meal.  And this location is also conveniently right off the bus line.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EbpUJFMYybQxTCR1KwQpCw/348s.jpg", "caption": "Pot Roast Eggs Benedict and potato pancakes"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/O4wlPKnmqemUe0q-PKhmVA/168s.jpg", "caption": "Interior"}]}}, {"review": {"des": "DEFINITELY TRY THEIR STRAWBERRY ORANGE JUICE!!! <br>But their food portions are great and loaded with flavors. We all dipped our food in their homemade special hot sauce. It's not just any ordinary hot sauce, it's filled with herbs and spices for a mouthful of flavor so U HAVE TO TRY IT!!! <br><br>I got their smoked salmon scramble, but also tried my friends chorizo based Benedict. The salmon scramble was very healthy and tasted delicious, fluffy and not too bold in flavor. The chorizo Benedict is the opposite, with much much flavors but it was grounded chorizo so don't expect cut bite sized pieces chorizo like usual. But definitely recommend going and using yelp to check-in for early tables :)", "pics": null}}, {"review": {"des": "Food was great there. Order the all star and it was a lot of food. The sausage is very tasty and the crepes was very yummy. Pancake is very fluffy and not greasy like some places. Great customer service and so many food options. Really enjoy eating here, will come back when we visit the city again.", "pics": null}}, {"review": {"des": "I went there for lunch with work friends. My friends had salads, and I had their patti melt. My friends said that their salads were good. My patti melt was ok. The bread bottom was too soggy even when they just brought it. The top part, on the other hand, was  somewhat burnt especially its ends.  I could not eat the ends. The patti itself (I asked for medium rare) was very good.   I also had their freshly squeezed juice which was very good as well. Overall, the bread brought it down to a 3, otherwise it would be a 4.", "pics": null}}, {"review": {"des": "Go here. Perfection! And coffee is delicious. Our server Parker even shared the brand. Fast service & great value.", "pics": null}}, {"review": {"des": "We originally was gonna go to wildberry, but things didn't work out. We were suggested by a friend to download nowait app to help with the wait time. We didn't realize that wildberry didn't allow us to use their app for 5 people. We were sad. We saw that yolk was nother breakfast place and we used the app here. They offered more people to wait in line than wildberry.<br><br>So we ended up here. We took about 15 minutes to get there. I used my app to wait in line. Even before our lyft came, it said our table was already ready. That was awesome, so we got into the ressturant instantly and got seated.<br><br>The staff here was very friend. They all looked like they enjoy their work. The waiters were fairly attentive. They were quick to refill our water jug when they noticed it was empty.<br><br>I ordered the eggs Benedict and I did enjoy it. It comes with roasted potatoes which I wasn't sure at first that I would like it. I ended up like my entire meal. The eggs Benedict was delicious and the potatoes were crunchy on the outside but soft in the inside! I was a little sad they didn't have an egg Benedict with crab cakes but I was naive to think all places would have it.<br><br>I wouldn't mind coming here again even if it wasn't originally planned.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fdoo1CvF4N3cN-LTkanQPw/168s.jpg", "caption": "Second part of menu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fzZXdzNgPQ3_W4UnIzVibQ/168s.jpg", "caption": "Breakfast menu"}]}}, {"review": {"des": "We went there for brunch and enjoyed the meal. The service was awesome. Enjoyed the meal. Enjoyed our visit.<br><br>Second visit and it's amazing.. GOOOOO!!", "pics": null}}, {"review": {"des": "I came to Chicago to visit family and this place was my favorite the entire trip. <br>Parking: none; we were within walking distance<br>Location: nice location, close to millennium park, the museum, etc. <br>Wait time: we went on a Sunday morning and there was no wait<br>Interior: clean, not too cramped; had tables, booths, and bar space<br>Staff: My waiter was accommodating and attentive. He seemed very genuine and just plain sweet. <br>Menu: both breakfast and lunch options<br>Food: I got the All Star Combo. Two eggs, two sausage links, two strips of bacon, and I opted for cinnamon roll French toast. Everything was cooked to perfection! And flavorful! The French toast met the highest my expectations could go. <br><br>Would recommend to everyone and I will be back!", "pics": null}}, {"review": {"des": "Fatty fatty fat fat fat. And I don't care.<br><br>Benedict was great- perfectly cooked. Friends had chicken & waffles and the farmhouse (biscuits and gravy) and we are ALL very happy.<br><br>The place was packed at 11:30 on a Friday morning so there was a wait, but it was quick and painless. Our server (Victoria) was attentive, efficient and adorable (really, she was). <br><br>Any complaints? Meh. Grits could have used more salt and it's kinda noisy to try and hold a convo, but they give you a salt shaker and really, who's talking when your mouth is full of goodness??", "pics": null}}, {"review": {"des": "This is a solid place to get a diner style brunch with bottomless diner-style coffee. The dishes are well-conceived, and the portions are just right for someone with a hearty appetite (not totally over the top). The food suffers from just one shortcoming which is common to almost every restaurant in Chicago: the blandness that's a consequence of sourcing ingredients from distant (sometimes Californian) farms. But I like this place enough to come here several times a year. As with many of the good brunch places in Chicago, it gets loud, so not a great spot for intimate conversation.", "pics": null}}, {"review": {"des": "Really good breakfast! We had to wait for a good 45 minutes but it was totally worth it. My husband got the crepes, bacon, sausage and 2 eggs and I ended up getting 2 eggs, bacon and fresh fruit because they were the only gluten free options. Totally tasty but I was slightly disappointed that they didn't have more options for me. My husband absolutely was thrilled with his breakfast though so if you don't have to deal with pesky dietary restrictions than you should definitely make a trip here.", "pics": null}}, {"review": {"des": "Such an amazing breakfast find.  Our sever Lana was extremely friendly and helpful  in answering our questions.   We ordered fresh squeezed strawberry orange juice which was so good! I had countryside skillet with a pancake.  The skillet which was more stuff than eggs is my kind of skillet and the pancake ss swrrt and fluffy.  My wife had the pot roast Benedict and a cinnamon roll. There was so much meat, but the hollandaise was thin and needed s little more lemon.  The roll was on point with sweetness and cinnamon.  If we lived here, we would become regulars.  The food was quite tasty, it was a little loud in the restaurant as it was packed, but the bright colors and the amazing food should draw you in.  Do yourself a favor and have breakfast here!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9MlY3UFfnzVGtgNPyvOSDQ/168s.jpg", "caption": "Strawberry orange juice"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/r2l4OyQWjMRjy5qlY0Mf9A/168s.jpg", "caption": "Fresh made cinnamon roll with buttery frosty"}]}}, {"review": {"des": "I go to Yolk since it is close to work. It's a solid joint. Their sandwiches are really good. The scrambles are good too. Unfortunately, the last time I went I ordered the wrong thing, the Croque Madame. I wasn't a fan just because the bread was slightly sweet which I wasn't expecting. I wanted a more savory dish minus the sweet. Service is always goodthough. Pricey but Loop prices are inflated so it's norm for the area.<br> <br>#RefereEats<br>\"I call it like I eat it.\"", "pics": null}}, {"review": {"des": "Delicious breakfast and great service. I had the caprese benedict and added smoked salmon. Fantastic!", "pics": null}}, {"review": {"des": "I was really had high hopes for this place, but boy was I in for a shock when I received my food. First, let me say that my server was a sweetheart. She checked on us repeatedly and was very polite. It was the food that was awful. I ordered the iron man omelet and cheesy grits. The omelet consisted of egg whites ,onions, mushrooms, peppers ,and tomatoes. I added cheddar cheese on the top. Of all the times I ordered egg whites , this is the first time they weren't white or white-yellowish. The omelet broke apart as soon as my fork touched the plate. It also had a brownish-yellowish color, like it was cooked on a dirty pan. The cheesy grits tasted watered down. If I had all the salt and pepper in the world, it still would not be able to save this meal. My companion ordered chicken and waffles and said it wasn't bad,but not the best she's ever had. All that said, I have concluded that this is the type of restaurant you keep you food simple. Scrambled eggs.Potatoes.Orange juice.The one star is for the server , the food would get zero.", "pics": null}}, {"review": {"des": "Can I say sooo yolking good!!! This place was highly recommended and I saw why. Across from millennium park...great for breakfast and brunch, quality service and quality food. Strode in and seated 10 mins later, server recommended the strawberry orange juice, sooo refreshing we ordered another round. The menu had great options for those who wanted to pig out to those who wanted to go the healthy route. The server was attentive and very friendly...cost was average and location perfect...if your in the loop check it out!", "pics": null}}, {"review": {"des": "We liked our waitress. Normal breakfast - nothing too fancy but good. We liked the red velvet pancakes. Didn't know it was a chain. They also do \"to go\" coffee when you leave", "pics": null}}, {"review": {"des": "My coworkers have gotten into the habit of checking Yelp before they recommend any place to me because they KNOW I'll eventually write a review on it. The pressure is on them to impress ~*~The*Elite~*~<br><br>Not really. I'll eat just about anything of any quality. Just feed me and promise me I won't get food poisoning or a tapeworm.<br><br>One of them found this joint and showed me a picture of the bagel and lox. I haven't had smoked salmon in a minute, so I was hooked.<br><br>Our little 10-minute walk from the Hilton Chicago (with plenty of sights to see) in the heat worked up an appetite and I was ready! . . . To wait in line for 40 minutes. They do offer drinks from their cafe while you wait, but I'm not trying to fill my belly with iced lattes while I'm waiting for the main meal. The app they use to notify you when your table is ready is cool. Yelp also kept track our place in line. Pretty neat, if I do say so myself. <br><br>40 minutes was accurate. Got a text and walked right back in. This is where my review of Yolk gets a little eh. You can tell the front was overwhelmed and not handling it well. Once you receive a text, you get back in a different line to be seated. One gentleman seated the couple two places ahead of us and disappeared. Someone came back around five minutes later and sat my party even though we weren't at the front of the line. Need a better way to get people to their table. Don't tell me my table is ready just for me to wait some more. My tummy did not appreciate that.<br><br>Anyway, had a cold glass of tomato juice with a slice of lemon to start myself off. If you're a heavy juice drinker, just get the 32 oz. carafe from the get-go. No point in those tiny glasses.<br><br>Now, despite the front having issues, waiting and the kitchen where on their game! Our, Isamar, server was very sweet and attentive despite how crammed packed and hectic it was in there. Loved her.<br><br>Out of the three of us, two plates of lox and a regular breakfast plate were ordered. Our lox were so buttery. Just the highest quality I've had in a long time. When I got tired of the toppings, I just ate the lox by themselves. The cream cheese was hard to spread, but the tomato, onions, capers, and bagel were great. My coworker who also ordered the lox opted for a hard boiled egg to top on his bagel. I got three sausage links and two over easy eggs since I'm fat and don't know when to stop. For the All Star plate, he wolfed down some French toast, bacon, sausage links, and two over easy eggs. He was really digging the syrup, too.<br><br>I always worry about getting sausage patties or links when I eat at a diner-type place because they're either too greasy or just inedible. Not the case here. They were perfect! The first things I ate. The sausage link had a nice texture and the skin had a little bit of snap. Just A+ sausage links and my coworker agreed with me.<br><br>We left satisfied. Didn't feel rushed even with hoards of people taking over the entrance of the restaurant. Don't worry, though. If I'm even back in too, that's my breakfast joint. Trust me.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IVJNa8S3KDRyH7SW9FXiGg/168s.jpg", "caption": "Some tomato juice to tie it all in."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FELalfsPutW6MtpiOfkm8Q/168s.jpg", "caption": "The Yolk All Star."}]}}, {"review": {"des": "This place was exactly what I imagined! For Mother's Day brunch, I decided to treat my mother, aunts, and grandmother to a delicious breakfast and what better way than to come to Yolk! Being born in Chicago, but getting raised in Miami, I'm not too familiar with the city but a friend of mine recommended it to me, and from all the pictures I've seen I knew I had to come check it out for myself. My group was a party of 7, so the tables were a little small so it felt quite uncomfortable so I asked the waitress if we can combine a booth with a table and they said no due to safety precautions so they ended up combining two tables together instead. I felt that they didn't give up on trying to accommodate our needs which made the experience even better. So about the food.... it was delicious and then some!! I ordered a Hey Ricky! Omelette with everything on it which comes with potatoes or grits and a side of toast. Literally to die for!! It was so good, every bite was mouthwatering to say the least. Amongst my family members, some ordered Eggs Benedict, a burger with an egg inside, a kale salad, and a chicken wrap that comes with French fries. Now, I knew I couldn't leave without trying one of their French toast! I'm a huge fan of banana bread so I decided to get the banana bread French toast which was obviously amazing!!! I took every bite with a slice of banana and a half scoop of peanut butter with maple syrup, yum! I'd recommend this place to anybody looking for a great place to brunch on any day of the week, whether you're a local or a tourist, this is the spot!! And there are many other locations around the city as well which is convenient.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1t688OCZOOrNpm2nrfViag/168s.jpg", "caption": "Kale salad"}]}}, {"review": {"des": "I NEVER order french toast. Because I don't even like french toast. I love cinnamon rolls. But I NEVER buy cinnamon rolls. Because calories exist as much as I don't want them to. So when I see cinnamon roll french toast on the menu, the only logical thing to do is to order it, right? RIGHT.<br><br>This cinnamon roll french toast was the best cinnamon roll AND french toast I've ever had. Actually, it was the most satisfying brunch I've had in a LONG time. Paired with the endless refills of black coffee, I couldn't have been any happier. <br><br>I would recommend sharing this with somebody as horrible of an idea as it sounds because even for someone with a huge sweet tooth like me, it was way too sweet. Yet I could not stop eating it. The waitress had to kindly take the plate away from my sight in order for me to stop eating.", "pics": null}}, {"review": {"des": "I used to live by the Yolk in Lakeview and it was pretty average. I moved to South Loop earlier this year and finally decided to try the Yolk nearby - I was very pleasantly surprised. I ordered the eggs benedict which was pretty good, but the potatoes that came with it were AMAZING. So flavorful and soft, not to mention that Yolk has their own hot sauce which is the perfect pairing with the potatoes. At first, I was a little appalled when they said they didn't have Chalula (my go-to because I'm spice intolerant but still want a kick of flavor) but the house hot sauce is AMAZING!", "pics": null}}, {"review": {"des": "Nutty monkey pancakes stole the show but this place was awesome all the way around. We are visiting and used the yelp app to get on the waitlist so by the time we Taxi'd here, we only had a 10 min wait. Service was fast and really well done.", "pics": null}}, {"review": {"des": "While in Chicago to celebrate our anniversary we of course looked for the best places to eat and although Yolk is technically a chain with locations in Dallas, Chicago and other cities they did not disappoint.  We ended up here both mornings and I had the same dish each time. The chicken and waffles were the best that I have tasted and I added one egg. Even though there is a crowd the wait is not long. The service was good but not great but it was nothing to complain about. I would definitely recommend.", "pics": null}}, {"review": {"des": "I was staying at the Best Western next door so got to try this spot out without the long lines or the weekend rush.  The counter seat is always my favorite and the staff was so nice! One morning I had eggs with toast and hash browns and grapefruit juice and coffee and it was served with the utmost care.  They even noticed I hadn't drank much of my coffee and offered me a Togo cup with a fresh cup.  I also had a scramble the next morning with the cheese and grits and mannnnn those were to die for.  I'd brave the weekend rush for this spot.  They also sell their own hot sauce which I wish I had bought!", "pics": null}}, {"review": {"des": "I stumbled upon this great little location while walking on a break for a business conference. <br>I popped inside to check things out and I am so glad that I did. <br>I was greeted right away and told all about how things work for getting a seat etc. I only had time for a cup of coffee this trip but they made a delicious REAL macchiatto and gave me a to go menu as I explained my time was short due to the conference I was attending. <br>My second trip in the next day I was pleasantly greeted by the same girl...\"Hey Machiatto whats up?\" all of the sudden I was a regular, she remembered my drink and got one started for me to go with my take out order. <br>My take out arrived quickly and the coffee again was DELICIOUS! <br>I made sure to stop by every morning and afternoon for my quick coffee pick up. <br>The drinks are affordable, the food is fantastic and the customer service is even better. <br>If you want to dine in you can get on their app and get in line early to have your place held when you arrive.<br>Multiple locations to choose from as well.", "pics": null}}, {"review": {"des": "This is definitely a busy place to have brunch. You have to get up pretty early to put in name and you'll probably wait for awhile. However, the food is worth to wait especially with chefs cooking in front of you with fresh ingredients.", "pics": null}}, {"review": {"des": "I like when restaurants do the basics well.  I ordered the Yolk breakfast with the crepes.  While the crepe was so-so, everything else was delicious.  My husband ordered a chilaquiles scramble of some sort, which he was a fan.  While not the most amazing meal I've ever had, I would definitely go again if I was in the neighborhood.  Pro-tip: avoid the wait and get it delivered.", "pics": null}}, {"review": {"des": "The atmosphere was nice, awesome coffee and the corn beef hash was great. Pancakes were ok, not that great but overall i enjoyed my experience", "pics": null}}, {"review": {"des": "If you are even *thinking* of eating at Yolk, download the NOWAIT app and get in line.  This place is hotter than a St. Bernard in Miami.  Using the app to get in line before we traveled here, we then only had a 10 min wait.<br><br>And there's good reasons folks wait over an hour to get a table at this comfort food haven.  The menu is wide ranging and has many vegan options.  <br><br>Start with fresh squeezed juice (I went strawberry orange).  As you wait to order, you'll see huge portions of egg skillets, red velvet french toast, and highly stacked sandwiches on the tables around you.  The options can be overwhelming.<br><br>Our table had potato pancakes (not exactly latkes but tasty) a BLT sammy, and banana bread french toast. Portions are large and all were delicious.  No mystery why demand this place is off the chain.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UV7XtqNM_KgEzgLwzbyT7Q/168s.jpg", "caption": "Their signature hot sauce."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ci_bPEscQo4aJbt4LmJIJQ/168s.jpg", "caption": "Stuffed pineapple"}]}}, {"review": {"des": "I came to Yolk for a quick breakfast since I was craving Eggs Benedict. I substituted smoked salmon for bacon that came with it and in less than 3 minutes (yes, 3 minutes!) my plate was served. I wasn't sure whether to be happy or not since I feared food was not freshly prepared. But after trying the eggs made to perfection, I knew I was safe. The meal came with fruit and potatoes (a bit over salted).<br><br>The addition of salmon cost me $2 extra, so the whole bill for the meal was around $22 with coffee. A bit pricey for my taste, but you can't beat the proximity to Hilton and the central location of this restaurant. Overall, good service and food, but a bit pricey.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SL7BLYWJXzX1mXZgj3p7Hg/348s.jpg", "caption": "Eggs Benedict with Smoked Salmon (extra $2)"}]}}, {"review": {"des": "Heard this was a must stop when in Chicago. Definitely is. Get there early because it fills up fast. My wife had their homemade yogurt with homemade granola and honey and berries. She ate it all up. I had eggs with potatoes and ham steak. The eggs were perfect. The potatoes were fine; I prefer home fries. The ham steak was about an inch thick and was grilled to perfection. This place IS a must stop when in Chicago.", "pics": null}}, {"review": {"des": "We come to Chicago once a year for conference, we always look forward to being able to eat Breakfast at the yolk!", "pics": null}}, {"review": {"des": "Yolk rocks! Truly a chicago staple. Their pancakes with the blueberry and bananas are my favorite. Service is always top notch. Even though it can get busy, I always wait. Their coffee is amazing as well.", "pics": null}}, {"review": {"des": "An Amazing spot! It's like a big modern lunchroom. Big FYI - if you're going here, get on the Yelp waiting list because it's sooo worth it. We left my place at 12:05 and I got on list - there was 18 people in front of me and when I was 5 minutes to yolk my place in line went down to 3 people. If I hadn't done this it would've been a 40 minute wait. This was the best and everyone should have this. The food was exceptional! Anything you order is top notch.", "pics": null}}, {"review": {"des": "Customer service was awesome our waiter was great, patient we took awhile to figure out what we wanted cause everything sounded good!! We had cinnamon French toast, a Nutella crepe combo but the crepe wasn't that good but everything else was great.. The eggs the sausage the bacon were all good lol the California omelette was good a little too garlicky but good the potatoes are tasty", "pics": null}}, {"review": {"des": "I came here with a group of 5 for Sunday Brunch. We used Yelp to reserve a table and the wait was only 25-30 minutes, which is relatively short for a brunch restaurant at noon. By the time we walked from my apartment to the restaurant, our table was ready--perfect!<br><br>All the waitstaff were incredibly friendly. I would give service itself a 4.5 stars. Our server was a little forgetful in terms of getting stuff for us, but it was busy so that's understandable.<br><br>The food was okay. I honestly don't think it was anything special. Two friends and I ordered South of the Border Bennys each. Our eggs were cooked too long because none of our yolks were runny. That was very disappointing, as many people order egg benedicts looking forward to the runny egg yolks. The potatoes were incredibly plain. The english muffins were drier than normal, to the point where one of my friends didn't eat her English muffins at all and just ate the eggs and chorizo on top. My other two friends ordered a skillet and an omelette, which they said were pretty average as well. I think food quality solely would be a 3. For the price range, there's a lot of places that are better in Chicago. (My friend ordered an extra side of bacon and received 3 strips for $4.)<br><br>Yolk is a clean, convenient restaurant with extremely friendly staff and a lot of food options on the menu that sound delicious but are relatively average. I would not say Yolk made a big enough impression on me that I'd look forward to returning, especially when there's so many other options.", "pics": null}}]}