{"name": "yolk-streeterville-chicago-2", "reviews": [{"review": {"des": "Long lines but, WORTH the wait. If you want to save time just get on the waitlist before you arrive. <br><br>I had the frittata & it was delicious!! Jalapeños, cheese, avocado, bacon, and eggs - can't get better than that! I tried their strawberry orange juice and it did not disappoint! My bf had the red velvet French toast. It was good, but it tasted more like dessert than a breakfast meal.", "pics": null}}, {"review": {"des": "So typically this would be a five star after all the years going here and being my favorite breakfast spot anywhere. But unfortunately this time the quality was a bit off. The chicken and waffles were fine but the gravy was cold and the chicken was not what it used to be. We also got the roast beef Benedict which is what i get every trip. Unfortunately  the meat was mostly fat and not very much of it. Also the Potato's that come with it although tasty there was barely any on my plate. <br><br>I definitely will come back and it may have been an off day because there was over an hour wait so it was crazy. But just sad because this place had always been consistent and typically would be a five star.", "pics": null}}, {"review": {"des": "One of my two favorite breakfast spots in Chicago.  The cinnamon roll French toast is absolutely to die for!!!  The rest of the menu is definitely above average and so many options. Service is really friendly. I debated between 4 and 5 stars and would give 4.5 if I could.<br><br>Seriously. Get the cinnamon roll French toast. At least get another entree and split the French toast with your breakfast buddy!!", "pics": null}}, {"review": {"des": "Stopped in for breakfast on my first day over my vacation. It was a little cluster when we first walked in wondering if we needed to seat ourselves or would be seated by a host, finally someone showed up. Once seated the service was a little slow. The table wasn't fully ready for us to be sat at and had to go fetch our own condiments after asking if we could get some. The food was great though!  Had the chicken and waffles with a egg scrambled. Would try it again, might have just been an off day with service.", "pics": null}}, {"review": {"des": "Yolk is in walking distance of our hotel, the W Lakeshore so we came here for brunch. I ordered the two egg combo with cheesy grits and added a side of bacon and substituted red velvet French toast for the pancakes, toast, or English muffin that's served with it. The cheesy grits and bacon were just okay. Others in our party had the Buffalo chicken wrap and lemon herb salmon salad. Everyone enjoyed their food, but it wasn't amazing. It's your regular breakfast and lunch food.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PpikQ5IrnIv664C6k9Z7KQ/348s.jpg", "caption": "Cappuccino"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TIkzawQcYjaax5p5TaJ6eA/168s.jpg", "caption": "Buffalo chicken wrap"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bdJnU-NN1wrJ47rD2n-u2w/168s.jpg", "caption": "Two egg combo with cheesy grits and bacon"}]}}, {"review": {"des": "Long waiting. <br>Our hotel gave us a paper to show them in order to ger seated faster. Not really faster. <br>We sat at the bar. The service was fast. The pumpkin pancakes was so good. <br>Our server was fast and smart. I gave 4 because my omlet was not delicious really . Also most of the servers' uniforms and people working there had stains. The menu had stains. A girl working there with a very dirty pink fur working behind bar. I didn't feel the restaurant is clean or the people are to the standards. <br>But I blame management for dirty uniforms and menus.", "pics": null}}, {"review": {"des": "This is the 5th Yolk location I have been to (in Chicago) and the first review for it by me. There is a reason I keep going to Yolk- they get the job done! They get busy and close at 3pm, so make sure you use the yelp app to add yourself to the waitlist. It's really helpful!<br><br>This time featured is their corned beef hash with potatoes and banana berry crunch pancakes *slight up charge. On the other place is their all-star combo, which is actually a really good deal. Its eggs, baaacon, 2 sausages, and chocolate pancakes *up charge for $11. The corned beef dish was $14. The prices are a little high, but worth it! The sometimes long wait lines prove that. What really stands out to me about Yolk are their ingredients. EVERYTHING is so fresh. Like their sausage and bacon for example are so large and in charge. Yolk has a good supplier, wink wink ;) <br>I am going to let the photos explain the rest of this review *emoji <br><br>Always 10/10<br><br>Ps. I love their signature hot sauce- I bought a bottle of my own. Throw it on everything!!", "pics": null}}, {"review": {"des": "If your an egg person then this is your place.  I found this place while hunting down a Target while in town for a conference.  Yes even while I'm away it was Target to the rescue.<br><br>When I passed by I saw the chairs stacked on the tables and it was locked up tight as a drum.  I thought hummm sad they closed down because I REALLY wanted to try them out.  I figured it was pretty recent because everything looked like it had good upkeep.<br><br>So I moved on.  As fate would have it I was down in this general vicinity again and they were OPEN and HOPPIN.  Folx were streaming through the doors trying to get something to eat.  When I walked in I saw there were pretty packed and people were waiting to be seated.  <br><br>Eye spied plenty of seating at the counter so I asked to sit there figuring I would get a eat much quicker.  They were cleaning of seats and just as another lady (alone) came in asking for the same thing.  So we waited.  <br><br>Next thing I knew two guys walked in and head right for the counter. Not asking or anything.  the lady and I shot each other the look of ....REALLY you've got to be Effin' kidding me.  A couple seconds later our names were called to also take a seat.<br><br>Her hubs was in town for business ,she came with him and she remembered this place had good food.  I perused the menu to see what I wanted and decided on the spinach scramble, no cheese no maters.  It came with potatoes and your choice on toast, cheese grits, or pancakes.  I feel like I'm missing another option you could have gotten.  I also got coffee.<br><br>I waited watching the action behind the counter.  Huge orders of food came up, more people arrived, other left and they stayed busy and got busier.  I found out that this place is only open a few hours a day.  Like for breakfast and lunch or brunch and that is it.  So when I passed by later the a few days ago they were just closed but closed down.<br><br>My food arrived and I dug in.  I know its just eggs but more often then not when you order eggs your not getting REAL EGGS your getting powered eggs mixed with real eggs.  Its a restaurant trick that helps keep there cost down and profit up.  Most people can't tell the difference, especially after they add some seasoning, onions, etc.  To avoid this never order scrambled eggs.  Always order over easy, over hard, etc.  If your an omelet person than chances are your getting part powered eggs.  Sorry to be the barer of bad news.  BUT your in luck COME HERE and you won't have that problem.  Again I will repeat it for the people in the cheap seats...They use REAL EGGS!<br><br>Everything was DELICIOUS!  I enjoy my meal and the coffee was fresh.  I even left with a mini bottle of there maple syrup.  YUM!  Definitely I good place for a do over visit to try something else.", "pics": null}}, {"review": {"des": "When you can't stop thinking about how good the food was, you know it was a winner!  I would go back hear in a heart beat.  <br><br>Before arriving at the restaurant, we were able to add our name to the wait-list.  By the time we arrived, it was about 5 mins until our table was ready.  This place gets very crowded and people are literally everywhere.  Luckily there is a lot of workers and everything went smoothly.<br><br>The menu here is amazing.  The variety and uniqueness of the dishes seriously made me want to order one of everything.  I refrained of course, but went with the green eggs and ham with fresh fruit.  I wish I could have eaten everything on my plate as it truly was that good.  Why have I never thought to order this dish anywhere else before?  They nailed it and I may have a new favorite egg dish.<br><br>Service was solid and we were given some direction as to what is most popular.  Reasonable prices!  Both indoor and outdoor seating!  Great location!  Most importantly delicious food!<br><br>Gonna be back one day!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uqu7zIYdLsoDvDYDbGREgQ/348s.jpg", "caption": "Green Eggs and Ham (minus the cheese)"}]}}, {"review": {"des": "The food was good and service was amazing. We had pancakes, an omelette, and eggs and sausage.<br>The price was fair, but if you do not go early, the wait time may be a little over 40 minutes. So it's best to wake up a little earlier to beat the crowd", "pics": null}}, {"review": {"des": "If you want an warm omelet packed with flavor on a crisp morning, this is your place. This bustling restaurant deserves the 5 star. It's clean, easy access from a nearby parking garage. Enough sitting, except for on a hectic morning. We were ushered straight way to our seats. Our waiter greeted us with a smile and had cold water on hand. The menu is extensive (which I prefer). You have options of skillets, omelets and lunches to choose from. All poppin' fresh. I ordered the 5 Egg omelet, The Works. It was huge and filling. I loved the flavor, except when I got to the end, the omelet tasted as though it had been cooked in meat grease. It had that sweet/meaty flavor. Besides that, one of the best omelets ever! The service was quick and efficient. The facility clean and organized. If ever in town again, would return", "pics": null}}, {"review": {"des": "Amazing brunch food here. Best thing is you can check in on yelp for the wait and just show up later. <br>I highly recommend making your own dish where you. Can pick the type of eggs and add protein and vegetables .", "pics": null}}, {"review": {"des": "Overrated, not much flavor in anything we ordered. It was all about quantity over quality.  The service was good though.  I would probably not return to this place.", "pics": null}}, {"review": {"des": "Nice large restaurant with fast friendly service. It's hard to beat that in a very popular area. And, for how crowded it gets, the restaurant is really clean!<br><br>Their menu isn't HUGE, but it's definitely enough that it will fill everyone in your party's taste buds. You like sweet, they have that! Savory...yup, that too. Just want coffee - it's actually pretty decent and you don't need to go to any fancy coffee shop. <br><br>Overall: I will definitely check this spot out again in Chicago or any other locations they are in.", "pics": null}}, {"review": {"des": "Loved Yolk!!!!<br>Join the waitlist before going to get seated faster :)<br>We had a horrible waitress but food was delicious!!<br>Pancakes and French toast were to die for (even better than Wildberry pancakes) Benedict eggs were eeeh I've had better but I have to give it to the frenchtoast and the actual pancake were really good plus the toppings make them better<br>Would def go back!", "pics": null}}, {"review": {"des": "This is my favorite spot in Chicago and usually eat it the day of my departure! The seasoning, flavors and texture on the dishes are amazing and incomparable. Back in March I tried the Loaded Baked Potato Cakes and was super satisfied with the flavors, that I tried making it back home. However, it was missing some flavor and the experience of eating in beautiful Chicago. Just went back recently for more earlier November. The service is great even if you have to wait the long lines.", "pics": null}}, {"review": {"des": "We were in a rush to do as many things as we could while on vacation. We were able to make a reservation the same morning and had a short wait. It was nice and fast.<br><br>I can't say much about breakfast, it was breakfast. You would think that everyone would do a good job at breakfast, yet so many fall so short. This was not the case here, everything was a home run. Solid breakfast food, great prices, and generous portions.", "pics": null}}, {"review": {"des": "We used the waitlist on yelp and were seated soon after checking in! It's completely worth saving the few minutes before you are seated and fed if you happen to be on your phone a few minutes before walking in.<br><br>We were tended to regularly, offered extra plates for sharing and asked how we were doing. Note that I'm not a particularly big fan of breakfast/brunch. But I ordered the red velvet french toast and LOVED it. Red velvet and its luscious cream cheese wifey is the only cupcake combination I tolerate, and this french toast absolutely does this flavor combination justice and more, with the cream cheese icing crafted INTO the crevices of the deep red toast. The ever-so-slight savory tones of cream cheese, the fluff and moisture of the bread, the smooth dollop of whip, wow.. I absolutely recommend this flavor, and based solely on my food I'd give the place 5 stars. Except..<br><br>If you do not actually want the coffee, make sure to say no when they bring it over and offer!! My server said nothing about it being an additional charge, which I suppose is not surprising, but it was an unfortunately unexpected $3 per bottomless mug/person. :( Still, I'd be sure to come back if I needed a quick dependable brunch spot in Chicago!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FW4m2fVZWpJr1gagafKjaQ/348s.jpg", "caption": "Red Velvet French Toast"}]}}, {"review": {"des": "It's funny how I even found this place, but after I was ubering by it the day before, I *knew* I had to stop here and eat.  I've been burning an enormous amount of calories with all the walking I've done here in Chicago, and needed a solid meal to keep me going and get done what I need to get done.  I finally had time to stop in here on Monday to eat, and let me tell you, I'm glad that I did.<br><br>For starters, they are part of the yelp cash back thingy, so I suggest you pay with your card to shave a few bucks off the bill at the end.  Also, when I walked in, since it was a Monday morning and everyone's at work, I was literally the only person there eating at 7:30 in the morning. Cha ching!<br><br>I scoured the menu and was quickly greeted by my server. She introduced herself and asked what she could get me to start. After scouring the menu, I went with the breakfast wrap without any bacon or pork.  I also got there coffee which was strawberry flavored. At first I was like wtf is this, but after it settled into my stomach, I really liked it.  (I can be a bit of a coffee snob at times.)<br> <br>When the food came out, I absolutely devoured it and it was quite delicious. Hot, fresh and really good food.  Server was attentive, place was warmly decorated and there's plenty of seating throughout. They even have a cute little bar area to sit at, but since nobody was there, I snagged a table instead.<br><br>Food here is legit, and not cheap either. It's the kind of place you *want* to eat at because you can trust that it's not going to be garbage.  Put this on your short list to eat at, and make sure you get hear early like I did.  I hate waiting in line, so I try to hit popular places like this at either the crack of dawn on weekends, or a weekday morning like I did this time around. I will definately be back in the future and wish we had one closer to my home here in Michigan. This place is a total gem!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dTayVKZ3C2x6dVG1p2tkUA/348s.jpg", "caption": "Beverages"}]}}, {"review": {"des": "This was my favorite breakfast meal during our stay in Chicago. Apparently, there are multiple locations but being a chain does not mean the quality of food/service is lacking! <br><br>We walked here from our hotel and saw a huge wait outside. Don't let that discourage you from trying this place out! It turns out it we only waited about 15min. They turn tables pretty quickly and you can even put your name on the waitlist using the Yelp app--very convenient. <br><br>Breakfast portions are usually generous at places that specialize in the most important meal of the day. I couldn't commit to an entree and was craving both salty and sweet. I decided to get a few items a la carte: chili, corned beef hash and a red velvet french toast. Everything was delicious. I'm pretty sensitive to overly salty foods, but I was surprised I wasn't downing glasses of water after consuming both the chili and the hash. The french toast was the perfect palette cleanser to complete my meal--the whipped cream was airy and not too sweet. <br><br>Definitely recommend this place. I appreciate that they even have a test kitchen location where you can dine at as well. Hope they expand to California :)", "pics": null}}, {"review": {"des": "Yolk is like Cora in Montreal where you have imaginative menu were sweet teeth will surely like ! Anyway my girlfriend and her 9 year old daughter were happy. <br><br>And that's were we end up to eat breakfast for 3 days. They have waffles and crepes with chocolate and similar things, i choose  bacon and eggs plus french toast it was good !<br><br>The portions are enormous and you will get out with a full belly !<br><br>On peut voir Yolk comme la version américaine de Cora où vous avez de la cuisine imaginative qui titille autant l'oeil que les papilles gustatives ! Les dents sucrés seront ravis tout comme ma copine et da fille de 9 ans l'étaient !<br>Et nous avons fini par prendre notre déjeuner là 3 jours de suite. <br><br>Ils ont des crêpes, des gaufres avec du chocolat, des bananes etc... J'ai. Pris des oeufs et du bacon comme d'habitude avec du pain doré, c'était très bon.<br><br>Les portions sont énormes et votre bedon sera plein lorsque vous sortirez !", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PqXHRVEItcItIBk5uUF5sA/348s.jpg", "caption": "Yolk best breakfast in Chicago."}]}}, {"review": {"des": "I didn't realize it but Chicago is a brunch city. My friend and I arrived close to the end of brunch so we were able to get a window seat immediately. We were brought a pitcher of water which was nice. The menu was pretty extensive and had quite a few appetizing sounding dishes. <br><br>I finally picked the Croque Madame which was unique from the traditional way it is prepared. It is made with challah French toast and includes ham, turkey, egg and the cheese I picked was cheddar. This came with seasoned potatoes on the side. The challah French toast was delightful... Slightly sweet, lightly toasted, wonderfully tender and crunchy at the same time. The sandwich came chockfull of ham and turkey and both had great flavor. The egg on top was a tasty touch that went well with the entire sandwich. My only complaint is the cheese... They used shredded cheddar and it was barely melted. I would have preferred it if the cheese was melted completely. <br><br>I was also not happy with the potatoes. They definitely were not seasoned and actually tasted incredibly bland. I think if the potatoes were cooked for longer and had a brownish color to it, made slightly crispy it would have tasted much better. <br><br>My friend and I noticed that some of the cups (the ones for coffee and tea) and silverware did not seem to be washed properly. In fact, my friend asked for a different coffee/tea cup and the replacement was still not up to par with our standards so she ended up using the glass cup for her tea! <br><br>The waitress was pretty nice and served us in a timely manner. I also appreciated that even though we were there past the closing time, we were not rushed to leave. If I return to Chicago, I am not sure I would come back. I think I would want to try other brunch spots.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mj_LzMuoD4v8wR2XeBPb_A/348s.jpg", "caption": "Close up of Croque Madame with Challah French Toast & Seasoned potatoes"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mTMgPSwBIO92CSrTpCHo3w/168s.jpg", "caption": "Croque Madame with Challah French Toast & Seasoned potatoes"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HEeDyFa6Uetw_o5paUJSyQ/168s.jpg", "caption": "Water"}]}}, {"review": {"des": "This was the very first spot I ever dined at within 3 hours stepping foot in Chicago for the first time so it holds a special place in my heart. The decor is bright - yellow and blue. The servers and friendly and smiley and nice.<br><br>I was also very sick and very stuffy and couldn't taste many things but I ordered a bagel sandwich with seasoned potatoes on the side, drenched everything in hot sauce, and that was the best thing for me at that time. My friend enjoyed the eggs benny.<br><br>I'd come back here. Great food, great atmosphere, great location (across from the park, and near the water).", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MHpbqmUrnWnTbJ0N3a52Gw/348s.jpg", "caption": "Cheesy Egg Sandwich"}]}}, {"review": {"des": "One of the best places for brunch in Chicago! You have ample space for large parties and a great selection of both savory and sweet items! This is also BYOB! Bring some of your favorite champagnes and Yolk will provide you with their freshly squeezed OJ for some delicious mimosas! <br><br>I ordered the Corned Beef Hash and Eggs recently. Portions are very generous and comes with a side of toast or pancakes. Definitely great for sharing!", "pics": null}}, {"review": {"des": "Best Brunch in Chicago! The service was great and the food was delicious. I ordered an Eggs Benedict with chorizo and my husband ordered the meat and eggs with his choice of smoked ham steak. Not only were both of our meals filled with yummy flavors, but we also enjoyed our experience because we sat at the bar. We could see the kitchen staff working hard and getting food orders out in a timely fashion.  I really liked the atmosphere of this place and felt like it suited us. <br><br>Coming from South Carolina where grits are served regularly, I had high expectations when trying their cheesy grits. The flavor was delicious, but the consistency/texture was just a tad off. Other than that, everything was wonderful!", "pics": null}}, {"review": {"des": "Food was really good here. We walked about 15 minutes down Ohio to get here for breakfast. There really wasn't any wait for seating. However our service was incredibly slow and it took almost a hour to leave from the time we sat down. Our waitress didn't check on us very often. After we sat there for about 25 minutes waiting for food, I was just about to get up and ask what happened to our food, and then it came out. <br>I had the chicken and waffles. Ample waffle with a breaded chicken tender. The egg on top was a dollar extra. Hubby had the protein and grits. Which is basically eggs and cheesy grits. My youngest chose to build a omelet. She spent the most out of all of us as each add on is .75cents. (about $16) We should have realized from experience that she always does better on the kids menu. <br>So the food was really great but expensive at nearly $60 for the three of us. Service needs work. It would have been a four if not for that.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/t8MreU48dKYcyk25gHsWxw/348s.jpg", "caption": "Buid your own omelet"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HD4BGHryWeUiO_SDoZT7nQ/168s.jpg", "caption": "Farmhouse breakfast"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DC8tblzx9vlYZtghej99rw/168s.jpg", "caption": "Chicken and waffles"}]}}, {"review": {"des": "A nice place with pretty standard but good breakfast fare. The service was really great during my visit. Our server was very attentive and ready with a joke, which I appreciated.<br><br>The stand out from my visit were the chilaquiles, their's are served with eggs, which you should only order over easy or sunny side up. Any other style doesn't allow you to fully appreciate the unctuous qualities of the yoke. So good!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PFUhDLu1j_5RXt5xj9jkFw/348s.jpg", "caption": "My favorite, chilaquiles, aka breakfast nachos"}]}}, {"review": {"des": "I visited Downtown Chicago for a long weekend and made it to Yolk twice for brunch. My first experience was better than my second, and the first wasn't even all that good to begin with. I ordered the Red Velvet French toast with bacon and eggs, because hey, who doesn't love red velvet?! However, in my hunger and excitement I guess I overlooked the description on the menu that mentioned it was filled with a sweet cream cheese like filling - it was insanely sweet, and completely unemployable. They really shouldn't even make this available to children! But the stars are for the slamming scrambled eggs and bacon on that first trip, along with the great service from our sever Jamie.<br><br>The second time I visited, I wanted to do this place justice and be an adult, so I ordered the plain buttermilk pancakes, again with bacon and eggs. I couldn't believe how UNHAPPY I was with such a simple order... with every bite of the pancake it felt like I was eating baking powder, the eggs were super watery, and the bacon tasted like it had been fried hours prior and was just sitting around - it was so gummy and unappetizing. The service again was great, and my server (Jane?) was helpful and brought out a completely new meal for me, but it just didn't meet my simple expectations... I walked out hungry, and $25 poorer.", "pics": null}}, {"review": {"des": "I ordered the Farm House which was eggs with biscuits/sausage gravy and cheesy grits. The food was good but nothing spectacular. The biscuits were not homemade but the cheesy grits stuck to the spoon (the sign of good grits so I am told). The coffee was good and they always kept it topped off. The service was not overly friendly and at times a little awkward. Good in a pinch but nothing to wait in line over.", "pics": null}}, {"review": {"des": "I'm a huuuuuge breakfast fan. I think I could survive on eggs, bacon, and potatoes my whole life. Three staples of surviving right? <br><br>So far I've tried the South of the Border Benny and the Hey Ricky! Omelette. The chorizo is flavorful and the eggs were cooked to perfection. You know the eggs that spill that perfect yolk when you poke into it? <br><br>The omelettes are hearty and served with your choice of bread, potatoes or grits. The potatoes are the perfect amount of crispy. Tip: they taste amazing with the special Yolk hot sauce! Gives it a kick.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qcTUYum8cnk5de6eQRKWqQ/168s.jpg", "caption": "Hey Ricky Omelet"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6ckn1QqV6BqoE1jw5um9BQ/168s.jpg", "caption": "South of the Border Benny"}]}}, {"review": {"des": "I was having a solo breakfast so I sat at the bar. Although the restaurant was busy, the service was good and the food didn't feel churned out.  I had corned beef hash and eggs over medium. The dish had good flavor and I ate it all. The atmososphere was bright and cheery, even on a gray snow flurry day. I would definitely go back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/P17bB9cXPjpyRr6meZq6Mg/348s.jpg", "caption": "Corned beef hash with eggs over medium"}]}}, {"review": {"des": "It's ok. Last time I came to Chicago I wasn't able to eat here because waiting was over 2 hours. But this time around I made it. The place is clean and service was good. <br><br>**FOOD: I had the Iron Man Omelet with cheesy grits, it was delicious (highly recommend it). My friend had the chicken and waffles and he hated it, the waffle was very hard and the chicken had no flavor. My boyfriend had the west coast crepes and it was ok, it was fresh but lacking flavor he had to put a lot of spicy sauce to elevate the flavor (he doesn't recommend it). <br>**DRINKS: we only had coffee and it was ok nothing amazing. <br><br>Overall the place was good but my friend/boyfriend had a bad experience. Not sure we'll be coming back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Qmn5hepnS3Y6XjfAN5KVRg/348s.jpg", "caption": "West Coast Crepes"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Z7fU6d1nsutMpmeHGPzgpw/168s.jpg", "caption": "Iron Man Omelet and Cheesy Grits"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8J-Qn4x-aUQkqYbqMOZVfg/168s.jpg", "caption": "Chicken ' N ' Waffles"}]}}, {"review": {"des": "Service was good. No wait for a table. Reminds me of IHOP. I had the chicken and waffles with a side of fried egg and some fruit. My friend had the hey Ricky omelette. She loved the bottomless coffee. I however had the hot chocolate since it was freezing outside and I dont drink coffee. Food is priced reasonably for this area of Chicago however imo the chicken and waffles were average at best. the waffle had bacon in it and was crispy which was good but the chicken was average. I've had better chicken and waffles however overall an ok experience", "pics": null}}, {"review": {"des": "Great food, great service, in a great location on the corner of two buildings with an outside patio that makes you feel you're in a much more quiet environment than cross streets of a major intersection in Chicago. Our server Rachel was awesome. Coffee was excellent. 5 Stars!", "pics": null}}, {"review": {"des": "Had to stop in for a hot good meal. The Yolk berry bliss is always the go to meal for me. The greek yogurt is so tasty, fresh fruit, granola with a lil honey.<br><br>All the food here is good. Staff is super friendly", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ekk2ATWDnMW9_I_XOwqCFA/348s.jpg", "caption": "Yolk Berry Bliss"}]}}, {"review": {"des": "Here visiting for my husband's birthday and his sister recommended this place. It was just okay or maybe it was what we had. Cold grits. Bleh.  Unseasoned eggs. Nice, soft fluffy pancake and bacon cooked the way i like it. Good coffee.", "pics": null}}, {"review": {"des": "Portion is giant! Service is great and food comes out quickly. Everything was delicious but probably best to avoid the crepes and potatoes bc they were soggy.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FRTZJhaK1m_jjZffUPyASQ/348s.jpg", "caption": "Top is Eggs Benedict bottom is the Yolk All - Star Combo."}]}}, {"review": {"des": "7/2/18 Had the smoked salmon scrambler. Good taste overall...just a bit dry. The potatoes were not warm enough. Cool vibe and outstanding menu. Would try it again.", "pics": null}}, {"review": {"des": "Disappointing food. plus eggs were cold and pancake were too. Server was friendly and did good but we didn't walk 2 miles for service  :(", "pics": null}}, {"review": {"des": "I came here for breakfast and was pleasantly surprised by how delicious everything was! I'm from Florida, and I was visiting for the weekend. As I was looking for a good breakfast/brunch place, I came across Yolk and I couldn't pass it up. I had an egg white California omelette, which had avocado,green onions, Swiss cheese, tomatoes,cheddar cheese, garlic, and topped with a spoonful of sour cream. I recommend asking for Yolk's signature hot sauce and pouring some over the eggs. Absolutely delicious! <br>An honorary mention to their tres leches pancakes. I'm Hispanic, so I know a thing or two about tres leches and these were delicious! No need for syrup for these babies. If I ever come back to Chicago, you know where I'm going for breakfast.", "pics": null}}, {"review": {"des": "Great breakfast/brunch option!<br><br>We went Sunday around 9:30 AM. The wait time was short. They have an online waitlist option available that works well. <br><br>The atmosphere was prefect for breakfast and the interior decorations were cheerful. <br><br>The food was awesome, everything came out great. <br>The smoked salmon scrambler and banana nut bread French toast were our favorites. The breakfast burrito was a bit bland, probably would not order again. <br><br>Our server was polite, prompt, and fairly easily accessible. <br><br>Would definitely come back again for breakfast/brunch.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/l8LJ6osv4hpXtRBCOza8Dg/348s.jpg", "caption": "Smoked Salmon Scrambler"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LrR4jbRL4k52AzL96iViMQ/168s.jpg", "caption": "Breakfast wrap with side of potatoes."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FonU5nIFWHeYHM8j8MUUCA/168s.jpg", "caption": "Banana nut bread French toast."}]}}, {"review": {"des": "Check their current menu as it changes. I was a bit disappointed because I really wanted the Smoked Salmon Platter, but they had changed their menu so that was no longer available. I settled for just a bagel with cream cheese and salmon (made a little lox bagel). The cream cheese probably came from a grocery brand, I was expecting fluffy cream cheese-- I'm all about the cream cheese! But it was ok for a light breakfast. Disappointed that you do not get free refills, that includes any juice! I do love their BYOB, maybe that's why there's no free refills? I think it's a great place, I was just not in the mood to explore anything other than the smoked salmon platter.", "pics": null}}, {"review": {"des": "Sarah and the rest of the staff were great. We got the pancake of the day as a starter and then the California omelette (5 eggs per standard operating procedure) with the cheesy grits and sausage (3). The bottomless cups of coffee sealed the deal.  We love Streeterville!", "pics": null}}, {"review": {"des": "The estimated wait on a Saturday for two people was other worldly but it ended up only being like 40 minutes. When I say this place was stuffed to the brim, I mean it, but that's usually a good sign. <br><br>We both ended up ordering omelets and a side of one of their sweet breakfast items (I got the red velvet french toast and my sister got the nutella crepes). To make a long story short, the sweet breakfast items were the clear winners. So good! The red velvet french toast was stuffed with cream cheese so it felt a little like dessert for breakfast which I'm not mad at. The nutella crepe was really good too. <br><br>Our omelets were fine, but not really memorable. The menu is pretty expansive so everyone should be able to find something they like.<br><br>TIP: Check in on Yelp first to cut down on your wait time.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dYk1UWSkvOv1f1voWCMRPw/348s.jpg", "caption": "Focus on what's in the middle - red velvet french toast and nutella crepe. So good!"}]}}, {"review": {"des": "Food: 4/5<br>Service: 4/5<br>Ambiance: 4/5<br>Overall: id come back!!!<br><br>The extended review...<br><br>Food:<br><br>Red velvet French toast - yummy yummy!  I could definitely taste the chocolate and the frosting wasn't too over powering.  Get the meal...eggs, bacon, and sausage will seal the deal.<br><br>Cinnamon roll French toast - also another good choice.  The only thing I'd say is that the frosting could be toned down a bit.  Very plentiful but it can make it too sweet.  Again get the meal to get the eggs, bacon, and sausage.<br><br>Service: friendly and attentive waitstaff.  What I loved about this place is that you could put your name down via yelp rather than sitting around and waiting.  BRAVO!!!<br><br>Ambiance: very casual and there is in door and out door seating!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FDDWGFt__C-O6WqHxVuvDA/168s.jpg", "caption": "Red velvet French toast - uh yes please!!!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ntLnckIKTKWBy5vahJyemw/168s.jpg", "caption": "Cinnamon roll French toast - yummy!  But the frosting could be more spread out."}]}}, {"review": {"des": "I really like this place for breakfast! Normally there is wait time for about 20 mins but it worth it! Service is good, food is great! I like the atmosphere-feels like home!", "pics": null}}, {"review": {"des": "Hits the spot perfectly.....the five egg omelettes (the works and iron man) were great, and a taste of the fall pancakes was a nice way to top off the meal.  Only downside was the wait so make sure you get on the wait list!", "pics": null}}, {"review": {"des": "Found Yolk while searching through yelp for a breakfast spot- and boy am I glad we decided to come here! <br><br>Put my name down on the waitlist via yelp before leaving our hotel- it was about a 15 minute walk and they were running a 30/45 minute wait-- we checked in then waited another 20 minutes which really wasn't too bad. <br><br>I had the yolk all star combo which included eggs, bacon, sausage, and your choice of 2 crepes, 2 slices of French toast or a waffle- I picked the cinnamon roll french toast and it was absolutely delicious! They also offer turkey sausage which I subbed for the bacon. The restaurant was packed and our food came out in no more than 5 minutes- very impressive and not to mention it all tasted amazing! Another great restaurant in Chicago- will definitely be back next time I'm in town!", "pics": null}}, {"review": {"des": "Breakfast options several.  Judging, I typically do by emptiness or cleanliness of plates after eating, cannot be applied here because portions are huge.  Feedback from grandma, wife and mom (Mothers Day), I have to say it was phenomenal.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fEOO5G0ljcVQgaoBR3GkPg/168s.jpg", "caption": "Thanks for handling mine !"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vD9YDjsMz7cg7AHqr79Ufw/168s.jpg", "caption": "Nice bottled water"}]}}, {"review": {"des": "I had the special for the month - French toast with Greek yoghurt, honey, and granola. Yum!", "pics": null}}, {"review": {"des": "I ate here for breakfast, and the food was good.  I had the South-of-the-border Benny, and the meat and eggs were cooked nicely.  The potatoes lacked much seasoning, but they were still good.  I found the service to be prompt and efficient as well.<br><br>Finally, this is for single customers: Yolk has counter seating which is perfect to blend in.  I didn't feel ignored or out of place.", "pics": null}}, {"review": {"des": "This was our first time at Yolk but definitely not our last. I had the cinnamon roll French toast based on other reviews and it was delicious!!! Highly recommended! The hubby had a combo and his pancakes were not impressive. If you do not like to wait, add your name to the waitlist and you'll get right in.", "pics": null}}, {"review": {"des": "This place was outstanding. Everything from the food to the service was perfect. The servers were constantly making sure we had enough water and coffee and were so friendly and made you feel at home.<br><br>The regular Eggs Benedict were excellent, but the Very Berry French Toast is incredible! Mixed berries, greek yogurt, granola, and honey on french toast is out of this world. The french toast was perfect and I loved every bite. Definitely will go back there again for more.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IYRHskTNIhR8g9E_-YYBKQ/168s.jpg", "caption": "Natu wanted to try the eggs benny and he loves them!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Q9ROo5DN6xaYt3TlBrmovg/168s.jpg", "caption": "Very Berry French Toast was wild! So good! With a small side of crab cakes."}]}}, {"review": {"des": "The menu here is large and in charge!! So many options and not your typical generic breakfast pairings. Service was fast at peak breakfast hours and the service was stellar. Our waitress was super nice and attentive. And the most important part is the food was superb!!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/am63EQkp5KSQh6mmcL_N3A/168s.jpg", "caption": "Nutella Crepe"}]}}, {"review": {"des": "Stopped by Yolk which was near our hotel downtown. It was highly rated so we checked it out. A few things: the house coffee was not good. It tasted slightly burnt. If coffee is your thing, I'd recommend skipping it. Service was awesome. Our waitress was very friendly and attentive. The food was solidly good - but I wouldn't say 4 stars of amazing. Overall, if I was back in Chicago, I wouldn't be dying to go back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/o7qUdfll0DkYxj6dc-f4eA/168s.jpg", "caption": "Iron Man Omelet - huge portions! Potatoes were delicious!"}]}}, {"review": {"des": "This is a great little place in the city with a large menu and MASSIVE portions. My wife and I easily shared a chicken and waffles order and were stuffed. <br><br>Our server Michelle was so sweet, and maybe it is just the Midwest thing, but her constant smile makes me doubt she ever has a bad day. <br><br>The loss of star was only because they ran out of pure maple syrup. As a solid breakfast joint that is a staple that should ALWAYS be on hand. Substituting high fructose maple \"flavored\" syrup is a no no. It ruins the experience of the good food.", "pics": null}}, {"review": {"des": "Yolk is in a good location close to the waterfront in downtown Chicago. The parking is limited which is always a bit stressful if you're on a time crunch, but we got lucky and snagged a spot almost right outside. <br><br>There really weren't many people in there, as we were having more of a brunch than breakfast, so we got seated right away.<br><br>The nice thing about Yolk's menu is that there are definitely healthier options as it pertains to breakfast/brunch rather than a menu full of biscuits and gravy and pancakes. I ordered the super fun pineapple yogurt bowl. This thing was literally served in half of a pineapple! The fruit was very fresh and it was filling yet not in the way that I felt sick upon leaving.<br><br>The waitress was nice and there was something of an eclectic vibe from the staff which was interested and fun because the decor was pretty basic and almost boring. <br><br>It was a great place to stop before a stressful day and I would probably recommend to others if not for the difficulty in getting there/not knowing whether or not there will be enough space in there!", "pics": null}}, {"review": {"des": "Very good service, thanks Stan. I had the Croque Madame. It is listed on the Savory part of the menu. I failed to notice that in the description is challah \"French toast.\" My fault for missing it but this does not belong in the savory portion. If you're looking for a traditional Croque Madame, don't order this! Home fried potatoes were very good, cheese grits were very thin and watery.", "pics": null}}, {"review": {"des": "Everything was delicious! We had a group of at least 12 people and we had a wonderful staff accommodate us. We had a good meal and loved it! We will definitely come again!", "pics": null}}, {"review": {"des": "Breakfast for lunch, oh yea. As I get older, the more I appreciate how much a good breakfast can make your day... and why not put breakfast at any other time in the day. Came by with a group of friends on a weekday lunch. It was pretty busy, but we were seated quickly. Service was OK, no qualms. There are so many options on the menu, it's dizzying! I had a late-in-life appreciation for Tex-Mex, so now being in the Midwest... if I see Tex-Mex... or Mexican for breakfast... I have to try it. So I got a chilaquiles verde... which was more like a weird breakfast nachos plate. It was mostly chips and cheese and then some eggs. Would really rate this more 1/5... but the other classic breakfast dishes looked very good... and the rest of my table enjoyed there's so I rounded way up. I'd definitely come back and try again. Just not chilaquiles.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SybZguOsFmVIQMrbPioNIw/348s.jpg", "caption": "Chilaquiles Verde with steak"}]}}, {"review": {"des": "Long lines, large portions, BYOB. <br><br>The quintessential Streeterville brunch spot is always packed with tourists during the Summer. Amounting to about a two hour wait. So I can't say I've been here that often. But the most recent time I went on a Monday at 12:30 with a large party of 20-ish people in November was probably my favorite experience at Yolk yet. <br><br>BYOB:<br>I've lived two blocks away from Yolk for over a year now, and I didn't know it was BYOB until a week ago. Bring your own champagne, buy a carafe of OJ (good for mixing with about two bottles of champagne), and drink away! <br><br>Food: <br>My usually order is the South of the Border Benny. An eggs benedict with chorizo instead of the traditional Canadian bacon. It comes with home fries. The benedict is delicious; beautifully poached egg, and a generous amount of chorizo to flavor the english muffin underneath. I'm not the biggest fan of the home fries, they're a little soft and sometimes soggy. <br><br>Atmosphere:<br>If you come during one of the busy times, like in the Summer or on the weekend, the place is PACKED! It's honestly not my favorite, because it definitely doesn't make for a relaxing weekend brunch. You pay at the front as well, so the front is crowded with a line of people trying to pay after their meals. It is loud, and every table is filled.<br><br>Service:<br>This has varied every time that I have been here. My latest experience was excellent. The waiter was very attentive, and the food was brought out for our large party of 20-ish people all around the same time. We had a couple people come in late, and he was also very good about getting their orders in. This may be because we were one of the only parties there. <br>Other times I have been there, the service is a bit slower. The waiters are busy because the place is so packed. So it's hard to get their attention, and you might be waiting a bit for a your order.<br><br>Overall, a good place for brunch, with your standard brunch fare, done pretty well.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Rd3deWZB-t-f9u4xy0FigA/168s.jpg", "caption": "Size of a carafe of OJ, for your byob champagne"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WBq-ofT6lYK_uK7De7Swdw/168s.jpg", "caption": "South of the border Benny"}]}}, {"review": {"des": "I have been frequenting this location of Yolk for a while now. The quality of food is great and very consistent all the time. My go-to order is the Corned Beef Hash with over easy eggs. This also comes with a side of pancakes. It's one of the best corned beef hash that I have had! They used to serve turtle brownies but I was informed during my last visit that they phased them out and changed them with prepackaged brownies. Kind of disappointing but not really a big deal. <br><br>Service is always fast here even when it is busy. I will definitely keep coming back here!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9xMXTFAYkerWIq1lXT0i_Q/348s.jpg", "caption": "Corned Beef Hash & Eggs"}]}}, {"review": {"des": "Customer service was nice and helpful. Busy though to be expected in a tourist area.<br>Ordered the Grilled salmon and eggs. Salmon was good, pancakes was hard & dry. Hollandaise sauce was bland and needed more work. Corned Beef Hash & Eggs was decent. Waffles with eggs was cooked too hard. Overpriced", "pics": null}}, {"review": {"des": "We're from the Boston area and went to Yolk while in Chicago for the weekend   The food here was so good... We came back the following day!!! Use the NoWait app because wait times are long. <br><br>Seriously - get the cinnamon roll French toast.... Sweet but so incredibly good!! The homemade corned beef hash was great and so were the sausage that they serve (must be local sausage).<br><br>Also, you don't typically expect good quality coffee at breakfast joints... The coffee was delicious!!!!", "pics": null}}, {"review": {"des": "Living above, Yolk is one of my go to breakfast places. Today however I was greatly disappointed by the was the hosting was managed. With 8 , yes 8 empty tables there was a 45 minute  at 1030,  on a Sunday ? Apparently due to one server covering the area. Surely service could be adapted to maximize the capacity of the restaurent at a peak time? With so many newer options fast growing for breakfast in the area, perhaps the management should rethink their hosting set up. Otherwise it won't be long before the regulars find other places as their regular go to.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SGeDZpfPVl83pH-rgAARtA/348s.jpg", "caption": "8 empty tables on a Sunday but 45 minute wait ???"}]}}, {"review": {"des": "Great spot for breakfast. It was super crowded when we got there but only was a 15 min wait. The service was great, our server was super attentive and the food was tasty. The coffee was a bit weak but acceptable. The ambiance was also pretty loud and laid back. I would come back for breakfast here anytime!", "pics": null}}, {"review": {"des": "Let me start with the wait time is atrocious, I'm glad that yelp has the option to put yourself on the waitlist. Doesn't affect my rating, as I'm basing on the food itself.<br>I ordered the chilaquiles, and let me tell you: YUMMMMY! The green sauce has an enjoyable kick to it, more than you think. But, there's also major flavor!  I opted for scrambled eggs on top. And eggs are eggs... I appreciated the Avocado on top.<br>I had an almond milk latte on the side, good... nothing too groundbreaking.<br>The potato cakes, tho... WOW. Just wow. <br><br>Definitely worth the wait. Not too pricey either.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iKk_n_0-N_tcuUcykzSDBg/348s.jpg", "caption": "Chilaquiles w/scrambled eggs"}]}}, {"review": {"des": "This was a nice, trendy breakfast spot. I got the steak & eggs with French toast. Some will say, way too many carbs, but it was delicious. How did I forget the strawberry orange juice?", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2MFZR_d8DIs0xgDnzxc4jQ/348s.jpg", "caption": "Hanging out with family"}]}}, {"review": {"des": "Yolk is a chain restaurant with multiple locations in Chicago and in a few other cities. Forget it Pittsburgh we aren't one of them. My husband and I walked over here for breakfast since we were getting ready to go home. The address given is actually a parking lot! Fortunately for us there were some ladies headed to this restaurant so we turned the corner and followed them. It is actually located on the corner East Grand and McClung court.<br><br>Since we arrived shortly after it opened seating was not a problem. Outdoor seating is available. There is a grab and go cafe where you pay at the register. The same is true with your check. There is a also a small gift area where you can buy a cookbook about eggs. We had only one waiter and he seemed to be handling a number of tables at the same time. When he came to our table I asked him about the address confusion. He explained to me that the address is correct. The building that houses Yolk encompasses the entire block so as a point of reference for anyone reading this review please head over to the corner of East Grand and McClung Court and you will have no problem.<br><br>The menu is very extensive and if you are so inclined they offer red velvet pancakes on the menu. Since it was named Yolk I thought that eggs would be my best option. You had a choice of one of their premade omelets or make your own. I was blown away by the fact that these omelets contain 5 mind you 5 eggs in them. I asked if I could have less eggs in the make your own and was told that I couldn't. I ordered the California omelet that was made up of mostly veggies and cheese with a dolup of sour cream on top. It comes with a choice of seasoned potatoes or cheese grits. It also comes with your choice or toast, pancakes, or English muffin. My husband opted for the salmon platter which came with a bagel. They do offer 3 eggs on scrambled egg platters. You can also get your traditional style eggs as well along with crepes and other breakfast fare.<br><br>I ordered coffee to drink and the size of my cup seemed no larger than the ones I had in NY's chain Maison Kaiser. Got plenty of free refills. We got our food fairly quickly and believe me that was the biggest omelet I had ever seen. It was indeed very good. I loved the vegetable and cheese-very tasty! The waiter served me ketchup for my potatoes without my even asking. The only thing was that my rye toast wasn't cut up. It was served as two whole bread slices. My husband enjoyed his salmon and bagel and finished long before me. As a matter of fact the waiter came by and wanted to box my omelet up. I knew there would be no way to keep it on the long drive home so I decided to finish it and call it my meal for the day.<br><br>It was indeed a filling breakfast but I was very pleased with it. Let me alert you to the fact that most items run between $13.00-$20.00 but for me it's better than eating at the hotel where you can really get ripped off. Staff was friendly and helpful.<br><br>As I mentioned you must pay at the register but since it was early we had no line. Believe me this place is popular and gets crowded quickly. So if you are a morning person you can get in and out with no trouble at all.I should also note this place does not offer egg substitutes so if you have health issues then please be aware of that fact.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bzb75crcy3mhywWwE_ACcA/348s.jpg", "caption": "From the cafe"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VPw_Ai5b4quuNNLxtgxoiQ/168s.jpg", "caption": "The heart of my omelette with sour cream"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WKuChZp1cqTPlkUj1UQehA/168s.jpg", "caption": "5 egg California veggies omelet with home fries and toast"}]}}, {"review": {"des": "I LOVED this place. It was within walking distance of where I was staying and it was so good. Ma and Pa like food, which is the best. <br><br>Thanks again for the awesome meal<br><br>Aaron Wernli", "pics": null}}, {"review": {"des": "I have now been to yolk several times. I want to love this place as the decor is fun and inviting. The service also isn't that bad either. However the food is seriously lacking - it is possible to make bland breakfast and brunch food. I have tried something different every time and walk away with the same feeling - underwhelmed. Yolk you have crazy popularity but you may want to rethink your food before others feel the same way.", "pics": null}}, {"review": {"des": "Landed in Chicago after an 8 hour flight, hungry for a hearty breakfast to fuel the rest of our day we found a great restaurant in Yolk. We were pretty early around 7:30 am so no crowd and seated right away. We ended ordering the Green Eggs and Ham, Chicken 'n' Waffles, and Benedict Caprese to share amongst the three of us. <br><br>Food: Food hit the table and every dish was very good, plentiful portion, and tasty. The Cheezy grits served with the Green Eggs and Ham was loaded with cheese, rich, creamy, and just warmed the tummy. The eggs scrambled with pesto was just the right proportion to not have the pesto overpower the dish. The Chicken and Waffles were excellent with the chicken very tender and moist without being greasy. The waffles was infused with bacon and combination of sweet, smoky, and savory made for a very balanced dish. The Benedict was also one of the best we've had in a long time! They also have their own line of hot sauces on the table..the spiciest version did have some kick so test before you douse!<br><br>Service: While the restaurant was still pretty empty while we were there our server was very attentive and lively for early in the morning. She took time to explain the different menu options as well as offer up suggestions as to what was most popular.<br><br>Atmosphere: Clean, bright, airy, just what I want to get that extra jolt of energy to start my day! Loved the bright interior color and design as it's conducive to starting your day with high energy. <br><br>Value: Not cheap diner prices but the portions are generous and ingredients fresh and of high quality. Great value! <br><br>Overall: Great place to start your day..we visited the Streeterville location on East Ohio Street, if you try to google map the location it's a little confusing as the restaurant entrance is really on the corner of E Grand Ave and Nn McClurg Ct.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pI-D-PjhuDzE1xUAfbM1Lg/348s.jpg", "caption": "Yolk Hot Sauce! Beware the small bottle!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4Bo33W01pUoF2WAlAPrYiQ/168s.jpg", "caption": "Benedict Caprese with Fresh Fruit"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/m8wLz2D4B30Et6GEIbHrEw/168s.jpg", "caption": "Chicken ' N ' Waffles...mmmmmm"}]}}, {"review": {"des": "After carefully looking through yelp for a while for a good breakfast/brunch spot, My boyfriend & I ran across this place. We are usually always looking for the low key hidden gem spots in town when we travel but this place convinced us, just with the pictures & the reviews. The place when you walk in is very vibrant and Given the name \"YOLK\" I figured this spot would be all about eggs, boy was I wrong. This place is amazing a must try when in town!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_8cMmXIpmqGj-xSixAKDdQ/168s.jpg", "caption": "Chicken & Waffles on the right! Turkey triple decker on the left!"}]}}, {"review": {"des": "Had to make a stop here for breakfast since all of my boyfriend's patients always rave about their food! When you walk in, that yellow color is everywhere! It does add a dash of positivity to your day! <br><br>We were seated immediately at 9am on a Saturday morning. Glad that there was no wait! The restaurant have so much to offer in the menu. They have large categories of everything! Many selections of eggs benedict, crepes, your typical breakfast plate, salads, side, etc! <br><br>The section that I found super cool was their sweet singles section! You can be full off a small amount of breakfast goodies! Instead of getting 3 French toast, you can get one and maybe order a bunch of sides. Take advantage of the opportunity to eat more things! I got 1 single red velvet French toast and a side of corned beef hash. Red velvet French toast is definitely a must try if you've never had it! The middle of the French toast was filled with this rich cream cheese filling! The corned beef hash was good! The potatoes were not as crispy as I would usually like it but it'll do!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3SVu0SiHxOt0m73mbFhdWg/168s.jpg", "caption": "Red Velvet French Toast"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/oD_nXhDPTNjR8jZwmBjCLw/168s.jpg", "caption": "Corned Beef Hash"}]}}, {"review": {"des": "Tables were sticky. Bathroom was not clean. Long lines and food not worth the wait. Everything was so so. Our server was nice and attentive. That's about it. I wouldn't return if in the area. Nothing about our meal was remarkable or memorable.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Tly2LQx5tCQxvMlwbH-wXQ/348s.jpg", "caption": "Chicken and French fries"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Pl5pw8A5Bu7hFbtzdb_F2w/168s.jpg", "caption": "Happy cakes"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9bi1FhxA-QWfnTqEJetjdQ/168s.jpg", "caption": "Omlette with Swiss."}]}}, {"review": {"des": "A bustling breakfast spot serving large portions of classic and not so classic breakfast chow in the Streeterville residential neighborhood.<br><br>We arrived just before 9 on a Saturday and this place was already packed and there were dozens of people hanging around outside waiting. We checked in anyway any were told 20-30 minutes for table for 4.<br><br>We were called to our table closer to 20 minutes and were seated at a nice quieter spot along the window.  They've got a big menu (with big portions to match) and it took some time to decided.  Our group tried a bunch of items including eggs Benedict, skillet meal with eggs+pancakes, crepes with fresh strawberries and one got oatmeal.<br><br>As mentioned above, PORTIONS ARE HUGE and each of the entries could have easily served two.  This place must go through a ton of carry out boxes.<br><br>Food quality overall was good, although it took longer than I thought to get the food once we ordered, but they were super busy.  Service overall was ok, but not outstanding so don't come here if you are in a hurry.", "pics": null}}, {"review": {"des": "Trendy place<br>Good food and service but a little pricey <br>Staff is as very pleasant and attentive to your needs<br>Got the egg sandwich which was just enough for a filling breakfast", "pics": null}}, {"review": {"des": "I'd give it a 4, if they didn't always mess up my order!<br><br>Pros:<br>- Consistent<br>- Great biscuits & gravy and country skillet<br><br>Cons:<br>- Generally very busy, unless you come closer to closing or on a weekday. Expect a wait on weekends <br>- Always missing ingredients from the country skillet. The last time, they completely omitted the potatoes (basis of dish). So, all I had was sausage with veggies and gravy? Ew<br>- Because they're always messing up the order, never try to order carry-out! They've messed up every single carry-out order. <br><br>---<br> - Great city brunch place. If you can venture out, try Walker Brothers", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dT4RtQdZ53e55JxNrALnEA/348s.jpg", "caption": "some omelet"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/knVkkBwMdIVznb0e33chQw/168s.jpg", "caption": "... Countryside Skillet to-go. as you can seem missing ALL the veggies and fixings! awful"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FbB6gPwI2EqhFya0MurMyA/168s.jpg", "caption": "cute carry-out bag. doesn't make up for always messing up orders!"}]}}, {"review": {"des": "Yeah Yolk is good. For me it wasn't much different from a Denny's, but other people at my table ordered more interesting meals and they were really happy with food.  If you happen to be in the area and looking for breakfast or brunch, you can't go wrong with Yolk.", "pics": null}}, {"review": {"des": "Amazing food and very good service! The environment is enjoyable outside! My baby, husband and me love it", "pics": null}}, {"review": {"des": "It was okay. St. Patty's day was nuts for many reasons, but probably because Yolk serves a popular cornbeef dish and a playful Green Eggs and Ham dish. The service was pretty good and relatively friendly, given the craze on such a busy day.<br><br>But it was just the food that didn't really impress us. My partner got a breakfast burrito (they call it a breakfast wrap). It had eggs, cheese, and a few other things, but it was under-seasoned, even with the sour cream and green salsa (just tased like green salsa from a jar at any grocery store).<br><br>I got the cinnamon roll french toast. It wasn't warm, which I can see is probably because of timing with all the orders in the restaurant. It's served with three cinnamon rolls, one is frosted and not fried (the frosting had powdered sugar dusted on it haha) and two pieces were fried french-toast style. The flavor was okay, but it's already such a sweet dish that perhaps something to balance out the sweetness, like tart apples really would've helped balance things out. I also ordered a side of sausage, but was brought bacon - which is just getting nit-picky at this point - which was still pretty good. <br><br>Just overall, not sure how much to attribute to the crazy day, but it's not worth getting back to any time soon for us.", "pics": null}}, {"review": {"des": "This place was sub-par for a lover of a good brunch. The place was very crowded, which was typical for a Sunday brunch. I got the the pot roast Benedict with the side of cheesy grits, the post roast was tasty, but it made the English muffin soggy which for me I like a crunchy/toasty English muffin on my Benedicts. The cheesy grits didn't have much flavor, I had to add salt and pepper to it cause it was verrry bland. Although, the sante fe frittata has tons of flavors and was a bit on the spicy side with the jalapeños. What I do love about this place was their signature hot sauce and habanero sauce!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_rMhaESqf7ir-mUcYs4Kdw/168s.jpg", "caption": "Sante Fe Frittata"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RRRyACs01pjFXPOLV_IjvQ/168s.jpg", "caption": "Pot roast Benedict"}]}}, {"review": {"des": "This place was fun. We decided to come for breakfast before our road trip up to Wisconsin and we didn't have reservations but we went around 8:30 a.m. and there were a lot of open tables. Definitely a relief. The waitress was OK, not too friendly, but nice enough. I ordered the potato pancakes, and they were yummy. I enjoyed the coffee although my other guests did not; also do not expect any espresso drinks, plain old joe is what you'll get. There were SO many options of what to order! From red velvet french toast to veggie omelets. My guests had a few tweaks they wanted to make to the menu and the restaurant was accommodating. <br><br>I will say this is a fun breakfast place, VERY much casual. If you  want  a tasty meal without frills, this is your place, Chicago.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/h7FUxIeGEgiOSgU_qu0N9A/348s.jpg", "caption": "more veggie omelet"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Cf3qLj_JK6IzvjFQoW6log/168s.jpg", "caption": "Veggie omelet"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/T2xQABkwsi9_U-ThRd48qA/168s.jpg", "caption": "Tomato Moz Benedict"}]}}, {"review": {"des": "For a chain Yokes is outstanding. The menu has a large variety of options from traditional dishes to Mexican style breakfast favorites. Service is top notch. Their house coffee is delicious. This please is very busy but worth the wait. Price is fare for the large portions served.", "pics": null}}, {"review": {"des": "Great service and food! <br>We joined the waiting list via Yelp and was served right away when we arrived at the restaurant. <br><br>Omelette tastes good. I ordered California. It tasted light (not like those greasy ones) would visit again next time when I visit Chicago.", "pics": null}}, {"review": {"des": "Really great place for brunch! I went on a Sunday morning and it was super packed but I think the staff did a great job at turning tables. I was told 45 mins to an hour wait, and was waiting for maybe 20 minutes. The food came out quickly and everything was delicious! No complaints!", "pics": null}}, {"review": {"des": "I'm a big fan of breakfast, there's something about eggs and coffee that starts the day just right. We tried to go to Yolk Sunday morning but the wait was over an hour, we decided that it was best to come the next day where it will be less busy and the service will be greater.<br><br>The menu is very extensive and after a while reading through the options it's very repetitive. I decided to get the chicken and waffles to try something new with a cup of coffee. <br><br>I don't know where to begin; IHOP has better breakfast and coffee than here. I would have to say this coffee was worse than Burger King's coffee, surprisingly they sell the coffee beans here. My chicken and waffles were a sad sight to see, it was breaded more than there was chicken. The waffle tasted as if it was frozen and just heated and the syrup had a dry top and after pouring it over my waffle it smelled and tasted old.<br><br>The service was ok; the waitress was more into the fact that we were New Yorkers than actually recommending a decent plate.<br><br>We couldn't believe that there was a long wait for this place, their food was mediocre and I do not recommend it.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bym8r3mCPqoxhLUPRct0bQ/348s.jpg", "caption": "A very sad chicken and waffles"}]}}, {"review": {"des": "Delicious - can I eat here for breakfast, lunch and dinner?<br><br>For 2 people:<br>Strawberry orange juice - yaaaaaa<br>Coffee<br>Cinna roll french toast - not an \"american-sized\" portion, but it was the perfect amount. Really good<br>Make your own skillet (tomatoes, spinach, caramelized onions, feta) - um, yes, so gooooood and so big. <br><br>Service was great. If I'm ever back in Chicago, I'll be at Yolk <br><br>UPDATE:<br>Came back 2 days later...still so good", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PwN4jjbLHJWlPx2OPSxUQw/348s.jpg", "caption": "Pancakes (2)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/x-bp3DFhi9xCJ0kCrnMrZQ/168s.jpg", "caption": "Scrambler"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mcEKb_vQ5bND-Ffe8c3sBQ/168s.jpg", "caption": "Smoked Salmon Platter"}]}}, {"review": {"des": "This review is mostly for juvy who gave us a great experience even though our food was made incorrectly  a few times. What a wonderful server and nice person. Who cares if the foods wrong when someone is so nice and sweet about it. <br><br>He adjusted our bill and apologized and did everything he could to make our experience nice. Our bill was $13,  I tipped $20.", "pics": null}}, {"review": {"des": "Good food at good price. <br>I also like the decor, the color and everything. <br>Ate there twice and denjoyed both times", "pics": null}}, {"review": {"des": "I used to live right across from here and I'd always see lines of people waiting to come in for weekend brunch. I've had the food a couple of times and I  was never too impressed. It's ok but It certainly was not worth the line. I would call it a glorified Denny's but slightly better. The prices are kind of steep for the food you're getting. It's simple breakfast food not a steakhouse. We were going to go here again but we found out that they changed the portion size of the smoked salmon bagel dish. Apparently they made it even smaller but kept the high price tag. We decided against it. Overall the food is just ok. The long wait and the prices and portions make it undesirable for me.", "pics": null}}, {"review": {"des": "Mixed review here. I was a fan of the huge serving sizes and how quick the service was! However, the food was underwhelming. We came in a party of 4 and sampled a bunch of items. <br><br>-The pot roast Benedict is as amazing as it sounds, I 100% recommend ordering this. But that's really the only item that stood out. <br>-Biscuits and gravy: nice big serving size, gravy was good, nice hangover option :)<br>-We also tried a bunch of different pancake flavors, which was ok. Our waitress recommended a Hawaiian-style pancake, which had ham and pineapple cooked into the pancake, but it turned out honestly to taste pretty nasty lol... must have been the ham<br>-Sides were average. Cheesy grits was overwhelmingly cheesy. Potatoes weren't cooked great.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7ovFdrY4KuXXaeDQwcu6Bg/348s.jpg", "caption": "Pot roast Benedict - as good as it sounds"}]}}, {"review": {"des": "Came for brunch on a Saturday around 1 pm and we used the Waitlist option. It was super easy and convenient. We were able to do that in the comfort of our apartment and leave when it was time. When we arrived, and they said our table would be ready in 5 min. I wish all restaurants would use Waitlist. <br><br>I got the Smoked Salmon Platter. I thought it was going to be a salmon burger, but it was more of a build your own bagel type of plate. There was so much salmon! Way more than my bagel (choose from original or everything bagel) could handle so towards the end I was just eating salmon and lettuce. It was slightly salty, but nothing you can't balance with the tomatoes. Although more tomato slices would've been nice too. Capers were a nice touch too. This is a great dish for the salmon lover. The portions here are huge. <br><br>The waitress was really attentive when we first sat down and received our meals. It would be nice if she came halfway to see if we needed more coffee. Otherwise, she was great. Even offered fresh coffee in a travel cup.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1iMvQVHBMvJj3z0-Z0aceg/348s.jpg", "caption": "Smoked Salmon Platter"}]}}, {"review": {"des": "This Yolk place is no joke!!  We went on a Friday morning and it was packed. We were seated quickly and our waiter was on on time. I was undecided between the red velvet French toast and omelette. I want to have both . The waiter helped me decide and that was swapping my toast for my omelette for the red velvet French toast. I was in haven. Great breakfast place . Must try if you are in Chicago downtown.", "pics": null}}, {"review": {"des": "Was in town for a few days and some friends suggested Yolk for a nice brunch. All in all, a great choice. It was a crowded Sunday morning but the wait wasn't bad. One note: it's easy to order a lot of food! For example, I had the Kale Scrambler and decided to add pancakes. Now mind you, I was thinking small side pancakes but they were huge! Let's just say that was my main meal of the day.  Good food and service. I'd visit again when in town.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IRKZ4Z0vNFR2Smgyq7xVPw/348s.jpg", "caption": "Monthly special... Cinnamon Toast Crunch inspired pancakes!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LChDEhHZyWxF5hFFzplHWA/168s.jpg", "caption": "Kale Scrambler with a side of potatoes."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Dfssn7BmiiGyfMy0XfQIpw/168s.jpg", "caption": "Blueberry and banana pancakes"}]}}, {"review": {"des": "We came in after reading all the great reviews on yelp and we were not disappointed. They were very busy but the service was great as was the food. I had the breakfast wrap that was delicious and my daughter had the bacon waffles, super yummy! Everything tasted fresh and the coffee was great too!", "pics": null}}, {"review": {"des": "Yolk was a spontaneous pick (I happened to stumble upon it the day before and thought it was a nifty spot) and it so happened to make it into my list of favorite breakfast spots, so lucky me!<br><br>I highly, highly suggest putting yourself on the waitlist (Yelp allows you to do so) before going because you might have to sit out in the uncomfortable heat/cold for a while if you neglect doing so. There are multiple locations too, so if you find that the wait is too long at one location, it might not be so long in the other. Try and get there with a couple of minutes of wait to spare, just because the waitlist shown on Yelp might not be exactly correct.<br><br>Now that I've got the serious out of the way, it's time I acknowledge the pièce de résistance: THE FOOD. I shared the smoked salmon scrambler and red velvet french toast with my Dad, and both did not disappoint. The scrambler comes with grits and the option of toast, pancakes, or an english muffin. We opted for the pancakes...and wow, it ended up being a LOT. The scrambler was pretty good; I didn't expect that cream cheese would go so well with scrambled eggs, but it did. The pancakes were a tad bit on the unfluffy and dry side, but the latter could easily be solved with a bit of butter. The grits was also EXCEPTIONAL. The cheese was blended in well and the overall consistency was nice & smooth. I'm from the Northeast, so I can easily say these were some of the best grits I've ever had, but I'd take my ranking with a grain of salt knowing that I'm from the land of no-grits.<br><br>It didn't hit me that the red velvet french toast was slices of actual cake dipped in an eggy batter. It's REALLY good but REALLY difficult to even make a dent in! There are four slices and, with the addition of the egg, the meal becomes really dense. The cream cheese frosting puts the dish a little bit over the top in terms of sweetness, but it's amazing overall. <br><br>Servings are huge. Beware.<br><br>I should also note that the server was really hospitable and the outdoor seating has a good amount of shade, so it's nice on a warm day. <br><br>Goodness, I could keep going on and on about Yolk...", "pics": null}}, {"review": {"des": "I love this brunch place. I've eaten here a bunch of times. Anytime I'm around I come in. I usually get pancakes. They have yummy takes. Peanut butter and banana. This time I ordered the special - lemon ricotta pancakes with blueberries. Oh dear lord they were devine. I've had other savory items off the menu and enjoyed them. The strawberry orange juice is amazing.", "pics": null}}, {"review": {"des": "Went here for breakfast during the week (on a Friday I believe). Got a seat by the counter right away, a waiter came and took my order when I was ready, and came over several times and refilled my water and she kept asking me if everything was good, if I needed anything and so forth. <br><br>The Crepes I got were so good! Lots of chocolate chips and they tasted great! Been at Yolk a few other times as well now :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jdYodidOPEYZvWZPOeEDeQ/348s.jpg", "caption": "My crepes with Chocolate chips. They were good!"}]}}, {"review": {"des": "I know nothing about grits, but if you ask me this place has the best cheesy grits I've ever had! Their raspberry lemonade is delicious as well.  I had one of the scramblers and it was pretty scrambly!  I recommend this for a breakfast spot.", "pics": null}}]}