{"name": "yuzu-sushi-and-robata-grill-chicago", "reviews": [{"review": {"des": "A must for great sushi and BYOB in Chicago!!<br>I really loved it here. BYOB and amazing sushi? Yes please.<br>I decided to check this place out due to the many positive yelp reviews and of course the really cool decorative designs on the plates in the photos others have posted. Our server was very friendly and gave us recommendations when we had a hard time choosing between the many appealing rolls. Since we can get basic rolls anywhere, my fiancé and I decided to stick with the jumbo special rolls. We ordered a few but my favorites were the breaking bad roll and the #thuglife2. <br>It was just great quality sushi. Very fresh with unique flavor combinations. I especially loved all of the yummy additions on top of the rolls. And it's an added bonus that they create fun designs with various colored sauces on the plate. It really makes for a fun experience. Little details like that really set this place apart from other sushi restaurants in the city. It's a small space and pretty packed so definitely make a reservation just incase. The service was speedy but we didn't feel rushed. We will definitely be back!!<br><br>**Sorry my photos aren't great, it's pretty dark in there!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NhZ8Cpucn0myYTM41UCl7g/168s.jpg", "caption": "Breaking bad roll"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ziIZ5iAZNOHeCps7qYxX3Q/168s.jpg", "caption": "#Thuglife2 roll"}]}}, {"review": {"des": "I kept seeing Yuzu Sushi all over my Instagram feed and the pictures were absolutely mesmerizing. I couldn't believe the art that could be made just for sushi!<br>It was pretty hard finding a table for four online and ended up booking two weeks in advance. It was cold out and everyone was huddled in the tiny vestibule entrance. Their host table was so small, and it was a hassle walking past people to get our table. All the tables are so close to each other that you could hear everyone's conversation - they clearly want to serve as many people as possible but they don't care if people are uncomfortable. <br>Looking at the menu, it was hard to decide what to pick. We were pressured to order a minute after sitting down. Who am I kidding - we were rushed the entire 45 minutes we were there. IT WAS BRUTAL. My better half stated he needed a second to look at the menu and she said \"can you please order now, can you please order now?\" I looked at her in disgust and thought wow is this real life? What kind of customer service is this.. We went to the bar across the street for drinks right after and I was able to breathe my own air again.<br>I'm also pretty sure that they were past capacity that night and heaven forbid a fire or something broke out we'd all die.<br>It's an instagrammable place - but not worth it one bit. Would never come again.", "pics": null}}, {"review": {"des": "This place is awesome. I guarantee the experience will be like nothing you've ever seen before. Yes, this place is hyped, but I think it's worth it. The sushi is totally insta worthy, but actually tastes dang good too. Pro tip- these rolls are HUGE- you only need one per person! You will actually leave feeling FULL, something I've never experienced at a sushi restaurant. All their apps are great too, like the shrimp bites and tator tots. I could see some people thinking this place is \"butchering sushi\" or whatever but you just need to keep a very open mind.<br><br>Dropped a star because of the service-it's a small restaurant (almost always packed though) and somehow my waitress paid no attention to me last time I was there. Had to literally get out of my seat and flag her down. Unacceptable. Besides that, great place- your out of town friends and family will go crazy for it.", "pics": null}}, {"review": {"des": "Fun place that seems to be a crowd pleaser because of their beautifully presented insta-worthy sushi plates with colorful sauces (I think it's colored mayo and eel sauce). <br><br>Sushi Gold comes with HUGE, good quality pieces of nigiri and one roll which was alright. Their jumbo sushi rolls are quite filling as well. Me being a exclusive tempura fan ordered the Chicago spring roll which was light, crunchy and delicious. <br><br>Service was quick and our server was guiding us well<br><br>Ambiance is chill with some fun anime characters adoring the wall. <br><br>Overall one of the good sushi places in town.", "pics": null}}, {"review": {"des": "5/5 for sure for its creativity in designing the sushi platters and also, making the food delicious. It's a MUST visit place in Chicago. We were here for lunch. Ordered some tuna poke which was super fresh and delicious. Then had some satays I think of chicken, pork and salmon.. they were superb! Everything here was superb.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iQEKSRL4TaaZbiGwMy1LzQ/348s.jpg", "caption": "Breaking bad & girl something"}]}}, {"review": {"des": "Yuzu provides a feast to your eyes, taste buds and your tummy!<br><br>Was definitely attracted to visit this joint because of the ridiculously beautiful platings, but am super happy that they matched the design with wonderfully fresh ingredients, textures, and explosion of flavors in the decorated sauce. <br><br>We ordered three yuzu jumbo sushi rolls, each costing around $17-19. Each came with different toppings, \"Dragonball\" had unagi, \"Summer Breeze & Ocean\" had seared ika (cuttlefish), and \"Born to Chill\" had salmon on top, but inside contains generous fillings as well. Therefore, with generous and fresh ingredients both inside and on top, the price is justified, not to mention the artistic touch! <br><br>Our favorite of the day was definitely \"Summer Breeze & Ocean.\" The seared ika was absolutely divine. This must be absolutely fresh otherwise it would be soft and flat rather than firm and springy as it should be. Moreover, the ika was perfectly seared, with delicious tuna, creamy avocado, scallion and fried shallots inside provided it with a multiple layer of textures. Matched with the Thai seafood sauce, it was totally rocking!<br><br>The Dragonball was no slouch too, and the design was the bomb! Absolutely eye catching and equally delicious. With salmon and shrimp tempura, matched with avocado, sweet soy sauce, and wasabi mayo, this is a loaded roll. The decorated sauce provides it with a further punch, the colors provides creaminess, spiciness and sweetness, hence a dragonball each mouthful!<br><br>Thanks for the great experience. Will definitely return, recommend friends and bring all out of town friends to boast Chicago's unique sushi joint!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rWm3eD_FT_AwxluH7Ua9oQ/168s.jpg", "caption": "Born to Chill"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DiJjPNuRQWwwI0L8GJSWpg/168s.jpg", "caption": "Born to Chill"}]}}, {"review": {"des": "Ok I'm horrible at taking beautiful pictures of food. It's not one of my talents. Yuzu is packed and thriving and the food is great. <br><br>We had a large group and I would recommend that you make a reservation!! There was another group who went and had to wait 3 hours (they actually waited) until they got a seat. <br><br>The sushi is good, it's different and fancy. They also had takoyaki, which are fried octopus balls. They're gushy and delicious and warm and everything.", "pics": null}}, {"review": {"des": "Hands down, the best sushi place in chicago.  If you've checked out the other Yelp reviews you now know that this is an awesome insta foodie opportunity.  As an added bonus is, it's also super delicious. You literally cant go wrong with any of the jumbo rolls, but please make sure you get the chicago roll..  it's awesome.<br><br>The service could use a little work, our waitress seemed annoyed with us asking her opinions on the rolls and repeatedly asked us \"if we were ready\" (with an undertone of hurry up). That being said, the foods worth it.", "pics": null}}, {"review": {"des": "Yuzu has been popular on the gram for its elaborate artistic design and plating. The taste of the rolls itself is great, the fish is fresh, the rice perfectly cooked and just the right temperature. Unfortunately, my one big complaint is the artistic rolls are all 'jumbo' rolls which are way too big in size. Each piece is too big to eat in a bite and sushi is meant to be eaten one piece as a whole! I would still come back here, but I'm not sure if I'd want to take a jumbo roll again.", "pics": null}}, {"review": {"des": "We came here for lunch. We didn't have any reservations but got lucky to get a table quickly. It got packed really quick. This place has really tasteful sushi. Just look at the appealing designs on the photos! It makes you want to order everything so you can see the various intricate designs they do with the different sauces. <br><br>We also ordered the teriyaki salmon and tonkatsu ramen. I personally did not eat any of the salmon so I can't speak about it. The ramen was good, it comes with two hard boiled eggs and 3-4 pieces of pork. I don't think that is the norm in other ramen places because usually you'd get 1-2 measly servings of the meat. The ramen had rich umami broth, and I am telling you it's a plus that it came with heavy servings of protein!<br><br>The bus stop is in front of the restaurant if you're thinking of taking public transportation. If not, there are plenty of paid to park street parking.", "pics": null}}, {"review": {"des": "Possibly one of the greatest gems in Chicago. BYOB, beautiful and delicious dishes, friendly workers, and have never been disappointed. <br>Weekends be prepared for a wait, but there is a bar across the street while you await your table. Noise can be loud, but the food is so good, you won't be talking much. Chicago Roll is always our go-to!", "pics": null}}, {"review": {"des": "We had reservations on a Friday night for a friends birthday. Good thing we made reservations because the place is small and there was a long wait. We were seated within 10 minutes of our party arriving. The table was really small but we made do with what they had. We ordered a variety of items but my favorite was the udon noodle and the motown effect roll. <br><br>The udon noodle dish was a soup with teriyaki chicken. The broth for the soup tasted like a combination of a miso and teriyaki, it was quite delicious. The udon noodles were perfectly cooked, soft but not mushy.<br><br>The sushi rolls come out on wooden boards with extravagant designs. They are what you'd call instagramable. My favorite, The motown effect roll, was about 10 large pieces. I usually don't like rolls with a tempura coating or that are fried but this was a very light coating. The crunchy tempura and the soft rice were a delightful combination. The sushi itself was really fresh and plentiful in the roll.<br><br>Overall it's a really good sushi place but really small and packed. I'd recommend checking it out on a weekday when its a little less busy and you're not seated so close to the party next to you.", "pics": null}}, {"review": {"des": "Excellent sushi. Great service. Lots of options for vegetarians or meat lovers. They really do a great job with the sushi presentation and probably the best I've seen in Chicago. Seating is not the most comfortable. Restaurant is very clean. Location is great. <br><br>All in all a good experience. <br>See my pics for more details.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9quGjzfiPlnITGShUrG2eQ/168s.jpg", "caption": "Taters"}]}}, {"review": {"des": "very very impressed! I was surprised to be able to find such a unique sushi spot in Chicago! came to visit for the weekend to explore as well as celebrate a late birthday dinner with my friend. the ambiance was really nice and the waitresses were pretty attentive. food was beyond presentable and the rolls were quite big! <br><br>we got the mango avocado salad. i usually don't like fruit on salads, but it was really light and refreshing <br><br>toasted coconut, unagi, and shrimp tempura roll. it was to die for. i've never seen a follow unique with toasted coconut on top, so i had to order it! very good.<br><br>boy meets world. it's spicy tuna inside. (it was okay to me). smaller roll, even though it was claimed to be a jumbo roll. but it was still good!! the design on the plate was pretty! <br><br>overall, what a nice experience!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PIvbEdJXSEdEOQAo4uf99Q/348s.jpg", "caption": "boy meets world"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Xe-kSSNFDqREtC_zdXNJAQ/168s.jpg", "caption": "mango avocado salad"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1VEbxCEc5vrH1LJasbK3-Q/168s.jpg", "caption": "coconut, shrimp, unagi roll"}]}}, {"review": {"des": "I went for lunch and had the teriyaki salmon bento box.  It was average and I was expecting higher level.  The service was phenomenal and I plan on coming back for dinner to have the artful/ delightful looking sushi preparations.  This will be updated soon.<br><br>Update:  Came back for sushi.  The art is definitely worth the visit.  The quality of the sushi was average.", "pics": null}}, {"review": {"des": "This place is like an art gallery for your palette. Some of the signature Rolls are so intricate and unique. That's what sets Yuzu Sushi & Robata Grill apart. So, what is Yuzu? Pronounced: You-Zoo, it is an Asian fruit that is incredibly fragrant and pungent. It's tart taste sets it part from other fruit.<br><br>This place is casual, trendy, and lively with vibrant and refined food. Perfect for groups of two. Fills up fast due to smaller dining area. Service is up there in best staff experience I have had in Chicago. Our waters were always filled. Empty dishes were cleared right away. Staff was competent and excited to have us. <br><br>Open Sunday-Saturday! Hours 12:00PM- 3:00PM, 5:00PM-10:00PM. The pair of us scurried into Yuzu on Saturday at 2:20PM. We ordered fast to be considerate of the lunch time. The Goyza was average but great. My husband ordered the Bento Sushi (3pcs nigiri or sashimi, 8pcs spicy tuna maki, mixed greens, miso soup). He said the sashimi was very good. I tried some of the miso soup, which I absolutely loved! No shortage of nori or tofu bits. I ordered the Chicago Spring- Jumbo Roll $17 (shrimp tempera, avocado, cream cheese, sweet soy sauce). The presentation of this Roll is the most elaborate, colorful, and unique I have EVER seen. It was good- my favorite? No. The Jumbo Rolls are around $17, and the regular rolls are around $9. <br><br>Great first experience at Yuzu. I would recommend this place for sushi lovers. I am excited to try the menu out!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dHA2kzfiaoZjhfFe0PRrhw/168s.jpg", "caption": "Chicago Spring- Jumbo Roll"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FL4GiMKDL7NRyb3ECoZTxw/168s.jpg", "caption": "Miso Soup, Goyza, and Bento Box"}]}}, {"review": {"des": "The presentation of the sushi is captivating. I had been wanting to come here since a year ago, after reading about it in a couple articles. I was excited when I first stepped in, looking at other people's food. However, we were a bit turned off because we had made a reservation for 4 and three of us were there already, yet they wouldn't seat us. It didn't make sense because our table was just sitting there, not like we were taking anyone else's table. Make it clear that you will not be seated until your full party is present. Their waiting area is also really small so it really wasn't ideal not to seat us. <br><br>Finally seated, we really enjoyed the names of the jumbo rolls and were able to choose one each. I ordered the #thuglife2, while my friends ordered sea smoke, sin nombre, and the riverwalk. What I ordered ended up being my favorite because I love the combination of salmon, avocado, and ikura. There was also salmon skin inside which added a nice crunch to it - it actually came as a surprise to me because of how crunchy it was! I also enjoyed the albacore off the sin nombre. Our party of 4 all wished that there was more yuzu included in the menu. Since the restaurant is called yuzu, we thought there was going to be more yuzu infused into the different menu items and were a bit disappointed when there weren't. The rolls were really good and filling, but were pricier than we would have liked.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2Le5GuuBrcHmhhsE_Cl3Hw/348s.jpg", "caption": "Boy Meets World without tobiko"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/U5pnaAGzM2eNlPAA7S1P9A/168s.jpg", "caption": "Boy Meets World"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lDyVI6Kp9emmZ0kh1Xp6XQ/168s.jpg", "caption": "Dragon Ball"}]}}, {"review": {"des": "My only disappointment with this place is that the specials go quick! It's like instant FOMO when looking at the menu and seeing all the delicious and creative options, then , OH SNAP! They've 86'd that and that :(", "pics": null}}, {"review": {"des": "My group arrived around 5:30 on a Saturday night. We were asked if we had reservations, but we did not. After doing some searching, the hostess was able to find us a table. We were sat near the host stand by the front door and were checked on frequently. The servers knowledge of the menu and explanations were helpful. The presentations of the sushi rolls were very artful. I found the rolls to be tasty and filling. I also had the gyoza and a salad. The music was somewhat loud and made it a little difficult to hold a conversation. The mouthwash in the bathroom should be marked. I mistook it for soap since it's right by the faucet.", "pics": null}}, {"review": {"des": "My favorite place goto spot in Chicago. Great for a girls night and date night!!! The menu has changed since my last visit but they were willing to make some rolls that were no longer on the menu! But be prepared to wait if you go during the weekend :/ However, the food is worth the wait. The ponzu salad is delicious and specialty vegetarian rolls worth it!", "pics": null}}, {"review": {"des": "The sushi art is a lot of fun and well worth a try. I do think it is a bit overpriced and the seating arrangements make me uncomfortable. Its not shared tables, but when they are that close, you might as well make them picnic style and embrace it.", "pics": null}}, {"review": {"des": "This place is great! Its a small, intimate, yet wild atmosphere with great service.  We came for sushi and ended up loving much more! The tator tots, bang bang shrimp, and both rolls we tried were fresh.  Oh and this place is BYOB (they have a $5 corkage fee).  We came for the sauce art on the sushi rolls and were not disappointed. We will definitely be back soon!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0C2U7yRHw_jBK_ATcclXJg/168s.jpg", "caption": "I think this is the Chicago Spring. not sure but 10/10"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ei4KWykUG-dQbjs42TPUJA/168s.jpg", "caption": "Born to chill 10/10"}]}}, {"review": {"des": "I had an amazing experience! Whenever Im on vacation i always spend on food and while I was on chi town this was one of them. Food was decent but quite pricey but its understandable because the sushi rolls were tasty and look at the sushi art they have created. Anime inspired!!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eY4D1Q1zwIVaqzUNkTQpfw/168s.jpg", "caption": "SUSHI"}]}}, {"review": {"des": "Love this place!! Super fun sushi restaurant that's BYOB. The portions are big and the fish is fresh. But the real catch here are the beautiful sushi artwork. They create art out of sauce and it adds a fun new element to dining. This place is great and gets my seal of approval!", "pics": null}}, {"review": {"des": "Some of the best sushi I've had thus far in Chicago. Easy to make reservations and perfect to go with friends, family, or on a date. It's pretty small, but worth any wait you may have to experience. There is an extensive list of decorated rolls, so it's impossible not to find something you like. My boyfriend insists on going back every time he visits. The only thing I can say is I WISH THEY DELIVERED!! Great service, food, atmosphere, etc. The first time I went It was BYOB, but I think they just changed It to just bring your own wine with a cork fee. Yuzu makes It An experience by making elaborate designs with their sauces. The rolls are fresh and garnished in a unique way. 10/10 would recommend and I consider myself a sushi connoisseur!", "pics": null}}, {"review": {"des": "Absolutely loved this place! Their sushi rolls are super tasty and filling, and of course, the presentation is on point! All of the jumbo rolls come with colorful sauce art, which taste good too, so I didn't even need to use any soy sauce. We got the over the rainbow roll and the river walk roll, both of which were really great and filled with lots of fish. The river walk roll has a slight crunch to it, and the over the rainbow has perfect fish to avocado ratio. Next time I want to try the boy meets world roll bc it combines spicy tuna with sweet mango. We came on a Saturday night and had a 30 minute wait for 2 people which wasn't bad, and the service was very quick. Highly recommend trying these beautiful and delish rolls!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/D8wS4T65uZCui-aU82Ykxg/348s.jpg", "caption": "Over the rainbow (front) and river walk (back)"}]}}, {"review": {"des": "Hands down the best sushi I've ever had, will 100% be back next time I'm in Chicago!<br><br>This place was packed even at 8:30 PM (and they close at 10) so I'm glad I made a reservation and would recommend you do as well. We ordered two rolls to share between 2 people, 100 years of solitude and thuglife2, and it was plenty! Food came out insanely quick, even before our drinks did, and we went to town. The rolls are massive so be mindful of how much you order. Had to flag down a waitress once or twice for a water refill but I don't hold it over them for how busy it was. Great spot for some high quality sushi.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UPnajkPPp5gnIHXAGj-gmQ/168s.jpg", "caption": "Thuglife2"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uyL-HFjpf-iyk_Ce2WgcUg/168s.jpg", "caption": "100 years of solitude"}]}}, {"review": {"des": "The sushi here is very fancy and loaded..I was a bit disappointed by the taste. My rolls were BEAUTIFUL but definitely too spicy, it was looking like they were trying to cover the taste of the fish with every possible spice/add ins...I didn't like that.<br><br>I also got some sashimi and that was good, they give you pretty big slices of fish which is nice cause you usually end up paying 4/5$ for a tiny slice of fish.<br>I wouldn't come back, but it was ok to try it for once.", "pics": null}}, {"review": {"des": "For a girl that loves sauces and sushi, this place was a dream come true! Many places, if you order more than one roll, they'll be served on one plate. Here, however, each roll gets its own presentation, which I loved. The presentation of the sauces is the best - so pretty and they taste great! We ordered the sea smoke, thuglife, chicago riverwalk and breaking bad. Sea smoke was my fave - I'd recommend it! They have bento box lunch specials too, which are definitely worth a try. <br><br>Our family also ordered the loaded tots to share, which we really liked! Crispy with great flavors atop!<br><br>I liked the atmosphere of the place and especially the artwork on the walls. It gets busy so make a reservation if you can! Parking on the street isn't too bad either.", "pics": null}}, {"review": {"des": "Amazing sushi with cool art! A couple of my girlfriends and I had a taste for sushi on a Friday night so we decided on Yuzu but did not have a reservation. We decided to walk in and surprisingly we were seated within 10 minutes. I thought we had to wait at least 30 minutes for sure!<br>It is BYO but with a corkage fee. I believe it is $5 for every bottle. <br>This is what we ordered:<br>- #Thuglife2<br>- River Walk<br>- Dragon ball<br>- Chicago Spring<br>- 100 Years of Solitude<br>The jumbo rolls came with the fun presentation but the ordinary rolls did not. The rolls were delicious and huge, it was definitely a challenge to finish them. Each roll had a mouth full of flavor and the raw fishes were definitely fresh. The sushi came out shortly and we did not have to wait long. The waitresses were very attentive and was constantly checking up on us. <br>Definitely would come back and next time we will try their appetizers. <br>Fun fact: there is mouth wash in the bathrooms, so if you're on a date you don't have to worry about the fishy breath!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RLZWPXEcP41XCNAT_Mlh_Q/348s.jpg", "caption": "Dragon"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ot7LfziWDX1wQDIWc9GBKA/168s.jpg", "caption": "#Thuglife2"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/edtSDS6W0PvyV3V7rMR6RA/168s.jpg", "caption": "#Thuglife2"}]}}, {"review": {"des": "On one of my work trips to Chicago, I decide to branch off from having dinner with my coworkers one night and grab sushi by myself. I went to my ALL time favorite sushi spot on a Tuesday at 5:15PM but was sadly turned away because they were fully booked until 8PM. So I pulled up Yelp and found Yuzu bookmarked from my last visit and decided to go there. The restaurant was pack for a Tuesday at 530PM so that was a good sign.<br><br>Here is what I've ordered: <br><br>Salmon To Die For (fatty salmon with yuzu ponzu) $10 - One of the best appetizer! The fatty salmon belly just melts in your mouth. And platting is pretty too! 5/5 stars<br>Scallop Nigiri (per pc) $4 - Scallop was plump but was not fresh. 3/5<br>Ama Ebi (per pc) $6 - Total worth the $6! I should have ordered two of these instead of the scallops. They even fried the head! 5/5<br>Tuna Truffle (2 pcs) $13 - They ran out of the holy hotategai so the waitress recommended this dish instead. It was ok, I couldn't taste the truffle. 2/5<br>Breaking Bad (jumbo roll) - This was a waste of $19! I came for some pretty sauce art but what I got was just a few splatter of unagi sauce. And the roll itself had this sweet and sour sauce drizzle. No, just no. 0/5<br><br>So I totally over ordered but still left unsatisfied. Service was awesome so I bumped up the rating to 3 stars.", "pics": null}}, {"review": {"des": "My fiance just recently started working in the area and he's been wanting to try this spot for a while.  We decided to come here Saturday for dinner and it was pretty busy but they were able to seat us quickly despite no reservations.  <br><br>I will start by saying that I do not eat seafood but there were a few options for me to eat.  My favorite was probably their short rib skewer, but the skewers in general were flavorful.  I also had their udon noodle soup which probably wasn't smart because it was hot out that say and I was sweating so bad.  The soup was pretty salty and came with a side of chicken.  I just wish there was some veggies in the soup other than just broth, seaweed, and noodles.<br><br>My fiance tried their sushi.  The presentation was beautiful. FYI, cause I wish I knew before hand, they are BYOB for a small corkage fee but they do have booze if you don't bring your own.", "pics": null}}, {"review": {"des": "Honestly this place was pretty mediocre. Nothing super special. Yes, the designs were really nice and interesting, but is it really worth the hype?<br><br>The mushrooms were very basic, the ribeye skewer was good, the thug life sushi was average. Although I really liked the boba on top of the kimchi, it was a very unique touch. However, was the sushi amazing? Nahhh. <br><br>It was a cool concept but really not worth it in my opinion. <br><br>I'd go back only because one of my friends really wants to try it, but otherwise I wouldn't. I plan to yelp further to find the best dishes there this time so she doesn't feel as let down by the hype as I feel.", "pics": null}}, {"review": {"des": "This place is amazing! It's a little small and crowded but that doesn't take away from the amazing sushi selection and stunning presentation! <br><br>We went for dinner. The staff was very cordial, friendly and it was my wife's birthday so all of them said happy birthday to my wife one by one as they passed by our table! (After the delicious mochi they gave her) <br><br>Make a reservation first. <br><br>Would recommend!", "pics": null}}, {"review": {"des": "Sushi was delicious and very fresh! Also the spicy miso soup was delicious. Great service and can't wait to go back again!", "pics": null}}, {"review": {"des": "Wonderful service and that sushi *heart eyes*<br><br>I made a reservation for 5 for my mom's birthday on 5/26. Reservations are highly recommended as it was packed the whole time we were there. The space isn't too big, so with a big group it's hard to get tables together unless you get the communal table. <br>There's anime lining the walls and hip hop music playing. It's a nice vibe but it was also loud. It was hard to hear each other across the table. <br><br>Service: the service was outstanding! It was quick despite it being busy. 1) they held our wine bottles while we waited for our table. 2) We were lucky enough to be seated right next to the sushi counter because the waiter could just grab our dirty plates and give us new ones right away. 3) we called ahead of time to ask if we can eat birthday cake for dessert. They accommodated our request! <br><br>Food: <br><br>Tuna poké - A lot of pieces of fatty tuna with avocado. This was delicious! And for $13 the price is worth it. <br><br>Udon boodle soup with Chicken Teriyaki - Pretty salty but I liked the chew of the noodle. The chicken was tasty and had that nice grilled flavor. <br><br>Boston Crunchy and Monster Spider, Dragon Ball, Summer Breeze & Ocean, Over the Rainbow - All of them were good. My favorites were the Monster Spider and Over the Rainbow. The sauces for the jumbo rolls really completed them. Yum! <br><br>Would for sure come back! So worth it!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2ILcakvNJQfGTc6HDJuOKA/348s.jpg", "caption": "Summer breeze and ocean (top) Over the Rainbow (bottom)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rbdy2BS4osqNh9RIdPCSpg/168s.jpg", "caption": "Tuna poké"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qEVJpO0XUIsyjZ9aoq3CPA/168s.jpg", "caption": "Monster spider (bottom)  Boston crunchy (top)"}]}}, {"review": {"des": "Boy o boy! Where do I start?! <br><br>Service is 5/5. <br><br>Food 5/5! <br><br>Ok so here's the break down: <br><br>I have been here twice and with confidence I can say that this place really loves their customers. They treat everyone with respect and even if you don't have a reserved table, they will still try to seat you between reservations. So everyone gets a chance to eat at Yuzu. <br><br>The food though?! Okay, this is me raving about the nigiri. Because guess what, this is the hands down, BEST place to get nigiri!!<br>Rice is sweet with a slight rice vinegar taste. The fish they put onto the rice is very generous!  Of course then, between the rice and fish is the wasabi paste. This step is vital because that little punch of wasabi elevates the flavor. <br>This is how the authentic Japanese make their nigiri. <br><br>So... pretty much every nigiri we tried was amazing! So I suggest all of them. <br><br>Yo the Uni shots were bombbb! The uni I believe they have is Japanese Uni. It was the most creamiest uni I've ever eaten. No bitterness, all cream. I was mind blown honestly. And had an Umami moment, of course. <br><br>We had their skewers which by the way are fantastic. But the short rib is my fav. <br><br>All in all, this is the place I would 100% recommend to anyone visiting Chicago.", "pics": null}}, {"review": {"des": "This was the first sushi place I tried in Chicago, a few years ago before we lived here. It is still the gold standard for me. Trendy, but not upscale, Yuzu is a hip spot with unique styles of sushi served up with incredible designs and flavor. Make sure you make reservations or get there early!", "pics": null}}, {"review": {"des": "Second time in for carry out.  We've tried several other sushi places in the area, and this confirmed that Yuzu is the best we've had so far.  Why?<br>1. Very fresh, high quality seafood - and lots of it.  (Example: the very spicy tuna roll is mostly tuna with a tiny bit of spicy mayo, not the other way around like you find at other places)<br>2. Good value for the price.  Yes, you may be spending $60 for 4 rolls, but you'll be stuffed when you're done.<br>3. Lots of variety.  Plenty of unique combinations with bold flavors, not just a bunch of rolls with cream cheese and deep fried to peddle to people who don't like sushi.<br><br>My one complaint:  many of the signature (highest price) rolls are bigger than normal rolls -- meaning bigger diameter and therefore hard to eat.  Yuzu team, can you make them a more typical size?", "pics": null}}, {"review": {"des": "Dont understand the hype around this place. The sushi is probably one of the worst tasting in chicago. The wait for a table was over 40 minutes when the hostess quoted us 20. There are a lot of sushi places that you can go to in Chicago that will be worth your time and $.", "pics": null}}, {"review": {"des": "One of my favorite sushi restaurant in Chitown.<br>Food: love that they have a variety of japanese food selections: japanese bbq, sushi rolls, udon noddle and teriyaki. We ordered tuna poke bowl for appetizer: tons of soy sauce flavored tuna and avocado, highly recommend! Also loved their bbq skewer combo (chicken, pork and beef) love beef the best! Didn't really enjoy the sweet sauce in the pork skewers tho. Sushi roll is fresh and flavorful! The plate decoration def distinguished them from other sushi restaurants! You can just dip the rolls on their sauce art in the side of the plate! Loved it!<br><br>Service: friendly and attentive. Food was served pretty fast!<br><br>Atmosphere: love the japanese cartoon arts on the wall!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UAK5xolf-aKJxPJN4pMvdg/168s.jpg", "caption": "Tuna poke"}]}}, {"review": {"des": "This place has great food and service. I went in while visiting last week and for lunch it wasn't crowded and the service was fast and of great quality. <br>We had a salmon bento box, a sushi bento box and a dragon roll. Everything we had was amazing, there are times where quality of the food is sacrificed when there's amazing presentation and this was not the case at Yuzu. <br>I would highly recommend this place and will definitely b back. <br><br>Only thing I would note, is that right now there is construction in that area so finding parking is almost impossible", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/m2VDIoWWfT1dZMhtLKU0nQ/168s.jpg", "caption": "Sushi Bento box and Dragon Roll"}]}}, {"review": {"des": "**Vegetarian Friendly**<br><br>First, BYOB! Who doesn't love that?! There is a quantity limit per person, so double check their website beforehand. (No hard liquor allowed.)<br><br>Sushi is typically not my first choice of cuisine, but I really enjoyed the food here!! They have a handful of veggie friendly appetizer, sushi rolls, and skewers. They plate everything so beautifully that you almost don't want to eat it. <br><br>The Avocado Mango Salad has a great sweet and savory balance, but the real showstopper is the salad dressing that tied the entire salad together. The Green Harbor Jumbo Roll was also delicious, and didn't feel as \"sushi-y.\"  <br><br>The Yuzu Bombs are sake bombs, and they make their sake in-house. It was much smoother than traditional sake, that made it quite enjoyable. <br><br>Great atmosphere for date night, or just a night out with friends. I'll be back!<br><br>PS: 7% Cash back with Yelp!", "pics": null}}, {"review": {"des": "Yuzu is my favorite sushi place in Chicago so far. The sushi is beautiful, and they're like works of art, so aesthetically pleasing and creative. My sister had seen a video about this place, specifically the jumbo rolls, and wanted to try it when she came to visit. I'm so glad she did, because Yuzu wouldn't have been on my radar without her. <br><br>We got the River Walk, #Thuglife2, and Breaking Bad. My favorite was probably thuglife2, but they were all great. The rolls are huge, but the chefs did a good job of rolling them because none of mine broke apart. Not only is the presentation of the sushi great, but the rolls are delicious and high quality. Love it, and I can't wait to go back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/x9HZlQUrW7q-H4SUzjag4g/348s.jpg", "caption": "Top - breaking bad Bottom - riverwalk"}]}}, {"review": {"des": "This place is awesome, everything is delicious. <br>Art in your plate, good service, healthy options, I in love with their avocado mango salad the best dressing I've tried so far.", "pics": null}}, {"review": {"des": "Oh my Yuzu!!!<br>You really did impress me, with your super fresh Sushi and creative designs.<br><br>I ordered the Breaking Bad roll and the Chicago Spring roll to share.<br><br>The Breaking Bad roll (No Walter White here) is essentially shrimp, asparagus, a smokey pepper mayo sauce, cucumber, avocado and scallions. It is topped with seared tuna and (my favorite) fried ginger. No I have never done drugs but the Breaking Bad name is justified as this roll has a little spice and is highly addicting!! They make a blue fish with the sauce. Adorable.<br><br> <br>The Chicago Spring roll has shrimp, avocado, cream cheese, and red tobiko. It's topped with chili sauce, wasabi mayo, sweet soy and tempura crumbs. This roll was my favorite; by far it was sweet with a nice kick of wasabi. They make the Chicago Skyline with the sauce. Beautiful.<br><br> <br>Feeling thirsty? One of the best things is that Yuzu is BYOB (Sake, Beer and Wine)! Don't forget to bring your own bottle. No corkage fee. However, if you do happen to forget, order the Iced Green Tea. It may not have liquor in it but its super tasty and refreshing.<br><br>Tip: If you pay with the CC you have registered to Yelp you get 7% cash back! Take advantage of this wonderful yelp benefit.", "pics": null}}, {"review": {"des": "If you like sushi and appreciate a gourmet-looking plate, you'll definitely want to come here. I had seen Facebook videos advertising the incredible appearance of the sushi here and couldn't wait to come see for myself. The verdict? It's just Sushi. With color.<br><br>While the artistic designs are really pretty and make this place very unique, the sushi itself doesn't taste much better than most other places. Good, but not the best I've ever had. Also, I was a little disappointed when I realized you don't get to see your plate while it's being designed - being able to watch the chefs (or artists?) make the plate would have been really cool. Or maybe even requesting a certain design/idea so the design could be customized to each guest - that would add a more personalized element to the experience as well as make the preparation a little more fun for the chefs! Perhaps in the future they could add something like that to the restaurant - a place that has sushi on a colorful plate is cool, but a place that gives you sushi on a plate designed just for you and in front of you is way cooler!", "pics": null}}, {"review": {"des": "Yuzu is amazing! I'm in love with the beef short rib, pork shoulder and chicken robata selections. I also love the Boston roll, mango salad and tuna poke. If you get there after 2:30 for lunch they rush you out for a hard close at 3:00pm.", "pics": null}}, {"review": {"des": "This is a great place!! First thing I noticed was all the manga panels on the walls, and the characters on the menu. We tried the Salmon To Die For, Nasu robata, Over the Rainbow roll, Riverwalk roll, and Yuzu White Chocolate for dessert. I ordered a Japanese milk tea which I thought would be house made, but it was poured out of a can. The nasu (eggplant) was amazing, it had a very smokey grilled flavor and the sauce it was in was soo good. The salmon was really fatty and melted in your mouth. The rolls were FAT and had great flavor, but the presentation is what blew us away. They spread out different colored sauce on the board they serve the sushi on. The server said it was food coloring and mayo for the unnatural colors. I'd recommend this to anyone who loves sushi!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yoAbjSwSNZqL91QQMZEQUQ/348s.jpg", "caption": "Yuzu white chocolate dessert"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BWTjjlvdNN_arq2rnXZIjQ/168s.jpg", "caption": "Over the Rainbow jumbo roll"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mGQPsQO2Cp5351MqyOijMQ/168s.jpg", "caption": "Salmon to die for"}]}}, {"review": {"des": "BYOB sushi. Why not! Made a res the day of for a table of 3 at 7pm and brought a 6 pack. They do tell you have 1.5 hours for the table preemptively. Enough time to scarf down some soosh.<br><br>A jumbo roll is enough for 1 serving! We ordered another to share which consequently led us to food comas. Everything we ordered below was tasty! Each order comes with amazing sauce art.<br><br>Beef Short Rib skewers: deliciously marinaded. 4 pieces on a stick.<br>Black Sea: Tuna & salmon in spicy mayo.<br>Boy Meets World: Spicy tuna & mango.<br>River Walk: Assorted fish with jalapenos, wasabi mayo.<br>Over the Rainbow: Unagi topped with assorted fish. Sweet taste to it.<br><br>Service: Table was ready on arrival. Sushi came out impeccably fast. <br>Ambiance: Cutest Yuzu cups and chopstick sets. Fun anime decor on the walls.<br><br>Great place to bring someone out of town to eat at.", "pics": null}}, {"review": {"des": "I really liked this place!  It's BYOB, the service is solid, and the sushi is very good.  It is also presented so beautifully--each roll comes out looking like a work of art!<br><br>It was pretty crowded when I came in with a couple friends on a Tuesday, and we had a reservation, so I would recommend making one.", "pics": null}}, {"review": {"des": "This place is amazing. The first time I came there was no wait, Friday summer night <br>Second time on a Tuesday fall night there was 15 min wait the sushi was so good it made me come back.", "pics": null}}, {"review": {"des": "Loved the design of xxl rolls , cozy place sometimes a bit too much noise - it can get super busy but its worth it! Delicious sushi very urban style dining out and service is fast!", "pics": null}}, {"review": {"des": "Truly a Chicago gem. I don't live in the neighborhood, but do go out of my way when I can. Everything I've had there over the years has been exceptional and fresh. BYOB, cool ambiance, good service, and creative food designs make it fun. Great date place, too!", "pics": null}}, {"review": {"des": "Love this place! It's BYOB and no corkage fee. There's also a beer/wine market across the street. You can call in and make a reservation, but if you go before 7pm there's usually no wait and you're seated immediately. Although every time I've gone, I always have to leave by a certain time for people who have reservations, so it's been a little annoying to feel a \"time limit\" on my dinner.<br><br>The sushi is great. I've gotten the Boston Crunchy, Dragon Ball, and Midwest (something). Boston Crunchy is like an amazing version of spicy tuna. Dragon Ball is great for anyone who appreciate unagi. Midwest is like a jalapeno popper with tuna that is deep fried. Not usually a fan of cream cheese in my sushi, but this was definitely a score. <br><br>I've gone multiple times and haven't been disappointed, and plan to come back too. Sucks there is no Happy Hour on their sushi, but if it's BYOB and no corkage, I'll suck it up.", "pics": null}}, {"review": {"des": "It is hard for me to do this. But I have to. I have been a regular guest for a few years. Same servers, great food, always awesome. Until tonight.  We had a big bottle of sake. I know there's a corkage fee. $5/btl. Great. The same server who helped us last week and the week before and the week before and the week before etc was confused by the large format btl of sake. So she summoned another server. And another. And another. All trying to figure out what to charge me for corkage fee. I said 2,3x. It's fine. And then they concluded that it should be $30. Because it's not on the list, they just made up a corkage fee. So we got up and went down the street to JJ Thai Street Food. Brilliant. I'll miss the food, but not the treatment.", "pics": null}}, {"review": {"des": "I came here for sushi on a Saturday night without reservations. We waited about 20 min and were seated. Yuzu is BYOB (with a small corkage fee) which was great since I brought a bottle on Pinot Noir to enjoy. The sushi came out a lot faster than expected (not always a good thing). The waitress let us know we had a 90 min limit at our table. <br><br>Now for the sad part - the sushi was tasty...BUT the fact that all of the rolls fell apart as soon as we grabbed them with the chopsticks was a buzz kill. I judge a a sushi restaurant on how well they roll their sushi and how durable those rolls are. The fact that every single roll fell apart was a turn off. I will not be coming back again.", "pics": null}}, {"review": {"des": "Fresh and tasty sushi! Also as far as I expected this place known for the art work on a plate. They serve sushi with beautiful pictures painted on the board from different kinds of sauce. It is a good idea, because it feels like a special place. Service is good, and people who works there are nice. I would like to return there.<br><br>I couldn't make pics, because I forgot my phones in a car  But you have to trust me it's an art", "pics": null}}, {"review": {"des": "I ordered the Boy Meets World and the white tuna on top just did it for me..it melted in my mouth and was a perfect pair with the mango in the sushi roll. The art that the chefs make on the plates are amazing and really make the restaurant what it is. The sushi is delicious but the sauce is what really showcases it.", "pics": null}}, {"review": {"des": "This is a great date night place!<br>Cons: Reservations are hard to come by if you don't plan ahead....but you can usually walk in and wait 45 to 1hr.<br>Small intimate place so the waiting room area is cramped. <br>Loud obnoxious guests who thinks highly of themselves and their own time that they often forget they are out in public and other ppl are around too.<br><br>Pros: Creative sushi with amazingly fresh fish and sauce designs<br><br>Hip hop music makes eating fun!<br><br>Byob with no cork fees<br><br>Reasonable prices <br><br>Wait staff are polite and attentive<br><br>Bottom line if you're willing to wait a little bit all good things come to those who wait. I definitely recommend this place as one of my favorite Chicago go to sushi restaurants when I'm not in a rush because the wait is definitely over 45 minutes on a weekend.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Mw2aeSpT5UVQwUB-7K0MHw/168s.jpg", "caption": "Amazing rolls"}]}}, {"review": {"des": "This is a very cool place to go to if you love sushi and a laid back atmosphere. The fun drawings on their plates are super interesting too if you're into that.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZgG4hCxCr5Lno2scL7CfSA/348s.jpg", "caption": "Mango avocado salad"}]}}, {"review": {"des": "The best sushi I have ever had. Colorful and tastes great too.<br><br>Pictured is the Sorry I Am Drunk. 10/10 for all the menu items names btw, they're hilarious. This had spicy shrimp and spicy mayo along with other items. It was huge and definitely tasted as good as it looked.<br><br>This place is also BYOB. So bring a bottle of wine, sit back, and enjoy the sushi. Great atmosphere to be in.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/edMAHpOvY7FyW-v7wqL8tg/348s.jpg", "caption": "Sorry I Am Drunk"}]}}, {"review": {"des": "For a unique dining experience with quality food, you have to try Yuzu.  At Yuzu, the food experience starts with your eyes.  The sushi creations are just amazingly well put together. <br><br>I went with a larger group which gave us the ability to try a lot more of the signature sushi rolls.  The signature rolls are impressive with the variation of ingredients and their creativity.  The creativity doesn't stop with the ingredients in the rolls, but they continue on the masterful way they are plated and served.  Yuzu definitely appeals not only to your sense of taste, but your sense of sight as well.  The elaborate sauces that you drag the sushi across are beautiful depictions of what the roll you are eating, but it also allows for some playful interaction because you drag your roll onto the sauces till the sauces and sushi is gone.  It kind of reminds me of those Buddha art boards, where you create something beautiful, then slowly watch it disappear.  The artistry of Yuzu definitely enhances your experience.<br><br>With all that being said, I still feel compelled to highlight my favorite dish of the night, which was the Boy Meets World roll.  The balance of this roll was perfect.  Please excuse my nerdom, but I can't help myself.  This roll is Cory and Topanga aka the ultimate pairing.  Everything worked so well.  The spice and meatiness from the spicy tuna, the sweetness and subtle tartness from the mango, the smoky seared flavor of the white tuna, the clean fresh flavor of the lime, the little texture and briny flavor from the tobiko, and topped off with a little smear of the savory eel sauce was unequivocally my favorite bite of the night. It was just amazing well put together, and I'll definitely have to comeback to have it again.<br><br>Although my experience at Yuzu was great there was a few things that did fall to hit that 5 star rating.  First, I didn't care for the appetizers, we tried 2 things and both were just nominal.  And secondly was the sauce flavor, I loved the sauce as a visual component, but I wish the flavors varied.  To me all the sauces, although different colored, were the same (just a form of eel sauce).  It wasn't bad, but I felt that they could have created different sauces to enhance the different flavor of the different sushi rolls.  For some of the rolls, I just didn't care for the sauce, but then again that's personal preference.  <br><br>To sum it all up, I truly did enjoy my experience at Yuzu, and I will be returning.  The combination of flavors and visually striking sushi roll make for such a unique experience that it would be a shame not to go back to.  So if you want a food experience, check Yuzu out.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZRjJ5wVU53PqinWhjJCvcw/168s.jpg", "caption": "Dragon ball roll"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/D9t_6lwCpM1JDgpKcKqGdg/168s.jpg", "caption": "Rainbow"}]}}, {"review": {"des": "The tuna poke was so good! One of the best I've ever had. I ordered the pork chicken and beef skewers and only the beef was good. The chicken and pork were bland and the sauce on the chicken wasn't good. The sushi we ordered was on the jumbo menu and there was way too much rice in them.. the presentation of the sauce wasn't as good as I expected it to be. The waiter was near by to refill my water constantly. Over all good experience.", "pics": null}}, {"review": {"des": "Ok so like I could go on and on about the sushi here because if you're here, you're here to see the beautiful sushi art and taste the delicious sushi rolls. BUT THE TATER TOTS. Yes I said tater tots. Honestly could come here and order those as my entree and be completely content.<br><br>Not to mention the ambiance here is super hip and casual. They have the dopest music playing all the time- it makes me want to get up and twerk while stuffing my face. <br><br>This place is a winner in my book. 5/5 would recommend to alllllll my friends.", "pics": null}}, {"review": {"des": "I really liked the sushi here but there were a handful of things that made me give 3 stars.  The boy meets world and Chicago spring we're great rolls. The Boston crunchy was good, and we didn't love the monster spider. The presentation was great and the quality of fish , especially in boy meets world was noticeably good.<br><br>There were a few things that turned me off to this place . First, the BYOB corking fee of $5 is no big deal, but the BYOB policy was a little intense. We brought a bottle of red for my boyfriend, and white for me, and we had to choose on. Second, they were rushing us non stop. The sushi came out and we finished in literally 30 minutes , and we got 4 rolls! It's not a good place to catch up with a friend or talk, they are very quick. Finally, some of our rolls were too big (I understand height, but the thickness was absurd) to fit in one bite. I feel like if you can't fit it in one bite, you lose the purpose of the roll (all the ingredients combined).<br><br>Overall, the food was good, but probably wouldn't go back. The ambience was not conducive to a long dinner or catch up with a friend, it was rushed.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pojQ9iih9hwyv5CK0HNK8w/168s.jpg", "caption": "Coconut on top and monster spider on bottom"}]}}, {"review": {"des": "OMG! Everyone should go to this place at least once, especially if you love sushi! The art on these sushi boards are so beautiful  it's BYOB (super cool!) and the service is great! The rolls are HUGE, do yourself a favor and don't order 5 rolls like myself and my friends did because you will be full on just two! <br><br>I will TOTALLY be coming back eventually and if you are an out of towner this place is a must In my opinion !", "pics": null}}, {"review": {"des": "Love this place! Came here for my birthday dinner and was super impressed with the presentation of the sushi, the artwork with each roll was so stunning! Since I had been eating all day and was still pretty full I only got one roll - Motown Effect (smoked salmon, unagi/eel, crab, cream cheese, avocado, and jalapeño) and it was delicious. Now I am usually not a huge fan of fried rolls, but this was lightly fried and I really enjoyed it! I am extremely picky with my sushi and have been to over hundreds of sushi restaurants around and this place was pretty awesome! I will need to come back and try the other rolls and other foods as well and will update this review. The place is a bit small and very crowded - we came on a Saturday night but we did make reservations so we were seated quickly. Definitely make reservations if you are planning to go here. It is BYOB also.", "pics": null}}, {"review": {"des": "I came across this place via Instagram. Saw so many cute posts that I wanted to try it out. My friend suggested the place so I was up for trying. <br><br>We ordered tator tots, thug life jumbo sushi, sashimi gold, and Midway roll. Tator tots wasn't anything special. Thug life was good. I love the salmon skin! Super crispy! Sashimi gold was delicious except i thought it was odd to only have one cut on some fish. The Midway roll was not my favorite. But if you want something deep fried... definitely check it out. <br><br>It is also BYOB if you want to bring a bottle of wine! <br><br>Service was ok. They brought out the check before even asking us if we want dessert! How rude! I had to ask her for dessert after we paid. We didn't want it to ruin our night. <br><br>The pricing is high but my friend said its the norm around Chicago. 13-19 dollar for a jumbo roll. You're really paying for the art work. We each paid around $45 including tip each but I wasn't satisfied at the end.", "pics": null}}, {"review": {"des": "Such a fun sushi place! I've seen so many posts on Instagram about their art and I was doubtful that their rolls would taste as good as they look! Thankfully, everything was exceptional! <br><br>I ordered the Over the Rainbow jumbo roll and it was huge! I had trouble fitting an entire piece in my mouth so I had to split each individual one into two. The roll itself was super delicious. Ingredients were super fresh! They really don't skimp on their portions! The sauce used to create their designs was basically just spicy mayo in a variety of different colors. It was very good though so I'm not complaining! <br><br>In terms of the atmosphere, the place itself was super laidback and trendy. Most of the tables have benches along walls filled with artwork. Parking is metered along the street - right in front! <br><br>Would definitely recommend this place to any sushi lovers!", "pics": null}}, {"review": {"des": "Love this place. Owner is super nice. Ambiance is good for a date or dinner with friends. The sushi is filling and the presentation is beautiful. Used to be full BYOB but now hey serve alcohol but you can bring your own and pay a small corkage fee (I think $5).  Always try to get a reso a week or two in advance otherwise it gets really busy on a weekend night. My go to spot for sushi!", "pics": null}}, {"review": {"des": "Awesome experience at Yuzu. Went with some friends on a friday night who had the foresight to make a reservation. It was super crowded so wouldn't suggest trying to walk in on the weekend. Its a BYO which is something to keep in min, and there is a corkage fee but I dont think we were actually charged anything. They do have a \"one bottle per two people\" rule which seemed to be ... loosely enforced... but it was super busy so not sure if that applies all the time. Walls are decorated with Naruto themed murals and such which is kinda funky and fun.<br><br>The Rolls are HUGE and really well priced for the size. You're probably getting 2x the amount of food of a regular roll, and then you wont end up spending too much at the end of the night with the BYO situation. Summer Breeze and Ocean roll was great, so was the Breaking Bad. A bunch of my friends got the Midwest roll which is like deep fried with cream cheese or something (thank god there was no ranch involved); not my cup of tea but they thought it was awesome. On top of that everything is plated beautifully. Even if you're not a sushi person, may was well find someone who is and drag them here for the 'gram.<br><br>Def a place to add to you list for a little bit of a different sushi experience in the Chi!", "pics": null}}, {"review": {"des": "Our reservation was set for 8pm. We got seated at 7:50, placed our order at 8, got our first roll at 8:05, and our last rolls at 8:10. We were full by 8:15. Exceptionally fast service and great food.<br><br>1. Black Sea roll: 4/5 stars. If you love a roll with just raw fish and masago, this is the roll for you. It was very good but nothing too spectacular hence why it did not get 5/5. <br><br>2. Boy meets World:5/5 stars. This roll had white tuna, spicy tuna, and black and red masago. The fish tasted very fresh and THE MANGO added the right amount of sweetness. <br><br>3. Dragon Ball: 5/5 stars. This was a shrimp tempura roll with unagi and Avocado. The avocado and unagi just melted perfectly together in my mouth. Probably the best dragon roll I've ever had.<br><br>The presentation was very unique and the sauces that were made for each roll were great.", "pics": null}}, {"review": {"des": "Yessssssss so good! Make a reservation though, just easier that way. BYOB and I always recommend this place and meeting friends here or having date night !", "pics": null}}, {"review": {"des": "Yuzu thank you for helping make my dinner party easy!My guests just loved the jumbo roll sauce designs!  Although I re-plated all to my dishes, your to-go containers and platters were absolutely gorgeous enough to display your creations. What amazing artists your sushi chefs are!  We love you!  Ukrainian Village is so cool and parking is still easy enough--I just love your restaurant. Oh and thank you for your reasonable pricing for such high quality fresh sushi.", "pics": null}}, {"review": {"des": "This is the second time I've been at this establishment and the feeling is consistent - the service is OK, the food is OK and overall is't just OK, but not better.<br><br>First - the service. Those who arrived first (including me) were seated immediately before all of our party arrived - so far so good. I ordered some food for the whole table with the expectation that the food would be served after everyone shows up. Instead the miso soups were served instantly, after which I told the waiting staff to hold off the rest of the appetizers until everyone arrives. That didn't help - the rest of the appetizers showed up on our table shortly. Fortunately the rest of the party arrived soon after (so no one got to eat cold soup) but still, this seemed like a simple thing to get right that they missed. <br><br>To their credit, the service did improve as the evening went on. Still it left much to be desired. Also, they refused to serve the wine we brought even though they charge a corkage fee - it's a small service they could've provided and I thought that policy strange.<br><br>Second - the food. The miso soup was fine, beef short rib appetizer was good, but the rolls were less good. Too much non-essential stuff was added to the fish+rice to the point that the taste of the fish got obliterated by all the side additions and the heavy mayo-based sauces. This seems to be a general theme with many sushi places in Chicago - the rolls are too large, too overdone with decorations and sauces and not tasty enough. I miss the NY sushi joints...", "pics": null}}, {"review": {"des": "Not only appealing but tasty!!! The rolls are all quite good and the prices are reasonable.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Y-0jupa4CPLAtzgY8wcN9g/168s.jpg", "caption": "Chicago roll"}]}}, {"review": {"des": "The BF and I decided to try out this spot last Friday and we were in no ways disappointed. <br><br>First off, it's BOYB, only charging a $5 corking fee. HUGE. There are specific guidelines regarding how much alcohol you can bring depending on your party size (and I don't think liquor is allowed) so make sure you check their website on guidelines if you choose this route. If not, they do serve drinks there. <br><br>We started with the edamame (naturally) and decided to kick it up a notch with the spicy variety. This was a little bit of a disappointment as they decided to just dump the spice right in the center of the bowl, rather than evenly spicing the dish. Still good, just not the best I've ever had and the reason I did not give 5 stars.<br><br>We decided to battle the Gluttony Monster (definitely the right play as these rolls are pretty large) and only order two rolls to spilt between the two of us - Dragon Ball and #ThugLife2. Both were amazing, although we both preferred the Dragon Ball Roll. I try really hard to stick to my guns and only use chopsticks when eating sushi, but the #ThugLife2 roll proved too hard to manage, forcing me to admit defeat and ask for some silverware in order to finish it off. <br><br>This is a smaller restaurant and although we had a 9pm reservation it was still packed by the time we left. Thus, I definitely recommend making a reservation if you're planning on stopping by during the weekend. <br><br>Overall we had a great experience and definitely plan to go back with friends!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/atNPZu8XUcoCd8X-wf1KMw/348s.jpg", "caption": "#ThugLife2 roll is the one with the fish artwork and the Dragon Ball roll is the one with the (surprise) dragon artwork"}]}}, {"review": {"des": "This place was excellent!  Not only were the different rolls we have amazing, but the sauces accompanying them were a work of art! We were celebrating a birthday and they even brought out a happy birthday sushi platter ( happy birthday written with the sauce and a candle on top). It was impressive. We were able to take in or own wine and champagne with a 5$ corking fee which I thought was reasonable. Will definitely be back here next time I am in town!", "pics": null}}, {"review": {"des": "Amazing restaurant. Love the vibe, music, ambiance and decorations. The sushi tasted great. I got the Boy meets world, coconut and crab (my fave) and smoked salmon.", "pics": null}}, {"review": {"des": "First up, it's a good idea to make a reservation to this place! I didn't make one thinking I'd be okay as I was close by, but when I arrived at 5:23(they open at 5pm), the place was already packed! The place is nice, but not uptight. <br><br>Once seated, our server was instantly very accommodating and attentive but not pushy. She also answered any question we had thoroughly. <br><br>I started off with Rose to drink and a seaweed salad. The seaweed salad was great, but I wasn't too much of a fan of the Rose. For the sushi we had Unagi and Chicago something, both of which were presented nicely and tasted great. They make cool designs on the side! :) <br><br>I'll definitely come back again!", "pics": null}}, {"review": {"des": "Yuzu, yuzu, yuzu.... three words: Delicious, creative & fresh. This is definitely one of my favorite sushi places to go to. Reasons being the innovative menu, food presentation and friendly service that sets them apart from other sushi joints. Breaking bad roll is a personal fav.. topping is be best part (marinated tuna w fried ginger). The colorful sauce art takes their sushi game to another level. Tater tots are a good appetizer to snack on while waiting for the rolls. Overall, Service: friendly and fast. Specialty rolls: WOW. Presentation: a1.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_ITmA8BsWLIhvUUKWZXhSA/168s.jpg", "caption": "Breaking bad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mC7SiSKX2Yx-IRXnLFN5dg/168s.jpg", "caption": "Dragon roll"}]}}, {"review": {"des": "We made a reservation the day of for a Friday night dinner for 6 people and the only available time was 5:30 pm. Due to traffic, we arrived about 30 minutes late yet they were still accommodating (of course we called them when we were in the car that we were arriving late). They simply told that we must finish eating by 7 pm which was totally doable! Why, you ask?<br><br>Because they have amazingly quick service! I was seriously impressed! Our food came about 5 minutes after placing the order. The jumbo sushi rolls were lovely to look at with the designs they make with the sauce. I enjoyed the boy meets world jumbo roll which includes spicy tuna and mango - loved the sweetness of the mango in each bite. My favorite though - hands down - was the Riverwalk jumbo roll! The food overall was very enjoyable both taste and appearance wise!<br><br>Heads up: If you come with a group, the max number of credit cards that can be used is 3 which may make things a bit inconvenient. Nonetheless, I would definitely recommend this place and be sure to make a reservation.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Nr1ceQPFuVZe4se89SMMgg/348s.jpg", "caption": "Boy meets world"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WqSKyfdtG12ZCweNzQtmEA/168s.jpg", "caption": "Boy meets world"}]}}, {"review": {"des": "Hands down, our favorite spot for sushi in Chicago.<br><br>We have been over a dozen times and have never been let down.  The quality is always terrific and the presentation, offerings, etc. are super!  Freshness has never been an issue and the flavors are exceptional!  Nice that they have Sapporo on tap too!  <br><br>We love the fact you can BYOB too, since we enjoy red wine with our sushi.  Their corkage fee at only $5.00 is a steal of a deal!  Plus we have always found their staff to be consistently helpful, attentive, and quick!  <br><br>Yes, it get busy, so make a reservation and be prepared that this is not a place you can sit and dawdle after your meal is done, but that has never, ever been a problem for us no matter what the size of our party.<br><br>We often begin with the gyoza and always with the seaweed salad, which is one of our very favorites!<br><br>Then our 'go to' rolls are the Chicago Spring, Sin Nombre, and the Black Sea.  TIP:  Even if you are a regular, be sure to always read through the menu since they do change it up at times.  Plus at times they will even do special orders/substitutions (when we add an additional layer of tune for example).<br><br>We have tried other sushi restaurants, but we keep coming back to our very favorite, Yuzu!  Don't miss it!", "pics": null}}, {"review": {"des": "I had a really great dinner with my girlfriend here. What inspired me to come to yelp to rate this restaurant was a small gesture that really impressed me. Upon going to the bathroom at the end of the evening I discovered they had mouth wash available in the bathroom. This is such a classy and thoughtfu gesture by the management that was appreciated greatly.", "pics": null}}, {"review": {"des": "SO of course I found out about Yuzu on social media because of the amazing sushi art videos, and thus why we decided to venture out to West Town to eat up some of the magic. <br><br>First - we made a reservation for 1PM on a Saturday, surprisingly it wasn't very crowded, I mean there were a few tables available, but I'd probably recommend making a reservation. Downside; the table we were placed at are cramped next to other patrons and the tables are TINY. I understand why (more tables, more customers), but I literally hate this kind of arrangement. We were literally having lunch with the people next to us. Luckily, one of the tables was just finishing up their meal, so we were able to slightly scooch over, and place some of the unnecessary sauces and plates on the other table so we had more room for, again, sushi art... and elbows. <br><br>WE ORDERED to start, \"the salmon to die for\" - we didn't die over it, but it was dece, and also the the bacon scallop skewer, but they didn't bring this out until after our sushi, so weird timing, and this was also just okay. <br><br>THEN WE ORDERED the \"over the rainbow\" roll and the \"sin nombre\". <br><br>SIDE NOTE, order the special jumbo rolls, don't be that person who orders the \"ordinary\" rolls. This place is not a basic roll kind of joint. Pay the extra $6-$8 and get yourself something beautiful AND tasty. It's definitely worth the experience. <br><br>Over the Rainbow was AMAZING. It looked cool, it was fresh, and that SAUCE. Even the BFF was stealing some of that sauce for her roll. And not going to lie, the people next to us who were eating their basic rolls were definitely eyeing this roll and most likely regretting their ordering decisions.<br><br>Sin Nombre not so great. Sauce was ordinary, roll was blah, and the design was.. confusing? Art man.....<br><br>As of right now, sticking with 3 stars, but definitely willing to go back to try the other Jumbo rolls, and hopefully change my rating.<br><br>OH before I forget - though we are fast eaters generally speaking, we were in and out in less then 20 minutes. They took our order, and within literally 2 minutes the parade of food started appearing at our tiny table. So, if you hate waiting for food, I'd highly recommend this place. However, if you're the type who likes to sit back after a meal and chat, this place is probably not for you...", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Ofkj7404J2673J_c8VwzQQ/168s.jpg", "caption": "Salmon to Die For"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qAFFFYAGWxwZidBdt3GX-A/168s.jpg", "caption": "Over the Rainbow"}]}}, {"review": {"des": "The sushi itself is not the best I've had but the presentation is obviously amazing. The sushi is too big to eat in a single bite which is, in my opinion, a real issue. The #THUGLIFE2 roll was the best of those that we ordered.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_xPRAAZKMe6U_CxdMBBCQA/348s.jpg", "caption": "Chicago Spring roll"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3am2Hwwn47qbMVwEwCJEAQ/168s.jpg", "caption": "Boy Meets World roll"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/z53U0N_1cEyLH2U9vKnAyw/168s.jpg", "caption": "#THUGLIFE2 Roll"}]}}, {"review": {"des": "I'm going to start off by saying I'm not a sushi fan. I don't hate it, but it's just not my thing. My boyfriend on the other hand is obsessed. We came here for dinner and I'm really glad we read the reviews beforehand and made a reservation because it was packed. <br><br>I tried a few things from the Robata Grill menu and thy were pretty good. I had the pork shoulder, the scallops, and the steak. Tasty, but you don't get a whole lot with each portion.<br><br>My boyfriend ordered a bunch of different kinds of sushi and really enjoyed it. I tried a couple as well and they were pretty good as far as sushi goes (again, not a sushi fan).<br><br>The food and service were both good, but the price point is pretty high in my opinion. With the amount our bill came to, we could have gone to a steakhouse and gotten a couple courses. With all the sushi places in the city, it's definitely on the pricier side.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YpgbpEyDkzbIcwKu8QVs7A/168s.jpg", "caption": "Robata Grill items - Pork Shoulder, Bacon Scallop, and Sirloin"}]}}, {"review": {"des": "My husband and I had reservations here and were told we had 1.5 hours to eat, which made me panic a bit- but it turned out giving us plenty of time to eat with some time to spare! <br>My husband tried their beer which he said was great! Whatever you do, you must get the iced green tea latte! It is delicious omg I'm dreaming about it now! <br>We split the dumplings as an appetizer and they were awesome! Highly recommend! <br>For main course, my husband ordered the Dragon roll and I order d the Chicago roll.  The Dragon roll's main component is eel and I'm not a big eel fan, but my husband loved it and after every bite  <br>The Chicago roll's main component is shrimp. It was awesome!! Of course the best part was the super cool designs that came with our sushi  rolls. <br>We were celebrating my husband's birthday, so the waitress brought my husband's roll out with \"Happy Birthday\" written with a birthday candle. So nice!!!", "pics": null}}, {"review": {"des": "A great local sushi spot! The place is independently owned by an incredibly sweet husband and wife. The whole staff works their tails off to provide quick and efficient service. My wife and i Iove the sushi, haven't had much from the robata grill and absolutely adore their appetizers - like the wasabi tater tots!<br><br>The place gets really busy, so show up the moment they open if you want a table without reservations. It gets packed instantly! It's much more affordable than some of their neighbors that also offer sushi.", "pics": null}}, {"review": {"des": "Can I just say YUM YUM YUM as a review? Everything I had was great! The presentation too was so pretty! Love this place. Had the sushi burrito too, and it was a must try during lunch time.", "pics": null}}, {"review": {"des": "The best sushi I've ever had! The sauce art is so creative, and not to mention yummy!!! HUGE rolls, but worth it so definitely get the specialty ones. My favorite was the Chicago spring", "pics": null}}, {"review": {"des": "I am a disciple to Yuzu. It is, bar none, my favorite sushi place in Chicago. Whether I am going here with locals on a weekday we're craving some sushi, or trying to impress some out-of-town guests, Yuzu is ALWAYS at the top of my list for dinner destinations.<br><br>It used to be BYOB, but I came back yesterday with a girlfriend and a bottle of wine in tow to find a little sign at the front of the restaurant indicating that Yuzu would be discontinuing its BYOB policy; they still let us drink our bottle of wine, but charged a $5 corkage fee. Our bottle was a twist off (reserve your judgment, folks; it's what's available at the liquor store across the street) so to get charged for \"corkage\" was a little annoying, but business is business, I guess. Low price to pay to drink our own wine.<br><br>Yuzu is always super busy so reserve, reserve, reserve. Fail to plan, plan to fail.  <br><br>And I guess I should mention the sushi -- but surely, you've heard a lot about it already, given Yuzu's jump into the spotlight in your Facebook and Instagram feeds!! Yuzu's sushi is an exercise in delicious food and artful presentation; while yummy in itself, the best and most famous part of the sushi at Yuzu is the ponzu sauce art that decorates the Jumbo Rolls. From dragons, to fish, to the Chicago skyline, to beautifully patterned and multi-hued designs, the chefs at Yuzu know how to impress and feed both your tummy and your eyes with their work. While the actual sushi itself is enough to warrant a visit to Yuzu, it is the art that separates Yuzu from the pack and keeps me coming back ---and bringing more and more of my friends-- again and again. I take full credit for their Instagram shots.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/U_WxHvY8eBqYT-u2y6mI2w/348s.jpg", "caption": "The Sin Nombre jumbo roll ($16) with the Chicago skyline & flag in sauce. Outrageously good and huuuuge portion size!!"}]}}, {"review": {"des": "So after seeing this restaurant all the time online, I bookmarked it in hopes of visiting Chicago one day to check it out. Well, luckily I had the chance to stop by.<br><br>Three of us stopped by on a Saturday around dinner time. There was a pretty long wait. It was cold and snowy so we were all packed in a tiny area waiting for a table to open up. About 30-40 minutes later, we were seated. <br><br>We each ordered a jumbo roll; I got the sin nombre. We also ordered a bowl of udon with chicken teriyaki. <br><br>Well, the food came out quite quickly and the artwork was on point. The colors were super bright and everything tasted delicious. The udon was delicious as well. The broth was flavorful and not too salty. I liked how the chicken was on the side instead of in the bowl of noodles. <br><br>Overall, I really liked this place. The food was good, as well as pretty, but be prepared for the wait time.", "pics": null}}, {"review": {"des": "My boyfriend took me to Yuzu for my birthday. The food was excellent! We recently visited Japan and the Takoyaki, Gyoza and Sapporo really brought us back! The sushi was beautiful (not like Japan though). <br><br>I would give it 5 stars but I thought the staff were kind of rude. We had a reservation at 5:15 but we arrived early at 5. They sat us right away and said, \"We need the table back by 6:30\". It was kind of off putting. <br><br>Later I felt like the waiter was trying to rush us out and he was super rude when we asked for a recommendation. I'm allergic to avocado so my boyfriend asked if they could make the rolls without avocado. He said, yes so my boyfriend followed up by asking what would be good without avocado. The waiter just repeated, \"We can make anything without avocado\" so my boyfriend rephrased the question and the waiter again gave the same response and this time in a rude tone and with attitude. I finally chimed in and said, \"No, he is asking for a recommendation. What do you think would still taste good without avocado?\" he finally pointed at two rolls and then walked away. It was really uncomfortable. <br><br>Finally, my boyfriend put it was my birthday in the reservation and while there we saw our waiter bring out a sushi roll with a candle to another table. My boyfriend also secretly told the waiter it was my birthday but nothing. I don't expect anything but I saw another table get a birthday thing right in front of me...just makes you feel not so special. <br><br>The food is good but after that experience I feel kind of put off.", "pics": null}}, {"review": {"des": "Yuzu lived up to the hype! I've seen them featured on Facebook so many times and finally went there last week. First, my boyfriend and I got there around 10:30pm (they closed at 11) and the host asked if we would be ready to order quickly as they were closing soon. Not a problem for us! We were very pleased they would still allow us to dine - and we didn't have to wait! The restaurant still had many patrons chatting and enjoying the ambiance. We ordered the tuna poke appetizer, born to chill roll and the river walk. The rolls were large compared to other sushi restaurants and the presentation could not be beat! The sushi was priced very similarly to other restaurants (18 per roll) and was worth every penny. I'm a big \"sauce fan\" with sushi so the presentation artwork served as a perfect dipping sauce for the sushi rolls.<br>The restaurant is BYOB. <br>I will definitely be bringing sushi lovers here in the future! It's a place that would impress any visitor.", "pics": null}}, {"review": {"des": "One of my most favorite sushi places ever! If you come to Chicago I would definitely recommend it! It's very casual and pleasant. Love the atmosphere and food! It's also BYOB and you can bring your own alcohol beverages, but if you don't there's a liquor store literally across from it.<br>Their Sushi art is incredible! I have never seen anyone draw with colorful different sauces and create such masterpiece. Definitely blew my mind! I also love the quality of their food, and how big jumbo sushi are in size! <br>This place is very popular and gets packed very easily, so if you plan on going then make sure to book reservation for your seats! Otherwise you might have to wait awhile, and there's not enough of space inside to stand around and wait. :)", "pics": null}}, {"review": {"des": "This place was amazing, definitely a chill vibe, dim light setting for mood. Very popular, reservation is a must! Their dishes have unique and creative presentations. I loved it!", "pics": null}}, {"review": {"des": "The sushi was just ok!<br><br> I got Boy Meets World - tuna & mango - BOYYY this was a great pairing I have never tasted before (yes, pun intended). The innovation was a little lacking with the rolls that they offered; however, nonetheless tasty. The presentation is superb with the sauce designs. <br><br>I was coming from out of town so I made reservations; it seems like the best way to go since when we got there the hostess immediately told us it was an hour wait (for a Friday night).<br><br>We also had the Robata Sampler - OH MY GOODNESS - the chicken satay felt like you were biting into a marshmellow (IN A GOOD WAY)<br><br>Try if you're interested, pass if you're a sushi lover", "pics": null}}, {"review": {"des": "This is my favorite sushi bar in chicago.  The food is great and the Robatta is great,   But i also know they are starting to raise there prices.  If they keep doing that, i may have to go there less. But i do love it.", "pics": null}}]}