{"name": "zed451-chicago", "reviews": [{"review": {"des": "We celebrated our 10 year anniversary at the spot where my husband proposed on 6/7/08 to me.<br><br>Since we arrived early, we sat for a bit at the bar. Travis welcomed us with a smile and anniversary wishes. When we ate, Tiffany and the rest of the servers continued to treat us like royalty. The food was great, as usual. I wish I could eat more!<br><br>After dinner Arturo, the manager, talked to us for a bit, completing a wonderful anniversary celebration.<br><br>In the new year we're planning a group brunch at ZED :)", "pics": null}}, {"review": {"des": "Hmmm!  Say what!  We are going here for dinner, but I don't eat meat.  What is there for me to eat?  Well, well, well, let me tell you.<br><br>First, I have to compliment our server Lela for giving us the best SERVICE and making our first visit special. <br><br>Since I do not eat meat, they offered me both Salmon with Beurre Blanc Sauce and Ahi Tuna, along with Grilled Vegetables.  Delicious.  The carnivores that were dining with me enjoyed a variety of different meats.   Some were very good and some were dry.<br><br>The Caiparinha's and 2013 Duckhorn Merlot were delicious.  <br><br>Weekends offer live entertainment.  Very nice buffet.", "pics": null}}, {"review": {"des": "Love this place. <br><br>1. GREAT happy hour. Good deals during the week, the cocktails are amazing, and the apps are delicious. <br><br>2. Amazing dinner menu. One of my favorite Brazilian steakhouses in the city. <br><br>3. Great brunch menu. <br><br>Zed 451 does it all! I recommend this restaurant for any occasion, during any season. Fairly priced & good for vegetarians.", "pics": null}}, {"review": {"des": "It's a really nice restaurant that's very similar to fogo de chau (???????) in how it operates. They bring you cuts of various meats and there is a food bar in the center of the restaurant with many interesting things to choose from. My favorite cut of meat was the bacon wrapped beef. It was moist and delicious. They give you options of wellness for your beeves. Apparently beeves is a word. The waitstaff was very friendly, the ambiance is nice. I didn't much like many of the food island items but the charcuterie section was pretty amazing. Do recommend. My date was a picky eater so his plate looked pretty scavengey. Wouldn't recommend him.  *photod is his plate :-(*, but trust me. The food is good.", "pics": null}}, {"review": {"des": "One of the best places for happy hour. They have different deals each day for $4.51. The food on happy hour is very good also. Perfect place to meet up with friends for drinks and apps. The rooftop has an awesome atmosphere and is super cute. It does get packed so if you want a spot to sit, best to get there right when happy hour starts.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sKLFNKDtbI1XTTzuu163KQ/348s.jpg", "caption": "Skirt steak and mac and cheese balls"}]}}, {"review": {"des": "I just got married at Zed451 in August of 2018, so my experience is pretty new and fresh!<br><br>I want to start with the positives. Food? PHENOMENAL! Start to finish, my guests went on and on about how delicious everything was and how stuffed they were. Best wedding food ever. Service? Absolutely AMAZING. They kept both me and my husband well serviced with food and drinks, and did an amazing job with each and every one of our guests. My grandmother loved them, and she's a picky, picky lady! <br><br>I don't want my (mostly negative) review to take away from these two aspects of Zed. However, that's where things go south. <br><br>Communication and overall event planning logistics were an absolute nightmare. E-mails were occasionally not responded to for up to a week, and phone calls took 3-4 days to receive a call back... only after asking to speak to a manager. <br><br>I'm not a bridezilla, everyone I know can attest to that with 100% confidence, but I wanted to rip my hair out multiple times because of repeated errors on Zed's end, especially when it came to seating arrangements. One day I would be told that one of the areas in the space could seat x amount of people, only to be told a month later it was actually y amount of people, a much lower amount. I had already invited guests at that point, and was now told guest count needed to be lowered, which was an error I couldn't fix. <br><br>They also told us less than a week before the wedding that we could no longer keep any decorative items at Zed overnight. When I pressed to find out more information, I was told that apparently there had been a flood back in June. I whole heartedly understand why I couldn't leave stuff, but why wasn't this communicated two months prior to my wedding instead of a week before...?!<br><br>Our final signed contract that was also due a week before the wedding had eight major errors in it, meaning no one looked over and finalized the nitty gritty details of my wedding. Our menu, timeline and seating charts were all incorrect. Logistical things were out of control. <br><br>The icing on the cake was truly the day before and day of the wedding though. The day before, when we showed up for our rehearsal, Zed had actually ripped up the entire flooring by the main entrance and had construction occurring. THE DAY BEFORE THE WEDDING. And NO ONE had informed me! The assistant GM actually told me that because it didn't state the need for the main entrance in my contract, it wasn't an issue. WHAT?!?!?!? Zed was literally going to leave a construction site for my guests to walk through. Let that sink in. Dust, grime, paint, tape, all over as a main entrance for a wedding. They had no intention of finishing it until the week after my wedding. <br><br>The day of the wedding, my venue coordinator had NOTHING set up (per my contract!!!!!) for the wedding. Two hours before my wedding was set to begin. Ceremony space wasn't set up. Reception space wasn't set up. Nothing. When my outside wedding coordinator began pushing for things to be done, my Zed coordinator actually LEFT ZED AND DIDN'T SERVICE MY WEDDING... again per contract, she should have been there doing all of the coordinating with her staff. She. Left. My. Wedding. She didn't communicate her absence to my outside wedding coordinator (NOR TO ME!). To my knowledge, I had no main contact person at my wedding. No one. And let it be known zed staff (minus the coordinator) only show up 45 minutes to an hour before the wedding, so you can't rely on them AT ALL. <br><br>And even better? Zed's valet service parked some of my guests' cars in illegal spots, and they got lovely $50 tickets from the city. AWESOME, right? <br><br>My wedding was the best day of my life. It was stunning, beautiful and an absolute dream. My guests raved about it. However, none of these positives were due in any capacity to Zed. I actually really love Zed as a restaurant; the food and the service as JUST a patron are phenomenal, and I want to give the General Manager HUGE props for doing his best to correct any errors made by his coordinator, the horrible lack of communication, and the way I was treated at my rehearsal. He FaceTimed me as he attempted to clear as much construction and debris as he could at 4pm the night before my wedding, and also offered us a complimentary dinner. (Side note: I wish he would hire wedding staff they hold the same work ethic and customer service that he does.....)<br><br>However, it's my hope in writing this review that I can warn any future brides. I hope you never go through the unnecessary stress I went through. Trust and believe, wedding planning comes with enough stress of its own so do without all of the back and forth that the Zed wedding staff comes with. Enjoy brunch or dinner as a guest and choose elsewhere as a venue.", "pics": null}}, {"review": {"des": "My boyfriend took me here for a date, and this was my first time ever going to any sort of steak buffet and I didn't know what to expect.<br>We were seated and a member of the staff explained the concept of the meal to us. There was a \"harvest\" table that we could go up and get food from at any point like in a traditional buffet. The plates were laid out and there were several cold meat and cheese options, a salad bar, a few soups, and small appetizer-like bites. Of the items I tried from there, the cheddar biscuits and berry-cheese were the best. Both were absolutely delicious. <br><br>There were stones in a plate on our table. We were meant to place the stones on the table, outside of the plate, to indicate once we were ready for the steaks/entrees.<br><br>The servers didn't quite acknowledge the significance of the stones because even once we put them back on the plates, they just kept coming one after the other with new meats for us to try. The restaurant was fairly empty when we went and there was only one other couple adjacent to us, so I assumed the servers were just trying to serve both parties out of convenience. I didn't mind though. My plate kept quickly accumulating with various meats, but my boyfriend had no trouble keeping up at all with the pace. There were so many options ranging from pork, pork belly, beef, lamb, chicken, salmon, tuna and more. The servers would bring a giant skewer/pitchfork to the table and cut the meat in front of us. Each meat was cooked and flavored differently, and some were accented with different garnishes and sauces. <br><br>We finished the meal off with a chocolate mousse dessert and crème brulee though I honestly do not know how we were able to even eat any more. We visited the rooftop as well, which was very cozy and lively. The bottled sunshine cocktail tasted as delightful as it sounds. <br><br>Overall, I had a really fun and unique experience at Zed451. The atmosphere was great. It was very open, and I especially loved the bright, natural lighting. We were dressed casually, but I imagine it would have felt just as comfortable dressing up even a little. I wish the music had been a bit classier than top 40's but the meal itself was the highlight and everything was very well seasoned.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3ztnO5HC-Pg4dzD0Mz3FNw/348s.jpg", "caption": "Inside"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4tfZoCwD-tVnHKSQ3DsWWg/168s.jpg", "caption": "Rooftop cocktails"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tRPANUQhuA_ZlfcLZHQC1A/168s.jpg", "caption": "Chocolate Mousse dessert and creme brulee"}]}}, {"review": {"des": "Cute little rooftop for happy hour. Pretty good value for money even though the food is just decent. The happy hour runs from 4:30-6:30. The service is also friendly but FYI the drinks take some time to come. <br><br>The drink deal differs by day. I went on Wine Wednesday, which was $4.51 for their whole list of wine. I'm talking wine that is fancy y'all!! Pretty good deal if you ask me. Include red, white, and rose. <br><br>Food wise, there's a bar menu upstairs which includes 4 items for the $4.51 price. They had these beef skewers, that were flavorful but very chewy. There was also cauliflower with this yoghurt curry sauce. Honestly it was very bland, even with the curry sauce. Needed more of a pep. The Mac and cheese with this tomato sauce was the best on the list, as it was creamy and was a great combination with the tomato. The fries were good too, they were light and crispy, with a great chipotle aioli sauce and this sweet ketchup. <br><br>Not on the $4.51 price options were these buffalo blue cheese sliders. They were very good! Didn't over do it with each type of flavor. <br><br>Overall, it was a fun experience but I wouldn't necessarily eat.", "pics": null}}, {"review": {"des": "I married a Brazilian so I've gotten the chance to try authentic Brazilian food. We also frequent Brazilian steak houses for special occasions so when a birthday was to be celebrated, we were excited to try ZED451. The ambience is top notch; there's really modern and sleek decor around. It looks like they have a roof top bar that looks ideal for happy hours. We were seated on a Tuesday evening so the restaurant was quiet. <br><br>They had a good drink menu. We got two caipirinhas, one original and one peach. They were a little sugary but we didn't have a problem finishing them. The buffet/first course was standard for Brazilian steak houses and had soups, salads, cheeses, etc. One star was docked because they had a cheese biscuit and not pao de queijo. This is a standard in any Brazilian steakhouse so it was odd they didn't have them. <br><br>The main course was overall pretty good! I liked the variety in terms of beef, chicken, plantains, and the like. We definitely did not get a chance to try all of them and it didn't seem like they were moving fast so we could. <br><br>The 3 stars is truly because of the service. Our waiter started off fine but did not put in our order for French fries. He definitely did not write it down or simply forgot because it was never acknowledged. Then towards the end of the night (right around dessert) service completely tanked. A large party of 10-12 came to his section, and we were an afterthought. It took 20 minutes for creme brûlée (it was small, and most definitely not hand made so no reason to take this long). Then it took another 20+ minutes to cash out. This was because he made sure to take all their drink orders and go over the process before putting in our dessert. Then he proceeded to wait by the bar for all their drinks to be made, serve them all, then drop off our check. <br><br>The price and the service most definitely don't line it up at ZED451 and we will probably will opt for a different steakhouse for the next celebration.", "pics": null}}, {"review": {"des": "My friend and I stopped in here on a summer weeknight for happy hour. On the way up, we did take a few seconds to comment on how beautify the inside looked. Lots of dark decor and mood lighting with modern shapes. <br><br>We arrived just as happy hour was beginning so we were able to find a nice spot on the roof. The views from this location are great since the roof is a little further lower than the surrounding buildings so you're really able to take it all in. <br><br>We both ordered drinks and quickly received them and enjoyed ourselves on the rooftop, people watching until nightfall. There were happy hour appetizers/small plates available but we didn't get a chance to try it out. <br><br>My friend ordered the watermelon sangria, which came with real watermelon balls and I had a lemon based drink. They were nothing special or memorable but did the job. <br><br>TIP: Check the happy hour menu beforehand - some days certain drinks are only $4.51!", "pics": null}}, {"review": {"des": "Best all you can eat steakhouse in Chicago!<br><br>I've been here twice, once for a company event and also for a AYCE bachelorette brunch. They have a wide selection of food including non-meat options to cleanse your palette.  <br><br>TIP: They have a $4.51 happy hour special that I've been meaning to drop by for years...", "pics": null}}, {"review": {"des": "Went to the rooftop for drinks on a Friday, around 4pm and got a nice spot with no wait.<br>The happy hour vodka sodas were weak and didn't find my drink refreshing nor delicious, so got something off the regular menu and it was nice. Wish I could remember the name. <br><br>The service was good, vibe was laid back and casual. It felt like hanging out in someone's backyard. We had a comfy mini sectional like corner under shade, which gelt really good!<br>It started getting crowded around past 5pm and soon there were people all over kinda standing around waiting for someone to leave.<br>There was really no age range, some young, some old, pretty mixed in terms of ethnicity as well. I liked it for a casual after work spot!<br>Prices were typically downtown relaxed rooftop, $12 or so for a cocktail in a small glass.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aOzq0RBIoWcoFyNYstuJ6w/348s.jpg", "caption": "View from rooftop."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kR1IEIdR2LpvuMkvzwqF-w/168s.jpg", "caption": "Steak house downstairs"}]}}, {"review": {"des": "I had a pretty awful experience here last weekend (7/28) when I came with a group of friends celebrating a birthday. We were a pretty large party, about 15-20 people, and had settled on a nice spot on the rooftop. We were having a good time when we discovered one of our friends was sick in the bathroom. She did not display the typical signs of being intoxicated and we suspected foul play. We immediately called 911 and requested an ambulance and we alerted management as well. <br><br>We asked the manager Carlos if he had security footage and if he could review it, which seems like a reasonable request when customer safety is in question. We had called the police and they were on their way, but we'd like to have a better grasp of the situation to share with them. Instead, Carlos immediately kicked our entire party out and claimed we were all too intoxicated and \"embarrassing ourselves\". He continued to say that he sees this all the time and that our friend was just \"another dumb girl who can't hold her alcohol\". Yes some of us had definitely had a few drinks prior, but by no means were we being obnoxious. In fact we approached him in a very calm and controlled manner as to not cause a scene or disturb the other guests. In fact, there were members of our group who were DDs and hadn't drank at all. After cooperating and leaving the establishment (after we we paid for our drinks that we didn't consume/some had not even been served), we asked one of the DDs to try again and have a rational conversation with Carlos about how to best proceed. Carlos proceeded to tell him that there were no cameras upstairs on the rooftop and that he couldn't help us and if we kept bothering him (this was our second conversation with him) that he would call the cops. For some reason, Carlos did not understand that we had already called the cops. I've attached pictures of the cameras that he claimed didn't exist.<br><br>This review is primarily for Carlos. In fact, I agree with all the other reviews that the venue is gorgeous and food/drinks were great as well. The staff that we did interact with were very friendly and helpful. Carlos was the exception. He was rude, sexist, undiplomatic, and straight lied to our faces. It's just hard to understand why someone in service/hospitality would act the way he did as well as say disrespectful and sexist things. We waited outside for nearly 45 minutes and the police never showed. We won't be returning to this establishment.<br><br>Note: one member of our party reported them to the local news, hopefully it gains some traction.<br><br>EDIT: We have reached out to Mark multiple times on this issue and he has not responded. I'm not sure what their status is, but I do feel like this is another poor reflection of their management.", "pics": null}}, {"review": {"des": "I've been to plenty of Brazilian steakhouses for dinner, but I was intrigued when I saw that Zed 451 offered brunch too. After reading a few of the reviews, it still wasn't too clear what the format was. Was it buffet style? Family style? Did they serve steak or breakfast food? So we decided to check it out for Saturday brunch.<br><br>Ambiance: Although I usually only care about the meat and how to get my fill when it comes to Brazilian steakhouses, I gotta admit that Zed was beautifully decorated. They had that nature chic vibe, with a lot of decor focusing on wood, stones, and fire. The layout was wide open, which was great compared to the cramped tables at Fogo.  <br><br>Service: Service here was a little different than Fogo and Texas de Brazil. I'm used to just grabbing a plate, load up on the salad bar, flip my card to green, and then just go to town on the steak as they came around. At Zed though, they make you get salad and appetizers first at the buffet stations. On top of that, the plates used for the buffet were tiny, and you couldn't fit much on there without getting all the food mixed together. Then when you were ready, you'd tell your server and they'll give the green light to the gauchos to start bringing out the meats. You won't get a big plate until this point in time. I didn't really like this format because I wanted to eat those sides along with the meal instead of separately. <br><br>The way you tell them you want more meat is by putting this random rock near your plate, and putting that rock back in the center apparently meant that you were done. I think they were trying a little too hard to be unique, and it was confusing. Also, I don't know if it was because it was still pretty early for Saturday brunch, but the servers didn't come by too often. Most of the time my plate was empty, and I was just waiting for the next guy to come. At other Brazilian joints, we're usually bombarded by the servers and I have to start saying no to them as the meal went on. Every now and then the server would ask if there was anything in particular we wanted, but even then it still took a while after that for it to come. <br><br>Food: I'll admit that the food here was pretty good. Although I didn't max out on the quantity, the quality of all the food was legit. <br><br>The salad bar was broken up into a few different sections:<br>Salads: 3 or 4 different types of salads. The servings weren't that big, so they were always freshly tossed and not just sitting out for a long time. <br><br>Charcuterie:<br>There were various cold cuts of Italian meats and cheeses, along with cuts of fish like lox. They also had the usual bagels/croissants/bread/spreads to pair as well. <br><br>Hot sides:<br>Buttermilk scrambled eggs - Usually I find scrambled eggs to be bland, but these were hands down the best scrambled eggs I've ever had. They were soft and fluffy, and had enough seasoning for it to stand on its own. <br><br>Cajun Maple Bacon - There was a cast iron pot sitting on low heat that contained this glorious item. The bacon here was easily one of the best bites of the meal. These thick strips of fatty bacon were damn near perfect: a little bit of heat, a little bit of a sweet glaze, and a slight crisp to give each bite a nice crunch. <br><br>Biscuits and Linguica sausage gravy - The gravy had an orange tint to it, and was a little smokier and garlicky than regular country gravy, which is an upgrade in my book. Then the biscuits were so soft inside and were able to soak up all the gravy. <br><br>Duck confit potatoes - Literally potatoes cooked in rendered fat, they just soaked in all the meaty flavor and were so tender, almost to the point of crumbling.<br><br>Dessert:<br>All the desserts were pretty awesome. My favorite items were the assorted macarons (which was my moneymaker haha), and individually plated creme brulee cups. They also had various cakes, cookies, red velvet cupcakes, turtle bars, and glazed scones. At our table they brought out a big ass cinnamon roll glazed all over and served in a cast-iron skillet.<br><br>In addition to the salad bar, gauchos were walking around with some main entrees:<br><br>Buttermilk sirloin - Steak that is literally marinated in buttermilk ranch. Fatty, juicy, salty, so fuckin good. My favorite meat of the meal.<br>Chimichurri hanger steak - The steak was leaner than the sirloin, but that chimichurri sauce was the game changer. Make sure to toss that shit over everything.<br>Moroccan chicken - Meh<br>Turkey with cranberry sauce - Meh <br>Maple bacon sausage - Juicy sausage with skin that snaps with each bite, almost like a polish sausage. <br>Buffalo chicken and waffles - Mini version of chicken and waffles. The chicken was pretty generic, just like a Tyson breaded cutlet tossed in buffalo sauce. Was hoping for real fried chicken here.<br><br>Overall, I enjoyed our brunch at Zed 451. If my goal was to max out on my meat consumption then I'd easily pick the other churrascarias, but Zed's combination of trendy ambiance, unique flavors, and livelier crowd, makes it a worthy competitor.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mcYqxgP9DB3oJ2Vg9fz3_w/348s.jpg", "caption": "Dessert section"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YjhBLY94uskkSlaH9pwZog/168s.jpg", "caption": "Maple Cajun bacon / buttermilk scrambled eggs / biscuits with linguica sausage gravy"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UIih1usueorHx0PPsjpMVA/168s.jpg", "caption": "Buttermilk scrambled eggs"}]}}, {"review": {"des": "The food was delicious. The cilantro lime rice was excellent. All of the staff and servers were friendly and very accommodating. The manager even took the time out to talk to us and he asked for our opinion about the place or food for corrections. That was greatly appreciated. The ambience of the place was great. We enjoyed the live band as well. Definitely, will be back soon.", "pics": null}}, {"review": {"des": "Loved the brunch here yesterday. They were able to accommodate a group of 4 adults, 2 kids and 2 babies on short notice (less than one hour away) and they made sure we were all comfortable and had enough room for the strollers and everything. <br><br>The food was great! We were taking out our friends from out of town so this was important to me. We all were stuffed by the time we were done. I think by far my favorites were the duck confit potatoes and the buffalo chicken and waffles. The desserts were fantastic but also perfectly proportioned so you can try a couple of different things. <br><br>This was our third time here (first time for brunch) and each time we were impressed with the food and service. <br><br>I don't have more pictures of the food which makes me sad but I was so busy eating I forgot! Haha.", "pics": null}}, {"review": {"des": "Zed451 is one of our favorite churrascarias.  We typically go for weekend brunch with groups, where we always receive great service. The food selection is really good during brunch.  So many options, then the meat, it's all good, but you have to try the chicken n waffles.<br><br>If you can, request Nina as your server. We have been lucky enough to get her a few times randomly, now we always request her. She is very friendly and attentive.", "pics": null}}, {"review": {"des": "This place was so great!<br><br>Went to this place for breakfast buffet style (believe it or not) and it was delicious. The attention was also exceedingly good.<br><br>I would go to this place usually on a romantic date with the wife or another special occasion but I would definitely recommend this over and over.", "pics": null}}, {"review": {"des": "Amazing brunch buffet! I came here on a Sunday and it's a beautiful, rich setting, with spacious high ceilings, wide, wooden tables and comfortable seats.<br><br>An entire center area with different stations of delicious food, I loved the variety and diversity. They had an entire baked goods section, with a biscuits section all to itself, plus a salads section, a cheese section, a fruit and yogurt section, and other foods.<br><br>Also, if you put a stone on your table, there will be freshly grilled meats that come to your table. The sausage was delicious, as was the chicken and waffles. And the skirt steak with the chimicurri sauce was the best cut of beef, I think, we asked for seconds and thirds! A bonus is that they bring you a fresh cast iron skillet of cinnamon rolls to your table. Yum, I thoroughly enjoyed my experience here!!", "pics": null}}, {"review": {"des": "I planned an event for my work team of 25 on the rooftop, and it was such a success! It was nice having a great view of river north in such a fun setting. The charcuterie spread was excellent, as were the craved steak and Moroccan chicken. The ahi tuna was delicious as well. Buffalo shrimp and scallops were great passed appetizers, and the bread pudding s'mores and chocolate covered strawberries were a perfect end to the meal. Such a fun time and environment!", "pics": null}}, {"review": {"des": "The bartender was absolutely great. When we went into the restaurant the server was good in the start but he was trying to push very very expensive wines on me (1300+) crazy.  Everything was good except when one of my party wanted well done meat it took forever.  Then once the meal was done so was the good service. Coffee and dessert was like pulling teeth then try to get a second cup that was worse.  Have gone here for years sorry not see the lack of service throughout the meal", "pics": null}}, {"review": {"des": "The food was ok. I had the chicken selections. I wasn't pleased with the service tho. The server wasn't attentive at all. It appeared he was more concerned with the other guests that came after us. It was my mom and I first time there and I read the reviews to get a jump start and thank God I did. I had to ask about the rocks. I had to flag him down for a second drink. The drinks are very good I must say. It wasn't the mothers dat experience I expected. However,  the manager did come to our table and apologize for the unsatisfying service qe received and accommodated us for our food. I wasn't expecting that at all as I planned to not make a big deal and not return. I appreciated his gesture and plan to give them a second try.", "pics": null}}, {"review": {"des": "If you think Brazilian style steakhouses are all the same, you haven't met Zed451 yet. It's true, the format is similar: go up and get your cold salads from the \"Harvest Table,\" then go back to your seat and move the small stone off its dish to indicate that you want people to come to your table with an endless supply of meats.<br><br>With Zed451, that experience is more refined. First off, the Harvest Table goodies are more than just bits of cheese, hearts of palm, etc. They've elevated it from a simple presentation of quality ingredients to a well orchestrated combination of ingredients and flavors in each dish. Be sure to try the POACHED APRICOTS IN VANILLA SPICED SYRUP and the PORT FIGS near the charcuterie section...heck, try a bit of everything. Make sure you try the excellent HOUSE CURED SALMON as well.<br><br>The meats are similarly well thought out, with the BUTTERMILK BOTTOM SIRLOIN being one of our overall favorites. The CHIMICHURRI HANGAR STEAK has a wonderful rich flavor, and is another standout. With a traditional Brazilian steak house, the meats are only seasoned with salt, and they are delicious, but Zed451 has opened up the possibilities by spicing these items however they damn well please.<br><br>I highly recommend the BRUNCH, which is both cheaper and more craveable, available until 2pm Saturday and Sunday.<br><br>Believe it or not, one of my favorite dishes is the VANILLA SPICED STEEL-CUT OATMEAL. Also a must try at brunch is the DUCK CONFIT HASH BROWNS. They've reorganized a bit, so if you live for their MAPLE CAJUN BACON like I do, you can heap it on a plate to your heart's content because now they have it on the harvest bar, ready for you to grab as much or as little as you like. You'll still get a HUGE delicious cinnamon roll in a small cast iron skillet delivered to your table. There is a good selection of meats brought to the table during this time as well, including my favorite buttermilk bottom sirloin, hangar steak, LINGUICA SAUSAGE and a fantastic BUFFALO CHICKEN AND WAFFLE.<br><br>For brunch, their dessert table has gone full-out Vegas style, with small portions of everything from CREME BRÛLÉE to MACAROONS to CHOCOLATE CHIP COOKIES. The macaroons were particularly good on our last visit, chewy and delicious.<br><br>Brunch is a more special time than dinner in my opinion, because the variety and flavors are just kicked up a notch. It's also easy to get a table here during lunch, even if you don't have a reservation, so that's a plus. It's a great place for large parties...they're set up to easily accommodate parties of 12 or more.<br><br>We've been coming to Zed451 for about 10 years now, and a few years ago their quality started going downhill. We hadn't been there for about two years, but when we went back we were pleasantly surprised that the quality is back up big time. I think it's better now than when we first started going there. And everyone from the hostess to the servers to the chefs are very friendly and attentive. It is definitely worth a stop. Just come hungry and don't plan on eating for the rest of the day.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pIEaJiQwMrb9sGkrpuWxhg/348s.jpg", "caption": "Farro salad."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uHCuc_9v27V2i32LERwx4Q/168s.jpg", "caption": "Believe it or not, this vanilla steel cut oatmeal is delicious."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rzEfIEsevkQLYuPHXI4MTg/168s.jpg", "caption": "Maple Cajun Bacon will change your life."}]}}, {"review": {"des": "Horrendous management. I came here with a large group for my friend's birthday. We were involved in an incident in which someone became ill and we had to call an ambulance. I asked Carlos, the manager, if he had security footage, because we were not with our friend the entire time and simply wanted to see if we could figure out what had happened to her. <br><br>Carlos became extremely aggressive, asking \"how dare you imply that we drugged her\", that we were \"just drunk girls that don't know what they're talking about because girls can't handle their alcohol\". He told me that he didn't have security footage of the rooftop bar area, however when someone in my group went upstairs and literally pointed out the security cameras, Carlos said that the cameras weren't working. How convenient for you, Carlos. He kept threatening to call the cops even though again, we were just trying to figure out what had happened to our friend and were calmly speaking to him.<br><br>Yes, we had been drinking all day and should be responsible for our own actions. However, the way Carlos was acting was so unhelpful, undiplomatic, and asinine. Will never be returning here again.<br><br>NOTE: don't be fooled by Mark's comment on this post. We emailed him, and attempted to get in contact with him several times. It's been 2 weeks and there's been nothing but silence. Stop pretending you care by commenting on these negative posts.", "pics": null}}, {"review": {"des": "Been a while since I was last here some years ago. For a while this was the firm's go to roof top/diner place to bring clients. Always great. Did not disappoint this time. We had a rather large party and the service was fantastic as usual. The crazy great salad bar is still crazy great, and you have to watch out and leave room for the delicious meats they bring out on skewers one after the other. The salad bar has changed somewhat, but not for the worse for sure. The roof top is still beautiful and a lot of fun. I still can only say great things about this place. Keep it up.", "pics": null}}, {"review": {"des": "My husband and I came to Zed for a delayed Valentine's Day Celebration.  We were greeted by friendly host staff and a very friendly server who introduced herself as Jenny aka \"Jenny from the block\".  <br><br>We started off with the salad/appetizer bar, which was good, but I'll definitely say is not as good as competitors, eg Fogo de Chao or Texas de Brazil, which have a more extensive list of items.  The smoked tomato caprese and shaved brussel sprouts salads were delicious.  I was a little disappointed that chili was the only soup option and that the bread selection options were subpar imo.  They had cornbread, and a couple of sliced bread options (I believe sourdough), but I thought it would've been nice to have some more exotic bread options that you can't find everyday.<br><br>Now, for the reviews of the meat, which you've all ben waiting for.... There are about 10-11 different meat options.  The winners are easily the hanger steak with chimichurri sauce and the chargrilled buttermilk sirloin, which is marinated in buttermilk ranch for 48 hours.  They were both out of this world.  They had the perfect amount of char, were very well seasoned and the meat was unbelievably tender, which is saying a lot considering that these aren't the best cuts of meat.  The meat of the ribeye was surprisingly not as yummy as the sirloin or hanger steak but it was served with some caramelized onions that were phenomenal - tender and sweet.  I'd return for those alone.  The asian pork belly was good as well as was the tandoori chicken.  I would not recommend coming here for the seafood (I know you wouldn't).  The salmon was perfectly cooked but definitely lacked seasoning and the ahi tuna was just bad.  I'm not even sure what else to say about it.<br><br>We were more than stuffed by the time we finished the meat portion of the Zed experience but because it was Valentine's Day we couldn't leave without getting dessert.  We ordered the maple bourbon banana pudding cake which was just okay.  It wasn't as moist as you'd expect it to be given that it's pudding cake.  Also, it's served with a white chocoloate mousse which I think was a big mistake.  My husband and I agreed that this cake defnitely would've benefitted from being an a la mode.  It needed both the moisture and the temperature contrast that ice cream couldve provided.<br><br>All in all I'd say it was a solid experience at Zed from our awesome server (seriously - ask for Jenny, she's great and kept the night full of laughs) to the tender and flavorful steaks.  I thought pricing was very fair considering the amount of food you get for $53.90.", "pics": null}}, {"review": {"des": "I really like this place. I popped in one Saturday afternoon for a glass of wine and decided to sit at the bar. I found the bartender to be very friendly and provided a couple of wine samples for me to try. She also called the sommelier over to answer some of my follow-up questions about the wines, which I thought was nice. I ended up having a glass of the Torres Ibericos Tempranillo Rioja.<br><br>Since I was sitting at the bar, I decided to try one of their Bar Cravings which is their version of appetizers. I tried the buffalo chicken and waffles. They-were-delicious. It appears they bake the chicken and then flash fry it because it had a nice crispy coating. The meat was very moist and tender. It is probably one of the best servings of buffalo chicken I have ever had and the waffles were good also. The buffalo seasoning was not overpowering which was awesome. It was just the right balance of seasoning.<br><br>The Rooftop, which is on the second floor, is nice. It is small but spacious and has patio couches and other seating throughout the area along with a standard bar and TVs.  <br><br>When I was there the Cubs' game was showing on the TVs, but instead of the volume/sound of the baseball game, they had loud music playing. To me it was a bit of a turnoff. At any rate, I definitely recommend checking this place out. You may want to ease your way by trying the happy hour specials during the week.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vnYRBrfcsHEZy7FOJ1Hqww/168s.jpg", "caption": "Rooftop seating"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0ZpHVBVTtJW0h8OJB62l6A/168s.jpg", "caption": "Rooftop area"}]}}, {"review": {"des": "After my first visit here for my boyfriend's birthday, I decided to give ZED451 another try and returned for brunch this Sunday. Boy, was I in for a treat! <br><br>This time around, I could tell that the staff truly valued me as a customer - just as they seemed to value every other guest in attendance for Sunday brunch. Our waitress, Jenny (\"from the block\"), was very friendly, exceeding our service expectations tenfold. For those of you who didn't see my previous review, the gist of it was that I was disappointed when our server did not acknowledge my significant other's birthday. To make up for it this time, Jenny brought out a special \"belated birthday\" treat. I also saw another couple being celebrated for an anniversary, so I now know that my previous experience was just a fluke and that they do indeed make special occasions feel even more special!<br><br>On top of the \"belated birthday\" celebratory mini blueberry pies & homemade vanilla ice cream (yum!), Jenny, self-proclaimed \"alcohol whisperer\" took it upon herself to bring me a surprise adult bevvy. This drink was absolutely gorgeous (blush pink, my favorite color). It tasted divine, too. The name: \"Pinkies out.\" Contents: Gin, rosé, lychee liqueur, and an egg-white froth. My boyfriend went more basic than me and ordered the mimosa; it was heavy on the champagne, and most would argue that's a good thing.<br><br>As for the food, the concept is the same as at dinner (though personally, I liked brunch even better!). There are several buffet options to choose from, including charcuterie, salad, and dessert. They also had the best bacon I have ever had in my life. Seriously. Once you indicate that you're ready, the chefs come around with several selections of freshly prepared meats. Today's selections included catfish, buffalo chicken & waffles, and moroccan chicken, among others. Hands down my favorite was the buttermilk sirloin, about which the chef made a point to tell me that it marinates for 24 hours. Twenty four hours, people! Jenny made sure that this cut made it back to our table for seconds. <br><br>Overall I had a wonderful experience at ZED451's Sunday brunch. Honestly, I went home so full that the BF was afraid I might puke (and if I had, it still would have been totally worth it). We will definitely be making our way back to ZED451, though our next stop will be the rooftop bar, which we have yet to experience. Until next time!  - Kaitlyn", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ffRjcgZfFBSyCQbtw3TvpA/348s.jpg", "caption": "Dessert table. Note: this is exclusive to brunch."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nXS2WXJzOTds5bnQvLuTPg/168s.jpg", "caption": "Charcuterie table"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/F1O4aHNW6_HrO7w3flfRaQ/168s.jpg", "caption": "A belated birthday treat, complete with homemade vanilla ice cream. Plus, check out Jenny's chocolate writing!"}]}}, {"review": {"des": "Went to ZED451 last night. While I think their sirloin is nice, the general restaurant week isn't something I would recommend. If you do plan on going just for restaurant week, I would recommend their sirloin, obviously, and their black bean rice located south east corner of the fire pit lol it's a very very nice rice, each grain is soft, cooked evenly, good flavor too! Why do I like emphasize on their rice so much? Well here is why:<br><br>There are 12 selection of meat if you pay full price which is $52 as we were told. The restaurant week experience is $33 with as little as 3 selections. So while we are paying 3/5 the price, we are not even getting 1/3 of the selection of meat. <br><br>Secondly, everything was just so sweet... their salad is sweet, their cheese is sweet, their butter is sweet, their corn bread is sweet, their appetizer is sweet, their chicken is sweet, and their salmon is definitely the sweetest piece of candy I have ever tasted. While the salmon is cooked to the perfect tenderness, that flavor was just too much. It's like eating candy but meat. Their chicken has a good amount of sweetness as well but at least it has other flavor to somewhat balance it, just very dry tho. Which leaves the only edible meat their sirloin. That sweetness isn't umami sweet, or chinese bbq pork savory sweet. It's like rock candy sweet, which My friends and I are not a fan of. Which leaving sirloin the only meat that's edible but it's a very delicious sirloin. <br><br>The interior is very cool, while the selection of salads and apps isn't as variety rich as other brazilian places, neither do they have any signs of cheese bread. The fire pit kind of made up for it by adding some intensity to that area. <br><br>Service is also an element which I think their restaurant week deal isn't helping. For the first 30 minutes of our dining experience we were basically just in a stand by waiting phase. Then once we had our first round of meat we were yet again in another waiting phase. It's a bit unavoidable since you just see all the servers look at you and walk away because they are not allowed to serve you the meats since you only get 1/4 the selection with 2 not even edible dish. <br><br>While I'm sure their full experience would be great, but I can only speak for what I experienced during restaurant week. All the other brazilian steakhouse is serving full menu tho, so there's something to think about if you are looking to dine all you can eat steak. <br><br>Again, I just don't think their restaurant week is helping their reputation, if anything it's kind of hurting it a bit. It was just not very well thought out. You can't really invite people in just to make them feel left out. <br><br>But their rice is really good lol it's kind of the best rice I've had in chicago honestly; they can open up a sister ricetaurant lol", "pics": null}}, {"review": {"des": "Friends and I came to Zed 451 during their Sunday brunch. We all love anything brunch so this ended up being a great choice. We made reservations approximately 20-30 min before. When we got there, there was about a 5-10 min wait. The hostess then took us to our table. The staff was nice and friendly and the service was pretty good. The interior is also very nice. <br><br>When we sat down the the waiter came over and explained the process to us. The brunch was a buffet but they have rocks on the table that you take off of the plate that they were on to signal that you wanted staff with roasted meats on a skewer to come over and place meat on your plate. The brunch was pretty good. I do not have any real complaints. They had tons of things to pick from. Some of the items consisted of kale salad, slaw, potato salad, croissants with strawberry butter, frittata, potatoes wth duck meat and onions, french toast, oatmeal, cheese and meats, steaks, chicken, turkey, sausage, buffalo chicken & waffles, and etc. Most of the food was good. The buffalo chicken & waffle was amazing! The waffle was soft and the chicken had a great flavor that both paired well together. The syrup was just the cherry on top. <br><br>Overall, Zed 451 was good for brunch.", "pics": null}}, {"review": {"des": "First let me say FERNANDO was amazing making sure we had everything we wanted n that it all was perfect!!!!!!!<br>The salad bar is all delicious and fresh!!!!!<br>Omg I was crazy about the salmon!!!<br>My kids enjoyed all the steaks n pork belly!!!!<br>I loved the Mac n  cheese!!!<br>The butterscotch bread pudding was to die for!!!<br>I would come back!!!! Great for big groups!!!!<br>I thought that since we were there to celebrate a birthday that there would be a  complimentary birthday dessert  but we had to pay for the dessert--- the dessert was worth paying for --- it was that mouth watering <br>See u again real soon!!!", "pics": null}}, {"review": {"des": "Let me start off by saying this venue is BEAUTIFUL! Absolutely beautiful. My boyfriend and I were able to make a reservation on opentable which is always great. Our server was Anthony and he was fantastic. I work in the industry and he was one of a kind. He is a stand out server and I hope he is recognized as such. <br><br>The disappointment was with the food. <br><br>Anthony explained we would be brought out 13 different items, however we only saw about 6-7 of them. (Not his fault - just disappointing). We only got one seafood choice, the salmon. I was really looking forward to the other kinds but they never came around. We got multiple types of steak which were good but not as good as other Brazilian steak houses I've been too. We also thought the pacing of the different meats was odd and inconsistent. At times we were overwhelmed with meat after meat and then times where we were just sitting around waiting for the next to come by. They did always ask us for our favorites to come back around. But the same 3-4 meats kept coming. They also never asked which temperature of meat we wanted, like other Brazilian places do and accommodate. Not an issue for me but definitely could see someone who is picky about that not being happy.<br><br>The drinks were good but tasted like juice. $200 for the two of us and honestly I don't think it was worth it.<br><br>We went to the rooftop afterwards to have a glass of sangria and it was beautiful and cozy. I would go back just to have a drink on the rooftop. I'd skip the food. <br><br>When I first got seated I literally said \"my parents would love it here.\" But the disappointing food has changed my mind. Overall, disappointed with the food. I had high expectations and was let down.", "pics": null}}, {"review": {"des": "Sometimes, not very often, you have a dining experience where you feel like you have died and gone to food heaven. This happened to my family tonight - which includes two discriminating teenagers who felt totally spoiled and satisfied with the food, ambiance and the overall experience. <br><br>All of the meats were moist and well seasoned. The sauces were creative perfectly paired with the meats. The service was attentive and friendly. <br><br>Oh and did I mention that the whole atmosphere was unhurried and luxurious. If our server, Tiffany, knew we like a certain meat or sauce, she made sure it mysteriously appear.  And did I mention that we could all hear each other at the meal and we were seated at a table laid out like spokes on a wheel with a fire at the center. Warm and comforting.", "pics": null}}, {"review": {"des": "really yummy! I've been to many brazilian steakhouses and although this place isn't a brazillian steakhouse like fogo or texas de brazil, the concept is pretty similar in that they bring you the steak, cut it up for you and you eat it accompanied with the AYCE salad bar. <br>The salad bar in comparison to texas de brazil was a bit disappointing. although the items seemed fancier and the display was cleaner and prettier, there was about half the items you would get at fogo or texas. No smoked salmon!:(<br><br>the steak and entree however, was 10x better! most meats came with some special sauce (like chimichurri or caramelized onions) and had WAYY better seasoning than fogo. sometimes I feel like at fogo or brazil, I couldn't tell the difference between the tastes of the different cuts. Here, however, you can definitely tell what's what based on taste. The quality of the meat seemed slightly better as well- a bit more tender, better cooked. <br>My favorite was the short rib and the pork belly! So good and melted in my mouth! <br><br>My boyfriend took me here for my birthday and although we were too full to order dessert, they gave me a mini red velvet mouse cake with \"happy birthday\" written on the plate, which was very nice.", "pics": null}}, {"review": {"des": "Had an awesome time celebrating my mom's birthday.  Service was AMAZING! We will definitely return!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NloOt9IRusKC9Ws1JHKpEg/348s.jpg", "caption": "Had such an Amazon g time here, celebrating my mom's birthday. Service was AMAZING!!! Money well spent. Will definitely return."}]}}, {"review": {"des": "I first ate here for dinner, and I was underwhelmed.  The first course had some great items on it such as the raspberry cheese and dried apricots.  For the second course (meats brought around to the table), I enjoyed the pork belly, but the steaks lacked flavor and often came with sauces to compensate.  After I tried each side, the chef came to my table and asked me what I would like more of.  I was a little put off because I thought the people would come back around, but now think this was nice because I didn't have to wait around for more pork belly.  However, I didn't think to remember the name of the other dish I liked.  The service was good at first but seemed to taper off as the meal progressed.<br><br>For the second visit, I tried their brunch, which was great.  The bacon and eggs from the first course were great as well as many of the breads they had available.  They also bring out a cinnamon roll, but it was overcooked and not too great.  The meats were okay in the second course, but after eating so much bacon, I didn't want for much else.  They didn't have pork belly for brunch.  <br><br>To sum up, the dinner was overpriced at over $50, but the $37 brunch was satisfying and reasonable.", "pics": null}}, {"review": {"des": "I would have given this place five stars but it always takes someone to ruin it. This was our first time here and was greeted promptly upon our arrival. The hostess was very patient as I received a phone call as she was about to sit us regarding a death in the family. She was very concerned and asked if there was anything she could do and her thoughtfulness was greatly appreciated, I was convinced that the service going forward would exceed our expectations. <br><br>Upon being seated we were greeted by our waiter and he was very pleasant, he explained the dining process to us and asked for our drink order, his name was Jared. He remained very attentive throughout our dining experience.  We finished with dessert and one more cocktail before we paid the bill. Jared returned with the bill as I had already provided him with my credit card for payment. I realized that I did not provide him with my frequent diner information and I asked if he could add this to my account, he said yes but would have to get someone to help as he was new which was understandable. This is where the five star went to a four and almost a three but can't blame the actions of one on the entire establishment. <br><br>Myron came to assist and asked for my name and number since I had not received my card. He took the information and I assumed walked Jared through the process. Myron came back to our table and told us that it is customary to tip and we should tip at 18% because the wait staff has to share the tips with the bus boys etc. How dare you? We are not new to dining and we ALWAYS TIP over and beyond! Just because he didn't see the tip on the receipt doesn't mean we wasn't tipping as we always leave cash with the wait staff. My husband was appalled and wanted to address him but it was not worth it. How can you make an assumption that we wasn't tipping? How can you tell me what amount I should tip? Did you go to every patron within the restaurant and tell them this? Or did you chose to single us out? We had no problem paying the $237 bill and leaving a $40 tip but that was not his business. How about if we felt the service did not warrant the tip he told us we should leave. We were very offended and left and we were going to finish the night off at the rooftop for the last 45 minutes but was completely turned off after this incident. We will return but will ask that Myron not serve us! I would advise other people to do the same.", "pics": null}}, {"review": {"des": "The food was so salty.... It was awful and we stopped eating. <br>This place is a bad copy of the \"Fogo del chao\"...<br>Really expansive for the type a meat and drinks", "pics": null}}, {"review": {"des": "The Harvest table was awesome. The selection of breads/butters were out if this world. I should have just eaten this. The meats were slow to come out and they just weren't tender enough for me. The chicken was fantastic. I've had better and don't think we saw any pork at all. It was a beautiful atmosphere and I was with a large group celebrating and we had a nice little corner area. I just wish I had liked the meat more. My preference is a filet and that was not a selection we were served. The service was just okay.", "pics": null}}, {"review": {"des": "The issue here is that it's just too much food! You pay a lot so you want to try everything! Well then it just gets to be too much. I wish they had a different option instead of all you can eat. I think the food is just ok. Too many dishes to make one outstanding. <br>Went up to the bar on the roof and that was so fun! Very chic and the music was good. Also the bar area inside is good too especially for Happy Hour! Go for this!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/poq0B25CKG7J8NbLQrKRbg/348s.jpg", "caption": "Amazing sweet potato tater tots!"}]}}, {"review": {"des": "Love this place. The food is always fresh & the variety is different. I've been for brunch & dinner & I've never been disappointed. If you're in the area stop by and enjoy the array of food.", "pics": null}}, {"review": {"des": "Very cute rooftop with great drinks and food. The shrimp and the wings were both yummy and flavorful. The drinks were great but it looks like they change their drink menu because I don't see my drink on it anymore. Worth going if you're in Chicago for summer.", "pics": null}}, {"review": {"des": "I have been here twice and the first time the food and experience was great. With my second trip I can't even explain how terrible the staff was. They were impatient, unprofessional and downright rude. <br><br>To explain they have a new system for being served which honestly did not make sense to me. Before, and with any Brazilian steakhouse they give you a way of letting the staff know you would like to be served. In this case, they have modified it to serve you after you treat yourself to the less expensive food at the bar (just a trick to get you to fill up on  inexpensive food) which did not make sense. I go to the bar anyway when being served the order doesn't matter so I asked for clarification on how we alert the servers we want food. He then says to me \"um did you not listen to what I just said\". This was so condescending and rude. I paid for this service!!! I just can't believe a waiter would talk to me like this. His answer still was not clear and we asked to have large plates served right away. I then had to call for servers as they walked by because they had no idea we wanted food! Who in corporate is making these decisions!!!<br><br>On top of this one of the staff serving food yelled at me!!! Can you believe this!?!? I did not hear what he said and he got very impatient. I said \"excuse me, what did you say\" he then replied \"grab your tongs!\" He was clearly having a bad day and was just being incredibly rude I could tell he didn't want to be there and his attitude was making me miserable. <br><br>Don't get me wrong the food is great, but their new system and lack of professionalism EARNS this 1 star rating. I have never paid so much money to be talked to and treated poorly by a business. Terrible terrible terrible service.", "pics": null}}, {"review": {"des": "I like the brunch at Zed. I really do. But, the reason I'm giving this three stars is because the last couple of times I was there for brunch I ended up needing to catch the last brunch reservation seating... and I get it... people want to go home. But if you're going to seat as late as you seat you should make sure you're still offering a relatively decent amount of good quality food. It was abundantly evident that last couple of times that the food that I got had been sitting under heating lamps for way too long - they were way too dry and not particularly great tasting. The service was incredibly slow with the rotation of meats. We asked for specific items, per the server because of the end of service, and never got them.  Drinks were slow to arrive. Water was not really refilled. Etc.<br><br>At the end of the day Zed is a really good brunch spot to go. The food is generally really good and the offering is quite good. However, if you're going to do something, then you should do it right. If it's hard to get staff and food to accommodate end of service, then don't seat that late.", "pics": null}}, {"review": {"des": "I'm here now and still don't get my meat. I've been to a lot of Brazilian Churasco and this worse place I've been bad service not worth of your money", "pics": null}}, {"review": {"des": "A beautiful Sunday of girlfriends, brunch and great Chicago weather. OH and a side of the Chicago Marathon. <br>We had reservations for a small party for Sunday brunch for 11 am. The restaurant was near empty due to the marathon which made more issue for driving and parking to the restaurant than anything else but once there, we were warmly greeted and sat with ease.<br><br>Upside:<br>Food was evenly spread out and not overwhelming like some places do. Each item was clearly labeled and organized.  My faves were the charcuterie and dessert tables. <br>Each server was sociable and the selection of meats were diverse. Top picks: Buffalo Chicken and waffles, catfish (and I'm not really a catfish person), buttermilk sirloin.<br>Overall ambiance<br>Specialty Drinks: I had one of each, the mimosa ($6) and sangria ($10).  Watermelon sangria was amazing.<br>Overall price<br><br>Downside: Not much. I would say that the various members of staff came over a tad too much. I felt like we were asked if everything was ok literally 5 mins and then someone was trying to clear our table.", "pics": null}}, {"review": {"des": "I really love this place and its rustic yet Urban appeal and Decor we sat in the bar area which had a wooded modern  appeal.<br>As we walked around to get acquainted with the restaurant we noticed another area which had plenty of greenery and lots of lighting and Astaire Clarice going up to who knew where but it was absolutely gorgeous for photo-taking in getting the correct lighting and correct perfect pose<br>As for the food we got a variety of appetizers including the sliders the fondue  it was was absolutely amazing I was able to share that with the table of three other ladies and we had the chicken wings which we all split but my favorite I would say was the fondue<br>I mentioned to the bartender that it was my birthday actually it was 3 of of us who share the same birthday week we present and I IDs and he confirm that we are all celebrating and birthday that week and mine was actually the same day I have one friend whose birthday was in August but she felt left out so he brought me a birthday drink more of a shot plus all three of my girlfriends and was absolutely awesome his customer service was top-notch his attentive he lives in to us and what we wanted to eat his suggestions were absolutely on point I would definitely give this place another shot for a different occasion<br>Oh and also they were doing a free shuttle we took the shuttle there to the Godfrey Hotel so we didn't have to walk and that was another extra added bonus which was absolutely free", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-AIgG06HhRf8eDPuxNAJkQ/168s.jpg", "caption": "Love this place"}]}}, {"review": {"des": "I have never been to a Brazilian steakhouse for brunch before but Jesus- am i glad we came! We made reservations on a Friday afternoon for Saturday morning brunch. We were the first table in at 10am and were glad we were- the place was packed when we left at noon.<br><br>The entire restaurant is set up around a cornucopia of side type dishes that you can start with. The waitress explained that brunch was a fixed price of just under $40/pp. This included unlimited everything except drinks. The \"buffet style\" middle of the restaurant was easily enough to get your moneys worth- it included extravagant dishes like duck confit potatoes, kale Quinoa salads, and then normal meat/cheese and desert sections. OF note the desert table alone was to die for. The mini-creme brûlée and key lime pies were on point!<br><br>Once you are done \"grazing\" the middle section you can move a rock from your table onto a different part of the table and the table service meats will start coming to you. The first one we got was insane- it was a ranch dressing rubbed steak that was spit roasted. The charred bits are what dreams are made of. Even my 11 month old son devoured this. Other items included a steak with chimchurri sauce , a fried chicken and waffle, sausage, bourbon ham, Moroccan chicken which my life loved, catfish and more. <br><br>In addition to the meats- there is a great drink menu with lots of options. The service was great and we never had even half empty water glasses. Overall this may be my new favorite brunch spot in Chicago.", "pics": null}}, {"review": {"des": "Had an date night here with the bf, and I definitely prefer this place of any other Brazilian steak houses. The selections of meats were amazing and the salad bar alone was worth coming for. Our waitress was super knowledgeable on her wine pairings, she even brought us couple to sample before deciding.", "pics": null}}, {"review": {"des": "Stopped in with my bf on a recent trip to Chicago. We were staying just a few blocks away and I found ZED451 from searching \"best rooftop happy hours in Chicago.\" The weather was unseasonably warm for February and we were hoping the kickass rooftop would be open. Unfortunately it wasn't so we shimmied up to the bar. <br><br>Our bartender was very nice and attentive. Their Friday HH special was $4.51 grey goose. So we had a few vodka cocktails. I thought they were decent for the price but my bf insisted they were a little weak....I think after we left we can both agree I was right. <br><br>We also sampled their fried mac n cheese balls off the bites menu which were half off. SO GOOD. What made them so amazing was the red sauce served with them. I could've drank the sauce but resisted since the scene is pretty upscale...<br><br>The crowd was mixed. Older, younger, hipster, swanky. I liked it. You could tell it was half tourists half downtown workers that just clocked out for the day. <br><br>The atmosphere was romantic. Dimly lit and their fireplace was going in the bar area. I will definitely be back...most likely once the rooftop is open for summer.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qO3avaQZTbTYUabFpGhiCg/348s.jpg", "caption": "Sweet potato tots on the bites menu. Not that great TBH. But good enough for 1/2 off HH"}]}}, {"review": {"des": "I LOVE this place. I think for restaurant week, this is the best bang for your buck. So I come here with my boyfriend and our friends, thinking I had to choose one from each section. I get seated and the waitress came and explained how it worked and I was so excited. They have this buffet style for their salads, soups and meat and cheeses. I tried almost all the salads and I liked all of them. I went back for seconds.<br><br>For the meats, you get multiple options for the sirloin, Moroccan chicken and sczechuan salmon. It was an endless supply. All you had to do was place your river stone on the side of the table and someone will come with the meats. Usually (not during restaurant week), you will have a choice of 12 different meats. That is so amazing to me.<br><br>Lastly, we go our dessert. It was a butterscotch bread pudding with homemade marshmallow on top. It was so delicious, but I was a too full to finish. My boy friend and I had a great time. He normally doesn't like the fancy places, but he told me the other day that he would like to come back for the full experience. I am so happy we found a spot we can both enjoy.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8lzvgLNNwLhz00n7pKym0g/348s.jpg", "caption": "Butterscotch brownie"}]}}, {"review": {"des": "Yesterday we Brunched from 12:30pm-8pm which led us to Zed. We literally started off at 25 degrees but we got hungry again so we headed across the street to Zed. We ordered an array of apps  between 4 ppl. We had the Spinach Artichoke dip, Beef skewers, Buffalo shrimp, Flatrbread, Macaroni &  Cheese, Wings and fries... We barely talked because we were in awe of how good the food was. In the bar area they have a beautiful fireplace. And they were showing the Oscars on a massive screen. Since we consumed, almost 13 bottles of Champagne across the street we didnt try any cocktails. But I will be back very soon to explore more from the menu and their cocktail options.", "pics": null}}, {"review": {"des": "This place was sooooo good. Come on empty stomach and wear stretchy pants. The food was amazing, ALL OF IT (even the salad bar!). The wait staff was very nice and friendly and they didn't try to rush us or push us out. The space is huge and upstairs looked like a nice venue for a party. Overall I really liked this place. It's pricey but totally worth it.", "pics": null}}, {"review": {"des": "This place is unreal! I enjoyed a early birthday dinner here and I was blown away. Everything on the salad station was amazing from the meats to salad toppings to the breads. I enjoyed it all! I was almost full before they start bringing the meats out. My mom loved the salmon and my brother and I loved all the steaks that came out and the pork belly. The steaks were charred and tender I loved them. Service was also amazing we ordered the mashed potatoes but didn't like them so they sent us complimentary Mac n cheese and French fries which were both way better. They also let you take food that you had left over at your table which was really nice since we had a nice amount of steak left. Ended dinner with the butterscotch dessert omg it was amazing! I would def return on a hungry day I'm still full from this meal a day later!", "pics": null}}, {"review": {"des": "It saddens me to write this but Zed has really lost a step.  This used to be a regular stop for us because it was always a step above other Brazilian steak places.  They had a more interesting selection of meats, great service, etc.  Not anymore. <br><br>We went there tonight and it was really disappointing.  The service was just bad.  There were long gaps of time during the meat service.  Our waiter brought out the side menu and then didn't come back to get our selection until well into the meal.  It took long enough to get our bill paid that we just ended up taking the bill up to the front. <br><br>The food was fine but they've cut way back on the variety.  They used to have duck and venison but not anymore.  The salad bar was not what it used to be.  <br><br>So I won't be going back.  Like as much as I used to love the place there's just too many good places for dinner in Chicago to waste time on that memory.", "pics": null}}, {"review": {"des": "Love this place especially the Happy Hours! I had a large dinner here and the service is always good! The food is awesome and the wine choices are great. Great place for a group dinner or brunch! I would highly recommend!", "pics": null}}, {"review": {"des": "Omg amazing. Went here last night for a work party. The service was excellent and he food was literally some of the best I have had in a really long time. The chicken was moist and delicious <br>The steak was awesome, the tuna was yummy and the side were on point.", "pics": null}}, {"review": {"des": "There was no wait on a Friday night which was awesome. The salad buffet didn't have a large selection. And the meat selection was extremely limited. The service was slow and would take 5 minutes before the next server. I don't see myself returning to the restaurant section because for the price we paid I can definitely eat better at Chama or fogo. I might be back to try out the rooftop tho", "pics": null}}, {"review": {"des": "I have walked by here a million times and finally set up a reservation and came here with the boyfriend last (Friday) night. We went right from work, so it was early, at 6:00 and we were the ONLY people in the dining section. Luckily there were people in the bar so we weren't totally alone. By the time we left, close to 8:00, the restaurant started to fill up but was still no where near full. Not sure if they get busier later or it was just a slower day. <br><br>Service was very good, until the end, which I think was the plan. They completely stopped coming around with the meat. When we asked for an additional piece of meat they came out shortly with it. The Harvest Table was very delicious; the one thing about it though was it was basically just salads, meat, cheese and soup. I would have thought there'd be a little more items up there...but as I said, what they had was great. There was a little BLT salad thing - which was basically just croutons, bacon, tomatoes and spinach drenched in some amazing dressing which I am still dreaming about! I had three servings of that! <br><br>Overall this was a great dining experience - we never felt bombarded with people coming around with the meat, food was delicious, the atmosphere was modern yet cozy and inviting and the service was very good. This isn't a place I come to all the time but I would definitely come back and recommend it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iZbSrsL_EL15cac7PsPhSA/348s.jpg", "caption": "First round from the harvest table and a flight of red wines."}]}}, {"review": {"des": "Today was my first time here, and I love it. The services vas fenomenal and #Leyla (I'm sorry if that's not how to write your name) the waitress was so nice, very friendly, positive attitude and great costumer service. The food and the drinks were just on point !!", "pics": null}}, {"review": {"des": "Came here last Wednesday with my wife to celebrate our anniversary and her birthday. We are really into Brazilian steak houses and this place did not disappoint! We even enjoyed a drink on their roof too bar. The best part was they surprised us with a desert set up in their wine room! They really made it special for us!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MNlksA9V3urqqvnj4TctjQ/348s.jpg", "caption": "Nice touch with desert!"}]}}, {"review": {"des": "ZED451 is one of my favorite AYCE type Brazilian Steakhouses. The meats here are all seasoned perfectly and you literally leave here stuffed. They have a good amount of meats to chose from and if you want more, you can always request for it. They also have a nice salad/snack bar which have many good choices as well. A very nice place to come for dinner/drinks.", "pics": null}}, {"review": {"des": "Hmmm, so I came here for Restaurant Week to try it out. First off, it offers a great deal in terms of the food available for the typically limited Restaurant Week menu. The space itself is stunning; all high ceilings, warm fireplaces, and soft chairs. Very nice.  We were seated immediately, probably due to the early hour. <br><br>Despite the nice environment, there was a smell of old food lingering in the dining room. Normally I am not too worried about this, but on this day the smell was pretty overwhelming. It brings into question how well staff are cleaning, for me.<br><br>Anyways, we ordered drinks, and began with the Harvest tables. The tables had charcuterie, salads, breads and spreads, and soups. Overall the tables had a good variety, except the soup table, which had some lemon chicken soup and a pot of rice. Not sure what they were thinking there. The bread was pretty average, but the spreads- including butter with truffles and honey chili butter was very good. The salad table was also good with several different choices of interesting salads. The drinks had come out by the time we got back from the tables. The drinks for the four of us were good, but nothing to write home about.<br><br>Soon after, the meat began to come out. First the salmon- this was nicely done. A good glaze on top, it was well cooked- not overdone, but just right. Very tasty. Then the char grilled buttermilk sirloin came out. Oh boy, wow! Exceptional. Juicy and chargrilled goodness. Third out was the chicken. This had a nice set of spices on it, but was a little dry. In addition we had a chance to try the lamb. This was also on skewers. It was over cooked and a bit hard. In general, a mixed review on the meats we tried.<br><br>The dessert was good. A chocolate flourless cake. <br><br>Overall, Zed451 was a fun evening, with about average food and service. Not a standout for me.", "pics": null}}, {"review": {"des": "So I just got back from brunch and decided  that I had to post immediately about my experience. BRUNCH is amazing here. Biscuits and gravy..maple bacon...chicken and waffles. A lot of all you can eat brunch spots do mini chicken and waffles....But their version is spot on. It's spicy and the perfect combo of savory and sweet. Obviously they have your typical eggs, bacon (I could eat that all day), fruit, cheeses, salads etc. On top of that you have servers bringing different cuts of meat like a Brazilian steakhouse. I mean 2 hours goes by so fast. <br>Service and ambiance are perfect. Nina checked in on us frequently and made sure our glasses were filled with water. I never felt rushed to finish eating. <br>I will definetly be back for brunch!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gQT-esYpwVA6ch1dB12jeg/348s.jpg", "caption": "Future diabetic dessert plate with a piece of their amazing bacon peeking out and fruit to not feel like a completely gluttonous person."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TdPyyrr3RqgiEY6q76GMmA/168s.jpg", "caption": "Giant cinnamon bun!!!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tBZDQgRmpMe5WFOBsu1MCw/168s.jpg", "caption": "Chicken and waffles...:)"}]}}, {"review": {"des": "My husband and I have eaten here for brunch on many occasions (birthday/mother's day/father's day). Although I had the opportunity to dine for dinner with my siblings, my husband has never had the \"dinner experience.\" <br><br>Our wedding anniversary is 8/31. My husband said he wanted to dine here for our anniversary. I made the reservation via opentable for 730pm Saturday, September 2nd. <br><br>When we arrived we were greeted with friendly smiles and was escorted to a lovely window table. Our server, Myron was awesome. He provided 1st class service and he was always near to clear our plate, refresh our water and answer our questions about the menu.<br><br>Now Here's the part where I want to discuss the food....it was delicious! My husband and I love the prawns, skirt steak, the harvest bar has so many yummy offerings, the chicken, ribs and beef offerings left us feeling full, satisfied and happy. <br><br>For dessert we order a chocolate martini and shared it over with butterscotch bread pudding as well as served with vanilla bean toasted marshmallow. Those desserts was everything and more! <br><br>What a wonderful experience! Even the general manager (Hispanic gentlemen. Forgive me I forgot his name) came over to wish my husband and I congratulations on our 9 yrs of marriage. He stayed and chatted with us to ask about our dining experience. He was gracious, warm and friendly.<br><br>One more thing I want to mention. sous chef, Nick came to our table with fresh prawns that he had just grilled for us to munch on. Can I tell you these are the best prawns we've have ever had he was super nice.. he was the icing on top of our cake lol.<br><br>If you've passed this restaurant becasue you've lumped it with other Brazilian steakhouses in Chicago, you're dead wrong. <br><br>Zed451 is a classy, elegant restaurant and they've awesome food along with great staff.<br><br>What are you waiting for? Make that reservation and bring your appetite", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-ixxpIcWXeRa0-ym6OlC8g/168s.jpg", "caption": "butterscotch bread pudding with toasted vanilla bean marshmallows. Our dessert drink was a chocolate bourbon martini."}]}}, {"review": {"des": "Wow super impressed with this place. Came on a Monday for happy hour (430-630). They have $4.51 HH drink specials Monday through Friday. On mondays, it's manhattans or old fashioneds. They're good and strong! I liked the old fashioned better. The rooftop is absolutely lovely. They were having a private party at 6pm so we were kindly asked to go downstairs to the lounge. The inside decor was classy and trendy. They also have half off their bites section during happy hour. We had the hangar steak skewers ($5) and sweet potato tots with chipotle aoili ($3). What a deal! Both were amazing. I'll definitely be back :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/amgGvvWy2Vfi2fqTbYlYwA/348s.jpg", "caption": "Old fashioneds"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cDvnlzQDB5jm-pNhVGxfPA/168s.jpg", "caption": "Rooftop"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dfoeRoFbofGKvE6e6qqohA/168s.jpg", "caption": "HH specials"}]}}, {"review": {"des": "This review is for a wedding reception that was held here. The service was slow. Our table was forgotten and we had a long lag time between each meat service. Therefore the pictures of my plate so empty. <br>The reception took up the whole restaurant. But everyone is so split due to the layout of the restaurant. The bride and groom and immediate family sat in the center of the buffet setup. <br>All the meat or catfish brought to the table were cut in small helpings so a lot of us asked for two pieces. The best thing I had was the chicken and waffles. The sausage was very tasty but the pieces were small. We asked for them to bring more and they never came back. The buffet food was a mixture of breakfast, salads and dessert. <br>Oh yeah my friend found a latex glove in her potato salad. Yes a glove. By the time I was back from the buffet with my food, her plate was taken away. She got an apology from the manager and a voucher for a return for dinner. <br>Maybe they aren't good with larger events. The valet service to get your car was disorganized. Another guest gave his valet ticket and waited 20 mins for his car. People that came out after him were leaving before him. He went to the \"room\" where the keys were and his key was still on the hook. So what do they do when they take your ticket? Our car took a while as well. Gave ticket and waited. Not sure how they operate during non event days but I definitely won't have big events here.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YcrrBPzYoXcNLzu4IiT8uQ/348s.jpg", "caption": "Kale salad, meat and cheese and bread with strawberry butter."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zQHYozfy4j7ry-StdGx2QQ/168s.jpg", "caption": "From the dessert bar. The creme brûlée was good."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XYBcqhL_9IggWLZxtySvEw/168s.jpg", "caption": "Piece of sirloin beef and sausage"}]}}, {"review": {"des": "Service was very good, all the staff  are very friendly. <br>The Peach Sangria is good, the meats are really good. <br>I think its way better than Fogo of Chao... but that's my opinion.", "pics": null}}, {"review": {"des": "Went here last night for my anniversary and loved it! Amazing food and even better service. When we were seated we were asked if we were celebrating anything and we had said our anniversary, at the end of our meal they gave us a complimentary desert designed very cute that had wished us a happy anniversary and the manager came out and wanted to tell us personally as well as thank us of coming and make sure our service was great. Well it was. All around amazing. The restaurant is very clean and all workers are on the same page. Loved it.", "pics": null}}, {"review": {"des": "My friends took me here for my birthday and I'm very grateful they did. I enjoyed every dish, from the salad/appetizer bar to proteins to desserts. The servers were very attentive and satisfied all our needs. We ordered a pitcher of sangria because one glass was not enough, it was simply delicious and refreshing. In comparison to most Brazilian steakhouses I've been to, this one stands out the most. Aside from the typical steaks they usually serve at a Brazilian steakhouse, Zed451 offers mouth watering salmon, lamb chops, and the pork belly that beautifully melts in your mouth. I wish I could've just kept the entire plate of the pork belly for myself! I cannot wait to come back here again. Hopefully sooner than my next birthday. Parking was not an issue either as there are plenty of street parking, parking lot across the street, and I believe they also have valet parking. I would recommend making a reservation. We booked our reservation via Open Table and were able to make adjustments to our reservation when we were running late. I definitely had a pleasant experience at Zed451.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Lz-eS7wwIvVsoy70BNB0xw/348s.jpg", "caption": "What a sweet delight! Thank you"}]}}, {"review": {"des": "Fancy and beautiful indoors/outdoor areas, however this place is poorly managed. Very unfriendly, inhospitable hosts and managers. My industry friends who i was with even mentioned that the personnel were a bunch of idiots in suits. It is very unfortunate because the restaurant has one of the top 20 interior designs in Chicago, in my opinion. The rooftop is extremely cool to hang out in. I went there for drinks and was mostly at the first floor's bar and rooftop, so i cannot speak for the quality of the food. However, one old fashioned never resembled the made right before, by the same bar tender. Since the service was so bad, I'm not really interested in eating there.", "pics": null}}, {"review": {"des": "The roof top is an absolute must for brunch, lunch, dinner, drinks. Went for brunch recently and I'm so proud to have gotten so much sun during this time. Now the service was outstanding even though there were three parties; it didn't matter. <br><br>Brunch - the mimosas was subpar but the buffalo chicken waffle, oatmeal, cured Cajun bacon, duck eggs was all delicious. And I don't just say good is delicious; it's usually good. I look forward to returning soon.<br><br>I'm back for Chicago Restaurant Week. It's also my birthday dinner with my fiancé. I'm very bothered because we had an 8pm Reservation and it's 8:30pm we continue to wait for our table. Stay tuned...<br><br>Okay so one of the managers saw my face and gave the fiancé and I free sangrias. After we were seated at the chefs table. If you've never done this before I HIGHLY recommend it. Such a cool opportunity to see how the food of prepared, ask questions, and several wait staff always making sure you're served. <br><br>The service was great all night and we will be back again!", "pics": null}}, {"review": {"des": "The rooftop lounge is nice, service was good. I didn't eat at the restaurant but did have the steak skewer which was very tender. I don't really care for the peach sangria though. They need a better variety of music being played.", "pics": null}}, {"review": {"des": "First time here.  Been to other Brazilian steakhouses and just as good.  Fine selections of proteins, good salad bar along with side dishes.  The corn was amazing.  Nice grouping of cocktails.  Went on a Saturday and the place got quite busy with a few large groups, but the servers kept up with the demand.  Will go back again when the the craving for meat happens again.", "pics": null}}, {"review": {"des": "Great service & excellent food. Went during the unlimited buffet Sunday for brunch $39 pp. Very nice ambiance.", "pics": null}}, {"review": {"des": "Easily one of my favorite restaurants in Chicago.<br><br>Food: Imagine going to a Fogo De Chao with a much broader variety of meat options. Zed has a rotating menu of meats which include traditional favorites (Steak, Moroccan Chicken), as well as different seasonal options (BBQ Pork Belly, Fried Catfish, Thanksgiving Ham). The salad bar also has an outstanding array of unusual but amazing concoctions. Important to note: for the Gluten Free crowd, they are extremely friendly and accommodating. Many of the items in the restaurant (minus desert) can be eaten Gluten Free as is!<br><br>Service: I've gone here for my Birthday, as well as a few other times. Every time I'm blown away by something the staff do for me. Always extremely friendly, very receptive to questions, and exceptionally professional. I've spoken with both the Head Chef and Service Manager personally and they always treat me as if I'm the most important customer in the room.<br><br>They also have an outstanding rooftop and happy hour. No question about it, this place hits on all notes!", "pics": null}}, {"review": {"des": "Maryon (with a 'Y') and Jenny (from the block) always accompany us whenever we dine at Zedd's in a way that makes us feel like we are the most special patrons in the whole place!! *Please don't tell me that they do this to everyone because WE ARE SPECIAL! But so are Maryon and Jenny. They deserve to be known as the best hosts' of Zedd's which has the best atmosphere for any occasion. From romantic to a birthday or when you bring someone from out of town and you really want to show them what Chicago is made of, you should bring them here. Sorry, but not sorry that this restaurant is better than Fogo de Chao or any other Brazilian restaurant in the Chicagoland area. And if you are lucky enough to have Maryon and Jenny from the block you will be treated like you are the second most special people there (if we are there) or only (if you happen to be there and we're not).", "pics": null}}, {"review": {"des": "We went (party of 2) for dinner. It was pretty good, not mind blowing. I think I like the flavors better at fogo and the variety better at zed. <br><br>Excellent? The buttermilk bottom sirloin,pork belly and the Moroccan chicken<br><br>Pretty good? The ahi - but it was over seated and the wasabi and hoisin don't get on to the non-ends evenly. The pheasant/bacon and linguica sausages<br><br>I'd skip these to have more of the others? Hangar steak. Chicken meatballs. <br><br>Just plain did not care for? The ribeye. It's typically my favorite cut of beef it was medium rare and difficult to cut. They don't give you a proper steak knife?? Thinly sliced I could have been happier, but I couldn't even cut it with my crap knife. <br>The picanha was boring. The salmon needed mustard available on the side.  The short ribs were \"fine\"<br><br>As for the market table, the salamis and chorizos were excellent. Some of the cheeses too. The apricots and figs were incredible the breads were \"ok\".<br><br>As I drafted this I realized two things 1) I'd forgotten some things I'd tried which speaks to their averageness and 2) th buttermilk bottom sirloin and Moroccan chicken we're my favorites because they were seasoned. Much of what I had was under seasoned or needed it's side sauce for flavor.", "pics": null}}, {"review": {"des": "I been to several Brazilian steak houses like Fogo de Chão, Chama Gaucha and Rios. I came in here having high expectations since it was recommended by one of my friends. In the beginning the hosted was very nice, the place it's self is very elegant. The side are very tasty and I love how different there set up is. When it came down with our server I was very frustrated. I usually like to give ppl the benefit of the doubt and give them a opportunity to make a better impression. Since the begin she wasn't as friendly as the staff who greet us in the entrance she seem annoyed. When asking question about the drink menu she seem indifferent. She took forever with our drink and check on us after 25 minutes. When we finally got our drink we informed her we were ready for the meat. We didn't get any meat after 45 MINUTES!!! And on top of that it wasn't what we originally requested when we told her we really wanted Picanha. That took another 20 minutes. She never really check on us or if we wanted any refills in our drinks. What's more unbelievable is that they weren't even that busy. By the time our Picanha came I was too annoyed and filled with sides we decide to leave.", "pics": null}}, {"review": {"des": "The margarita flat bread is great! I also like their peach drink the view is decent. This place is definitely a nice place to go for a chill vibe. I would like to go back to try out their happy hour.", "pics": null}}, {"review": {"des": "Even as a vegetarian, I am quite a fan of the zed experience. The self serve harvest bar is the best of the brazilian steakhouses in Chicago, including interesting and flavorful salads and cheeses. The drinks are always interesting and delicious, though they are best enjoyed on the rooftop bar/lounge which has a great urban view.<br><br>Perhaps the best time to visit is during brunch--surprisingly affordable (and delicious) cocktails and the harvest bar gets a bit of a breakfast makeover, including tons of sweet treats and baked goods.", "pics": null}}, {"review": {"des": "It is slightly different than the other Brazilian steakhouses, but in a good way.  The layout of the AYCE salad and meat/cheese area was very simple and clean; other steakhouses seem to have a cluster of food in those areas so this was a nice change.  The spread was delicious!  The quality of the meats was excellent as well, and I especially loved the various sauces that came with.  The chili was great, though I didn't like the rice and beans as much as I'd hoped.  <br><br>The only real gripe I have with it is that on top of already being pricey, they don't bring the sides/extras to your table like the other steakhouses. There was an extra cost for potatoes, and my husband was complaining about the lack of plantains. And those little cheesy bread rolls... <br><br>While I really did enjoy the quality of the food, unless they start offering coupons, I'd probably opt to go to Fogo next time I want to go into a meat coma.  But I do recommend trying this place out and if others I know want to go for dinner, I will more than happily join them.", "pics": null}}, {"review": {"des": "We had dinner at Zed451 on Tuesday, July 10.  It was a very disappointing meal, to say the least.  The salad/app bar was fine, but it was all downhill from there.  The meats were often tough with no flavor.  The last two steaks they brought around were the best. Overall, the quality was not worth $55.  Service was horrible!  They weren't busy at all, but it took forever to get coffee, dessert, and our check.  We had to finally ask the hostess to get our check.<br>I would not recommend this restaurant to anyone!", "pics": null}}, {"review": {"des": "This is the place to go if you want meat, meat, and more meat! I've been to Zedd 4 times now and I always have a wonderful time! <br><br>The service is great and the chefs that bring the meat to your table and friendly and don't make me feel awkward when I ask for more. While my fiance loves the meat and fish items being brought straight to our table, I love the buffet that includes salad, cheeses, deli meats, soups, and quite a large variety of little appetizers. <br><br>It is quite pricey so I only go for special occasions, especially since it is a place that requires you to dress up a bit more than normal. But I personally think it's worth it!", "pics": null}}, {"review": {"des": "Ask for Nina or Eric for your server and you will not have a bad time. Came here for date night and couldn't be happier that we came. We didn't have the best time in the previous visit but their Manager Mark made sure we had the same experience we've previously had at Zed. We've been here multiple times but it's an Brazilian style steakhouse with a little tweak from some you've been too. I always say Zed is a little more upscale than the others. From the Irish gentleman with the meats, to Eric recommending a red wine that I found to be my new favorite and Nina being our main server, everything was amazing. I wish I could come here every week but it's a little pricey so we do special occasions. They have an amazing lemonade they made in house and with vodka it's awesome!", "pics": null}}, {"review": {"des": "They have a really cute rooftop patio here. Everyday they have different happy hour menus. On Tuesday it's $4.51 for cocktails, which are all super delicious. I also went on Thursday where they have half off bottles of wine. Food is always half off apps during happy hour. Everything is quite delicious, but especially the flat bread!", "pics": null}}, {"review": {"des": "Classy place to come for happy hour with affordable prices! <br><br>On the weekdays they have a $4.51 drink specials. When we went it was grey goose so any mixed drink with it was only $4.51! <br><br>Their bites during happy hour are half off. We got the Zed wings and the Mac n Cheese croquettes which were delicious! The wings were decent and juicy but not much flavor. <br><br>We also ordered the wagyu beef sliders which weren't part of the happy hour special but just $4 for a slider. The sliders were juicy and had the perfect amount of BBQ sauce. <br><br>Service was decent. I think there was only one person serving people but it was fine. Will come again for their happy hour.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-t2-vGB-sCSCyZElSw3RVg/348s.jpg", "caption": "Zed Wings"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/87LE1or54uw1l-eyMiIWuw/168s.jpg", "caption": "Mac n Cheese croquettes"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5NTz-fAUCG3sujJ_q9LrhQ/168s.jpg", "caption": "$4.51 drink special!"}]}}, {"review": {"des": "Ok <br>Where do I start. Found parking on the street <br>Was able to get seated right away ( as I had a reservation ). The hosted offer free coat Check, and we were seated next to a window as I requested. <br>From the moment I came in the door I felt like this place is different then any other Brazilian steak houses I've been to. <br>The floor was amazing amazing <br>Crispy and flavorful meats <br>Way better then any other place I've been <br>Recomend if you are hungry and want to set your taste Buds on a wild ride. <br>Well worth the price <br>Will come back", "pics": null}}, {"review": {"des": "Mm.. the first time I came here was about 2 years ago and it was such a great Sunday brunch experience I thought that this would be the perfect brunch spot after Easter mass at Holy Name.<br><br>Fast forward 2 years though, the brunch went up from $35 to $38, the mimosas from $3 to $5, and the bloody mary's from $5 to $7.<br><br>Still relatively reasonable considering the crazy prices some other places were charging for Easter brunch so I thought, meh, why not?<br><br>Well...things started off a little rocky. I could not understand my waitress. Literally, I just nodded and pretended to kind of know what she was talking about. But it's a partial buffet so who cares right? <br><br>As others have commented, their brunch is set up like their dinner buffet - you go to the self-serve area for salads, etc. and then the servers come around with skewers of meat and slice them for you as you'd like. I'll save you the extra reading as to what was served - my fellow yelpers here have covered enough. Everything was good..theoretically. However, everything was SO SALTY. Holy sodium!! I downed so many glasses of water, all I could do was keep running upstairs to empty the bladder. Everything was so salty even my bloody mary tasted like relief from the sodium.<br><br>Twenty four hours later, I still feel a bit shitty.<br><br>So..$100 later? will I be back? Probably not.", "pics": null}}, {"review": {"des": "I'm giving this 5-star for food, and 4 for service. Read on to see why! After some shopping on a cold day, my cousin and I were making our way to a place near ZED451, but we happened to see the happy hour special while waiting at the stoplight so we decided to go in to check it out! <br><br>AMBIANCE: It felt like a similar feeling to other steakhouses, but more upscale and cozy. They had bar and snack area (where we sat), right of the entrance, and what seems to be the main dining area, left of the entrance. There was a cute fire place that separate a waiting area with a small walkway and wooden benches. Cute photo-op!<br><br>SERVICE: The service was phenomenal compared to regular dining service. The staff was very attentive, but when it got busier, it was harder to get their attention. It wasn't until we asked if they turned of the heat because my cousin and I were freezing before AND after the food came, that they told us that their heater wasn't working that day. It would have been nice to know that earlier, especially on a day with a high of 30 degrees outside. Other than that, our food came out promptly and timely!<br><br>FOOD: Besides the fact that it was cold, the food was phenomenal! Their happy hour special was 1/2 off the their cravings menu! We took a look and saw they had Mac & Cheese Croquettes and we were sold! This be came our dinner instead of a snack! We ordered the croquettes of course, the Hanger Skewers, the Sweet Potatoes Tater Tots, the Grilled Meat and Veggies Cheese Fondue, and the Tuna Poke Bowl. We had a feast! The tuna poke bowl is okay for the price we had to pay, but I'd say try other stuff on their menu! The fondue is so good! The meat is slightly spiced so it give a kick to the meat, and then the cheese is the extra cherry on top! Such a big portion too! The Chimichurri Sauce made the hanger steaks so addicting. We couldnt stop eating them! And sweet potato anything is delicious, and the tater tots upheld the end of that statement!  Our favorite was of course the Mac & Chees Croquettes!  This are like the best things ever invented! :D Need to order more of those next time!<br><br>Will be back for the food!... but hopefully there both heat and AC for the respective cold and hot weather!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/u4W5cAHqssRwug0U77mhuQ/168s.jpg", "caption": "Dinner: sweet potato tater tots and grilled meat and veggies fondue!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ab6BosuriwPl_bCspJJbrw/168s.jpg", "caption": "Snack: hanger skewers, mac and cheese croquettes!"}]}}, {"review": {"des": "One word. Horrible! The over all appliance is pleasing to the eye maybe 50% of it. But the host and servers and bartender leave you with the impression that they hate there jobs and only cater to certain people. There understaff and those who do work here have a very bad attitude and makes you feel like Wendy's has more class when catering  there costumers. Then zed451. Also its very difficult  getting a server to serve you. I have a better chance in getting serve a buffalo wild wings then here. My over all impression of zed451 one star! If i had the choice i wouldn't give them one.", "pics": null}}, {"review": {"des": "This was one of the most delicious and memorable experiences. We tried almost everything and it was all so good.  Fernando was our waiter and he was great.  Our waters were always filled, food kept coming, and he was genuine in taking care of us.  This man deserves a bonus! <br><br>We'll definitely be back for another soak occasion.", "pics": null}}, {"review": {"des": "ZED451 has always treated me well. With its stunning rooftop in the summer, its cozy fireplace in the winter, its myriad of food choices and most importantly - its $4 glass of wine happy hours, I can always count on having a good time here. I frequent the bar more than the restaurant due to the aforementioned $4 wine nights and I do love the bar. It's spacious without feeling too trendy and there is a huge screen to watch those all important sporting events. <br>The restaurant is equally as beautiful; especially the upstairs area. In the summertime you can enjoy one of Chicago's best and most intimate rooftop scenes as well. <br>ZED451 is a great place to host events as well as there is ample space for both sit down and reception events. I have attended and hosted a few occasions here and they do a great job.", "pics": null}}, {"review": {"des": "A CHICAGO GEM!<br><br>Always have a great time at Zed, much better than Fogo because they bring out things other than grilled red meat.  They have a grilled fish, ckn livers...etc.   There is only so much grilled red meat before you get tired of it.  Zed likes to mix things up with things such as grilled fish, livers, chicken..etc.<br><br>the buffet is also more gourmet than the standard salad bar you get at Fogo. Very accomodating and you can always get a table. Give Zed a try, you'll come back over and over!", "pics": null}}, {"review": {"des": "We had a private party and rented out the upstairs.  I had expectations that we were going to have great service, the meat would be plentiful and the salad bar would be great.  None of that was true for me:  the salad bar pales in comparison to Fogo, the service was just OK and we had to continue to ask them to bring out more meat for the group.  In the beginning when we first sat down one of the guys we were with asked for a specific type of meat that he'd had previously and they told us no problem.  After countless requests and a complaint, he finally got the meat and it came out so raw that he didn't eat it.  We will never choose this place again for any event.  We had high hopes and unmet expectations", "pics": null}}, {"review": {"des": "I did a staycation to Chicago for the weekend and went to a bunch of fun, exciting places, ZED451 among them. I was hoping to enjoy the rooftop, but it was raining all morning, so that was a no go.<br><br>I made reservations for two for a Saturday morning brunch just in case as I have no idea how busy some Chicago restaurants will be. Reservations were not needed, but they were nice to have. I am sure Sunday brunch is much more popular. <br><br>We were promptly seated once walking in. Our waitress was friendly and attentive. I ordered the Blood & Sand, which is a great late morning whiskey cocktail and my girlfriend ordered a Mimosa. Mimosa's are still $5 for anyone wondering and they are still a fantastic value. The waitress explained the process of how brunch worked. (We haven't been to Zed451 before, but we have been to other Brazilian style steakhouses). It works pretty much the same way. You place the stone from the tray onto the table. The waitress will come by with a plate and the chefs come around with different skewers of meat and you tell them how much you want. You then use your tongs to grab the meat, When you're done with wanting meat, put the stone back and enjoy the food until you want more.<br><br>I thought brunch was a great value. All the meats were phenomenal, which included: brisket, steak, buffalo chicken & a mini waffle, maple cajun bacon, blackened catfish, and roasted turkey breast. They also come around with fresh homemade cinnamon rolls which were delicious as well. <br><br>I am not the biggest fan of buffet style and try to avoid them as much as possible, but I think Brazilian steakhouses are the exception as everything was fresh without any touching the food and then putting it back, which is the reason I avoid buffet style. Anyways, enough ranting on why I don't like buffets. There is a huge selection of items at ZED451. I had a bunch of the charcuterie and cheese selections along with fresh fruit. They also have ample desert options such as creme brûlée. All were very good. <br><br>Additionally, my girlfriend has a pretty bad fish allergy, so the chefs were able to create a sampler platter of meat that didn't have any cross-contamination between fish and other meat so to be on the safe side as they do serve catfish in the morning. I thought this was very accommodating. <br><br>Two other small tidbits. Bathrooms are on the second floor for anyone wondering... And they have a shuttle service available after you're done paying for your meal available if you want to use it to get to somewhere downtown. <br><br>Overall, the place is gorgeous, the food was very, very good, and service was excellent and very accommodating to my girlfriend's fish allergy. I will definitely be back to ZED451 when I am back in Chicago and recommend this over some of the more \"popularized\" Brazilian steakhouses out there right now. Enjoy the experience. Hopefully, you'll get to enjoy the rooftop when it's not raining or cold in Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HXNxvGk4-_GNt0e-SMpRsw/168s.jpg", "caption": "The amazing platter of brunch meats."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/y6UwuHrHoduJLa7E09zUIA/168s.jpg", "caption": "Two large delicious cinnamon rolls."}]}}, {"review": {"des": "One word describes their sales team.. RUDE.<br>I spoke with Sammy about potentially renting out the bar area for my birthday. She was extremely rude and not helpful at all. At one point, she even said to me \"I hate to cut you off, but I have to go\". DO NOT BOOK an event here. It's painful.<br>Great food! But just not the place for parties.", "pics": null}}, {"review": {"des": "My husband and I went here for a birthday celebration and a  date on Sunday. Even though the weather was sweltering and too hot to sit outside, the outdoor Rooftop Bar is great. We opted for the bar inside. It turned out to be the best decision, it was much cooler.   The reason we give this four stars is not so much for the food but for the service. We had the pleasure of having Travis serve us.  He turned our experience from average into superb!!! The place is great, the food is good, and if you're lucky enough to get Travis you will have an all-around wonderful time.", "pics": null}}, {"review": {"des": "I love love love love Zed451. Although I've only been here twice, this place just always seem to amaze me and it's just so beautiful. <br><br>My first time experience was for my birthday dinner and the selections of meat was amazing. Made a reservation for two for a Sunday dinner with my boyfriend and our waitress was very friendly. It was our first time there and they were very helpful in giving us an overview of how their systems work. The concepts of using stones to have the selections of meat come over was very cute and their salad bar was HUGGGGEEE. Even the chefs were helpful and friendly. <br><br>My second experience is with the rooftop and the vibe is just so chill and awesome. Such a cute romantic setting as well even though it was a girls night out. Drinks & food was amazing. <br><br>Overall, I had a great experience and can't wait to come back for another amazing experience!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mLNnu2caqMWLs7zyJ4Vf7A/348s.jpg", "caption": "Meat fondue"}]}}, {"review": {"des": "My husband & I went here  to celebrate our Anniversary. Jenny was our server. She was very friendly and told us how her parents Anniversary was also today. This was our 1st time here and she took time to explain everything from the bar to how the meats come out. We both like our meat well done and they accommodated us. The food was great. Service was great. Jenny even bought out cake for our Anniversary. If you visit this place asked to be seated in Jenny from the block section. We will definitely be back.", "pics": null}}]}