{"name": "zizis-cafe-chicago", "reviews": [{"review": {"des": "Chicago is overrun with good food, and it's a problem because the list of restaurants I want to try is growing faster than I can cross them off the list. Despite this, Zizi's is one of the few places that i continue to come back to in lieu of exploring new offerings. Coming to Zizi's is like going to a good friends home. The staff are friendly and funny, and the owner is always there to greet you and make sure your experience is an excellent one. They are BYOB, so with the right group of friends, eating at Zizi's always feels like a celebration.<br><br>If for no other reason, you should come to Zizi's for the complimentary house bread and carrot spread. The spread is a delicious combination of shredded carrots, yogurt, and tons of garlic, and is served with a freshly baked basket of fluffy Turkish bread. This complimentary appetizer is refreshingly unique and flavorful in a world where more often than not you're served a basket of sliced grocery store bread.<br><br>A couple baskets of bread, a few home-brewed beers, and many laughs later you're ready to receive the ultimate bounty of Zizi's, the Sultans Platter. This platter is loaded with a selection of all of their best dishes, with 4-5 varieties of roasted, grilled, seared meats, veggies and flavorful rices, baba ganoush, hummus, and delicious sauces. It comes out literally on fire, really making you feel like a Sultan. The menu says it's recommended for 2, but I firmly believe that was a typo and they meant 2 families. Despite your best efforts, even a Sultan will have to take home some delicious leftovers.<br><br>Zizi's also has a variety of fantastic appetizers, dinner plates, and desserts that never fail to disappoint. Come by for lunch and try the Doner Kebab and fries, or come back for an intimate date night with any of the lighter Turkish dishes. The bottom line, come back and eat more.", "pics": null}}, {"review": {"des": "This place is a byob so I do my best to not show up empty handed. I always find that having a little drink to accompany a little food is never the wrong move. However, since I tend to eat a lot of food here I also bring a lot of drink.<br><br>They start off with warm bread and this Turkish carrot dip. Hot bread and this dip is one of the best things I've put in my body. The dip is really creamy, garlicky, and makes you think you're being healthy since there is plenty of carrots.<br><br>We got the combo plate of veggie appetizers so we could have a taste of all the non-carrot dip things that would go well with the bread. I'm not a big eggplant guy, but the two eggplant dips on this one were incredible. <br><br>Obviously the fried cheese cigars were phenomenal. It's like they took and eggroll and removed everything inside and replaced it with feta. Smart.<br><br>To wrap it up we got the sultans platter. This tray of chicken, gyro, sausage, and steak is the perfect way to save or meal from being vegetarian. Every component is delicious. It's literal fire!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uE5lS5eNO5agH75ck98KKg/348s.jpg", "caption": "Warm bread"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CU9PC_I7I5K_s59TSyuQnw/168s.jpg", "caption": "Combo Combo Starter Platter"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/S7Z_g6MgoERyje37Na1pdw/168s.jpg", "caption": "Cigar Borek"}]}}, {"review": {"des": "Seriously amazing food and amazing service. Also very accommodating and so sweet to our pup too. Makes me want to be best friends with the owner and workers :) My new favorite place in the city to eat.<br><br>The homemade bread  <br>The falafels  <br>Lamb döner  <br>Chicken kabob  <br>Roasted veggies  <br><br>All in all, pretty dang impressive.", "pics": null}}, {"review": {"des": "Good portions and nothing tasted bad, but this had to be the least flavorful Mediterranean food I've ever had. I had the chicken doner hummus plate and she had the falafel (which she really liked). The service was attentive and the establishment was clean etc. Just needed to use more spices or marinade or something. <br>PS: it's BYOB", "pics": null}}, {"review": {"des": "I LOVE THIS PLACE!! There's nothing better than a family-owned, authentic restaurant..especially middle eastern! This Turkish restaurant has lived up to my satisfaction every single time. I've been there three times now and ordered the same thing 2/3 times. When you sit down, they give you a complimentary dish of the most amazing, thick, warm pita in a stringed carrot type dip. It's delicious. I've also ordered the smoked eggplant appetizer twice, and it's SO good if you like eggplant and a smoky flavor. My go to entree is the lamb doner kebab platter. They serve you enough for three meals. The first time I went, they gave us a complimentary dessert pudding to go. They are so so nice here and the service is fantastic. This is definitely one of my go to places for a lot of great food at an inexpensive price.", "pics": null}}, {"review": {"des": "Trek-worthy. One of the few Turkish restaurants in Chicago, and prolly the only one who puts a LOT of TLC in the dishes they serve (see open kitchen video).<br><br>Caution: Group BYOB may limit table turn-over.<br><br>Dishes are best enjoyed when shared as it is plenty of food.  Clean taste with well-seasoned complementary flavors.<br><br>Complementary BREAD AND CARROT SPREAD (puree preferred rather than chunks) is much appreciated.  Thank you!<br><br>EGGPLANT LOVER (aka BABA GHANNOUJ) with DÖNER KEBAB with just right mixture of ingredients serves 2+.  Interesting BULGUR is couscous' cousin twice removed -- different look, feel and bigger.<br><br>Single-serve TURKISH CHAI TEA (wishing for a pot next time).<br><br>SKIP the excellent tasting TURKISH COFFEE as there are more coffee grounds (1/4-1/3 at bottom) than coffee.  Beautiful presentation.<br><br>KAZANDIBI is a okay.  Casually prepared firm custard (NOT the love child of Panna Cotta and Flan as a Yelper described).  Due to online photo search, my expectations were unusually high than the reality. Better consumed when thawed a bit.<br><br>$15 TURKISH BREAKFAST serves 2. A wonderful morning feast. SPINACH PIE is different from Others, more like a meal due to onion. I didn't care much for the eggs. TURKISH SAUSAGE in the eggs is a must try.<br><br>SKIP generic Columbian drip coffee.  Indulge in TURKISH TEA in a pot (keeps it warm for a while).<br><br>1-star less due to pack your own Brown Bag during a Table Service.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zKdfazNf-fei83xboi1xww/348s.jpg", "caption": "Zizi: $7 Freshly Made Kunefe (takes 15 mins), Serves 2"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8U5aehvT-UkqvGVamZH4FA/168s.jpg", "caption": "Zizi's: $15 Turkish Breakfast (Brown Bag, Spinach Pie)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lKdyn6Tq8HIoSoMwGHMMYA/168s.jpg", "caption": "Zizi: Kazandibi with Turkish Coffee"}]}}, {"review": {"des": "Overall, a good experience. We stopped by Thursday evening and we were greeted and seated promptly. There were a few other occupied tables. I liked the open kitchen and the décor - it was cute and somewhat homey. I loved the complimentary carrot spread and sesame bread - this was delish. I haven't had the carrot spread before and the bread was nice and hot. I was really craving dolma so I had that and falafel. Both were decent. Boo had the chicken doner, which was also pretty good. Everything was fresh, but I just wanted a touch more flavor/seasoning on everything. Also, our waitress asked if we wanted hot sauce and I said sure, and she returned with sriarcha... pretty disappointed in that.<br><br>Service was very good. Our waitress came by regularly and waters were always refilled. Also, she brought us out a complimentary rice pudding at the end, which we enjoyed.<br><br>All in all while we enjoyed the food, it was not the best, especially for the steeper price tag.", "pics": null}}, {"review": {"des": "I recently checked out Zizi's with a friend because it was on his list of places to visit. I was pleasantly surprised by the food I ordered. <br><br>I really like that Zizi's is located right off the brown line ans only a few blocks from the red line. I did not have an issue locating the restaurant. <br><br>My friend and I were able to sit outside since it was beautiful outside. The inside of the restaurant is spacious enough to hold a variety of group sizes. <br><br>The waitress was very attentive and didn't try to rush us to order since we were busy catching up. I ended up ordering the Zizi's Favorite: Pizmahmagun Wrap. I would say the wrap is the best bang for your buck because it is large and not too expensive. The wrap was absolutely delicious and I was able to have the second half for lunch the next day. It sat really well which is a plus. <br><br>I was not impressed by the carrot spread. It was runny and flavorless. It was not great especially with the bread that was offered. I am just happy that it was a complimentary item.<br><br>I will say there is one thing that really confused me during my visit. I arrived at the restaurant a little early so I stood outside to read the menu posted on the outside wall. A gentleman that worked at the restaurant ended up watching me a little too close. He stood in the doorway, he did not say anything to me, but watched me which was slightly odd.", "pics": null}}, {"review": {"des": "Great authentic food.  Good size portions, decent prices and great service.  It's BYOB also.", "pics": null}}, {"review": {"des": "I was so not expecting such as awesome experience, but Zizi's blew it out of the water! We came in early-ish on a Friday evening, and we were able to get a table right away. As we were checking out the menu, our server brought over the carrot spread and a basket of bread. Holy. Moly. The carrot spread totally exceeded our expectations. It was fresh, garlicky, and light. The bread was hot out of the oven! Super fluffy and packed with flavor. I ended up eating way more than I intended, but how could I not?!<br><br>Then, our entrees came out. I got the Kofte Kebab platter and my husband got the Turkish Feta salad (and added chicken). I grew up eating kebab, and the kofte kebab took me right back to my favorite moments as a kid. My husband LOVED the feta salad too!<br><br>Afterward, we were so food happy. As we were waiting for the check, our server brought out some kind of heaven in a bowl. It was a rich vanilla rice pudding/custard... just... wow. It was so crazy good!<br><br>My only regret is that we don't live closer. We're definitely coming back when we're back in Chicago next!", "pics": null}}, {"review": {"des": "My husband and I don't really eat out that often, but when we do, Zizi's is our regular choice. The food is tasty (not too salty like some mediterranean restaurants), fresh, filling and the service is always great. The lunch special is an excellent deal. I think my favorite two dishes are the Veggie Moussaka and the Lamb Doner. Also, they have kunafe which is amazing because I'm not sure where else to get that in Lakeview!", "pics": null}}, {"review": {"des": "Amazing food. And fantastic service. The staff treats you as family. Definitely my new go to food spot.  We got the lentil soup, iskender kebab and lahmacun. Absolutely phenomenonal.", "pics": null}}, {"review": {"des": "What a cool place this is.  You feel like you are being cooked for by a small Greek family.  They make you feel right at home.  I searched this place out looking for a traditional Doner Kabob, like the ones I used to get in Germany.  This wasn't quite what I would get, but it is the closest I have found yet.  The bread they start you out with is amazing and is good with your dinner selection.  The absolute highlight was the baklava!  There is also a very cool arcade right across the street to relive your 80's arcade days!", "pics": null}}, {"review": {"des": "Wowowow. What an unexpected treat. Stopped in here before heading out to a bar for the night and was completely blown away by all<br>The deliciousness that was thrown at me. Let's start with the bread that they bring to the table. So much bread. It was so freaking good too. Warm, crusty and soft at the same time. Just yum. Then I ordered the falafel wrap, which came with fries. It was massive. Such a stinking deal. I'll definitely be back. Loved this place.", "pics": null}}, {"review": {"des": "This is one of my favorite restaurants in all of the Chicago area. The minute you walk in, you are greeted by the owner and his beautiful smile. After you are seated, bread is brought to the table with a creamy carrot dipping sauce. The bread is crazy delicious and out of this world. It comes out straight from the oven, not heated, as you can tell by the way it melts in your mouth.<br><br>As an appetizer, I always order the Dolmas, and I am beyond satisfied every single time. The Avocado/Kale Salad is one of my favorite items on the menu. It's extremely fresh and happens to hit the spot every time. I've also tried their falafel and almost all of their Combo Platters; being middle eastern myself, I can definitely approve! <br><br>It's always a pleasure to come back.", "pics": null}}, {"review": {"des": "I'm sooooo happy! I've been looking for a great, authentic, casual Turkish place ever since Turkish Cuisine and Bakery moved from Andersonville. <br><br>Don't let the casual, modest interior dissuade you because the food is outstanding, richly flavored with fresh ingredients and marvelously spiced with a melange of traditional, yet familiar Turkish spices.  (I'll spare you my overland and sea spice route lecture and thus why Turkish Cuisine is so flavorful). <br><br>I was by myself so only tried the soup, combo platter and an off the menu peach pie dessert. Everything on the combo platter was so good I couldn't decide which was going to be my final bite. (The smoked eggplant salad won). <br>Ii<br>Xoxo, the owner, despite being busy with a steady influx of take out customers, and the kitchen finds time to personally greet his guests. Sasha, my and everyonAlden's's server is very sweet and did a great job quietly, diligently and efficiently attending to everyone's needs. <br><br>The final killer, it's BYOB!! <br><br>I'll be back a lot. Hope to see you there!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FfrhaHKWOjvo59B9tL_-nw/348s.jpg", "caption": "Greek moussaka"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ypiv6ha-kOhUXM_AeybNBA/168s.jpg", "caption": "Combo plate"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/__P2s0ZqBBZCqgPVX5PHOA/168s.jpg", "caption": "Kofke meatballa written eggplant"}]}}, {"review": {"des": "We stopped in for lunch, I tried the smoked eggplant salad which was good and lahmajun, which was a very generous serving, but I've had better. My friend didn't like her chicken kebab, which I haven't tried. We finished the meal with baklava and some flan/custard type of dessert, which I enjoyed. The restaurant is BYOB.", "pics": null}}, {"review": {"des": "I left full after a generous portion of moussaka. Very tasty.", "pics": null}}, {"review": {"des": "This place is amazing and my go-to spot when I don't pack a lunch. It has some of the best soups I've ever had. They are flavorful and hearty. Trust me you cannot go wrong here. I just ate their lamb and barley soup and it's bringing me back to life during this cold & gloomy day. Their homemade pita bread is the perfect side for my soup! Another recommendation from their menu is their pizmahmagun wrap, which is excellent and a generous portion size- I had leftovers. Props to the owners and cooks.", "pics": null}}, {"review": {"des": "I was super disappointed by the food here. There just wasn't much flavor. I got it to-go so maybe that is why it wasn't a good experience.", "pics": null}}, {"review": {"des": "GET THE LAHMAJUN it is the Turkish Pizza!!!! This place became one of my favorite places here in Chicago! The food is always freshly made;AND THE BREAD is EVERYTHING. It may look like your average neighborhood curry out place but Zizi's Cafe is beyond that. I usually do to go oder but the friendliness of the staff and Zizi him self also the speed of service encouraged me to plan a night out with group of friends; and I was not disappointed, the food always come warm within a reasonable time of period! It's also a BYOB! If you're fan of Kebab and middle eastern cuisine this is the place you're looking for! It's family/large groups friendly! If you never tried their brunch you're missing out big time.", "pics": null}}, {"review": {"des": "on a falafel hunt...<br><br>but unfortunately this place fell short; mushy and grainy :(<br>but hummus and carrot spread and their to die for turkish bread will keep me coming back. will need to find something else that suits my tastebuds as my main meal.", "pics": null}}, {"review": {"des": "This is our neighborhood gem.  Zizi is a family run operation that makes you feel at home from the moment you walk in the door. They aim to please and succeed from both a service and food perspective.  In addition to service and food, you get great value.  Prices are very fair for the quality you receive.  The Turkish feta salad is so good.  I added chicken on mine and it just made it that much better. My wife had the beef kabob and it wowed both of us!  So tender and well seasoned.  We both agreed that we need to make this a weekly stop!", "pics": null}}, {"review": {"des": "Great place <br>My favorite Turkish Resturant <br>Awesome staff<br>Delicious delicious food<br>I love thos", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hPkkXcRwpFLb-5u5RNbx7A/348s.jpg", "caption": "Kunufe with ice cream  heaven on earth lol"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EoENWUnlUTYdIV19GzSzOA/168s.jpg", "caption": "Desert kanafeh"}]}}, {"review": {"des": "Great service and food! Veggie wrap was heavy and delicious, bread and carrots for the table was amazing. Would come back again!", "pics": null}}, {"review": {"des": "Let's start by saying I walked in and wasn't seated for 5 minutes. The waitress walked past me several times, definitely noticed me, but didn't say a word to me. The waitress continued by saying I could sit wherever. They should put up a sign for you to seat yourself. During my time there she didn't talk much to me just handed me my food. Would have given 3 stars but this definitely knocked it down to two. <br><br>Hummus was 6 dollars. Came with 4 pieces of sliced carrot and 4 pieces of sliced cucumber. By just looking at it, the amount looks worth it, but the hummus was very average. Nothing else comes with it, BUT they do give you bread before that pairs well with the hummus. Honestly, not that worth it. <br><br>I also ordered the Zizi's Favorite Pizmahmagun Wrap with lamb, which came with fries. The wrap was huge!!! Again, just looking at it you'd say it's worth it. I ate half and it was absolutely delicious but as I got towards the end, all that I got in a bite was red onions and cilantro. The half also began to fall apart towards the middle (of the half). The fries had a light crisp on the outside, but were also a little soggy.  They were lightly salted and over peppered. Ultimately they weren't as enjoyable as I thought.<br><br>Mainly just came since it's near my apartment, and probably will only come back if I'm insanely hungry and nothing else is open.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/C7y3VWnj5OCmz9gaUrqA1A/168s.jpg", "caption": "Zizi's Favorite Pizmahmagun Wrap with lamb"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yba90wEtfw6d9c51dTYUyg/168s.jpg", "caption": "Hummus $6"}]}}, {"review": {"des": "We decided to try this place out for dinner during the week because of all the great reviews.  And they don't lie!<br>The service was very fast & everyone was so nice. <br><br>They bring out some free bread & free carrot spread to start.  The bread is so good! Warm, light & fluffy!  We basically filled up on bread. It's hard not to eat it all!<br><br>They also gave us a small plate of the smoked eggplant salad.  It was very fresh tasting and had a great smoky eggplant taste.  They also refilled our bread.<br><br>We ordered the Pide with Chicken Doner and Cheese.  It is definitely big enough to share!  It came out nice and hot.  It was like a Turkish quesadilla or pizza pocket.  Definitely good for a picky eater.   Basically just cheese and chicken inside baked dough.<br><br>We also ordered the Combo Platter.  Also big enough to share!  A great way to try 4 different options!  I loved the salmon & chicken doner!  My husband loved the lamb doner & kofte.  Worked out perfectly!  We got half rice & half couscous (recommended by our waitress) and it was perfect!<br><br>They also gave us some free dessert.  It was a Turkish custard.  Not too sweet kind of like rice pudding. <br><br>I would definitely come back! Also BYOB!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gdYp663yt2qtOR3yh4RjfA/348s.jpg", "caption": "Combo Platter"}]}}, {"review": {"des": "This place is fantastic, would recommend to a friend.<br><br>We came here in a group of 4, of which 2 had never been to Zizi's before. When we asked the waitress for suggestions, she suggested sharing the Sultan's plate and perhaps one additional dish so we started with the Sultan's plate and figured we could always order more. <br><br>The wait for the food was reasonable (perhaps a bit on the longer side, but then again the plate came with a LOT of food). When it came out, the presentation was great - it included a flame in the middle of the plate to keep the food warm (or perhaps just to make people like me take its picture). <br><br>As we started eating, all 4 of us agreed that the food was delicious. And not just the meat, but also the rice and the bulgar which many restaurants seem to gloss over. <br><br>Moreover, this plate which was supposed to have been for only 2 people according to the menu ended up being more than enough for 4 adults. Can't complain about great value! We even ended up with some leftovers to take home.<br><br>The decor is so-so, but let's be honest - if you are coming here, its for the food. I give it 5 stars - would come here again!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/l-lcHZEP5R_V_LqpHlfzlw/168s.jpg", "caption": "Dessert for 4!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/L4DN1btCxllOqz1lKqZBtg/168s.jpg", "caption": "Sultans plate (allegedly meant for 2, but it comfortably fed 4 adults and we had leftovers)"}]}}, {"review": {"des": "This place is ok, nothing special. I think it deserves lower reviews, more of a 3 Star joint.", "pics": null}}, {"review": {"des": "I found my new favorite Turkish place in the city. I had the iskandar, which I guess is a Turkish gyro, and it was the best I've ever had. The meat was moist and the portion was very generous. My wife had the chicken wrap which she also loved. Super friendly service. We will be back very soon.", "pics": null}}, {"review": {"des": "One of the best Turkish Restaurant in the city. Everything has a lot of flavor and the boss is there to greet you when you enter. Really nice restaurant with amazing warm welcome.<br><br>Everything good guys...", "pics": null}}, {"review": {"des": "This is the place for authentic middle eastern food full of flavor. I've gotten the lentil soup, falafal wrap and tabouleh salads. Portion sizes are great too for the price. Also, service is awesome and accommodating with my concerns about dairy and meat.", "pics": null}}, {"review": {"des": "I wanted a legit doner and Zizi's serves real authentic doners (not gyros). Impressed with their complimentary bread I decided to go for doner sandwich instead of the rice plate. Meat to bread ratio was perfect (see pics). I do think their tzatziki could use more flavor and that they should make their own hot sauce but overall this is an authentic turkish spot. I will be back to try their doner plate and other things", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/n92Rgs9Hj6V9VCrY_NAyuQ/168s.jpg", "caption": "Doner with amazing fries"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VS2HecNeBSamFS7A16T44A/168s.jpg", "caption": "Side view of doner kabob. Delicious"}]}}, {"review": {"des": "Amazing. I love the service and the food. I recommend trying them at least once. <br>Also, the bread is so good.", "pics": null}}, {"review": {"des": "I love it - the best food and service <br>Great askander- gyros <br>I can't wait to try the rest of their menu", "pics": null}}, {"review": {"des": "I've been coming here for over a year now. My buddy introduced me, and I haven't been able to shake the hankering for their Chicken Doner Sandwich. Also when you sit down they have this like shredded carrot salad thing and it is amazing as an addition to the sandwich.<br><br>I ordered take out yesterday, and called it in. It took me about 8 minutes to get there and by time I arrived it was ready to go. Honestly made my night after a long day at work. The owner even added a complimentary custard dessert that was a great way to end the meal.<br><br>Nothing but great things to say about this place.", "pics": null}}, {"review": {"des": "Laid back restaurant with freshly made Turkish / Mediterranean food. Good for groups and families. we brought in 2 bottles of wine as it is supposed to be BYOB but we were charged $3 per person...that was kind of a bummer. Otherwise the food and service was great. <br><br>They brought over freshly baked warm bread that was too addictive and a plate of garlicky yogurt carrot spread which was excellent. We ordered the smoky eggplant salad thinking it was the same as babaganosh but none of us seemed to like it. it was very smoky and had no tahini sauce in it. We ordered a Turkish salad with chicken (good) and the sultan's platter. the description for Sultan's platter says it's for 2 people but it was a lot of food with at least 4 different meats, some veggie patties (not falafel) and 2 kinds of rice and more eggplant. Everything we ordered fed the 5 of us and there was enough leftover for another whole meal.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LECAYlvtP4T8hYQ7-NmWuA/168s.jpg", "caption": "Sultan's platter"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-8DFGeUBigK-iyk7-e58mg/168s.jpg", "caption": "Sultan's platter"}]}}, {"review": {"des": "This place was great!! A real 5 star! I liked the traditional decoration, the food and desserts were great and the service was the way you felt at home. We ordered kufteh kabob I can't describe in words! But you can try. My friend was leaving US and when they figured they brought us tea on the restaurant with the kunefe that we ordered. They also brought us some Kazandibi because we didn't know choose kunefe or Kazandibi. Definitely comeback with more friends!", "pics": null}}, {"review": {"des": "One of the best takeout spots in our neighborhood. We actually don't dine in, only ever get carry out, but their food is so delicious and the service is good.", "pics": null}}, {"review": {"des": "This is our second time to Zizi's this week, both times for lunch. The food is delicious. We have eaten both meat and chicken doner, kefta, and the iskendar platter (cubes of their delicious bread covered in a warm and spiced tomato sauce, topped with fresh doner, and with a dollop of cool yogurt).  We highly recommend this place, as everything we have had here is delicious!", "pics": null}}, {"review": {"des": "Kofte kabab was the most delicious kabab I've ever eaten!! Everything about this place is wonderful.", "pics": null}}, {"review": {"des": "My friends and I, being in the mood for some Turkish food, gave this place a visit. After deliberating over whether we should opt for a pide, Zizi's favorite Pizmahmagun wrap, or the highest priced item on the menu, the Islander Kebab, we consulted our server (and presumably restaurant owner) and without hesitation he recommended the Iskander Kebab over all else. His confidence was infectious and inspiring. As such, we all took the bait and ordered 3 Iskander Kebab entrees. The man did not disappoint. <br><br>The restaurant also gave us a free appetizer (bread with some carrot spread), which I think they give everyone. However, the owner also gave me and my friend a free dessert (rice pudding; it was good) for licking our plates clean, and we licked that dessert clean too. <br><br>Overall, a very satisfying experience. Will definitely be back to try other items on the menu. <br><br>The only criticism I have of this place is that they charge a $3 sharing fee per person if you share your food, which makes no sense to me.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vyM7PFQ6DYqlAfMZ2oVeqA/348s.jpg", "caption": "Iskander Kebab plate"}]}}, {"review": {"des": "Great Turkish cuisine.  I have an eggplant allergy and our server recommended what to order to get the full experience while keeping my allergy in mind.  <br>Everything was so delicious.  And she brought us a free dessert!", "pics": null}}, {"review": {"des": "A good friend from Turkey took me here. To beging, the owner is a great guy. We at first wanted to order a few things, but he knew it'd be too much and cancelled orders for us. He took care of us the whole night. The food was fantastic, and my friend said even stated it tasted like home. I highly recommend checking out this restaurant.", "pics": null}}, {"review": {"des": "I've been trying to eat healthy lately and decided to give this place a shot to try something new. First of all, I got a kale salad (kale, tomatoes, cucumber, avocado and onion). This salad on its own was $10 which seems like a lot already but there is avocado on it so I got it. I added salmon for an extra 6$ so I paid almost 18$ for the salad on its own. I realized what I was paying but the food was really bland and I really was not a huge fan of the dressing that was provided with the salad. I just feel like it's too overpriced for what it is. I wouldn't have minded paying that much for the food if it was good but the salmon was bland too and I feel like 10$ for a kale salad is just a little much. I could've gone to the Potbelly down the block and gotten a spinach salad with all those ingredients and chicken for 10$ less. If I ever come back here I'll definitely be trying something else besides their salads.", "pics": null}}, {"review": {"des": "Giving three stars for price. It seems a tad bit high and I didn't see a stand out value with their food. While it was hot and fresh. It came at a price. I got their zizi house wrap with a side of hummus. It comes with the side and was about $20 bucks. They have a huge dining room and a few street side tables. Please don't get me wrong. The food is good. It's fresh. It's clean. It's served nicely. It was just on the high side of what I normally see at businesses of their same caliber.", "pics": null}}, {"review": {"des": "This place was outstanding! Food was exceptional and service was phenomenal! We will be back. A great little gem in lakeview thank you!", "pics": null}}, {"review": {"des": "I have been to this restaurant many times, I can honestly say that every time I am even more amazed how great Turkish food is.<br><br>The owner Zizy is such a great guy , and he always makes sure that everything is fine. Makes great suggestions and always takes care of his customers. Food is always fresh and so delicious. Prices are reasonable. This is a great place to hangout, BYOB too. <br>There is something for everyone here, you won't be disappointed.", "pics": null}}, {"review": {"des": "Fantastic quality and great price!  I Enjoy lunch here often. Great customer service, fast carryout/pick up.", "pics": null}}, {"review": {"des": "Do you like tasty food, variety of choices, suggestions of what to eat from the owner, amazing bread, quick service? Then Zizi's is your place. Love the seasonings on the chicken, the rice is yummy, desserts are WOW. I just can't say enough about the food and friendly folks who work there.", "pics": null}}, {"review": {"des": "I'm really glad I got to try this place since I've been having a craving for Turkish/Mediterranean food since coming back from Turkey. I ordered Zizi's favorite wrap and the portion size is quite tremendous. While it was satisfying and I liked the meat, it fell quite short of what I had in Turkey (look up Durumzade - a shrine should be made for that restaurant). It was savory but I wished there was more vegetables and flavor inside the wrap. <br>The fries are average and could have used more seasoning. <br><br>Still, it's a nice environment and it would be a great place for a quick lunch. They were relatively empty when I came in the early afternoon.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fVFSIGVoeXVabwPEQAh_tQ/348s.jpg", "caption": "Generous portions"}]}}, {"review": {"des": "This place has the best Turkish food I've ever had! The chef and staff are very friendly and they provide exceptional service.", "pics": null}}, {"review": {"des": "It's beautiful Turkish restaurant. Plates is great. Tea is good but kunefe is not sufficient enough. Brown hair and has glasses server was perfect.   but it was expensive.", "pics": null}}, {"review": {"des": "We eat here about once a month. Food is always great and bread is outstanding. Love the turkish", "pics": null}}, {"review": {"des": "The prices are reasonable and the food is good! The fries taste homemade and their meats are delicious! I don't know how this is compared to authentic Turkish food, but I know that it is really good! I wanted to try Turkish food and most of them are north and I didn't want to drive that far and this was one of the few in that area and it was a great decision! I recommend people to go try it!", "pics": null}}, {"review": {"des": "Very happy to have come across this place. After spending a short stint in Germany last year, I had begun to crave doner kebabs and finding a place that had plenty to offer, I jumped at the opportunity. Ordered a Chicken doner kebab, along with the lamb doner platter, enough to tide me over for two meals. The platter came with rice, lots of meat, yogurt sauce, and fresh bread. The Chicken doner kebab itself was basically all of that, sans rice, pre-assembled. I would say the sandwiches, which are cheaper and also come with fries, are the better deal. Plenty of juicy fresh-sliced meat in their incredibly fluffy and fresh bread, complete with vegetables and yogurt sauce, makes for a mean doner which matches the best I've had in Germany, and are twice the size too. ~$10 gets you a large one + nicely seasoned fries, plenty for any meal. <br><br>On the merits of their platters and side dishes, I can't really speak too much. The meat they use in everything is good, and of course, their homemade Turkish bread is amazing. The best thing here though, and what you want to come for, are the lamb and chicken doner kebabs.", "pics": null}}, {"review": {"des": "One of my favorite neighbor places! Highly recommend the carrot dip, for eat-in or carry out orders! I've been here 4-5 times and each meal I have had has been delicious and well worth it. Reasonable prices and the entire staff is so friendly and helpful as well.", "pics": null}}, {"review": {"des": "We've been to Zizi's twice now and both times have been fantastic experiences. Most restaurants today are based on turnover and rushing the customer out the door as quickly as possible. Not at Zizi's. The wait staff is always friendly and inviting. It is a place to take your time talking to friends and digging into the generously filled plates. The food is excellent Mediterranean cuisine. You can't go wrong.", "pics": null}}, {"review": {"des": "Discovered Zizi's today.  I wanted outdoor seating cause you can hear the band in the Greek Fest but what they had was taken. The owner I think basically ordered for us. The bread/pita was distinctive in a good way. We had the Sultan Plater and the beef kebab plater I think.  The food was good.  Have I had better? Yes -  Troy 2908 N Broadway comes to mind. But (and this is a good  BUT)  you can't beat the prices and the amount of food that comes with that - yes I would recommend this place", "pics": null}}, {"review": {"des": "My daughter's graduation was last night and a snafu in our pre-ceremony plans had me scrambling to find a nearby restaurant with both meat and vegetarian options. I checked Yelp! and after a quick glance at their reviews, decided to give Zizi's a try.  I gave the women who answered the phone a vague idea of what I wanted, but because I wasn't familiar with some of the items on the menu or or portion sizes, I relied on her recommendations. I ended up ordering platters of beef kabob, chicken, falafel, hummus, basmati rice and bulgar. Less than an hour after I placed he order, the food was delivered in family-style pans so guests could select what and how much they wanted of each item. Everything was absolutely delicious. We headed off to the graduation ahead of schedule, well-fed and happy that we found what could very well be one of our new go-to neighborhood restaurants.  Thanks Zizi's - you saved the day!!", "pics": null}}, {"review": {"des": "Stopped by for dinner with some friends. Complimentary carrot appetizer and homemade bread. The carrot dish is a cold shaved carrot salad with non-acidic dressing. I couldn't figure out what the carrot dish was but it was great especially when eaten with the bread. I ordered Zizi's kale salad with a side of chicken. The salad was made up of chopped kale, garbanzo beans, pickled beets and portobello mushroom and tossed in a red wine vinaigrette. The salad was fresh and crisp and the chicken had a ton of flavor. My only complaint was the dressing was a tad too acidic for me. Nonetheless I finished the entire salad. My friends ordered a variety of dishes and they all enjoyed their dishes and complimented the taste and flavor. <br><br>Overall, nice place for casual meal and to catchup with friends. The entire meal took nearly two hours and we never felt rushed. We had about 7 people in our party and even though they couldn't provide individual checks they allowed us to pay individually at the register. It's BYOB, affordable, and steps from Beercade and Diversey Brown Line.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kdnub9HmLKq0ukJb-Wz7UA/348s.jpg", "caption": "Zisi's kale salad with a side of chicken"}]}}, {"review": {"des": "This place is fantastic! Been here multiple times, brunch and dinner, every time has been just as good as the last. I also recommend this place to a lot of friends and co-workers, all of who give me great feedback on their experience. Looking forward to my next trip.", "pics": null}}, {"review": {"des": "The food here is sooooo good! I left Chicago a few years back and Zizi's is a place I miss more than most. The complimentary fresh bread and carrot dip is super delicious and flavorful. I've made a few attempts at the carrot spread but mine doesn't come close--i was so happy to taste it again (with fresh from the oven warm bread). The red lentil soup (with a lemon wedge) is classic comfort food and particularly good at Zizi's. The decor and people are warm and inviting. I tend to be a lone wolf and I never feel weird about dining solo here, there isn't bar seating but I like to choose a spot where I can see into the kitchen.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JV5sw9S-noqqH0QtlZW-vw/348s.jpg", "caption": "Red lentil soup with complimentary bread and carrot spread."}]}}, {"review": {"des": "Amazing food and great service. I love this place. The chicken doner kebab and homemade bread is addictive. They also gave me a soup (don't know what it is), but it was as so good I'm going to order it next time too.", "pics": null}}, {"review": {"des": "I'm not a big Mediterranean/Turkish food guy but this place is amazing. Fairly priced and the guy who runs the place always has a smile on his face. Had several dishes here, all delicious but my fave is the meat sampler platter.", "pics": null}}, {"review": {"des": "When I started ordering from here 1-2 years ago this place was amazing. I listened to other reviewers raving about the doner sandwiches and fell in love with the chicken doner. Unfortunately, there seems to be a change in the restaurant's quality recently.<br>The past 2 times I've ordered from here in the past 2 months, the food hasnt been ready when it was scheduled to be (once to early, cold, and once too late, waited 15 minutes extra at the store).<br>Additionally, the chicken doner sandwich (to-go) used to come with more fries than I'd ever want to eat. Now, the quantity of fries is measly and sprinkled on top (see photo). The last order there weren't any onions on the sandwich either, which may have been better for my breath, but made me feel like the sandwich was lacking.<br>I wanted to give a good review but couldn't do more than 3 stars. The food is still good, but I'm disappointed in the downhill progression of quantity/quality. Maybe better to just dine-in instead.", "pics": null}}, {"review": {"des": "Chicago offers a lot of Turkish restaurants but this is always one of our favorites.  The servers are kind and didn't cringe when we rolled in with a giant stroller and 2 kids under the age of 4. When you are seated, they bring you warm delicious bread (and they'll bring you more if you eat it all!) and a nice little starter of carrot salad (carrots, yogurt, olive oil, garlic).  We ordered the lahmacun which came on a large platter with plenty of onions, lemons, and parsley to go with it.  I recommend squirting lemon on all of it and then wrapping your piece of lahmacun around a couple slices of onion and the parsley.  I don't really like raw onions but in this case, I do.  <br><br>Next we got the doner kebab platter.  It comes on a large pile of rice and is a great portion.  It also came with some roasted vegetables.  Be VERY careful when you try the pepper as we have found more often than not they are EXTREMELY spicy - and I like spicy but they're often too hot even for me!  The meat is shaved which is how all doner should be in my opinion.  It comes with a cucumber yogurt sauce on the side  which you can pour on your meal as you please.   Even my 3 year old niece who is often a very picky eater gobbled up several slices of meat (even though she'd already eat almost an entire loaf of bread).<br><br>We didn't order dessert because we were so full but the owner kindly brought us a serving of kazandibi (and didn't really provide a reason but if there is one thing I know, it's never turn down free kazandibi).  This ranks on my top 5 favorite Turkish desserts and the one at Zizi's does not disappoint! <br><br>You can tell the owner takes a lot of pride in his restaurant and knows many of the customers.  We will definitely be going back to Zizi's soon!", "pics": null}}, {"review": {"des": "Meh.<br><br>Everything was fine, nothing special. I ordered the combo. Salmon though wasn't to my liking; weird extra fishy/deep see spoiled fish taste.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yLwBGphec42iAKqwPcrydA/348s.jpg", "caption": "Combo platter with couscous. Pretty good, but getting white rice next time."}]}}, {"review": {"des": "The food is so fresh and delicious and the customer service is superb! I could eat their hummus and bread all day. The owner is always greeting you with a smile on his face and they like to throw in a free dessert too. If you need a quick, delicious, and reliable spot this is your place to go.", "pics": null}}, {"review": {"des": "Looking for a quality Turkish spot with tasty food? Head here! This place is family operated, so you know you will get the BEST customer service.  I am partial to their Turkish Doner Salad.  Best part? This place is BYOB! Because of it's friendly atmosphere, great food, and the option to drink on a dime, I totally love this place.", "pics": null}}, {"review": {"des": "Was recommended this place by my roommate. Went to get take-out without ordering ahead. Even though it took a very reasonable amount of time considering how busy it was, I was given a free soup, pita and dessert for waiting! Everything was delicious, I'll definitely be coming more regularly from now on.", "pics": null}}, {"review": {"des": "This place is great. Awesome food and a great owner. I get large orders delivered from here for parties and the owner is always super helpful with recommendations, portions, and presentation. I've never been to the actual restaurant but the food is amazing and even better the next day out of the fridge.", "pics": null}}, {"review": {"des": "Dissatisfaction and Disappointment! <br><br>The tables were dirty and the space cadet waitress didn't even bother to clean them. the owner had to run over and set her straight.  I've Never seen such lazy service. <br>The Turkish bread with sesame seeds was under cooked. The chicken Doner was Over salted, the rice was under cooked. The entrée stated that it included <br>Veggies as well. unfortunately 90%of the veggies were potatoes with No flavor.<br>I asked the server for more veggies instead of potatoes because I didn't want to Overdose on carbs. Mind you ; Bread, rice and then potatoes. .<br>The server comes back and...Guess what ?<br>She brings More potatoes.  I told her again that I wanted veggies and she just stood there and smiled clueless to what I was talking about.<br>Im Not coming back to a place where the owner doesn't care how his 1st time patrons get treated.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QluqcLvdgVLNe_4pO424Ag/348s.jpg", "caption": "Undercooked rice"}]}}, {"review": {"des": "The photos dont do it justice.  Best Turkish food I've had in Chicago.The sea bass is just like I had in Istanbul.  We order carry out from there a lot.", "pics": null}}, {"review": {"des": "This is one of my favorite joints. <br><br>This is a true family owned and operated place. The owner, his wife, and family make up the waitstaff and chief. They are all very friendly. <br><br>They make a homemade break that is just divine.<br><br>I got the zizi special and had enough for a lunch the next day. <br><br>Truly, one of my very favorite Chicago spots", "pics": null}}, {"review": {"des": "I have been here many times with my Turkish friend.<br>We are always greeted with a big smile and treated like family.<br>Food is spot on.  From the bread and moussaka to the doner kebab to the adana kebab to the kofte...everything is fresh, flavorful, and like it came out of a turkish grandma's kitchen.  And don't forget dessert: the baklava and the Kazandibi are to die for.  We will definitely be back again and again and again. Thanks Zizi!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/51Xeg8UwFxMFAYL7ySRNKw/348s.jpg", "caption": "The kitchen"}]}}, {"review": {"des": "We ordered chicken wraps and a salad to go. Broccoli and carrots for side dish. We weren't able to just purchase the wraps, they come with side dishes whether you want them or not.  Our meals were packaged in a way that spilt everything, but fortunately there was a plastic bag on the outside, paper on the inside. <br><br>The broccoli/carrot side dish was excellent. The chicken was spiced tastily in the wraps, and the chicken salad was okay.  It was just spring mix from Kroger, nothing special.  But they did cook the chicken when we placed our order. <br><br>It appears to be a neighborhood favorite place, there were a lot of post-exercise young moms having lunch here.", "pics": null}}, {"review": {"des": "Fresh and friendly. Really yummy and unique pita bread. Hummus is a little lumpy-- not bad, just FYI. Really nice presentation, even for take out. Huge portions. Good fries. <br><br>Looking forward to trying their full menu! Some neat items--- like carrot spread.", "pics": null}}, {"review": {"des": "We had a very delicious dinner tonight.<br>I ordered a full plate of doner. It was delicious. As a desert, kunefe. Amazing food...<br><br> The deserts are worth of gaining the calories.<br> <br>Kunefe, baklava and kazandibi are my favorites.<br><br>There are several different mediterranean restaurants I go to, in town. But I loved this place for 3 reasons:<br><br>1.Location is very easy, right by the redline.<br>2.Delicious and well cooked food.<br>3.Sympatethic, friendly and honest customer service.<br><br>Also I'd like to thank Zizi and service team for their hospitality tonight and they always have smiling face which I like the most.<br> <br>Hopefully will be back soon with more friends!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/K0xkhMLe-xEb002j6KV26g/348s.jpg", "caption": "Kunefe and ice cream on top. Hot and cold together. So delicious."}]}}, {"review": {"des": "Great atmosphere great food great host.. Specially the mix platter and Lahmacun is awesome and portions are so good too..", "pics": null}}, {"review": {"des": "Great service, delicious falafel wrap. The wrap wasn't pita, and was typical tortilla, and was so tasty! Plenty to share if you want a lighter lunch.", "pics": null}}, {"review": {"des": "AMAZING. The food, the service, the owner are all great. As close as it gets to authentic Turkish and Middle Eastern food in Chicago. The lahmacun (Turkish pizza) as well as all the kebabs/salads are very tasty. You can also see the kitchen from the seating area, - very clean place. The owner gave us complimentary tea and dessert, which was super nice, but we would've become regulars even if not. Highly recommended.<br><br>End your meal with Turkish coffee and baklava.", "pics": null}}, {"review": {"des": "Great place near DePaul to grab some food in the area! I highly recommend everyone gives this place a try in the area, you don't regret it! 10/10", "pics": null}}, {"review": {"des": "Amazing place! Food as good as in Istanbul and very friendly owners! Lentil soup is to kill for.", "pics": null}}, {"review": {"des": "Highly recommend this place. Try the Zizi's special wrap.", "pics": null}}, {"review": {"des": "No, no, no!!! I am definitely not going back. <br>I have never had a lahmacun for $10 and which is not the best! They \"invented\" something like double sized lahmacun, which is not. Making the dough extremely thin and longer doesn't mean it is doubled. It is tricking people. I am glad that it is not my first lahmacun experience  and so I can make the judgement and my judgement tells me not to go somewhere cares about money more than honesty. It is not the best food. It is ok food, nothing special. Service is not great. I don't know how many times my order came wrong. <br>There are a lot of Turkish restaurant/cafe in Chicago, tastier, and better.", "pics": null}}, {"review": {"des": "Food-------4.5<br>Ambience--2.5<br><br>I would have given it 5 stars, had it not been for the soggy french fries served with my amazingly delicious Chicken Doner sandwich.  (Just FYI, Zizi's french fries are made from \"real\"  potatoes.)  Too bad they weren't served hot , right out of the fryer. The chicken, was perfectly seasoned and cooked .  The veggie garnishes were fresh & crisp. The Lebanese bread it was served on was to die for.    <br><br>Unfortunately, as one astute Yelper put it, \" they haven't spent much ....on the decor\".  But that's OK.  I'm here for the food, not the decor.  A simple bud vase with a few fresh  flowers is always a nice touch, but when every table has  a vase of drooping flowers, that's not cool.  It would be better to have just a napkin, silverware & salt/pepper shaker.  86 the flower idea!  <br><br>The solution is an easy fix. With food as good as this, order online for delivery or pick up.", "pics": null}}, {"review": {"des": "Great food and service!  This was my first time here, and first time having Turkish cuisine, but I will definitely be back in the future.", "pics": null}}, {"review": {"des": "Good hearty bread abounds at Zizi's Cafe, from the pita and spiced carrot-yogurt spread that came first to the cubes of crusty bread lining our Iskender Kebab platter. The storefront on Sheffield is unassuming but the restaurant is actually quite spacious and we were staffed by a kindly young woman who dealt with our indecision with good grace. We eventually got the starter combo platter - an impressive array of textures and flavors - and the Iskender platter which I was a little disappointed by - the lamb and beef was good but not as lively in either flavor or texture as I would have hoped for from something supposedly freshly grilled. I also couldn't taste the contribution of the spicy walnut butter. Nonetheless, this was a nice quiet place with good food to have a late afternoon lunch on Saturday and I would come back to try other items on the menu.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/311zjMGY2itxAuerRfH-MQ/348s.jpg", "caption": "The starter combo platter - really good smoky roasted flavors and fresh ingredients. Big enough to be a meal for a vegetarian."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1PbTykacAqHLm3Td6Iq7Yg/168s.jpg", "caption": "Iskender Kebab platter - only good, not great."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qjLs14BrpsFxHa-H4DGHbQ/168s.jpg", "caption": "A subtly spicy carrot-yogurt spread with hearty bread"}]}}, {"review": {"des": "Zizi's is amazing. <br><br>Pretty much every Sunday night I order a caesar salad with chicken for take out. It's always available right when I walk in to pay and the salad is one of the best I've had. The croutons are absolutely amazing, dunno if they're tossed with garlic, parmesan, or what, but they're superb. The caesar dressing is homemade and it's fantastic, definitely distinguishes itself from most other dressings. <br>But the highlight - the chicken. Whoever thought of taking chicken doner and putting it on a caesar salad was a genius...a mad genius. It's superb. I could eat that chicken forever.<br><br>I've also had their kebab plates which were very good. Pretty much got the sample platter the first time that had all their meats  - the chicken, doner, meatball, kebabs, and even salmon. Everything was very good. Sizable portion as well so I took maybe 1/3 of it home. I'd definitely get it again. Some of the doner was pretty greasy, but that's the only complaint and it's a minor one.<br><br>The bread deserves a mention as well, not entirely sure what the bread is, it's like a pita but stuffed and more fluffy on the inside. It's great and the hummus they have pairs with it perfectly.<br><br>Highly recommend Zizis", "pics": null}}, {"review": {"des": "This is my go to spot, I love zizi and how friendly he is. They make their own bread, and how many places these days actually do that. The bread is phenomenal, and the carrot spread they give with it is a perfect balance of sweet, creamy, and crunchy.<br><br>Everything I have eaten has been delicious. Lentil soup I great on a cold day. Chicken doner sandwich has huge chunks of tender juicy chicken that has been roasting for probably forever. The BEST thing is the pide. It's like a 100000 times better version of a pizza. Super thin crust and stuffed with lamb and cheese. A must try.", "pics": null}}, {"review": {"des": "If you like Mediterranean, Zizi's Cafe is worth visiting for three reasons:<br>1) The food is fresh.<br>2) The restaurant has a relaxed, family-owned business ambience<br>3) They have a BYOB policy! And the owner is sweet enough to put your unopened beers in the cooler while you eat.<br><br>As far as food highlights go, the complimentary carrot spread and homemade bread is delicious! \"Carrot spread\" sounds strange, but it's essentially grated carrots mixed with a yogurt sauce. SO GOOD. I also loved the red lentil soup - deliciously spiced! I wasn't as impressed with the falafel, but it came with a nice yogurt sauce, so that helped.<br><br>Everyone here is very friendly, so if you have questions, don't be afraid to ask! They will make sure you have a great time here. :D", "pics": null}}, {"review": {"des": "The best turkish food, the owner is such s nice guy too. I went to another turkish restaurant recommended by check please and i was very disappointed because their iskander dish tasted nothing like zizi's. I crave this food all the time", "pics": null}}, {"review": {"des": "I ordered take out through Yelp, or Eat24 I think, and everything was both presented and packaged nicely.<br><br>All the food was good and really fresh. The top three dips or spreads were all served with a huge fluffy piece/loaf of bread, three in total. Sadly, due to its thickness, not as nice as other pita type breads for dipping. <br><br>Carrot Spread $4.25 - Was really garlicky but good. <br>Hummus $4.75 - I've had better, but probably just a preference thing<br>Tabouli Salad $6.95 - a little different than I'm used to, but probably just more fresh! <br><br>Zizi's Favorite Pizmahmagun Wrap $9.95 - Its huge, with lots of chicken and a strong onion presence. I would get an extra order of the yogurt sauce next time. The fries were a tiny potion and really soggy, but I expected that as it was carry out so no biggie.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/k8puXRiUjHeL3RGgrMYGEA/348s.jpg", "caption": "Carrot spread, hummus, tabouli and favorite wrap. A ton of food for $28.30!!!!"}]}}, {"review": {"des": "This place is a real gem. There's a lot of love, talent, and years of experience in this food. The ingredients are fresh, the spices are a symphony without becoming overbearing. The homemade bread is so good, you will feel a profound pity for the gluten-intolerant. <br><br>Be adventurous with the menu, I'm still working my way through it, and with each experience I become more of a believer. The service and hospitality of the staff is really warm, and it's a place you feel comfortable and attended to - not rushed in and out. Turkish people take meals leisurely.<br><br>The doner is amazing. For those unfamiliar it's a Turkish gyro. If you like meat, if you on a paleo diet, if you wanna avoid carbs, this place has lots of great options if you can avoid that bread.", "pics": null}}, {"review": {"des": "They give you complimentary bread when you sit and holy moly it's honestly some of the best bread of your entire life. I got a vegetarian wrap with fries. The servings were huge, I easily brought home half the wrap as leftovers.", "pics": null}}, {"review": {"des": "Really good, fast Turkish food. I usually get take out, but the restaurant and patio look quite nice. <br><br>The kind of big sandwiches that you can't put down once you've picked them up. Unfortunately, the fries are always limp and soggy.", "pics": null}}, {"review": {"des": "Delicious! Ordered for delivery 'doner platter' omg sooo good! Definitely will be ordering again!", "pics": null}}, {"review": {"des": "ZiZi's serves excellent Turkish cuisine at a great value! <br><br>Whether you're hungry for lunch or dinner, you are going to leave ZiZi's feeling very satisfied. When dining in, you are served complimentary bread with carrot spread. The spread is made of julienned carrots, garlic, and yogurt. It is so good that we've ordered it as an appetizer before. The bread is also remarkable and is the best tool for soaking up the delicious carrot spread. <br><br>I have had the chicken kebab, chicken doner kebab, the kofte wrap--all meals that I would definitely order again. The portions are hearty and the food is always super flavorful! I really loved the fresh french fries and the seasoned bulgur! <br><br>The prices are affordable and the restaurant is BYOB. However, there is a corkage fee ($2 per person). ZiZi's is family-owned and definitely worth supporting. This is a great place to eat and drink in LakeView.", "pics": null}}, {"review": {"des": "Best Turkish restaurant in Chicago! The food is always great with big portions. The staff is always friendly and the the owner makes sure you are satisfied with your food. I cant wait to come back here again.", "pics": null}}]}